{
    "id": "lgvjzd74roc7qxx7ywnoefx7zry3nbtw",
    "title": "Bayesian modeling of action and perception and some other stuff",
    "info": {
        "author": [
            "Konrad Körding, Northwestern University"
        ],
        "published": "June 15, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Computer Science->Machine Learning->Bayesian Learning"
        ]
    },
    "url": "http://videolectures.net/mlss2010_kording_bmoa/",
    "segmentation": [
        [
            "So today I'll be talking about basin modeling of action and perception, and some other stuff, whatever that will mean.",
            "I want to emphasize that I love interactive discussions, so I want you to actually interrupt me and I will break at least twice during the talk after ending his specific topic to take questions and then in the end, hopefully we'll have time for some more discussion.",
            "So."
        ],
        [
            "At first I will talk in the first part of the talk.",
            "I will talk about Q combination and Q combination is probably the thing.",
            "Probably one of the computational tasks that our brain is most concerned with because it's something that we do absolutely at all times.",
            "At any point of time in our lives, each of our sensors is providing us with information about the world that is out there and somehow we put all these sensors together and make sense out of the world that is around us.",
            "And of course, there's several aspects to this.",
            "These different sensors that we have, and then there's also higher level knowledge that we may have that enables us to put it together in a good way, and that is what say people like Joshua Tomar very much concerned about.",
            "At least in this first part of the faster of the Tucker will be tongue, but very simple things about things that might not even feel very cognitive.",
            "But you will see as we go through it that actually is almost a continuum from very simple Q combination tasks where you say just combine what we see with what we hear into questions that actually already feel very much like hug."
        ],
        [
            "Of science.",
            "So I'm not sure how many how many people in this room have seen Bayesian models of Q combination.",
            "Who has seen it?",
            "Who hasn't seen it?",
            "OK, great fantastic.",
            "This is great because I can actually tell you something new about it.",
            "So.",
            "I was worried that everyone would have seen that before, so.",
            "Let's, let's imagine what I what I do is the following.",
            "I clap my hands and you can see me clap my hands and you cannot 'cause also hear me clap my hands.",
            "And you might want to know where is it in space that he was actually clapping his hands and you can combine these two cues.",
            "You combine what you heard with what you sought to estimate, where it is.",
            "And of course in this case it's very easy because your visual system is just so much better than your audio system that you kind of almost exclusively rely on your visual system.",
            "In fact, your auditory system is quite bad, that those tasks and I want to demonstrate to you how bad it is.",
            "So what are we gonna do?",
            "Is I gotta go to someplace or hold on it some and then I will clap my hands and I will first ask all of you to close your close your eyes.",
            "Then I will ask you to point into the direction where you heard it.",
            "Of course, I moved before you can point to the direction and will see.",
            "So what's the distribution of directions that you're pointing?",
            "It occurs, so let's do that experiment.",
            "Anyone who feels comfortable with with this close your eyes right now.",
            "OK, and on top of it yet.",
            "OK, now permits and now everyone pointed in the direction I was clapping.",
            "I came out.",
            "If you people turn around and if you look at other peoples pointing directions you can see it has a distribution of maybe 20 degrees.",
            "Study degrees and of course some people get badly confused by the fact that is also on the on.",
            "The audio audio system so but.",
            "But this just gave you a feeling for the kind of uncertainty that's associated with auditory perception.",
            "So in a situation like that, your visual system is so much better than you can just as well ignore the auditor situation.",
            "But of course there's lots of situations where your visual system will be very bad as well.",
            "For example, if you're looking at me while you are trying to move your own hand, you're actually it's extra foville as we had in the previous talk.",
            "Extra folder vision is very bad.",
            "So in this case where you can see something can Foley at something all of a sudden the auditory signal might be quite important.",
            "So now, how should people solve those problems?",
            "So there's a way I addressed these questions that I ask, what is the computational problem.",
            "So it's a typical model level one analysis who has not heard about my level 1 yet.",
            "Fantastic, everyone has who has heard about my level 1.",
            "OK, I was just doing a quick sanity check on that.",
            "So what are we going to talk about is how we what we believe is the computational problem that the nervous system needs to solve.",
            "Then we'll talk about what's the best possible solution to that problem, and then we'll talk about how people have compared that to to the way humans actually solve those kinds of problems.",
            "So the the modeling assumption for these Q combination experiments and I should say there's many of them in.",
            "In no way am I the first 2.",
            "Ask these kinds of questions are built this kind of model.",
            "The idea is something happens at some place and there's a common and this say this is the place where I clap my hands.",
            "Now your visual system will perceive input about where it happened and your auditory system will perceive input about why it happened and each of them have sources of noise associated with it, and these two noise sources are independent of one another.",
            "So here we have the Bayesian generative model lesser position.",
            "That's nice being added to produce division.",
            "That's nice being added to produce the auditor position.",
            "So this is the generative model that we have and you can say if the nervous system wants to answer the question well, where is it that he clapped his hands?",
            "It should reverse this process and it should ask what's the most likely position?",
            "X or the?",
            "What's the position that minimizes the cost function that we have for X, given that we have a certain visual perception?",
            "This add more detail perception."
        ],
        [
            "So well, how should?",
            "How should we solve those kinds of problems?",
            "Or we can use base where we want to know is what's the probability that it happened at position X, given what our visual system tells us and what our auditory system tells us.",
            "Well, that's going to be the prior.",
            "The prior probability that it's at position X times the probability of receiving that visual stimulus given the assumption that it's at position X times the probability of receiving this auditory stimulus.",
            "Under the assumption that it is at position X, and if we assume that discussion noise and vision and got some noise on addition and that for some magical reason, there's no priors.",
            "In this case, it takes on a particular form where we can say that the best solution that we could have, or the best way how we could combine what our vision the auditory system tells us, is to do a linear way in where we take what our visual system gives us, and we weigh it with the auditory variance divided by the sum of the two of them.",
            "And we take what our auditory system gave us, and we wait with this term here.",
            "And this is very intuitive.",
            "It just means that if we if we have two pieces of knowledge, we will rely more on the piece of knowledge that is better.",
            "So if audition is very precise, then this is going to be a large value and therefore the weight and vision in addition is very precise and this is going to be small value so therefore there will be low weight, envision a high weight and addition and vice versa.",
            "So then people have tested these kinds of models in many different ways, and there's probably of the order.",
            "I mean, it has been tested in virtually any combination of two cues that you can possibly think of combining, including vision and audition, haptics, invasion, and haptics, in addition, timing tasks in many, many different tasks, and I just want to briefly food."
        ],
        [
            "So two studies that have been doing that, one of them is ugly and bar.",
            "And then what they've done in their study is more or less exactly what I've just done with all of you which is clapping to the hands.",
            "The only thing is they have to have a monitor where they have loud speakers so that they can make the auditory stimulus come from different directions, and then to make it so that people can't just rely on vision, they just blurred vision.",
            "So instead of showing you a dot they show you some kind of agoston big cloud.",
            "So it's, uh.",
            "Quite a bit like that and then here comes the sound and you see that thing perfectly synchronous to one another and what they do is they match the size of this caution cloud so that vision is just as precise as addition, and then they use standard procedures to measure how precise vision is and how precise audition is so that they can well match it.",
            "And this is just the results figure from there here for many many different subjects.",
            "What they did is they.",
            "Calculate the localization error for vision alone and for additional on, and then if you have both of them and what the prediction is from this space in model and they find that this basic model is very good at predicting that they also find that.",
            "That we actually benefit from combining the two of them so it turns out that if we have two queues and both of them are equally good, the maximal advantage that we can get from combining the two of them is an improvement in the in the average error of 1 / sqrt 2.",
            "So what they have here vision alone, they in arbitrary units.",
            "Here was something like 1.4 in both cases.",
            "And actually if they then combine it is almost perfect.",
            "That one which is 1 / sqrt 2 of the first one.",
            "So in this case, so there's two aspects that this figure we can predict here.",
            "One of them is how much people rely on vision.",
            "How much people rely on addition, and I should add one thing the invention made these experiments possible is that people came up with the idea to show 2 stimuli to sort of cheat in this experiment so they don't show version.",
            "In addition, at the same place, but they showed it slightly different places.",
            "And then they see how much people can look to see how much people rely on them by seeing where between those two stimuli on average people in the queue, what they perceive, and you can see it goes.",
            "So one of them is, they can predict how much people will rely on each of the two queues.",
            "The other thing that they could predict is how much the variance in their estimates will get better.",
            "And this general finally has been verified in many many diff."
        ],
        [
            "Situations so many, in fact, that I will just very briefly mention one more of them.",
            "This is this is one of the earliest papers that championed this approach, where you have two slightly different cues and see how they are combined, its own stand bank from 2002.",
            "In this case they had, they had a robot and the robot can simulate a virtual object.",
            "The way the robot does that is, you hold one thing fixed with your hand, and then you have a robot that is attached to your finger.",
            "And as soon as you touch this virtual object, the robot simulate will produce forces, so you can move freely here and as soon as you touch it, the robot will produce counter forces.",
            "So so this procedure you can get some idea of how big the object is by feeling it, and at the same time you can.",
            "They provided visual information about it.",
            "And again there would be the problem.",
            "That vision would just be much too precise, so therefore they use this complicated 3D stimulus where they just have a small number of dots with a lot of noise on.",
            "And since we dimensional space making it very hard to."
        ],
        [
            "Again, what they did, what they did there is then they vary.",
            "Very the quality of the visual stimulus, so they either showed it so that vision actually was very good or they degraded.",
            "The quality of vision and what you see here.",
            "0 means pretty good vision formation and worse and worse and worse.",
            "And on that axis you see the weight that they put innovation and as should be expected for good visual stimuli there mostly rely on vision and for very bad visual stimuli there mostly rely on haptics.",
            "And the model of this optimal Basin integration scheme is very good at predicting the data that they get from there."
        ],
        [
            "Now that's that's a certain range of situations where this model was incredibly successful, and in many ways you can say that as it comes to computational models of human behavior, this is probably at least among the models that I know of.",
            "This is probably the single model that explains most data, because the very same idea applies to the combination of virtually any set of two pieces of data, as long as they are.",
            "As long as the queues are similar to one another, so so this is such a thing, it's important to to know if that research it's it's just a beautiful case where you have a very simple idea which is just.",
            "You have two queues, they relate to the same thing.",
            "They have independent Gaussian noise and we can then predict how the nervous system should put them together and the nervous system is very close to the optimal solutions to it."
        ],
        [
            "So, and I I should just here, so here's a.",
            "Here's a very incomplete list of people have done experiments that model that looked at how good this model is that fit in the data.",
            "I could relatively easily fill several slides in this font of people that used exactly this kind of model, or variants of that model to predict how."
        ],
        [
            "People come and choose.",
            "Now the model generally is very good at dealing with."
        ],
        [
            "Situation, but now imagine we're in this situation where you have a visual stimulus at some position and you have an audito stemness at a very dissimilar position, and you've probably all been in this situation.",
            "So if you go to the park and at least in Chicago in summer, we have these outdoor movies.",
            "And so you go to the outdoor movie Ann.",
            "If you're lucky, and if you're in front of the screen, it looks like it's the actors on screen that they're talking.",
            "But if you if you end up going too far to the sites of the screen.",
            "It starts that it no longer feels like the actor on screen is talking, but that in fact the loud speakers talking, as long as it's within the within a small range, it fills us.",
            "Really it's coming out of the mouth of the of the actor and so this means that this model that we use, the generative model that we used for this isn't the right model.",
            "And and if we think about it, we can't believe in that generative model.",
            "It says whenever we perceive two things.",
            "We assume that they come from the same place and then of course it doesn't well model the way we understand how well there's lots of things happening at the same time.",
            "For example, here I'm in a room full of people and if I hear something I can't account for me.",
            "It's not that all of you are sitting in the middle and all your noises emanating from then all your faces are moving in the middle.",
            "No each of you is an object by itself.",
            "So well.",
            "This so there's something obvious missing from it, which is.",
            "There are many in many real world situations, there's more than one source.",
            "If of potential stimulation.",
            "Well, So what we did here?",
            "What we do here is we then take the most simple model that has the expressive power to deal with those situations where of course we could get it.",
            "We could go a lot further in, combine it with models of a."
        ],
        [
            "Cognitive type nature.",
            "But let's say the model that we were there we should rather believe in should be a model of this kind.",
            "This is still much too simple, but it goes a big step into the right direction where we can say, well if there's an odd eterna visual stimulus that happen at the same time.",
            "It might be that they actually come from the same place, but there's also the possibility that just two completely independent things happened and I should say that there's a bunch of people that have recently.",
            "Published papers in the general direction so, but of course now if we want to make this a real generative model, we need to start with an assumption of how often each of these would happen in the real world.",
            "And of course, in reality this would depend on the situation and environment which in which we are.",
            "For example, if we are in a crowded environment, it will happen more often than two things happen randomly at the same ponder at the same time.",
            "But in a given experiment we can say we can in first approximation say well, there's a sudden prior probability of this happening.",
            "And the sudden prior probability of that happening, and then we have a generative model where we have one variable that decides if it's going to be this or this, and then in each of these models we have the usual usual basin."
        ],
        [
            "Modeling.",
            "Now, well, what we need to do here is we need to calculate how likely is it that the two pieces of knowledge that we have come from the same source and how likely is it that they come from independent sources?",
            "And for that we can use Basil.",
            "The probability that they have a common cost given what our vision our auditory system tells us is the prior probability that there's a common cost.",
            "This is if you want how often do things if two things happen at the same time, how often do they come from the same place times the?",
            "Probability of getting this combination of vision, auditory input.",
            "Given the assumption that there's a common costs divided by the partition function to make sure that the probability of adessa common costs plus the probability that there's not a common cost, will add up to one.",
            "So now if if we deal with these models that aren't, that aren't simply gosh, and it actually makes a difference, what difference would kind of cost functions we assuming, so it turns out that if you just have two Bostons Anja come gossom causes and you combine them in the standard way, then then the cost function doesn't matter as long as you use anything reasonable.",
            "So means quite hours just gives you exactly the same estimator as the mean absolute.",
            "Value and any any other of the meaningful estimate.",
            "This give you the same results in such for such a generative model which is a mixture model where two things either come from the same place or not, it actually makes the difference and what we will assume for the moment here is that the cost function that people uses the mean squared error, and then we can derive what's the best solution for this."
        ],
        [
            "This trust problem.",
            "And let's see what the best solution is.",
            "What would be the best solution if someone actually told me that the two of them have independent causes so that the audit and the question that we want to answer is now, where does the auditory stimulus come from?",
            "We don't care about the visits to miss, we just want to know where the auditory stimulus comes from an if someone told me for sure that they have nothing to do with one another, the best thing I could do is I would just ignore the visual, so the blue is the vision, likelihood register auditory likelihood.",
            "I would just ignore what vision tells me and go with the best estimate from my audito system.",
            "Now imagine."
        ],
        [
            "Someone told me that there was a common cost for the two of them.",
            "Well, what would I do now?",
            "I would then do the Bayesian Q combination as we had it before we take the auditor like Vision, likely auditor like that multiplied together gives me the green posterior.",
            "This is my best estimate in this case."
        ],
        [
            "Well, now what's the best solution if we have the mean squared error as cost function?",
            "In this case, it turns out and I want us to the math.",
            "Now, if anyone's interested, I'd love to go over it afterwards.",
            "Is that the best estimate?",
            "Is the probability that there's a common costs times the best estimate under the assumption that there's a common costs plus the probability of there not being common cause times the best estimate under the assumption that that's not a common cause?",
            "Those two we had on the previous slide, and this is what we had the equation for three slides ago.",
            "Anthem now.",
            "So now we have a model generative model for how things belong together or not.",
            "We have.",
            "We know what the optimal solution would be fought and now is always in or like is typical and level models.",
            "We will now look at how people actually do it and then we will compare.",
            "Compare how people do it with help."
        ],
        [
            "People should be doing it, so here we have some beautiful experiments from the sugar lab.",
            "Subject is sitting in an empty and dark room there, so this loud speakers all around the subject.",
            "There's a ladies all away around the subject and not in every trial.",
            "One of the ladies comes on and the loudspeaker produces short bus stuff, white noise, so it doesn't.",
            "Yeah, doesn't sound like this, right?",
            "Now those two people are supposed to combine in that task is show me weather auditory stimulus is coming from.",
            "Ignore what you've seen and their secondary task, and in fact they get there.",
            "Given a laser pointer and as opposed to mindless, actually serve works.",
            "But now it works, so they're supposed to show with the laser pointer where they heard the sound to be coming from, and there also supposed to say, did the two of them come from the same place?",
            "So this is what we have on the right hand side on this axis, with the spatial disparity.",
            "This is how far away from the auditory stimulus is the visual stimulus right means that it's a positive means is to the right hand side of the visual stimulus.",
            "Negative means it's to the left hand side.",
            "On this axis you have the percentage of times where people indicated that there's a common cost for the two of them, and what you find is that with small spatial disparity.",
            "The people tend to frequently say that there's a common costs .7, almost the probability, and with increasing spatial disparity they say so less less and less often.",
            "And in rat you see the model predictions of the model that we just talked about.",
            "In fact, it's not completely predictions.",
            "There were a few parameters that needed to be fitted."
        ],
        [
            "Yes, that's what I wanted to say about this now.",
            "The next thing that they did is."
        ],
        [
            "Oh yeah, no.",
            "Actually I wanted to explain the intuition behind it.",
            "If vision auditory stimulus are close to one another so that small spatial disparity in this case, you can easily explain the data by assuming they came from the same place in the same places somewhere close to them.",
            "If they are very far away from them, you would under the common cause model.",
            "You would need to assume that both of them were affected by very large levels of noise, and this is very unlikely about from the common cost model, whereas if you have the not a common cost money there far away from one another, well, it just means that one of them came from here, the.",
            "No one came from there.",
            "Will you show this slide to show that the basement failed so that it fits?",
            "Because I mean it virtually all the points are outside the airport for the prediction is significantly off for Forza 6 point.",
            "Yeah, after this is a slide to show that the base is good or bad.",
            "Yeah, you're absolutely right.",
            "It turns out that the model had sweep sweep free parameters that we actually fitted to three different graphs.",
            "Continue Miss fulsom.",
            "This is a very good point.",
            "Why don't you wait two slides so So what we did here is we fitted the model to two significant size of a data set of different things where this is just one of the projection of the data.",
            "If you want.",
            "So yes, if this was the only thing that the model would explain, then the three parameter fit that gives this fit would actually be very bad.",
            "We understand where the differences are coming from between the model and the data, but I won't have time to go through that, yes?",
            "Mental model.",
            "Change any to do repeated experiments with the same person.",
            "Yes.",
            "Together they can say so.",
            "This is a very good question.",
            "He asked, doesn't want the beliefs of the person about the kinds of models that they should assume changed.",
            "If we take them to the experiment for a long time and in many ways they should, because you can say well in this experiment the visual stimulus and audio toast images are not dependent on one another, so therefore it would be the absolutely right thing to learn to completely ignore the visual stimulus.",
            "So that's one way of thinking about it.",
            "At the same time, that's the other way of thinking about it, which is you live your entire life in a world where visual and auditory stimuli are highly correlated in position with one another.",
            "Therefore it's going to be difficult for you to overrule this very strong prior that you have about it.",
            "So tons of them in these experiments, if you analyze, say, early behavior relative to late behavior, you don't really see see any significant differences.",
            "But, but there are other factors that you can use.",
            "You can tell people they really don't have anything to do with one another, and then they will.",
            "So assign it's as if they then assign lower probability to.",
            "There being a common costs and you can, you can take.",
            "You can introduce little delays between them and that too has an influencer.",
            "There's many, many factors that influence the effective value of the of the P common in this case.",
            "Sunesson Alexi."
        ],
        [
            "If if we can have more data based on the same model and so here we have here, the next thing that they plotted is they plotted the game.",
            "So now what?",
            "So what does the game mean?",
            "Again off 100% would mean that if audition is here and vision is here, audition will be perceived to be over there where the visual stimulus is, so 100 would just mean we go with vision, then a gain of zero would mean we just ignore.",
            "We just ignore this system, so we just go with the auditors to massive audition is here.",
            "We just go for it.",
            "We might have nice, but on average we go there again of minus 100% would be if business here audition is here then for some reason our cognitive system pushes it over there.",
            "So what they then did is that took all the trials and that divided the trials into two classes of trials.",
            "One class of them were the ones where people had said that there's a common costs for the two of them, and the other ones were the ones where they said there's another common cause.",
            "Now, in those cases where they said there's a common costs, it turns out that the game is close to 100%.",
            "Which is pretty much what we should expect, because if you if you'd know that the two of them come from the same place, an vision is much better than audition, while then you should better go with vision.",
            "So Salvation is very close to.",
            "So if they say there's a common cause, the game is close to 100%.",
            "Now if they say that the game is that there's another common costs, then actually the game goes to be quite negative.",
            "Very negative effect.",
            "So that means that relief if audition is here and vision is here.",
            "Looks like people perceive it here.",
            "So some people, after seeing that said well, there must be some cognitive bias effect.",
            "If you see something it's pushing you away.",
            "I mean, it's it's probably not likely because the Bayesian model shows it as well.",
            "But what is wrong with the analysis?",
            "Why?",
            "Why is there not a cognitive bias?",
            "Why does it look like there, Sir?",
            "We are bias?",
            "And where does this effect come from?",
            "Why does the game go negative?",
            "Who knows why the game goes negative?",
            "OK, why could the game be negative?",
            "Well, it turns out that here we have something that's called the selection bias.",
            "It's something that economists accurately aware.",
            "So what we've done?",
            "We have one piece of knowledge, which is what our our nervous system, the inputs, are.",
            "Nervous system.",
            "Listen an addition and we answer 2 questions based on that.",
            "One of the questions is do they belong together and the other one is?",
            "Where does it come from?",
            "And if we answer 2 questions with the with the with the same inputs, any noise and the impossible induced fake correlations between the two of them that are that are just because the because the input is shared, it's called the selection biased, and let me let me highlight how that comes about."
        ],
        [
            "Um?",
            "So imagine that that we keep repeating the same trial over and over and over again.",
            "The auditory stimulus is always hits there.",
            "The visual stimulus is always at 5, so gain of zero would mean just perception in the middle again of one would mean that I always perceive it it fast, but now it's known that vision is pretty precise, so our visual stimulus system almost always tell us something very close to five.",
            "But now we know that audition is very noisy, so sometimes I will perceive with at 4.",
            "Sometimes I perceive it at minus 4.",
            "Now, under which circumstances will I say that they belong together well?",
            "It depends on the distance between them on their spatial disparity.",
            "Vectors to one another will say yes they belong together there for anything that will go into the pink region here will be called.",
            "Common costs, so now what we have is we start with this Gaussian distribution centered at zero, but we cut away the right half of it after we cut away the right half of it, then mean is very negative.",
            "So even if there's some Bayesian corrections that we do to it because we have the selection bias, we will still get their heavily negative value.",
            "And this is where this effect is coming from.",
            "And this is actually very important when you do data analysis in cognitive science on your science or many other domains.",
            "Which is if you say you have a monkey, you do fMRI like you have a human being.",
            "You do fMRI and you measure.",
            "If they say it was moving to the left or to the right and say you have a stimulus that isn't moving into either direction.",
            "Well, it turns out that there's noise in the perception of movement and this noise is being shared between the part of the.",
            "Brain that decide if it's going left or right and the part of the brain that you actually record from.",
            "So if you see that there is a correlation, people have often concluded while that means that this is the brain area that's doing the decision, no, as long as it just means it's a brain area that sharing the same input that is being used for the final decision.",
            "So it's something that one needs to be aware of and something that crops up pretty much wherever you do experiments where you answer more than one question, one question at the same time, let me give you a beautiful example of selection bias.",
            "It's it's known that golfing is the most dangerous spot ever.",
            "The probability of dying in a given year if you play golf is dramatically higher than if you don't play golf.",
            "OK wait, why is that?",
            "Yeah, exactly.",
            "It's old people tend to play golf.",
            "Young people don't tend to play golf nearly as much and therefore conditioning on you.",
            "Having told me that you play golf, you the probability that you die is much higher, but that's because there's a common causal reason for it.",
            "It's not that one of them causally produces the other one."
        ],
        [
            "Now the last thing is the same model with the same parameters can also.",
            "You can try and predict the standard deviation as a function of spatial spatial disparity.",
            "Now coming back to the question, why is it that the model doesn't do a perfect job on each of the graphs?",
            "There's some systematic variation between what the model does and how the data looks like.",
            "Well, it turns out that what people do probably isn't quite as simple as we as we assumed here.",
            "So it turns out that there's two strategies that people could have an people, and it looks like subjects are doing a mixture between the two of them, and we assume that they do something that they do, so we assume here that people minimize the mean squared error in the estimates, which requires them to equally consider the two interpretations, or all of each of them waited by the prior by the by the posterior that they have.",
            "Whereas there's another possible to wear.",
            "People could just look at it, decide for themselves, do they belong together, and if there be longing to belong together, they treated as if for sure they belong together.",
            "And if they say they don't belong together, they treated As for sure they don't belong together and it turns out that human behavior probably is somewhere in between and it's a big debate in the Q combination literature at the moment where some people say while you go with what's more, what's mostly with the structure interpretation, it's more likely another say, well you consider each possible structure.",
            "Of course, considering each possible structure gets to be very complicated.",
            "If you're in big spaces, say look at the scene like that, I could have any number of structure interpretations an it's exponential in the number of things that they can construct the scene out of, and so in some sense it might become.",
            "It probably becomes intractable if we want to really consider each possible interpretation of everything.",
            "Good any questions about this path?",
            "Yes.",
            "The fix to the data what?",
            "Thanks, the prior sleeping.",
            "Also.",
            "Use.",
            "I think this is so, so if I remember it right, do you get a pretty low probability for them not belonging together and but effectively this doesn't have so much of an influence?",
            "Because as soon as you move the two stimuli away from each other, the probability that they come from a common cause goes goes down like a essentially like a gosh.",
            "And that means for big distances it starts going down very, very fast.",
            "This is somehow wrong because the.",
            "Through Manhattan.",
            "I'm not.",
            "The way people should go into the experiment is with the with the relevant or like.",
            "The best way from my perspective for them, go to into into.",
            "It is with with an understanding of how often synchronous events happen in their typical environment.",
            "So one half 1/2.",
            "Yeah, that's the information from information theory consists can say it's none formative prior, but we do have information, which is that if we are in an essentially empty black room.",
            "The Maxi the world is rather sparse, so there's very few events, and because there's very few events, the probability that two random events aligned at the same time is very small.",
            "So in all likelihood, I think no one has done these experiments.",
            "But if you if you take the same experiment and put them into a crowded environment so you just play lots of irrelevant and blinking, Eli dies all around it, you will probably find that people what sign higher probabilities to the two of them being unrelated to one another.",
            "But yeah, good question."
        ],
        [
            "Good now in fact, how long have I been talking?",
            "So fine so I didn't get the initial time.",
            "40 minutes 40 minutes great.",
            "Good, So what we what we did next is is we then set well maybe we could find effects of that during movement because what my lab mostly does is we study how people move and the impact uncertainty on the way they move.",
            "Ultimately, the reason why this is important is, I mean we have a tation Institute and what we would like to be able to do is when patients come in for physical rehabilitation we'd like them to learn things fast.",
            "Therefore we want to understand how people laugh and if these calls are infants.",
            "Ideas are important and we should be able to find reflections of that in in rehabilitation relevant domains.",
            "And here's one of them.",
            "So what we do is we do the following experiment.",
            "People always start with the hand at some place and they go right Watts and they don't see their hand.",
            "It's a typical movement experiment, but they see occurs at the end.",
            "And of course we're cheating everyone.",
            "Doing psychophysics is cheating, so they started someplace they move their hand and then instead of showing them because they wear their fingers, we move the cousin in depth and then we will be looking at is.",
            "So what we expect people to do is they will estimate weather hand really is, and there are two queues.",
            "The vision information from the cursor.",
            "And they have the proprioceptive information, which is where, based on what all their sensors in their arm tell them where they think their hands should be."
        ],
        [
            "And what we see here is very simple analysis.",
            "We use different values for the visualist disturbance minus 8 centimeters, so that's a pretty big shift.",
            "So you move 20 centimeters and then you find the cursor here.",
            "So it's pretty unbelievable.",
            "And then we use 4 centimeters, 2 -- 1, zero 1248 and every single blue dot.",
            "We added a little bit of jitter in this axis just so that you can see the raw data an every single dot is 1 trial and you find that there's some distribution and bless you might already see the average cluster.",
            "So this is the deviation at the next trial.",
            "So we we introduced this top on one trial and we see how they move on the very next trial."
        ],
        [
            "And he see the data including the model fits, not the model is exactly the same model that I explained to you before.",
            "The only thing is that we assume that learning is linear in your estimate of the error, and the estimate comes from doing Q combination.",
            "And here compare that with where you want to be and we of course we want them if they manage to go relatively close to straight.",
            "And here we have a link, we have the influence of the perturbation on one.",
            "Trial on the next trial.",
            "Two trials later, three translator for translator and you see, we have very small or pretty small error bus and we very clearly have this nonlinear function here.",
            "So it appears as if causal inference plays a role for motor adaptation there.",
            "Now, what is what makes it interesting is that this office in new approach to rehabilitation, because you can say, well, we learn linear in the size of the hour.",
            "So normally we should learn better.",
            "My hour is larger because if you make the hour very large it starts being unbelievable and therefore you will no longer learn if we can.",
            "If we can effectively estimate that for the patience we can make sure that the hours that we give them myself in the sweet spot where they still learn a lot.",
            "But it's still in the.",
            "Range that is believable for them.",
            "So, just to summarize that it appears that for motor that that causal inference in two combination also is reflected in the way people learn to move or how people adapt."
        ],
        [
            "Captain Movement now what's the essence of causal inference?",
            "Well, you can say it's like a noisy identity relation.",
            "Probably the two.",
            "What it says in our formulation and if we just reformulated it differently, is probably the two queues come from the same place.",
            "So it's a noisy identity, and if they don't come from the same place, they have nothing to do with one another.",
            "Now what the next part of the talk will be like.",
            "The next topic will be about is a generalization of that to noisy inequality's where you can say probably this object is in front of that object."
        ],
        [
            "And we will have two different calls.",
            "Interpretations of that.",
            "So we will be talking about depth perception or depth perception has a very natural inequality relation between things.",
            "If you see my hands here and you're back there in the back, roll, your disparity system is in no way able to distinguish the difference between these two.",
            "But yet, if you see something like that, you will be absolutely positive that my right hand is in front of the back end.",
            "And it turns out that this is actually one of the most powerful cues, so it's called an ordinary Q, and it's one of the most powerful queues.",
            "If you want to pass natural scenes, and that's a beautiful demonstration of that.",
            "Who has seen pseudo scopes?",
            "Pseudo scopes, so the wave sooner scope boxes you take everything that you're right ISIS and you give it to the left eye.",
            "You take everything that your left eye sees you give it to your right eye.",
            "Otherwise, everything stays the same, but now you see there's this big problem, which is everything which normally another system would recognize as being close to you actually is further away, and everything that's further away is closer to you, so you totally involved all disparity cues, so everything is just in exactly the wrong direction and and you imagine that it's really difficult to see anything with it.",
            "Who thinks it's really difficult?",
            "Who thinks it's really easy?",
            "I love thanks to them, not intuitive, so it turns out that if you look into that thing, you don't even see the difference.",
            "It looks like you're looking at a 3D image with everything fine and there's something limb puzzling.",
            "If you look at it, but you don't usually four in.",
            "I'm talking bout about typical real world scenes.",
            "It's very, very different if you give them just two dots in different death or stereograms.",
            "These things are very very different.",
            "But if you just give them an image of the real world, it turns out that you don't even recognize the difference and the reason why this is so is just you have all this high level knowledge about it.",
            "You know that shares happen to be on the ground plane in some normal way.",
            "Everything is everything.",
            "If I look at a room like that each each of the rows is partially overlapping with with the backcross.",
            "So therefore if you want the information that I have in these audio cues is much more useful.",
            "Then the information that I have otherwise, and that's why.",
            "But the interesting thing is if you look at sudo scope images, it's enough to turn on the perception of depth.",
            "You feel like it's a depth image because photographs is the typical case where where there's no deaths in it and our brain knows photograph, so it doesn't feel like it has real depth, but sooner scope images really feel like they have real death.",
            "So in any case, this is just the introduction to it.",
            "What we what we will do is we will.",
            "We will have a visual scene that is going to look like that an for a visual scene.",
            "That's going to look like that.",
            "You can say there's two interpretations.",
            "One of them is that there's two discs, a small disk in a large disk with a small disk being in front of the large disk and partially overlapping it.",
            "Alternatively, you can say, well, lesser PAC man and the small disk.",
            "And of course you can say Pacman sack kind of ran this Walt and objects that overlap with other objects.",
            "Pretty frequent, and then we've been running."
        ],
        [
            "Second, physical tests with it.",
            "The way the second physical tests look like is the following.",
            "You always have a display that more or less looks like that you have one big dark desk.",
            "Here you have a small Gray disk here an every trial people just adjust this Gray disk so that it appears to be at the same depth as the right disk.",
            "The only thing that we very index fund is the depths of the of this dark grey disk.",
            "And now you can.",
            "You can intuitively see the idea what's going to happen if the two of them are very far away from each other.",
            "The Black Back desk should have no influence whatsoever, because your your perception of disparity will be enough to just know it's in front of it now as it gets closer in, the likelihood function start overlapping.",
            "This ordinary constraint will get to be important, and ultimately you expect it to.",
            "Then the back disc in your perception to start pushing the front disc ahead of each other.",
            "And if you go too far, you're in fact expected to pop back out."
        ],
        [
            "And if we look at the.",
            "At how the likelihood functions would look like in most Q combination experiments.",
            "People behave as if all the likelihood functions they have available, out of caution shape.",
            "In this case, we get likelihood functions that actually look like cumulative gosens error functions, and the reason for that is if it's very far away, well, that's perfectly compatible with what I see if it gets close to it.",
            "This starts getting incompatible.",
            "So if the probability that there there of packmans would be 0, the likelihood function would look like that, and the width here is just uncertainty that I have in my depth perception.",
            "An if they if we then stop introducing some probability for PAC man, it will start looking like this.",
            "And if there's only PAC man's in the world than the lecture function gets to be completely flat."
        ],
        [
            "Infinite."
        ],
        [
            "Six comments, in fact, I should briefly say a little more about the experiment.",
            "If anyone can free fuse here, this is how the stimuli look like.",
            "So we give this depth information, but just having a big cloud of dots with a little bit of nice little bit of noise on there.",
            "And if anyone doesn't know what free fuse means is you look if you squint a little bit so that these two images cover the same space in your visual field and all of a sudden you will see you will see a 3D image."
        ],
        [
            "And we just just very similar to how constant banks did it.",
            "We add noise and that produces two conditions, a low uncertainty condition where both discs are pretty well visible and the high uncertainties situation where they're relatively invisible and we expected this ordinal Q will be more important in the case where we have high uncertainty."
        ],
        [
            "I'm here stand how the data looks like.",
            "Here's the depths of the occluding object, and here's the bias that people show in the depths of the Gray disk, and you see, as expected.",
            "At first it has no influence in the Sun by assisting with walking.",
            "This is preliminary data into the high uncertainty case.",
            "The back disc is morphing effect and in the low uncertainty case and in the experiment we we couldn't go to extreme enough versions so that it would actually pop, so it's just.",
            "That the probability for these kinds of PAC man's in the world is just so unlikely that we can get people to do that.",
            "We will replicate the same experiments, putting the small disks in the middle of the big disk, which should allow the pop out is sort of like the pop back to happen because it turns out that there are a significant number of disks versus central hole in the real world.",
            "So the prior probability for that should be much larger."
        ],
        [
            "So let me skip over this so you can say here we have a generalization of the basic causal inference idea that it's a noisy inequality and probably 1 depth is larger than the other one.",
            "I want to add a little bit of a generalization to that, so this here we dealt with a relatively simple case they belong together or not, or one of them is in front of the other or not.",
            "In reality, of course we should deal with real world problems, which is a scene like this where there's many different objects and in principle one could estimate these.",
            "These causal inference for depth estimation things by allowing a computer vision system to effectively maintain proposals of an arbitrary number of objects.",
            "And it could then propose to add new objects to the interpretation to the scene or in the Hill, eight others.",
            "And we could do building Markov chain Monte Carlo sampler to deal with promise of that kind.",
            "Is the end of the part of the talk where was going to talk about 'cause the inference?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So today I'll be talking about basin modeling of action and perception, and some other stuff, whatever that will mean.",
                    "label": 1
                },
                {
                    "sent": "I want to emphasize that I love interactive discussions, so I want you to actually interrupt me and I will break at least twice during the talk after ending his specific topic to take questions and then in the end, hopefully we'll have time for some more discussion.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At first I will talk in the first part of the talk.",
                    "label": 0
                },
                {
                    "sent": "I will talk about Q combination and Q combination is probably the thing.",
                    "label": 0
                },
                {
                    "sent": "Probably one of the computational tasks that our brain is most concerned with because it's something that we do absolutely at all times.",
                    "label": 0
                },
                {
                    "sent": "At any point of time in our lives, each of our sensors is providing us with information about the world that is out there and somehow we put all these sensors together and make sense out of the world that is around us.",
                    "label": 0
                },
                {
                    "sent": "And of course, there's several aspects to this.",
                    "label": 0
                },
                {
                    "sent": "These different sensors that we have, and then there's also higher level knowledge that we may have that enables us to put it together in a good way, and that is what say people like Joshua Tomar very much concerned about.",
                    "label": 0
                },
                {
                    "sent": "At least in this first part of the faster of the Tucker will be tongue, but very simple things about things that might not even feel very cognitive.",
                    "label": 0
                },
                {
                    "sent": "But you will see as we go through it that actually is almost a continuum from very simple Q combination tasks where you say just combine what we see with what we hear into questions that actually already feel very much like hug.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of science.",
                    "label": 0
                },
                {
                    "sent": "So I'm not sure how many how many people in this room have seen Bayesian models of Q combination.",
                    "label": 0
                },
                {
                    "sent": "Who has seen it?",
                    "label": 0
                },
                {
                    "sent": "Who hasn't seen it?",
                    "label": 0
                },
                {
                    "sent": "OK, great fantastic.",
                    "label": 0
                },
                {
                    "sent": "This is great because I can actually tell you something new about it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I was worried that everyone would have seen that before, so.",
                    "label": 0
                },
                {
                    "sent": "Let's, let's imagine what I what I do is the following.",
                    "label": 0
                },
                {
                    "sent": "I clap my hands and you can see me clap my hands and you cannot 'cause also hear me clap my hands.",
                    "label": 0
                },
                {
                    "sent": "And you might want to know where is it in space that he was actually clapping his hands and you can combine these two cues.",
                    "label": 0
                },
                {
                    "sent": "You combine what you heard with what you sought to estimate, where it is.",
                    "label": 0
                },
                {
                    "sent": "And of course in this case it's very easy because your visual system is just so much better than your audio system that you kind of almost exclusively rely on your visual system.",
                    "label": 0
                },
                {
                    "sent": "In fact, your auditory system is quite bad, that those tasks and I want to demonstrate to you how bad it is.",
                    "label": 0
                },
                {
                    "sent": "So what are we gonna do?",
                    "label": 0
                },
                {
                    "sent": "Is I gotta go to someplace or hold on it some and then I will clap my hands and I will first ask all of you to close your close your eyes.",
                    "label": 0
                },
                {
                    "sent": "Then I will ask you to point into the direction where you heard it.",
                    "label": 0
                },
                {
                    "sent": "Of course, I moved before you can point to the direction and will see.",
                    "label": 0
                },
                {
                    "sent": "So what's the distribution of directions that you're pointing?",
                    "label": 0
                },
                {
                    "sent": "It occurs, so let's do that experiment.",
                    "label": 0
                },
                {
                    "sent": "Anyone who feels comfortable with with this close your eyes right now.",
                    "label": 0
                },
                {
                    "sent": "OK, and on top of it yet.",
                    "label": 0
                },
                {
                    "sent": "OK, now permits and now everyone pointed in the direction I was clapping.",
                    "label": 0
                },
                {
                    "sent": "I came out.",
                    "label": 0
                },
                {
                    "sent": "If you people turn around and if you look at other peoples pointing directions you can see it has a distribution of maybe 20 degrees.",
                    "label": 0
                },
                {
                    "sent": "Study degrees and of course some people get badly confused by the fact that is also on the on.",
                    "label": 0
                },
                {
                    "sent": "The audio audio system so but.",
                    "label": 0
                },
                {
                    "sent": "But this just gave you a feeling for the kind of uncertainty that's associated with auditory perception.",
                    "label": 0
                },
                {
                    "sent": "So in a situation like that, your visual system is so much better than you can just as well ignore the auditor situation.",
                    "label": 0
                },
                {
                    "sent": "But of course there's lots of situations where your visual system will be very bad as well.",
                    "label": 0
                },
                {
                    "sent": "For example, if you're looking at me while you are trying to move your own hand, you're actually it's extra foville as we had in the previous talk.",
                    "label": 0
                },
                {
                    "sent": "Extra folder vision is very bad.",
                    "label": 0
                },
                {
                    "sent": "So in this case where you can see something can Foley at something all of a sudden the auditory signal might be quite important.",
                    "label": 0
                },
                {
                    "sent": "So now, how should people solve those problems?",
                    "label": 0
                },
                {
                    "sent": "So there's a way I addressed these questions that I ask, what is the computational problem.",
                    "label": 0
                },
                {
                    "sent": "So it's a typical model level one analysis who has not heard about my level 1 yet.",
                    "label": 0
                },
                {
                    "sent": "Fantastic, everyone has who has heard about my level 1.",
                    "label": 0
                },
                {
                    "sent": "OK, I was just doing a quick sanity check on that.",
                    "label": 0
                },
                {
                    "sent": "So what are we going to talk about is how we what we believe is the computational problem that the nervous system needs to solve.",
                    "label": 0
                },
                {
                    "sent": "Then we'll talk about what's the best possible solution to that problem, and then we'll talk about how people have compared that to to the way humans actually solve those kinds of problems.",
                    "label": 0
                },
                {
                    "sent": "So the the modeling assumption for these Q combination experiments and I should say there's many of them in.",
                    "label": 0
                },
                {
                    "sent": "In no way am I the first 2.",
                    "label": 0
                },
                {
                    "sent": "Ask these kinds of questions are built this kind of model.",
                    "label": 0
                },
                {
                    "sent": "The idea is something happens at some place and there's a common and this say this is the place where I clap my hands.",
                    "label": 0
                },
                {
                    "sent": "Now your visual system will perceive input about where it happened and your auditory system will perceive input about why it happened and each of them have sources of noise associated with it, and these two noise sources are independent of one another.",
                    "label": 0
                },
                {
                    "sent": "So here we have the Bayesian generative model lesser position.",
                    "label": 0
                },
                {
                    "sent": "That's nice being added to produce division.",
                    "label": 0
                },
                {
                    "sent": "That's nice being added to produce the auditor position.",
                    "label": 0
                },
                {
                    "sent": "So this is the generative model that we have and you can say if the nervous system wants to answer the question well, where is it that he clapped his hands?",
                    "label": 0
                },
                {
                    "sent": "It should reverse this process and it should ask what's the most likely position?",
                    "label": 0
                },
                {
                    "sent": "X or the?",
                    "label": 0
                },
                {
                    "sent": "What's the position that minimizes the cost function that we have for X, given that we have a certain visual perception?",
                    "label": 0
                },
                {
                    "sent": "This add more detail perception.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So well, how should?",
                    "label": 0
                },
                {
                    "sent": "How should we solve those kinds of problems?",
                    "label": 0
                },
                {
                    "sent": "Or we can use base where we want to know is what's the probability that it happened at position X, given what our visual system tells us and what our auditory system tells us.",
                    "label": 0
                },
                {
                    "sent": "Well, that's going to be the prior.",
                    "label": 0
                },
                {
                    "sent": "The prior probability that it's at position X times the probability of receiving that visual stimulus given the assumption that it's at position X times the probability of receiving this auditory stimulus.",
                    "label": 0
                },
                {
                    "sent": "Under the assumption that it is at position X, and if we assume that discussion noise and vision and got some noise on addition and that for some magical reason, there's no priors.",
                    "label": 0
                },
                {
                    "sent": "In this case, it takes on a particular form where we can say that the best solution that we could have, or the best way how we could combine what our vision the auditory system tells us, is to do a linear way in where we take what our visual system gives us, and we weigh it with the auditory variance divided by the sum of the two of them.",
                    "label": 0
                },
                {
                    "sent": "And we take what our auditory system gave us, and we wait with this term here.",
                    "label": 0
                },
                {
                    "sent": "And this is very intuitive.",
                    "label": 0
                },
                {
                    "sent": "It just means that if we if we have two pieces of knowledge, we will rely more on the piece of knowledge that is better.",
                    "label": 0
                },
                {
                    "sent": "So if audition is very precise, then this is going to be a large value and therefore the weight and vision in addition is very precise and this is going to be small value so therefore there will be low weight, envision a high weight and addition and vice versa.",
                    "label": 0
                },
                {
                    "sent": "So then people have tested these kinds of models in many different ways, and there's probably of the order.",
                    "label": 0
                },
                {
                    "sent": "I mean, it has been tested in virtually any combination of two cues that you can possibly think of combining, including vision and audition, haptics, invasion, and haptics, in addition, timing tasks in many, many different tasks, and I just want to briefly food.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So two studies that have been doing that, one of them is ugly and bar.",
                    "label": 0
                },
                {
                    "sent": "And then what they've done in their study is more or less exactly what I've just done with all of you which is clapping to the hands.",
                    "label": 0
                },
                {
                    "sent": "The only thing is they have to have a monitor where they have loud speakers so that they can make the auditory stimulus come from different directions, and then to make it so that people can't just rely on vision, they just blurred vision.",
                    "label": 0
                },
                {
                    "sent": "So instead of showing you a dot they show you some kind of agoston big cloud.",
                    "label": 0
                },
                {
                    "sent": "So it's, uh.",
                    "label": 0
                },
                {
                    "sent": "Quite a bit like that and then here comes the sound and you see that thing perfectly synchronous to one another and what they do is they match the size of this caution cloud so that vision is just as precise as addition, and then they use standard procedures to measure how precise vision is and how precise audition is so that they can well match it.",
                    "label": 0
                },
                {
                    "sent": "And this is just the results figure from there here for many many different subjects.",
                    "label": 0
                },
                {
                    "sent": "What they did is they.",
                    "label": 0
                },
                {
                    "sent": "Calculate the localization error for vision alone and for additional on, and then if you have both of them and what the prediction is from this space in model and they find that this basic model is very good at predicting that they also find that.",
                    "label": 0
                },
                {
                    "sent": "That we actually benefit from combining the two of them so it turns out that if we have two queues and both of them are equally good, the maximal advantage that we can get from combining the two of them is an improvement in the in the average error of 1 / sqrt 2.",
                    "label": 0
                },
                {
                    "sent": "So what they have here vision alone, they in arbitrary units.",
                    "label": 0
                },
                {
                    "sent": "Here was something like 1.4 in both cases.",
                    "label": 0
                },
                {
                    "sent": "And actually if they then combine it is almost perfect.",
                    "label": 0
                },
                {
                    "sent": "That one which is 1 / sqrt 2 of the first one.",
                    "label": 0
                },
                {
                    "sent": "So in this case, so there's two aspects that this figure we can predict here.",
                    "label": 0
                },
                {
                    "sent": "One of them is how much people rely on vision.",
                    "label": 0
                },
                {
                    "sent": "How much people rely on addition, and I should add one thing the invention made these experiments possible is that people came up with the idea to show 2 stimuli to sort of cheat in this experiment so they don't show version.",
                    "label": 0
                },
                {
                    "sent": "In addition, at the same place, but they showed it slightly different places.",
                    "label": 0
                },
                {
                    "sent": "And then they see how much people can look to see how much people rely on them by seeing where between those two stimuli on average people in the queue, what they perceive, and you can see it goes.",
                    "label": 0
                },
                {
                    "sent": "So one of them is, they can predict how much people will rely on each of the two queues.",
                    "label": 0
                },
                {
                    "sent": "The other thing that they could predict is how much the variance in their estimates will get better.",
                    "label": 0
                },
                {
                    "sent": "And this general finally has been verified in many many diff.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Situations so many, in fact, that I will just very briefly mention one more of them.",
                    "label": 0
                },
                {
                    "sent": "This is this is one of the earliest papers that championed this approach, where you have two slightly different cues and see how they are combined, its own stand bank from 2002.",
                    "label": 0
                },
                {
                    "sent": "In this case they had, they had a robot and the robot can simulate a virtual object.",
                    "label": 0
                },
                {
                    "sent": "The way the robot does that is, you hold one thing fixed with your hand, and then you have a robot that is attached to your finger.",
                    "label": 0
                },
                {
                    "sent": "And as soon as you touch this virtual object, the robot simulate will produce forces, so you can move freely here and as soon as you touch it, the robot will produce counter forces.",
                    "label": 0
                },
                {
                    "sent": "So so this procedure you can get some idea of how big the object is by feeling it, and at the same time you can.",
                    "label": 0
                },
                {
                    "sent": "They provided visual information about it.",
                    "label": 0
                },
                {
                    "sent": "And again there would be the problem.",
                    "label": 0
                },
                {
                    "sent": "That vision would just be much too precise, so therefore they use this complicated 3D stimulus where they just have a small number of dots with a lot of noise on.",
                    "label": 0
                },
                {
                    "sent": "And since we dimensional space making it very hard to.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, what they did, what they did there is then they vary.",
                    "label": 0
                },
                {
                    "sent": "Very the quality of the visual stimulus, so they either showed it so that vision actually was very good or they degraded.",
                    "label": 0
                },
                {
                    "sent": "The quality of vision and what you see here.",
                    "label": 0
                },
                {
                    "sent": "0 means pretty good vision formation and worse and worse and worse.",
                    "label": 0
                },
                {
                    "sent": "And on that axis you see the weight that they put innovation and as should be expected for good visual stimuli there mostly rely on vision and for very bad visual stimuli there mostly rely on haptics.",
                    "label": 0
                },
                {
                    "sent": "And the model of this optimal Basin integration scheme is very good at predicting the data that they get from there.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now that's that's a certain range of situations where this model was incredibly successful, and in many ways you can say that as it comes to computational models of human behavior, this is probably at least among the models that I know of.",
                    "label": 0
                },
                {
                    "sent": "This is probably the single model that explains most data, because the very same idea applies to the combination of virtually any set of two pieces of data, as long as they are.",
                    "label": 0
                },
                {
                    "sent": "As long as the queues are similar to one another, so so this is such a thing, it's important to to know if that research it's it's just a beautiful case where you have a very simple idea which is just.",
                    "label": 0
                },
                {
                    "sent": "You have two queues, they relate to the same thing.",
                    "label": 0
                },
                {
                    "sent": "They have independent Gaussian noise and we can then predict how the nervous system should put them together and the nervous system is very close to the optimal solutions to it.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, and I I should just here, so here's a.",
                    "label": 0
                },
                {
                    "sent": "Here's a very incomplete list of people have done experiments that model that looked at how good this model is that fit in the data.",
                    "label": 0
                },
                {
                    "sent": "I could relatively easily fill several slides in this font of people that used exactly this kind of model, or variants of that model to predict how.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People come and choose.",
                    "label": 0
                },
                {
                    "sent": "Now the model generally is very good at dealing with.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Situation, but now imagine we're in this situation where you have a visual stimulus at some position and you have an audito stemness at a very dissimilar position, and you've probably all been in this situation.",
                    "label": 0
                },
                {
                    "sent": "So if you go to the park and at least in Chicago in summer, we have these outdoor movies.",
                    "label": 0
                },
                {
                    "sent": "And so you go to the outdoor movie Ann.",
                    "label": 0
                },
                {
                    "sent": "If you're lucky, and if you're in front of the screen, it looks like it's the actors on screen that they're talking.",
                    "label": 0
                },
                {
                    "sent": "But if you if you end up going too far to the sites of the screen.",
                    "label": 0
                },
                {
                    "sent": "It starts that it no longer feels like the actor on screen is talking, but that in fact the loud speakers talking, as long as it's within the within a small range, it fills us.",
                    "label": 0
                },
                {
                    "sent": "Really it's coming out of the mouth of the of the actor and so this means that this model that we use, the generative model that we used for this isn't the right model.",
                    "label": 0
                },
                {
                    "sent": "And and if we think about it, we can't believe in that generative model.",
                    "label": 0
                },
                {
                    "sent": "It says whenever we perceive two things.",
                    "label": 0
                },
                {
                    "sent": "We assume that they come from the same place and then of course it doesn't well model the way we understand how well there's lots of things happening at the same time.",
                    "label": 0
                },
                {
                    "sent": "For example, here I'm in a room full of people and if I hear something I can't account for me.",
                    "label": 0
                },
                {
                    "sent": "It's not that all of you are sitting in the middle and all your noises emanating from then all your faces are moving in the middle.",
                    "label": 0
                },
                {
                    "sent": "No each of you is an object by itself.",
                    "label": 0
                },
                {
                    "sent": "So well.",
                    "label": 0
                },
                {
                    "sent": "This so there's something obvious missing from it, which is.",
                    "label": 0
                },
                {
                    "sent": "There are many in many real world situations, there's more than one source.",
                    "label": 1
                },
                {
                    "sent": "If of potential stimulation.",
                    "label": 0
                },
                {
                    "sent": "Well, So what we did here?",
                    "label": 0
                },
                {
                    "sent": "What we do here is we then take the most simple model that has the expressive power to deal with those situations where of course we could get it.",
                    "label": 0
                },
                {
                    "sent": "We could go a lot further in, combine it with models of a.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cognitive type nature.",
                    "label": 0
                },
                {
                    "sent": "But let's say the model that we were there we should rather believe in should be a model of this kind.",
                    "label": 0
                },
                {
                    "sent": "This is still much too simple, but it goes a big step into the right direction where we can say, well if there's an odd eterna visual stimulus that happen at the same time.",
                    "label": 0
                },
                {
                    "sent": "It might be that they actually come from the same place, but there's also the possibility that just two completely independent things happened and I should say that there's a bunch of people that have recently.",
                    "label": 0
                },
                {
                    "sent": "Published papers in the general direction so, but of course now if we want to make this a real generative model, we need to start with an assumption of how often each of these would happen in the real world.",
                    "label": 0
                },
                {
                    "sent": "And of course, in reality this would depend on the situation and environment which in which we are.",
                    "label": 0
                },
                {
                    "sent": "For example, if we are in a crowded environment, it will happen more often than two things happen randomly at the same ponder at the same time.",
                    "label": 0
                },
                {
                    "sent": "But in a given experiment we can say we can in first approximation say well, there's a sudden prior probability of this happening.",
                    "label": 0
                },
                {
                    "sent": "And the sudden prior probability of that happening, and then we have a generative model where we have one variable that decides if it's going to be this or this, and then in each of these models we have the usual usual basin.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Modeling.",
                    "label": 0
                },
                {
                    "sent": "Now, well, what we need to do here is we need to calculate how likely is it that the two pieces of knowledge that we have come from the same source and how likely is it that they come from independent sources?",
                    "label": 0
                },
                {
                    "sent": "And for that we can use Basil.",
                    "label": 0
                },
                {
                    "sent": "The probability that they have a common cost given what our vision our auditory system tells us is the prior probability that there's a common cost.",
                    "label": 0
                },
                {
                    "sent": "This is if you want how often do things if two things happen at the same time, how often do they come from the same place times the?",
                    "label": 0
                },
                {
                    "sent": "Probability of getting this combination of vision, auditory input.",
                    "label": 0
                },
                {
                    "sent": "Given the assumption that there's a common costs divided by the partition function to make sure that the probability of adessa common costs plus the probability that there's not a common cost, will add up to one.",
                    "label": 0
                },
                {
                    "sent": "So now if if we deal with these models that aren't, that aren't simply gosh, and it actually makes a difference, what difference would kind of cost functions we assuming, so it turns out that if you just have two Bostons Anja come gossom causes and you combine them in the standard way, then then the cost function doesn't matter as long as you use anything reasonable.",
                    "label": 0
                },
                {
                    "sent": "So means quite hours just gives you exactly the same estimator as the mean absolute.",
                    "label": 0
                },
                {
                    "sent": "Value and any any other of the meaningful estimate.",
                    "label": 0
                },
                {
                    "sent": "This give you the same results in such for such a generative model which is a mixture model where two things either come from the same place or not, it actually makes the difference and what we will assume for the moment here is that the cost function that people uses the mean squared error, and then we can derive what's the best solution for this.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This trust problem.",
                    "label": 0
                },
                {
                    "sent": "And let's see what the best solution is.",
                    "label": 0
                },
                {
                    "sent": "What would be the best solution if someone actually told me that the two of them have independent causes so that the audit and the question that we want to answer is now, where does the auditory stimulus come from?",
                    "label": 1
                },
                {
                    "sent": "We don't care about the visits to miss, we just want to know where the auditory stimulus comes from an if someone told me for sure that they have nothing to do with one another, the best thing I could do is I would just ignore the visual, so the blue is the vision, likelihood register auditory likelihood.",
                    "label": 0
                },
                {
                    "sent": "I would just ignore what vision tells me and go with the best estimate from my audito system.",
                    "label": 0
                },
                {
                    "sent": "Now imagine.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Someone told me that there was a common cost for the two of them.",
                    "label": 0
                },
                {
                    "sent": "Well, what would I do now?",
                    "label": 0
                },
                {
                    "sent": "I would then do the Bayesian Q combination as we had it before we take the auditor like Vision, likely auditor like that multiplied together gives me the green posterior.",
                    "label": 0
                },
                {
                    "sent": "This is my best estimate in this case.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, now what's the best solution if we have the mean squared error as cost function?",
                    "label": 1
                },
                {
                    "sent": "In this case, it turns out and I want us to the math.",
                    "label": 0
                },
                {
                    "sent": "Now, if anyone's interested, I'd love to go over it afterwards.",
                    "label": 1
                },
                {
                    "sent": "Is that the best estimate?",
                    "label": 0
                },
                {
                    "sent": "Is the probability that there's a common costs times the best estimate under the assumption that there's a common costs plus the probability of there not being common cause times the best estimate under the assumption that that's not a common cause?",
                    "label": 0
                },
                {
                    "sent": "Those two we had on the previous slide, and this is what we had the equation for three slides ago.",
                    "label": 0
                },
                {
                    "sent": "Anthem now.",
                    "label": 0
                },
                {
                    "sent": "So now we have a model generative model for how things belong together or not.",
                    "label": 0
                },
                {
                    "sent": "We have.",
                    "label": 0
                },
                {
                    "sent": "We know what the optimal solution would be fought and now is always in or like is typical and level models.",
                    "label": 0
                },
                {
                    "sent": "We will now look at how people actually do it and then we will compare.",
                    "label": 0
                },
                {
                    "sent": "Compare how people do it with help.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People should be doing it, so here we have some beautiful experiments from the sugar lab.",
                    "label": 0
                },
                {
                    "sent": "Subject is sitting in an empty and dark room there, so this loud speakers all around the subject.",
                    "label": 0
                },
                {
                    "sent": "There's a ladies all away around the subject and not in every trial.",
                    "label": 0
                },
                {
                    "sent": "One of the ladies comes on and the loudspeaker produces short bus stuff, white noise, so it doesn't.",
                    "label": 0
                },
                {
                    "sent": "Yeah, doesn't sound like this, right?",
                    "label": 0
                },
                {
                    "sent": "Now those two people are supposed to combine in that task is show me weather auditory stimulus is coming from.",
                    "label": 0
                },
                {
                    "sent": "Ignore what you've seen and their secondary task, and in fact they get there.",
                    "label": 0
                },
                {
                    "sent": "Given a laser pointer and as opposed to mindless, actually serve works.",
                    "label": 0
                },
                {
                    "sent": "But now it works, so they're supposed to show with the laser pointer where they heard the sound to be coming from, and there also supposed to say, did the two of them come from the same place?",
                    "label": 0
                },
                {
                    "sent": "So this is what we have on the right hand side on this axis, with the spatial disparity.",
                    "label": 0
                },
                {
                    "sent": "This is how far away from the auditory stimulus is the visual stimulus right means that it's a positive means is to the right hand side of the visual stimulus.",
                    "label": 0
                },
                {
                    "sent": "Negative means it's to the left hand side.",
                    "label": 0
                },
                {
                    "sent": "On this axis you have the percentage of times where people indicated that there's a common cost for the two of them, and what you find is that with small spatial disparity.",
                    "label": 0
                },
                {
                    "sent": "The people tend to frequently say that there's a common costs .7, almost the probability, and with increasing spatial disparity they say so less less and less often.",
                    "label": 0
                },
                {
                    "sent": "And in rat you see the model predictions of the model that we just talked about.",
                    "label": 0
                },
                {
                    "sent": "In fact, it's not completely predictions.",
                    "label": 0
                },
                {
                    "sent": "There were a few parameters that needed to be fitted.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, that's what I wanted to say about this now.",
                    "label": 0
                },
                {
                    "sent": "The next thing that they did is.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh yeah, no.",
                    "label": 0
                },
                {
                    "sent": "Actually I wanted to explain the intuition behind it.",
                    "label": 0
                },
                {
                    "sent": "If vision auditory stimulus are close to one another so that small spatial disparity in this case, you can easily explain the data by assuming they came from the same place in the same places somewhere close to them.",
                    "label": 0
                },
                {
                    "sent": "If they are very far away from them, you would under the common cause model.",
                    "label": 1
                },
                {
                    "sent": "You would need to assume that both of them were affected by very large levels of noise, and this is very unlikely about from the common cost model, whereas if you have the not a common cost money there far away from one another, well, it just means that one of them came from here, the.",
                    "label": 0
                },
                {
                    "sent": "No one came from there.",
                    "label": 0
                },
                {
                    "sent": "Will you show this slide to show that the basement failed so that it fits?",
                    "label": 0
                },
                {
                    "sent": "Because I mean it virtually all the points are outside the airport for the prediction is significantly off for Forza 6 point.",
                    "label": 0
                },
                {
                    "sent": "Yeah, after this is a slide to show that the base is good or bad.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you're absolutely right.",
                    "label": 0
                },
                {
                    "sent": "It turns out that the model had sweep sweep free parameters that we actually fitted to three different graphs.",
                    "label": 0
                },
                {
                    "sent": "Continue Miss fulsom.",
                    "label": 0
                },
                {
                    "sent": "This is a very good point.",
                    "label": 0
                },
                {
                    "sent": "Why don't you wait two slides so So what we did here is we fitted the model to two significant size of a data set of different things where this is just one of the projection of the data.",
                    "label": 0
                },
                {
                    "sent": "If you want.",
                    "label": 0
                },
                {
                    "sent": "So yes, if this was the only thing that the model would explain, then the three parameter fit that gives this fit would actually be very bad.",
                    "label": 0
                },
                {
                    "sent": "We understand where the differences are coming from between the model and the data, but I won't have time to go through that, yes?",
                    "label": 0
                },
                {
                    "sent": "Mental model.",
                    "label": 0
                },
                {
                    "sent": "Change any to do repeated experiments with the same person.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Together they can say so.",
                    "label": 0
                },
                {
                    "sent": "This is a very good question.",
                    "label": 0
                },
                {
                    "sent": "He asked, doesn't want the beliefs of the person about the kinds of models that they should assume changed.",
                    "label": 0
                },
                {
                    "sent": "If we take them to the experiment for a long time and in many ways they should, because you can say well in this experiment the visual stimulus and audio toast images are not dependent on one another, so therefore it would be the absolutely right thing to learn to completely ignore the visual stimulus.",
                    "label": 0
                },
                {
                    "sent": "So that's one way of thinking about it.",
                    "label": 0
                },
                {
                    "sent": "At the same time, that's the other way of thinking about it, which is you live your entire life in a world where visual and auditory stimuli are highly correlated in position with one another.",
                    "label": 0
                },
                {
                    "sent": "Therefore it's going to be difficult for you to overrule this very strong prior that you have about it.",
                    "label": 0
                },
                {
                    "sent": "So tons of them in these experiments, if you analyze, say, early behavior relative to late behavior, you don't really see see any significant differences.",
                    "label": 0
                },
                {
                    "sent": "But, but there are other factors that you can use.",
                    "label": 0
                },
                {
                    "sent": "You can tell people they really don't have anything to do with one another, and then they will.",
                    "label": 0
                },
                {
                    "sent": "So assign it's as if they then assign lower probability to.",
                    "label": 0
                },
                {
                    "sent": "There being a common costs and you can, you can take.",
                    "label": 0
                },
                {
                    "sent": "You can introduce little delays between them and that too has an influencer.",
                    "label": 0
                },
                {
                    "sent": "There's many, many factors that influence the effective value of the of the P common in this case.",
                    "label": 0
                },
                {
                    "sent": "Sunesson Alexi.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If if we can have more data based on the same model and so here we have here, the next thing that they plotted is they plotted the game.",
                    "label": 0
                },
                {
                    "sent": "So now what?",
                    "label": 0
                },
                {
                    "sent": "So what does the game mean?",
                    "label": 0
                },
                {
                    "sent": "Again off 100% would mean that if audition is here and vision is here, audition will be perceived to be over there where the visual stimulus is, so 100 would just mean we go with vision, then a gain of zero would mean we just ignore.",
                    "label": 0
                },
                {
                    "sent": "We just ignore this system, so we just go with the auditors to massive audition is here.",
                    "label": 0
                },
                {
                    "sent": "We just go for it.",
                    "label": 0
                },
                {
                    "sent": "We might have nice, but on average we go there again of minus 100% would be if business here audition is here then for some reason our cognitive system pushes it over there.",
                    "label": 0
                },
                {
                    "sent": "So what they then did is that took all the trials and that divided the trials into two classes of trials.",
                    "label": 0
                },
                {
                    "sent": "One class of them were the ones where people had said that there's a common costs for the two of them, and the other ones were the ones where they said there's another common cause.",
                    "label": 0
                },
                {
                    "sent": "Now, in those cases where they said there's a common costs, it turns out that the game is close to 100%.",
                    "label": 0
                },
                {
                    "sent": "Which is pretty much what we should expect, because if you if you'd know that the two of them come from the same place, an vision is much better than audition, while then you should better go with vision.",
                    "label": 0
                },
                {
                    "sent": "So Salvation is very close to.",
                    "label": 0
                },
                {
                    "sent": "So if they say there's a common cause, the game is close to 100%.",
                    "label": 0
                },
                {
                    "sent": "Now if they say that the game is that there's another common costs, then actually the game goes to be quite negative.",
                    "label": 0
                },
                {
                    "sent": "Very negative effect.",
                    "label": 0
                },
                {
                    "sent": "So that means that relief if audition is here and vision is here.",
                    "label": 0
                },
                {
                    "sent": "Looks like people perceive it here.",
                    "label": 0
                },
                {
                    "sent": "So some people, after seeing that said well, there must be some cognitive bias effect.",
                    "label": 0
                },
                {
                    "sent": "If you see something it's pushing you away.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's it's probably not likely because the Bayesian model shows it as well.",
                    "label": 0
                },
                {
                    "sent": "But what is wrong with the analysis?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Why is there not a cognitive bias?",
                    "label": 0
                },
                {
                    "sent": "Why does it look like there, Sir?",
                    "label": 0
                },
                {
                    "sent": "We are bias?",
                    "label": 0
                },
                {
                    "sent": "And where does this effect come from?",
                    "label": 0
                },
                {
                    "sent": "Why does the game go negative?",
                    "label": 0
                },
                {
                    "sent": "Who knows why the game goes negative?",
                    "label": 0
                },
                {
                    "sent": "OK, why could the game be negative?",
                    "label": 0
                },
                {
                    "sent": "Well, it turns out that here we have something that's called the selection bias.",
                    "label": 0
                },
                {
                    "sent": "It's something that economists accurately aware.",
                    "label": 0
                },
                {
                    "sent": "So what we've done?",
                    "label": 0
                },
                {
                    "sent": "We have one piece of knowledge, which is what our our nervous system, the inputs, are.",
                    "label": 0
                },
                {
                    "sent": "Nervous system.",
                    "label": 0
                },
                {
                    "sent": "Listen an addition and we answer 2 questions based on that.",
                    "label": 0
                },
                {
                    "sent": "One of the questions is do they belong together and the other one is?",
                    "label": 0
                },
                {
                    "sent": "Where does it come from?",
                    "label": 0
                },
                {
                    "sent": "And if we answer 2 questions with the with the with the same inputs, any noise and the impossible induced fake correlations between the two of them that are that are just because the because the input is shared, it's called the selection biased, and let me let me highlight how that comes about.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So imagine that that we keep repeating the same trial over and over and over again.",
                    "label": 0
                },
                {
                    "sent": "The auditory stimulus is always hits there.",
                    "label": 0
                },
                {
                    "sent": "The visual stimulus is always at 5, so gain of zero would mean just perception in the middle again of one would mean that I always perceive it it fast, but now it's known that vision is pretty precise, so our visual stimulus system almost always tell us something very close to five.",
                    "label": 0
                },
                {
                    "sent": "But now we know that audition is very noisy, so sometimes I will perceive with at 4.",
                    "label": 0
                },
                {
                    "sent": "Sometimes I perceive it at minus 4.",
                    "label": 0
                },
                {
                    "sent": "Now, under which circumstances will I say that they belong together well?",
                    "label": 0
                },
                {
                    "sent": "It depends on the distance between them on their spatial disparity.",
                    "label": 0
                },
                {
                    "sent": "Vectors to one another will say yes they belong together there for anything that will go into the pink region here will be called.",
                    "label": 0
                },
                {
                    "sent": "Common costs, so now what we have is we start with this Gaussian distribution centered at zero, but we cut away the right half of it after we cut away the right half of it, then mean is very negative.",
                    "label": 0
                },
                {
                    "sent": "So even if there's some Bayesian corrections that we do to it because we have the selection bias, we will still get their heavily negative value.",
                    "label": 0
                },
                {
                    "sent": "And this is where this effect is coming from.",
                    "label": 0
                },
                {
                    "sent": "And this is actually very important when you do data analysis in cognitive science on your science or many other domains.",
                    "label": 0
                },
                {
                    "sent": "Which is if you say you have a monkey, you do fMRI like you have a human being.",
                    "label": 0
                },
                {
                    "sent": "You do fMRI and you measure.",
                    "label": 0
                },
                {
                    "sent": "If they say it was moving to the left or to the right and say you have a stimulus that isn't moving into either direction.",
                    "label": 0
                },
                {
                    "sent": "Well, it turns out that there's noise in the perception of movement and this noise is being shared between the part of the.",
                    "label": 0
                },
                {
                    "sent": "Brain that decide if it's going left or right and the part of the brain that you actually record from.",
                    "label": 0
                },
                {
                    "sent": "So if you see that there is a correlation, people have often concluded while that means that this is the brain area that's doing the decision, no, as long as it just means it's a brain area that sharing the same input that is being used for the final decision.",
                    "label": 0
                },
                {
                    "sent": "So it's something that one needs to be aware of and something that crops up pretty much wherever you do experiments where you answer more than one question, one question at the same time, let me give you a beautiful example of selection bias.",
                    "label": 0
                },
                {
                    "sent": "It's it's known that golfing is the most dangerous spot ever.",
                    "label": 0
                },
                {
                    "sent": "The probability of dying in a given year if you play golf is dramatically higher than if you don't play golf.",
                    "label": 0
                },
                {
                    "sent": "OK wait, why is that?",
                    "label": 0
                },
                {
                    "sent": "Yeah, exactly.",
                    "label": 0
                },
                {
                    "sent": "It's old people tend to play golf.",
                    "label": 0
                },
                {
                    "sent": "Young people don't tend to play golf nearly as much and therefore conditioning on you.",
                    "label": 0
                },
                {
                    "sent": "Having told me that you play golf, you the probability that you die is much higher, but that's because there's a common causal reason for it.",
                    "label": 0
                },
                {
                    "sent": "It's not that one of them causally produces the other one.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now the last thing is the same model with the same parameters can also.",
                    "label": 0
                },
                {
                    "sent": "You can try and predict the standard deviation as a function of spatial spatial disparity.",
                    "label": 1
                },
                {
                    "sent": "Now coming back to the question, why is it that the model doesn't do a perfect job on each of the graphs?",
                    "label": 0
                },
                {
                    "sent": "There's some systematic variation between what the model does and how the data looks like.",
                    "label": 0
                },
                {
                    "sent": "Well, it turns out that what people do probably isn't quite as simple as we as we assumed here.",
                    "label": 0
                },
                {
                    "sent": "So it turns out that there's two strategies that people could have an people, and it looks like subjects are doing a mixture between the two of them, and we assume that they do something that they do, so we assume here that people minimize the mean squared error in the estimates, which requires them to equally consider the two interpretations, or all of each of them waited by the prior by the by the posterior that they have.",
                    "label": 0
                },
                {
                    "sent": "Whereas there's another possible to wear.",
                    "label": 0
                },
                {
                    "sent": "People could just look at it, decide for themselves, do they belong together, and if there be longing to belong together, they treated as if for sure they belong together.",
                    "label": 0
                },
                {
                    "sent": "And if they say they don't belong together, they treated As for sure they don't belong together and it turns out that human behavior probably is somewhere in between and it's a big debate in the Q combination literature at the moment where some people say while you go with what's more, what's mostly with the structure interpretation, it's more likely another say, well you consider each possible structure.",
                    "label": 0
                },
                {
                    "sent": "Of course, considering each possible structure gets to be very complicated.",
                    "label": 0
                },
                {
                    "sent": "If you're in big spaces, say look at the scene like that, I could have any number of structure interpretations an it's exponential in the number of things that they can construct the scene out of, and so in some sense it might become.",
                    "label": 1
                },
                {
                    "sent": "It probably becomes intractable if we want to really consider each possible interpretation of everything.",
                    "label": 0
                },
                {
                    "sent": "Good any questions about this path?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "The fix to the data what?",
                    "label": 0
                },
                {
                    "sent": "Thanks, the prior sleeping.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "Use.",
                    "label": 0
                },
                {
                    "sent": "I think this is so, so if I remember it right, do you get a pretty low probability for them not belonging together and but effectively this doesn't have so much of an influence?",
                    "label": 0
                },
                {
                    "sent": "Because as soon as you move the two stimuli away from each other, the probability that they come from a common cause goes goes down like a essentially like a gosh.",
                    "label": 0
                },
                {
                    "sent": "And that means for big distances it starts going down very, very fast.",
                    "label": 0
                },
                {
                    "sent": "This is somehow wrong because the.",
                    "label": 0
                },
                {
                    "sent": "Through Manhattan.",
                    "label": 0
                },
                {
                    "sent": "I'm not.",
                    "label": 0
                },
                {
                    "sent": "The way people should go into the experiment is with the with the relevant or like.",
                    "label": 0
                },
                {
                    "sent": "The best way from my perspective for them, go to into into.",
                    "label": 0
                },
                {
                    "sent": "It is with with an understanding of how often synchronous events happen in their typical environment.",
                    "label": 0
                },
                {
                    "sent": "So one half 1/2.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the information from information theory consists can say it's none formative prior, but we do have information, which is that if we are in an essentially empty black room.",
                    "label": 0
                },
                {
                    "sent": "The Maxi the world is rather sparse, so there's very few events, and because there's very few events, the probability that two random events aligned at the same time is very small.",
                    "label": 0
                },
                {
                    "sent": "So in all likelihood, I think no one has done these experiments.",
                    "label": 0
                },
                {
                    "sent": "But if you if you take the same experiment and put them into a crowded environment so you just play lots of irrelevant and blinking, Eli dies all around it, you will probably find that people what sign higher probabilities to the two of them being unrelated to one another.",
                    "label": 0
                },
                {
                    "sent": "But yeah, good question.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good now in fact, how long have I been talking?",
                    "label": 0
                },
                {
                    "sent": "So fine so I didn't get the initial time.",
                    "label": 0
                },
                {
                    "sent": "40 minutes 40 minutes great.",
                    "label": 0
                },
                {
                    "sent": "Good, So what we what we did next is is we then set well maybe we could find effects of that during movement because what my lab mostly does is we study how people move and the impact uncertainty on the way they move.",
                    "label": 0
                },
                {
                    "sent": "Ultimately, the reason why this is important is, I mean we have a tation Institute and what we would like to be able to do is when patients come in for physical rehabilitation we'd like them to learn things fast.",
                    "label": 0
                },
                {
                    "sent": "Therefore we want to understand how people laugh and if these calls are infants.",
                    "label": 0
                },
                {
                    "sent": "Ideas are important and we should be able to find reflections of that in in rehabilitation relevant domains.",
                    "label": 0
                },
                {
                    "sent": "And here's one of them.",
                    "label": 0
                },
                {
                    "sent": "So what we do is we do the following experiment.",
                    "label": 0
                },
                {
                    "sent": "People always start with the hand at some place and they go right Watts and they don't see their hand.",
                    "label": 0
                },
                {
                    "sent": "It's a typical movement experiment, but they see occurs at the end.",
                    "label": 0
                },
                {
                    "sent": "And of course we're cheating everyone.",
                    "label": 0
                },
                {
                    "sent": "Doing psychophysics is cheating, so they started someplace they move their hand and then instead of showing them because they wear their fingers, we move the cousin in depth and then we will be looking at is.",
                    "label": 0
                },
                {
                    "sent": "So what we expect people to do is they will estimate weather hand really is, and there are two queues.",
                    "label": 0
                },
                {
                    "sent": "The vision information from the cursor.",
                    "label": 0
                },
                {
                    "sent": "And they have the proprioceptive information, which is where, based on what all their sensors in their arm tell them where they think their hands should be.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we see here is very simple analysis.",
                    "label": 0
                },
                {
                    "sent": "We use different values for the visualist disturbance minus 8 centimeters, so that's a pretty big shift.",
                    "label": 0
                },
                {
                    "sent": "So you move 20 centimeters and then you find the cursor here.",
                    "label": 0
                },
                {
                    "sent": "So it's pretty unbelievable.",
                    "label": 0
                },
                {
                    "sent": "And then we use 4 centimeters, 2 -- 1, zero 1248 and every single blue dot.",
                    "label": 0
                },
                {
                    "sent": "We added a little bit of jitter in this axis just so that you can see the raw data an every single dot is 1 trial and you find that there's some distribution and bless you might already see the average cluster.",
                    "label": 0
                },
                {
                    "sent": "So this is the deviation at the next trial.",
                    "label": 0
                },
                {
                    "sent": "So we we introduced this top on one trial and we see how they move on the very next trial.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And he see the data including the model fits, not the model is exactly the same model that I explained to you before.",
                    "label": 0
                },
                {
                    "sent": "The only thing is that we assume that learning is linear in your estimate of the error, and the estimate comes from doing Q combination.",
                    "label": 0
                },
                {
                    "sent": "And here compare that with where you want to be and we of course we want them if they manage to go relatively close to straight.",
                    "label": 0
                },
                {
                    "sent": "And here we have a link, we have the influence of the perturbation on one.",
                    "label": 0
                },
                {
                    "sent": "Trial on the next trial.",
                    "label": 0
                },
                {
                    "sent": "Two trials later, three translator for translator and you see, we have very small or pretty small error bus and we very clearly have this nonlinear function here.",
                    "label": 0
                },
                {
                    "sent": "So it appears as if causal inference plays a role for motor adaptation there.",
                    "label": 1
                },
                {
                    "sent": "Now, what is what makes it interesting is that this office in new approach to rehabilitation, because you can say, well, we learn linear in the size of the hour.",
                    "label": 0
                },
                {
                    "sent": "So normally we should learn better.",
                    "label": 0
                },
                {
                    "sent": "My hour is larger because if you make the hour very large it starts being unbelievable and therefore you will no longer learn if we can.",
                    "label": 0
                },
                {
                    "sent": "If we can effectively estimate that for the patience we can make sure that the hours that we give them myself in the sweet spot where they still learn a lot.",
                    "label": 0
                },
                {
                    "sent": "But it's still in the.",
                    "label": 0
                },
                {
                    "sent": "Range that is believable for them.",
                    "label": 0
                },
                {
                    "sent": "So, just to summarize that it appears that for motor that that causal inference in two combination also is reflected in the way people learn to move or how people adapt.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Captain Movement now what's the essence of causal inference?",
                    "label": 1
                },
                {
                    "sent": "Well, you can say it's like a noisy identity relation.",
                    "label": 0
                },
                {
                    "sent": "Probably the two.",
                    "label": 0
                },
                {
                    "sent": "What it says in our formulation and if we just reformulated it differently, is probably the two queues come from the same place.",
                    "label": 0
                },
                {
                    "sent": "So it's a noisy identity, and if they don't come from the same place, they have nothing to do with one another.",
                    "label": 0
                },
                {
                    "sent": "Now what the next part of the talk will be like.",
                    "label": 0
                },
                {
                    "sent": "The next topic will be about is a generalization of that to noisy inequality's where you can say probably this object is in front of that object.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we will have two different calls.",
                    "label": 0
                },
                {
                    "sent": "Interpretations of that.",
                    "label": 0
                },
                {
                    "sent": "So we will be talking about depth perception or depth perception has a very natural inequality relation between things.",
                    "label": 1
                },
                {
                    "sent": "If you see my hands here and you're back there in the back, roll, your disparity system is in no way able to distinguish the difference between these two.",
                    "label": 0
                },
                {
                    "sent": "But yet, if you see something like that, you will be absolutely positive that my right hand is in front of the back end.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that this is actually one of the most powerful cues, so it's called an ordinary Q, and it's one of the most powerful queues.",
                    "label": 0
                },
                {
                    "sent": "If you want to pass natural scenes, and that's a beautiful demonstration of that.",
                    "label": 0
                },
                {
                    "sent": "Who has seen pseudo scopes?",
                    "label": 0
                },
                {
                    "sent": "Pseudo scopes, so the wave sooner scope boxes you take everything that you're right ISIS and you give it to the left eye.",
                    "label": 0
                },
                {
                    "sent": "You take everything that your left eye sees you give it to your right eye.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, everything stays the same, but now you see there's this big problem, which is everything which normally another system would recognize as being close to you actually is further away, and everything that's further away is closer to you, so you totally involved all disparity cues, so everything is just in exactly the wrong direction and and you imagine that it's really difficult to see anything with it.",
                    "label": 0
                },
                {
                    "sent": "Who thinks it's really difficult?",
                    "label": 0
                },
                {
                    "sent": "Who thinks it's really easy?",
                    "label": 0
                },
                {
                    "sent": "I love thanks to them, not intuitive, so it turns out that if you look into that thing, you don't even see the difference.",
                    "label": 0
                },
                {
                    "sent": "It looks like you're looking at a 3D image with everything fine and there's something limb puzzling.",
                    "label": 0
                },
                {
                    "sent": "If you look at it, but you don't usually four in.",
                    "label": 0
                },
                {
                    "sent": "I'm talking bout about typical real world scenes.",
                    "label": 0
                },
                {
                    "sent": "It's very, very different if you give them just two dots in different death or stereograms.",
                    "label": 0
                },
                {
                    "sent": "These things are very very different.",
                    "label": 0
                },
                {
                    "sent": "But if you just give them an image of the real world, it turns out that you don't even recognize the difference and the reason why this is so is just you have all this high level knowledge about it.",
                    "label": 0
                },
                {
                    "sent": "You know that shares happen to be on the ground plane in some normal way.",
                    "label": 0
                },
                {
                    "sent": "Everything is everything.",
                    "label": 0
                },
                {
                    "sent": "If I look at a room like that each each of the rows is partially overlapping with with the backcross.",
                    "label": 0
                },
                {
                    "sent": "So therefore if you want the information that I have in these audio cues is much more useful.",
                    "label": 0
                },
                {
                    "sent": "Then the information that I have otherwise, and that's why.",
                    "label": 0
                },
                {
                    "sent": "But the interesting thing is if you look at sudo scope images, it's enough to turn on the perception of depth.",
                    "label": 0
                },
                {
                    "sent": "You feel like it's a depth image because photographs is the typical case where where there's no deaths in it and our brain knows photograph, so it doesn't feel like it has real depth, but sooner scope images really feel like they have real death.",
                    "label": 0
                },
                {
                    "sent": "So in any case, this is just the introduction to it.",
                    "label": 0
                },
                {
                    "sent": "What we what we will do is we will.",
                    "label": 0
                },
                {
                    "sent": "We will have a visual scene that is going to look like that an for a visual scene.",
                    "label": 0
                },
                {
                    "sent": "That's going to look like that.",
                    "label": 0
                },
                {
                    "sent": "You can say there's two interpretations.",
                    "label": 0
                },
                {
                    "sent": "One of them is that there's two discs, a small disk in a large disk with a small disk being in front of the large disk and partially overlapping it.",
                    "label": 0
                },
                {
                    "sent": "Alternatively, you can say, well, lesser PAC man and the small disk.",
                    "label": 0
                },
                {
                    "sent": "And of course you can say Pacman sack kind of ran this Walt and objects that overlap with other objects.",
                    "label": 0
                },
                {
                    "sent": "Pretty frequent, and then we've been running.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second, physical tests with it.",
                    "label": 0
                },
                {
                    "sent": "The way the second physical tests look like is the following.",
                    "label": 0
                },
                {
                    "sent": "You always have a display that more or less looks like that you have one big dark desk.",
                    "label": 0
                },
                {
                    "sent": "Here you have a small Gray disk here an every trial people just adjust this Gray disk so that it appears to be at the same depth as the right disk.",
                    "label": 0
                },
                {
                    "sent": "The only thing that we very index fund is the depths of the of this dark grey disk.",
                    "label": 0
                },
                {
                    "sent": "And now you can.",
                    "label": 0
                },
                {
                    "sent": "You can intuitively see the idea what's going to happen if the two of them are very far away from each other.",
                    "label": 0
                },
                {
                    "sent": "The Black Back desk should have no influence whatsoever, because your your perception of disparity will be enough to just know it's in front of it now as it gets closer in, the likelihood function start overlapping.",
                    "label": 0
                },
                {
                    "sent": "This ordinary constraint will get to be important, and ultimately you expect it to.",
                    "label": 0
                },
                {
                    "sent": "Then the back disc in your perception to start pushing the front disc ahead of each other.",
                    "label": 0
                },
                {
                    "sent": "And if you go too far, you're in fact expected to pop back out.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if we look at the.",
                    "label": 0
                },
                {
                    "sent": "At how the likelihood functions would look like in most Q combination experiments.",
                    "label": 0
                },
                {
                    "sent": "People behave as if all the likelihood functions they have available, out of caution shape.",
                    "label": 0
                },
                {
                    "sent": "In this case, we get likelihood functions that actually look like cumulative gosens error functions, and the reason for that is if it's very far away, well, that's perfectly compatible with what I see if it gets close to it.",
                    "label": 0
                },
                {
                    "sent": "This starts getting incompatible.",
                    "label": 0
                },
                {
                    "sent": "So if the probability that there there of packmans would be 0, the likelihood function would look like that, and the width here is just uncertainty that I have in my depth perception.",
                    "label": 0
                },
                {
                    "sent": "An if they if we then stop introducing some probability for PAC man, it will start looking like this.",
                    "label": 0
                },
                {
                    "sent": "And if there's only PAC man's in the world than the lecture function gets to be completely flat.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Infinite.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Six comments, in fact, I should briefly say a little more about the experiment.",
                    "label": 0
                },
                {
                    "sent": "If anyone can free fuse here, this is how the stimuli look like.",
                    "label": 0
                },
                {
                    "sent": "So we give this depth information, but just having a big cloud of dots with a little bit of nice little bit of noise on there.",
                    "label": 0
                },
                {
                    "sent": "And if anyone doesn't know what free fuse means is you look if you squint a little bit so that these two images cover the same space in your visual field and all of a sudden you will see you will see a 3D image.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we just just very similar to how constant banks did it.",
                    "label": 0
                },
                {
                    "sent": "We add noise and that produces two conditions, a low uncertainty condition where both discs are pretty well visible and the high uncertainties situation where they're relatively invisible and we expected this ordinal Q will be more important in the case where we have high uncertainty.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm here stand how the data looks like.",
                    "label": 0
                },
                {
                    "sent": "Here's the depths of the occluding object, and here's the bias that people show in the depths of the Gray disk, and you see, as expected.",
                    "label": 0
                },
                {
                    "sent": "At first it has no influence in the Sun by assisting with walking.",
                    "label": 0
                },
                {
                    "sent": "This is preliminary data into the high uncertainty case.",
                    "label": 1
                },
                {
                    "sent": "The back disc is morphing effect and in the low uncertainty case and in the experiment we we couldn't go to extreme enough versions so that it would actually pop, so it's just.",
                    "label": 0
                },
                {
                    "sent": "That the probability for these kinds of PAC man's in the world is just so unlikely that we can get people to do that.",
                    "label": 0
                },
                {
                    "sent": "We will replicate the same experiments, putting the small disks in the middle of the big disk, which should allow the pop out is sort of like the pop back to happen because it turns out that there are a significant number of disks versus central hole in the real world.",
                    "label": 0
                },
                {
                    "sent": "So the prior probability for that should be much larger.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me skip over this so you can say here we have a generalization of the basic causal inference idea that it's a noisy inequality and probably 1 depth is larger than the other one.",
                    "label": 0
                },
                {
                    "sent": "I want to add a little bit of a generalization to that, so this here we dealt with a relatively simple case they belong together or not, or one of them is in front of the other or not.",
                    "label": 0
                },
                {
                    "sent": "In reality, of course we should deal with real world problems, which is a scene like this where there's many different objects and in principle one could estimate these.",
                    "label": 0
                },
                {
                    "sent": "These causal inference for depth estimation things by allowing a computer vision system to effectively maintain proposals of an arbitrary number of objects.",
                    "label": 0
                },
                {
                    "sent": "And it could then propose to add new objects to the interpretation to the scene or in the Hill, eight others.",
                    "label": 0
                },
                {
                    "sent": "And we could do building Markov chain Monte Carlo sampler to deal with promise of that kind.",
                    "label": 0
                },
                {
                    "sent": "Is the end of the part of the talk where was going to talk about 'cause the inference?",
                    "label": 0
                }
            ]
        }
    }
}