{
    "id": "lgytcatzvmvzfaxumpkecyi6hxqiapvf",
    "title": "Baseline Methods for Automated Fictional Ideation",
    "info": {
        "author": [
            "Maria Teresa Llano, Department of Computing, Goldsmiths College, University of London"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Philosophy",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning",
            "Top->Arts",
            "Top->Social Sciences->Psychology"
        ]
    },
    "url": "http://videolectures.net/iccc2014_llano_fictional_ideation/",
    "segmentation": [
        [
            "And good morning, yeah, this is joint work with people from Goldsmiths, University of London.",
            "Just have Steven Institute and the University of Cambridge."
        ],
        [
            "As we have seen that in this week, computational creativity has progress in in the generation of artifacts with cultural value.",
            "So we have seen the generation of poems, images, stories.",
            "But all these artifacts when they are created by people, they embed a fictional idea and then these ideations process is key or central to the generation of this time.",
            "This type of.",
            "Effects, in particular with the word that we present here.",
            "We are interested in fictional ideations, which is the process of creating new ideas which are not meant to describe a current truth about the world.",
            "And this is precise."
        ],
        [
            "Really, the purpose of the wind project, which is aimed at investigating fictionalization from a computational perspective.",
            "Women stands for the what if machine that is a.",
            "We hope we expect the outcome of this project and so forth that would present fictional ideas in the form of what if statements, alongside stories or poems so different, kind of representations.",
            "Along with what if ideas?",
            "So the project is there are five teams involved involved in the project, and each team is responsible for one aspect of the fit of the ideations process.",
            "The University in the University of Cambridge there responsible for building the world knowledge that is analyzing a domain and giving information about the facts, the norms and everything that could be found out that domain then.",
            "University College Dublin are responsible for taking that knowledge and generating fictional ideas about them.",
            "Then at the University are complete, complete and semi read an is that they are responsible for generating narratives based on the what if ideas of the fictional ideas, then a Goldsmith.",
            "We are responsible for rendering a presenting different renderings for these narratives.",
            "So, as I said before, maybe different poems, the former stories and different kind of renderings that would increase the appreciation of the fictional ideas.",
            "And the Joseph Stephen Institute.",
            "They are in charge of creating models that can evaluate a depreciation of the ideas by people.",
            "And so we can predict a how an idea would be pretty appreciated by people.",
            "So today we're going to present a. I'm going to present 3 baseline methods for fictional ideations and still getting an early stage of the project and the idea with the contribution with the paper is to present what is what is currently the approaches that we know to fictional ideations so that in the future we can compare the progress that we have made against this these approaches."
        ],
        [
            "So the first approach is consonant based approach, so you have heard from Tony's at talks.",
            "A consumer is a semantic network, hominan knowledge, information that is mined from the web, and it's from the MIT Media Lab.",
            "Inconsistent information is represented by facts that have a array left hand side and right hand side concept, and a relation that explains how.",
            "Two concepts are related.",
            "An_that is kind of measure of the strength of the relation.",
            "So for example, an example of a fact would be be capable of make honey, which is a score of two.",
            "An something consonant is has a set of relations, so for each one of them, is this capable of an is a closed set of relations?",
            "So the way we generate fictional ideas from this from these facts is by altering the components of the facts in different ways.",
            "So for instance, from an original fact xry.",
            "Can become XR prime Y in which are prime.",
            "Could be the straightforward negation of the relation.",
            "So for instance, if we have the fact be capable of my honey, this can be comes up big B not capable of my honey.",
            "And then we take these facts an we render them in a way to present them as our if idea.",
            "So for instance, what if there was a little B who couldn't make honey?",
            "We evaluate the value of the fictional idea.",
            "This is a simple mechanism for evaluating them.",
            "With inference chaining, so this is from the original fact we measure the quantity and and volume of the chains that can be derived from the fact, so change would be all the facts that are derived from this from the original fact.",
            "And then we rank them according to scores that are given.",
            "So we."
        ],
        [
            "I have experimented with different combinations of.",
            "I'm altering concernant facts, so for this we use the flower frameworks and these are flowcharts.",
            "I kind of go into a tale of the flower framework, but please see Jones talk tomorrow Friday he will explain very nice framework, so we have experimented with different combinations of these.",
            "For instance, we have presented by.",
            "Generating this night type characters or if there was a little cat who learn how to ride a bike.",
            "Really sad, what if you paint at all thing that was made out of gold.",
            "So for instance you can see that there are different concept windows here so different facts are coming in and we are exploring how we can change the arguments and combining 2X to generate these ideas.",
            "Superhero like what if there was a police officer who had fair wings like a bird?",
            "Despite both Kafka, what if there was a woman who woke up in the Sky as a bird who could but could still speak or consequences like, what if there was an old dog who couldn't run anymore, which he used to do for fun, so decided instead to ride a horse.",
            "One of Simon's favorite.",
            "And so this is the concept based approach."
        ],
        [
            "Second approach is the reverbed based approach and this by Mark in Cambridge and River is an open information extraction so far which obtains fax also from the web is very similar, similar to concern at the differences that River has an open set of entities and relations.",
            "So different concept that has a constraint or limited set of relations that can be used.",
            "And with the River approach, the fictional ideas are generated by substituting one of the arguments in the facts with alternative entities.",
            "So for instance.",
            "From the fact X or Y, then we find facts with explain RY Prime so that we keep the relation and then we find alternatives arguments to initial fact and then we form a new fact.",
            "I sorry a new idea.",
            "Fictionally the other is XRY prime, which has not been have not seen before.",
            "So for instance we have cattle evolved 2 egress an sorry forgot.",
            "Please, an something evolved to eat meat, then we can form the fictional idea is what if cattle evolved to eat meat?",
            "So again."
        ],
        [
            "A we have generated different ideas from these.",
            "So examples are from the original fat cattle occupy a unique role in human history.",
            "So what if cattle occupy occupy a universal in mind, immoral distributed systems?",
            "A Scotland is steeped in history.",
            "What if Scotland is steeped in tradition?",
            "Scotland is a part of the United Kingdom.",
            "What ifs: is a part of life.",
            "Scotland is in Britain, but if Scotland is improving.",
            "Hell yeah this this at some of the examples of the generate efficient ideas."
        ],
        [
            "And the third approach is by Sociative discovery approach.",
            "This actually was presented a last year in the conference, and so by Association explains when a problem, idea or event situation is perceived simultaneously in two or more domains, and this is by finding something that is called B terms.",
            "So given two domains, for instance the migraine and then domain magnesium.",
            "Then finding common terms, but are common terms that are not very frequent.",
            "There is a set of heuristics going on to be able to to select this these terms and I don't have time to go into it.",
            "But so for instance we can see that, for instance, say that a migraine could be magnesium.",
            "The term is for instance calcium this, so there is a system called the crispy system which is used to rank them B terms.",
            "And in the in the context of fictional ideations, we have used this ranking as a measure to rank a.",
            "Compound sentences from two different domains so as to create a creative statements in for for the context of here we have experimental away by a link.",
            "What if tweets and moral statements for from alsops fables?",
            "So for instance, here we have some of the."
        ],
        [
            "Samples generated by.",
            "By this approach, the first statement is the tweet and the second one is the model statement and the word involved is the B term.",
            "So for instance, what if a call myself, the Pope, then charge into Vatican and demanded I do it to the left with an old man?",
            "Every man should be content to mind his own business.",
            "A what if I was not actually a short 16 year old girl but six feet, 2 inch 49 year old man?",
            "One man's pleasure maybe another another Spain.",
            "But if the most travel time is now travel constant direction will be suspected.",
            "So these are some examples so.",
            "And we."
        ],
        [
            "Wanted to to evaluate in in some way, like a baseline evaluation of of how good the quality of the output generated by this approach is.",
            "So we use the correlation coefficient introduced by cotton and Wiggins.",
            "So what we do is that each of the members of the teams manually choose the proportion of ideas that were understandable and fiction by understand the world.",
            "We mean they were well defined, not necessarily.",
            "They make sense, but because it's fictional radiation.",
            "So there is a lot to imagine, but basically where they were syntactically well well defined with the concept that approach with this.",
            "By the way, this in different of different of the flow charts that show before we play with this, T1 and T2 are the scores of the consigment facts.",
            "So we play by increasing the score of the concept.",
            "Net facts we can see that a.",
            "In the way we increase the score, the output was less, but then the quality was better.",
            "So we can say for instance here in this case when the two.",
            "Concept knows these are two concept nodes have a score of 520 jail, 27 ideas and all of them were were good.",
            "So we can control the quality of the ideas by playing with a score of concept net.",
            "With the reverse approach, we generate the 500 fictional ideas and again we look at how many of them were fictional.",
            "It quite a good percentage 19.9 and understand the whole 94.6 but with other population there was an additional aspect.",
            "At there is a challenge now is that because the substitutions are not controlled and there were some high proportion of duplicates so?",
            "If we remove the duplicates, the coefficient is 7073.6 is still high coefficient.",
            "So in order by choosing the ideas that they have any of the problem that they were fictional understandable and they were not duplicates.",
            "The coefficient is 59.1.",
            "OK, and with something similar with a by cities query approach by combining the reason the animal terms, one of them by guided by the strain of the B term and then guide just randomly commit random combinations and.",
            "With that with diversity is clearly we found that most of them were understand overseas anyway.",
            "They already are a sentences that are well formed, but the fish and they fail a bit on the fictional side.",
            "But this is because anyway, with with this approach we this is not strong aspect at the moment of the approach, so this is something that we are going to work on."
        ],
        [
            "We also do data processing study and we submitted an we gave participants in the study at least of what if ideas and we ask them to to.",
            "Ranged in in in terms of a general impression.",
            "An ordinary aspects.",
            "We have full surveys for different."
        ],
        [
            "Always and there we we selected the ideas from the consonant approach, because we could be very focused.",
            "So we selected the Disney character.",
            "My characters are.",
            "There were two types of ideas concerning chaining.",
            "This means ideas that produce many two or more chains of possible narratives saying it's away and not changing that.",
            "Our ideas, that being that were trivial that then produce from which there were no derivations of facts from concept net, and we evaluated for questions a general impression, an emotional response.",
            "I love expectation, quality and quality and quantity for bloodlines.",
            "We have"
        ],
        [
            "130 participants in native and non native speakers.",
            "We found that the ideas that they have changed the life from then run around one position higher than the non chain idea.",
            "So these give a shows that there is a reliable measure there to evaluate the value of the fictional ideas.",
            "In there is a mix survey.",
            "Sorry, just because of the time, but we have mixed survey with different types of ideas with different relations from consonant and capable of desires and located near and we wanted to see which type of idea they users preferred and we see the capable of ideas rank higher like what if there was a little bit who couldn't make honey?",
            "This our hypothesis is that because the facility of the fictional character characters a fail in the order types of ideas.",
            "So for instance we have.",
            "With this idea we had one that was.",
            "What if there was a little girl who was afraid of eating and some of the participants of the survey said, well, when, like anorexic, go in his name movie.",
            "So this, for instance, are little bear who couldn't learn to fly.",
            "Has better reception because it was reminiscent of an existing Disney character and then animated film Reel.",
            "We found."
        ],
        [
            "Positive correlations between the aspects emotional response level of expectation of quality and quantity of bloodlines we general impression.",
            "So we see that these are key components of general impression.",
            "An positive correlation between the changing scores and concentrate a relationship scores with the average participant rankings.",
            "So we can see that with this we talking we can maybe use the information of the scores to predict people's preferences.",
            "So with an experiment.",
            "With my chin let with different machine learning techniques an in general we found that we compare it with 50% accuracy.",
            "The preferences of people.",
            "Um?"
        ],
        [
            "We have what if a prototype of the machine do I have time to very quick?",
            "Yeah, Ann.",
            "So we have an online prototype.",
            "Machine so you can select the category animal fruit difference the relation and then the results elation so you can tell the machine.",
            "Give me the best one, the top or the top ones.",
            "Which are the best or any of them.",
            "And then here be quick little and this is playing with the scores of concept net so.",
            "And the chains.",
            "Anne.",
            "So here there are some ideas and I don't have time to keep going on that.",
            "Please play with the machine."
        ],
        [
            "Anne.",
            "Couldn't future work in improving the chaining technique, focusing on temporal kausal and properties and sentiment analysis and we will work hopefully with a pool and Carlos on this and the negative side.",
            "We have we plan application applying this in different domains.",
            "For instance we have in Goldsmiths annual PhD project on Idea based game that may might mention it this time and explore different types of rendering.",
            "So we as I said before play with poems or a reader and I wanted to show this is very basic.",
            "Is just sentences statements that rhyme and I wanted to work from last week.",
            "So I just started it but if you had the.",
            "Idea what if there was an animal that lose a boy part they generate this very basic point or if there was a dog that lost his cool.",
            "Knows what if there was a dog that lost his good gnomes, or if there was a dog that lose his wet nose or if there was a monkey.",
            "Tell us his nose."
        ],
        [
            "ANSI, please go to page with the win project and play with the washing machine and thank you.",
            "So for the concept net stuff, a lot of it seemed to be the negation of capabilities or things that were associated with the topic.",
            "Is there any way to do the opposite?",
            "You know, like a fit.",
            "Rather, what are the challenges in doing the opposite?",
            "So going from something that can't do something to something that can?",
            "Is it the same problem in concept net basically, or is.",
            "It a really much broader open ended problem.",
            "Do you mean like a something like somebody is capable of doing something and then?",
            "Explore, explore translating that.",
            "Well, I guess wanted asking is like is concept net.",
            "I'm not familiar with the details.",
            "Is it explicit about things that you can't do?",
            "Yeah I mean OK?",
            "So then it's basically these files saying I left a concert in the left hand side, then the relation that is capable of Annan something in the right hand size is completely specifically explain.",
            "OK so it is exposed.",
            "OK, that answers that never mind.",
            "OK, thank you very much and you can move on now."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And good morning, yeah, this is joint work with people from Goldsmiths, University of London.",
                    "label": 0
                },
                {
                    "sent": "Just have Steven Institute and the University of Cambridge.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As we have seen that in this week, computational creativity has progress in in the generation of artifacts with cultural value.",
                    "label": 0
                },
                {
                    "sent": "So we have seen the generation of poems, images, stories.",
                    "label": 0
                },
                {
                    "sent": "But all these artifacts when they are created by people, they embed a fictional idea and then these ideations process is key or central to the generation of this time.",
                    "label": 0
                },
                {
                    "sent": "This type of.",
                    "label": 0
                },
                {
                    "sent": "Effects, in particular with the word that we present here.",
                    "label": 0
                },
                {
                    "sent": "We are interested in fictional ideations, which is the process of creating new ideas which are not meant to describe a current truth about the world.",
                    "label": 1
                },
                {
                    "sent": "And this is precise.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Really, the purpose of the wind project, which is aimed at investigating fictionalization from a computational perspective.",
                    "label": 1
                },
                {
                    "sent": "Women stands for the what if machine that is a.",
                    "label": 0
                },
                {
                    "sent": "We hope we expect the outcome of this project and so forth that would present fictional ideas in the form of what if statements, alongside stories or poems so different, kind of representations.",
                    "label": 0
                },
                {
                    "sent": "Along with what if ideas?",
                    "label": 0
                },
                {
                    "sent": "So the project is there are five teams involved involved in the project, and each team is responsible for one aspect of the fit of the ideations process.",
                    "label": 0
                },
                {
                    "sent": "The University in the University of Cambridge there responsible for building the world knowledge that is analyzing a domain and giving information about the facts, the norms and everything that could be found out that domain then.",
                    "label": 0
                },
                {
                    "sent": "University College Dublin are responsible for taking that knowledge and generating fictional ideas about them.",
                    "label": 0
                },
                {
                    "sent": "Then at the University are complete, complete and semi read an is that they are responsible for generating narratives based on the what if ideas of the fictional ideas, then a Goldsmith.",
                    "label": 0
                },
                {
                    "sent": "We are responsible for rendering a presenting different renderings for these narratives.",
                    "label": 0
                },
                {
                    "sent": "So, as I said before, maybe different poems, the former stories and different kind of renderings that would increase the appreciation of the fictional ideas.",
                    "label": 0
                },
                {
                    "sent": "And the Joseph Stephen Institute.",
                    "label": 0
                },
                {
                    "sent": "They are in charge of creating models that can evaluate a depreciation of the ideas by people.",
                    "label": 0
                },
                {
                    "sent": "And so we can predict a how an idea would be pretty appreciated by people.",
                    "label": 0
                },
                {
                    "sent": "So today we're going to present a. I'm going to present 3 baseline methods for fictional ideations and still getting an early stage of the project and the idea with the contribution with the paper is to present what is what is currently the approaches that we know to fictional ideations so that in the future we can compare the progress that we have made against this these approaches.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the first approach is consonant based approach, so you have heard from Tony's at talks.",
                    "label": 0
                },
                {
                    "sent": "A consumer is a semantic network, hominan knowledge, information that is mined from the web, and it's from the MIT Media Lab.",
                    "label": 1
                },
                {
                    "sent": "Inconsistent information is represented by facts that have a array left hand side and right hand side concept, and a relation that explains how.",
                    "label": 0
                },
                {
                    "sent": "Two concepts are related.",
                    "label": 0
                },
                {
                    "sent": "An_that is kind of measure of the strength of the relation.",
                    "label": 0
                },
                {
                    "sent": "So for example, an example of a fact would be be capable of make honey, which is a score of two.",
                    "label": 0
                },
                {
                    "sent": "An something consonant is has a set of relations, so for each one of them, is this capable of an is a closed set of relations?",
                    "label": 0
                },
                {
                    "sent": "So the way we generate fictional ideas from this from these facts is by altering the components of the facts in different ways.",
                    "label": 0
                },
                {
                    "sent": "So for instance, from an original fact xry.",
                    "label": 0
                },
                {
                    "sent": "Can become XR prime Y in which are prime.",
                    "label": 0
                },
                {
                    "sent": "Could be the straightforward negation of the relation.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if we have the fact be capable of my honey, this can be comes up big B not capable of my honey.",
                    "label": 0
                },
                {
                    "sent": "And then we take these facts an we render them in a way to present them as our if idea.",
                    "label": 0
                },
                {
                    "sent": "So for instance, what if there was a little B who couldn't make honey?",
                    "label": 1
                },
                {
                    "sent": "We evaluate the value of the fictional idea.",
                    "label": 0
                },
                {
                    "sent": "This is a simple mechanism for evaluating them.",
                    "label": 0
                },
                {
                    "sent": "With inference chaining, so this is from the original fact we measure the quantity and and volume of the chains that can be derived from the fact, so change would be all the facts that are derived from this from the original fact.",
                    "label": 0
                },
                {
                    "sent": "And then we rank them according to scores that are given.",
                    "label": 0
                },
                {
                    "sent": "So we.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have experimented with different combinations of.",
                    "label": 0
                },
                {
                    "sent": "I'm altering concernant facts, so for this we use the flower frameworks and these are flowcharts.",
                    "label": 0
                },
                {
                    "sent": "I kind of go into a tale of the flower framework, but please see Jones talk tomorrow Friday he will explain very nice framework, so we have experimented with different combinations of these.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have presented by.",
                    "label": 0
                },
                {
                    "sent": "Generating this night type characters or if there was a little cat who learn how to ride a bike.",
                    "label": 1
                },
                {
                    "sent": "Really sad, what if you paint at all thing that was made out of gold.",
                    "label": 0
                },
                {
                    "sent": "So for instance you can see that there are different concept windows here so different facts are coming in and we are exploring how we can change the arguments and combining 2X to generate these ideas.",
                    "label": 0
                },
                {
                    "sent": "Superhero like what if there was a police officer who had fair wings like a bird?",
                    "label": 1
                },
                {
                    "sent": "Despite both Kafka, what if there was a woman who woke up in the Sky as a bird who could but could still speak or consequences like, what if there was an old dog who couldn't run anymore, which he used to do for fun, so decided instead to ride a horse.",
                    "label": 1
                },
                {
                    "sent": "One of Simon's favorite.",
                    "label": 0
                },
                {
                    "sent": "And so this is the concept based approach.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Second approach is the reverbed based approach and this by Mark in Cambridge and River is an open information extraction so far which obtains fax also from the web is very similar, similar to concern at the differences that River has an open set of entities and relations.",
                    "label": 1
                },
                {
                    "sent": "So different concept that has a constraint or limited set of relations that can be used.",
                    "label": 0
                },
                {
                    "sent": "And with the River approach, the fictional ideas are generated by substituting one of the arguments in the facts with alternative entities.",
                    "label": 0
                },
                {
                    "sent": "So for instance.",
                    "label": 0
                },
                {
                    "sent": "From the fact X or Y, then we find facts with explain RY Prime so that we keep the relation and then we find alternatives arguments to initial fact and then we form a new fact.",
                    "label": 0
                },
                {
                    "sent": "I sorry a new idea.",
                    "label": 1
                },
                {
                    "sent": "Fictionally the other is XRY prime, which has not been have not seen before.",
                    "label": 0
                },
                {
                    "sent": "So for instance we have cattle evolved 2 egress an sorry forgot.",
                    "label": 0
                },
                {
                    "sent": "Please, an something evolved to eat meat, then we can form the fictional idea is what if cattle evolved to eat meat?",
                    "label": 1
                },
                {
                    "sent": "So again.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A we have generated different ideas from these.",
                    "label": 0
                },
                {
                    "sent": "So examples are from the original fat cattle occupy a unique role in human history.",
                    "label": 1
                },
                {
                    "sent": "So what if cattle occupy occupy a universal in mind, immoral distributed systems?",
                    "label": 0
                },
                {
                    "sent": "A Scotland is steeped in history.",
                    "label": 1
                },
                {
                    "sent": "What if Scotland is steeped in tradition?",
                    "label": 1
                },
                {
                    "sent": "Scotland is a part of the United Kingdom.",
                    "label": 1
                },
                {
                    "sent": "What ifs: is a part of life.",
                    "label": 0
                },
                {
                    "sent": "Scotland is in Britain, but if Scotland is improving.",
                    "label": 0
                },
                {
                    "sent": "Hell yeah this this at some of the examples of the generate efficient ideas.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the third approach is by Sociative discovery approach.",
                    "label": 0
                },
                {
                    "sent": "This actually was presented a last year in the conference, and so by Association explains when a problem, idea or event situation is perceived simultaneously in two or more domains, and this is by finding something that is called B terms.",
                    "label": 1
                },
                {
                    "sent": "So given two domains, for instance the migraine and then domain magnesium.",
                    "label": 0
                },
                {
                    "sent": "Then finding common terms, but are common terms that are not very frequent.",
                    "label": 0
                },
                {
                    "sent": "There is a set of heuristics going on to be able to to select this these terms and I don't have time to go into it.",
                    "label": 0
                },
                {
                    "sent": "But so for instance we can see that, for instance, say that a migraine could be magnesium.",
                    "label": 0
                },
                {
                    "sent": "The term is for instance calcium this, so there is a system called the crispy system which is used to rank them B terms.",
                    "label": 1
                },
                {
                    "sent": "And in the in the context of fictional ideations, we have used this ranking as a measure to rank a.",
                    "label": 0
                },
                {
                    "sent": "Compound sentences from two different domains so as to create a creative statements in for for the context of here we have experimental away by a link.",
                    "label": 1
                },
                {
                    "sent": "What if tweets and moral statements for from alsops fables?",
                    "label": 0
                },
                {
                    "sent": "So for instance, here we have some of the.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Samples generated by.",
                    "label": 0
                },
                {
                    "sent": "By this approach, the first statement is the tweet and the second one is the model statement and the word involved is the B term.",
                    "label": 0
                },
                {
                    "sent": "So for instance, what if a call myself, the Pope, then charge into Vatican and demanded I do it to the left with an old man?",
                    "label": 1
                },
                {
                    "sent": "Every man should be content to mind his own business.",
                    "label": 1
                },
                {
                    "sent": "A what if I was not actually a short 16 year old girl but six feet, 2 inch 49 year old man?",
                    "label": 1
                },
                {
                    "sent": "One man's pleasure maybe another another Spain.",
                    "label": 0
                },
                {
                    "sent": "But if the most travel time is now travel constant direction will be suspected.",
                    "label": 0
                },
                {
                    "sent": "So these are some examples so.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Wanted to to evaluate in in some way, like a baseline evaluation of of how good the quality of the output generated by this approach is.",
                    "label": 0
                },
                {
                    "sent": "So we use the correlation coefficient introduced by cotton and Wiggins.",
                    "label": 0
                },
                {
                    "sent": "So what we do is that each of the members of the teams manually choose the proportion of ideas that were understandable and fiction by understand the world.",
                    "label": 1
                },
                {
                    "sent": "We mean they were well defined, not necessarily.",
                    "label": 0
                },
                {
                    "sent": "They make sense, but because it's fictional radiation.",
                    "label": 0
                },
                {
                    "sent": "So there is a lot to imagine, but basically where they were syntactically well well defined with the concept that approach with this.",
                    "label": 0
                },
                {
                    "sent": "By the way, this in different of different of the flow charts that show before we play with this, T1 and T2 are the scores of the consigment facts.",
                    "label": 0
                },
                {
                    "sent": "So we play by increasing the score of the concept.",
                    "label": 0
                },
                {
                    "sent": "Net facts we can see that a.",
                    "label": 0
                },
                {
                    "sent": "In the way we increase the score, the output was less, but then the quality was better.",
                    "label": 0
                },
                {
                    "sent": "So we can say for instance here in this case when the two.",
                    "label": 0
                },
                {
                    "sent": "Concept knows these are two concept nodes have a score of 520 jail, 27 ideas and all of them were were good.",
                    "label": 0
                },
                {
                    "sent": "So we can control the quality of the ideas by playing with a score of concept net.",
                    "label": 0
                },
                {
                    "sent": "With the reverse approach, we generate the 500 fictional ideas and again we look at how many of them were fictional.",
                    "label": 0
                },
                {
                    "sent": "It quite a good percentage 19.9 and understand the whole 94.6 but with other population there was an additional aspect.",
                    "label": 0
                },
                {
                    "sent": "At there is a challenge now is that because the substitutions are not controlled and there were some high proportion of duplicates so?",
                    "label": 0
                },
                {
                    "sent": "If we remove the duplicates, the coefficient is 7073.6 is still high coefficient.",
                    "label": 0
                },
                {
                    "sent": "So in order by choosing the ideas that they have any of the problem that they were fictional understandable and they were not duplicates.",
                    "label": 0
                },
                {
                    "sent": "The coefficient is 59.1.",
                    "label": 0
                },
                {
                    "sent": "OK, and with something similar with a by cities query approach by combining the reason the animal terms, one of them by guided by the strain of the B term and then guide just randomly commit random combinations and.",
                    "label": 0
                },
                {
                    "sent": "With that with diversity is clearly we found that most of them were understand overseas anyway.",
                    "label": 0
                },
                {
                    "sent": "They already are a sentences that are well formed, but the fish and they fail a bit on the fictional side.",
                    "label": 0
                },
                {
                    "sent": "But this is because anyway, with with this approach we this is not strong aspect at the moment of the approach, so this is something that we are going to work on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also do data processing study and we submitted an we gave participants in the study at least of what if ideas and we ask them to to.",
                    "label": 0
                },
                {
                    "sent": "Ranged in in in terms of a general impression.",
                    "label": 0
                },
                {
                    "sent": "An ordinary aspects.",
                    "label": 0
                },
                {
                    "sent": "We have full surveys for different.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Always and there we we selected the ideas from the consonant approach, because we could be very focused.",
                    "label": 0
                },
                {
                    "sent": "So we selected the Disney character.",
                    "label": 0
                },
                {
                    "sent": "My characters are.",
                    "label": 0
                },
                {
                    "sent": "There were two types of ideas concerning chaining.",
                    "label": 1
                },
                {
                    "sent": "This means ideas that produce many two or more chains of possible narratives saying it's away and not changing that.",
                    "label": 1
                },
                {
                    "sent": "Our ideas, that being that were trivial that then produce from which there were no derivations of facts from concept net, and we evaluated for questions a general impression, an emotional response.",
                    "label": 0
                },
                {
                    "sent": "I love expectation, quality and quality and quantity for bloodlines.",
                    "label": 1
                },
                {
                    "sent": "We have",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "130 participants in native and non native speakers.",
                    "label": 1
                },
                {
                    "sent": "We found that the ideas that they have changed the life from then run around one position higher than the non chain idea.",
                    "label": 1
                },
                {
                    "sent": "So these give a shows that there is a reliable measure there to evaluate the value of the fictional ideas.",
                    "label": 1
                },
                {
                    "sent": "In there is a mix survey.",
                    "label": 0
                },
                {
                    "sent": "Sorry, just because of the time, but we have mixed survey with different types of ideas with different relations from consonant and capable of desires and located near and we wanted to see which type of idea they users preferred and we see the capable of ideas rank higher like what if there was a little bit who couldn't make honey?",
                    "label": 0
                },
                {
                    "sent": "This our hypothesis is that because the facility of the fictional character characters a fail in the order types of ideas.",
                    "label": 0
                },
                {
                    "sent": "So for instance we have.",
                    "label": 1
                },
                {
                    "sent": "With this idea we had one that was.",
                    "label": 0
                },
                {
                    "sent": "What if there was a little girl who was afraid of eating and some of the participants of the survey said, well, when, like anorexic, go in his name movie.",
                    "label": 1
                },
                {
                    "sent": "So this, for instance, are little bear who couldn't learn to fly.",
                    "label": 1
                },
                {
                    "sent": "Has better reception because it was reminiscent of an existing Disney character and then animated film Reel.",
                    "label": 0
                },
                {
                    "sent": "We found.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Positive correlations between the aspects emotional response level of expectation of quality and quantity of bloodlines we general impression.",
                    "label": 1
                },
                {
                    "sent": "So we see that these are key components of general impression.",
                    "label": 0
                },
                {
                    "sent": "An positive correlation between the changing scores and concentrate a relationship scores with the average participant rankings.",
                    "label": 0
                },
                {
                    "sent": "So we can see that with this we talking we can maybe use the information of the scores to predict people's preferences.",
                    "label": 0
                },
                {
                    "sent": "So with an experiment.",
                    "label": 0
                },
                {
                    "sent": "With my chin let with different machine learning techniques an in general we found that we compare it with 50% accuracy.",
                    "label": 0
                },
                {
                    "sent": "The preferences of people.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have what if a prototype of the machine do I have time to very quick?",
                    "label": 0
                },
                {
                    "sent": "Yeah, Ann.",
                    "label": 0
                },
                {
                    "sent": "So we have an online prototype.",
                    "label": 0
                },
                {
                    "sent": "Machine so you can select the category animal fruit difference the relation and then the results elation so you can tell the machine.",
                    "label": 0
                },
                {
                    "sent": "Give me the best one, the top or the top ones.",
                    "label": 0
                },
                {
                    "sent": "Which are the best or any of them.",
                    "label": 1
                },
                {
                    "sent": "And then here be quick little and this is playing with the scores of concept net so.",
                    "label": 0
                },
                {
                    "sent": "And the chains.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "So here there are some ideas and I don't have time to keep going on that.",
                    "label": 0
                },
                {
                    "sent": "Please play with the machine.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Couldn't future work in improving the chaining technique, focusing on temporal kausal and properties and sentiment analysis and we will work hopefully with a pool and Carlos on this and the negative side.",
                    "label": 0
                },
                {
                    "sent": "We have we plan application applying this in different domains.",
                    "label": 0
                },
                {
                    "sent": "For instance we have in Goldsmiths annual PhD project on Idea based game that may might mention it this time and explore different types of rendering.",
                    "label": 1
                },
                {
                    "sent": "So we as I said before play with poems or a reader and I wanted to show this is very basic.",
                    "label": 0
                },
                {
                    "sent": "Is just sentences statements that rhyme and I wanted to work from last week.",
                    "label": 0
                },
                {
                    "sent": "So I just started it but if you had the.",
                    "label": 0
                },
                {
                    "sent": "Idea what if there was an animal that lose a boy part they generate this very basic point or if there was a dog that lost his cool.",
                    "label": 1
                },
                {
                    "sent": "Knows what if there was a dog that lost his good gnomes, or if there was a dog that lose his wet nose or if there was a monkey.",
                    "label": 1
                },
                {
                    "sent": "Tell us his nose.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "ANSI, please go to page with the win project and play with the washing machine and thank you.",
                    "label": 0
                },
                {
                    "sent": "So for the concept net stuff, a lot of it seemed to be the negation of capabilities or things that were associated with the topic.",
                    "label": 0
                },
                {
                    "sent": "Is there any way to do the opposite?",
                    "label": 0
                },
                {
                    "sent": "You know, like a fit.",
                    "label": 0
                },
                {
                    "sent": "Rather, what are the challenges in doing the opposite?",
                    "label": 0
                },
                {
                    "sent": "So going from something that can't do something to something that can?",
                    "label": 0
                },
                {
                    "sent": "Is it the same problem in concept net basically, or is.",
                    "label": 0
                },
                {
                    "sent": "It a really much broader open ended problem.",
                    "label": 0
                },
                {
                    "sent": "Do you mean like a something like somebody is capable of doing something and then?",
                    "label": 0
                },
                {
                    "sent": "Explore, explore translating that.",
                    "label": 0
                },
                {
                    "sent": "Well, I guess wanted asking is like is concept net.",
                    "label": 0
                },
                {
                    "sent": "I'm not familiar with the details.",
                    "label": 0
                },
                {
                    "sent": "Is it explicit about things that you can't do?",
                    "label": 0
                },
                {
                    "sent": "Yeah I mean OK?",
                    "label": 0
                },
                {
                    "sent": "So then it's basically these files saying I left a concert in the left hand side, then the relation that is capable of Annan something in the right hand size is completely specifically explain.",
                    "label": 0
                },
                {
                    "sent": "OK so it is exposed.",
                    "label": 0
                },
                {
                    "sent": "OK, that answers that never mind.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much and you can move on now.",
                    "label": 0
                }
            ]
        }
    }
}