{
    "id": "lhp7x4lkrlmd4nln32iocl7tu6ep4l7e",
    "title": "Automating Quantitative Narrative Analysis of News Data",
    "info": {
        "author": [
            "Saatviga Sudhahar, Intelligent Systems Laboratory, University of Bristol"
        ],
        "published": "Nov. 11, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/wapa2011_sudhahar_quantitative/",
    "segmentation": [
        [
            "Good afternoon, I am South Vegas there.",
            "Her from the Intelligent Systems Laboratory, University of Bristol.",
            "So today I'm going to give talk about automating quantitative narrative analysis of news data.",
            "This work was supported by Roberto friend Susie from the Department of Socialogy in Emory University and Nello Cristianini, my supervisor from."
        ],
        [
            "They must have crystal.",
            "So first I'll be giving a brief introduction of what we're doing here and then the goals, and I'll be talking a little bit about related work and giving a brief introduction of the system pipeline that we have developed, and I'll be going through some experiments and results an discussing a little bit about network analysis, and finally the conclusion and future work.",
            "So to introduce."
        ],
        [
            "Is the analysis of news media content is crucial for social science research where sequence of social historical events are studied?",
            "So an event according to social scientists is an action that is performed by a human being.",
            "It can also be summed up by a verb or a name of action and this is according to Roberto Friend.",
            "So see.",
            "So how can an event be represented in news for example in crime news and even could be expressed in the form of.",
            "An actor doing an action to another actor, for example, the police arrested.",
            "A thief could be represented as an actor doing the action arrest to another actor, the thief.",
            "So how could this be represented in computational linguistics?"
        ],
        [
            "Is that it could be represented in the form of a semantic triplet which has a subject and then a verb, and then the object of the verb.",
            "So this structure is also referred to as a story grammars and this has been used in the field of quantitative narrative analysis.",
            "This is the analysis of narrative text and the advantage here is it analyzes social reality in terms of actors rather than variables.",
            "So that is the disadvantage here is that it is labor intensive, which means all parsing of natural text has to be done by hand to convert it into this form of story grammar.",
            "So one of our motivations of this study is to automate this process by using statistical approaches and methods."
        ],
        [
            "So we present a working system for large scale quantitative narrative analysis of news and we have experimented with the 100,000 articles in crime from the New York Times Corpus and the New York Times has classified articles into different topics like crime, business, sports, top news, and most popular news, etc.",
            "So we have used crime and then the top news articles for our experiments.",
            "So the system automatically extracts the SPO triplets that is the subject, verb, and object triplets out of the data, and from then onwards we use that information to do further experiments aimed at capturing the role of key actors in the news.",
            "So we introduce a weighting scheme to wait the actors to identify the key players in a given domain, and then we analyze the centrality of actors by creating networks of them.",
            "We identify the most influential characters in the news narratives, and then we also classify the types of actions to further analyze the roles different actors play.",
            "What types of actions they are involved in, and then we detect the role in time by analyzing the time series of factors.",
            "And finally we also identify the subjectivity and the objectivity bias of actors in news."
        ],
        [
            "To talking about related work, so our approach builds on the idea presented by.",
            "Failure is when people from the Joseph Steven Institute in Libyana and they have done this for purposes of triplet extraction antics, summarisation.",
            "And also it was this was later developed to generate event templates which is much more related to information extraction.",
            "So we develop these ideas in various ways in order to address the needs in Q&A.",
            "So our goal is to create this working system that can scale to large very large corpora.",
            "So here I will give a brief introduction about the system pipeline."
        ],
        [
            "So first we extract the data from the New York Times Corpus and then we perform coreference resolution which is the identification of surface terms that refer to the same entity using gate which is the agenda architecture for text engineering and we find all this core references and replace this with one unified expression in text and after that we do an affordable solution which is the identification of pronouns and then.",
            "We identified the refering entities and replace the pronouns with those entities, so I'll be giving an example of this on the following slides and then soon after this is done, we give this to our parser which is called mini part which is available already and then from the parser output we extract the triplets and store in our database and then we wait the actors and actions and finally we get the results.",
            "So for."
        ],
        [
            "Sample this is a news article which says Perry criticizes Obama for dangerous Middle East policy, so this is an article about this from the right."
        ],
        [
            "Yes.",
            "First we identify Coreference is like in this article Rick Perry is referred to as Perry.",
            "In different instances an barrack Obama is referred to as Obama in different express."
        ],
        [
            "So we resolved the core references by replacing Rick Perry with Perry and Barack Obama with Obama.",
            "So once the Co references are resolved.",
            "We identify the pronouns refering each other.",
            "Here you could see the Texas governor sought to draw Jewish voters support in his bid.",
            "So here the hiss would get replaced by the."
        ],
        [
            "Corner and you could also see so many hits and they and all this would be replaced with the re furring."
        ],
        [
            "Entities, so after performing Anna for a solution, there would not be any pronouns in the text, so this is really important for us, because when we extract the triplets we don't want to have pronouns in the text, so we actually want to know who did what to whom.",
            "So after doing this.",
            "This is the positive used and this is a dependency parser built by."
        ],
        [
            "Angling in 1998.",
            "So an evaluation with the Suzan Corpus shows that this parser achieves 88% precision.",
            "An 80% recall with respect to dependency relationships, and it also tags each word in the sentence with grammatical relation.",
            "For example, these are a set of relations that it acts with.",
            "The first one is I, that is, the relationship between ASI Clause and and I cross OC clauses.",
            "The sentence which has a subject and a predicate Annonay clause is called an inflectional clause, which has a verb in a finite form.",
            "So the eye refers to a verb in a sentence, and then S refers to a subject.",
            "Obg refers to the object of verbs and some other grammatical relations like prepositions and nominal complement of prepositions, and so on.",
            "So once the article is given to this."
        ],
        [
            "Faster.",
            "It gives an output like this.",
            "For example the article we gave here is like very accusing President Obama.",
            "So Perry is tagged with the relation S, which means that it is the subject of the sentence and accused is being tagged with I and the object of this action.",
            "That is, the president is stacked with OBJ and Obama is tagged with person.",
            "So what we do here is we extract these relations with the South.",
            "IOBJ in person relation and then we form a triplet from this."
        ],
        [
            "So from this article these are the triplets that we could get from the system which is the Perry accusing President Obama and Perry lead polls very have directive Perry make for a Palestinians prepare bid and so also.",
            "The final output of this article would be like this and we store this information in the database with all the information including from which article it came from, in which news outlet and the time stamps and all these things."
        ],
        [
            "So once we have this information, we identify the key actors and actions in the news.",
            "So to do this we got 180 thousand articles from the topic top News World in the New York Times.",
            "And then we wait them according to their frequencies, frequency of the actor or action in crime by the frequency of the actor or action outside crime in a more general topic.",
            "So the actors who are most specific to crime.",
            "Would get a highest weight, so according to the rankings of this weighted subjects we could see in 2002, Pataki was the actor who had the highest weight, and then there was diocese and archdiocese and then Cardinals and bishops.",
            "And this says something about something abnormal because it involves Cardinals and bishops in the key actors, which means in 2002 there was this.",
            "An issue about priests involving in sexual abuse in the US that is in Boston so we could see that the system picks this up and shows this that they were the key actors during 2002 Anne."
        ],
        [
            "If you look at the weighted actions again, the top one was smallest and plead and you could see actions like abuse, mishandle and things like that.",
            "So it reveals that same story again and again, and then in the weighted objects the key actor was sacharias Musset, who was thought to be a victim in the September 11 attack.",
            "So he was he appeared as the highest weighted object.",
            "In the system.",
            "So by doing this we identify the key actors and actions in the system and."
        ],
        [
            "Using that, we moved on to create triplet networks.",
            "So we thought with this networks we could analyze the features of the network and identify the centrality of these actors.",
            "So we filtered the triplets that contain the top 300 key actors and actions each year.",
            "So how we did this is we selected a threshold of for the weights and we eliminated all the actors below that threshold.",
            "And for these actors we created networks in the following two cases.",
            "That is, in a triplet.",
            "If it contains a key subject, a key action, and an object, or if it contains a subject with the key action with the key object.",
            "We filter this and then we create networks out of this.",
            "We also tried to create networks out of frequent triplets, but they were not really revealing interesting relations because the frequent triplets did not have interesting actions.",
            "They were like mostly police saying something to somebody or reporters reporting something.",
            "So we thought this method is much more interesting and reveals more information.",
            "So we generated director networks using Cytoscape.",
            "Which is a gentle platform for network analysis and the networks had subjects an objects as nodes and the verbs linking them as edges."
        ],
        [
            "So this is a simple network in 2002 on the left it shows the whole network and I have highlighted the Note priest and the interaction of this note with other nodes in the network and it was like you could see the priest was involved in abusing and molesting all the time and you could specially it's really clear that you can see the actors like Michael, Kenneth Morrison and.",
            "Blackwell, James Porter all all these people were victims of those crimes and the girls and boys were all the victims, so this shows that this from this network you could see it.",
            "You could also see the direction with those arrows as well an."
        ],
        [
            "If you look at a network of prosecutors, you could see they were always involved in investigating or characterizing, believing, answering or contacting so you could see which actors involved in what kind, what type of actions.",
            "So the networks itself provide this information for us."
        ],
        [
            "This is another network showing the interactions between judge and the jury, and then are the actors in the network.",
            "So with this network we could identify that these type of actors involved in this.",
            "This kind of actions.",
            "This is really important in the field of quantitative narrative analysis because currently all these are done manually and it takes a lot of time.",
            "Um, a similar kind of work has been done in the humanities recently by Franco Moretti from the Stanford Literary Lab, so they have converted novels into.",
            "Graphs like this and then they have identified the centrality of actors, but again they do it by hand.",
            "So here it is automatic.",
            "And."
        ],
        [
            "Once the networks are there, then we could analyze the topological properties of the networks.",
            "So we thought of analyzing the centrality of networks using measures like between US centrality and then the indegree and outdegree and the page rank and the hits.",
            "We also apply the hits algorithm which is by John Kleinberg which talks about hubs and authorities and we applied all these to our networks and then ranked actors according to these values.",
            "You could see on the right the net the charts with ranks actors according to this.",
            "For between US centrality in degree and out degree.",
            "And here again, you could see the actors.",
            "The first one shows something called low.",
            "This is quite ambiguous here because the person who was involved in this sexual crime was named Bernard Law.",
            "So that could also mean that and then archdiocese and again the same kind of factors appear there.",
            "The Indegree was again showing something like cases case allegations, boys and things like that.",
            "And the outdegree was really high for the priests and judges again."
        ],
        [
            "The same thing with the page rank hub and authority, so all these measures were done using cytoscape, an giffy, which is also a network analysis tool, which is an open source tool as well."
        ],
        [
            "And then we rank this actors according to this.",
            "And this is shown in the table.",
            "So these are the top 10 most central actors in 2002 according to all network measures.",
            "And the next."
        ],
        [
            "We were also interested in identifying Spears of interaction because it is also common to investigate this.",
            "In Q&A the Spears of interaction between actors means, for example, communication or it could be aggression.",
            "It could be violent crime etc.",
            "So what we did is we classified actions into different types and then we analyzed the triplets according to that.",
            "So we classified them according to these two categories.",
            "In 2002, which is a crime against person and crime against properties, for example, actions like Kill a murder or slay would appear in crime against person and crime against property.",
            "It would be like slaughter or thieves or steal a property.",
            "So in 2002 the most of the network was again about crime against person an little bit about crime against property.",
            "So once we have this."
        ],
        [
            "We identified who are the frequent subjects and objects involved in this, so this shows the top 10 ranked subjects and objects in crime against person and crime against property.",
            "So all this is done with only the key actors and actions that we have identified so.",
            "Here you could see the top highest rank subject in crime against person was priest and then men and then the objects were child, girl and woman.",
            "So it is interesting to see here that men were responsible for crimes and while women and children are most often the objects of crimes and you take the crime against property again man police and soldiers were the subjects and the most frequent object was money.",
            "And bank."
        ],
        [
            "Um?",
            "We also performed a time series analysis on actors and we thought it's interesting to to see the role of factors in a time series.",
            "So we were analyzing data from 1987 to 2007 in New York time, so it's it's really 20 years.",
            "So we did all the experiments for all these 20 years an for the time series analysis we considered the frequency.",
            "The out degree and the hub value to plot these actors.",
            "So according to the actor archdiocese, his frequency was really high in 2002 and the out degree an hub also denotes that his he was the key actor in 2002 and we did this."
        ],
        [
            "Same for actions as well.",
            "Here you could see the first one is more, lest we just really high in 2002.",
            "Played was really high in 2001 and 2002.",
            "During the September 11 attack, and abuse was really high in 2002.",
            "Again, kill was really high into the slim one.",
            "Rape was always the same.",
            "I mean, it's really consistent and the word attack is really mentioned very high in 2001.",
            "So.",
            "All this this is automatic through the system and it's really important for the narrative analysis of news."
        ],
        [
            "And finally, we we also identified this subjectivity and objectivity bias or factors becausw.",
            "It shows the tendency to be portrayed as an active or passive passive element in the story.",
            "So we computed the subject object buyers of actors by again considering their frequencies in crime and also in top news.",
            "So if.",
            "So the F here shows the frequency of the actor K as a subject or object in crime, and the same it is divided by the frequency of actor K as a subject.",
            "In top News Plus as an object in top news.",
            "So with this we could see how subjective or objective an actor is specific into crime.",
            "So here we have plotted this."
        ],
        [
            "In a 2 dimensional scatterplot showing the subject, an object bias.",
            "Here you will see that most often named entities and people like detectives, diocese, Giuliani and they are the people who have the highest subject bias and the object bias was always high for concepts like discretion and noun phrases like World Trade Center abuses and things like that.",
            "So the key actors were not only a people, they were also noun phrases and concepts like this."
        ],
        [
            "So what we conclude here is we demonstrated a system for automating the narrative analysis of news, which is a traditional labor intensive tasks, and this builds on various contributions from the field of pattern analysis.",
            "But there could be possible errors in the steps of Coreference resolution and pronoun resolution or other steps to passing.",
            "But when considered the whole output, this could be ignored and the pastor which we use.",
            "Is called Minneopa, which has a limit that passed sentences within a limit of 1024 characters, but we found that a typical sentence in news just contains 45 to 50 words, so this could be this limit is fine with that and.",
            "The future work will involve both the validation of the performance and then the deployment of this system to even larger analysis tasks, and the system can be also fed into the program for computer assisted coding of events which was developed by front.",
            "So C and we also look forward to integrate this in the news outlets analysis and monitoring system which is developed in the University of Bristol."
        ],
        [
            "And what we have done here is we have also analyzed articles from the US election news from 1988 to 2008, and we use triplets to infer the existence of certain relations between actors like, endorse or oppose relations.",
            "And we introduce positive and negative weights to actions in the network.",
            "And then we we have also.",
            "Completed this work for automatically identifying allegiance of actors to a party and their role in political discourse.",
            "But this work is yet to be published so.",
            "I'm sure that we also looking forward to apply this in the upcoming US elections, so I hope that we have something more interesting in the upcoming year as well, so that's."
        ],
        [
            "It from me.",
            "Thank you very much.",
            "So the question is that what's the baseline for doing this so and that we have not compared this with something else.",
            "So the thing the problem that we have here is that we have to compare this with triplets that are actually extracted by human beings and then we have to compare it with what the system does.",
            "But the problem is.",
            "We don't have that kind of information yet, but this person from the US West Robert or friends or so he is doing this by hand.",
            "So he has promised us to give all his set of articles and the past grammar that he has.",
            "But once we have that, we could evaluate this and see.",
            "But when we presented this to him, but he said that this is fine, but he'll be giving us to evaluate this more.",
            "And.",
            "Coming back to the second question, can you?",
            "Yeah, basically.",
            "Send a send me about ground truth.",
            "I mean, we assume that the human that will do this manually will is some kind of definition of ground truth here.",
            "But the other question is other most simple methods that would give just as good results.",
            "More simple methods, but we used the frequencies here but we want to analyze it more by using some network measures as well.",
            "So we could use the topological properties, but we have tried the frequency and the simple measures.",
            "So.",
            "Is it?",
            "Reading the.",
            "Yes.",
            "Maybe doing the?",
            "Resolution.",
            "You said that.",
            "Yes, yes.",
            "So I'm busy there because there might be situations.",
            "No, actually this is this.",
            "We use a jape grammar from gay.",
            "So what it does is for each and every pronoun it says, which is the antecedent string that it refers to, so.",
            "But it depends on the parser actually.",
            "If because we depend on gate no yeah yeah yeah yes.",
            "There would be errors in all these types of parsing, but.",
            "We when we consider the output, it's like it's fine, but we have to evaluate this or anything.",
            "Let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon, I am South Vegas there.",
                    "label": 0
                },
                {
                    "sent": "Her from the Intelligent Systems Laboratory, University of Bristol.",
                    "label": 1
                },
                {
                    "sent": "So today I'm going to give talk about automating quantitative narrative analysis of news data.",
                    "label": 1
                },
                {
                    "sent": "This work was supported by Roberto friend Susie from the Department of Socialogy in Emory University and Nello Cristianini, my supervisor from.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They must have crystal.",
                    "label": 0
                },
                {
                    "sent": "So first I'll be giving a brief introduction of what we're doing here and then the goals, and I'll be talking a little bit about related work and giving a brief introduction of the system pipeline that we have developed, and I'll be going through some experiments and results an discussing a little bit about network analysis, and finally the conclusion and future work.",
                    "label": 1
                },
                {
                    "sent": "So to introduce.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is the analysis of news media content is crucial for social science research where sequence of social historical events are studied?",
                    "label": 1
                },
                {
                    "sent": "So an event according to social scientists is an action that is performed by a human being.",
                    "label": 1
                },
                {
                    "sent": "It can also be summed up by a verb or a name of action and this is according to Roberto Friend.",
                    "label": 0
                },
                {
                    "sent": "So see.",
                    "label": 0
                },
                {
                    "sent": "So how can an event be represented in news for example in crime news and even could be expressed in the form of.",
                    "label": 0
                },
                {
                    "sent": "An actor doing an action to another actor, for example, the police arrested.",
                    "label": 1
                },
                {
                    "sent": "A thief could be represented as an actor doing the action arrest to another actor, the thief.",
                    "label": 0
                },
                {
                    "sent": "So how could this be represented in computational linguistics?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is that it could be represented in the form of a semantic triplet which has a subject and then a verb, and then the object of the verb.",
                    "label": 1
                },
                {
                    "sent": "So this structure is also referred to as a story grammars and this has been used in the field of quantitative narrative analysis.",
                    "label": 0
                },
                {
                    "sent": "This is the analysis of narrative text and the advantage here is it analyzes social reality in terms of actors rather than variables.",
                    "label": 0
                },
                {
                    "sent": "So that is the disadvantage here is that it is labor intensive, which means all parsing of natural text has to be done by hand to convert it into this form of story grammar.",
                    "label": 0
                },
                {
                    "sent": "So one of our motivations of this study is to automate this process by using statistical approaches and methods.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we present a working system for large scale quantitative narrative analysis of news and we have experimented with the 100,000 articles in crime from the New York Times Corpus and the New York Times has classified articles into different topics like crime, business, sports, top news, and most popular news, etc.",
                    "label": 1
                },
                {
                    "sent": "So we have used crime and then the top news articles for our experiments.",
                    "label": 0
                },
                {
                    "sent": "So the system automatically extracts the SPO triplets that is the subject, verb, and object triplets out of the data, and from then onwards we use that information to do further experiments aimed at capturing the role of key actors in the news.",
                    "label": 1
                },
                {
                    "sent": "So we introduce a weighting scheme to wait the actors to identify the key players in a given domain, and then we analyze the centrality of actors by creating networks of them.",
                    "label": 1
                },
                {
                    "sent": "We identify the most influential characters in the news narratives, and then we also classify the types of actions to further analyze the roles different actors play.",
                    "label": 0
                },
                {
                    "sent": "What types of actions they are involved in, and then we detect the role in time by analyzing the time series of factors.",
                    "label": 0
                },
                {
                    "sent": "And finally we also identify the subjectivity and the objectivity bias of actors in news.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To talking about related work, so our approach builds on the idea presented by.",
                    "label": 1
                },
                {
                    "sent": "Failure is when people from the Joseph Steven Institute in Libyana and they have done this for purposes of triplet extraction antics, summarisation.",
                    "label": 0
                },
                {
                    "sent": "And also it was this was later developed to generate event templates which is much more related to information extraction.",
                    "label": 0
                },
                {
                    "sent": "So we develop these ideas in various ways in order to address the needs in Q&A.",
                    "label": 1
                },
                {
                    "sent": "So our goal is to create this working system that can scale to large very large corpora.",
                    "label": 1
                },
                {
                    "sent": "So here I will give a brief introduction about the system pipeline.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first we extract the data from the New York Times Corpus and then we perform coreference resolution which is the identification of surface terms that refer to the same entity using gate which is the agenda architecture for text engineering and we find all this core references and replace this with one unified expression in text and after that we do an affordable solution which is the identification of pronouns and then.",
                    "label": 1
                },
                {
                    "sent": "We identified the refering entities and replace the pronouns with those entities, so I'll be giving an example of this on the following slides and then soon after this is done, we give this to our parser which is called mini part which is available already and then from the parser output we extract the triplets and store in our database and then we wait the actors and actions and finally we get the results.",
                    "label": 0
                },
                {
                    "sent": "So for.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sample this is a news article which says Perry criticizes Obama for dangerous Middle East policy, so this is an article about this from the right.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "First we identify Coreference is like in this article Rick Perry is referred to as Perry.",
                    "label": 0
                },
                {
                    "sent": "In different instances an barrack Obama is referred to as Obama in different express.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we resolved the core references by replacing Rick Perry with Perry and Barack Obama with Obama.",
                    "label": 0
                },
                {
                    "sent": "So once the Co references are resolved.",
                    "label": 0
                },
                {
                    "sent": "We identify the pronouns refering each other.",
                    "label": 0
                },
                {
                    "sent": "Here you could see the Texas governor sought to draw Jewish voters support in his bid.",
                    "label": 1
                },
                {
                    "sent": "So here the hiss would get replaced by the.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Corner and you could also see so many hits and they and all this would be replaced with the re furring.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entities, so after performing Anna for a solution, there would not be any pronouns in the text, so this is really important for us, because when we extract the triplets we don't want to have pronouns in the text, so we actually want to know who did what to whom.",
                    "label": 0
                },
                {
                    "sent": "So after doing this.",
                    "label": 0
                },
                {
                    "sent": "This is the positive used and this is a dependency parser built by.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Angling in 1998.",
                    "label": 0
                },
                {
                    "sent": "So an evaluation with the Suzan Corpus shows that this parser achieves 88% precision.",
                    "label": 1
                },
                {
                    "sent": "An 80% recall with respect to dependency relationships, and it also tags each word in the sentence with grammatical relation.",
                    "label": 1
                },
                {
                    "sent": "For example, these are a set of relations that it acts with.",
                    "label": 0
                },
                {
                    "sent": "The first one is I, that is, the relationship between ASI Clause and and I cross OC clauses.",
                    "label": 0
                },
                {
                    "sent": "The sentence which has a subject and a predicate Annonay clause is called an inflectional clause, which has a verb in a finite form.",
                    "label": 1
                },
                {
                    "sent": "So the eye refers to a verb in a sentence, and then S refers to a subject.",
                    "label": 0
                },
                {
                    "sent": "Obg refers to the object of verbs and some other grammatical relations like prepositions and nominal complement of prepositions, and so on.",
                    "label": 0
                },
                {
                    "sent": "So once the article is given to this.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Faster.",
                    "label": 0
                },
                {
                    "sent": "It gives an output like this.",
                    "label": 0
                },
                {
                    "sent": "For example the article we gave here is like very accusing President Obama.",
                    "label": 0
                },
                {
                    "sent": "So Perry is tagged with the relation S, which means that it is the subject of the sentence and accused is being tagged with I and the object of this action.",
                    "label": 0
                },
                {
                    "sent": "That is, the president is stacked with OBJ and Obama is tagged with person.",
                    "label": 0
                },
                {
                    "sent": "So what we do here is we extract these relations with the South.",
                    "label": 0
                },
                {
                    "sent": "IOBJ in person relation and then we form a triplet from this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So from this article these are the triplets that we could get from the system which is the Perry accusing President Obama and Perry lead polls very have directive Perry make for a Palestinians prepare bid and so also.",
                    "label": 0
                },
                {
                    "sent": "The final output of this article would be like this and we store this information in the database with all the information including from which article it came from, in which news outlet and the time stamps and all these things.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So once we have this information, we identify the key actors and actions in the news.",
                    "label": 1
                },
                {
                    "sent": "So to do this we got 180 thousand articles from the topic top News World in the New York Times.",
                    "label": 0
                },
                {
                    "sent": "And then we wait them according to their frequencies, frequency of the actor or action in crime by the frequency of the actor or action outside crime in a more general topic.",
                    "label": 0
                },
                {
                    "sent": "So the actors who are most specific to crime.",
                    "label": 0
                },
                {
                    "sent": "Would get a highest weight, so according to the rankings of this weighted subjects we could see in 2002, Pataki was the actor who had the highest weight, and then there was diocese and archdiocese and then Cardinals and bishops.",
                    "label": 0
                },
                {
                    "sent": "And this says something about something abnormal because it involves Cardinals and bishops in the key actors, which means in 2002 there was this.",
                    "label": 0
                },
                {
                    "sent": "An issue about priests involving in sexual abuse in the US that is in Boston so we could see that the system picks this up and shows this that they were the key actors during 2002 Anne.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look at the weighted actions again, the top one was smallest and plead and you could see actions like abuse, mishandle and things like that.",
                    "label": 0
                },
                {
                    "sent": "So it reveals that same story again and again, and then in the weighted objects the key actor was sacharias Musset, who was thought to be a victim in the September 11 attack.",
                    "label": 0
                },
                {
                    "sent": "So he was he appeared as the highest weighted object.",
                    "label": 0
                },
                {
                    "sent": "In the system.",
                    "label": 0
                },
                {
                    "sent": "So by doing this we identify the key actors and actions in the system and.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Using that, we moved on to create triplet networks.",
                    "label": 0
                },
                {
                    "sent": "So we thought with this networks we could analyze the features of the network and identify the centrality of these actors.",
                    "label": 0
                },
                {
                    "sent": "So we filtered the triplets that contain the top 300 key actors and actions each year.",
                    "label": 1
                },
                {
                    "sent": "So how we did this is we selected a threshold of for the weights and we eliminated all the actors below that threshold.",
                    "label": 0
                },
                {
                    "sent": "And for these actors we created networks in the following two cases.",
                    "label": 0
                },
                {
                    "sent": "That is, in a triplet.",
                    "label": 0
                },
                {
                    "sent": "If it contains a key subject, a key action, and an object, or if it contains a subject with the key action with the key object.",
                    "label": 0
                },
                {
                    "sent": "We filter this and then we create networks out of this.",
                    "label": 0
                },
                {
                    "sent": "We also tried to create networks out of frequent triplets, but they were not really revealing interesting relations because the frequent triplets did not have interesting actions.",
                    "label": 0
                },
                {
                    "sent": "They were like mostly police saying something to somebody or reporters reporting something.",
                    "label": 0
                },
                {
                    "sent": "So we thought this method is much more interesting and reveals more information.",
                    "label": 1
                },
                {
                    "sent": "So we generated director networks using Cytoscape.",
                    "label": 0
                },
                {
                    "sent": "Which is a gentle platform for network analysis and the networks had subjects an objects as nodes and the verbs linking them as edges.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a simple network in 2002 on the left it shows the whole network and I have highlighted the Note priest and the interaction of this note with other nodes in the network and it was like you could see the priest was involved in abusing and molesting all the time and you could specially it's really clear that you can see the actors like Michael, Kenneth Morrison and.",
                    "label": 0
                },
                {
                    "sent": "Blackwell, James Porter all all these people were victims of those crimes and the girls and boys were all the victims, so this shows that this from this network you could see it.",
                    "label": 0
                },
                {
                    "sent": "You could also see the direction with those arrows as well an.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look at a network of prosecutors, you could see they were always involved in investigating or characterizing, believing, answering or contacting so you could see which actors involved in what kind, what type of actions.",
                    "label": 0
                },
                {
                    "sent": "So the networks itself provide this information for us.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another network showing the interactions between judge and the jury, and then are the actors in the network.",
                    "label": 0
                },
                {
                    "sent": "So with this network we could identify that these type of actors involved in this.",
                    "label": 0
                },
                {
                    "sent": "This kind of actions.",
                    "label": 0
                },
                {
                    "sent": "This is really important in the field of quantitative narrative analysis because currently all these are done manually and it takes a lot of time.",
                    "label": 0
                },
                {
                    "sent": "Um, a similar kind of work has been done in the humanities recently by Franco Moretti from the Stanford Literary Lab, so they have converted novels into.",
                    "label": 0
                },
                {
                    "sent": "Graphs like this and then they have identified the centrality of actors, but again they do it by hand.",
                    "label": 0
                },
                {
                    "sent": "So here it is automatic.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once the networks are there, then we could analyze the topological properties of the networks.",
                    "label": 0
                },
                {
                    "sent": "So we thought of analyzing the centrality of networks using measures like between US centrality and then the indegree and outdegree and the page rank and the hits.",
                    "label": 0
                },
                {
                    "sent": "We also apply the hits algorithm which is by John Kleinberg which talks about hubs and authorities and we applied all these to our networks and then ranked actors according to these values.",
                    "label": 0
                },
                {
                    "sent": "You could see on the right the net the charts with ranks actors according to this.",
                    "label": 0
                },
                {
                    "sent": "For between US centrality in degree and out degree.",
                    "label": 1
                },
                {
                    "sent": "And here again, you could see the actors.",
                    "label": 0
                },
                {
                    "sent": "The first one shows something called low.",
                    "label": 0
                },
                {
                    "sent": "This is quite ambiguous here because the person who was involved in this sexual crime was named Bernard Law.",
                    "label": 0
                },
                {
                    "sent": "So that could also mean that and then archdiocese and again the same kind of factors appear there.",
                    "label": 0
                },
                {
                    "sent": "The Indegree was again showing something like cases case allegations, boys and things like that.",
                    "label": 0
                },
                {
                    "sent": "And the outdegree was really high for the priests and judges again.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same thing with the page rank hub and authority, so all these measures were done using cytoscape, an giffy, which is also a network analysis tool, which is an open source tool as well.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we rank this actors according to this.",
                    "label": 0
                },
                {
                    "sent": "And this is shown in the table.",
                    "label": 0
                },
                {
                    "sent": "So these are the top 10 most central actors in 2002 according to all network measures.",
                    "label": 1
                },
                {
                    "sent": "And the next.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We were also interested in identifying Spears of interaction because it is also common to investigate this.",
                    "label": 1
                },
                {
                    "sent": "In Q&A the Spears of interaction between actors means, for example, communication or it could be aggression.",
                    "label": 0
                },
                {
                    "sent": "It could be violent crime etc.",
                    "label": 0
                },
                {
                    "sent": "So what we did is we classified actions into different types and then we analyzed the triplets according to that.",
                    "label": 0
                },
                {
                    "sent": "So we classified them according to these two categories.",
                    "label": 0
                },
                {
                    "sent": "In 2002, which is a crime against person and crime against properties, for example, actions like Kill a murder or slay would appear in crime against person and crime against property.",
                    "label": 0
                },
                {
                    "sent": "It would be like slaughter or thieves or steal a property.",
                    "label": 1
                },
                {
                    "sent": "So in 2002 the most of the network was again about crime against person an little bit about crime against property.",
                    "label": 0
                },
                {
                    "sent": "So once we have this.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We identified who are the frequent subjects and objects involved in this, so this shows the top 10 ranked subjects and objects in crime against person and crime against property.",
                    "label": 1
                },
                {
                    "sent": "So all this is done with only the key actors and actions that we have identified so.",
                    "label": 0
                },
                {
                    "sent": "Here you could see the top highest rank subject in crime against person was priest and then men and then the objects were child, girl and woman.",
                    "label": 0
                },
                {
                    "sent": "So it is interesting to see here that men were responsible for crimes and while women and children are most often the objects of crimes and you take the crime against property again man police and soldiers were the subjects and the most frequent object was money.",
                    "label": 0
                },
                {
                    "sent": "And bank.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We also performed a time series analysis on actors and we thought it's interesting to to see the role of factors in a time series.",
                    "label": 0
                },
                {
                    "sent": "So we were analyzing data from 1987 to 2007 in New York time, so it's it's really 20 years.",
                    "label": 0
                },
                {
                    "sent": "So we did all the experiments for all these 20 years an for the time series analysis we considered the frequency.",
                    "label": 1
                },
                {
                    "sent": "The out degree and the hub value to plot these actors.",
                    "label": 0
                },
                {
                    "sent": "So according to the actor archdiocese, his frequency was really high in 2002 and the out degree an hub also denotes that his he was the key actor in 2002 and we did this.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Same for actions as well.",
                    "label": 0
                },
                {
                    "sent": "Here you could see the first one is more, lest we just really high in 2002.",
                    "label": 0
                },
                {
                    "sent": "Played was really high in 2001 and 2002.",
                    "label": 0
                },
                {
                    "sent": "During the September 11 attack, and abuse was really high in 2002.",
                    "label": 0
                },
                {
                    "sent": "Again, kill was really high into the slim one.",
                    "label": 0
                },
                {
                    "sent": "Rape was always the same.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's really consistent and the word attack is really mentioned very high in 2001.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "All this this is automatic through the system and it's really important for the narrative analysis of news.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, we we also identified this subjectivity and objectivity bias or factors becausw.",
                    "label": 0
                },
                {
                    "sent": "It shows the tendency to be portrayed as an active or passive passive element in the story.",
                    "label": 1
                },
                {
                    "sent": "So we computed the subject object buyers of actors by again considering their frequencies in crime and also in top news.",
                    "label": 0
                },
                {
                    "sent": "So if.",
                    "label": 0
                },
                {
                    "sent": "So the F here shows the frequency of the actor K as a subject or object in crime, and the same it is divided by the frequency of actor K as a subject.",
                    "label": 0
                },
                {
                    "sent": "In top News Plus as an object in top news.",
                    "label": 0
                },
                {
                    "sent": "So with this we could see how subjective or objective an actor is specific into crime.",
                    "label": 0
                },
                {
                    "sent": "So here we have plotted this.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In a 2 dimensional scatterplot showing the subject, an object bias.",
                    "label": 0
                },
                {
                    "sent": "Here you will see that most often named entities and people like detectives, diocese, Giuliani and they are the people who have the highest subject bias and the object bias was always high for concepts like discretion and noun phrases like World Trade Center abuses and things like that.",
                    "label": 0
                },
                {
                    "sent": "So the key actors were not only a people, they were also noun phrases and concepts like this.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we conclude here is we demonstrated a system for automating the narrative analysis of news, which is a traditional labor intensive tasks, and this builds on various contributions from the field of pattern analysis.",
                    "label": 1
                },
                {
                    "sent": "But there could be possible errors in the steps of Coreference resolution and pronoun resolution or other steps to passing.",
                    "label": 0
                },
                {
                    "sent": "But when considered the whole output, this could be ignored and the pastor which we use.",
                    "label": 0
                },
                {
                    "sent": "Is called Minneopa, which has a limit that passed sentences within a limit of 1024 characters, but we found that a typical sentence in news just contains 45 to 50 words, so this could be this limit is fine with that and.",
                    "label": 1
                },
                {
                    "sent": "The future work will involve both the validation of the performance and then the deployment of this system to even larger analysis tasks, and the system can be also fed into the program for computer assisted coding of events which was developed by front.",
                    "label": 1
                },
                {
                    "sent": "So C and we also look forward to integrate this in the news outlets analysis and monitoring system which is developed in the University of Bristol.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what we have done here is we have also analyzed articles from the US election news from 1988 to 2008, and we use triplets to infer the existence of certain relations between actors like, endorse or oppose relations.",
                    "label": 1
                },
                {
                    "sent": "And we introduce positive and negative weights to actions in the network.",
                    "label": 1
                },
                {
                    "sent": "And then we we have also.",
                    "label": 0
                },
                {
                    "sent": "Completed this work for automatically identifying allegiance of actors to a party and their role in political discourse.",
                    "label": 1
                },
                {
                    "sent": "But this work is yet to be published so.",
                    "label": 0
                },
                {
                    "sent": "I'm sure that we also looking forward to apply this in the upcoming US elections, so I hope that we have something more interesting in the upcoming year as well, so that's.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It from me.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "So the question is that what's the baseline for doing this so and that we have not compared this with something else.",
                    "label": 0
                },
                {
                    "sent": "So the thing the problem that we have here is that we have to compare this with triplets that are actually extracted by human beings and then we have to compare it with what the system does.",
                    "label": 0
                },
                {
                    "sent": "But the problem is.",
                    "label": 0
                },
                {
                    "sent": "We don't have that kind of information yet, but this person from the US West Robert or friends or so he is doing this by hand.",
                    "label": 0
                },
                {
                    "sent": "So he has promised us to give all his set of articles and the past grammar that he has.",
                    "label": 0
                },
                {
                    "sent": "But once we have that, we could evaluate this and see.",
                    "label": 0
                },
                {
                    "sent": "But when we presented this to him, but he said that this is fine, but he'll be giving us to evaluate this more.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Coming back to the second question, can you?",
                    "label": 0
                },
                {
                    "sent": "Yeah, basically.",
                    "label": 0
                },
                {
                    "sent": "Send a send me about ground truth.",
                    "label": 0
                },
                {
                    "sent": "I mean, we assume that the human that will do this manually will is some kind of definition of ground truth here.",
                    "label": 0
                },
                {
                    "sent": "But the other question is other most simple methods that would give just as good results.",
                    "label": 0
                },
                {
                    "sent": "More simple methods, but we used the frequencies here but we want to analyze it more by using some network measures as well.",
                    "label": 0
                },
                {
                    "sent": "So we could use the topological properties, but we have tried the frequency and the simple measures.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Reading the.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Maybe doing the?",
                    "label": 0
                },
                {
                    "sent": "Resolution.",
                    "label": 0
                },
                {
                    "sent": "You said that.",
                    "label": 0
                },
                {
                    "sent": "Yes, yes.",
                    "label": 0
                },
                {
                    "sent": "So I'm busy there because there might be situations.",
                    "label": 0
                },
                {
                    "sent": "No, actually this is this.",
                    "label": 0
                },
                {
                    "sent": "We use a jape grammar from gay.",
                    "label": 0
                },
                {
                    "sent": "So what it does is for each and every pronoun it says, which is the antecedent string that it refers to, so.",
                    "label": 0
                },
                {
                    "sent": "But it depends on the parser actually.",
                    "label": 0
                },
                {
                    "sent": "If because we depend on gate no yeah yeah yeah yes.",
                    "label": 0
                },
                {
                    "sent": "There would be errors in all these types of parsing, but.",
                    "label": 0
                },
                {
                    "sent": "We when we consider the output, it's like it's fine, but we have to evaluate this or anything.",
                    "label": 0
                },
                {
                    "sent": "Let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}