{
    "id": "lm362ivhbw5lmutswwbrdr7nfohwjq6l",
    "title": "Learning Recommendations in Social Media Systems By Weighting Multiple Relations",
    "info": {
        "author": [
            "Boris Chidlovskii, Xerox Research Centre Europe, Xerox"
        ],
        "published": "Oct. 3, 2011",
        "recorded": "September 2011",
        "category": [
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd2011_chidlovskii_learning/",
    "segmentation": [
        [
            "Hello everyone, so my name is Boyce.",
            "I'm from Xerox lab in Europe, in France.",
            "So the talk is on the different problem in social media which is recommendation and tag recommendations systems and the the in this talk.",
            "Actually we address 1 specific source and one huge example of datasets which comes from Flickr website.",
            "So."
        ],
        [
            "R. The outline of the talk is is quite standard.",
            "I will present the problem which is actually tag recommendation problem.",
            "I mean we should understand that in social media and this knew huge flow of data opened many possibilities and opportunities for matching, learning community to help this system to improve their data organization and prediction models.",
            "An one of examples is essentially.",
            "Is Flickr data set?",
            "One of the issue is there relational modeling.",
            "I will present what does it mean relation graphs's approach to model the inside organization organization of data in Flickr data set I will present the model which is based on actually on the weighted random walks.",
            "I will describe briefly the optimization approach and I will show the experimental setting.",
            "And the result of our evaluation."
        ],
        [
            "So.",
            "Are just few numbers just to call give you just background on on Flickr and similar sites.",
            "Recently, Flickr achieved 6 billion images uploaded by users YouTube we working with as well is another huge side of video inputs and essentially each minute as you can see, users upload up to 48 hours of video to this side.",
            "What is important that each side is created for many different activities offered to users, so each side include a formula speaking a set of different entities, actors possibility to navigate, possibility to search the tag to command images and videos.",
            "One of this, one of the example is essentially Flickr, sorry page where you see the image and you have.",
            "And exactly you see the typical example of the image you have set of tags associated.",
            "You can some information on the track of the comments by users.",
            "You see the user, you have some information on location where user comes from and so on."
        ],
        [
            "Our recommendation problem is one of the most.",
            "Critical problem in systems like this why?",
            "Because essentially the set of tags used in Flickr.",
            "They are both pretty font and free text, so people, usually they follow other people in tagging images or they can type some own phrases or words and sometimes they are not aligned with the corporate of existent tax there.",
            "This is typical example of there.",
            "Clogged backs coming from Flickr you see that different size of of words represent more as the frequency or importance of the attack in the in the side and.",
            "Definitely when people use different acts, either predefined to free text.",
            "This this common topics cannot can come up and emerge when people understand in the same way the semantic presented in images.",
            "Image Understanding is is critical because image.",
            "Is important object.",
            "There are many users that different ways to represent understand the image.",
            "One of the standard way is to make the content analysis so people go and understand their features of images to understand if there is any correlation between tags and their visual images of visual visual.",
            "He would just be sorry.",
            "So.",
            "The image image analysis community created a set of excellent tools which help us to analyze the image semantics.",
            "But still the problem is very hard because there is a very very low link between the content and semantic of images so far.",
            "That's why.",
            "We actually use tags as their huge help to organize, organize this image and increase the sharing and search in in Flickr data set.",
            "And actually what would like to create and we would like to create this.",
            "Our reliable tag recommendation system when we can work in two different modes, one is Bootstrap, but exactly when somebody would like to upload an image system would be able to, by analyzing social context, maybe image and there some other indications would propose some some initial set of tags and.",
            "The second mode is the expansion when we have already some image in the system and we have some tags and would like to propose more attacks just to increase the search capacity.",
            "An sharing of images in this."
        ],
        [
            "Flickr World is quite complex.",
            "Essentially, we have seven different types of entities, which are users produce tax, keyword sets, groups and RSS stream.",
            "So this is essentially the graph.",
            "The graph of different are.",
            "And this and you see indicated in blue different relations between them.",
            "So the basic one is essentially when the user uploads the photos.",
            "So these photos can be described by tags groups.",
            "Actually, maybe either photos may be added to groups or user can join different groups.",
            "You have.",
            "These photos can be organized in sets and you have a key words which describe tags and so on and so on so.",
            "There is a complex world of relations and entities.",
            "And.",
            "Our idea is essentially how we could use all this information to exactly built reliable tech recommendation system."
        ],
        [
            "Example.",
            "So we can start with the easiest subset.",
            "We have images we have simple available tags for images.",
            "And actually, this might be a good starting point.",
            "That means that we can use some many of existing recommendation algorithm which work with just this bipartite graph.",
            "When you have images intact and many, many different matters to propose something to extend tax 2 images.",
            "But if we look that we have more relations, we have more entities.",
            "We can for example users.",
            "Which essentially are in this case essentially are people who uploaded images.",
            "It might be something more like groups with different tags can correspond to different groups.",
            "We can and more that image is actually might be organized in subgroups in insets, so this creates quite big Walt of Antispam relations and the idea."
        ],
        [
            "Is how to use this stuff.",
            "So our challenge essentially is to.",
            "Understand how we can benefit from all available relations in this system.",
            "So it means that if we have a specific recommendation docs like tag recommendation for images, we would like to identify which relations are relevant and what is the best combination of those relations.",
            "Approach we follow essentially based on the supervised random walks principle.",
            "It means that we wait different relations and we build the system which allows to identify.",
            "We built the loss function or waits for the ranking world and we try to identify minimize this loss function and this would bring us the optimal value for the weights.",
            "The question is, scalability is one of the main concern we have because we work with billions of images.",
            "We work with thousands of tags and would like to be able to process quite important fragment of the Flickr data set.",
            "This is for example just a small.",
            "Screenshot of 600 images where the dog tag is present."
        ],
        [
            "Prior art is is are is pretty well known, so as I said, we have definitely very good examples of recommendation system for collective social knowledge.",
            "When people can use their social links and connections to make some predictions we definitely reused.",
            "Some work on weighted random walks.",
            "We definitely.",
            "Tried to use existing algorithm created for movie lanzan Netflix competition and one of the.",
            "Closest work for us it to us is essentially work, recently published on supervised Random Walk.",
            "The difference, as essentially that we follow a different approach because we don't try to weight each individual elements in the graph, we just try to wait graphs."
        ],
        [
            "R."
        ],
        [
            "What does it mean?",
            "Relational graph.",
            "Once again, this is actually formalization of this kind of entities when we have different entities and we tried to find different relations between energies.",
            "So this guy this gives us kind of graph when we have different types we have different relations between entities.",
            "In the case of Flickr we come up with seven different types like like list like this and we have.",
            "This is actually the compact representation an we have unfolded graph.",
            "It means that we have the full instantiation of the entity types and the relations like this between entities which represented by types."
        ],
        [
            "Or what does it mean?",
            "Random Walk on relational graph?",
            "Just a simple recall what is there random walk model?",
            "The random walk model essentially comes from huge work and there are many different variants of it, But the essentially the main idea of the American Markov chain model is defined on the set of States and we have initial distribution over this.",
            "Nodes of this stays in the graph and we are given we get somehow the.",
            "So out of transition probability of actually we're indicating how what is the probability of similar ones from one state to another one, and the best example we can give essentially is there example of the web graph when we have pages, we have links between pages and we get this this probabilities as some function of the number of links between between states or pages.",
            "This graph is built in unsupervised way, so this is actually we observe the web and we have some function to build the graph.",
            "And one important parameter of this model is reset probability.",
            "It means that each point when we sample with navigating the graph, we can restart the process.",
            "So this possibility to have all this reset probability guarantees that we get this final stational distribution over over the chain, which is pretty well known.",
            "This is some over.",
            "Powers of Matrix A, which is actually this set of probabilities and we just each time we have possibility to restart an get get once again to initial.",
            "Distribution is zero and restart machine again."
        ],
        [
            "Or, in the case of relational graph, the principles at the same, just we have not one type, we have multi type.",
            "Graph we have different relations, so we can navigate between different nodes.",
            "In this hypergraph system and their differences.",
            "Essentially this one we have the set node which is union of the existing elements.",
            "We have distribution and the same resetting coefficient Alpha and we walk through different relations and what we say that each time we go through the relation this one we contribute to the.",
            "A walk with specific associated weight.",
            "So each relation is given a specific weight.",
            "To guarantee that we have, we have still the probability distribution, we assume that the big based business metrics of the probabilities exactly is weighted sum over relation mattress is and of course we assume this normalization parameter that always for the same node actually sums to one.",
            "So at the end, the most important we have this transition probability matrix, which is a function of.",
            "Relation weights.",
            "So instead of unsupervised mode like with this standard random walk, we move through that waited."
        ],
        [
            "The."
        ],
        [
            "This actually brings onto the way how to find the best weights for relations.",
            "Our approach is is quite standard, so we assume that we don't work forever, so we try to follow just the principle in case steps and we try to minimize some empirical loss.",
            "Empirical loss, how it's built.",
            "It's very simple.",
            "Essentially it means that to get this ways to predict to minimize the prediction error when we have specific training set T, we tried to minimize the square loss between the true.",
            "Ability and prediction probability of a label.",
            "Since we work in their space where each image might have many different tax, we have multi label square loss with ascentia.",
            "Lee is a vector of this prediction for for the image then we actually.",
            "This is the main step.",
            "It means that we moved all this huge loss and this matter assist.",
            "We just move it in the huge domain of their gradient based optimization methods and there is definitely some math to do too.",
            "Make correctly the gradient and even his mattress is for the for this."
        ],
        [
            "Very good loss.",
            "Some form was a very simple, so we have.",
            "The main idea is exactly to score their loss function.",
            "Overall images in the set at the most important is exactly application of the chain rule, which essentially comes from the matrix algebra and the main ideas is the derivate when they go through the pass.",
            "When we try to derivate this path.",
            "We get the recursive form, so that means that we have at step T, we just reuse the previous T -- 1 step matrix and we just additional parameter which takes their metrics.",
            "The main metrics, the main step matrix multiply by this specific relation matrix.",
            "So this actually gives us there very easy way to inject this.",
            "This gradient parameter in the main random walk algorithm."
        ],
        [
            "R. Once all this math are done, we can just push it in the one of the existing optimization gradient based optimization techniques were used, essentially one which comes from this very family of gas in Newton algorithm.",
            "For the large large scale optimization and just the question that we should control how this debate?",
            "Used to extend the principle optimization and we have always keep to that they're get normalized and we usually work with transform the constraint form where we have constraint of the weights.",
            "We convert them in unconstrained function, which is one of the existing standard technique in the optimization."
        ],
        [
            "Domain.",
            "Haitian once again to repeat briefly.",
            "We use.",
            "We just move all these huge optimization in one of the existent linear algebra optimization tool Keizan.",
            "One of the possibility to improve is to build Hessian matrix because the main idea of using this second derivates is essentially guarantee faster convergence to generally local optimal point.",
            "These once again there is very simple recursive formula for the second derivatives of the matrix series.",
            "You can find them if you want.",
            "In the paper the principle created the same, the formulas recursive, that is step we have.",
            "We have new formula which pneumatics which depends on the previous time."
        ],
        [
            "This brings me to the evaluation."
        ],
        [
            "Our section, which is most most interesting to present our results.",
            "So the implementation we done.",
            "Essentially it comes is implemented in Python, scientific Python And sparse matrix package.",
            "We used Flickr API to download entities and relations.",
            "We use some core.",
            "It means that the core Flickr relations to work with like that image described by this tag.",
            "Or user upload this image or this user commanded this image and so on an we have used some infrared relations in the relations which do not exist in Flickr, but we try to infer we can try to build some of those relation one of them which is download exists is exactly similarity between users that to users they have some similar similarity.",
            "If they have for example, there they observed they tagged or they commanded the same.",
            "Our image or they they use the same set of tags so there is a similarity function which integrates different parameters of of."
        ],
        [
            "User activities.",
            "For the evaluation we have a big data data set for the needs of this full evaluation we use it fragment which includes 100,000 images which uploaded by 2000 users.",
            "There are huge number of tax used, a bit less after normalization there.",
            "This statistics on this sets are very very clear in the sense that.",
            "If you see that measures and indeed sparse and they follow the power load distribution, it means exactly.",
            "Well known in social networks that this principle of professional attachment is quite often observed.",
            "This example of Flickr.",
            "So in the case of our distribution, when we plot the number of taxpayer images, we see exactly this log log representation.",
            "It means that large majority large majority of images have just few few decks.",
            "Instead very very few images have kind of 200.",
            "Or 300's tax?",
            "In the case of number of tags used by the user is once again printed the same picture in log log plot we see that most most are number of tags used by the user on average kind of user images like this 127.",
            "Instead we have some users which use huge number of tags but they are very few."
        ],
        [
            "Are we actually with test the system and in two main modes for the tag recommendation?",
            "I just want to say that tag recommendation is one of possible.",
            "Application because other application includes group recommendation or user friendship recommendation and some other but overall reports will give here.",
            "They concerned that at recommendation once again this correlation between images and tax.",
            "So once again Bootstrap and just predict when predict X when the images just uploaded.",
            "Or in the case of the query when we have already some image, we have every Sam tags and would like to propose to the user or to the system to extend the existing set of tags.",
            "We run always in the cross validation with false 5 Ann.",
            "We run in two different prediction modes.",
            "One is just predict the five top text or in some extreme case when we knew exactly the size of remaining set of tags, we know the size and we try to check how the system behaves in this in this tricky tricky case.",
            "We use precision recall from multi case and the baseline since we would have tried to look if there's any available.",
            "Toolkit, oh methods which we could use for this for this size and put this framework we could do so as baseline.",
            "We use essentially the unweighted combination.",
            "That means that we run this system where relations where binary, so they either present or absent and we just detected which the combination unweighted combination is the best and we use this.",
            "This combination is baseline."
        ],
        [
            "R. In the main and actually the best loss function is, as I said before, is square loss, but we tried other loss function including absolute loss, exponential, Lausanne, Harbor loss.",
            "They are very well known in the matching learning community.",
            "They were widely used, sometimes they behave well, sometimes they are pretty bad, so as the second to the square loss surprisingly was exponential.",
            "What?"
        ],
        [
            "So and as we come to some some plots, some graphs which describe how the principle of relation weightings works.",
            "Essentially we have supplies for precision for a call, so we have baseline this 2 ones which which indicates precision precision for the optimal one and precision pro baseline.",
            "This is the difference how we can gain by waiting relations and you see the difference might be very important for the query mode.",
            "And for the recall, the difference is much less, but still important statistical important for their.",
            "This is the case when we have very small.",
            "They will have the increase when the query is the number of images from one K 200,000 images.",
            "45 top tax and the picture for their known number of tags.",
            "The pictures pretty the same that in the second case we have actually actually almost no difference between recall for the optimal in baseline, but we keep maintain still important gap for for the precision."
        ],
        [
            "Bootstrap Bootstrap is much more complex because exactly we start we start with nothing.",
            "We just upload image.",
            "We have no idea.",
            "We have actually what information you might have.",
            "We might have the knowledge.",
            "Who is the owner who uploaded the image and we can reuse this this person context.",
            "So that's why it starts with the numbers much lower and this is actually should be explained.",
            "This is important to explain why this graphs these graphs actually go down.",
            "Number of images is actually why?",
            "Why we stopped running algorithm?",
            "An actual evaluation for the 100K images.",
            "It's essentially it means that.",
            "If you identify correctly the good context of a given image and you just identify some minimal subset, let's say 1002 thousand images, it might be good enough and there is no need to reuse the full set of images.",
            "This is actually the main conclusion withdraw from the from the evaluation."
        ],
        [
            "Our which right additional parameters, including there there is set in Alpha.",
            "How this coefficient in facts on the tag recommendation production capacity you see that actually their performance for three different cases 1K50K and hundred key images printed the same.",
            "So we have very very good plateau case.",
            "So there is a range of values where we achieve actually the best result instead once we have within queries the resetting.",
            "A2 values like 0304 we observe the drop in performance in the query modes and the Bootstrap is."
        ],
        [
            "The picture is pretty the same.",
            "And this second second parameter we tested because it's very important for this system.",
            "How many iterations we need to achieve the good performance.",
            "And this is actually exactly in the number of iteration Horizonte we plot exactly how we can achieve the good performance in precision recall when we run 12345 and more iteration by the algorithm, and we see that actually inquiring modes in.",
            "In Bootstrap the system, the situation is pretty the same.",
            "We achieve pretty good results once we.",
            "Wrong, for example, seven or eight iterations.",
            "Which is pretty good, assuming that in on the web the number of iterations to achieve each."
        ],
        [
            "Much larger.",
            "This brings me to their lesson learned and some kind of conclusion which which would give some perspective on the next step.",
            "Because once again, as I said, our main concern was scalability.",
            "So we wanted to have the designer system where we can attract millions of images and even more because this is one of the requirements of either of the project over the cervix datasets and.",
            "From the beginning, the scalability was the main goal.",
            "So our analysis is actually that scalability pretty good, despite the matrix multiplication we still run in quadratic complexity or so jazz because we work with the sparse matrices.",
            "We are running for the moment with design and actually it's always done.",
            "Match match reduced version for the parallel cluster system just to be ran on the much larger set of images and what is important that we don't use only Flickr relations.",
            "An infrared relations will try to extract and feed in the system the image features which sometimes might be critical to distinguish and improve this system.",
            "Production capacity and what is important.",
            "As I said you so this this performance with Digger dates with the number of images is much more critical to identify the local context.",
            "It means that once we identify the position of the image, we want to predict tax for we just not take the entire ground, but for the moment we're using some heuristics, but essentially they are always work on the locality principle.",
            "We have no good explication why it works like this.",
            "It works and gives very good results.",
            "Haitians are actually, we included this part of the hastens food to improve the convergence of their optimization methods essentially didn't help so much, so it actually helped.",
            "For just this small number of images, why doesn't help?",
            "Because the maintenance of the Haitian and this multiplication is quite quite computationally expensive, and actually what we gain with the convergence we lose with the with the maintenance of Haitians.",
            "R. Position with respect to matrix factorization.",
            "There is a parallel.",
            "Line of research.",
            "When we work with this relational word.",
            "You can try to find some some hidden subspace you would like, maybe to work with this set of relations at the set of joint mattress is an you would like to find some common subspace or set of common hidden variables, but the moment we are testing a set of different algorithms for the moment they do not scale well.",
            "So actually for the moment we can proceed much less images and getting worse results.",
            "But we still need some position respect to this approach, because definitely the factorization can help, but for the moment we haven't figured out how this this can improve the system.",
            "And one another interesting open points, I would like to address.",
            "We are interested in the independence criteria because once again we just are.",
            "Pushed in the system all relations we got from Flickr.",
            "But as we discovered, for some, for some entities like groups and sets.",
            "Using those relation actually doesn't help, even getting worse becausw you increase their size of the graph.",
            "You see increase the number of mattress is you increase the number of probabilities to estimate so it doesn't help.",
            "That's why we need what we would like to investigate.",
            "The next step we would like to identify in this some unsupervised modes can we pre select some good relations or most prominent relations before before we push them?",
            "In this system.",
            "This actually."
        ],
        [
            "Concludes my talk.",
            "Thank you for your attention.",
            "If you have some some questions please.",
            "Precious.",
            "Thank you for your look at another technical question is it?",
            "Are you allowed to crawl Flickr it to get all the data that you get or there is somewhere stored there?",
            "Flickr it.",
            "Let's say data set or you just crawl afflicted 'cause this is actually this.",
            "Is this Flickr API exactly the way to download an how we don't?",
            "We have no, we have agreement with the company working with Flickr.",
            "So we get some subset of images from that company, but essentially, as Flickr is a public domain's list, at least public images, they are free for downloading, and most of those, not all.",
            "Most of those relation can be uploaded by through the simple script script in Python or in Java, or any language is actually at least 567.",
            "Different languages are available for to access.",
            "There are some limitations.",
            "For example if user.",
            "Has too many images you might access to the last 500 only, so there are some technical limitation, but essentially a flicker is one of the best social sites when you can exactly downloads and you use information they have on this site.",
            "They are very comparative.",
            "There is no.",
            "This is why actually so easy it would not be the case with their Facebook.",
            "It would not be the case with LinkedIn.",
            "It would be not the case with YouTube.",
            "So that's actually makes the huge difference.",
            "We have some contracts, so that's actually the Flickr example.",
            "It's one of the best case because we can test and with this is public domain.",
            "But the question is that if you want to get more data, go to Flickr.",
            "Thank you, I was hoping yeah you could explain a little bit more in the first set of graphs that you showed, the X axis was the number of images.",
            "Was hoping you could explain more if that is that the number of images in the training set or something else, and in particular."
        ],
        [
            "You could elaborate a little bit more on why in the second set performance went down.",
            "You sort of explain that, but I didn't understand how the images were chosen.",
            "Yeah, this actually did the question why this performance is like this, exactly how their how you present images to their to the cross validation and training system.",
            "This order comes from the way we downloaded images.",
            "Actually it means that since we crowded there Flickr and we have combination, so it's actually a combination of crawling the images and they.",
            "Pre processed images, but essentially it means that in the way we crawl it with downloaded images from the Flickr.",
            "OK, we index those images and we run the app when we run.",
            "411 thousand images.",
            "Essentially these images come from the very beginning and they come from few users because crawling in Flickr, you should give this is the way how it works.",
            "You don't know in advance the idea of the user or idea of the image, so essentially you jump from user to user.",
            "You navigate this graph and this creates the some bias.",
            "So essentially at the beginning when you start with those images, it means that you work with you.",
            "Small world you work with you images with few users so you have kind of the local cluster.",
            "That's why when you have situation when you simulate the social similarity, you see, that's why the numbers essentially are very high.",
            "But when you go large includes many, many users.",
            "Many, many are images.",
            "It means that this system becomes very complex to manage.",
            "You have many clusters, you have huge social.",
            "Graph which is invisible because in Flickr you don't have direct connection between user.",
            "You navigate through the graph, but there is no direct directly between you and me, just through images through groups through something else.",
            "That's why the way which indicates that it's this makes no sense to learn on the fool if possible on the full image set, you need to constrain somehow they learning approach to some local principle.",
            "Actually, this graph was actually just to show the difference between the weighted schema in unweighted schema, but essentially when we build the system to accurate prediction, of course we try to minimize and happen in this situation.",
            "And none in this situation.",
            "I have a question concerning the baselines.",
            "Or did you play around with some very simple baseline?",
            "Like most popular texts for this technical limitation, stuff, or most popular texts by users just to get an idea how far this very simple baselines are?",
            "From what you have presented here, no, I mean yeah, sure we started essentially with this simplest because our tags are attached so you can immediately use this them as their keyboards, and you can just predict bye.",
            "You build some most probable tax per user.",
            "You build some most probable tags.",
            "TF IDF indexing for the collection.",
            "Actually it performs pretty badly.",
            "It means that you predict always the same tax for all images, so the baseline baseline would be like 10% all the time.",
            "But only if you consider the most popular over the whole set.",
            "But if you go for use and say OK, I just sample for user and computer.",
            "Most popular for users and you have the information that this user will now at a new image then you can just recommend the most popular tax of this year.",
            "And I can't imagine that it stays for 10%.",
            "But this is what this is actually included, just one or specific instantiation of the baseline.",
            "It means that you have when you build 2 images when you have two relations.",
            "You provide for a given user you if this is the same user for the image you provide, the most probable approval tags used by users.",
            "So far this is actually included in the baseline.",
            "This is one of the unweighted schema.",
            "It means that we just give two relations, one of user tags and 2nd text image.",
            "With no weights.",
            "This is exactly 1 instantiation of the baseline.",
            "This scheme, I believe, is understood.",
            "OK thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello everyone, so my name is Boyce.",
                    "label": 0
                },
                {
                    "sent": "I'm from Xerox lab in Europe, in France.",
                    "label": 0
                },
                {
                    "sent": "So the talk is on the different problem in social media which is recommendation and tag recommendations systems and the the in this talk.",
                    "label": 1
                },
                {
                    "sent": "Actually we address 1 specific source and one huge example of datasets which comes from Flickr website.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "R. The outline of the talk is is quite standard.",
                    "label": 0
                },
                {
                    "sent": "I will present the problem which is actually tag recommendation problem.",
                    "label": 1
                },
                {
                    "sent": "I mean we should understand that in social media and this knew huge flow of data opened many possibilities and opportunities for matching, learning community to help this system to improve their data organization and prediction models.",
                    "label": 0
                },
                {
                    "sent": "An one of examples is essentially.",
                    "label": 0
                },
                {
                    "sent": "Is Flickr data set?",
                    "label": 0
                },
                {
                    "sent": "One of the issue is there relational modeling.",
                    "label": 0
                },
                {
                    "sent": "I will present what does it mean relation graphs's approach to model the inside organization organization of data in Flickr data set I will present the model which is based on actually on the weighted random walks.",
                    "label": 0
                },
                {
                    "sent": "I will describe briefly the optimization approach and I will show the experimental setting.",
                    "label": 0
                },
                {
                    "sent": "And the result of our evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Are just few numbers just to call give you just background on on Flickr and similar sites.",
                    "label": 0
                },
                {
                    "sent": "Recently, Flickr achieved 6 billion images uploaded by users YouTube we working with as well is another huge side of video inputs and essentially each minute as you can see, users upload up to 48 hours of video to this side.",
                    "label": 1
                },
                {
                    "sent": "What is important that each side is created for many different activities offered to users, so each side include a formula speaking a set of different entities, actors possibility to navigate, possibility to search the tag to command images and videos.",
                    "label": 0
                },
                {
                    "sent": "One of this, one of the example is essentially Flickr, sorry page where you see the image and you have.",
                    "label": 0
                },
                {
                    "sent": "And exactly you see the typical example of the image you have set of tags associated.",
                    "label": 0
                },
                {
                    "sent": "You can some information on the track of the comments by users.",
                    "label": 0
                },
                {
                    "sent": "You see the user, you have some information on location where user comes from and so on.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our recommendation problem is one of the most.",
                    "label": 0
                },
                {
                    "sent": "Critical problem in systems like this why?",
                    "label": 0
                },
                {
                    "sent": "Because essentially the set of tags used in Flickr.",
                    "label": 0
                },
                {
                    "sent": "They are both pretty font and free text, so people, usually they follow other people in tagging images or they can type some own phrases or words and sometimes they are not aligned with the corporate of existent tax there.",
                    "label": 0
                },
                {
                    "sent": "This is typical example of there.",
                    "label": 0
                },
                {
                    "sent": "Clogged backs coming from Flickr you see that different size of of words represent more as the frequency or importance of the attack in the in the side and.",
                    "label": 0
                },
                {
                    "sent": "Definitely when people use different acts, either predefined to free text.",
                    "label": 0
                },
                {
                    "sent": "This this common topics cannot can come up and emerge when people understand in the same way the semantic presented in images.",
                    "label": 1
                },
                {
                    "sent": "Image Understanding is is critical because image.",
                    "label": 0
                },
                {
                    "sent": "Is important object.",
                    "label": 0
                },
                {
                    "sent": "There are many users that different ways to represent understand the image.",
                    "label": 0
                },
                {
                    "sent": "One of the standard way is to make the content analysis so people go and understand their features of images to understand if there is any correlation between tags and their visual images of visual visual.",
                    "label": 0
                },
                {
                    "sent": "He would just be sorry.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The image image analysis community created a set of excellent tools which help us to analyze the image semantics.",
                    "label": 0
                },
                {
                    "sent": "But still the problem is very hard because there is a very very low link between the content and semantic of images so far.",
                    "label": 0
                },
                {
                    "sent": "That's why.",
                    "label": 0
                },
                {
                    "sent": "We actually use tags as their huge help to organize, organize this image and increase the sharing and search in in Flickr data set.",
                    "label": 0
                },
                {
                    "sent": "And actually what would like to create and we would like to create this.",
                    "label": 0
                },
                {
                    "sent": "Our reliable tag recommendation system when we can work in two different modes, one is Bootstrap, but exactly when somebody would like to upload an image system would be able to, by analyzing social context, maybe image and there some other indications would propose some some initial set of tags and.",
                    "label": 0
                },
                {
                    "sent": "The second mode is the expansion when we have already some image in the system and we have some tags and would like to propose more attacks just to increase the search capacity.",
                    "label": 0
                },
                {
                    "sent": "An sharing of images in this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Flickr World is quite complex.",
                    "label": 1
                },
                {
                    "sent": "Essentially, we have seven different types of entities, which are users produce tax, keyword sets, groups and RSS stream.",
                    "label": 1
                },
                {
                    "sent": "So this is essentially the graph.",
                    "label": 0
                },
                {
                    "sent": "The graph of different are.",
                    "label": 0
                },
                {
                    "sent": "And this and you see indicated in blue different relations between them.",
                    "label": 0
                },
                {
                    "sent": "So the basic one is essentially when the user uploads the photos.",
                    "label": 0
                },
                {
                    "sent": "So these photos can be described by tags groups.",
                    "label": 0
                },
                {
                    "sent": "Actually, maybe either photos may be added to groups or user can join different groups.",
                    "label": 0
                },
                {
                    "sent": "You have.",
                    "label": 0
                },
                {
                    "sent": "These photos can be organized in sets and you have a key words which describe tags and so on and so on so.",
                    "label": 0
                },
                {
                    "sent": "There is a complex world of relations and entities.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Our idea is essentially how we could use all this information to exactly built reliable tech recommendation system.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example.",
                    "label": 0
                },
                {
                    "sent": "So we can start with the easiest subset.",
                    "label": 0
                },
                {
                    "sent": "We have images we have simple available tags for images.",
                    "label": 0
                },
                {
                    "sent": "And actually, this might be a good starting point.",
                    "label": 0
                },
                {
                    "sent": "That means that we can use some many of existing recommendation algorithm which work with just this bipartite graph.",
                    "label": 0
                },
                {
                    "sent": "When you have images intact and many, many different matters to propose something to extend tax 2 images.",
                    "label": 0
                },
                {
                    "sent": "But if we look that we have more relations, we have more entities.",
                    "label": 0
                },
                {
                    "sent": "We can for example users.",
                    "label": 0
                },
                {
                    "sent": "Which essentially are in this case essentially are people who uploaded images.",
                    "label": 0
                },
                {
                    "sent": "It might be something more like groups with different tags can correspond to different groups.",
                    "label": 0
                },
                {
                    "sent": "We can and more that image is actually might be organized in subgroups in insets, so this creates quite big Walt of Antispam relations and the idea.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is how to use this stuff.",
                    "label": 0
                },
                {
                    "sent": "So our challenge essentially is to.",
                    "label": 0
                },
                {
                    "sent": "Understand how we can benefit from all available relations in this system.",
                    "label": 1
                },
                {
                    "sent": "So it means that if we have a specific recommendation docs like tag recommendation for images, we would like to identify which relations are relevant and what is the best combination of those relations.",
                    "label": 1
                },
                {
                    "sent": "Approach we follow essentially based on the supervised random walks principle.",
                    "label": 0
                },
                {
                    "sent": "It means that we wait different relations and we build the system which allows to identify.",
                    "label": 0
                },
                {
                    "sent": "We built the loss function or waits for the ranking world and we try to identify minimize this loss function and this would bring us the optimal value for the weights.",
                    "label": 0
                },
                {
                    "sent": "The question is, scalability is one of the main concern we have because we work with billions of images.",
                    "label": 0
                },
                {
                    "sent": "We work with thousands of tags and would like to be able to process quite important fragment of the Flickr data set.",
                    "label": 0
                },
                {
                    "sent": "This is for example just a small.",
                    "label": 0
                },
                {
                    "sent": "Screenshot of 600 images where the dog tag is present.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Prior art is is are is pretty well known, so as I said, we have definitely very good examples of recommendation system for collective social knowledge.",
                    "label": 1
                },
                {
                    "sent": "When people can use their social links and connections to make some predictions we definitely reused.",
                    "label": 1
                },
                {
                    "sent": "Some work on weighted random walks.",
                    "label": 0
                },
                {
                    "sent": "We definitely.",
                    "label": 1
                },
                {
                    "sent": "Tried to use existing algorithm created for movie lanzan Netflix competition and one of the.",
                    "label": 0
                },
                {
                    "sent": "Closest work for us it to us is essentially work, recently published on supervised Random Walk.",
                    "label": 0
                },
                {
                    "sent": "The difference, as essentially that we follow a different approach because we don't try to weight each individual elements in the graph, we just try to wait graphs.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "R.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "Relational graph.",
                    "label": 0
                },
                {
                    "sent": "Once again, this is actually formalization of this kind of entities when we have different entities and we tried to find different relations between energies.",
                    "label": 0
                },
                {
                    "sent": "So this guy this gives us kind of graph when we have different types we have different relations between entities.",
                    "label": 1
                },
                {
                    "sent": "In the case of Flickr we come up with seven different types like like list like this and we have.",
                    "label": 0
                },
                {
                    "sent": "This is actually the compact representation an we have unfolded graph.",
                    "label": 0
                },
                {
                    "sent": "It means that we have the full instantiation of the entity types and the relations like this between entities which represented by types.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or what does it mean?",
                    "label": 0
                },
                {
                    "sent": "Random Walk on relational graph?",
                    "label": 0
                },
                {
                    "sent": "Just a simple recall what is there random walk model?",
                    "label": 0
                },
                {
                    "sent": "The random walk model essentially comes from huge work and there are many different variants of it, But the essentially the main idea of the American Markov chain model is defined on the set of States and we have initial distribution over this.",
                    "label": 1
                },
                {
                    "sent": "Nodes of this stays in the graph and we are given we get somehow the.",
                    "label": 0
                },
                {
                    "sent": "So out of transition probability of actually we're indicating how what is the probability of similar ones from one state to another one, and the best example we can give essentially is there example of the web graph when we have pages, we have links between pages and we get this this probabilities as some function of the number of links between between states or pages.",
                    "label": 0
                },
                {
                    "sent": "This graph is built in unsupervised way, so this is actually we observe the web and we have some function to build the graph.",
                    "label": 0
                },
                {
                    "sent": "And one important parameter of this model is reset probability.",
                    "label": 0
                },
                {
                    "sent": "It means that each point when we sample with navigating the graph, we can restart the process.",
                    "label": 0
                },
                {
                    "sent": "So this possibility to have all this reset probability guarantees that we get this final stational distribution over over the chain, which is pretty well known.",
                    "label": 0
                },
                {
                    "sent": "This is some over.",
                    "label": 0
                },
                {
                    "sent": "Powers of Matrix A, which is actually this set of probabilities and we just each time we have possibility to restart an get get once again to initial.",
                    "label": 0
                },
                {
                    "sent": "Distribution is zero and restart machine again.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or, in the case of relational graph, the principles at the same, just we have not one type, we have multi type.",
                    "label": 0
                },
                {
                    "sent": "Graph we have different relations, so we can navigate between different nodes.",
                    "label": 0
                },
                {
                    "sent": "In this hypergraph system and their differences.",
                    "label": 0
                },
                {
                    "sent": "Essentially this one we have the set node which is union of the existing elements.",
                    "label": 1
                },
                {
                    "sent": "We have distribution and the same resetting coefficient Alpha and we walk through different relations and what we say that each time we go through the relation this one we contribute to the.",
                    "label": 1
                },
                {
                    "sent": "A walk with specific associated weight.",
                    "label": 0
                },
                {
                    "sent": "So each relation is given a specific weight.",
                    "label": 0
                },
                {
                    "sent": "To guarantee that we have, we have still the probability distribution, we assume that the big based business metrics of the probabilities exactly is weighted sum over relation mattress is and of course we assume this normalization parameter that always for the same node actually sums to one.",
                    "label": 1
                },
                {
                    "sent": "So at the end, the most important we have this transition probability matrix, which is a function of.",
                    "label": 0
                },
                {
                    "sent": "Relation weights.",
                    "label": 0
                },
                {
                    "sent": "So instead of unsupervised mode like with this standard random walk, we move through that waited.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This actually brings onto the way how to find the best weights for relations.",
                    "label": 0
                },
                {
                    "sent": "Our approach is is quite standard, so we assume that we don't work forever, so we try to follow just the principle in case steps and we try to minimize some empirical loss.",
                    "label": 0
                },
                {
                    "sent": "Empirical loss, how it's built.",
                    "label": 0
                },
                {
                    "sent": "It's very simple.",
                    "label": 0
                },
                {
                    "sent": "Essentially it means that to get this ways to predict to minimize the prediction error when we have specific training set T, we tried to minimize the square loss between the true.",
                    "label": 1
                },
                {
                    "sent": "Ability and prediction probability of a label.",
                    "label": 0
                },
                {
                    "sent": "Since we work in their space where each image might have many different tax, we have multi label square loss with ascentia.",
                    "label": 0
                },
                {
                    "sent": "Lee is a vector of this prediction for for the image then we actually.",
                    "label": 0
                },
                {
                    "sent": "This is the main step.",
                    "label": 0
                },
                {
                    "sent": "It means that we moved all this huge loss and this matter assist.",
                    "label": 0
                },
                {
                    "sent": "We just move it in the huge domain of their gradient based optimization methods and there is definitely some math to do too.",
                    "label": 0
                },
                {
                    "sent": "Make correctly the gradient and even his mattress is for the for this.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very good loss.",
                    "label": 0
                },
                {
                    "sent": "Some form was a very simple, so we have.",
                    "label": 0
                },
                {
                    "sent": "The main idea is exactly to score their loss function.",
                    "label": 1
                },
                {
                    "sent": "Overall images in the set at the most important is exactly application of the chain rule, which essentially comes from the matrix algebra and the main ideas is the derivate when they go through the pass.",
                    "label": 1
                },
                {
                    "sent": "When we try to derivate this path.",
                    "label": 0
                },
                {
                    "sent": "We get the recursive form, so that means that we have at step T, we just reuse the previous T -- 1 step matrix and we just additional parameter which takes their metrics.",
                    "label": 0
                },
                {
                    "sent": "The main metrics, the main step matrix multiply by this specific relation matrix.",
                    "label": 0
                },
                {
                    "sent": "So this actually gives us there very easy way to inject this.",
                    "label": 0
                },
                {
                    "sent": "This gradient parameter in the main random walk algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "R. Once all this math are done, we can just push it in the one of the existing optimization gradient based optimization techniques were used, essentially one which comes from this very family of gas in Newton algorithm.",
                    "label": 0
                },
                {
                    "sent": "For the large large scale optimization and just the question that we should control how this debate?",
                    "label": 0
                },
                {
                    "sent": "Used to extend the principle optimization and we have always keep to that they're get normalized and we usually work with transform the constraint form where we have constraint of the weights.",
                    "label": 0
                },
                {
                    "sent": "We convert them in unconstrained function, which is one of the existing standard technique in the optimization.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Domain.",
                    "label": 0
                },
                {
                    "sent": "Haitian once again to repeat briefly.",
                    "label": 0
                },
                {
                    "sent": "We use.",
                    "label": 0
                },
                {
                    "sent": "We just move all these huge optimization in one of the existent linear algebra optimization tool Keizan.",
                    "label": 0
                },
                {
                    "sent": "One of the possibility to improve is to build Hessian matrix because the main idea of using this second derivates is essentially guarantee faster convergence to generally local optimal point.",
                    "label": 0
                },
                {
                    "sent": "These once again there is very simple recursive formula for the second derivatives of the matrix series.",
                    "label": 1
                },
                {
                    "sent": "You can find them if you want.",
                    "label": 0
                },
                {
                    "sent": "In the paper the principle created the same, the formulas recursive, that is step we have.",
                    "label": 0
                },
                {
                    "sent": "We have new formula which pneumatics which depends on the previous time.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This brings me to the evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our section, which is most most interesting to present our results.",
                    "label": 0
                },
                {
                    "sent": "So the implementation we done.",
                    "label": 0
                },
                {
                    "sent": "Essentially it comes is implemented in Python, scientific Python And sparse matrix package.",
                    "label": 0
                },
                {
                    "sent": "We used Flickr API to download entities and relations.",
                    "label": 1
                },
                {
                    "sent": "We use some core.",
                    "label": 0
                },
                {
                    "sent": "It means that the core Flickr relations to work with like that image described by this tag.",
                    "label": 0
                },
                {
                    "sent": "Or user upload this image or this user commanded this image and so on an we have used some infrared relations in the relations which do not exist in Flickr, but we try to infer we can try to build some of those relation one of them which is download exists is exactly similarity between users that to users they have some similar similarity.",
                    "label": 0
                },
                {
                    "sent": "If they have for example, there they observed they tagged or they commanded the same.",
                    "label": 0
                },
                {
                    "sent": "Our image or they they use the same set of tags so there is a similarity function which integrates different parameters of of.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "User activities.",
                    "label": 0
                },
                {
                    "sent": "For the evaluation we have a big data data set for the needs of this full evaluation we use it fragment which includes 100,000 images which uploaded by 2000 users.",
                    "label": 0
                },
                {
                    "sent": "There are huge number of tax used, a bit less after normalization there.",
                    "label": 0
                },
                {
                    "sent": "This statistics on this sets are very very clear in the sense that.",
                    "label": 0
                },
                {
                    "sent": "If you see that measures and indeed sparse and they follow the power load distribution, it means exactly.",
                    "label": 1
                },
                {
                    "sent": "Well known in social networks that this principle of professional attachment is quite often observed.",
                    "label": 0
                },
                {
                    "sent": "This example of Flickr.",
                    "label": 0
                },
                {
                    "sent": "So in the case of our distribution, when we plot the number of taxpayer images, we see exactly this log log representation.",
                    "label": 0
                },
                {
                    "sent": "It means that large majority large majority of images have just few few decks.",
                    "label": 0
                },
                {
                    "sent": "Instead very very few images have kind of 200.",
                    "label": 0
                },
                {
                    "sent": "Or 300's tax?",
                    "label": 0
                },
                {
                    "sent": "In the case of number of tags used by the user is once again printed the same picture in log log plot we see that most most are number of tags used by the user on average kind of user images like this 127.",
                    "label": 1
                },
                {
                    "sent": "Instead we have some users which use huge number of tags but they are very few.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are we actually with test the system and in two main modes for the tag recommendation?",
                    "label": 1
                },
                {
                    "sent": "I just want to say that tag recommendation is one of possible.",
                    "label": 0
                },
                {
                    "sent": "Application because other application includes group recommendation or user friendship recommendation and some other but overall reports will give here.",
                    "label": 0
                },
                {
                    "sent": "They concerned that at recommendation once again this correlation between images and tax.",
                    "label": 0
                },
                {
                    "sent": "So once again Bootstrap and just predict when predict X when the images just uploaded.",
                    "label": 0
                },
                {
                    "sent": "Or in the case of the query when we have already some image, we have every Sam tags and would like to propose to the user or to the system to extend the existing set of tags.",
                    "label": 0
                },
                {
                    "sent": "We run always in the cross validation with false 5 Ann.",
                    "label": 0
                },
                {
                    "sent": "We run in two different prediction modes.",
                    "label": 0
                },
                {
                    "sent": "One is just predict the five top text or in some extreme case when we knew exactly the size of remaining set of tags, we know the size and we try to check how the system behaves in this in this tricky tricky case.",
                    "label": 1
                },
                {
                    "sent": "We use precision recall from multi case and the baseline since we would have tried to look if there's any available.",
                    "label": 0
                },
                {
                    "sent": "Toolkit, oh methods which we could use for this for this size and put this framework we could do so as baseline.",
                    "label": 0
                },
                {
                    "sent": "We use essentially the unweighted combination.",
                    "label": 0
                },
                {
                    "sent": "That means that we run this system where relations where binary, so they either present or absent and we just detected which the combination unweighted combination is the best and we use this.",
                    "label": 1
                },
                {
                    "sent": "This combination is baseline.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "R. In the main and actually the best loss function is, as I said before, is square loss, but we tried other loss function including absolute loss, exponential, Lausanne, Harbor loss.",
                    "label": 1
                },
                {
                    "sent": "They are very well known in the matching learning community.",
                    "label": 0
                },
                {
                    "sent": "They were widely used, sometimes they behave well, sometimes they are pretty bad, so as the second to the square loss surprisingly was exponential.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So and as we come to some some plots, some graphs which describe how the principle of relation weightings works.",
                    "label": 0
                },
                {
                    "sent": "Essentially we have supplies for precision for a call, so we have baseline this 2 ones which which indicates precision precision for the optimal one and precision pro baseline.",
                    "label": 0
                },
                {
                    "sent": "This is the difference how we can gain by waiting relations and you see the difference might be very important for the query mode.",
                    "label": 0
                },
                {
                    "sent": "And for the recall, the difference is much less, but still important statistical important for their.",
                    "label": 0
                },
                {
                    "sent": "This is the case when we have very small.",
                    "label": 0
                },
                {
                    "sent": "They will have the increase when the query is the number of images from one K 200,000 images.",
                    "label": 0
                },
                {
                    "sent": "45 top tax and the picture for their known number of tags.",
                    "label": 0
                },
                {
                    "sent": "The pictures pretty the same that in the second case we have actually actually almost no difference between recall for the optimal in baseline, but we keep maintain still important gap for for the precision.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bootstrap Bootstrap is much more complex because exactly we start we start with nothing.",
                    "label": 0
                },
                {
                    "sent": "We just upload image.",
                    "label": 0
                },
                {
                    "sent": "We have no idea.",
                    "label": 0
                },
                {
                    "sent": "We have actually what information you might have.",
                    "label": 0
                },
                {
                    "sent": "We might have the knowledge.",
                    "label": 0
                },
                {
                    "sent": "Who is the owner who uploaded the image and we can reuse this this person context.",
                    "label": 0
                },
                {
                    "sent": "So that's why it starts with the numbers much lower and this is actually should be explained.",
                    "label": 0
                },
                {
                    "sent": "This is important to explain why this graphs these graphs actually go down.",
                    "label": 0
                },
                {
                    "sent": "Number of images is actually why?",
                    "label": 0
                },
                {
                    "sent": "Why we stopped running algorithm?",
                    "label": 0
                },
                {
                    "sent": "An actual evaluation for the 100K images.",
                    "label": 0
                },
                {
                    "sent": "It's essentially it means that.",
                    "label": 0
                },
                {
                    "sent": "If you identify correctly the good context of a given image and you just identify some minimal subset, let's say 1002 thousand images, it might be good enough and there is no need to reuse the full set of images.",
                    "label": 0
                },
                {
                    "sent": "This is actually the main conclusion withdraw from the from the evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our which right additional parameters, including there there is set in Alpha.",
                    "label": 0
                },
                {
                    "sent": "How this coefficient in facts on the tag recommendation production capacity you see that actually their performance for three different cases 1K50K and hundred key images printed the same.",
                    "label": 1
                },
                {
                    "sent": "So we have very very good plateau case.",
                    "label": 0
                },
                {
                    "sent": "So there is a range of values where we achieve actually the best result instead once we have within queries the resetting.",
                    "label": 0
                },
                {
                    "sent": "A2 values like 0304 we observe the drop in performance in the query modes and the Bootstrap is.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The picture is pretty the same.",
                    "label": 0
                },
                {
                    "sent": "And this second second parameter we tested because it's very important for this system.",
                    "label": 0
                },
                {
                    "sent": "How many iterations we need to achieve the good performance.",
                    "label": 0
                },
                {
                    "sent": "And this is actually exactly in the number of iteration Horizonte we plot exactly how we can achieve the good performance in precision recall when we run 12345 and more iteration by the algorithm, and we see that actually inquiring modes in.",
                    "label": 0
                },
                {
                    "sent": "In Bootstrap the system, the situation is pretty the same.",
                    "label": 0
                },
                {
                    "sent": "We achieve pretty good results once we.",
                    "label": 0
                },
                {
                    "sent": "Wrong, for example, seven or eight iterations.",
                    "label": 0
                },
                {
                    "sent": "Which is pretty good, assuming that in on the web the number of iterations to achieve each.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much larger.",
                    "label": 0
                },
                {
                    "sent": "This brings me to their lesson learned and some kind of conclusion which which would give some perspective on the next step.",
                    "label": 0
                },
                {
                    "sent": "Because once again, as I said, our main concern was scalability.",
                    "label": 0
                },
                {
                    "sent": "So we wanted to have the designer system where we can attract millions of images and even more because this is one of the requirements of either of the project over the cervix datasets and.",
                    "label": 0
                },
                {
                    "sent": "From the beginning, the scalability was the main goal.",
                    "label": 0
                },
                {
                    "sent": "So our analysis is actually that scalability pretty good, despite the matrix multiplication we still run in quadratic complexity or so jazz because we work with the sparse matrices.",
                    "label": 1
                },
                {
                    "sent": "We are running for the moment with design and actually it's always done.",
                    "label": 1
                },
                {
                    "sent": "Match match reduced version for the parallel cluster system just to be ran on the much larger set of images and what is important that we don't use only Flickr relations.",
                    "label": 0
                },
                {
                    "sent": "An infrared relations will try to extract and feed in the system the image features which sometimes might be critical to distinguish and improve this system.",
                    "label": 0
                },
                {
                    "sent": "Production capacity and what is important.",
                    "label": 0
                },
                {
                    "sent": "As I said you so this this performance with Digger dates with the number of images is much more critical to identify the local context.",
                    "label": 0
                },
                {
                    "sent": "It means that once we identify the position of the image, we want to predict tax for we just not take the entire ground, but for the moment we're using some heuristics, but essentially they are always work on the locality principle.",
                    "label": 0
                },
                {
                    "sent": "We have no good explication why it works like this.",
                    "label": 0
                },
                {
                    "sent": "It works and gives very good results.",
                    "label": 0
                },
                {
                    "sent": "Haitians are actually, we included this part of the hastens food to improve the convergence of their optimization methods essentially didn't help so much, so it actually helped.",
                    "label": 0
                },
                {
                    "sent": "For just this small number of images, why doesn't help?",
                    "label": 0
                },
                {
                    "sent": "Because the maintenance of the Haitian and this multiplication is quite quite computationally expensive, and actually what we gain with the convergence we lose with the with the maintenance of Haitians.",
                    "label": 0
                },
                {
                    "sent": "R. Position with respect to matrix factorization.",
                    "label": 0
                },
                {
                    "sent": "There is a parallel.",
                    "label": 0
                },
                {
                    "sent": "Line of research.",
                    "label": 0
                },
                {
                    "sent": "When we work with this relational word.",
                    "label": 0
                },
                {
                    "sent": "You can try to find some some hidden subspace you would like, maybe to work with this set of relations at the set of joint mattress is an you would like to find some common subspace or set of common hidden variables, but the moment we are testing a set of different algorithms for the moment they do not scale well.",
                    "label": 0
                },
                {
                    "sent": "So actually for the moment we can proceed much less images and getting worse results.",
                    "label": 0
                },
                {
                    "sent": "But we still need some position respect to this approach, because definitely the factorization can help, but for the moment we haven't figured out how this this can improve the system.",
                    "label": 0
                },
                {
                    "sent": "And one another interesting open points, I would like to address.",
                    "label": 0
                },
                {
                    "sent": "We are interested in the independence criteria because once again we just are.",
                    "label": 1
                },
                {
                    "sent": "Pushed in the system all relations we got from Flickr.",
                    "label": 1
                },
                {
                    "sent": "But as we discovered, for some, for some entities like groups and sets.",
                    "label": 0
                },
                {
                    "sent": "Using those relation actually doesn't help, even getting worse becausw you increase their size of the graph.",
                    "label": 0
                },
                {
                    "sent": "You see increase the number of mattress is you increase the number of probabilities to estimate so it doesn't help.",
                    "label": 0
                },
                {
                    "sent": "That's why we need what we would like to investigate.",
                    "label": 0
                },
                {
                    "sent": "The next step we would like to identify in this some unsupervised modes can we pre select some good relations or most prominent relations before before we push them?",
                    "label": 0
                },
                {
                    "sent": "In this system.",
                    "label": 0
                },
                {
                    "sent": "This actually.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Concludes my talk.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "If you have some some questions please.",
                    "label": 0
                },
                {
                    "sent": "Precious.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your look at another technical question is it?",
                    "label": 0
                },
                {
                    "sent": "Are you allowed to crawl Flickr it to get all the data that you get or there is somewhere stored there?",
                    "label": 0
                },
                {
                    "sent": "Flickr it.",
                    "label": 0
                },
                {
                    "sent": "Let's say data set or you just crawl afflicted 'cause this is actually this.",
                    "label": 0
                },
                {
                    "sent": "Is this Flickr API exactly the way to download an how we don't?",
                    "label": 0
                },
                {
                    "sent": "We have no, we have agreement with the company working with Flickr.",
                    "label": 0
                },
                {
                    "sent": "So we get some subset of images from that company, but essentially, as Flickr is a public domain's list, at least public images, they are free for downloading, and most of those, not all.",
                    "label": 0
                },
                {
                    "sent": "Most of those relation can be uploaded by through the simple script script in Python or in Java, or any language is actually at least 567.",
                    "label": 0
                },
                {
                    "sent": "Different languages are available for to access.",
                    "label": 0
                },
                {
                    "sent": "There are some limitations.",
                    "label": 0
                },
                {
                    "sent": "For example if user.",
                    "label": 0
                },
                {
                    "sent": "Has too many images you might access to the last 500 only, so there are some technical limitation, but essentially a flicker is one of the best social sites when you can exactly downloads and you use information they have on this site.",
                    "label": 0
                },
                {
                    "sent": "They are very comparative.",
                    "label": 0
                },
                {
                    "sent": "There is no.",
                    "label": 0
                },
                {
                    "sent": "This is why actually so easy it would not be the case with their Facebook.",
                    "label": 0
                },
                {
                    "sent": "It would not be the case with LinkedIn.",
                    "label": 0
                },
                {
                    "sent": "It would be not the case with YouTube.",
                    "label": 0
                },
                {
                    "sent": "So that's actually makes the huge difference.",
                    "label": 0
                },
                {
                    "sent": "We have some contracts, so that's actually the Flickr example.",
                    "label": 0
                },
                {
                    "sent": "It's one of the best case because we can test and with this is public domain.",
                    "label": 0
                },
                {
                    "sent": "But the question is that if you want to get more data, go to Flickr.",
                    "label": 0
                },
                {
                    "sent": "Thank you, I was hoping yeah you could explain a little bit more in the first set of graphs that you showed, the X axis was the number of images.",
                    "label": 0
                },
                {
                    "sent": "Was hoping you could explain more if that is that the number of images in the training set or something else, and in particular.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You could elaborate a little bit more on why in the second set performance went down.",
                    "label": 0
                },
                {
                    "sent": "You sort of explain that, but I didn't understand how the images were chosen.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this actually did the question why this performance is like this, exactly how their how you present images to their to the cross validation and training system.",
                    "label": 0
                },
                {
                    "sent": "This order comes from the way we downloaded images.",
                    "label": 0
                },
                {
                    "sent": "Actually it means that since we crowded there Flickr and we have combination, so it's actually a combination of crawling the images and they.",
                    "label": 0
                },
                {
                    "sent": "Pre processed images, but essentially it means that in the way we crawl it with downloaded images from the Flickr.",
                    "label": 0
                },
                {
                    "sent": "OK, we index those images and we run the app when we run.",
                    "label": 0
                },
                {
                    "sent": "411 thousand images.",
                    "label": 0
                },
                {
                    "sent": "Essentially these images come from the very beginning and they come from few users because crawling in Flickr, you should give this is the way how it works.",
                    "label": 0
                },
                {
                    "sent": "You don't know in advance the idea of the user or idea of the image, so essentially you jump from user to user.",
                    "label": 0
                },
                {
                    "sent": "You navigate this graph and this creates the some bias.",
                    "label": 0
                },
                {
                    "sent": "So essentially at the beginning when you start with those images, it means that you work with you.",
                    "label": 0
                },
                {
                    "sent": "Small world you work with you images with few users so you have kind of the local cluster.",
                    "label": 0
                },
                {
                    "sent": "That's why when you have situation when you simulate the social similarity, you see, that's why the numbers essentially are very high.",
                    "label": 0
                },
                {
                    "sent": "But when you go large includes many, many users.",
                    "label": 0
                },
                {
                    "sent": "Many, many are images.",
                    "label": 0
                },
                {
                    "sent": "It means that this system becomes very complex to manage.",
                    "label": 0
                },
                {
                    "sent": "You have many clusters, you have huge social.",
                    "label": 0
                },
                {
                    "sent": "Graph which is invisible because in Flickr you don't have direct connection between user.",
                    "label": 0
                },
                {
                    "sent": "You navigate through the graph, but there is no direct directly between you and me, just through images through groups through something else.",
                    "label": 0
                },
                {
                    "sent": "That's why the way which indicates that it's this makes no sense to learn on the fool if possible on the full image set, you need to constrain somehow they learning approach to some local principle.",
                    "label": 0
                },
                {
                    "sent": "Actually, this graph was actually just to show the difference between the weighted schema in unweighted schema, but essentially when we build the system to accurate prediction, of course we try to minimize and happen in this situation.",
                    "label": 0
                },
                {
                    "sent": "And none in this situation.",
                    "label": 0
                },
                {
                    "sent": "I have a question concerning the baselines.",
                    "label": 0
                },
                {
                    "sent": "Or did you play around with some very simple baseline?",
                    "label": 0
                },
                {
                    "sent": "Like most popular texts for this technical limitation, stuff, or most popular texts by users just to get an idea how far this very simple baselines are?",
                    "label": 0
                },
                {
                    "sent": "From what you have presented here, no, I mean yeah, sure we started essentially with this simplest because our tags are attached so you can immediately use this them as their keyboards, and you can just predict bye.",
                    "label": 0
                },
                {
                    "sent": "You build some most probable tax per user.",
                    "label": 0
                },
                {
                    "sent": "You build some most probable tags.",
                    "label": 0
                },
                {
                    "sent": "TF IDF indexing for the collection.",
                    "label": 0
                },
                {
                    "sent": "Actually it performs pretty badly.",
                    "label": 0
                },
                {
                    "sent": "It means that you predict always the same tax for all images, so the baseline baseline would be like 10% all the time.",
                    "label": 0
                },
                {
                    "sent": "But only if you consider the most popular over the whole set.",
                    "label": 0
                },
                {
                    "sent": "But if you go for use and say OK, I just sample for user and computer.",
                    "label": 0
                },
                {
                    "sent": "Most popular for users and you have the information that this user will now at a new image then you can just recommend the most popular tax of this year.",
                    "label": 0
                },
                {
                    "sent": "And I can't imagine that it stays for 10%.",
                    "label": 0
                },
                {
                    "sent": "But this is what this is actually included, just one or specific instantiation of the baseline.",
                    "label": 0
                },
                {
                    "sent": "It means that you have when you build 2 images when you have two relations.",
                    "label": 0
                },
                {
                    "sent": "You provide for a given user you if this is the same user for the image you provide, the most probable approval tags used by users.",
                    "label": 0
                },
                {
                    "sent": "So far this is actually included in the baseline.",
                    "label": 0
                },
                {
                    "sent": "This is one of the unweighted schema.",
                    "label": 0
                },
                {
                    "sent": "It means that we just give two relations, one of user tags and 2nd text image.",
                    "label": 0
                },
                {
                    "sent": "With no weights.",
                    "label": 0
                },
                {
                    "sent": "This is exactly 1 instantiation of the baseline.",
                    "label": 0
                },
                {
                    "sent": "This scheme, I believe, is understood.",
                    "label": 0
                },
                {
                    "sent": "OK thanks.",
                    "label": 0
                }
            ]
        }
    }
}