{
    "id": "lr2ulgilisplyfvhkkj2dvrxr2sl6rcf",
    "title": "Euler Calculus and Topological Data Management",
    "info": {
        "author": [
            "Robert Ghrist, Department of Mathematics, University of Illinois at Urbana-Champaign"
        ],
        "published": "July 30, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Mathematics",
            "Top->Computer Science->Data Modeling"
        ]
    },
    "url": "http://videolectures.net/mlss09us_ghrist_ectdm/",
    "segmentation": [
        [
            "So the the first dog.",
            "Of the session is Robert Christ on Euler calculus and data.",
            "Alright, thank you for that rousing introduction.",
            "You know there's something about having a microphone in your hand.",
            "I I feel I feel different.",
            "I feel like I should be saying something other than math.",
            "Once you put your hands on the laptop and say this prayer with me people.",
            "No, maybe not that wrong venue, although what I am going to do today is talk a little bit about some good news and try to.",
            "Oh, spread the gospel of Euler calculus."
        ],
        [
            "So my motivation for doing this comes from networks comes from sensor networks.",
            "In particular, that's a little bit disjoint from some of the things that a lot of people in the audience are interested in, but nevertheless there's enough overlap to make some of the methods that I'm going to talk about hopefully applicable to whatever you might be here for."
        ],
        [
            "Now the tools that I'm going to use are similar to tools that you've heard in talks yesterday and will be hearing in talks tomorrow and the next day.",
            "These tools are topological in nature and being topological that means you get to use a lot of your topological intuition.",
            "You care bout things up to deformation, you don't care so much about rigid geometric structures as you do global or rough topological features.",
            "Now that sounds pretty squishy.",
            "But what you do to firm it up a little bit as you add the constructs of algebraic topology, you put the algebra on top of it, and the marriage between those very hard algebraic methods and the squishy topological ideas makes for a good tool in dealing with data, in particular because of its robustness."
        ],
        [
            "Combined with compute ability, so the particular set of tools that I'm going to talk about are a type of calculus, a type of integral calculus that's built on the Euler characteristic.",
            "The topological invariant that's oh a couple of 100 years old by now.",
            "Now a lot of people have seen Euler characteristic before.",
            "Some people may have even seen the basics of or the beginnings of Euler calculus before.",
            "If you've had any exposure to integral geometry.",
            "What I'm going to push today is a certain perspective on that, and a certain class of applications on that, and this is."
        ],
        [
            "All stemming from the definition of the Euler characteristic.",
            "So what do I look characteristic?",
            "While most people learned vertices minus edges plus faces, let's let's think about that a little bit more and I want you to think of Euler characteristic is a generalization of counting.",
            "So if I put if I put a collection of dots on the screen and I say how many things are there you look at it, you count and you compute its Euler characteristic.",
            "Can you say 7?",
            "The Euler characteristic of that set is going to be 7.",
            "Now let's take those objects and let's glue some of them together.",
            "I'm going to connect certain objects.",
            "When I do, and if I were to ask any reasonably intelligent person how many things, how many objects are there up there?",
            "They'd say, well, there's.",
            "There's three things I've glued some stuff together.",
            "I've identified them.",
            "There's three.",
            "We went from 7 to 3 by adding four edges so inductively.",
            "We would say, well, edges get weighted with a negative one.",
            "The - Now what happens if we add just one more edge then if I ask you how many things are up there, you might still say that three is a reasonable answer, but if we follow the algebra of assigning a negative one to edges, then we would get an answer of two for the Euler characteristic.",
            "And that's our first hint that it's computing something more than just counting the number of things that are there.",
            "I'm really counting the number of globs of clusters, but I'm also keeping track of the fact that this one has a cycle in it has a whole.",
            "Now, if I wanted to get back to just counting clusters, I could fill that hole in with something 2 dimensional and I look at that and now I would say OK, I've got three clusters and no funny stuff happening here.",
            "Let's call the Euler characteristic of that three.",
            "That motivates us to wait a face 2 dimensional piece with weighting plus one.",
            "If we continue that exercise inductively, it motivates the definition of Euler characteristic.",
            "As being an alternating sum of the number of K dimensional pieces that you have in a decomposition of a space, so vertices get weighted with plus one edges get weighted with minus one etc.",
            "And the observation that one makes after setting up that definition is the observation that was made hundreds of years ago.",
            "That if you take the boundary of a polyhedron, something that is topologically a 2 dimensional sphere.",
            "Then no matter how you break it up into vertices, an edge is an faces.",
            "You always get the same number for the Euler characteristic.",
            "You always get to.",
            "And the reason for this is that you can equivalently described the Euler characteristic as being the alternating sum of ranks of homology groups.",
            "Topological invariants of a space that don't depend on how it's decomposed into pieces, or how it's stretched and deformed.",
            "That's the Euler caracara."
        ],
        [
            "Tristich and we're going to use that combined with one other perspective to build a calculus and that additional tool, or that additional perspective is one that comes from the theory of sheaves.",
            "This is maybe less well known than other characteristic, but it's not that bad.",
            "Although I don't recommend you run to the library and pick up a nice thick book on sheaf theory, stick with the pictures at least for this talk.",
            "What are sheaves?",
            "Sheaves are a way of assigning data to open sets in a space, so I think of covering a space with open patches, and a sheaf is a way of assigning some sort of data to those open sets.",
            "That data is usually something algebraic.",
            "The most common chief that you'd run across is the chief of continuous functions over a space where you assign to an open set the space of continuous functions over that open set.",
            "Now sheaves have to have two additional properties they have to respect.",
            "Unions if you take overlaps of two open sets and you look at something that agrees on the intersection, then you have to be able to continue that to something over the Union.",
            "And it also has to respect restrictions.",
            "If I have one open set that is included in another open set, then I need some way of identifying the data between them.",
            "Once you have that, you have something called the Shifan Sheaf theory is an elaborate mathematical construct for going from local information over sets.",
            "Patching them together, gluing them to get global information.",
            "Now, how does the oil?"
        ],
        [
            "Characteristic fit into that, there's a wonderful property that falls straight out of the homological definition.",
            "That someone in computer science might call an inclusion exclusion principle.",
            "Namely, if I take the Euler characteristic of the Union of two subsets of the space, then I can express that as the sum of their Euler characteristics minus the Euler characteristic of their intersection.",
            "That's a great formula.",
            "Where have we seen formulas like that before?",
            "Well, we've seen formulas like that when we took real analysis course and got to the section on integration that was the beginning of measure theory, right?",
            "Volume has to satisfy that length has to satisfy that area has to satisfy that.",
            "What also satisfies that counting finite sets and inductively the Euler characteristic satisfies that as well.",
            "And because of that one can get out of hammer.",
            "And start banging on the Euler characteristic and turn it into something like a measure.",
            "You can't do the full blown Sigma algebra deal.",
            "But you can integrate certain functions against other characteristic.",
            "This is not a new idea, it's an old idea.",
            "The perspective that I'm going to push today is.",
            "The branch that comes from topology, from sheaf theory in particular, and there are several people who 2030 years ago saw that the Euler characteristic is really the basis for good integration theory.",
            "Of course this has.",
            "Longer antecedents in the realm of geometry going back even to blaschka and hot vigor.",
            "It's been recognized that one can do integral geometry that one can integrate geometric objects with respect to Euler characteristic.",
            "There have been applications of this theory in several fields.",
            "Probability is 1.",
            "In particular, thinking about expected values of Euler characteristics of excursion sets and what I'm going to push today is some new applications.",
            "2 problems."
        ],
        [
            "In networks.",
            "Let me go over some definitions and you're going to have to stick with me and wait for the applications that are coming.",
            "So we're going to look at a particular class of functions.",
            "These are going to be integrable functions.",
            "In this theory, these functions are called constructible, so constructible functions over some set are not real valued.",
            "Their integer valued, they're going to be piecewise constant, and they're going to be piecewise constant over relatively nice sets, or tame.",
            "Set what's what's tame.",
            "Well, in one sense I could wave my hands and say tame means it has a well defined Euler characteristic.",
            "You could break it up into vertices and edges and faces.",
            "You can triangulate the space in a nice finite way.",
            "Not all things are like that.",
            "There are various fractally nonsense objects in the world that doesn't work so well for.",
            "There's a much cleaner, better, more precise way to define tameless that if you've not heard this before, this is something worth looking up.",
            "This is the theory of O minimal structures.",
            "Where one says, well, you know a lot of times, piecewise linear sets are nice.",
            "We have this nice simplicial structure or real semialgebraic sets are nice.",
            "We have a triangulation theorem for them, or sub analytic sets, or nice.",
            "We have a nice big well defined theory for those and O minimal structures away to axiomatize all of those different systems down to just a couple of couple of simple properties you look at.",
            "Collections of Boolean algebra's of sets.",
            "Let's say in RN.",
            "That are closed with respect to certain natural operations projection products.",
            "And these elements of these collections are called tame sets or or definable sets.",
            "You can talk about the minimal structure of semialgebraic sets or the oh minimal structure of globally sub analytic sets or the oh minimal structure of piecewise linear objects and then fix your class and work in it for the rest of this talk, you can just pretend that everything in the world is piecewise linear and that'll get to buy just fine, although it's much more general than that.",
            "Now some results that come from this theory that are going to be useful for integration are as follows.",
            "Any team set is triangulable.",
            "You can break it up into vertices, edges, faces and the like and any constructible function over this set.",
            "Any function whose level sets are tame can be represented as a sum of characteristic functions over nice tame sets with some integer coefficients in front of it.",
            "So there's a nice decomposition.",
            "It's not a unique decomposition, but.",
            "Exists and it's finite, and it's nice.",
            "And all such functions are going to be integrable with respect to Euler characteristic as follows.",
            "Here's an explicit definition.",
            "It's the only definition that makes any sense whatsoever.",
            "What is the integral of a an integer valued constructible function with respect to Euler characteristic?",
            "Well, if I can break it up into a finite combination of characteristic functions over simplices.",
            "Then, well, it's finite so I can switch the integral in the sum, certainly.",
            "An whatever integration is it it better be linear right?",
            "So I can pull those constants out and the only thing I have to do is integrate a characteristic function over a set with respect to this measure?",
            "What's the only sensible definition for that?",
            "Well, it's the measure of the set the Euler characteristic of the set, which is well defined, so that's what integration with respect to Euler characteristic means.",
            "It's a fancy way of talking about the oil characteristic of certain types of functions.",
            "Of immigrants.",
            "But that's nice.",
            "Now.",
            "Here's something that pushes."
        ],
        [
            "A little bit a slightly different perspective that we'll see has some utility.",
            "This goes back to McPherson in the 70s.",
            "Kashiwara in the 70s independently and then really almost rediscovered by Shapira in Viro, the idea that this integral is really a very natural construction in sheaf theory, it corresponds to something called a push forward.",
            "Where what does that mean?",
            "If you have an appropriate map between two spaces, then you can think about the piecewise constant functions over X.",
            "The piecewise constant functions over why any such map induces a natural map at this level on these sheaves of constructible functions, and what is that map?",
            "Well, let's think about what it is in the case of a trivial mapping where I send all of X down to a point.",
            "If I do so, then this induced push forward sends constructible or integer valued functions over X2 integer valued functions over a point.",
            "What are integer valued functions over a point?",
            "That's just the integers themselves.",
            "This induced mapping is the integral with respect to Euler characteristic, whi because it has to respect all the operations associated with the sheaf.",
            "The idea of gluing things together?",
            "The idea of restricting things that's really what integration is all about.",
            "Integration is something local.",
            "You can glue two domains together and integrate over their union.",
            "Now a crawler that comes from this more abstract perspective is that this integration theory has a fubini theorem.",
            "You know, we teach our students Fubini theorem all the time.",
            "If you have an integral with respect to the X&YY, you can integrate in One Direction 1st and then integrate in the other direction.",
            "What this means in this context is if you have a mapping from F. Pardon me from X to Y.",
            "Then you can integrate over the.",
            "Inverse images of this map over the fibers of this map in the vertical direction and then you can integrate over the base.",
            "You can integrate in this direction.",
            "So that's another piece of evidence that this is a decent integration theory.",
            "It does with integration theories are supposed to do alright, and there's a lot of other things that fall out immediately from this more abstract perspective as well that we will talk about."
        ],
        [
            "Let's let's take this.",
            "Let's use this for a simple problem that will have a simple answer.",
            "So let's say that you have a network of sensors.",
            "Very simple sensors, sensors that don't have a lot of advanced signal processing capabilities.",
            "The only thing that they do is they count targets.",
            "There's some number of targets in the domain.",
            "Each sensor can register the presence of some number of nearby targets, but it doesn't say how far away they are.",
            "It doesn't say what bearing they are an most importantly, it doesn't identify the targets.",
            "Target ID is very, very expensive from a signal processing point of view, it just gives a number.",
            "Now there's a lot of redundancy in this data.",
            "Both of these.",
            "Sensors see three targets there, right next to each other.",
            "They're probably seeing the same three targets.",
            "How do you aggregate that redundant data?",
            "And get to the point where you can say exactly how many targets there are.",
            "Well, here's a here."
        ],
        [
            "The way to approach that problem, play computer games and get a little bit of experience.",
            "You've done this right.",
            "You've played minesweeper.",
            "That's really a sensor networks problem.",
            "You have a sensor field of sensors that count the number of nearby targets, and you get to interrogate that sensor data and what you want to do is figure out where the targets are, and less importantly, how many targets there are.",
            "Now.",
            "Instead of thinking about it from the sensors POV, think about it from the target's point of view.",
            "Each bomb turns on some number of sensors nearby.",
            "Think of some some neighborhood around that target.",
            "I'm going to call that the target support than what you're really registering.",
            "In these sensors is the depth of overlap.",
            "How many target supports?",
            "Do you lie in?"
        ],
        [
            "Now let's let's ramp that example up a little bit and get a slightly more general result.",
            "Let's say that your targets reside in some workspace.",
            "Call it W. That could be any kind of space.",
            "An I'm going to think of my sensors as living in some continuum limit.",
            "I'm going to model the collection of sensors by a space.",
            "I'm going to call that SpaceX and that might be the same spaces.",
            "W for example.",
            "The sensors might be floating around the room where you the targets are also located, or it might be a different space.",
            "The sensors might be embedded in the ceiling tiles, which is 2 dimensional.",
            "OK, so from the point of view of the sensor, each sensor looks up, counts some number of targets.",
            "But from the dual point of view, each target turns on some Patch in the sensor space and the sensor field returns accounting function that really just registers.",
            "How many targets are seen at each point in the sensor space.",
            "Here's a theorem if you take that function, integrate it with respect to Euler characteristic and normalized by the mass of each target.",
            "Support assumed to be a constant.",
            "Then that tells you exactly how many targets there are without any assumptions on the size of the target support.",
            "This isn't like Minesweeper, where each target is homogeneous and turns on exactly 8 squares around it.",
            "The actual size and shape of the target supports can vary dramatically as long as their Euler characteristic stays constant, let's say.",
            "If we were talking about convex sets, then all those Euler characteristics would be equal to 1.",
            "Alright.",
            "Well, the proof of this is pretty easy given.",
            "What little we know about this integration theory, what's the proof?",
            "Well, what's the integral of this counting function with respect to Euler characteristic?",
            "That counting function is a sum of characteristic functions over the target supports.",
            "There is a finite number of targets, so I can switch the sum in the integral and the one thing that I know about integration with respect to Euler characteristic is that on a characteristic function it just returns the Euler characteristic of that set, which is assumed to be a constant end, and that's the entire proof, and there's no hidden assumptions that I'm not telling you about, except I didn't say that everything here was tame, but you knew that that was in effect anyhow.",
            "Alright, so what's the one assumption I forgot to say?",
            "I forgot to say that you better make sure that N is not equal to 0 because dividing by zero is always a bad thing.",
            "That couldn't be a problem, could it?",
            "Well, here is a collection of annuli.",
            "The yellow is 1, the green is 2.",
            "And I've got some union of annuli and I want to know what, how many are there?",
            "If I integrate this function with respect Euler characteristic I get 0 because the annulus is a set of measure 0 in this measure theory, Alas.",
            "How many annuli are there?",
            "How many?",
            "Four could be 4 or it could be two.",
            "It could be 6 or 8 or 10 or 12.",
            "It's not unique in this case.",
            "So sets of measure zero really do cause a problem in this context, and you can have fun trying to decompose that into 12 annuli."
        ],
        [
            "Alright.",
            "How do you compute these sorts of things?",
            "Maybe this is just one of those theoretical things that you can never compute, know know the Euler characteristic is combinatorial, very easy to compute.",
            "There are tons of formulas that one could write down in terms of the combinatorics of level sets of upper excursion sets in terms of the Euler characteristics of the level sets, the chambers, the connected components themselves.",
            "Let me do a simple example or two where you can see how this would."
        ],
        [
            "Work, so here's a here's a collection of contractible target supports.",
            "They all have Euler characteristic.",
            "One you can see they're not necessarily convex.",
            "The twist around there are different sizes, some you have one entirely contained in another.",
            "What, what happens?",
            "Well, let's see.",
            "We don't get to see the colors, you only get to see the numbers that are registered.",
            "What do we do?",
            "We sum up to get this integral.",
            "The Euler characteristics of the upper excursion sets.",
            "So I look at all the centers that are.",
            "Reading some non 0 value I take the Euler characteristic of that this negative one.",
            "I look at all these sensors that read strictly greater than one.",
            "I take the Euler characteristic of that.",
            "I keep filtering up through the data and then eventually I add these results together and I get 7 the number of patches that I started out with."
        ],
        [
            "Or likewise, I could look at the weighted Euler characteristics of these individual chambers because these Euler characteristics are sensitive to whether you have a boundary piece or not.",
            "Sometimes you get plus one, sometimes minus one, sometimes minus two, and if you wait those up and do the combinatorics correctly again, you wind up getting 7."
        ],
        [
            "Now.",
            "Some applications of this 2 problems that I care about in sensor networks.",
            "You might not care about so."
        ],
        [
            "Much, but I think this is kind of slick.",
            "You can solve problems involving counting with less data than you think you might otherwise.",
            "Let's say you have a field of sensors that count booms every time there's a boom propagates out.",
            "Let's say we don't have any echoing or pardon me or diffraction waves going on if we just have simple expansion waves.",
            "And the sensors count how many times they heard boom.",
            "This is South Side Chicago, so I should talk about gunfire going off.",
            "You know you interview people after an incident and.",
            "You ask people how many.",
            "How many gunshots were there and no one gets it right.",
            "It's it's always crazy how many gunshots were there actually?",
            "Well, if you just count every time there's a boom, you don't keep track of what time it happened.",
            "You don't keep track of your neighborhood this when and who heard it next?",
            "Nope, you just keep track of every time you heard a boom.",
            "And then you integrate the resulting function with respect to Euler characteristic.",
            "Then you'll get an accurate count of how many wavefronts there were without any need for clocks.",
            "Now the question is, do you have enough data in this sparse sample to be able to accurately?",
            "Estimate that integral.",
            "That's a problem for what numerical analysis, which needs to be."
        ],
        [
            "Addressed but stick with me for a minute.",
            "Here's another example where you can solve a problem involving counting with less data than you might think.",
            "Let's say you have acoustic sensors built into the roads that increment a counter every time a car drives by.",
            "It doesn't keep track of What Car it was, whether it was a big car or a little car.",
            "It doesn't keep track of when it drove past it, just every time a car rumbles past click.",
            "If you want to know how many cars there were without having to assume that the all the cars are the same or that they drove in nice straight lines.",
            "Then, assuming your sensor field is dense enough, all you have to do is integrate that function with respect to Euler characteristic and get that integral well approximated and that will tell you how many vehicles there were.",
            "Now, how does that work when some of these?",
            "Sets that get traced out don't have Euler characteristic one.",
            "Some do, some don't, what."
        ],
        [
            "Happens in this case.",
            "Well, in this case something wonderful works out.",
            "If you think about what happens in space across time, then even when you have a complicated interaction in.",
            "This higher dimensional setting it's still a nice contractible set with Euler characteristic one.",
            "What's happening, we'll remember that slide with the abstract stuff on it about push forwards and the Fubini theorem.",
            "This is an example of the Fubini theorem in action, because what's really happening is what is the sensor field reading?",
            "Well at every point.",
            "Let's try that again.",
            "At every point.",
            "The sensor registers A1 every time a car rumbles past.",
            "That's really counting the number of intervals in this intersection in three dimensional space.",
            "With this one dimensional line, you're really integrating over the fiber with respect to Euler characteristic, and then you're integrating over the base and by the Fubini theorem that means you're integrating over the entire 3 dimensional domain, and that's why you're getting the vehicle count, correct?"
        ],
        [
            "OK, now both of these applications are predicated on being able to accurately approximate an integral in the continuum setting where the theorem holds with some sort of disk."
        ],
        [
            "Data how easy is it to do that?",
            "Well, you look at this and your brain does a great job at counting to 7 that's not so impressive if we take away the lines on the boundary an just sample it even on a nice dense grid.",
            "All of a sudden your brain is not so good at being able to.",
            "Look at that and say 7.",
            "And it would be even less good if we forced your brain to be distributed.",
            "That might be painful.",
            "And only look at one little piece at a time and then integrate that data up.",
            "Can you do that?",
            "Yes, this is an integration theory, so it's local.",
            "You can always.",
            "Do integration in a distributed manner.",
            "What happens if we get sparser sampling?",
            "Are we going to be able to reconstruct an accurate integral from that?",
            "What if these nodes set up an ad hoc communications network where the nodes don't actually know their physical location?",
            "They just know proximity data they know which of their neighbors are close by, but they don't know exactly where they are."
        ],
        [
            "Or in what direction?",
            "Well, here is one step.",
            "In some sense of first step towards setting up numerical analysis in this theory.",
            "And this is a result that will work in that ad hoc network setting, but it's restricted in that it only works for the plane.",
            "Here's the idea.",
            "If you sample the connectivity of the upper and lower excursion sets of your function correctly.",
            "Then just by clustering just by counting connected components of those excursion sets, you can get an exact value.",
            "For the integral with respect to Euler characteristic, in so doing, now the proof of this is really simple application of what topologists called duality and what everyone else in the world calls.",
            "Well, you know if you have a hole in the plane and you look at the compliment, it's got something there inside the hole, so I'll flash through the equations for that.",
            "Apologists in the audience, but that apologists in the audience don't need to see the equations.",
            "'cause all I have to do is say, duality.",
            "And it's pretty clear how it works.",
            "Instead of showing you theorems and proofs, let me show you how this works by actually showing you if I can.",
            "Launch this.",
            "While bending down.",
            "I'm gonna have to go off my cure for a second.",
            "Or maybe I can.",
            "There we go.",
            "OK, so let me let me build a network.",
            "And it is generating.",
            "This is a random network of 32,000 nodes with edges.",
            "When the nodes are close to each other, it's packed in there, so you can't see the edges so well, and I'm going to lay down a target.",
            "There you go, that target turned on all of those sensors.",
            "Here's another target that turns on some more sensors, and I can lay a few more down like this.",
            "Now this network has some holes inside of it because it's.",
            "It's a random network.",
            "It's entirely likely that when we run the code, there may be an error.",
            "Let's see what happens.",
            "Ah, it works, right?",
            "And you can see that even if we.",
            "Do a more complicated.",
            "Set that wraps around.",
            "And intersects.",
            "Then assuming there are no discretization errors and it samples the connectivity of the upper and lower excursion sets correctly will get the right answer.",
            "It didn't get the right answer because it did not sample some.",
            "Excursion set correctly.",
            "I'm guessing that a likely source for that error might be.",
            "Oh right about here.",
            "Yeah, if I zoom in, these two patches really ought to be connected, but there was a bit of an undersampling in the network right there now.",
            "What's what's the bad thing about this?",
            "Well, the bad thing about this integration theory is that a single point does not have measure 0.",
            "It has full has measure.",
            "One has lots of measure, a single point error is a heavy sort of error that makes numerical analysis challenging.",
            "Well, wouldn't it be nice?"
        ],
        [
            "If instead of doing.",
            "Integer valued integration.",
            "We did real valued integration so that we could, you know, start tweaking epsilons and things."
        ],
        [
            "Bad.",
            "Well, let's do that.",
            "Now first of all, I should say that extending this integration theory to real valued functions is.",
            "Not a new idea, it's been done before it was done by Rota, oh heavens almost 20 years ago.",
            "Maybe 15 years ago.",
            "Something like that.",
            "And then by Chen 10 years ago.",
            "The bad news is that their extension, although lovely in many ways.",
            "Has the following property any continuous function?",
            "It's integral 0.",
            "That's not so good from the point of view of trying to do numerical analysis, at least for the things that we want to do.",
            "So let's let's try to redo it.",
            "Let's look at real valued functions that are tame.",
            "What do I mean by atame real valued function?",
            "I mean, look at its graph and then that has to be a nice team set.",
            "In your space crossed the reels.",
            "And I'm going to not take a very sophisticated approach.",
            "I'm going to do it.",
            "Any calculus student would do and say well if we wanted to find the integral, I'm just going to do like I learned in calculus class.",
            "Take a step function and that step function is it's not integer valued, but it's.",
            "You know it's discretely valued.",
            "I could blow it up so that it was integer valued and then integrate that and then scale it back down.",
            "Now there are two ways to approximate by step functions.",
            "You could use the floor or you could use the ceiling upper lower semi continuous.",
            "In normal integration theory, it doesn't matter.",
            "In this integration theory it does matter.",
            "You don't get the same results, why?",
            "Because the difference between the two is not a set of Euler measures 0.",
            "Although it is a set of LA Bag measure 0, so let's call these two resulting measures, dikhai lower and upper.",
            "The good news is that these limits exist.",
            "This is well defined, still gives you a decent integration theory.",
            "The bad news is, is that these are no longer homomorphisms.",
            "What does that mean?",
            "That means.",
            "The integral operator is no longer a linear operator.",
            "You can't take the sum of two integrands and get the sum of their integrals.",
            "An I found that when trying to do numerical analysis, non linearity is a bad property for integrals to have.",
            "Your mileage may vary, but these integrals do have some nice interpretations that make them computable and useful.",
            "One interpretation is in terms of this nice piecewise decent class of objects.",
            "These O minimal structures.",
            "If you take an open K dimensional simplex and look at an integrand that is, ah, fine on it that you know is.",
            "Nice and monotonic.",
            "No crazy stuff then.",
            "The integral this limit is really just the infima of the function rescaled by the Euler characteristic of the simplex.",
            "The Upper Euler integral gives you the supremum of the function scaled by the Euler characteristic.",
            "That's nice."
        ],
        [
            "Is why is that nice?",
            "Well, here's a couple of things that we can do.",
            "One is start pushing the mathematics a little bit harder and appealing to a branch of mathematics called stratified Morse theory that looks at critical points of functions, but allows you to do that over singular spaces.",
            "If we do that, then we see the two measures.",
            "These upper and lower Euler measures really correspond to two different natural Morse indices.",
            "In the stratified setting.",
            "Well, that may or may not mean much to you.",
            "Here's a corollary of that.",
            "That should mean something to you if you have a Morse function on a manifold.",
            "So think of a nice smooth function with a finite number of non degenerate critical points.",
            "You know you've got.",
            "Maxima, minima saddles.",
            "Things like that.",
            "Then these integrals are really just an alternating sum of the critical values weighted by negative one to either the Morse index or the morsko index, depending on whether using the upper or the lower boiler measure.",
            "So this is kind of nice.",
            "You can think of Euler characteristic as being an alternating sum of.",
            "Negative one to the Morse index.",
            "The Euler characteristic integral is that weighted by the function values.",
            "So bringing that down yet one step lower to something a little more concrete.",
            "If you've got a function on the reals, then these integrals are really just total variation.",
            "So this integration theory is a far reaching generalization of what total variation is that integrates well with."
        ],
        [
            "Theory.",
            "Now, how is that going to be useful?",
            "Well, once you've got this theory set up, you can start turning the crank and generating lots and lots of formula for computing these integrals.",
            "It's great when you have lots of different ways to compute something, because you can play one off of the other.",
            "In order to do approximations to do numerics."
        ],
        [
            "Where might that be useful?",
            "Here's an example.",
            "This is a relative sort of problem where you have a hole in your data and you want to know the best way to fill it in.",
            "Let's say that I know what my integrand is on the plane.",
            "Outside of some nice looking wholesome contractible hole where the data doesn't exist.",
            "I'd like to estimate.",
            "The integral over the entire plane based on what I know on the exterior of the hole.",
            "For the moment, we're back to the constructible category.",
            "We're back to the piecewise constant to the integer valued category.",
            "We have rigorous upper and lower bounds for what this integral should be based on.",
            "Filling this disk in with either the minimum or the maximum value of the integrand as realized on the boundary.",
            "And.",
            "You can see there are different ways that things might connect up on the inside.",
            "All kinds of crazy things can happen, but these bounds where you fill it in with one or zero respectively give you.",
            "Decent bounds on what's happening that doesn't."
        ],
        [
            "Take away the question, however, of what should you choose as something reasonable and intelligent to fit in between those bounds.",
            "And here's one example where having a real valued theory is going to be helpful.",
            "That claim that choosing a harmonic extension is going to be a good thing to do.",
            "Why is that?",
            "Well, my intuition for why comes out of the proof of the fact that any harmonic extension fixing the points on the boundary.",
            "Is going to lie between the theoretical upper and lower bounds.",
            "And the proof of that is just just a three line proof in Morse theory, where you're counting Maxima, minima, saddles pairing off those values and cancelling out."
        ],
        [
            "When you take a harmonic extension, you're going to get.",
            "Value for your integral that is not necessarily an integer.",
            "That's not a bad thing.",
            "That's really a good thing.",
            "If I were to look at this situation where I had very sparse data around the boundary, I just knew 1010.",
            "I don't know whether this comes from one target support that goes across the whole or whether it comes from 2 target supports that are separate.",
            "What would I do?",
            "Well, if I take a harmonic extension, then I get a maximum here.",
            "I get minimum here and I get a saddle point at this level C in the perfectly symmetric case C would be 1/2 and the integral, given this Morse theoretic formula would be the sum of the Maxima minus the sum of the saddles or 2 -- C if C were 1/2 then this would be giving me an expected value of three halves.",
            "The number of targets that I had, which is an intelligent thing.",
            "If I knew more about the geometry of my whole.",
            "Then my value of C might be much closer to 0 in this case, indicating the fact that, well, it seems more likely that you've got closer to two targets than one target, and this is the beginnings of setting up expected values based on the confidence of your data."
        ],
        [
            "The last thing that I'm going to talk about in my remaining minutes is how to how to bump some of these techniques up and do more interesting things with the integration."
        ],
        [
            "Things at the level of Integral transforms the one result that we've gone over carefully about computing targets can really be thought of in terms of inverting a particular integral transform.",
            "What do I mean by that?",
            "If you think about the workspace where the targets live is being a space W the sensor space which reads, targets and counts targets as being a SpaceX, then what is sensing?",
            "What does it mean that the sensors sense targets?",
            "Well, it means that there's some relation in the cross product.",
            "There's some set where a point here means that.",
            "A sensor at X sees a target at W. So if you have some finite collection of targets, then you look at their characteristic set.",
            "And you pull back to the product.",
            "And then you push down to the sensor space.",
            "And what the sensor is doing is really reading this off right here and counting one target.",
            "So what's really happening when you construct this counting function is that you're taking the integral transform of the characteristic function of the targets.",
            "With respect to this Colonel.",
            "And the theorem that we proved earlier says that integrating that transform.",
            "And integrating.",
            "The function whose transform it is.",
            "Differs by a factor of N, where N is the Euler characteristic of the fiber."
        ],
        [
            "Now there are lots of other integral transforms in the world.",
            "I seem to recall learning about Fourier transforms.",
            "I seem to recall teaching something about foray transforms once or twice.",
            "I never liked foray transforms.",
            "I never liked any integral transforms.",
            "I think I spent most of my life trying to avoid doing analysis and papers.",
            "Now I'm kind of stuck 'cause I have to think about Fourier transforms, but that does not depress me.",
            "I'm kind of happy because now I don't have to write down equations.",
            "I could just drop pictures.",
            "This is what a Fourier transform is, right?",
            "You're.",
            "See your phase vector is the vector that's orthogonal to these lines, and then what are you doing you're integrating?",
            "Along each of these lines with respect to Euler characteristic, you're counting along those affine subspaces and then integrating in this direction, adding up if you're doing things in the discrete world.",
            "Or you can integrate with respect to Lebesgue measure in that direction if you want."
        ],
        [
            "What's radon transform?",
            "Oh gosh, I never liked that one either until I started drawing isospectral lines and thinking in terms of cartoons, right?",
            "I'm just integrating along these subspaces based at a particular point and counting 'cause I'm integrating with respect to other characteristic and then doing that over my."
        ],
        [
            "Entire domain Bessel transforms.",
            "Same thing, but with circular isospectral sets and all kinds of results.",
            "Now make a lot more sense, at least to me.",
            "When I have these kinds of cartoons up, I think I've got two or three minutes left, so let me show you another piece of software or two that illustrates how some of these things might work.",
            "Let's see for the sake of time.",
            "I've already set up a situation with a hex grid, and I've laid down some targets in different shapes, and I've laid them down in a kind of a bad way.",
            "Boy, this projector doesn't show red.",
            "Those are supposed to be red, red, red, red.",
            "If I try to compute how many targets there are by integrating with respect to Euler characteristic, I'm going to get the wrong answer.",
            "Let me show you that I'm going to get the wrong answer.",
            "And I got the wrong answer.",
            "The computer program counted seven when there's really only five.",
            "Why is that?",
            "Well, look, these two sets overlap right here, but there's hardly anything that registers it.",
            "These three.",
            "Ooh, they're really close to being tangent.",
            "There's all kinds of near tangencies in the way, and the theory can't tell whether they overlap or they don't overlap, so gets it wrong.",
            "What's one thing that we could do?",
            "We could set up an integral transform.",
            "That's really convolution with respect to a nice little bump function that has the effect of taking an average weighted average with respect to your neighbors.",
            "And if I do that integral transform, then the data gets smoothed out a little bit.",
            "And if I now pass to the real valued integration theory.",
            "And compute the integral with respect to Euler characteristic.",
            "Then I get an expected value that's much closer to the answer and at least tells me that, oh, that value of seven was probably not too low.",
            "If anything was probably too high.",
            "That's one thing that's kind of interesting.",
            "Another thing that.",
            "Well, this is precarious that can be done.",
            "Is let's say if I were to choose hexagonal targets.",
            "Something like this?",
            "And I lay down a couple of hexagons.",
            "If I set a transform that is something like a Bessel transform.",
            "That integrates along.",
            "Concentric circles, where in this case I'm matching the waveform to the target shape itself.",
            "I'm integrating along concentric hexagons and then performing that transform at every point.",
            "That's a lot of communication, but what's going to happen when I have?",
            "When I have a base point that say over here and integrating with respect to Euler characteristic, it's picking up one along each of these sidelobes and it's telling me something about the width of the target in this direction.",
            "On the other hand, if I were to start right in the middle and start integrating around these loops, then I just get a constant times the Euler characteristic of the circle.",
            "What's the other characteristic of a circle at 0?",
            "So the closer I am to the middle of the target, the lower the value that functional gives me, So what?",
            "Boy, you can't see the red in there at all.",
            "That's very frustrating.",
            "So if I switch to looking at the lower excursion sets then you can see that this transformed function.",
            "Finds where the centers of the targets actually are.",
            "So with this, not only can we.",
            "Compute how many targets there are, but we can compute where their centers are.",
            "If we know something about the shape and match the waveform to it and have some information about how big the target support is, this one has a deep.",
            "Center and this one has a shallower center and this one even shallower still."
        ],
        [
            "Alright, let me end with a couple of things that I don't know how to do that I wish I could do.",
            "One is when doing these integral transforms you have the same problem that everyone who does radar systems have has.",
            "As you perform an integral transform, you get energy loss out of sidelobes.",
            "Various sorts of issues like that.",
            "Now the guys who do radar, they have all kinds of tricks for mitigating that kind of energy leakage.",
            "Doing fancy signal processing stuff, I'd like to be able to just import all of that stuff over this integration theory, but certain things like oh, the integral operator isn't linear all the time.",
            "Make it challenging.",
            "Everything I've talked about today is pretty much integer valued data problems having to do with counting.",
            "What if you wanted to integrate more complicated forms of data?",
            "What would you do?",
            "How do you efficiently compute these integral transforms?",
            "As you could see the computation that I did took a long time.",
            "Part of that is because it's written in Java, but part of it is just a lot of things to compute.",
            "And even though these integration theories have been around for 30 years, it's lived in a very pure corner of the mathematics world and no one is really thought about how to affectively do numerical analysis."
        ],
        [
            "This is just a small corner of some of the things I work on in.",
            "Applications of topology.",
            "A lot of those applications being denied."
        ],
        [
            "Works.",
            "Thanks for your attention.",
            "Questions.",
            "Then I actually have a question.",
            "Appointment just have oil produced a greater than some.",
            "It's a non 0 right?",
            "Certainly, but in OK.",
            "So the question was how do you deal with the fact that in the integer value case a point has mass one in the real value case of point has mass one as well?",
            "Yes, that's true, but if you.",
            "Convolve your function and smooth it out.",
            "Then if you have a, you know a field that reads 2 everywhere and you have a bit of noise and one of your sensors reads 3.",
            "Then convolving it out is going to drop that value to 2.1 and its contribution to the integral's going to be much less.",
            "OK.",
            "Question that says."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the the first dog.",
                    "label": 0
                },
                {
                    "sent": "Of the session is Robert Christ on Euler calculus and data.",
                    "label": 0
                },
                {
                    "sent": "Alright, thank you for that rousing introduction.",
                    "label": 0
                },
                {
                    "sent": "You know there's something about having a microphone in your hand.",
                    "label": 0
                },
                {
                    "sent": "I I feel I feel different.",
                    "label": 0
                },
                {
                    "sent": "I feel like I should be saying something other than math.",
                    "label": 0
                },
                {
                    "sent": "Once you put your hands on the laptop and say this prayer with me people.",
                    "label": 0
                },
                {
                    "sent": "No, maybe not that wrong venue, although what I am going to do today is talk a little bit about some good news and try to.",
                    "label": 0
                },
                {
                    "sent": "Oh, spread the gospel of Euler calculus.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my motivation for doing this comes from networks comes from sensor networks.",
                    "label": 0
                },
                {
                    "sent": "In particular, that's a little bit disjoint from some of the things that a lot of people in the audience are interested in, but nevertheless there's enough overlap to make some of the methods that I'm going to talk about hopefully applicable to whatever you might be here for.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now the tools that I'm going to use are similar to tools that you've heard in talks yesterday and will be hearing in talks tomorrow and the next day.",
                    "label": 0
                },
                {
                    "sent": "These tools are topological in nature and being topological that means you get to use a lot of your topological intuition.",
                    "label": 0
                },
                {
                    "sent": "You care bout things up to deformation, you don't care so much about rigid geometric structures as you do global or rough topological features.",
                    "label": 0
                },
                {
                    "sent": "Now that sounds pretty squishy.",
                    "label": 0
                },
                {
                    "sent": "But what you do to firm it up a little bit as you add the constructs of algebraic topology, you put the algebra on top of it, and the marriage between those very hard algebraic methods and the squishy topological ideas makes for a good tool in dealing with data, in particular because of its robustness.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Combined with compute ability, so the particular set of tools that I'm going to talk about are a type of calculus, a type of integral calculus that's built on the Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "The topological invariant that's oh a couple of 100 years old by now.",
                    "label": 0
                },
                {
                    "sent": "Now a lot of people have seen Euler characteristic before.",
                    "label": 0
                },
                {
                    "sent": "Some people may have even seen the basics of or the beginnings of Euler calculus before.",
                    "label": 0
                },
                {
                    "sent": "If you've had any exposure to integral geometry.",
                    "label": 0
                },
                {
                    "sent": "What I'm going to push today is a certain perspective on that, and a certain class of applications on that, and this is.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All stemming from the definition of the Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "So what do I look characteristic?",
                    "label": 0
                },
                {
                    "sent": "While most people learned vertices minus edges plus faces, let's let's think about that a little bit more and I want you to think of Euler characteristic is a generalization of counting.",
                    "label": 0
                },
                {
                    "sent": "So if I put if I put a collection of dots on the screen and I say how many things are there you look at it, you count and you compute its Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "Can you say 7?",
                    "label": 0
                },
                {
                    "sent": "The Euler characteristic of that set is going to be 7.",
                    "label": 0
                },
                {
                    "sent": "Now let's take those objects and let's glue some of them together.",
                    "label": 0
                },
                {
                    "sent": "I'm going to connect certain objects.",
                    "label": 0
                },
                {
                    "sent": "When I do, and if I were to ask any reasonably intelligent person how many things, how many objects are there up there?",
                    "label": 0
                },
                {
                    "sent": "They'd say, well, there's.",
                    "label": 0
                },
                {
                    "sent": "There's three things I've glued some stuff together.",
                    "label": 0
                },
                {
                    "sent": "I've identified them.",
                    "label": 0
                },
                {
                    "sent": "There's three.",
                    "label": 0
                },
                {
                    "sent": "We went from 7 to 3 by adding four edges so inductively.",
                    "label": 0
                },
                {
                    "sent": "We would say, well, edges get weighted with a negative one.",
                    "label": 0
                },
                {
                    "sent": "The - Now what happens if we add just one more edge then if I ask you how many things are up there, you might still say that three is a reasonable answer, but if we follow the algebra of assigning a negative one to edges, then we would get an answer of two for the Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "And that's our first hint that it's computing something more than just counting the number of things that are there.",
                    "label": 0
                },
                {
                    "sent": "I'm really counting the number of globs of clusters, but I'm also keeping track of the fact that this one has a cycle in it has a whole.",
                    "label": 0
                },
                {
                    "sent": "Now, if I wanted to get back to just counting clusters, I could fill that hole in with something 2 dimensional and I look at that and now I would say OK, I've got three clusters and no funny stuff happening here.",
                    "label": 0
                },
                {
                    "sent": "Let's call the Euler characteristic of that three.",
                    "label": 0
                },
                {
                    "sent": "That motivates us to wait a face 2 dimensional piece with weighting plus one.",
                    "label": 0
                },
                {
                    "sent": "If we continue that exercise inductively, it motivates the definition of Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "As being an alternating sum of the number of K dimensional pieces that you have in a decomposition of a space, so vertices get weighted with plus one edges get weighted with minus one etc.",
                    "label": 0
                },
                {
                    "sent": "And the observation that one makes after setting up that definition is the observation that was made hundreds of years ago.",
                    "label": 0
                },
                {
                    "sent": "That if you take the boundary of a polyhedron, something that is topologically a 2 dimensional sphere.",
                    "label": 0
                },
                {
                    "sent": "Then no matter how you break it up into vertices, an edge is an faces.",
                    "label": 0
                },
                {
                    "sent": "You always get the same number for the Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "You always get to.",
                    "label": 0
                },
                {
                    "sent": "And the reason for this is that you can equivalently described the Euler characteristic as being the alternating sum of ranks of homology groups.",
                    "label": 0
                },
                {
                    "sent": "Topological invariants of a space that don't depend on how it's decomposed into pieces, or how it's stretched and deformed.",
                    "label": 0
                },
                {
                    "sent": "That's the Euler caracara.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tristich and we're going to use that combined with one other perspective to build a calculus and that additional tool, or that additional perspective is one that comes from the theory of sheaves.",
                    "label": 0
                },
                {
                    "sent": "This is maybe less well known than other characteristic, but it's not that bad.",
                    "label": 0
                },
                {
                    "sent": "Although I don't recommend you run to the library and pick up a nice thick book on sheaf theory, stick with the pictures at least for this talk.",
                    "label": 0
                },
                {
                    "sent": "What are sheaves?",
                    "label": 0
                },
                {
                    "sent": "Sheaves are a way of assigning data to open sets in a space, so I think of covering a space with open patches, and a sheaf is a way of assigning some sort of data to those open sets.",
                    "label": 0
                },
                {
                    "sent": "That data is usually something algebraic.",
                    "label": 0
                },
                {
                    "sent": "The most common chief that you'd run across is the chief of continuous functions over a space where you assign to an open set the space of continuous functions over that open set.",
                    "label": 0
                },
                {
                    "sent": "Now sheaves have to have two additional properties they have to respect.",
                    "label": 0
                },
                {
                    "sent": "Unions if you take overlaps of two open sets and you look at something that agrees on the intersection, then you have to be able to continue that to something over the Union.",
                    "label": 0
                },
                {
                    "sent": "And it also has to respect restrictions.",
                    "label": 0
                },
                {
                    "sent": "If I have one open set that is included in another open set, then I need some way of identifying the data between them.",
                    "label": 0
                },
                {
                    "sent": "Once you have that, you have something called the Shifan Sheaf theory is an elaborate mathematical construct for going from local information over sets.",
                    "label": 0
                },
                {
                    "sent": "Patching them together, gluing them to get global information.",
                    "label": 0
                },
                {
                    "sent": "Now, how does the oil?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Characteristic fit into that, there's a wonderful property that falls straight out of the homological definition.",
                    "label": 0
                },
                {
                    "sent": "That someone in computer science might call an inclusion exclusion principle.",
                    "label": 0
                },
                {
                    "sent": "Namely, if I take the Euler characteristic of the Union of two subsets of the space, then I can express that as the sum of their Euler characteristics minus the Euler characteristic of their intersection.",
                    "label": 0
                },
                {
                    "sent": "That's a great formula.",
                    "label": 0
                },
                {
                    "sent": "Where have we seen formulas like that before?",
                    "label": 0
                },
                {
                    "sent": "Well, we've seen formulas like that when we took real analysis course and got to the section on integration that was the beginning of measure theory, right?",
                    "label": 0
                },
                {
                    "sent": "Volume has to satisfy that length has to satisfy that area has to satisfy that.",
                    "label": 0
                },
                {
                    "sent": "What also satisfies that counting finite sets and inductively the Euler characteristic satisfies that as well.",
                    "label": 0
                },
                {
                    "sent": "And because of that one can get out of hammer.",
                    "label": 0
                },
                {
                    "sent": "And start banging on the Euler characteristic and turn it into something like a measure.",
                    "label": 0
                },
                {
                    "sent": "You can't do the full blown Sigma algebra deal.",
                    "label": 0
                },
                {
                    "sent": "But you can integrate certain functions against other characteristic.",
                    "label": 0
                },
                {
                    "sent": "This is not a new idea, it's an old idea.",
                    "label": 0
                },
                {
                    "sent": "The perspective that I'm going to push today is.",
                    "label": 0
                },
                {
                    "sent": "The branch that comes from topology, from sheaf theory in particular, and there are several people who 2030 years ago saw that the Euler characteristic is really the basis for good integration theory.",
                    "label": 0
                },
                {
                    "sent": "Of course this has.",
                    "label": 0
                },
                {
                    "sent": "Longer antecedents in the realm of geometry going back even to blaschka and hot vigor.",
                    "label": 0
                },
                {
                    "sent": "It's been recognized that one can do integral geometry that one can integrate geometric objects with respect to Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "There have been applications of this theory in several fields.",
                    "label": 0
                },
                {
                    "sent": "Probability is 1.",
                    "label": 0
                },
                {
                    "sent": "In particular, thinking about expected values of Euler characteristics of excursion sets and what I'm going to push today is some new applications.",
                    "label": 0
                },
                {
                    "sent": "2 problems.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In networks.",
                    "label": 0
                },
                {
                    "sent": "Let me go over some definitions and you're going to have to stick with me and wait for the applications that are coming.",
                    "label": 0
                },
                {
                    "sent": "So we're going to look at a particular class of functions.",
                    "label": 0
                },
                {
                    "sent": "These are going to be integrable functions.",
                    "label": 0
                },
                {
                    "sent": "In this theory, these functions are called constructible, so constructible functions over some set are not real valued.",
                    "label": 0
                },
                {
                    "sent": "Their integer valued, they're going to be piecewise constant, and they're going to be piecewise constant over relatively nice sets, or tame.",
                    "label": 0
                },
                {
                    "sent": "Set what's what's tame.",
                    "label": 0
                },
                {
                    "sent": "Well, in one sense I could wave my hands and say tame means it has a well defined Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "You could break it up into vertices and edges and faces.",
                    "label": 0
                },
                {
                    "sent": "You can triangulate the space in a nice finite way.",
                    "label": 0
                },
                {
                    "sent": "Not all things are like that.",
                    "label": 0
                },
                {
                    "sent": "There are various fractally nonsense objects in the world that doesn't work so well for.",
                    "label": 0
                },
                {
                    "sent": "There's a much cleaner, better, more precise way to define tameless that if you've not heard this before, this is something worth looking up.",
                    "label": 0
                },
                {
                    "sent": "This is the theory of O minimal structures.",
                    "label": 0
                },
                {
                    "sent": "Where one says, well, you know a lot of times, piecewise linear sets are nice.",
                    "label": 0
                },
                {
                    "sent": "We have this nice simplicial structure or real semialgebraic sets are nice.",
                    "label": 0
                },
                {
                    "sent": "We have a triangulation theorem for them, or sub analytic sets, or nice.",
                    "label": 0
                },
                {
                    "sent": "We have a nice big well defined theory for those and O minimal structures away to axiomatize all of those different systems down to just a couple of couple of simple properties you look at.",
                    "label": 0
                },
                {
                    "sent": "Collections of Boolean algebra's of sets.",
                    "label": 1
                },
                {
                    "sent": "Let's say in RN.",
                    "label": 0
                },
                {
                    "sent": "That are closed with respect to certain natural operations projection products.",
                    "label": 1
                },
                {
                    "sent": "And these elements of these collections are called tame sets or or definable sets.",
                    "label": 0
                },
                {
                    "sent": "You can talk about the minimal structure of semialgebraic sets or the oh minimal structure of globally sub analytic sets or the oh minimal structure of piecewise linear objects and then fix your class and work in it for the rest of this talk, you can just pretend that everything in the world is piecewise linear and that'll get to buy just fine, although it's much more general than that.",
                    "label": 0
                },
                {
                    "sent": "Now some results that come from this theory that are going to be useful for integration are as follows.",
                    "label": 0
                },
                {
                    "sent": "Any team set is triangulable.",
                    "label": 0
                },
                {
                    "sent": "You can break it up into vertices, edges, faces and the like and any constructible function over this set.",
                    "label": 0
                },
                {
                    "sent": "Any function whose level sets are tame can be represented as a sum of characteristic functions over nice tame sets with some integer coefficients in front of it.",
                    "label": 0
                },
                {
                    "sent": "So there's a nice decomposition.",
                    "label": 0
                },
                {
                    "sent": "It's not a unique decomposition, but.",
                    "label": 1
                },
                {
                    "sent": "Exists and it's finite, and it's nice.",
                    "label": 0
                },
                {
                    "sent": "And all such functions are going to be integrable with respect to Euler characteristic as follows.",
                    "label": 0
                },
                {
                    "sent": "Here's an explicit definition.",
                    "label": 0
                },
                {
                    "sent": "It's the only definition that makes any sense whatsoever.",
                    "label": 0
                },
                {
                    "sent": "What is the integral of a an integer valued constructible function with respect to Euler characteristic?",
                    "label": 0
                },
                {
                    "sent": "Well, if I can break it up into a finite combination of characteristic functions over simplices.",
                    "label": 0
                },
                {
                    "sent": "Then, well, it's finite so I can switch the integral in the sum, certainly.",
                    "label": 0
                },
                {
                    "sent": "An whatever integration is it it better be linear right?",
                    "label": 0
                },
                {
                    "sent": "So I can pull those constants out and the only thing I have to do is integrate a characteristic function over a set with respect to this measure?",
                    "label": 0
                },
                {
                    "sent": "What's the only sensible definition for that?",
                    "label": 0
                },
                {
                    "sent": "Well, it's the measure of the set the Euler characteristic of the set, which is well defined, so that's what integration with respect to Euler characteristic means.",
                    "label": 1
                },
                {
                    "sent": "It's a fancy way of talking about the oil characteristic of certain types of functions.",
                    "label": 0
                },
                {
                    "sent": "Of immigrants.",
                    "label": 0
                },
                {
                    "sent": "But that's nice.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Here's something that pushes.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A little bit a slightly different perspective that we'll see has some utility.",
                    "label": 0
                },
                {
                    "sent": "This goes back to McPherson in the 70s.",
                    "label": 0
                },
                {
                    "sent": "Kashiwara in the 70s independently and then really almost rediscovered by Shapira in Viro, the idea that this integral is really a very natural construction in sheaf theory, it corresponds to something called a push forward.",
                    "label": 0
                },
                {
                    "sent": "Where what does that mean?",
                    "label": 0
                },
                {
                    "sent": "If you have an appropriate map between two spaces, then you can think about the piecewise constant functions over X.",
                    "label": 0
                },
                {
                    "sent": "The piecewise constant functions over why any such map induces a natural map at this level on these sheaves of constructible functions, and what is that map?",
                    "label": 1
                },
                {
                    "sent": "Well, let's think about what it is in the case of a trivial mapping where I send all of X down to a point.",
                    "label": 1
                },
                {
                    "sent": "If I do so, then this induced push forward sends constructible or integer valued functions over X2 integer valued functions over a point.",
                    "label": 0
                },
                {
                    "sent": "What are integer valued functions over a point?",
                    "label": 0
                },
                {
                    "sent": "That's just the integers themselves.",
                    "label": 0
                },
                {
                    "sent": "This induced mapping is the integral with respect to Euler characteristic, whi because it has to respect all the operations associated with the sheaf.",
                    "label": 0
                },
                {
                    "sent": "The idea of gluing things together?",
                    "label": 0
                },
                {
                    "sent": "The idea of restricting things that's really what integration is all about.",
                    "label": 0
                },
                {
                    "sent": "Integration is something local.",
                    "label": 0
                },
                {
                    "sent": "You can glue two domains together and integrate over their union.",
                    "label": 1
                },
                {
                    "sent": "Now a crawler that comes from this more abstract perspective is that this integration theory has a fubini theorem.",
                    "label": 0
                },
                {
                    "sent": "You know, we teach our students Fubini theorem all the time.",
                    "label": 0
                },
                {
                    "sent": "If you have an integral with respect to the X&YY, you can integrate in One Direction 1st and then integrate in the other direction.",
                    "label": 0
                },
                {
                    "sent": "What this means in this context is if you have a mapping from F. Pardon me from X to Y.",
                    "label": 0
                },
                {
                    "sent": "Then you can integrate over the.",
                    "label": 0
                },
                {
                    "sent": "Inverse images of this map over the fibers of this map in the vertical direction and then you can integrate over the base.",
                    "label": 0
                },
                {
                    "sent": "You can integrate in this direction.",
                    "label": 0
                },
                {
                    "sent": "So that's another piece of evidence that this is a decent integration theory.",
                    "label": 0
                },
                {
                    "sent": "It does with integration theories are supposed to do alright, and there's a lot of other things that fall out immediately from this more abstract perspective as well that we will talk about.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's let's take this.",
                    "label": 0
                },
                {
                    "sent": "Let's use this for a simple problem that will have a simple answer.",
                    "label": 0
                },
                {
                    "sent": "So let's say that you have a network of sensors.",
                    "label": 1
                },
                {
                    "sent": "Very simple sensors, sensors that don't have a lot of advanced signal processing capabilities.",
                    "label": 0
                },
                {
                    "sent": "The only thing that they do is they count targets.",
                    "label": 0
                },
                {
                    "sent": "There's some number of targets in the domain.",
                    "label": 0
                },
                {
                    "sent": "Each sensor can register the presence of some number of nearby targets, but it doesn't say how far away they are.",
                    "label": 0
                },
                {
                    "sent": "It doesn't say what bearing they are an most importantly, it doesn't identify the targets.",
                    "label": 0
                },
                {
                    "sent": "Target ID is very, very expensive from a signal processing point of view, it just gives a number.",
                    "label": 0
                },
                {
                    "sent": "Now there's a lot of redundancy in this data.",
                    "label": 0
                },
                {
                    "sent": "Both of these.",
                    "label": 0
                },
                {
                    "sent": "Sensors see three targets there, right next to each other.",
                    "label": 0
                },
                {
                    "sent": "They're probably seeing the same three targets.",
                    "label": 0
                },
                {
                    "sent": "How do you aggregate that redundant data?",
                    "label": 1
                },
                {
                    "sent": "And get to the point where you can say exactly how many targets there are.",
                    "label": 0
                },
                {
                    "sent": "Well, here's a here.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The way to approach that problem, play computer games and get a little bit of experience.",
                    "label": 0
                },
                {
                    "sent": "You've done this right.",
                    "label": 0
                },
                {
                    "sent": "You've played minesweeper.",
                    "label": 0
                },
                {
                    "sent": "That's really a sensor networks problem.",
                    "label": 0
                },
                {
                    "sent": "You have a sensor field of sensors that count the number of nearby targets, and you get to interrogate that sensor data and what you want to do is figure out where the targets are, and less importantly, how many targets there are.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Instead of thinking about it from the sensors POV, think about it from the target's point of view.",
                    "label": 0
                },
                {
                    "sent": "Each bomb turns on some number of sensors nearby.",
                    "label": 0
                },
                {
                    "sent": "Think of some some neighborhood around that target.",
                    "label": 0
                },
                {
                    "sent": "I'm going to call that the target support than what you're really registering.",
                    "label": 0
                },
                {
                    "sent": "In these sensors is the depth of overlap.",
                    "label": 0
                },
                {
                    "sent": "How many target supports?",
                    "label": 0
                },
                {
                    "sent": "Do you lie in?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's let's ramp that example up a little bit and get a slightly more general result.",
                    "label": 0
                },
                {
                    "sent": "Let's say that your targets reside in some workspace.",
                    "label": 0
                },
                {
                    "sent": "Call it W. That could be any kind of space.",
                    "label": 0
                },
                {
                    "sent": "An I'm going to think of my sensors as living in some continuum limit.",
                    "label": 0
                },
                {
                    "sent": "I'm going to model the collection of sensors by a space.",
                    "label": 0
                },
                {
                    "sent": "I'm going to call that SpaceX and that might be the same spaces.",
                    "label": 0
                },
                {
                    "sent": "W for example.",
                    "label": 0
                },
                {
                    "sent": "The sensors might be floating around the room where you the targets are also located, or it might be a different space.",
                    "label": 0
                },
                {
                    "sent": "The sensors might be embedded in the ceiling tiles, which is 2 dimensional.",
                    "label": 0
                },
                {
                    "sent": "OK, so from the point of view of the sensor, each sensor looks up, counts some number of targets.",
                    "label": 1
                },
                {
                    "sent": "But from the dual point of view, each target turns on some Patch in the sensor space and the sensor field returns accounting function that really just registers.",
                    "label": 1
                },
                {
                    "sent": "How many targets are seen at each point in the sensor space.",
                    "label": 0
                },
                {
                    "sent": "Here's a theorem if you take that function, integrate it with respect to Euler characteristic and normalized by the mass of each target.",
                    "label": 1
                },
                {
                    "sent": "Support assumed to be a constant.",
                    "label": 0
                },
                {
                    "sent": "Then that tells you exactly how many targets there are without any assumptions on the size of the target support.",
                    "label": 0
                },
                {
                    "sent": "This isn't like Minesweeper, where each target is homogeneous and turns on exactly 8 squares around it.",
                    "label": 0
                },
                {
                    "sent": "The actual size and shape of the target supports can vary dramatically as long as their Euler characteristic stays constant, let's say.",
                    "label": 0
                },
                {
                    "sent": "If we were talking about convex sets, then all those Euler characteristics would be equal to 1.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 1
                },
                {
                    "sent": "Well, the proof of this is pretty easy given.",
                    "label": 0
                },
                {
                    "sent": "What little we know about this integration theory, what's the proof?",
                    "label": 0
                },
                {
                    "sent": "Well, what's the integral of this counting function with respect to Euler characteristic?",
                    "label": 0
                },
                {
                    "sent": "That counting function is a sum of characteristic functions over the target supports.",
                    "label": 1
                },
                {
                    "sent": "There is a finite number of targets, so I can switch the sum in the integral and the one thing that I know about integration with respect to Euler characteristic is that on a characteristic function it just returns the Euler characteristic of that set, which is assumed to be a constant end, and that's the entire proof, and there's no hidden assumptions that I'm not telling you about, except I didn't say that everything here was tame, but you knew that that was in effect anyhow.",
                    "label": 0
                },
                {
                    "sent": "Alright, so what's the one assumption I forgot to say?",
                    "label": 0
                },
                {
                    "sent": "I forgot to say that you better make sure that N is not equal to 0 because dividing by zero is always a bad thing.",
                    "label": 0
                },
                {
                    "sent": "That couldn't be a problem, could it?",
                    "label": 0
                },
                {
                    "sent": "Well, here is a collection of annuli.",
                    "label": 0
                },
                {
                    "sent": "The yellow is 1, the green is 2.",
                    "label": 0
                },
                {
                    "sent": "And I've got some union of annuli and I want to know what, how many are there?",
                    "label": 0
                },
                {
                    "sent": "If I integrate this function with respect Euler characteristic I get 0 because the annulus is a set of measure 0 in this measure theory, Alas.",
                    "label": 0
                },
                {
                    "sent": "How many annuli are there?",
                    "label": 0
                },
                {
                    "sent": "How many?",
                    "label": 0
                },
                {
                    "sent": "Four could be 4 or it could be two.",
                    "label": 0
                },
                {
                    "sent": "It could be 6 or 8 or 10 or 12.",
                    "label": 0
                },
                {
                    "sent": "It's not unique in this case.",
                    "label": 0
                },
                {
                    "sent": "So sets of measure zero really do cause a problem in this context, and you can have fun trying to decompose that into 12 annuli.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "How do you compute these sorts of things?",
                    "label": 0
                },
                {
                    "sent": "Maybe this is just one of those theoretical things that you can never compute, know know the Euler characteristic is combinatorial, very easy to compute.",
                    "label": 0
                },
                {
                    "sent": "There are tons of formulas that one could write down in terms of the combinatorics of level sets of upper excursion sets in terms of the Euler characteristics of the level sets, the chambers, the connected components themselves.",
                    "label": 1
                },
                {
                    "sent": "Let me do a simple example or two where you can see how this would.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work, so here's a here's a collection of contractible target supports.",
                    "label": 0
                },
                {
                    "sent": "They all have Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "One you can see they're not necessarily convex.",
                    "label": 0
                },
                {
                    "sent": "The twist around there are different sizes, some you have one entirely contained in another.",
                    "label": 0
                },
                {
                    "sent": "What, what happens?",
                    "label": 0
                },
                {
                    "sent": "Well, let's see.",
                    "label": 0
                },
                {
                    "sent": "We don't get to see the colors, you only get to see the numbers that are registered.",
                    "label": 0
                },
                {
                    "sent": "What do we do?",
                    "label": 0
                },
                {
                    "sent": "We sum up to get this integral.",
                    "label": 0
                },
                {
                    "sent": "The Euler characteristics of the upper excursion sets.",
                    "label": 0
                },
                {
                    "sent": "So I look at all the centers that are.",
                    "label": 0
                },
                {
                    "sent": "Reading some non 0 value I take the Euler characteristic of that this negative one.",
                    "label": 0
                },
                {
                    "sent": "I look at all these sensors that read strictly greater than one.",
                    "label": 0
                },
                {
                    "sent": "I take the Euler characteristic of that.",
                    "label": 0
                },
                {
                    "sent": "I keep filtering up through the data and then eventually I add these results together and I get 7 the number of patches that I started out with.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or likewise, I could look at the weighted Euler characteristics of these individual chambers because these Euler characteristics are sensitive to whether you have a boundary piece or not.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you get plus one, sometimes minus one, sometimes minus two, and if you wait those up and do the combinatorics correctly again, you wind up getting 7.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Some applications of this 2 problems that I care about in sensor networks.",
                    "label": 1
                },
                {
                    "sent": "You might not care about so.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Much, but I think this is kind of slick.",
                    "label": 0
                },
                {
                    "sent": "You can solve problems involving counting with less data than you think you might otherwise.",
                    "label": 0
                },
                {
                    "sent": "Let's say you have a field of sensors that count booms every time there's a boom propagates out.",
                    "label": 0
                },
                {
                    "sent": "Let's say we don't have any echoing or pardon me or diffraction waves going on if we just have simple expansion waves.",
                    "label": 0
                },
                {
                    "sent": "And the sensors count how many times they heard boom.",
                    "label": 0
                },
                {
                    "sent": "This is South Side Chicago, so I should talk about gunfire going off.",
                    "label": 0
                },
                {
                    "sent": "You know you interview people after an incident and.",
                    "label": 0
                },
                {
                    "sent": "You ask people how many.",
                    "label": 0
                },
                {
                    "sent": "How many gunshots were there and no one gets it right.",
                    "label": 1
                },
                {
                    "sent": "It's it's always crazy how many gunshots were there actually?",
                    "label": 0
                },
                {
                    "sent": "Well, if you just count every time there's a boom, you don't keep track of what time it happened.",
                    "label": 0
                },
                {
                    "sent": "You don't keep track of your neighborhood this when and who heard it next?",
                    "label": 0
                },
                {
                    "sent": "Nope, you just keep track of every time you heard a boom.",
                    "label": 1
                },
                {
                    "sent": "And then you integrate the resulting function with respect to Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "Then you'll get an accurate count of how many wavefronts there were without any need for clocks.",
                    "label": 0
                },
                {
                    "sent": "Now the question is, do you have enough data in this sparse sample to be able to accurately?",
                    "label": 0
                },
                {
                    "sent": "Estimate that integral.",
                    "label": 0
                },
                {
                    "sent": "That's a problem for what numerical analysis, which needs to be.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Addressed but stick with me for a minute.",
                    "label": 0
                },
                {
                    "sent": "Here's another example where you can solve a problem involving counting with less data than you might think.",
                    "label": 0
                },
                {
                    "sent": "Let's say you have acoustic sensors built into the roads that increment a counter every time a car drives by.",
                    "label": 0
                },
                {
                    "sent": "It doesn't keep track of What Car it was, whether it was a big car or a little car.",
                    "label": 0
                },
                {
                    "sent": "It doesn't keep track of when it drove past it, just every time a car rumbles past click.",
                    "label": 0
                },
                {
                    "sent": "If you want to know how many cars there were without having to assume that the all the cars are the same or that they drove in nice straight lines.",
                    "label": 0
                },
                {
                    "sent": "Then, assuming your sensor field is dense enough, all you have to do is integrate that function with respect to Euler characteristic and get that integral well approximated and that will tell you how many vehicles there were.",
                    "label": 0
                },
                {
                    "sent": "Now, how does that work when some of these?",
                    "label": 0
                },
                {
                    "sent": "Sets that get traced out don't have Euler characteristic one.",
                    "label": 0
                },
                {
                    "sent": "Some do, some don't, what.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Happens in this case.",
                    "label": 0
                },
                {
                    "sent": "Well, in this case something wonderful works out.",
                    "label": 0
                },
                {
                    "sent": "If you think about what happens in space across time, then even when you have a complicated interaction in.",
                    "label": 0
                },
                {
                    "sent": "This higher dimensional setting it's still a nice contractible set with Euler characteristic one.",
                    "label": 0
                },
                {
                    "sent": "What's happening, we'll remember that slide with the abstract stuff on it about push forwards and the Fubini theorem.",
                    "label": 0
                },
                {
                    "sent": "This is an example of the Fubini theorem in action, because what's really happening is what is the sensor field reading?",
                    "label": 0
                },
                {
                    "sent": "Well at every point.",
                    "label": 0
                },
                {
                    "sent": "Let's try that again.",
                    "label": 0
                },
                {
                    "sent": "At every point.",
                    "label": 0
                },
                {
                    "sent": "The sensor registers A1 every time a car rumbles past.",
                    "label": 0
                },
                {
                    "sent": "That's really counting the number of intervals in this intersection in three dimensional space.",
                    "label": 0
                },
                {
                    "sent": "With this one dimensional line, you're really integrating over the fiber with respect to Euler characteristic, and then you're integrating over the base and by the Fubini theorem that means you're integrating over the entire 3 dimensional domain, and that's why you're getting the vehicle count, correct?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now both of these applications are predicated on being able to accurately approximate an integral in the continuum setting where the theorem holds with some sort of disk.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data how easy is it to do that?",
                    "label": 0
                },
                {
                    "sent": "Well, you look at this and your brain does a great job at counting to 7 that's not so impressive if we take away the lines on the boundary an just sample it even on a nice dense grid.",
                    "label": 0
                },
                {
                    "sent": "All of a sudden your brain is not so good at being able to.",
                    "label": 0
                },
                {
                    "sent": "Look at that and say 7.",
                    "label": 0
                },
                {
                    "sent": "And it would be even less good if we forced your brain to be distributed.",
                    "label": 0
                },
                {
                    "sent": "That might be painful.",
                    "label": 0
                },
                {
                    "sent": "And only look at one little piece at a time and then integrate that data up.",
                    "label": 0
                },
                {
                    "sent": "Can you do that?",
                    "label": 0
                },
                {
                    "sent": "Yes, this is an integration theory, so it's local.",
                    "label": 0
                },
                {
                    "sent": "You can always.",
                    "label": 0
                },
                {
                    "sent": "Do integration in a distributed manner.",
                    "label": 0
                },
                {
                    "sent": "What happens if we get sparser sampling?",
                    "label": 0
                },
                {
                    "sent": "Are we going to be able to reconstruct an accurate integral from that?",
                    "label": 0
                },
                {
                    "sent": "What if these nodes set up an ad hoc communications network where the nodes don't actually know their physical location?",
                    "label": 0
                },
                {
                    "sent": "They just know proximity data they know which of their neighbors are close by, but they don't know exactly where they are.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or in what direction?",
                    "label": 0
                },
                {
                    "sent": "Well, here is one step.",
                    "label": 0
                },
                {
                    "sent": "In some sense of first step towards setting up numerical analysis in this theory.",
                    "label": 0
                },
                {
                    "sent": "And this is a result that will work in that ad hoc network setting, but it's restricted in that it only works for the plane.",
                    "label": 0
                },
                {
                    "sent": "Here's the idea.",
                    "label": 0
                },
                {
                    "sent": "If you sample the connectivity of the upper and lower excursion sets of your function correctly.",
                    "label": 0
                },
                {
                    "sent": "Then just by clustering just by counting connected components of those excursion sets, you can get an exact value.",
                    "label": 0
                },
                {
                    "sent": "For the integral with respect to Euler characteristic, in so doing, now the proof of this is really simple application of what topologists called duality and what everyone else in the world calls.",
                    "label": 0
                },
                {
                    "sent": "Well, you know if you have a hole in the plane and you look at the compliment, it's got something there inside the hole, so I'll flash through the equations for that.",
                    "label": 0
                },
                {
                    "sent": "Apologists in the audience, but that apologists in the audience don't need to see the equations.",
                    "label": 0
                },
                {
                    "sent": "'cause all I have to do is say, duality.",
                    "label": 0
                },
                {
                    "sent": "And it's pretty clear how it works.",
                    "label": 0
                },
                {
                    "sent": "Instead of showing you theorems and proofs, let me show you how this works by actually showing you if I can.",
                    "label": 0
                },
                {
                    "sent": "Launch this.",
                    "label": 0
                },
                {
                    "sent": "While bending down.",
                    "label": 0
                },
                {
                    "sent": "I'm gonna have to go off my cure for a second.",
                    "label": 0
                },
                {
                    "sent": "Or maybe I can.",
                    "label": 0
                },
                {
                    "sent": "There we go.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me let me build a network.",
                    "label": 0
                },
                {
                    "sent": "And it is generating.",
                    "label": 0
                },
                {
                    "sent": "This is a random network of 32,000 nodes with edges.",
                    "label": 1
                },
                {
                    "sent": "When the nodes are close to each other, it's packed in there, so you can't see the edges so well, and I'm going to lay down a target.",
                    "label": 0
                },
                {
                    "sent": "There you go, that target turned on all of those sensors.",
                    "label": 0
                },
                {
                    "sent": "Here's another target that turns on some more sensors, and I can lay a few more down like this.",
                    "label": 0
                },
                {
                    "sent": "Now this network has some holes inside of it because it's.",
                    "label": 0
                },
                {
                    "sent": "It's a random network.",
                    "label": 0
                },
                {
                    "sent": "It's entirely likely that when we run the code, there may be an error.",
                    "label": 0
                },
                {
                    "sent": "Let's see what happens.",
                    "label": 0
                },
                {
                    "sent": "Ah, it works, right?",
                    "label": 0
                },
                {
                    "sent": "And you can see that even if we.",
                    "label": 0
                },
                {
                    "sent": "Do a more complicated.",
                    "label": 0
                },
                {
                    "sent": "Set that wraps around.",
                    "label": 0
                },
                {
                    "sent": "And intersects.",
                    "label": 0
                },
                {
                    "sent": "Then assuming there are no discretization errors and it samples the connectivity of the upper and lower excursion sets correctly will get the right answer.",
                    "label": 1
                },
                {
                    "sent": "It didn't get the right answer because it did not sample some.",
                    "label": 0
                },
                {
                    "sent": "Excursion set correctly.",
                    "label": 0
                },
                {
                    "sent": "I'm guessing that a likely source for that error might be.",
                    "label": 0
                },
                {
                    "sent": "Oh right about here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if I zoom in, these two patches really ought to be connected, but there was a bit of an undersampling in the network right there now.",
                    "label": 0
                },
                {
                    "sent": "What's what's the bad thing about this?",
                    "label": 0
                },
                {
                    "sent": "Well, the bad thing about this integration theory is that a single point does not have measure 0.",
                    "label": 0
                },
                {
                    "sent": "It has full has measure.",
                    "label": 0
                },
                {
                    "sent": "One has lots of measure, a single point error is a heavy sort of error that makes numerical analysis challenging.",
                    "label": 0
                },
                {
                    "sent": "Well, wouldn't it be nice?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If instead of doing.",
                    "label": 0
                },
                {
                    "sent": "Integer valued integration.",
                    "label": 0
                },
                {
                    "sent": "We did real valued integration so that we could, you know, start tweaking epsilons and things.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bad.",
                    "label": 0
                },
                {
                    "sent": "Well, let's do that.",
                    "label": 0
                },
                {
                    "sent": "Now first of all, I should say that extending this integration theory to real valued functions is.",
                    "label": 0
                },
                {
                    "sent": "Not a new idea, it's been done before it was done by Rota, oh heavens almost 20 years ago.",
                    "label": 0
                },
                {
                    "sent": "Maybe 15 years ago.",
                    "label": 0
                },
                {
                    "sent": "Something like that.",
                    "label": 0
                },
                {
                    "sent": "And then by Chen 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "The bad news is that their extension, although lovely in many ways.",
                    "label": 0
                },
                {
                    "sent": "Has the following property any continuous function?",
                    "label": 0
                },
                {
                    "sent": "It's integral 0.",
                    "label": 0
                },
                {
                    "sent": "That's not so good from the point of view of trying to do numerical analysis, at least for the things that we want to do.",
                    "label": 0
                },
                {
                    "sent": "So let's let's try to redo it.",
                    "label": 0
                },
                {
                    "sent": "Let's look at real valued functions that are tame.",
                    "label": 1
                },
                {
                    "sent": "What do I mean by atame real valued function?",
                    "label": 0
                },
                {
                    "sent": "I mean, look at its graph and then that has to be a nice team set.",
                    "label": 0
                },
                {
                    "sent": "In your space crossed the reels.",
                    "label": 1
                },
                {
                    "sent": "And I'm going to not take a very sophisticated approach.",
                    "label": 0
                },
                {
                    "sent": "I'm going to do it.",
                    "label": 0
                },
                {
                    "sent": "Any calculus student would do and say well if we wanted to find the integral, I'm just going to do like I learned in calculus class.",
                    "label": 0
                },
                {
                    "sent": "Take a step function and that step function is it's not integer valued, but it's.",
                    "label": 0
                },
                {
                    "sent": "You know it's discretely valued.",
                    "label": 0
                },
                {
                    "sent": "I could blow it up so that it was integer valued and then integrate that and then scale it back down.",
                    "label": 0
                },
                {
                    "sent": "Now there are two ways to approximate by step functions.",
                    "label": 0
                },
                {
                    "sent": "You could use the floor or you could use the ceiling upper lower semi continuous.",
                    "label": 0
                },
                {
                    "sent": "In normal integration theory, it doesn't matter.",
                    "label": 1
                },
                {
                    "sent": "In this integration theory it does matter.",
                    "label": 0
                },
                {
                    "sent": "You don't get the same results, why?",
                    "label": 0
                },
                {
                    "sent": "Because the difference between the two is not a set of Euler measures 0.",
                    "label": 0
                },
                {
                    "sent": "Although it is a set of LA Bag measure 0, so let's call these two resulting measures, dikhai lower and upper.",
                    "label": 0
                },
                {
                    "sent": "The good news is that these limits exist.",
                    "label": 0
                },
                {
                    "sent": "This is well defined, still gives you a decent integration theory.",
                    "label": 0
                },
                {
                    "sent": "The bad news is, is that these are no longer homomorphisms.",
                    "label": 1
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "That means.",
                    "label": 0
                },
                {
                    "sent": "The integral operator is no longer a linear operator.",
                    "label": 0
                },
                {
                    "sent": "You can't take the sum of two integrands and get the sum of their integrals.",
                    "label": 0
                },
                {
                    "sent": "An I found that when trying to do numerical analysis, non linearity is a bad property for integrals to have.",
                    "label": 0
                },
                {
                    "sent": "Your mileage may vary, but these integrals do have some nice interpretations that make them computable and useful.",
                    "label": 0
                },
                {
                    "sent": "One interpretation is in terms of this nice piecewise decent class of objects.",
                    "label": 0
                },
                {
                    "sent": "These O minimal structures.",
                    "label": 0
                },
                {
                    "sent": "If you take an open K dimensional simplex and look at an integrand that is, ah, fine on it that you know is.",
                    "label": 0
                },
                {
                    "sent": "Nice and monotonic.",
                    "label": 0
                },
                {
                    "sent": "No crazy stuff then.",
                    "label": 0
                },
                {
                    "sent": "The integral this limit is really just the infima of the function rescaled by the Euler characteristic of the simplex.",
                    "label": 0
                },
                {
                    "sent": "The Upper Euler integral gives you the supremum of the function scaled by the Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "That's nice.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is why is that nice?",
                    "label": 0
                },
                {
                    "sent": "Well, here's a couple of things that we can do.",
                    "label": 0
                },
                {
                    "sent": "One is start pushing the mathematics a little bit harder and appealing to a branch of mathematics called stratified Morse theory that looks at critical points of functions, but allows you to do that over singular spaces.",
                    "label": 0
                },
                {
                    "sent": "If we do that, then we see the two measures.",
                    "label": 1
                },
                {
                    "sent": "These upper and lower Euler measures really correspond to two different natural Morse indices.",
                    "label": 1
                },
                {
                    "sent": "In the stratified setting.",
                    "label": 0
                },
                {
                    "sent": "Well, that may or may not mean much to you.",
                    "label": 0
                },
                {
                    "sent": "Here's a corollary of that.",
                    "label": 0
                },
                {
                    "sent": "That should mean something to you if you have a Morse function on a manifold.",
                    "label": 0
                },
                {
                    "sent": "So think of a nice smooth function with a finite number of non degenerate critical points.",
                    "label": 0
                },
                {
                    "sent": "You know you've got.",
                    "label": 0
                },
                {
                    "sent": "Maxima, minima saddles.",
                    "label": 1
                },
                {
                    "sent": "Things like that.",
                    "label": 0
                },
                {
                    "sent": "Then these integrals are really just an alternating sum of the critical values weighted by negative one to either the Morse index or the morsko index, depending on whether using the upper or the lower boiler measure.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of nice.",
                    "label": 0
                },
                {
                    "sent": "You can think of Euler characteristic as being an alternating sum of.",
                    "label": 1
                },
                {
                    "sent": "Negative one to the Morse index.",
                    "label": 0
                },
                {
                    "sent": "The Euler characteristic integral is that weighted by the function values.",
                    "label": 0
                },
                {
                    "sent": "So bringing that down yet one step lower to something a little more concrete.",
                    "label": 0
                },
                {
                    "sent": "If you've got a function on the reals, then these integrals are really just total variation.",
                    "label": 0
                },
                {
                    "sent": "So this integration theory is a far reaching generalization of what total variation is that integrates well with.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Theory.",
                    "label": 0
                },
                {
                    "sent": "Now, how is that going to be useful?",
                    "label": 0
                },
                {
                    "sent": "Well, once you've got this theory set up, you can start turning the crank and generating lots and lots of formula for computing these integrals.",
                    "label": 0
                },
                {
                    "sent": "It's great when you have lots of different ways to compute something, because you can play one off of the other.",
                    "label": 0
                },
                {
                    "sent": "In order to do approximations to do numerics.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Where might that be useful?",
                    "label": 0
                },
                {
                    "sent": "Here's an example.",
                    "label": 0
                },
                {
                    "sent": "This is a relative sort of problem where you have a hole in your data and you want to know the best way to fill it in.",
                    "label": 1
                },
                {
                    "sent": "Let's say that I know what my integrand is on the plane.",
                    "label": 0
                },
                {
                    "sent": "Outside of some nice looking wholesome contractible hole where the data doesn't exist.",
                    "label": 1
                },
                {
                    "sent": "I'd like to estimate.",
                    "label": 0
                },
                {
                    "sent": "The integral over the entire plane based on what I know on the exterior of the hole.",
                    "label": 1
                },
                {
                    "sent": "For the moment, we're back to the constructible category.",
                    "label": 0
                },
                {
                    "sent": "We're back to the piecewise constant to the integer valued category.",
                    "label": 0
                },
                {
                    "sent": "We have rigorous upper and lower bounds for what this integral should be based on.",
                    "label": 0
                },
                {
                    "sent": "Filling this disk in with either the minimum or the maximum value of the integrand as realized on the boundary.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You can see there are different ways that things might connect up on the inside.",
                    "label": 0
                },
                {
                    "sent": "All kinds of crazy things can happen, but these bounds where you fill it in with one or zero respectively give you.",
                    "label": 0
                },
                {
                    "sent": "Decent bounds on what's happening that doesn't.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Take away the question, however, of what should you choose as something reasonable and intelligent to fit in between those bounds.",
                    "label": 0
                },
                {
                    "sent": "And here's one example where having a real valued theory is going to be helpful.",
                    "label": 0
                },
                {
                    "sent": "That claim that choosing a harmonic extension is going to be a good thing to do.",
                    "label": 1
                },
                {
                    "sent": "Why is that?",
                    "label": 0
                },
                {
                    "sent": "Well, my intuition for why comes out of the proof of the fact that any harmonic extension fixing the points on the boundary.",
                    "label": 1
                },
                {
                    "sent": "Is going to lie between the theoretical upper and lower bounds.",
                    "label": 0
                },
                {
                    "sent": "And the proof of that is just just a three line proof in Morse theory, where you're counting Maxima, minima, saddles pairing off those values and cancelling out.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When you take a harmonic extension, you're going to get.",
                    "label": 0
                },
                {
                    "sent": "Value for your integral that is not necessarily an integer.",
                    "label": 0
                },
                {
                    "sent": "That's not a bad thing.",
                    "label": 0
                },
                {
                    "sent": "That's really a good thing.",
                    "label": 0
                },
                {
                    "sent": "If I were to look at this situation where I had very sparse data around the boundary, I just knew 1010.",
                    "label": 0
                },
                {
                    "sent": "I don't know whether this comes from one target support that goes across the whole or whether it comes from 2 target supports that are separate.",
                    "label": 0
                },
                {
                    "sent": "What would I do?",
                    "label": 0
                },
                {
                    "sent": "Well, if I take a harmonic extension, then I get a maximum here.",
                    "label": 0
                },
                {
                    "sent": "I get minimum here and I get a saddle point at this level C in the perfectly symmetric case C would be 1/2 and the integral, given this Morse theoretic formula would be the sum of the Maxima minus the sum of the saddles or 2 -- C if C were 1/2 then this would be giving me an expected value of three halves.",
                    "label": 0
                },
                {
                    "sent": "The number of targets that I had, which is an intelligent thing.",
                    "label": 1
                },
                {
                    "sent": "If I knew more about the geometry of my whole.",
                    "label": 0
                },
                {
                    "sent": "Then my value of C might be much closer to 0 in this case, indicating the fact that, well, it seems more likely that you've got closer to two targets than one target, and this is the beginnings of setting up expected values based on the confidence of your data.",
                    "label": 1
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The last thing that I'm going to talk about in my remaining minutes is how to how to bump some of these techniques up and do more interesting things with the integration.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things at the level of Integral transforms the one result that we've gone over carefully about computing targets can really be thought of in terms of inverting a particular integral transform.",
                    "label": 0
                },
                {
                    "sent": "What do I mean by that?",
                    "label": 0
                },
                {
                    "sent": "If you think about the workspace where the targets live is being a space W the sensor space which reads, targets and counts targets as being a SpaceX, then what is sensing?",
                    "label": 0
                },
                {
                    "sent": "What does it mean that the sensors sense targets?",
                    "label": 0
                },
                {
                    "sent": "Well, it means that there's some relation in the cross product.",
                    "label": 0
                },
                {
                    "sent": "There's some set where a point here means that.",
                    "label": 0
                },
                {
                    "sent": "A sensor at X sees a target at W. So if you have some finite collection of targets, then you look at their characteristic set.",
                    "label": 0
                },
                {
                    "sent": "And you pull back to the product.",
                    "label": 0
                },
                {
                    "sent": "And then you push down to the sensor space.",
                    "label": 0
                },
                {
                    "sent": "And what the sensor is doing is really reading this off right here and counting one target.",
                    "label": 0
                },
                {
                    "sent": "So what's really happening when you construct this counting function is that you're taking the integral transform of the characteristic function of the targets.",
                    "label": 1
                },
                {
                    "sent": "With respect to this Colonel.",
                    "label": 0
                },
                {
                    "sent": "And the theorem that we proved earlier says that integrating that transform.",
                    "label": 0
                },
                {
                    "sent": "And integrating.",
                    "label": 0
                },
                {
                    "sent": "The function whose transform it is.",
                    "label": 0
                },
                {
                    "sent": "Differs by a factor of N, where N is the Euler characteristic of the fiber.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now there are lots of other integral transforms in the world.",
                    "label": 0
                },
                {
                    "sent": "I seem to recall learning about Fourier transforms.",
                    "label": 0
                },
                {
                    "sent": "I seem to recall teaching something about foray transforms once or twice.",
                    "label": 0
                },
                {
                    "sent": "I never liked foray transforms.",
                    "label": 0
                },
                {
                    "sent": "I never liked any integral transforms.",
                    "label": 0
                },
                {
                    "sent": "I think I spent most of my life trying to avoid doing analysis and papers.",
                    "label": 0
                },
                {
                    "sent": "Now I'm kind of stuck 'cause I have to think about Fourier transforms, but that does not depress me.",
                    "label": 0
                },
                {
                    "sent": "I'm kind of happy because now I don't have to write down equations.",
                    "label": 0
                },
                {
                    "sent": "I could just drop pictures.",
                    "label": 0
                },
                {
                    "sent": "This is what a Fourier transform is, right?",
                    "label": 0
                },
                {
                    "sent": "You're.",
                    "label": 0
                },
                {
                    "sent": "See your phase vector is the vector that's orthogonal to these lines, and then what are you doing you're integrating?",
                    "label": 0
                },
                {
                    "sent": "Along each of these lines with respect to Euler characteristic, you're counting along those affine subspaces and then integrating in this direction, adding up if you're doing things in the discrete world.",
                    "label": 0
                },
                {
                    "sent": "Or you can integrate with respect to Lebesgue measure in that direction if you want.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's radon transform?",
                    "label": 0
                },
                {
                    "sent": "Oh gosh, I never liked that one either until I started drawing isospectral lines and thinking in terms of cartoons, right?",
                    "label": 0
                },
                {
                    "sent": "I'm just integrating along these subspaces based at a particular point and counting 'cause I'm integrating with respect to other characteristic and then doing that over my.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Entire domain Bessel transforms.",
                    "label": 0
                },
                {
                    "sent": "Same thing, but with circular isospectral sets and all kinds of results.",
                    "label": 0
                },
                {
                    "sent": "Now make a lot more sense, at least to me.",
                    "label": 0
                },
                {
                    "sent": "When I have these kinds of cartoons up, I think I've got two or three minutes left, so let me show you another piece of software or two that illustrates how some of these things might work.",
                    "label": 0
                },
                {
                    "sent": "Let's see for the sake of time.",
                    "label": 0
                },
                {
                    "sent": "I've already set up a situation with a hex grid, and I've laid down some targets in different shapes, and I've laid them down in a kind of a bad way.",
                    "label": 0
                },
                {
                    "sent": "Boy, this projector doesn't show red.",
                    "label": 0
                },
                {
                    "sent": "Those are supposed to be red, red, red, red.",
                    "label": 0
                },
                {
                    "sent": "If I try to compute how many targets there are by integrating with respect to Euler characteristic, I'm going to get the wrong answer.",
                    "label": 0
                },
                {
                    "sent": "Let me show you that I'm going to get the wrong answer.",
                    "label": 0
                },
                {
                    "sent": "And I got the wrong answer.",
                    "label": 0
                },
                {
                    "sent": "The computer program counted seven when there's really only five.",
                    "label": 0
                },
                {
                    "sent": "Why is that?",
                    "label": 0
                },
                {
                    "sent": "Well, look, these two sets overlap right here, but there's hardly anything that registers it.",
                    "label": 0
                },
                {
                    "sent": "These three.",
                    "label": 0
                },
                {
                    "sent": "Ooh, they're really close to being tangent.",
                    "label": 0
                },
                {
                    "sent": "There's all kinds of near tangencies in the way, and the theory can't tell whether they overlap or they don't overlap, so gets it wrong.",
                    "label": 0
                },
                {
                    "sent": "What's one thing that we could do?",
                    "label": 0
                },
                {
                    "sent": "We could set up an integral transform.",
                    "label": 0
                },
                {
                    "sent": "That's really convolution with respect to a nice little bump function that has the effect of taking an average weighted average with respect to your neighbors.",
                    "label": 0
                },
                {
                    "sent": "And if I do that integral transform, then the data gets smoothed out a little bit.",
                    "label": 0
                },
                {
                    "sent": "And if I now pass to the real valued integration theory.",
                    "label": 0
                },
                {
                    "sent": "And compute the integral with respect to Euler characteristic.",
                    "label": 0
                },
                {
                    "sent": "Then I get an expected value that's much closer to the answer and at least tells me that, oh, that value of seven was probably not too low.",
                    "label": 0
                },
                {
                    "sent": "If anything was probably too high.",
                    "label": 0
                },
                {
                    "sent": "That's one thing that's kind of interesting.",
                    "label": 0
                },
                {
                    "sent": "Another thing that.",
                    "label": 0
                },
                {
                    "sent": "Well, this is precarious that can be done.",
                    "label": 0
                },
                {
                    "sent": "Is let's say if I were to choose hexagonal targets.",
                    "label": 0
                },
                {
                    "sent": "Something like this?",
                    "label": 0
                },
                {
                    "sent": "And I lay down a couple of hexagons.",
                    "label": 0
                },
                {
                    "sent": "If I set a transform that is something like a Bessel transform.",
                    "label": 0
                },
                {
                    "sent": "That integrates along.",
                    "label": 0
                },
                {
                    "sent": "Concentric circles, where in this case I'm matching the waveform to the target shape itself.",
                    "label": 0
                },
                {
                    "sent": "I'm integrating along concentric hexagons and then performing that transform at every point.",
                    "label": 0
                },
                {
                    "sent": "That's a lot of communication, but what's going to happen when I have?",
                    "label": 0
                },
                {
                    "sent": "When I have a base point that say over here and integrating with respect to Euler characteristic, it's picking up one along each of these sidelobes and it's telling me something about the width of the target in this direction.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if I were to start right in the middle and start integrating around these loops, then I just get a constant times the Euler characteristic of the circle.",
                    "label": 0
                },
                {
                    "sent": "What's the other characteristic of a circle at 0?",
                    "label": 0
                },
                {
                    "sent": "So the closer I am to the middle of the target, the lower the value that functional gives me, So what?",
                    "label": 0
                },
                {
                    "sent": "Boy, you can't see the red in there at all.",
                    "label": 0
                },
                {
                    "sent": "That's very frustrating.",
                    "label": 0
                },
                {
                    "sent": "So if I switch to looking at the lower excursion sets then you can see that this transformed function.",
                    "label": 0
                },
                {
                    "sent": "Finds where the centers of the targets actually are.",
                    "label": 0
                },
                {
                    "sent": "So with this, not only can we.",
                    "label": 0
                },
                {
                    "sent": "Compute how many targets there are, but we can compute where their centers are.",
                    "label": 0
                },
                {
                    "sent": "If we know something about the shape and match the waveform to it and have some information about how big the target support is, this one has a deep.",
                    "label": 0
                },
                {
                    "sent": "Center and this one has a shallower center and this one even shallower still.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, let me end with a couple of things that I don't know how to do that I wish I could do.",
                    "label": 0
                },
                {
                    "sent": "One is when doing these integral transforms you have the same problem that everyone who does radar systems have has.",
                    "label": 0
                },
                {
                    "sent": "As you perform an integral transform, you get energy loss out of sidelobes.",
                    "label": 1
                },
                {
                    "sent": "Various sorts of issues like that.",
                    "label": 0
                },
                {
                    "sent": "Now the guys who do radar, they have all kinds of tricks for mitigating that kind of energy leakage.",
                    "label": 0
                },
                {
                    "sent": "Doing fancy signal processing stuff, I'd like to be able to just import all of that stuff over this integration theory, but certain things like oh, the integral operator isn't linear all the time.",
                    "label": 0
                },
                {
                    "sent": "Make it challenging.",
                    "label": 0
                },
                {
                    "sent": "Everything I've talked about today is pretty much integer valued data problems having to do with counting.",
                    "label": 0
                },
                {
                    "sent": "What if you wanted to integrate more complicated forms of data?",
                    "label": 0
                },
                {
                    "sent": "What would you do?",
                    "label": 0
                },
                {
                    "sent": "How do you efficiently compute these integral transforms?",
                    "label": 1
                },
                {
                    "sent": "As you could see the computation that I did took a long time.",
                    "label": 1
                },
                {
                    "sent": "Part of that is because it's written in Java, but part of it is just a lot of things to compute.",
                    "label": 0
                },
                {
                    "sent": "And even though these integration theories have been around for 30 years, it's lived in a very pure corner of the mathematics world and no one is really thought about how to affectively do numerical analysis.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is just a small corner of some of the things I work on in.",
                    "label": 0
                },
                {
                    "sent": "Applications of topology.",
                    "label": 0
                },
                {
                    "sent": "A lot of those applications being denied.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works.",
                    "label": 0
                },
                {
                    "sent": "Thanks for your attention.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "Then I actually have a question.",
                    "label": 0
                },
                {
                    "sent": "Appointment just have oil produced a greater than some.",
                    "label": 0
                },
                {
                    "sent": "It's a non 0 right?",
                    "label": 0
                },
                {
                    "sent": "Certainly, but in OK.",
                    "label": 0
                },
                {
                    "sent": "So the question was how do you deal with the fact that in the integer value case a point has mass one in the real value case of point has mass one as well?",
                    "label": 0
                },
                {
                    "sent": "Yes, that's true, but if you.",
                    "label": 0
                },
                {
                    "sent": "Convolve your function and smooth it out.",
                    "label": 0
                },
                {
                    "sent": "Then if you have a, you know a field that reads 2 everywhere and you have a bit of noise and one of your sensors reads 3.",
                    "label": 0
                },
                {
                    "sent": "Then convolving it out is going to drop that value to 2.1 and its contribution to the integral's going to be much less.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Question that says.",
                    "label": 0
                }
            ]
        }
    }
}