{
    "id": "lt5iyk7vkkcee6nksivsml5s4aslfnrt",
    "title": "Applying Semantic Web Technologies to Assess Maintenance Tasks from Operational Interruptions: A Use-Case at Airbus",
    "info": {
        "author": [
            "Ghislain Auguste Atemezing, EURECOM"
        ],
        "published": "July 10, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2017_atemezing_semantic_web_technologies/",
    "segmentation": [
        [
            "Hi everyone, thanks for coming to this talk so I'm just laying out the missing so I'm working based in Paris so I represent you one application so more industrial application of applying semantic technologies to access maintenance tax from professional interruptions.",
            "So the use case here is come from our client Airbus.",
            "When I'm in air versus Airbus in Toulouse in the South of France.",
            "So."
        ],
        [
            "I will try during this talk to 1st give a little bit what we're doing.",
            "At Monday cars more company.",
            "I will talk a bit about this scenario.",
            "The use case here.",
            "What are what are the operational interruptions in the in the domain of AB aircraft domain?",
            "The methodology that we use in order to tackle the problem, the experiments and also I will give some evaluation, but more more business driven 'cause you know experts are not easy to get if you want to compute things like discourse, precision and so on, but I will let you know how we interact with them in order to get this work.",
            "Some lesson learns about the difficulty to explain what is RDF.",
            "Do stuff that you all know and I will finish with a brief conclusion."
        ],
        [
            "So what who are we saw?",
            "Monday cases small company based in Paris.",
            "So which started almost at the same time that the first draft of XML was, was was wreck at WTC, so around 1999.",
            "We're basically 16.",
            "We have two members as manager.",
            "So we small group more agile because of the size of the group we have.",
            "Men Mark Business is is to sell semantic web technologies, so our tools that we call smart contract factories is a combination is a combination tool for managing taxonomy to do auto tagging and to make knowledge discoverable we have made we have clients in men.",
            "Our main clients are based in US and mainly their publisher like the case of National Geography.",
            "Or AP or NPR?"
        ],
        [
            "So if you ask me, why do clients come to us?",
            "Because we are talking about applying semantic web.",
            "I will tell you that 50% of our clients they come because they have meta data problem.",
            "So they are they want to manage their metadata.",
            "So when I mean better determine like back end management, data modeling, terminology stuff, knowledge browsing.",
            "And the rest 25%.",
            "They come for NLP.",
            "So they want to us to help tagging their data in different languages like in the case of natural geography for example that they asked us to do crawler data an attack in 13 languages.",
            "The rest spot 15% they ask for integration activities visualization a little bit, not too much, and construct Tennessee from time to time and project management."
        ],
        [
            "So let us focus now on our use case here, which is the operational interruption scenario at Airbus.",
            "I would love to have someone from Airbus to present this work, but it's always difficult to ask them to come to this type of me.",
            "I hope there are some in this in this room that someday they will come and present this type of work 'cause having their feeling of what is sometimes difficult or to change the paradigm about regarding.",
            "What they used to do and how semantic web can help them to to solve business cases so.",
            "An operational interruption is something that happened, an event that happened during the exploitation of an aircraft.",
            "So basically, they said that when's when something when an event happened.",
            "In an aircraft, if it is possible to fix the that that problem in less in more than 50 minutes so they have to record the operator have to record that and add it as an.",
            "Oh I will call that like that operational interruption.",
            "I know I has two part, so description of the problem.",
            "So in that case Crew info fault of communication between carbon and so on and sometimes even action that should be done.",
            "So for that audio management unit that should be replaced and the other part what is performed by the work by the operation the operator is when he she or he is able to manage the task.",
            "He put a what she has done so this information are sent.",
            "Send by by airlines to Airbus, and Airbus has to has an unit.",
            "I think more more than 300 people in that unit that they are experts on why and they have to see whether those information can be can be can be much with the maintenance planning documentation.",
            "So normally when they sell an aircraft there there is.",
            "It's kind of maintenance.",
            "Periodically, some maintenance that should be done when it up, so they need to see if the neck and airline was able to really use their maintenance tax, or if there are something that they can be used for for improving the maintenance, maintenance planning document.",
            "So we have also this notion of of MPD, so is.",
            "This is kind of what many data in unstructured data in spreadsheets where that contains information about the tax program and the relation with the report and the false.",
            "So the challenge for us was to see how we can match this DC formation with potential.",
            "Maintenance tax that exists for different families of aircraft."
        ],
        [
            "So discussing with the expert they wanted to be sure that in the workflow we do not remove.",
            "Do not try to do something.",
            "If real is a full automatic process, so they wanted to be part of the workflow so to be at the beginning and at the end of the workflow.",
            "So we decided that since they have a manual annotation of of a task according to some description and keywords, so we receive that information and we try to normalize the form data using what we all we know, RDF.",
            "Modeling and so on.",
            "And we also use our content annotation manager in order to extract some keywords in the in the in the different oils and later on we went.",
            "Having those two graph we wanted to do kind of graph matching.",
            "And to see potential match between the task device under tax at the end we send up.",
            "We sent the output to the experts to assess what what they have."
        ],
        [
            "So the methodological flaw is more or less like this, or we gather all the information that the expert can give us.",
            "They were either in what that manual description of tax or either in spreadsheets we had to model all that information in order to verify.",
            "So using the best practices that we all know where eyes and so on we converted all those data into into RDF.",
            "And for the normal keyword normalization, since we received documents were in Word documents which we had to do a manual conversion into into RDF using scores vocabulary.",
            "That we used to enrich the MPD tax graft.",
            "And then later on we.",
            "Annotate the text description of the OS that we received a letter on.",
            "We were able to do our graph matching an send up send back the candidate for assessment.",
            "So basically the the final goal is we have another site.",
            "The graph of the tax with the different elements like so.",
            "The number of the tax, the relation to the aircraft family, the failure, the type of failure that can occur if it is functional, fairly effect, and in the opposite we have the description on offer.",
            "No, I these are text.",
            "And we have other relations.",
            "To the family.",
            "To the.",
            "At the chapter of the aircraft.",
            "So basically what we want to do is to see this to see if there is something this or I is related to.",
            "That the that that programming tax."
        ],
        [
            "So.",
            "Thanks for this work.",
            "Just had to point that they were not.",
            "They didn't know nothing about earlier and so on.",
            "So this work is was also a way of teaching them how this how this hour, how you can make and model their concept and.",
            "Very interesting becausw.",
            "The different discussion we were able to get them understand.",
            "The different context that we used to manage in our in this community, so we tried to have a small light vocabulary just.",
            "Just to represent the main Contacts.",
            "So we didn't want to use all the data that they have in for the maintenance tax.",
            "So what is a program task which is a tax?",
            "What is inside the report?",
            "What are the type of relationship with hardware failures in order to represent them and show them that this information can be valuable?",
            "For that."
        ],
        [
            "And also to model an OIC, we know that's an event.",
            "It was also a location to to show them that it is important to reuse external vocabularies.",
            "So since I'm a vendor of lovr it was away also to show to show them that those resources can be helpful.",
            "A lot of vocabulary can be helpful to describe, to reuse and reuse them and describe the their knowledge.",
            "So sometimes the question that they have is why are we using?",
            "Why do we use that?",
            "That that vocabulary?",
            "Because they are afraid that.",
            "Those namespace can disappear from one day to another because they want to be to be owner of those different namespace.",
            "So from 4 in this case we were able to show them that looking at the statistics and evolution of the event vocabulary, it seems to be something sustainable and many other projects were using that.",
            "So that was kind of.",
            "Answers that we're able to tell them.",
            "In the steps of of modeling."
        ],
        [
            "So how about the description that we receive in Word document?",
            "So there were there were keywords, so we had to.",
            "Do use the scores for that becausw.",
            "We use that to generate our our list of terms that we use for the annotation for the NLP part annotation.",
            "So we had kind of rules in order to do.",
            "So my hypothesis for hypothesis to reduce the little bit the works such as we didn't consider like things like ordinal ordinal numbers or when they were keywords.",
            "So we had to have this went.",
            "This one set of keywords between the work performed under the description and the action performed, and also that generally they were short concepts and we had since scores is able force two with the property at level we were able to add synonyms or words that can be more or less used the same.",
            "So in the case of this work we were using the a treat, treat, treat zero family of aircraft.",
            "And with the document that we receive able to have this number of.",
            "130 schools concept that we extracted from from that from that data.",
            "Of course we think that for future for the maintenance of this is better that for the next step we provide them with kind of templates to really help in this type of of of transformation."
        ],
        [
            "So these are, these elements are used to.",
            "To enrich the MPG graph.",
            "By using different properties for that property for the description, the actions the war at Amanda Word action.",
            "So basically here we have an English portion of a program tax with discourse concept that we added from hours classification work.",
            "So now let."
        ],
        [
            "See how we are noted Doi so since there are.",
            "Since there are part of text there text, basically we have our content and rotator internal tool that disable is based on get on top of gate that is able to.",
            "Do you annotate text so we after we receive this discourse concept, we can?",
            "Create our gazetteers.",
            "We run.",
            "We perform the the annotation based on a workflow that you did that we previously we set that previously.",
            "The workflow the output is.",
            "RDF is an RDF that we use.",
            "Two are two.",
            "That that that we used also to enrich the digraph thanks to the dust notion of unique query."
        ],
        [
            "And you say this is a sample of what we are able to do, so an example of of Ohio and the output.",
            "Is this type of knowledge we have recently labels and this is type of configuration that you are able the plugins that we use inside our rotator in order to resolve ambiguities to resolve semantic context and so on.",
            "So this type of configuration the user can do use that for for the annotation."
        ],
        [
            "So regarding the experiments for this work, since we we didn't have like billions of information we use, we were focused on this family of a 330.",
            "So we run the annotation on a normal normal.",
            "Machine.",
            "Where actually we had, we were able so the number for I was more than 20 almost 21 K. So we were able to detect, almost with the small number of concepts received from the from the expert, were able to.",
            "To reach around 82 tabs that were actually detected.",
            "An almost 11 K where we had at least two tax.",
            "This is important because we use that for our for our.",
            "For our graph matching purpose.",
            "And normally it runs in less than less than two hours."
        ],
        [
            "So then when that now that we have one side the wise and rich?",
            "With the taxes that are detected from the our content and rotator an adult and on the other hand we have our enriched task.",
            "We can also now try to to find that which OS can be recommended or can be accessed.",
            "So basically we try to.",
            "This algorithm, so one of the first thing is to see if we should be relaxed enough so we can take.",
            "We take an input the set of attacks.",
            "With their with their 111 MPD and associated tax and also we have the set of eyes.",
            "So what we try to do with those two sets description or perform you want to see whether we can have.",
            "If possible, relationship.",
            "So one of the assumption was that we wanted at each time to have at least annoyed, annoyed with at least one item in the description.",
            "And one item in the in the work performed.",
            "So this is just the list of things that we do behind there are it's set.",
            "Those are set of sparkle queries that are running behind and."
        ],
        [
            "And I will.",
            "So the more the more important thing is what should be returned to the return.",
            "It is the list of those wise.",
            "So we left that part.",
            "I will just show."
        ],
        [
            "So a little bit small running example, so we receive like for the tax.",
            "MPD, the input where emerging elsea relais and for the Dex action we have an ability Ferrandino.",
            "On the other hand, for the work performed, those were the two sets, so we tried to apply.",
            "This just to show them that.",
            "OK, how the algorithm worked and to see the result of that.",
            "What was important for them was to our set to be able to have a higher recall and precision was not so important, so they used to have to assess many many information.",
            "So with this first algorithm we were able to."
        ],
        [
            "For this example to have like a list of.",
            "A list of.",
            "For the first 905 hundred, for the second text, and so could also 900.",
            "So for them when we discuss with them, we ask them that that was higher.",
            "They say, OK, it's high, but for them what is important is not to lose some some relevant over, but we discussed also to see if you were able to see another more restrict option where we had the intersection of the of the set.",
            "And when do we do that?"
        ],
        [
            "We reduce.",
            "We reduce.",
            "Sometimes by 2020 the number of of of the.",
            "Of the possible candidate and they looked at the results.",
            "And finally what they said is that OK, actually you were not.",
            "We were able to find something that for them was not generally what they use is actually.",
            "There are formula Excel formulas that special formula used in order to compute that.",
            "So for the result I think they were happy 'cause we were able to solve part of the problem.",
            "And the.",
            "Unfortunately, we were not able.",
            "We asked them if it was able to.",
            "We were able to have like kind of more rigorous validation to compute those precision and so on, but when in terms of business when they said."
        ],
        [
            "What we did was OK for them.",
            "OK, we think that for the next, the next command that they ask us it was for us a kind of saying that you did a good job, but we want to go further and have more more more scientific evaluations of these.",
            "So some lesson learned is that at first semantics is not opening at all be cause for them when doing the what they have in their own silo.",
            "It was good enough, but we were able to show them that by.",
            "Having this.",
            "Integrating these data among different organization, they were, they were more benefits than just having those formula in Excel.",
            "It's clear that sometimes they were afraid some of them were afraid to lose their job because if we put everything I were able to have something that, well, we give everything that we had, that some of ethical problem issue for that.",
            "So these are the kind of things that we understood and we think that in this kind of work workflow is important to always keep.",
            "Did you always keep the the experts in the in the loop or so?",
            "This issue of policy, right policy management that they think is really important now that they will have many data set transform into area.",
            "So for evaluation."
        ],
        [
            "Don't.",
            "It was it is more business related.",
            "We we think we try to solve we solve a real business problem here and in terms of business problem that means I mean that we receive a new command to continue working on this big cause a terribles.",
            "There are many steps in order to have something production.",
            "So we were at level 4.",
            "So everything for dinner at 5:00 and the lost levels level 6 in order to go to production so well will continue.",
            "We hope continue working on that and.",
            "And as James, unless it a little semantics goes along ways, so to conclude."
        ],
        [
            "Always have been ducks impact in Airbus expectation.",
            "Both companies and Airbus Angie semantic based solution can easily detect and help expert in the domain to easily find the matches between between the horizon, the datasets so the results highlight that we can have decision-making based on structured data in in earlier so you plan to improve the automatic generation of those keywords and also to add and are working on adding.",
            "Rezoning on validation layer.",
            "Because there are many information inside those places that can be used.",
            "Thanks for listening and any question, I would appreciate it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hi everyone, thanks for coming to this talk so I'm just laying out the missing so I'm working based in Paris so I represent you one application so more industrial application of applying semantic technologies to access maintenance tax from professional interruptions.",
                    "label": 1
                },
                {
                    "sent": "So the use case here is come from our client Airbus.",
                    "label": 0
                },
                {
                    "sent": "When I'm in air versus Airbus in Toulouse in the South of France.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will try during this talk to 1st give a little bit what we're doing.",
                    "label": 0
                },
                {
                    "sent": "At Monday cars more company.",
                    "label": 0
                },
                {
                    "sent": "I will talk a bit about this scenario.",
                    "label": 0
                },
                {
                    "sent": "The use case here.",
                    "label": 0
                },
                {
                    "sent": "What are what are the operational interruptions in the in the domain of AB aircraft domain?",
                    "label": 0
                },
                {
                    "sent": "The methodology that we use in order to tackle the problem, the experiments and also I will give some evaluation, but more more business driven 'cause you know experts are not easy to get if you want to compute things like discourse, precision and so on, but I will let you know how we interact with them in order to get this work.",
                    "label": 0
                },
                {
                    "sent": "Some lesson learns about the difficulty to explain what is RDF.",
                    "label": 0
                },
                {
                    "sent": "Do stuff that you all know and I will finish with a brief conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what who are we saw?",
                    "label": 0
                },
                {
                    "sent": "Monday cases small company based in Paris.",
                    "label": 1
                },
                {
                    "sent": "So which started almost at the same time that the first draft of XML was, was was wreck at WTC, so around 1999.",
                    "label": 0
                },
                {
                    "sent": "We're basically 16.",
                    "label": 0
                },
                {
                    "sent": "We have two members as manager.",
                    "label": 0
                },
                {
                    "sent": "So we small group more agile because of the size of the group we have.",
                    "label": 0
                },
                {
                    "sent": "Men Mark Business is is to sell semantic web technologies, so our tools that we call smart contract factories is a combination is a combination tool for managing taxonomy to do auto tagging and to make knowledge discoverable we have made we have clients in men.",
                    "label": 0
                },
                {
                    "sent": "Our main clients are based in US and mainly their publisher like the case of National Geography.",
                    "label": 0
                },
                {
                    "sent": "Or AP or NPR?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if you ask me, why do clients come to us?",
                    "label": 1
                },
                {
                    "sent": "Because we are talking about applying semantic web.",
                    "label": 0
                },
                {
                    "sent": "I will tell you that 50% of our clients they come because they have meta data problem.",
                    "label": 0
                },
                {
                    "sent": "So they are they want to manage their metadata.",
                    "label": 0
                },
                {
                    "sent": "So when I mean better determine like back end management, data modeling, terminology stuff, knowledge browsing.",
                    "label": 0
                },
                {
                    "sent": "And the rest 25%.",
                    "label": 0
                },
                {
                    "sent": "They come for NLP.",
                    "label": 0
                },
                {
                    "sent": "So they want to us to help tagging their data in different languages like in the case of natural geography for example that they asked us to do crawler data an attack in 13 languages.",
                    "label": 0
                },
                {
                    "sent": "The rest spot 15% they ask for integration activities visualization a little bit, not too much, and construct Tennessee from time to time and project management.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let us focus now on our use case here, which is the operational interruption scenario at Airbus.",
                    "label": 0
                },
                {
                    "sent": "I would love to have someone from Airbus to present this work, but it's always difficult to ask them to come to this type of me.",
                    "label": 0
                },
                {
                    "sent": "I hope there are some in this in this room that someday they will come and present this type of work 'cause having their feeling of what is sometimes difficult or to change the paradigm about regarding.",
                    "label": 0
                },
                {
                    "sent": "What they used to do and how semantic web can help them to to solve business cases so.",
                    "label": 0
                },
                {
                    "sent": "An operational interruption is something that happened, an event that happened during the exploitation of an aircraft.",
                    "label": 1
                },
                {
                    "sent": "So basically, they said that when's when something when an event happened.",
                    "label": 1
                },
                {
                    "sent": "In an aircraft, if it is possible to fix the that that problem in less in more than 50 minutes so they have to record the operator have to record that and add it as an.",
                    "label": 0
                },
                {
                    "sent": "Oh I will call that like that operational interruption.",
                    "label": 0
                },
                {
                    "sent": "I know I has two part, so description of the problem.",
                    "label": 1
                },
                {
                    "sent": "So in that case Crew info fault of communication between carbon and so on and sometimes even action that should be done.",
                    "label": 0
                },
                {
                    "sent": "So for that audio management unit that should be replaced and the other part what is performed by the work by the operation the operator is when he she or he is able to manage the task.",
                    "label": 0
                },
                {
                    "sent": "He put a what she has done so this information are sent.",
                    "label": 0
                },
                {
                    "sent": "Send by by airlines to Airbus, and Airbus has to has an unit.",
                    "label": 0
                },
                {
                    "sent": "I think more more than 300 people in that unit that they are experts on why and they have to see whether those information can be can be can be much with the maintenance planning documentation.",
                    "label": 0
                },
                {
                    "sent": "So normally when they sell an aircraft there there is.",
                    "label": 0
                },
                {
                    "sent": "It's kind of maintenance.",
                    "label": 0
                },
                {
                    "sent": "Periodically, some maintenance that should be done when it up, so they need to see if the neck and airline was able to really use their maintenance tax, or if there are something that they can be used for for improving the maintenance, maintenance planning document.",
                    "label": 0
                },
                {
                    "sent": "So we have also this notion of of MPD, so is.",
                    "label": 0
                },
                {
                    "sent": "This is kind of what many data in unstructured data in spreadsheets where that contains information about the tax program and the relation with the report and the false.",
                    "label": 0
                },
                {
                    "sent": "So the challenge for us was to see how we can match this DC formation with potential.",
                    "label": 0
                },
                {
                    "sent": "Maintenance tax that exists for different families of aircraft.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So discussing with the expert they wanted to be sure that in the workflow we do not remove.",
                    "label": 0
                },
                {
                    "sent": "Do not try to do something.",
                    "label": 0
                },
                {
                    "sent": "If real is a full automatic process, so they wanted to be part of the workflow so to be at the beginning and at the end of the workflow.",
                    "label": 0
                },
                {
                    "sent": "So we decided that since they have a manual annotation of of a task according to some description and keywords, so we receive that information and we try to normalize the form data using what we all we know, RDF.",
                    "label": 0
                },
                {
                    "sent": "Modeling and so on.",
                    "label": 0
                },
                {
                    "sent": "And we also use our content annotation manager in order to extract some keywords in the in the in the different oils and later on we went.",
                    "label": 0
                },
                {
                    "sent": "Having those two graph we wanted to do kind of graph matching.",
                    "label": 0
                },
                {
                    "sent": "And to see potential match between the task device under tax at the end we send up.",
                    "label": 0
                },
                {
                    "sent": "We sent the output to the experts to assess what what they have.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the methodological flaw is more or less like this, or we gather all the information that the expert can give us.",
                    "label": 0
                },
                {
                    "sent": "They were either in what that manual description of tax or either in spreadsheets we had to model all that information in order to verify.",
                    "label": 0
                },
                {
                    "sent": "So using the best practices that we all know where eyes and so on we converted all those data into into RDF.",
                    "label": 0
                },
                {
                    "sent": "And for the normal keyword normalization, since we received documents were in Word documents which we had to do a manual conversion into into RDF using scores vocabulary.",
                    "label": 0
                },
                {
                    "sent": "That we used to enrich the MPD tax graft.",
                    "label": 0
                },
                {
                    "sent": "And then later on we.",
                    "label": 0
                },
                {
                    "sent": "Annotate the text description of the OS that we received a letter on.",
                    "label": 0
                },
                {
                    "sent": "We were able to do our graph matching an send up send back the candidate for assessment.",
                    "label": 0
                },
                {
                    "sent": "So basically the the final goal is we have another site.",
                    "label": 0
                },
                {
                    "sent": "The graph of the tax with the different elements like so.",
                    "label": 0
                },
                {
                    "sent": "The number of the tax, the relation to the aircraft family, the failure, the type of failure that can occur if it is functional, fairly effect, and in the opposite we have the description on offer.",
                    "label": 0
                },
                {
                    "sent": "No, I these are text.",
                    "label": 0
                },
                {
                    "sent": "And we have other relations.",
                    "label": 0
                },
                {
                    "sent": "To the family.",
                    "label": 0
                },
                {
                    "sent": "To the.",
                    "label": 0
                },
                {
                    "sent": "At the chapter of the aircraft.",
                    "label": 0
                },
                {
                    "sent": "So basically what we want to do is to see this to see if there is something this or I is related to.",
                    "label": 0
                },
                {
                    "sent": "That the that that programming tax.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Thanks for this work.",
                    "label": 0
                },
                {
                    "sent": "Just had to point that they were not.",
                    "label": 0
                },
                {
                    "sent": "They didn't know nothing about earlier and so on.",
                    "label": 0
                },
                {
                    "sent": "So this work is was also a way of teaching them how this how this hour, how you can make and model their concept and.",
                    "label": 0
                },
                {
                    "sent": "Very interesting becausw.",
                    "label": 0
                },
                {
                    "sent": "The different discussion we were able to get them understand.",
                    "label": 0
                },
                {
                    "sent": "The different context that we used to manage in our in this community, so we tried to have a small light vocabulary just.",
                    "label": 0
                },
                {
                    "sent": "Just to represent the main Contacts.",
                    "label": 0
                },
                {
                    "sent": "So we didn't want to use all the data that they have in for the maintenance tax.",
                    "label": 0
                },
                {
                    "sent": "So what is a program task which is a tax?",
                    "label": 0
                },
                {
                    "sent": "What is inside the report?",
                    "label": 0
                },
                {
                    "sent": "What are the type of relationship with hardware failures in order to represent them and show them that this information can be valuable?",
                    "label": 0
                },
                {
                    "sent": "For that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also to model an OIC, we know that's an event.",
                    "label": 0
                },
                {
                    "sent": "It was also a location to to show them that it is important to reuse external vocabularies.",
                    "label": 0
                },
                {
                    "sent": "So since I'm a vendor of lovr it was away also to show to show them that those resources can be helpful.",
                    "label": 0
                },
                {
                    "sent": "A lot of vocabulary can be helpful to describe, to reuse and reuse them and describe the their knowledge.",
                    "label": 0
                },
                {
                    "sent": "So sometimes the question that they have is why are we using?",
                    "label": 0
                },
                {
                    "sent": "Why do we use that?",
                    "label": 0
                },
                {
                    "sent": "That that vocabulary?",
                    "label": 0
                },
                {
                    "sent": "Because they are afraid that.",
                    "label": 0
                },
                {
                    "sent": "Those namespace can disappear from one day to another because they want to be to be owner of those different namespace.",
                    "label": 0
                },
                {
                    "sent": "So from 4 in this case we were able to show them that looking at the statistics and evolution of the event vocabulary, it seems to be something sustainable and many other projects were using that.",
                    "label": 0
                },
                {
                    "sent": "So that was kind of.",
                    "label": 0
                },
                {
                    "sent": "Answers that we're able to tell them.",
                    "label": 0
                },
                {
                    "sent": "In the steps of of modeling.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how about the description that we receive in Word document?",
                    "label": 0
                },
                {
                    "sent": "So there were there were keywords, so we had to.",
                    "label": 0
                },
                {
                    "sent": "Do use the scores for that becausw.",
                    "label": 0
                },
                {
                    "sent": "We use that to generate our our list of terms that we use for the annotation for the NLP part annotation.",
                    "label": 0
                },
                {
                    "sent": "So we had kind of rules in order to do.",
                    "label": 0
                },
                {
                    "sent": "So my hypothesis for hypothesis to reduce the little bit the works such as we didn't consider like things like ordinal ordinal numbers or when they were keywords.",
                    "label": 1
                },
                {
                    "sent": "So we had to have this went.",
                    "label": 0
                },
                {
                    "sent": "This one set of keywords between the work performed under the description and the action performed, and also that generally they were short concepts and we had since scores is able force two with the property at level we were able to add synonyms or words that can be more or less used the same.",
                    "label": 1
                },
                {
                    "sent": "So in the case of this work we were using the a treat, treat, treat zero family of aircraft.",
                    "label": 0
                },
                {
                    "sent": "And with the document that we receive able to have this number of.",
                    "label": 0
                },
                {
                    "sent": "130 schools concept that we extracted from from that from that data.",
                    "label": 0
                },
                {
                    "sent": "Of course we think that for future for the maintenance of this is better that for the next step we provide them with kind of templates to really help in this type of of of transformation.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these are, these elements are used to.",
                    "label": 1
                },
                {
                    "sent": "To enrich the MPG graph.",
                    "label": 0
                },
                {
                    "sent": "By using different properties for that property for the description, the actions the war at Amanda Word action.",
                    "label": 0
                },
                {
                    "sent": "So basically here we have an English portion of a program tax with discourse concept that we added from hours classification work.",
                    "label": 0
                },
                {
                    "sent": "So now let.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See how we are noted Doi so since there are.",
                    "label": 0
                },
                {
                    "sent": "Since there are part of text there text, basically we have our content and rotator internal tool that disable is based on get on top of gate that is able to.",
                    "label": 0
                },
                {
                    "sent": "Do you annotate text so we after we receive this discourse concept, we can?",
                    "label": 0
                },
                {
                    "sent": "Create our gazetteers.",
                    "label": 0
                },
                {
                    "sent": "We run.",
                    "label": 0
                },
                {
                    "sent": "We perform the the annotation based on a workflow that you did that we previously we set that previously.",
                    "label": 0
                },
                {
                    "sent": "The workflow the output is.",
                    "label": 0
                },
                {
                    "sent": "RDF is an RDF that we use.",
                    "label": 0
                },
                {
                    "sent": "Two are two.",
                    "label": 0
                },
                {
                    "sent": "That that that we used also to enrich the digraph thanks to the dust notion of unique query.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you say this is a sample of what we are able to do, so an example of of Ohio and the output.",
                    "label": 0
                },
                {
                    "sent": "Is this type of knowledge we have recently labels and this is type of configuration that you are able the plugins that we use inside our rotator in order to resolve ambiguities to resolve semantic context and so on.",
                    "label": 0
                },
                {
                    "sent": "So this type of configuration the user can do use that for for the annotation.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So regarding the experiments for this work, since we we didn't have like billions of information we use, we were focused on this family of a 330.",
                    "label": 0
                },
                {
                    "sent": "So we run the annotation on a normal normal.",
                    "label": 0
                },
                {
                    "sent": "Machine.",
                    "label": 0
                },
                {
                    "sent": "Where actually we had, we were able so the number for I was more than 20 almost 21 K. So we were able to detect, almost with the small number of concepts received from the from the expert, were able to.",
                    "label": 0
                },
                {
                    "sent": "To reach around 82 tabs that were actually detected.",
                    "label": 0
                },
                {
                    "sent": "An almost 11 K where we had at least two tax.",
                    "label": 0
                },
                {
                    "sent": "This is important because we use that for our for our.",
                    "label": 0
                },
                {
                    "sent": "For our graph matching purpose.",
                    "label": 0
                },
                {
                    "sent": "And normally it runs in less than less than two hours.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then when that now that we have one side the wise and rich?",
                    "label": 0
                },
                {
                    "sent": "With the taxes that are detected from the our content and rotator an adult and on the other hand we have our enriched task.",
                    "label": 0
                },
                {
                    "sent": "We can also now try to to find that which OS can be recommended or can be accessed.",
                    "label": 0
                },
                {
                    "sent": "So basically we try to.",
                    "label": 0
                },
                {
                    "sent": "This algorithm, so one of the first thing is to see if we should be relaxed enough so we can take.",
                    "label": 0
                },
                {
                    "sent": "We take an input the set of attacks.",
                    "label": 0
                },
                {
                    "sent": "With their with their 111 MPD and associated tax and also we have the set of eyes.",
                    "label": 0
                },
                {
                    "sent": "So what we try to do with those two sets description or perform you want to see whether we can have.",
                    "label": 0
                },
                {
                    "sent": "If possible, relationship.",
                    "label": 0
                },
                {
                    "sent": "So one of the assumption was that we wanted at each time to have at least annoyed, annoyed with at least one item in the description.",
                    "label": 0
                },
                {
                    "sent": "And one item in the in the work performed.",
                    "label": 0
                },
                {
                    "sent": "So this is just the list of things that we do behind there are it's set.",
                    "label": 0
                },
                {
                    "sent": "Those are set of sparkle queries that are running behind and.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I will.",
                    "label": 0
                },
                {
                    "sent": "So the more the more important thing is what should be returned to the return.",
                    "label": 0
                },
                {
                    "sent": "It is the list of those wise.",
                    "label": 0
                },
                {
                    "sent": "So we left that part.",
                    "label": 0
                },
                {
                    "sent": "I will just show.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So a little bit small running example, so we receive like for the tax.",
                    "label": 0
                },
                {
                    "sent": "MPD, the input where emerging elsea relais and for the Dex action we have an ability Ferrandino.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, for the work performed, those were the two sets, so we tried to apply.",
                    "label": 0
                },
                {
                    "sent": "This just to show them that.",
                    "label": 0
                },
                {
                    "sent": "OK, how the algorithm worked and to see the result of that.",
                    "label": 0
                },
                {
                    "sent": "What was important for them was to our set to be able to have a higher recall and precision was not so important, so they used to have to assess many many information.",
                    "label": 0
                },
                {
                    "sent": "So with this first algorithm we were able to.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For this example to have like a list of.",
                    "label": 0
                },
                {
                    "sent": "A list of.",
                    "label": 0
                },
                {
                    "sent": "For the first 905 hundred, for the second text, and so could also 900.",
                    "label": 0
                },
                {
                    "sent": "So for them when we discuss with them, we ask them that that was higher.",
                    "label": 0
                },
                {
                    "sent": "They say, OK, it's high, but for them what is important is not to lose some some relevant over, but we discussed also to see if you were able to see another more restrict option where we had the intersection of the of the set.",
                    "label": 0
                },
                {
                    "sent": "And when do we do that?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We reduce.",
                    "label": 0
                },
                {
                    "sent": "We reduce.",
                    "label": 0
                },
                {
                    "sent": "Sometimes by 2020 the number of of of the.",
                    "label": 0
                },
                {
                    "sent": "Of the possible candidate and they looked at the results.",
                    "label": 0
                },
                {
                    "sent": "And finally what they said is that OK, actually you were not.",
                    "label": 0
                },
                {
                    "sent": "We were able to find something that for them was not generally what they use is actually.",
                    "label": 0
                },
                {
                    "sent": "There are formula Excel formulas that special formula used in order to compute that.",
                    "label": 0
                },
                {
                    "sent": "So for the result I think they were happy 'cause we were able to solve part of the problem.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, we were not able.",
                    "label": 0
                },
                {
                    "sent": "We asked them if it was able to.",
                    "label": 0
                },
                {
                    "sent": "We were able to have like kind of more rigorous validation to compute those precision and so on, but when in terms of business when they said.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we did was OK for them.",
                    "label": 0
                },
                {
                    "sent": "OK, we think that for the next, the next command that they ask us it was for us a kind of saying that you did a good job, but we want to go further and have more more more scientific evaluations of these.",
                    "label": 0
                },
                {
                    "sent": "So some lesson learned is that at first semantics is not opening at all be cause for them when doing the what they have in their own silo.",
                    "label": 0
                },
                {
                    "sent": "It was good enough, but we were able to show them that by.",
                    "label": 0
                },
                {
                    "sent": "Having this.",
                    "label": 0
                },
                {
                    "sent": "Integrating these data among different organization, they were, they were more benefits than just having those formula in Excel.",
                    "label": 0
                },
                {
                    "sent": "It's clear that sometimes they were afraid some of them were afraid to lose their job because if we put everything I were able to have something that, well, we give everything that we had, that some of ethical problem issue for that.",
                    "label": 0
                },
                {
                    "sent": "So these are the kind of things that we understood and we think that in this kind of work workflow is important to always keep.",
                    "label": 0
                },
                {
                    "sent": "Did you always keep the the experts in the in the loop or so?",
                    "label": 0
                },
                {
                    "sent": "This issue of policy, right policy management that they think is really important now that they will have many data set transform into area.",
                    "label": 0
                },
                {
                    "sent": "So for evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Don't.",
                    "label": 0
                },
                {
                    "sent": "It was it is more business related.",
                    "label": 0
                },
                {
                    "sent": "We we think we try to solve we solve a real business problem here and in terms of business problem that means I mean that we receive a new command to continue working on this big cause a terribles.",
                    "label": 1
                },
                {
                    "sent": "There are many steps in order to have something production.",
                    "label": 0
                },
                {
                    "sent": "So we were at level 4.",
                    "label": 0
                },
                {
                    "sent": "So everything for dinner at 5:00 and the lost levels level 6 in order to go to production so well will continue.",
                    "label": 0
                },
                {
                    "sent": "We hope continue working on that and.",
                    "label": 1
                },
                {
                    "sent": "And as James, unless it a little semantics goes along ways, so to conclude.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Always have been ducks impact in Airbus expectation.",
                    "label": 0
                },
                {
                    "sent": "Both companies and Airbus Angie semantic based solution can easily detect and help expert in the domain to easily find the matches between between the horizon, the datasets so the results highlight that we can have decision-making based on structured data in in earlier so you plan to improve the automatic generation of those keywords and also to add and are working on adding.",
                    "label": 1
                },
                {
                    "sent": "Rezoning on validation layer.",
                    "label": 0
                },
                {
                    "sent": "Because there are many information inside those places that can be used.",
                    "label": 0
                },
                {
                    "sent": "Thanks for listening and any question, I would appreciate it.",
                    "label": 0
                }
            ]
        }
    }
}