{
    "id": "ltusssxqjxlrypzmmywqiiclwve3mmfl",
    "title": "Historical newspaper corpora for the Deutsches Textarchiv. Ways of their curation, harmonization, and provision to the community",
    "info": {
        "author": [
            "Susanne Haaf, Berlin-Brandenburg Academy of Sciences and Humanities"
        ],
        "published": "Aug. 21, 2017",
        "recorded": "September 2016",
        "category": [
            "Top->Humanities->Languages",
            "Top->Computers->Digital Media",
            "Top->Social Sciences->Journalism"
        ]
    },
    "url": "http://videolectures.net/clarinplusworkshop2016_haaf_newspaper_corpora/",
    "segmentation": [
        [
            "Yeah."
        ],
        [
            "Thank you very much for inviting us.",
            "I'm the speaker, but I'm representing our whole team at the Berlin Runbook Academy of Sciences and I want to talk about our.",
            "Efforts to get historical newspaper corpora for the Dodgers text.",
            "I have project which we work at.",
            "I will tell you what that is in a minute and about our ways, how we manage curation, harmonization of resources, and how we provide them to the Community."
        ],
        [
            "So I give you a short introduction about our project.",
            "As I said, it's."
        ],
        [
            "Cards, Dodgers, text, ice, even English German text Archive and our goal is to create a corpus of historical German texts dating back to the 17th to 19th century to enable the studies about the development of the new High German language and.",
            "Currently we have gathered about 3000 works.",
            "Which were all manually transcribed the DTA call corpus is actually about 2000 works, and then there are a lot of works we gathered through curation.",
            "They were manually transcribed and also annotated using the TI annotation text set and special form, and we developed for that and transcription was well performed in the Double King without working method.",
            "So we try to get really high text quality and I hope we achieve that."
        ],
        [
            "Two then the automatic linguistic annotation steps like tokenization, lemmatization, part of speech tagging, and author graphic normalization, which means we are normalizing the historical spelling variants so that you can research the corpus with the modern spelling and get all the historical forms.",
            "And yeah, you can access the text through our platform.",
            "You can perform quite elaborate corpus queries there using our query language, but it's also possible to download other resources to do your own research.",
            "It's all CC licenses, and as Martin already said, we are a partner in Claren.",
            "Academy of Sciences in Berlin is a centerpiece for Claren, and so we're providing all our resources through the claron infrastructure as well."
        ],
        [
            "Yeah, as I shortly mentioned we have TI format which we produced based on our historical texts which should.",
            "Enable unambiguous annotation of texts so we.",
            "Took a subset of the T attack set to ensure that our texts are interoperable and every text which goes into our corpora will be annotated according to our guidelines so that all the texts will be harmonized with one another."
        ],
        [
            "Then there is a quality assurance platform as we call it GTA Q where all the texts lend at first, then they are.",
            "Some quality assurance steps before they are actually released on our platform, but you can also access all the texts in DTA Q.",
            "We like to have it as a collaborative platform where the community can contribute.",
            "Can also correct texts, report errors and add commands to the text.",
            "They are already downloadable via date, EDTA, Q as well."
        ],
        [
            "The background project a bit for our German tax archive is the so called WDS, the digital Dictionary of the German language.",
            "This is actually the long-term project of the Academy of Sciences, and we are associated to this project as a project funded by the German Research Foundation.",
            "And the DW DS.",
            "So is creating an accomplice based dictionary for the.",
            "Synchronic High German language.",
            "Recent German language and the German Tax Archive is providing a historical fundament for this.",
            "Project.",
            "So there are newspaper corpora within the DWSD WDS corpora as well, but these are.",
            "Modern newspapers, as you can see, the weekly newspaper did site or Berlin newspapers the target Pingel and Berlin.",
            "Building a title Berlin newspaper."
        ],
        [
            "OK, so the problem I want to talk about right now is the following.",
            "The DTA core Corpus was created based on a fixed bibliography and this bibliography contained very different text types from scientific texts.",
            "Function attacks to fiction, but it didn't contain any periodic code, so we didn't have journals or newspapers in our original bibliography.",
            "We are trying to gather a corpus of this very important text type.",
            "Obviously for the development of the language by."
        ],
        [
            "Curating resources and the curation part is actually a very important part of the claron activities.",
            "So within Claren, we actually have the opportunity to be in contact with partners and together newspaper corpora through external projects.",
            "Actually, who collaborate with us?",
            "This is a graphic about, well, maybe the workflow we are.",
            "Performing here so text get into the story.",
            "DTA in very different formats and we convert them into our DTA based format, which is TI XML.",
            "Then they land into our quality assurance platform.",
            "They go through quality assurance steps, metadata source, images, everything is added, and then we publish them.",
            "On our platform and also within clarity as I said.",
            "So every."
        ],
        [
            "Barry wins the DTA gathers knew newspapers for the corpus.",
            "The projects who could collaborate with us have a platform where they can publish their texts where they have quality assurance, can work further on their texts, connect their resources with other corpora, and have a repository.",
            "And the community will have the possibility to access harmonized texts and collections in one format via the DTA.",
            "Have access to scattered resources which are now interoperable.",
            "Compare corpora and so on."
        ],
        [
            "So now I'd like to present you which corpora of newspapers we currently have, and as you will see."
        ],
        [
            "There are lots lots more smaller than the European newspaper corpora.",
            "This is of course due to our approach that everything has to be transcribed manually and there's a lot of.",
            "Manual effort in that, so one collection is the Manheim Corpus of historical newspapers.",
            "Here we collaborate with the Institute of the German language in Manheim, the Manheim Corpus of historical newspaper.",
            "Sets two parts.",
            "One is already digitized and is currently provided via the DTA.",
            "The other one.",
            "Has to be digitized, which is done.",
            "According to the DTA workflow already, which is really nice.",
            "Then there's the so-called Hamburger Correspondent newspaper from Hamburg, which has been digitized in the crossover project at the University of Paderborn."
        ],
        [
            "The GNU Gnu Renunion newspaper, now your liner, should side tongue digitized at the Academy of Sciences in Berlin in the Cross of the critical edition of the complete split works of Karl Marx and Friedrich Engels.",
            "So it's a newspaper provided by them.",
            "And then there are other newspaper collections which are actually smaller than that.",
            "From, uh, the?"
        ],
        [
            "Sources, so here's a small overview about what is actually provided right now, and what are the processing steps we actually have to do in our project to publish the newspapers.",
            "As you can see, some of the newspapers came in the two step format had to be.",
            "Converted to the DTI based format.",
            "Then we actually apply article text types of possible so we.",
            "Make the difference between political news, financial news, financial stuff like that.",
            "It's not done for all of the newspapers, but for a significant amount of them, and especially for those which are now digitized from scratch according to the DTA workflow.",
            "So these kinds of projects really help for the whole workflow if we actually have a say in the matter from the beginning on, of course.",
            "Um?",
            "Yeah, and as you can see."
        ],
        [
            "It's newspapers from very different times here.",
            "There's actually the timeline for that, and as you can see, it's an opportunistic collection.",
            "It's not balanced at all, so we are taking newspapers which are of good quality from external projects, no matter during which time or in what place they have appeared.",
            "Then when we have gathered newspaper corpus, then we can say, well, let's.",
            "Create a sub corpus which is balanced, but right now we just have to try to build up a corpus for that and also we want to contribute to the Community that they can actually publish their resources by other DTA platform.",
            "So as you can see the 1840s are really well represented.",
            "This is especially due to the higher ridership site and which has only was only appearing during two years actually.",
            "During the German Revolution so.",
            "We've got a lot of newspapers there too, and then you can see down here.",
            "These are all newspaper issues, but some of them are only from one newspaper, others are from diverse newspapers.",
            "This is.",
            "Actually I.",
            "An important point.",
            "Here too."
        ],
        [
            "Yeah access we try to provide access for the newspapers overtime through our platform.",
            "As I said, so some of the newspapers are already online.",
            "The Hamburg newspaper is completely online via the DTA platform.",
            "Some of them are still in DTA Q4.",
            "Kualiti steps to be performed and others are in preparation and will be released by our platform, most of them by the end of this year.",
            "Of course, the Mannheim Corpus of historical newspapers Two is currently digitized and might take a little bit longer."
        ],
        [
            "And then we've got a couple of journals to which have been added to the DTA.",
            "One is the purely technical Journal of Dingler Technical Journal, which appeared during the 19th century at most, and which has been digitized by a project at the Humboldt University in Berlin, and it's accessible within the GTA for corpus queries because it's.",
            "A very large partner or."
        ],
        [
            "Collection right now and another one, and this is the only collection we've got which was originally transcribed using OCR.",
            "And that's the Grand Spuiten Journal of Cultural and political Journal from the 19th century as well.",
            "Here the partner was the University Library of Bremen.",
            "And as I said, they will see our steps for text recognition and then now there are a lot of post processing steps we have to.",
            "Apply our layout and structural annotation somehow.",
            "We didn't get that from the OCR.",
            "We have to do correction steps of the OCR, and it's actually a lot of work so maybe an interesting resource to discuss what OCR does and what it can provide as opposed to manual transcription and tagging."
        ],
        [
            "So As for the format, I also."
        ],
        [
            "You mentioned we've got our TI format.",
            "We enhanced this format a bit for newspapers, provided documentation about how to annotate newspapers.",
            "If you're interested, you could look into that.",
            "And, well, yeah, some additional tagging solutions we applied where, for example, as I already said.",
            "Values for divisions for article types like political news, fetra and so on.",
            "Also, introductory parts are a bit individual for newspapers rather than for other books, so we did some adjustments to the format there.",
            "And now we're trying to annotate other newspapers.",
            "In a similar way according."
        ],
        [
            "To that format, some prospects about access and analysis of the newspaper corpora within the DTA.",
            "Of course, like all our texts, you can access them."
        ],
        [
            "One by one they all have.",
            "Like their own website with metadata and then can get into the text and you can read the text.",
            "All the see the XML T. You can also download the text in different formats and so on."
        ],
        [
            "Some of them are still in the quality assurance platform.",
            "You can also access them then.",
            "It's just that you have to sign up for GTA Q and then you can access all the texts and you can download them there too.",
            "And as I said, correct them stuff like that."
        ],
        [
            "Then you can also research the texts by our platform.",
            "We've got our query language, which is called EDC and this is an example for query I did on just political news articles which are coming from one newspaper.",
            "The humble covers correspondent and I was searching for the term session here.",
            "You can also see what the linguistic analysis did so.",
            "The Lemmatization and Pewds tagging enabled us to find different variants of the morphological variants of the term by just searching for one term."
        ],
        [
            "And also complex corpus queries are already possible by our DTA queue, so text which are still in there can still be queried using the DC and in this case I was searching for session.",
            "In all texts which were classified as a newspaper and so here you can see I've found very different newspapers and I can scan through the results here."
        ],
        [
            "Then we've got a tool called the Ocular, which has been implemented by my colleague Brian George.",
            "What it does is.",
            "While getting the Co locations of.",
            "One word.",
            "So now I have.",
            "Search for the term bike fart in German and then I get collocations through time so you can.",
            "See maybe how the discourse of one term has changed overtime, so I was performing the search on the dinner party technicians, Jonah, the Polytechnical Journal, and you can actually see a little bit.",
            "Maybe the technical development in 1890 the connotations of bike were something like pedal or biker or running by foot.",
            "And then in 1910 it's all about Moto Automobile, motor craft and aircraft and things like that."
        ],
        [
            "And also, as I already said, we are providing all these resources for Claren as well.",
            "So here's one example from the Virtual Language Observatory where I filtered the records by Deutsche Texas Chief, which is our collection and site languages newspaper and I get our metadata records as well.",
            "We also.",
            "Well connected to the Federated content search and other claren service."
        ],
        [
            "This as well.",
            "So to conclude.",
            "As I showed you, what we're looking at is the curation of newspapers from different sources from different project partners.",
            "And as I said, it's an opportunistic collection right now.",
            "It's still work in progress.",
            "You also saw that there are other resources we'd like to curate, for example, the Texan back corpus, which is a Journal of Albinistic texts from the 19th century, again, and.",
            "Yeah, interesting from my perspective also too.",
            "What was said also yesterday in the discussion would be what is necessary for researchers.",
            "Do they need like this manual transcription and tagging, or is OCR enough and which quality should texts have and the prospects on that?",
            "Also an interesting point in this.",
            "Well, in these areas optical layout recognition I'd say especially for newspapers where you have these articles.",
            "Complex article structures on one page which have to be represented in the TIF format somehow and.",
            "Some problems with that."
        ],
        [
            "Yeah, so thanks very much and.",
            "Jeff question."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you very much for inviting us.",
                    "label": 0
                },
                {
                    "sent": "I'm the speaker, but I'm representing our whole team at the Berlin Runbook Academy of Sciences and I want to talk about our.",
                    "label": 0
                },
                {
                    "sent": "Efforts to get historical newspaper corpora for the Dodgers text.",
                    "label": 1
                },
                {
                    "sent": "I have project which we work at.",
                    "label": 0
                },
                {
                    "sent": "I will tell you what that is in a minute and about our ways, how we manage curation, harmonization of resources, and how we provide them to the Community.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I give you a short introduction about our project.",
                    "label": 0
                },
                {
                    "sent": "As I said, it's.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Cards, Dodgers, text, ice, even English German text Archive and our goal is to create a corpus of historical German texts dating back to the 17th to 19th century to enable the studies about the development of the new High German language and.",
                    "label": 1
                },
                {
                    "sent": "Currently we have gathered about 3000 works.",
                    "label": 1
                },
                {
                    "sent": "Which were all manually transcribed the DTA call corpus is actually about 2000 works, and then there are a lot of works we gathered through curation.",
                    "label": 0
                },
                {
                    "sent": "They were manually transcribed and also annotated using the TI annotation text set and special form, and we developed for that and transcription was well performed in the Double King without working method.",
                    "label": 1
                },
                {
                    "sent": "So we try to get really high text quality and I hope we achieve that.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two then the automatic linguistic annotation steps like tokenization, lemmatization, part of speech tagging, and author graphic normalization, which means we are normalizing the historical spelling variants so that you can research the corpus with the modern spelling and get all the historical forms.",
                    "label": 1
                },
                {
                    "sent": "And yeah, you can access the text through our platform.",
                    "label": 1
                },
                {
                    "sent": "You can perform quite elaborate corpus queries there using our query language, but it's also possible to download other resources to do your own research.",
                    "label": 0
                },
                {
                    "sent": "It's all CC licenses, and as Martin already said, we are a partner in Claren.",
                    "label": 0
                },
                {
                    "sent": "Academy of Sciences in Berlin is a centerpiece for Claren, and so we're providing all our resources through the claron infrastructure as well.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, as I shortly mentioned we have TI format which we produced based on our historical texts which should.",
                    "label": 0
                },
                {
                    "sent": "Enable unambiguous annotation of texts so we.",
                    "label": 1
                },
                {
                    "sent": "Took a subset of the T attack set to ensure that our texts are interoperable and every text which goes into our corpora will be annotated according to our guidelines so that all the texts will be harmonized with one another.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then there is a quality assurance platform as we call it GTA Q where all the texts lend at first, then they are.",
                    "label": 1
                },
                {
                    "sent": "Some quality assurance steps before they are actually released on our platform, but you can also access all the texts in DTA Q.",
                    "label": 0
                },
                {
                    "sent": "We like to have it as a collaborative platform where the community can contribute.",
                    "label": 0
                },
                {
                    "sent": "Can also correct texts, report errors and add commands to the text.",
                    "label": 1
                },
                {
                    "sent": "They are already downloadable via date, EDTA, Q as well.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The background project a bit for our German tax archive is the so called WDS, the digital Dictionary of the German language.",
                    "label": 1
                },
                {
                    "sent": "This is actually the long-term project of the Academy of Sciences, and we are associated to this project as a project funded by the German Research Foundation.",
                    "label": 1
                },
                {
                    "sent": "And the DW DS.",
                    "label": 0
                },
                {
                    "sent": "So is creating an accomplice based dictionary for the.",
                    "label": 0
                },
                {
                    "sent": "Synchronic High German language.",
                    "label": 0
                },
                {
                    "sent": "Recent German language and the German Tax Archive is providing a historical fundament for this.",
                    "label": 1
                },
                {
                    "sent": "Project.",
                    "label": 0
                },
                {
                    "sent": "So there are newspaper corpora within the DWSD WDS corpora as well, but these are.",
                    "label": 0
                },
                {
                    "sent": "Modern newspapers, as you can see, the weekly newspaper did site or Berlin newspapers the target Pingel and Berlin.",
                    "label": 0
                },
                {
                    "sent": "Building a title Berlin newspaper.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the problem I want to talk about right now is the following.",
                    "label": 0
                },
                {
                    "sent": "The DTA core Corpus was created based on a fixed bibliography and this bibliography contained very different text types from scientific texts.",
                    "label": 1
                },
                {
                    "sent": "Function attacks to fiction, but it didn't contain any periodic code, so we didn't have journals or newspapers in our original bibliography.",
                    "label": 0
                },
                {
                    "sent": "We are trying to gather a corpus of this very important text type.",
                    "label": 0
                },
                {
                    "sent": "Obviously for the development of the language by.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Curating resources and the curation part is actually a very important part of the claron activities.",
                    "label": 0
                },
                {
                    "sent": "So within Claren, we actually have the opportunity to be in contact with partners and together newspaper corpora through external projects.",
                    "label": 0
                },
                {
                    "sent": "Actually, who collaborate with us?",
                    "label": 0
                },
                {
                    "sent": "This is a graphic about, well, maybe the workflow we are.",
                    "label": 0
                },
                {
                    "sent": "Performing here so text get into the story.",
                    "label": 0
                },
                {
                    "sent": "DTA in very different formats and we convert them into our DTA based format, which is TI XML.",
                    "label": 0
                },
                {
                    "sent": "Then they land into our quality assurance platform.",
                    "label": 0
                },
                {
                    "sent": "They go through quality assurance steps, metadata source, images, everything is added, and then we publish them.",
                    "label": 0
                },
                {
                    "sent": "On our platform and also within clarity as I said.",
                    "label": 0
                },
                {
                    "sent": "So every.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Barry wins the DTA gathers knew newspapers for the corpus.",
                    "label": 1
                },
                {
                    "sent": "The projects who could collaborate with us have a platform where they can publish their texts where they have quality assurance, can work further on their texts, connect their resources with other corpora, and have a repository.",
                    "label": 0
                },
                {
                    "sent": "And the community will have the possibility to access harmonized texts and collections in one format via the DTA.",
                    "label": 1
                },
                {
                    "sent": "Have access to scattered resources which are now interoperable.",
                    "label": 1
                },
                {
                    "sent": "Compare corpora and so on.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now I'd like to present you which corpora of newspapers we currently have, and as you will see.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are lots lots more smaller than the European newspaper corpora.",
                    "label": 0
                },
                {
                    "sent": "This is of course due to our approach that everything has to be transcribed manually and there's a lot of.",
                    "label": 0
                },
                {
                    "sent": "Manual effort in that, so one collection is the Manheim Corpus of historical newspapers.",
                    "label": 1
                },
                {
                    "sent": "Here we collaborate with the Institute of the German language in Manheim, the Manheim Corpus of historical newspaper.",
                    "label": 0
                },
                {
                    "sent": "Sets two parts.",
                    "label": 0
                },
                {
                    "sent": "One is already digitized and is currently provided via the DTA.",
                    "label": 0
                },
                {
                    "sent": "The other one.",
                    "label": 0
                },
                {
                    "sent": "Has to be digitized, which is done.",
                    "label": 0
                },
                {
                    "sent": "According to the DTA workflow already, which is really nice.",
                    "label": 0
                },
                {
                    "sent": "Then there's the so-called Hamburger Correspondent newspaper from Hamburg, which has been digitized in the crossover project at the University of Paderborn.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The GNU Gnu Renunion newspaper, now your liner, should side tongue digitized at the Academy of Sciences in Berlin in the Cross of the critical edition of the complete split works of Karl Marx and Friedrich Engels.",
                    "label": 1
                },
                {
                    "sent": "So it's a newspaper provided by them.",
                    "label": 0
                },
                {
                    "sent": "And then there are other newspaper collections which are actually smaller than that.",
                    "label": 0
                },
                {
                    "sent": "From, uh, the?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sources, so here's a small overview about what is actually provided right now, and what are the processing steps we actually have to do in our project to publish the newspapers.",
                    "label": 0
                },
                {
                    "sent": "As you can see, some of the newspapers came in the two step format had to be.",
                    "label": 0
                },
                {
                    "sent": "Converted to the DTI based format.",
                    "label": 0
                },
                {
                    "sent": "Then we actually apply article text types of possible so we.",
                    "label": 0
                },
                {
                    "sent": "Make the difference between political news, financial news, financial stuff like that.",
                    "label": 0
                },
                {
                    "sent": "It's not done for all of the newspapers, but for a significant amount of them, and especially for those which are now digitized from scratch according to the DTA workflow.",
                    "label": 0
                },
                {
                    "sent": "So these kinds of projects really help for the whole workflow if we actually have a say in the matter from the beginning on, of course.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah, and as you can see.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's newspapers from very different times here.",
                    "label": 0
                },
                {
                    "sent": "There's actually the timeline for that, and as you can see, it's an opportunistic collection.",
                    "label": 0
                },
                {
                    "sent": "It's not balanced at all, so we are taking newspapers which are of good quality from external projects, no matter during which time or in what place they have appeared.",
                    "label": 0
                },
                {
                    "sent": "Then when we have gathered newspaper corpus, then we can say, well, let's.",
                    "label": 0
                },
                {
                    "sent": "Create a sub corpus which is balanced, but right now we just have to try to build up a corpus for that and also we want to contribute to the Community that they can actually publish their resources by other DTA platform.",
                    "label": 0
                },
                {
                    "sent": "So as you can see the 1840s are really well represented.",
                    "label": 0
                },
                {
                    "sent": "This is especially due to the higher ridership site and which has only was only appearing during two years actually.",
                    "label": 0
                },
                {
                    "sent": "During the German Revolution so.",
                    "label": 0
                },
                {
                    "sent": "We've got a lot of newspapers there too, and then you can see down here.",
                    "label": 0
                },
                {
                    "sent": "These are all newspaper issues, but some of them are only from one newspaper, others are from diverse newspapers.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Actually I.",
                    "label": 0
                },
                {
                    "sent": "An important point.",
                    "label": 0
                },
                {
                    "sent": "Here too.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah access we try to provide access for the newspapers overtime through our platform.",
                    "label": 0
                },
                {
                    "sent": "As I said, so some of the newspapers are already online.",
                    "label": 0
                },
                {
                    "sent": "The Hamburg newspaper is completely online via the DTA platform.",
                    "label": 1
                },
                {
                    "sent": "Some of them are still in DTA Q4.",
                    "label": 1
                },
                {
                    "sent": "Kualiti steps to be performed and others are in preparation and will be released by our platform, most of them by the end of this year.",
                    "label": 1
                },
                {
                    "sent": "Of course, the Mannheim Corpus of historical newspapers Two is currently digitized and might take a little bit longer.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we've got a couple of journals to which have been added to the DTA.",
                    "label": 1
                },
                {
                    "sent": "One is the purely technical Journal of Dingler Technical Journal, which appeared during the 19th century at most, and which has been digitized by a project at the Humboldt University in Berlin, and it's accessible within the GTA for corpus queries because it's.",
                    "label": 1
                },
                {
                    "sent": "A very large partner or.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Collection right now and another one, and this is the only collection we've got which was originally transcribed using OCR.",
                    "label": 0
                },
                {
                    "sent": "And that's the Grand Spuiten Journal of Cultural and political Journal from the 19th century as well.",
                    "label": 0
                },
                {
                    "sent": "Here the partner was the University Library of Bremen.",
                    "label": 0
                },
                {
                    "sent": "And as I said, they will see our steps for text recognition and then now there are a lot of post processing steps we have to.",
                    "label": 0
                },
                {
                    "sent": "Apply our layout and structural annotation somehow.",
                    "label": 0
                },
                {
                    "sent": "We didn't get that from the OCR.",
                    "label": 0
                },
                {
                    "sent": "We have to do correction steps of the OCR, and it's actually a lot of work so maybe an interesting resource to discuss what OCR does and what it can provide as opposed to manual transcription and tagging.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So As for the format, I also.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You mentioned we've got our TI format.",
                    "label": 0
                },
                {
                    "sent": "We enhanced this format a bit for newspapers, provided documentation about how to annotate newspapers.",
                    "label": 0
                },
                {
                    "sent": "If you're interested, you could look into that.",
                    "label": 0
                },
                {
                    "sent": "And, well, yeah, some additional tagging solutions we applied where, for example, as I already said.",
                    "label": 1
                },
                {
                    "sent": "Values for divisions for article types like political news, fetra and so on.",
                    "label": 1
                },
                {
                    "sent": "Also, introductory parts are a bit individual for newspapers rather than for other books, so we did some adjustments to the format there.",
                    "label": 0
                },
                {
                    "sent": "And now we're trying to annotate other newspapers.",
                    "label": 0
                },
                {
                    "sent": "In a similar way according.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To that format, some prospects about access and analysis of the newspaper corpora within the DTA.",
                    "label": 0
                },
                {
                    "sent": "Of course, like all our texts, you can access them.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One by one they all have.",
                    "label": 0
                },
                {
                    "sent": "Like their own website with metadata and then can get into the text and you can read the text.",
                    "label": 0
                },
                {
                    "sent": "All the see the XML T. You can also download the text in different formats and so on.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of them are still in the quality assurance platform.",
                    "label": 0
                },
                {
                    "sent": "You can also access them then.",
                    "label": 0
                },
                {
                    "sent": "It's just that you have to sign up for GTA Q and then you can access all the texts and you can download them there too.",
                    "label": 0
                },
                {
                    "sent": "And as I said, correct them stuff like that.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then you can also research the texts by our platform.",
                    "label": 0
                },
                {
                    "sent": "We've got our query language, which is called EDC and this is an example for query I did on just political news articles which are coming from one newspaper.",
                    "label": 0
                },
                {
                    "sent": "The humble covers correspondent and I was searching for the term session here.",
                    "label": 0
                },
                {
                    "sent": "You can also see what the linguistic analysis did so.",
                    "label": 0
                },
                {
                    "sent": "The Lemmatization and Pewds tagging enabled us to find different variants of the morphological variants of the term by just searching for one term.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also complex corpus queries are already possible by our DTA queue, so text which are still in there can still be queried using the DC and in this case I was searching for session.",
                    "label": 0
                },
                {
                    "sent": "In all texts which were classified as a newspaper and so here you can see I've found very different newspapers and I can scan through the results here.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we've got a tool called the Ocular, which has been implemented by my colleague Brian George.",
                    "label": 0
                },
                {
                    "sent": "What it does is.",
                    "label": 0
                },
                {
                    "sent": "While getting the Co locations of.",
                    "label": 0
                },
                {
                    "sent": "One word.",
                    "label": 0
                },
                {
                    "sent": "So now I have.",
                    "label": 0
                },
                {
                    "sent": "Search for the term bike fart in German and then I get collocations through time so you can.",
                    "label": 0
                },
                {
                    "sent": "See maybe how the discourse of one term has changed overtime, so I was performing the search on the dinner party technicians, Jonah, the Polytechnical Journal, and you can actually see a little bit.",
                    "label": 0
                },
                {
                    "sent": "Maybe the technical development in 1890 the connotations of bike were something like pedal or biker or running by foot.",
                    "label": 0
                },
                {
                    "sent": "And then in 1910 it's all about Moto Automobile, motor craft and aircraft and things like that.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also, as I already said, we are providing all these resources for Claren as well.",
                    "label": 0
                },
                {
                    "sent": "So here's one example from the Virtual Language Observatory where I filtered the records by Deutsche Texas Chief, which is our collection and site languages newspaper and I get our metadata records as well.",
                    "label": 0
                },
                {
                    "sent": "We also.",
                    "label": 0
                },
                {
                    "sent": "Well connected to the Federated content search and other claren service.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This as well.",
                    "label": 0
                },
                {
                    "sent": "So to conclude.",
                    "label": 0
                },
                {
                    "sent": "As I showed you, what we're looking at is the curation of newspapers from different sources from different project partners.",
                    "label": 1
                },
                {
                    "sent": "And as I said, it's an opportunistic collection right now.",
                    "label": 0
                },
                {
                    "sent": "It's still work in progress.",
                    "label": 0
                },
                {
                    "sent": "You also saw that there are other resources we'd like to curate, for example, the Texan back corpus, which is a Journal of Albinistic texts from the 19th century, again, and.",
                    "label": 0
                },
                {
                    "sent": "Yeah, interesting from my perspective also too.",
                    "label": 0
                },
                {
                    "sent": "What was said also yesterday in the discussion would be what is necessary for researchers.",
                    "label": 1
                },
                {
                    "sent": "Do they need like this manual transcription and tagging, or is OCR enough and which quality should texts have and the prospects on that?",
                    "label": 0
                },
                {
                    "sent": "Also an interesting point in this.",
                    "label": 0
                },
                {
                    "sent": "Well, in these areas optical layout recognition I'd say especially for newspapers where you have these articles.",
                    "label": 0
                },
                {
                    "sent": "Complex article structures on one page which have to be represented in the TIF format somehow and.",
                    "label": 0
                },
                {
                    "sent": "Some problems with that.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so thanks very much and.",
                    "label": 0
                },
                {
                    "sent": "Jeff question.",
                    "label": 0
                }
            ]
        }
    }
}