{
    "id": "luioynkm5t53lt62xf6xkomobrnp5pze",
    "title": "The Emergence of Life on Earth: Mystery or Scientific Problem? / Nastanek življenja na Zemlji: misterij ali znanstveni problem?",
    "info": {
        "author": [
            "Iris Fry, Technion - Israel Institute of Technology"
        ],
        "published": "Nov. 9, 2009",
        "recorded": "October 2009",
        "category": [
            "Top->Biology->Evolutionary Biology"
        ]
    },
    "url": "http://videolectures.net/bzid09_fry_nznz/",
    "segmentation": [
        [
            "Her quote for predators a bit or a pro so.",
            "Doctor authorities fry and a slow near prod.",
            "Avenia nasty Nick Julian's family.",
            "Mystery Alison Sweeney problem doctors are forever here is Israel.",
            "Is Israel a Institute to the technology?",
            "Oh yeah cheaters as good of Indian philosophy of your low gear Now deal closer human is a humanism nepis olejnik parve neslo is Virgil Enya.",
            "Mysterial is nice to any problem is dialogue.",
            "Let us see them individually to Israel.",
            "Drew bikini.",
            "Understanding Giuliani and Assembly is Goodwin skins matheney problem?",
            "Violated what is such brochures?",
            "Goodwinski filoso scare Drews Benedicere would not submit nanosteel in any stronger signal today really deal with Salinas Westerners numbing crossing.",
            "Thank you.",
            "Yeah, OK. OK, good morning.",
            "Can you hear me?",
            "Yeah OK, I have a microphone here and I would like first to express my.",
            "Pleasure of.",
            "Being here in your.",
            "Lovely city, and in your very pretty country which we had yesterday chance to see a very small piece of, but we were.",
            "So so impressed, and especially are so delighted to be in this important conference and I would like to extend my deep gratitude to Barbara to minecart to Simona who worked so hard to repair this conference.",
            "And who were gracious to invite us to this to this conference.",
            "Today I'm going to speak on.",
            "A very difficult and complex subject.",
            "The emergence of life on Earth.",
            "I would like to tell you that despite the fact that we still don't have an answer to this question.",
            "It is not a mystery.",
            "There is no need for any supernatural explanations for that.",
            "It's a scientific problem, a very difficult scientific problem, which we hope eventually to solve."
        ],
        [
            "OK, so as I said, this is one of the most difficult questions still facing science."
        ],
        [
            "R. And Interestingly.",
            "For most of history.",
            "People both naturalist and ordinary people.",
            "Had no doubt about the answer.",
            "They usually base their beliefs about the origin of life on 2.",
            "On some combination of 2 two beliefs, one that human beings and other complex organisms were originally created by God as separate species.",
            "In the original event of creation.",
            "And also people believed.",
            "In what was called spontaneous generation.",
            "And people were convinced that they see before their very eyes how again and again repeatedly.",
            "Many organisms are generated.",
            "Completely.",
            "From inanimate matter in organic matter, organic matter people were sure that flies are formed from rotten meat.",
            "Other insects from rotten fruit.",
            "Snakes and crocodiles from modern rivers.",
            "For example the River Nile.",
            "And so, until quite recently historically, there was no difficult problem.",
            "Now."
        ],
        [
            "Belief in spontaneous generation.",
            "I would like to say was sometimes justified on the basis of a materialistic conviction, but.",
            "Through most of the periods it coincided with religious beliefs.",
            "People thought that it was based on some theological doctrine early on that God has implanted a sort of potentials for all kinds of organisms in the earth.",
            "In water.",
            "And according to a divine or regional divine plan, these potentials keep materializing when there are appropriate conditions.",
            "Now following observations and experiments and not less important philosophical and religious changes.",
            "Disbelief in spontaneous generation was gradually.",
            "Decreasing and finally abandoned towards the end of the 19th century.",
            "And what about the belief in the divine creation of life?",
            "Generally speaking.",
            "Religious explanations of living phenomena were slower to die compared to explanation for natural explanation.",
            "For physical phenomena.",
            "We know that starting 17th century onwards, astronomy mechanics were being explained on the basis of natural mechanisms.",
            "And.",
            "As for biological explanations, you know that the Citadel of Biology was finally, so to speak, conquered with the culmination of this process was the publication of Darwin's origin book in the middle of the 19th century.",
            "OK.",
            "I.",
            "In his theory of evolution.",
            "Darwin presented the living world, including all organisms ever to exist on Earth.",
            "As one big family.",
            "His metaphor of the Tree of life.",
            "Assume they are postulated a common ancestor on the ancient Earth, out of which all speech is descended with modifications.",
            "Current molecular tools are indeed confirmed.",
            "Darwin's idea?",
            "We know today through the risk research of molecular evolution that the domain all the main branches of life indeed branched out of this common root.",
            "From a original population of cells.",
            "Called the last Universal common ancestor, or.",
            "Fondly Luca and we have a lot of data to substantiate.",
            "Believe that this population of cells, these look are probably already existed about four billion years ago.",
            "OK, I now want to.",
            "Yeah, and this is this is indeed sort of a illustration of local and the three.",
            "Main superkingdom the bacteria, Archaea, and Eukarya that branched from this route.",
            "And this is a diagram in which you can see the relationship between the emergence of life and biological evolution.",
            "The origin of Earth is marked at about 4.5 to 4.6 billion years ago.",
            "As we said, Luca is supposed to have existed 3.5 to 4 billion years ago, the.",
            "Interim between these two events is sometimes referred to as the window of life.",
            "So the phase span of time during which life was supposed to emerge on earth, and from then on we can we enter into the phase of biological evolution.",
            "OK, So what did Darwin himself think about the origin of life?",
            "In his original species and other published works, he didn't.",
            "Discuss this subject.",
            "Darwin believed that the scientific knowledge of his time was not.",
            "Up to this daunting question.",
            "And."
        ],
        [
            "There are indications that he probably felt that his theory of evolution was scandalous enough.",
            "He had enough on his hands and not to open another front with the religious establishment on this very fundamental question of the origin of life.",
            "However, in private letters to friends and colleagues, he did express his views on this subject.",
            "There is one very famous letter in which he raised a what he described as a very daring hypothesis.",
            "Materialistic hypothesis.",
            "According to which life."
        ],
        [
            "Originated from chemical compounds under various Lindy under the influence of various sources of energy in what Darwin called in a warm little pond.",
            "OK, we move a little further in time.",
            "At the end of the 19th century, the beginning of the 20th century.",
            "The rise of new scientific fields genetics biochemistry was beginning to reveal the complexity of the cell.",
            "And this together with I mean, we would expect that we'd increase scientific knowledge.",
            "We will make progress on all questions, but this is not how the history of science works.",
            "Apparently some."
        ],
        [
            "Times with additional knowledge but still lack of understanding on some other things.",
            "There is a retreat.",
            "There is an increasing confusion and that is what happened on the question of the origin of life at the turn of the century's, between the 19th and 20th."
        ],
        [
            "Century and I cannot get into all this detail in the paper that I that you have in your proceedings.",
            "I go a little bit into more details about that, But anyway, the result was a sort of a dead end feeling among scientists.",
            "Scientists preferred not to deal with this subject at this time.",
            "Now this impasse, this dead end was broken.",
            "In the 1920s and 1930s by a few pioneering publications.",
            "Most notable were was a long.",
            "Paper a booklet actually written by the Soviet Russian biochemist at the Soviet Union, Alexander Oparin and a little shorter and less detailed paper by the English geneticists.",
            "JBS Haldane.",
            "And they were they were basing.",
            "Intrac"
        ],
        [
            "Only their ideas on the origin of life.",
            "On developments in biochemistry and.",
            "Genetics also on new findings in astronomy at this time, but very importantly on their strong evolutionary commitment.",
            "Still, a really experimental field.",
            "Studying the origin of life could not have been established before.",
            "The second half of the 20th century, after the rise of molecular biology, when people started to reveal the molecular basis of evolution and to get more knowledge of the molecular.",
            "Construction of the cell.",
            "And.",
            "At that time, the first simulation experiments of what we call prebiotic conditions conditions on the early Earth prior to the emergence of life simulation experiments showed that demonstrated that we can get.",
            "Basic organic molecules relevant."
        ],
        [
            "Lifelike amino acids and some components of nucleic acids and and at this time people started to suggest more specific scenarios based on this molecular knowledge.",
            "At the same time.",
            "Molecular biology was revealing what we could call the Achilles heel of the origin of life problem.",
            "It is.",
            "It was known historically, it was known by Aristotle in the 4th century BC.",
            "It was known by other.",
            "Keen observers of nature along time ago that the basic characteristic of.",
            "Biological organization is the tight interdependence of all component of organisms and and molecular biology was starting to reveal the same interdependence under molecular on the molecular level and.",
            "The one of the most remarkable of these sort of vicious cycles that molecular biology revealed in the cell is the interaction between nucleic acids and proteins because, as.",
            "You know, look like acids cannot be synthesized.",
            "Cannot function without enzymes made of proteins.",
            "Proteins, on the other hand, cannot be synthesized without genetic information embodied in nucleic acid.",
            "So here we have on our hands, sort of a chicken and egg problem of the origin of life.",
            "And and the question, what came first?",
            "Nucleic acids or proteins and how could the one rise and function without the other?",
            "Here you have a.",
            "A illustration of, you know, the chickens and eggs.",
            "The proteins and nucleic acids and you know.",
            "There is another very famous illustration of this sort of coal and Rome."
        ],
        [
            "The.",
            "Famous picture of Asher.",
            "You know the two hands that paint paint each other, so these two illustrations expressed the same idea.",
            "OK, there are two major conceptions of life.",
            "The one views life first and first and foremost as a genetic replicating unit.",
            "The other.",
            "As a multi molecular.",
            "Biochemical system self sustaining itself through metabolic cycles, and these two conceptions are expressed in two resource research programs.",
            "In the study of the origin of life, so the gene FirstGroup.",
            "Claims that replication replicating molecules, the basic features of life had to arise first.",
            "And metabolism FirstGroup views life basically is a multi molecular metabolic system.",
            "And claims that primitive metabolism had to emerge first."
        ],
        [
            "OK.",
            "So these two camps attack the chicken and egg problem from two different perspectives, as you see.",
            "Since the earliest sales were already.",
            "Complex systems.",
            "The question we are grappling with here is the question of the emergence of.",
            "Biological complexity.",
            "We know that already Darwin realized that the question of the evolution of complexity.",
            "Was a very one of the most basic questions for his theory.",
            "And in the origin he discussed under a special section of the chapter called difficulties of my theory.",
            "He discussed the evolution of what he called organs of extreme.",
            "Complexion and perfection and complex and complications sorry.",
            "His most notable example was the evolution of the very complex vertebrate eye and also other organs.",
            "And he debated with his critics, and showed that despite common sense beliefs.",
            "Even such organs can evolve by natural selection.",
            "Now the question is, could natural selection also explain the very emergence of complexity?",
            "Could.",
            "Natural selection also work on inanimate matter in the merge."
        ],
        [
            "Of life itself.",
            "On the face of it, we have here a paradox.",
            "Because if we need living systems, functioning living systems for natural selection to work.",
            "How could natural selection explain the very emergence of life?",
            "The very emergence of living systems?"
        ],
        [
            "So.",
            "What I would like to claim here is that this could happen only if.",
            "On the early earth.",
            "Chemical systems.",
            "That arose by ordinary physical and chemical processes.",
            "There were still, they still didn't have the characteristic.",
            "Nature of biological organization.",
            "But still nevertheless these systems.",
            "Had the ability to evolve.",
            "They were structured and made in such a way that they could.",
            "Fulfill the conditions of natural selection.",
            "Some sort of reproduction, some sort of variation, and competition.",
            "I would like to emphasize.",
            "Living systems organisms are both.",
            "Products of evolution.",
            "And participate in evolution.",
            "They have these two aspects, So what?",
            "We dim and here what we require here are a system that were not products of evolution, but nevertheless could evolve where what we call evolvable.",
            "OK I would like.",
            "I would like to OK let me see.",
            "OK.",
            "Yes, So what we're asking here?",
            "What we're asking?",
            "Now is whether these chemical systems that, as I said.",
            "Arose on the Earth by ordinary physical and chemical processes.",
            "What were these system we are?",
            "We look for system that could have served as what could be called an infrastructure for natural selection.",
            "So what was what was this infrastructure?",
            "So this is in other words.",
            "Another phrasing of the debate between these two camps that I mentioned where these systems genetic, were they metabolic."
        ],
        [
            "I must ask you to forgive me Becausw.",
            "Something is."
        ],
        [
            "Yeah, OK. OK. What is the answer of the gene first camp?",
            "How do they try to solve the question of looking for system that could serve as infrastructure for?",
            "This early evolution.",
            "The answer in you know, a big title is the RNA world theory.",
            "This theory is based on a surprising discovery in the 1980s.",
            "Where a few.",
            "Biochemist discovered in present day cells, RNA molecules.",
            "That can function also as enzymes.",
            "This was a big surprise because until then.",
            "People were convinced that only proteins can work as enzymes.",
            "So what was discovered is that indeed not only proteins can work as enzymes, but some RNA molecules have also the ability to catalyze different reactions and and these these are.",
            "RNA molecules.",
            "Got the name ribosomes?",
            "It's a combination of RNA and enzymes.",
            "I will not go into details only if there will be any question later in the discussion.",
            "What?",
            "What are the details of the RNA world theory?",
            "I don't think that we need to go into it now.",
            "What I want to say is the crucial and most demanding requirement of the RNA world theory.",
            "Is that among those right designs?",
            "Because people who."
        ],
        [
            "Believe in the RNA world theory regard those ribozymes that we found today in sales.",
            "Just as the remanence sort of leftovers.",
            "From a very old chemical world in which.",
            "All functions.",
            "That were later taken over by DNA and proteins or functions.",
            "All biological, fundamental biological functions were carried out by RNA molecules by.",
            "Different tribal zones.",
            "But in order for.",
            "This theorie."
        ],
        [
            "So indeed solve the problem of this infrastructure.",
            "We are looking for the.",
            "The requirement is that among these variety of Ryba signs there were at least a few Ryba zones that could replicate themselves.",
            "That could, on the one hand.",
            "Serve as a sort of a template for application.",
            "And at the same time to.",
            "Form a copy and a copy of the copy of this template so.",
            "We need what we call in an RNA.",
            "Replicas and only on the basis of such an RNA, replicates the whole system could start to move in work, and indeed serve as a basis for natural selection.",
            "So.",
            "What does the metabolic camp?",
            "So what is their answer first?",
            "They are claim, and rightly so.",
            "That the.",
            "Formation of ribosomes, and especially such ribosomes as I mentioned, now that the ribosome that can replicate themselves is extremely.",
            "Improbable.",
            "Mataba lick metabolised.",
            "Claim that it's so improbable that it couldn't have happened.",
            "On the other hand.",
            "They say that there is a much higher probability that on the early Earth, small organic molecules could have formed.",
            "Some people say that they were.",
            "Imported to earth and meteoroids, meteorites and comets.",
            "But anyway.",
            "A sort of a reserve are smaller organic molecules, amino acids.",
            "Source peptides building blocks of flippies, etc could have accumulated on the early Earth and.",
            "Among."
        ],
        [
            "These small, smaller, organic molecules, a sort of a process of self organization.",
            "Through mutual catalysis because people know that also."
        ],
        [
            "The smaller molecules can engaging in catalyzing forming all kinds of chemical bonds, a sort of basic metabolic basic metabolic cycles could have formed.",
            "This is again just an illustration of the idea of a sort of a.",
            "Such a metabolic cycle, in which each link in the cycle catalyzes the synthesis of the next link and the whole cycle reproduces itself.",
            "So the question is.",
            "So the question is.",
            "How could such a system serves an infrastructure for evolution through natural selection and hear their metabolism?",
            "First camp comes with a very novel idea and it.",
            "Somehow is related to what you heard from ever Blanca that there are different means, different mechanisms of for the transfer of information and that replication of a genetic polymer is not the only one, and these people claim that it wasn't the one.",
            "To begin with, on the early Earth that by.",
            "The whole cycle of reproducing itself within some sort of compartment or bubble, or some sort of proto cell it would lead to growth of this compartment and eventually to a division into quote unquote offspring.",
            "And and these you know in such a.",
            "In such a cycle, there are different means to form variations of these cycles, so here they speak about a novel kind, not on replication, but reproduction, and a novel way of transferring information, and a novel sort of infrastructure for natural selection.",
            "OK, Adele, both traditions and by the way, the metabolic tradition started already with operating the biochemist and the genetic tradition started with.",
            "Started with our holiday and geneticists.",
            "And both traditions have, I mean, a long history.",
            "They involve a lot of problems, but I would like just to touch on the in the very basic questions.",
            "So the question addressed towards the gene first crack camp is.",
            "Could indeed.",
            "A self replicating rybus could self replicating.",
            "Right designs emerge in prebiotic conditions.",
            "This is the crucial question with which their position.",
            "Stands or falls.",
            "As to the metabolised's.",
            "The question is.",
            "Could metabolic cycles form?",
            "Under prebiotic conditions, and could they indeed?",
            "Serve as infrastructure for evolution, so these are two very.",
            "Difficult question now.",
            "There is a physical chemist, Scottish physical chemist, Brancker and Smith.",
            "Who is very much involved in the origin of life research?",
            "Published a lot of books and he has a novel.",
            "Alternative."
        ],
        [
            "And and he what he.",
            "What he says is that life didn't start.",
            "I mean, unlike all the other theories, life didn't start with organic chemistry.",
            "He regards organic chemistry as true.",
            "To complex.",
            "He calls.",
            "He calls organic chemistry high tech and he said that.",
            "Life had to start with low tech and low tech is inorganic chemistry or mineral chemistry.",
            "And he predicts that on the early Earth, the 1st.",
            "Evolvable systems were made of clay minerals.",
            "And he shows not experimentally, but theoretically and how such?",
            "Claes could replicate there.",
            "Surface how variation could be formed.",
            "How could they saw his claim?",
            "Is that these?",
            "Mineral chemistry crystal chemistry could have served as the beginning and eventually.",
            "With the aid of the mineral surfaces, organic molecules could have started to be synthesized, absorbed on the surface and eventually giving rise to an organic system.",
            "I want, by the way, to say what I didn't say before, that one of the.",
            "Claim the strong claim of the of the gene first people is that the ribosome ribozyme that were found."
        ],
        [
            "Are a very elegant answer to the difficult question of the chicken and egg because they say that on the early Earth, these right designs served as both chicken and egg.",
            "So the question as I said, is.",
            "Was it Feasable was it was it probable?",
            "OK. Now I want to how much time do I have?",
            "2 minutes.",
            "Five thank you.",
            "OK, so I'll have to skip a few things because I want to get to.",
            "I want to get to an important question.",
            "I think very important.",
            "So.",
            "You see the picture, the picture is.",
            "And I.",
            "Very candidly presented to you.",
            "All the difficulties.",
            "There are a lot of advances.",
            "There is a lot of new knowledge in many.",
            "Feelings that contribute to this interdisciplinary project of the search for the origin of life.",
            "There is a lot of controversy.",
            "However.",
            "All camps, all origin of life scientists are united by a.",
            "Basic philosophical naturalistic assumption.",
            "That sorry.",
            "OK, I am missing here a. I am missing here a slide.",
            "OK, what the slider that I'm missing and please I apologize.",
            "Is that the naturalistic philosophical assumption that forms the basis?",
            "Of all research on the origin of life, and actually for all research in evolution, is that life emerged through natural means.",
            "Now of course, you are all aware of the.",
            "Fierce struggle that is going on with creationism.",
            "I mean, creationist movement has a long history started in the early 20th century.",
            "In the in the USA.",
            "But now unfortunately, we know that it takes roots in different places.",
            "You know about this story well well enough, how it it starts to be active in different different countries.",
            "The last version of this creationist movement is the those intelligent designers.",
            "These are the.",
            "They claim that life is too complex to have emerged an evolve naturally, so they believe that the first cell had to be designed and created by what they call an intelligent designers they.",
            "Try to be very sophisticated in there.",
            "Politics, politics, and their maneuvering, so some of them say we don't say who is the intelligent designer.",
            "But when you press them easy, they sort of an alien.",
            "So the question of course is is God and very, very specific God.",
            "But anyway, this is there.",
            "This is there.",
            "Question OK?"
        ],
        [
            "I would like to say just a few words about the conflict between science and creationism.",
            "For the creation is the fact that there is still no answer to the origin of life question."
        ],
        [
            "Is of course.",
            "A big victory, they say.",
            "First of all, you know that they tend to confuse between.",
            "Not solved yet and not solvable.",
            "I mean unsolvable that.",
            "So if there is no question yet, they.",
            "Conclude for me that it it cannot be solved in principle, but.",
            "The.",
            "The more interesting part is that there are some scientists who feel that since we still don't have an answer to the origin of life question, this is a sort of embarrassment for science.",
            "This is some people described it as the soft belly of evolution.",
            "I mean, this is something which you better not discuss with the Creationists, because you still don't have an empirical answer.",
            "OK, So what I want to?",
            "Claim is that the conflict is fundamentally philosophical.",
            "And it's fundamentally philosophical and the conviction of scientists that eventually.",
            "An natural explanation for the origin of life will be found is founded on a very strong foundation there on the foundation of a naturalistic worldview.",
            "Now this worldview.",
            "Developed and is developing now for a few hundreds of years.",
            "And it is based on the IT is based on many aspects.",
            "Technological cultural.",
            "Sociological, etc.",
            "But it is mainly based on the accumulation of the empirical achievements of science.",
            "So this foundation the what I call the naturalistic or the evolutionary worldview.",
            "Is well founded is well founded and can give us a good foundation to our claim that the origin of life question will be solved.",
            "Sooner or later, so we don't have to feel embarrassed.",
            "Becausw we still don't have an answer.",
            "Empirical answer that we still didn't simulate the process in the laboratory.",
            "We go on searching and we go on searching.",
            "We go on studying until a natural explanation will be found.",
            "Thank you very much.",
            "Thank you very much, Doctor Fry.",
            "Is it coffee break now so we have time for new questions?",
            "Yeah, OK.",
            "There were many issues here, so probably you'll have to translate.",
            "You know if it will be in Slovenian, which language do I use?"
        ],
        [
            "So again, it's OK.",
            "But it's a, but it's a bunch of loaner cars.",
            "Any problem on shaky kisaki share cookies?",
            "Nanostructure Kyle.",
            "Nicholas, it's nice to feel as though Skyforge laid out code about all in matter.",
            "Sonia.",
            "Suck neighbor persona Verstaan which is the name of perversity populism.",
            "Or do you turn to God?",
            "I'll signal you have some pop up operation.",
            "I've got a G. Jewish attested Nabira triple boom.",
            "Ramirez Carrasco, prashanti.",
            "I would have a short answer questions.",
            "Answer is than yours.",
            "It will have to be short, I'm sure, yeah.",
            "How is life life today?",
            "Earth today different that it was in the long stretch of the of the origin of the first life that was shown on the first picture that that makes Earth different before then is today is worse, where these times more let me say.",
            "Nice for life to develop then now is a struggle today harder or life actually is very very evolving from zero also today somewhere.",
            "OK, actually we have here 2 questions to difficult questions and I answer shortly as to the conditions, the different conditions on the early Earth.",
            "Again another question on which there is still a debate but one one thing is quite clear, and it's interesting that Darwin himself said it in one of his letters.",
            "And he said that in order for life, or at least some kind of life to emerge.",
            "The Earth had to be sterile.",
            "I mean no previous life.",
            "And why is that?",
            "If we assume that life indeed the first forms of lives?",
            "Life resulted from the building of organic molecules.",
            "First simple and then more complex.",
            "Imagine that today in some place, as probably happens, organic molecules are produced.",
            "Existing life will eat it for breakfast.",
            "So the condition a precondition for for the emergence of what we call in biology, heterotrophic life life that is based on organic material.",
            "Or life that was built out of organic molecules is.",
            "That there was no life.",
            "So the Earth had to be.",
            "Yeah, OK, so that's first now a very big question is.",
            "The Constitution of the early atmosphere.",
            "And about that there were.",
            "Cycles of ideas.",
            "Operating and Holden were the first who said very clearly that there was no oxygen in the early atmosphere and that was very important because you know that in the presence of oxygen, organic molecules decompose.",
            "So no oxygen and about that.",
            "I think most scientists today agree.",
            "No oxygen now as to the chemical composition of the of the atmosphere for awhile.",
            "Acquiring and holding and people later spoke about what is called a reducing atmosphere.",
            "Atmosphere containing hydrogen rich.",
            "Molecules, ammonia, methane.",
            "Free hydrogen water.",
            "Now, some people today believe that that's not true, that the early atmosphere was in some ways, I mean no free oxygen, but still in some way similar to today's atmosphere, CO2, nitrogen.",
            "So now.",
            "The idea is branch.",
            "Some people say that maybe organic molecules could have give 5050 fifty 5050 fifty 5050, fifty 5050, fifty 5050, fifty 50, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050.",
            "Have the."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Her quote for predators a bit or a pro so.",
                    "label": 0
                },
                {
                    "sent": "Doctor authorities fry and a slow near prod.",
                    "label": 0
                },
                {
                    "sent": "Avenia nasty Nick Julian's family.",
                    "label": 0
                },
                {
                    "sent": "Mystery Alison Sweeney problem doctors are forever here is Israel.",
                    "label": 0
                },
                {
                    "sent": "Is Israel a Institute to the technology?",
                    "label": 0
                },
                {
                    "sent": "Oh yeah cheaters as good of Indian philosophy of your low gear Now deal closer human is a humanism nepis olejnik parve neslo is Virgil Enya.",
                    "label": 0
                },
                {
                    "sent": "Mysterial is nice to any problem is dialogue.",
                    "label": 0
                },
                {
                    "sent": "Let us see them individually to Israel.",
                    "label": 0
                },
                {
                    "sent": "Drew bikini.",
                    "label": 0
                },
                {
                    "sent": "Understanding Giuliani and Assembly is Goodwin skins matheney problem?",
                    "label": 0
                },
                {
                    "sent": "Violated what is such brochures?",
                    "label": 0
                },
                {
                    "sent": "Goodwinski filoso scare Drews Benedicere would not submit nanosteel in any stronger signal today really deal with Salinas Westerners numbing crossing.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK. OK, good morning.",
                    "label": 0
                },
                {
                    "sent": "Can you hear me?",
                    "label": 0
                },
                {
                    "sent": "Yeah OK, I have a microphone here and I would like first to express my.",
                    "label": 0
                },
                {
                    "sent": "Pleasure of.",
                    "label": 0
                },
                {
                    "sent": "Being here in your.",
                    "label": 0
                },
                {
                    "sent": "Lovely city, and in your very pretty country which we had yesterday chance to see a very small piece of, but we were.",
                    "label": 0
                },
                {
                    "sent": "So so impressed, and especially are so delighted to be in this important conference and I would like to extend my deep gratitude to Barbara to minecart to Simona who worked so hard to repair this conference.",
                    "label": 0
                },
                {
                    "sent": "And who were gracious to invite us to this to this conference.",
                    "label": 0
                },
                {
                    "sent": "Today I'm going to speak on.",
                    "label": 0
                },
                {
                    "sent": "A very difficult and complex subject.",
                    "label": 0
                },
                {
                    "sent": "The emergence of life on Earth.",
                    "label": 1
                },
                {
                    "sent": "I would like to tell you that despite the fact that we still don't have an answer to this question.",
                    "label": 0
                },
                {
                    "sent": "It is not a mystery.",
                    "label": 0
                },
                {
                    "sent": "There is no need for any supernatural explanations for that.",
                    "label": 0
                },
                {
                    "sent": "It's a scientific problem, a very difficult scientific problem, which we hope eventually to solve.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so as I said, this is one of the most difficult questions still facing science.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "R. And Interestingly.",
                    "label": 0
                },
                {
                    "sent": "For most of history.",
                    "label": 0
                },
                {
                    "sent": "People both naturalist and ordinary people.",
                    "label": 0
                },
                {
                    "sent": "Had no doubt about the answer.",
                    "label": 0
                },
                {
                    "sent": "They usually base their beliefs about the origin of life on 2.",
                    "label": 1
                },
                {
                    "sent": "On some combination of 2 two beliefs, one that human beings and other complex organisms were originally created by God as separate species.",
                    "label": 1
                },
                {
                    "sent": "In the original event of creation.",
                    "label": 1
                },
                {
                    "sent": "And also people believed.",
                    "label": 0
                },
                {
                    "sent": "In what was called spontaneous generation.",
                    "label": 0
                },
                {
                    "sent": "And people were convinced that they see before their very eyes how again and again repeatedly.",
                    "label": 0
                },
                {
                    "sent": "Many organisms are generated.",
                    "label": 0
                },
                {
                    "sent": "Completely.",
                    "label": 1
                },
                {
                    "sent": "From inanimate matter in organic matter, organic matter people were sure that flies are formed from rotten meat.",
                    "label": 1
                },
                {
                    "sent": "Other insects from rotten fruit.",
                    "label": 0
                },
                {
                    "sent": "Snakes and crocodiles from modern rivers.",
                    "label": 0
                },
                {
                    "sent": "For example the River Nile.",
                    "label": 0
                },
                {
                    "sent": "And so, until quite recently historically, there was no difficult problem.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Belief in spontaneous generation.",
                    "label": 0
                },
                {
                    "sent": "I would like to say was sometimes justified on the basis of a materialistic conviction, but.",
                    "label": 0
                },
                {
                    "sent": "Through most of the periods it coincided with religious beliefs.",
                    "label": 0
                },
                {
                    "sent": "People thought that it was based on some theological doctrine early on that God has implanted a sort of potentials for all kinds of organisms in the earth.",
                    "label": 0
                },
                {
                    "sent": "In water.",
                    "label": 0
                },
                {
                    "sent": "And according to a divine or regional divine plan, these potentials keep materializing when there are appropriate conditions.",
                    "label": 0
                },
                {
                    "sent": "Now following observations and experiments and not less important philosophical and religious changes.",
                    "label": 0
                },
                {
                    "sent": "Disbelief in spontaneous generation was gradually.",
                    "label": 1
                },
                {
                    "sent": "Decreasing and finally abandoned towards the end of the 19th century.",
                    "label": 1
                },
                {
                    "sent": "And what about the belief in the divine creation of life?",
                    "label": 1
                },
                {
                    "sent": "Generally speaking.",
                    "label": 0
                },
                {
                    "sent": "Religious explanations of living phenomena were slower to die compared to explanation for natural explanation.",
                    "label": 0
                },
                {
                    "sent": "For physical phenomena.",
                    "label": 0
                },
                {
                    "sent": "We know that starting 17th century onwards, astronomy mechanics were being explained on the basis of natural mechanisms.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "As for biological explanations, you know that the Citadel of Biology was finally, so to speak, conquered with the culmination of this process was the publication of Darwin's origin book in the middle of the 19th century.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 1
                },
                {
                    "sent": "In his theory of evolution.",
                    "label": 0
                },
                {
                    "sent": "Darwin presented the living world, including all organisms ever to exist on Earth.",
                    "label": 0
                },
                {
                    "sent": "As one big family.",
                    "label": 0
                },
                {
                    "sent": "His metaphor of the Tree of life.",
                    "label": 0
                },
                {
                    "sent": "Assume they are postulated a common ancestor on the ancient Earth, out of which all speech is descended with modifications.",
                    "label": 0
                },
                {
                    "sent": "Current molecular tools are indeed confirmed.",
                    "label": 0
                },
                {
                    "sent": "Darwin's idea?",
                    "label": 0
                },
                {
                    "sent": "We know today through the risk research of molecular evolution that the domain all the main branches of life indeed branched out of this common root.",
                    "label": 0
                },
                {
                    "sent": "From a original population of cells.",
                    "label": 0
                },
                {
                    "sent": "Called the last Universal common ancestor, or.",
                    "label": 0
                },
                {
                    "sent": "Fondly Luca and we have a lot of data to substantiate.",
                    "label": 0
                },
                {
                    "sent": "Believe that this population of cells, these look are probably already existed about four billion years ago.",
                    "label": 0
                },
                {
                    "sent": "OK, I now want to.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and this is this is indeed sort of a illustration of local and the three.",
                    "label": 0
                },
                {
                    "sent": "Main superkingdom the bacteria, Archaea, and Eukarya that branched from this route.",
                    "label": 0
                },
                {
                    "sent": "And this is a diagram in which you can see the relationship between the emergence of life and biological evolution.",
                    "label": 0
                },
                {
                    "sent": "The origin of Earth is marked at about 4.5 to 4.6 billion years ago.",
                    "label": 0
                },
                {
                    "sent": "As we said, Luca is supposed to have existed 3.5 to 4 billion years ago, the.",
                    "label": 1
                },
                {
                    "sent": "Interim between these two events is sometimes referred to as the window of life.",
                    "label": 0
                },
                {
                    "sent": "So the phase span of time during which life was supposed to emerge on earth, and from then on we can we enter into the phase of biological evolution.",
                    "label": 0
                },
                {
                    "sent": "OK, So what did Darwin himself think about the origin of life?",
                    "label": 0
                },
                {
                    "sent": "In his original species and other published works, he didn't.",
                    "label": 0
                },
                {
                    "sent": "Discuss this subject.",
                    "label": 0
                },
                {
                    "sent": "Darwin believed that the scientific knowledge of his time was not.",
                    "label": 0
                },
                {
                    "sent": "Up to this daunting question.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are indications that he probably felt that his theory of evolution was scandalous enough.",
                    "label": 0
                },
                {
                    "sent": "He had enough on his hands and not to open another front with the religious establishment on this very fundamental question of the origin of life.",
                    "label": 0
                },
                {
                    "sent": "However, in private letters to friends and colleagues, he did express his views on this subject.",
                    "label": 0
                },
                {
                    "sent": "There is one very famous letter in which he raised a what he described as a very daring hypothesis.",
                    "label": 0
                },
                {
                    "sent": "Materialistic hypothesis.",
                    "label": 0
                },
                {
                    "sent": "According to which life.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Originated from chemical compounds under various Lindy under the influence of various sources of energy in what Darwin called in a warm little pond.",
                    "label": 0
                },
                {
                    "sent": "OK, we move a little further in time.",
                    "label": 0
                },
                {
                    "sent": "At the end of the 19th century, the beginning of the 20th century.",
                    "label": 1
                },
                {
                    "sent": "The rise of new scientific fields genetics biochemistry was beginning to reveal the complexity of the cell.",
                    "label": 0
                },
                {
                    "sent": "And this together with I mean, we would expect that we'd increase scientific knowledge.",
                    "label": 0
                },
                {
                    "sent": "We will make progress on all questions, but this is not how the history of science works.",
                    "label": 0
                },
                {
                    "sent": "Apparently some.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Times with additional knowledge but still lack of understanding on some other things.",
                    "label": 0
                },
                {
                    "sent": "There is a retreat.",
                    "label": 0
                },
                {
                    "sent": "There is an increasing confusion and that is what happened on the question of the origin of life at the turn of the century's, between the 19th and 20th.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Century and I cannot get into all this detail in the paper that I that you have in your proceedings.",
                    "label": 0
                },
                {
                    "sent": "I go a little bit into more details about that, But anyway, the result was a sort of a dead end feeling among scientists.",
                    "label": 0
                },
                {
                    "sent": "Scientists preferred not to deal with this subject at this time.",
                    "label": 0
                },
                {
                    "sent": "Now this impasse, this dead end was broken.",
                    "label": 0
                },
                {
                    "sent": "In the 1920s and 1930s by a few pioneering publications.",
                    "label": 0
                },
                {
                    "sent": "Most notable were was a long.",
                    "label": 0
                },
                {
                    "sent": "Paper a booklet actually written by the Soviet Russian biochemist at the Soviet Union, Alexander Oparin and a little shorter and less detailed paper by the English geneticists.",
                    "label": 0
                },
                {
                    "sent": "JBS Haldane.",
                    "label": 0
                },
                {
                    "sent": "And they were they were basing.",
                    "label": 0
                },
                {
                    "sent": "Intrac",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Only their ideas on the origin of life.",
                    "label": 1
                },
                {
                    "sent": "On developments in biochemistry and.",
                    "label": 0
                },
                {
                    "sent": "Genetics also on new findings in astronomy at this time, but very importantly on their strong evolutionary commitment.",
                    "label": 0
                },
                {
                    "sent": "Still, a really experimental field.",
                    "label": 1
                },
                {
                    "sent": "Studying the origin of life could not have been established before.",
                    "label": 0
                },
                {
                    "sent": "The second half of the 20th century, after the rise of molecular biology, when people started to reveal the molecular basis of evolution and to get more knowledge of the molecular.",
                    "label": 0
                },
                {
                    "sent": "Construction of the cell.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "At that time, the first simulation experiments of what we call prebiotic conditions conditions on the early Earth prior to the emergence of life simulation experiments showed that demonstrated that we can get.",
                    "label": 0
                },
                {
                    "sent": "Basic organic molecules relevant.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lifelike amino acids and some components of nucleic acids and and at this time people started to suggest more specific scenarios based on this molecular knowledge.",
                    "label": 0
                },
                {
                    "sent": "At the same time.",
                    "label": 0
                },
                {
                    "sent": "Molecular biology was revealing what we could call the Achilles heel of the origin of life problem.",
                    "label": 0
                },
                {
                    "sent": "It is.",
                    "label": 0
                },
                {
                    "sent": "It was known historically, it was known by Aristotle in the 4th century BC.",
                    "label": 1
                },
                {
                    "sent": "It was known by other.",
                    "label": 0
                },
                {
                    "sent": "Keen observers of nature along time ago that the basic characteristic of.",
                    "label": 0
                },
                {
                    "sent": "Biological organization is the tight interdependence of all component of organisms and and molecular biology was starting to reveal the same interdependence under molecular on the molecular level and.",
                    "label": 0
                },
                {
                    "sent": "The one of the most remarkable of these sort of vicious cycles that molecular biology revealed in the cell is the interaction between nucleic acids and proteins because, as.",
                    "label": 0
                },
                {
                    "sent": "You know, look like acids cannot be synthesized.",
                    "label": 0
                },
                {
                    "sent": "Cannot function without enzymes made of proteins.",
                    "label": 1
                },
                {
                    "sent": "Proteins, on the other hand, cannot be synthesized without genetic information embodied in nucleic acid.",
                    "label": 0
                },
                {
                    "sent": "So here we have on our hands, sort of a chicken and egg problem of the origin of life.",
                    "label": 1
                },
                {
                    "sent": "And and the question, what came first?",
                    "label": 0
                },
                {
                    "sent": "Nucleic acids or proteins and how could the one rise and function without the other?",
                    "label": 0
                },
                {
                    "sent": "Here you have a.",
                    "label": 0
                },
                {
                    "sent": "A illustration of, you know, the chickens and eggs.",
                    "label": 0
                },
                {
                    "sent": "The proteins and nucleic acids and you know.",
                    "label": 0
                },
                {
                    "sent": "There is another very famous illustration of this sort of coal and Rome.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Famous picture of Asher.",
                    "label": 0
                },
                {
                    "sent": "You know the two hands that paint paint each other, so these two illustrations expressed the same idea.",
                    "label": 0
                },
                {
                    "sent": "OK, there are two major conceptions of life.",
                    "label": 0
                },
                {
                    "sent": "The one views life first and first and foremost as a genetic replicating unit.",
                    "label": 0
                },
                {
                    "sent": "The other.",
                    "label": 0
                },
                {
                    "sent": "As a multi molecular.",
                    "label": 0
                },
                {
                    "sent": "Biochemical system self sustaining itself through metabolic cycles, and these two conceptions are expressed in two resource research programs.",
                    "label": 0
                },
                {
                    "sent": "In the study of the origin of life, so the gene FirstGroup.",
                    "label": 0
                },
                {
                    "sent": "Claims that replication replicating molecules, the basic features of life had to arise first.",
                    "label": 0
                },
                {
                    "sent": "And metabolism FirstGroup views life basically is a multi molecular metabolic system.",
                    "label": 0
                },
                {
                    "sent": "And claims that primitive metabolism had to emerge first.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So these two camps attack the chicken and egg problem from two different perspectives, as you see.",
                    "label": 1
                },
                {
                    "sent": "Since the earliest sales were already.",
                    "label": 0
                },
                {
                    "sent": "Complex systems.",
                    "label": 0
                },
                {
                    "sent": "The question we are grappling with here is the question of the emergence of.",
                    "label": 0
                },
                {
                    "sent": "Biological complexity.",
                    "label": 0
                },
                {
                    "sent": "We know that already Darwin realized that the question of the evolution of complexity.",
                    "label": 1
                },
                {
                    "sent": "Was a very one of the most basic questions for his theory.",
                    "label": 1
                },
                {
                    "sent": "And in the origin he discussed under a special section of the chapter called difficulties of my theory.",
                    "label": 0
                },
                {
                    "sent": "He discussed the evolution of what he called organs of extreme.",
                    "label": 0
                },
                {
                    "sent": "Complexion and perfection and complex and complications sorry.",
                    "label": 0
                },
                {
                    "sent": "His most notable example was the evolution of the very complex vertebrate eye and also other organs.",
                    "label": 0
                },
                {
                    "sent": "And he debated with his critics, and showed that despite common sense beliefs.",
                    "label": 0
                },
                {
                    "sent": "Even such organs can evolve by natural selection.",
                    "label": 0
                },
                {
                    "sent": "Now the question is, could natural selection also explain the very emergence of complexity?",
                    "label": 0
                },
                {
                    "sent": "Could.",
                    "label": 0
                },
                {
                    "sent": "Natural selection also work on inanimate matter in the merge.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of life itself.",
                    "label": 0
                },
                {
                    "sent": "On the face of it, we have here a paradox.",
                    "label": 0
                },
                {
                    "sent": "Because if we need living systems, functioning living systems for natural selection to work.",
                    "label": 0
                },
                {
                    "sent": "How could natural selection explain the very emergence of life?",
                    "label": 0
                },
                {
                    "sent": "The very emergence of living systems?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What I would like to claim here is that this could happen only if.",
                    "label": 0
                },
                {
                    "sent": "On the early earth.",
                    "label": 0
                },
                {
                    "sent": "Chemical systems.",
                    "label": 0
                },
                {
                    "sent": "That arose by ordinary physical and chemical processes.",
                    "label": 0
                },
                {
                    "sent": "There were still, they still didn't have the characteristic.",
                    "label": 0
                },
                {
                    "sent": "Nature of biological organization.",
                    "label": 0
                },
                {
                    "sent": "But still nevertheless these systems.",
                    "label": 0
                },
                {
                    "sent": "Had the ability to evolve.",
                    "label": 0
                },
                {
                    "sent": "They were structured and made in such a way that they could.",
                    "label": 0
                },
                {
                    "sent": "Fulfill the conditions of natural selection.",
                    "label": 0
                },
                {
                    "sent": "Some sort of reproduction, some sort of variation, and competition.",
                    "label": 0
                },
                {
                    "sent": "I would like to emphasize.",
                    "label": 0
                },
                {
                    "sent": "Living systems organisms are both.",
                    "label": 0
                },
                {
                    "sent": "Products of evolution.",
                    "label": 0
                },
                {
                    "sent": "And participate in evolution.",
                    "label": 0
                },
                {
                    "sent": "They have these two aspects, So what?",
                    "label": 0
                },
                {
                    "sent": "We dim and here what we require here are a system that were not products of evolution, but nevertheless could evolve where what we call evolvable.",
                    "label": 0
                },
                {
                    "sent": "OK I would like.",
                    "label": 0
                },
                {
                    "sent": "I would like to OK let me see.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, So what we're asking here?",
                    "label": 0
                },
                {
                    "sent": "What we're asking?",
                    "label": 0
                },
                {
                    "sent": "Now is whether these chemical systems that, as I said.",
                    "label": 0
                },
                {
                    "sent": "Arose on the Earth by ordinary physical and chemical processes.",
                    "label": 0
                },
                {
                    "sent": "What were these system we are?",
                    "label": 0
                },
                {
                    "sent": "We look for system that could have served as what could be called an infrastructure for natural selection.",
                    "label": 0
                },
                {
                    "sent": "So what was what was this infrastructure?",
                    "label": 0
                },
                {
                    "sent": "So this is in other words.",
                    "label": 0
                },
                {
                    "sent": "Another phrasing of the debate between these two camps that I mentioned where these systems genetic, were they metabolic.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I must ask you to forgive me Becausw.",
                    "label": 0
                },
                {
                    "sent": "Something is.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, OK. OK. What is the answer of the gene first camp?",
                    "label": 0
                },
                {
                    "sent": "How do they try to solve the question of looking for system that could serve as infrastructure for?",
                    "label": 0
                },
                {
                    "sent": "This early evolution.",
                    "label": 0
                },
                {
                    "sent": "The answer in you know, a big title is the RNA world theory.",
                    "label": 0
                },
                {
                    "sent": "This theory is based on a surprising discovery in the 1980s.",
                    "label": 0
                },
                {
                    "sent": "Where a few.",
                    "label": 0
                },
                {
                    "sent": "Biochemist discovered in present day cells, RNA molecules.",
                    "label": 0
                },
                {
                    "sent": "That can function also as enzymes.",
                    "label": 0
                },
                {
                    "sent": "This was a big surprise because until then.",
                    "label": 0
                },
                {
                    "sent": "People were convinced that only proteins can work as enzymes.",
                    "label": 0
                },
                {
                    "sent": "So what was discovered is that indeed not only proteins can work as enzymes, but some RNA molecules have also the ability to catalyze different reactions and and these these are.",
                    "label": 0
                },
                {
                    "sent": "RNA molecules.",
                    "label": 0
                },
                {
                    "sent": "Got the name ribosomes?",
                    "label": 0
                },
                {
                    "sent": "It's a combination of RNA and enzymes.",
                    "label": 0
                },
                {
                    "sent": "I will not go into details only if there will be any question later in the discussion.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "What are the details of the RNA world theory?",
                    "label": 0
                },
                {
                    "sent": "I don't think that we need to go into it now.",
                    "label": 0
                },
                {
                    "sent": "What I want to say is the crucial and most demanding requirement of the RNA world theory.",
                    "label": 0
                },
                {
                    "sent": "Is that among those right designs?",
                    "label": 0
                },
                {
                    "sent": "Because people who.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Believe in the RNA world theory regard those ribozymes that we found today in sales.",
                    "label": 0
                },
                {
                    "sent": "Just as the remanence sort of leftovers.",
                    "label": 0
                },
                {
                    "sent": "From a very old chemical world in which.",
                    "label": 0
                },
                {
                    "sent": "All functions.",
                    "label": 0
                },
                {
                    "sent": "That were later taken over by DNA and proteins or functions.",
                    "label": 0
                },
                {
                    "sent": "All biological, fundamental biological functions were carried out by RNA molecules by.",
                    "label": 0
                },
                {
                    "sent": "Different tribal zones.",
                    "label": 0
                },
                {
                    "sent": "But in order for.",
                    "label": 0
                },
                {
                    "sent": "This theorie.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So indeed solve the problem of this infrastructure.",
                    "label": 0
                },
                {
                    "sent": "We are looking for the.",
                    "label": 0
                },
                {
                    "sent": "The requirement is that among these variety of Ryba signs there were at least a few Ryba zones that could replicate themselves.",
                    "label": 0
                },
                {
                    "sent": "That could, on the one hand.",
                    "label": 0
                },
                {
                    "sent": "Serve as a sort of a template for application.",
                    "label": 0
                },
                {
                    "sent": "And at the same time to.",
                    "label": 0
                },
                {
                    "sent": "Form a copy and a copy of the copy of this template so.",
                    "label": 1
                },
                {
                    "sent": "We need what we call in an RNA.",
                    "label": 0
                },
                {
                    "sent": "Replicas and only on the basis of such an RNA, replicates the whole system could start to move in work, and indeed serve as a basis for natural selection.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What does the metabolic camp?",
                    "label": 0
                },
                {
                    "sent": "So what is their answer first?",
                    "label": 0
                },
                {
                    "sent": "They are claim, and rightly so.",
                    "label": 0
                },
                {
                    "sent": "That the.",
                    "label": 0
                },
                {
                    "sent": "Formation of ribosomes, and especially such ribosomes as I mentioned, now that the ribosome that can replicate themselves is extremely.",
                    "label": 1
                },
                {
                    "sent": "Improbable.",
                    "label": 0
                },
                {
                    "sent": "Mataba lick metabolised.",
                    "label": 0
                },
                {
                    "sent": "Claim that it's so improbable that it couldn't have happened.",
                    "label": 0
                },
                {
                    "sent": "On the other hand.",
                    "label": 0
                },
                {
                    "sent": "They say that there is a much higher probability that on the early Earth, small organic molecules could have formed.",
                    "label": 1
                },
                {
                    "sent": "Some people say that they were.",
                    "label": 0
                },
                {
                    "sent": "Imported to earth and meteoroids, meteorites and comets.",
                    "label": 0
                },
                {
                    "sent": "But anyway.",
                    "label": 0
                },
                {
                    "sent": "A sort of a reserve are smaller organic molecules, amino acids.",
                    "label": 0
                },
                {
                    "sent": "Source peptides building blocks of flippies, etc could have accumulated on the early Earth and.",
                    "label": 0
                },
                {
                    "sent": "Among.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These small, smaller, organic molecules, a sort of a process of self organization.",
                    "label": 0
                },
                {
                    "sent": "Through mutual catalysis because people know that also.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The smaller molecules can engaging in catalyzing forming all kinds of chemical bonds, a sort of basic metabolic basic metabolic cycles could have formed.",
                    "label": 0
                },
                {
                    "sent": "This is again just an illustration of the idea of a sort of a.",
                    "label": 0
                },
                {
                    "sent": "Such a metabolic cycle, in which each link in the cycle catalyzes the synthesis of the next link and the whole cycle reproduces itself.",
                    "label": 1
                },
                {
                    "sent": "So the question is.",
                    "label": 0
                },
                {
                    "sent": "So the question is.",
                    "label": 0
                },
                {
                    "sent": "How could such a system serves an infrastructure for evolution through natural selection and hear their metabolism?",
                    "label": 0
                },
                {
                    "sent": "First camp comes with a very novel idea and it.",
                    "label": 0
                },
                {
                    "sent": "Somehow is related to what you heard from ever Blanca that there are different means, different mechanisms of for the transfer of information and that replication of a genetic polymer is not the only one, and these people claim that it wasn't the one.",
                    "label": 0
                },
                {
                    "sent": "To begin with, on the early Earth that by.",
                    "label": 0
                },
                {
                    "sent": "The whole cycle of reproducing itself within some sort of compartment or bubble, or some sort of proto cell it would lead to growth of this compartment and eventually to a division into quote unquote offspring.",
                    "label": 0
                },
                {
                    "sent": "And and these you know in such a.",
                    "label": 1
                },
                {
                    "sent": "In such a cycle, there are different means to form variations of these cycles, so here they speak about a novel kind, not on replication, but reproduction, and a novel way of transferring information, and a novel sort of infrastructure for natural selection.",
                    "label": 0
                },
                {
                    "sent": "OK, Adele, both traditions and by the way, the metabolic tradition started already with operating the biochemist and the genetic tradition started with.",
                    "label": 0
                },
                {
                    "sent": "Started with our holiday and geneticists.",
                    "label": 0
                },
                {
                    "sent": "And both traditions have, I mean, a long history.",
                    "label": 0
                },
                {
                    "sent": "They involve a lot of problems, but I would like just to touch on the in the very basic questions.",
                    "label": 0
                },
                {
                    "sent": "So the question addressed towards the gene first crack camp is.",
                    "label": 0
                },
                {
                    "sent": "Could indeed.",
                    "label": 0
                },
                {
                    "sent": "A self replicating rybus could self replicating.",
                    "label": 0
                },
                {
                    "sent": "Right designs emerge in prebiotic conditions.",
                    "label": 0
                },
                {
                    "sent": "This is the crucial question with which their position.",
                    "label": 0
                },
                {
                    "sent": "Stands or falls.",
                    "label": 0
                },
                {
                    "sent": "As to the metabolised's.",
                    "label": 0
                },
                {
                    "sent": "The question is.",
                    "label": 0
                },
                {
                    "sent": "Could metabolic cycles form?",
                    "label": 0
                },
                {
                    "sent": "Under prebiotic conditions, and could they indeed?",
                    "label": 0
                },
                {
                    "sent": "Serve as infrastructure for evolution, so these are two very.",
                    "label": 0
                },
                {
                    "sent": "Difficult question now.",
                    "label": 0
                },
                {
                    "sent": "There is a physical chemist, Scottish physical chemist, Brancker and Smith.",
                    "label": 0
                },
                {
                    "sent": "Who is very much involved in the origin of life research?",
                    "label": 0
                },
                {
                    "sent": "Published a lot of books and he has a novel.",
                    "label": 0
                },
                {
                    "sent": "Alternative.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and he what he.",
                    "label": 0
                },
                {
                    "sent": "What he says is that life didn't start.",
                    "label": 0
                },
                {
                    "sent": "I mean, unlike all the other theories, life didn't start with organic chemistry.",
                    "label": 0
                },
                {
                    "sent": "He regards organic chemistry as true.",
                    "label": 0
                },
                {
                    "sent": "To complex.",
                    "label": 0
                },
                {
                    "sent": "He calls.",
                    "label": 0
                },
                {
                    "sent": "He calls organic chemistry high tech and he said that.",
                    "label": 0
                },
                {
                    "sent": "Life had to start with low tech and low tech is inorganic chemistry or mineral chemistry.",
                    "label": 0
                },
                {
                    "sent": "And he predicts that on the early Earth, the 1st.",
                    "label": 0
                },
                {
                    "sent": "Evolvable systems were made of clay minerals.",
                    "label": 0
                },
                {
                    "sent": "And he shows not experimentally, but theoretically and how such?",
                    "label": 0
                },
                {
                    "sent": "Claes could replicate there.",
                    "label": 0
                },
                {
                    "sent": "Surface how variation could be formed.",
                    "label": 0
                },
                {
                    "sent": "How could they saw his claim?",
                    "label": 0
                },
                {
                    "sent": "Is that these?",
                    "label": 0
                },
                {
                    "sent": "Mineral chemistry crystal chemistry could have served as the beginning and eventually.",
                    "label": 0
                },
                {
                    "sent": "With the aid of the mineral surfaces, organic molecules could have started to be synthesized, absorbed on the surface and eventually giving rise to an organic system.",
                    "label": 0
                },
                {
                    "sent": "I want, by the way, to say what I didn't say before, that one of the.",
                    "label": 0
                },
                {
                    "sent": "Claim the strong claim of the of the gene first people is that the ribosome ribozyme that were found.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are a very elegant answer to the difficult question of the chicken and egg because they say that on the early Earth, these right designs served as both chicken and egg.",
                    "label": 0
                },
                {
                    "sent": "So the question as I said, is.",
                    "label": 0
                },
                {
                    "sent": "Was it Feasable was it was it probable?",
                    "label": 0
                },
                {
                    "sent": "OK. Now I want to how much time do I have?",
                    "label": 0
                },
                {
                    "sent": "2 minutes.",
                    "label": 0
                },
                {
                    "sent": "Five thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'll have to skip a few things because I want to get to.",
                    "label": 0
                },
                {
                    "sent": "I want to get to an important question.",
                    "label": 0
                },
                {
                    "sent": "I think very important.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You see the picture, the picture is.",
                    "label": 0
                },
                {
                    "sent": "And I.",
                    "label": 0
                },
                {
                    "sent": "Very candidly presented to you.",
                    "label": 0
                },
                {
                    "sent": "All the difficulties.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of advances.",
                    "label": 0
                },
                {
                    "sent": "There is a lot of new knowledge in many.",
                    "label": 0
                },
                {
                    "sent": "Feelings that contribute to this interdisciplinary project of the search for the origin of life.",
                    "label": 0
                },
                {
                    "sent": "There is a lot of controversy.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "All camps, all origin of life scientists are united by a.",
                    "label": 0
                },
                {
                    "sent": "Basic philosophical naturalistic assumption.",
                    "label": 0
                },
                {
                    "sent": "That sorry.",
                    "label": 0
                },
                {
                    "sent": "OK, I am missing here a. I am missing here a slide.",
                    "label": 0
                },
                {
                    "sent": "OK, what the slider that I'm missing and please I apologize.",
                    "label": 0
                },
                {
                    "sent": "Is that the naturalistic philosophical assumption that forms the basis?",
                    "label": 0
                },
                {
                    "sent": "Of all research on the origin of life, and actually for all research in evolution, is that life emerged through natural means.",
                    "label": 0
                },
                {
                    "sent": "Now of course, you are all aware of the.",
                    "label": 0
                },
                {
                    "sent": "Fierce struggle that is going on with creationism.",
                    "label": 0
                },
                {
                    "sent": "I mean, creationist movement has a long history started in the early 20th century.",
                    "label": 0
                },
                {
                    "sent": "In the in the USA.",
                    "label": 0
                },
                {
                    "sent": "But now unfortunately, we know that it takes roots in different places.",
                    "label": 0
                },
                {
                    "sent": "You know about this story well well enough, how it it starts to be active in different different countries.",
                    "label": 0
                },
                {
                    "sent": "The last version of this creationist movement is the those intelligent designers.",
                    "label": 0
                },
                {
                    "sent": "These are the.",
                    "label": 0
                },
                {
                    "sent": "They claim that life is too complex to have emerged an evolve naturally, so they believe that the first cell had to be designed and created by what they call an intelligent designers they.",
                    "label": 0
                },
                {
                    "sent": "Try to be very sophisticated in there.",
                    "label": 0
                },
                {
                    "sent": "Politics, politics, and their maneuvering, so some of them say we don't say who is the intelligent designer.",
                    "label": 0
                },
                {
                    "sent": "But when you press them easy, they sort of an alien.",
                    "label": 0
                },
                {
                    "sent": "So the question of course is is God and very, very specific God.",
                    "label": 0
                },
                {
                    "sent": "But anyway, this is there.",
                    "label": 0
                },
                {
                    "sent": "This is there.",
                    "label": 0
                },
                {
                    "sent": "Question OK?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to say just a few words about the conflict between science and creationism.",
                    "label": 0
                },
                {
                    "sent": "For the creation is the fact that there is still no answer to the origin of life question.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is of course.",
                    "label": 0
                },
                {
                    "sent": "A big victory, they say.",
                    "label": 0
                },
                {
                    "sent": "First of all, you know that they tend to confuse between.",
                    "label": 0
                },
                {
                    "sent": "Not solved yet and not solvable.",
                    "label": 0
                },
                {
                    "sent": "I mean unsolvable that.",
                    "label": 0
                },
                {
                    "sent": "So if there is no question yet, they.",
                    "label": 0
                },
                {
                    "sent": "Conclude for me that it it cannot be solved in principle, but.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The more interesting part is that there are some scientists who feel that since we still don't have an answer to the origin of life question, this is a sort of embarrassment for science.",
                    "label": 0
                },
                {
                    "sent": "This is some people described it as the soft belly of evolution.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is something which you better not discuss with the Creationists, because you still don't have an empirical answer.",
                    "label": 1
                },
                {
                    "sent": "OK, So what I want to?",
                    "label": 0
                },
                {
                    "sent": "Claim is that the conflict is fundamentally philosophical.",
                    "label": 0
                },
                {
                    "sent": "And it's fundamentally philosophical and the conviction of scientists that eventually.",
                    "label": 0
                },
                {
                    "sent": "An natural explanation for the origin of life will be found is founded on a very strong foundation there on the foundation of a naturalistic worldview.",
                    "label": 0
                },
                {
                    "sent": "Now this worldview.",
                    "label": 0
                },
                {
                    "sent": "Developed and is developing now for a few hundreds of years.",
                    "label": 0
                },
                {
                    "sent": "And it is based on the IT is based on many aspects.",
                    "label": 0
                },
                {
                    "sent": "Technological cultural.",
                    "label": 0
                },
                {
                    "sent": "Sociological, etc.",
                    "label": 0
                },
                {
                    "sent": "But it is mainly based on the accumulation of the empirical achievements of science.",
                    "label": 0
                },
                {
                    "sent": "So this foundation the what I call the naturalistic or the evolutionary worldview.",
                    "label": 1
                },
                {
                    "sent": "Is well founded is well founded and can give us a good foundation to our claim that the origin of life question will be solved.",
                    "label": 0
                },
                {
                    "sent": "Sooner or later, so we don't have to feel embarrassed.",
                    "label": 0
                },
                {
                    "sent": "Becausw we still don't have an answer.",
                    "label": 0
                },
                {
                    "sent": "Empirical answer that we still didn't simulate the process in the laboratory.",
                    "label": 0
                },
                {
                    "sent": "We go on searching and we go on searching.",
                    "label": 0
                },
                {
                    "sent": "We go on studying until a natural explanation will be found.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, Doctor Fry.",
                    "label": 0
                },
                {
                    "sent": "Is it coffee break now so we have time for new questions?",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK.",
                    "label": 0
                },
                {
                    "sent": "There were many issues here, so probably you'll have to translate.",
                    "label": 0
                },
                {
                    "sent": "You know if it will be in Slovenian, which language do I use?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So again, it's OK.",
                    "label": 0
                },
                {
                    "sent": "But it's a, but it's a bunch of loaner cars.",
                    "label": 0
                },
                {
                    "sent": "Any problem on shaky kisaki share cookies?",
                    "label": 0
                },
                {
                    "sent": "Nanostructure Kyle.",
                    "label": 0
                },
                {
                    "sent": "Nicholas, it's nice to feel as though Skyforge laid out code about all in matter.",
                    "label": 0
                },
                {
                    "sent": "Sonia.",
                    "label": 0
                },
                {
                    "sent": "Suck neighbor persona Verstaan which is the name of perversity populism.",
                    "label": 1
                },
                {
                    "sent": "Or do you turn to God?",
                    "label": 0
                },
                {
                    "sent": "I'll signal you have some pop up operation.",
                    "label": 0
                },
                {
                    "sent": "I've got a G. Jewish attested Nabira triple boom.",
                    "label": 0
                },
                {
                    "sent": "Ramirez Carrasco, prashanti.",
                    "label": 0
                },
                {
                    "sent": "I would have a short answer questions.",
                    "label": 0
                },
                {
                    "sent": "Answer is than yours.",
                    "label": 0
                },
                {
                    "sent": "It will have to be short, I'm sure, yeah.",
                    "label": 0
                },
                {
                    "sent": "How is life life today?",
                    "label": 0
                },
                {
                    "sent": "Earth today different that it was in the long stretch of the of the origin of the first life that was shown on the first picture that that makes Earth different before then is today is worse, where these times more let me say.",
                    "label": 1
                },
                {
                    "sent": "Nice for life to develop then now is a struggle today harder or life actually is very very evolving from zero also today somewhere.",
                    "label": 0
                },
                {
                    "sent": "OK, actually we have here 2 questions to difficult questions and I answer shortly as to the conditions, the different conditions on the early Earth.",
                    "label": 1
                },
                {
                    "sent": "Again another question on which there is still a debate but one one thing is quite clear, and it's interesting that Darwin himself said it in one of his letters.",
                    "label": 0
                },
                {
                    "sent": "And he said that in order for life, or at least some kind of life to emerge.",
                    "label": 0
                },
                {
                    "sent": "The Earth had to be sterile.",
                    "label": 0
                },
                {
                    "sent": "I mean no previous life.",
                    "label": 0
                },
                {
                    "sent": "And why is that?",
                    "label": 1
                },
                {
                    "sent": "If we assume that life indeed the first forms of lives?",
                    "label": 0
                },
                {
                    "sent": "Life resulted from the building of organic molecules.",
                    "label": 0
                },
                {
                    "sent": "First simple and then more complex.",
                    "label": 0
                },
                {
                    "sent": "Imagine that today in some place, as probably happens, organic molecules are produced.",
                    "label": 0
                },
                {
                    "sent": "Existing life will eat it for breakfast.",
                    "label": 0
                },
                {
                    "sent": "So the condition a precondition for for the emergence of what we call in biology, heterotrophic life life that is based on organic material.",
                    "label": 0
                },
                {
                    "sent": "Or life that was built out of organic molecules is.",
                    "label": 0
                },
                {
                    "sent": "That there was no life.",
                    "label": 0
                },
                {
                    "sent": "So the Earth had to be.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, so that's first now a very big question is.",
                    "label": 0
                },
                {
                    "sent": "The Constitution of the early atmosphere.",
                    "label": 0
                },
                {
                    "sent": "And about that there were.",
                    "label": 0
                },
                {
                    "sent": "Cycles of ideas.",
                    "label": 0
                },
                {
                    "sent": "Operating and Holden were the first who said very clearly that there was no oxygen in the early atmosphere and that was very important because you know that in the presence of oxygen, organic molecules decompose.",
                    "label": 0
                },
                {
                    "sent": "So no oxygen and about that.",
                    "label": 0
                },
                {
                    "sent": "I think most scientists today agree.",
                    "label": 0
                },
                {
                    "sent": "No oxygen now as to the chemical composition of the of the atmosphere for awhile.",
                    "label": 0
                },
                {
                    "sent": "Acquiring and holding and people later spoke about what is called a reducing atmosphere.",
                    "label": 0
                },
                {
                    "sent": "Atmosphere containing hydrogen rich.",
                    "label": 0
                },
                {
                    "sent": "Molecules, ammonia, methane.",
                    "label": 0
                },
                {
                    "sent": "Free hydrogen water.",
                    "label": 0
                },
                {
                    "sent": "Now, some people today believe that that's not true, that the early atmosphere was in some ways, I mean no free oxygen, but still in some way similar to today's atmosphere, CO2, nitrogen.",
                    "label": 0
                },
                {
                    "sent": "So now.",
                    "label": 0
                },
                {
                    "sent": "The idea is branch.",
                    "label": 0
                },
                {
                    "sent": "Some people say that maybe organic molecules could have give 5050 fifty 5050 fifty 5050, fifty 5050, fifty 5050, fifty 50, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050, fifty 5050.",
                    "label": 0
                },
                {
                    "sent": "Have the.",
                    "label": 0
                }
            ]
        }
    }
}