{
    "id": "m57z42oee7rqdvo4aqbcuviniuvz46r5",
    "title": "Uncovering Latent Structure in Valued Graphs: A Variational Approach",
    "info": {
        "author": [
            "Mahendra Mariadassou, UMR AgroParisTech/INRA 518, Institut National Agronomique Paris-Grignon"
        ],
        "published": "Dec. 14, 2007",
        "recorded": "October 2007",
        "category": [
            "Top->Science->Complexity Science"
        ]
    },
    "url": "http://videolectures.net/eccs07_mariadassou_uls/",
    "segmentation": [
        [
            "Thank you, I'm going to talk about some variational approach to uncover structuring valued graphs.",
            "This is some work I've been doing with my advisor.",
            "Silva has my lab Apple pie taking."
        ],
        [
            "Chris, so I'm going first to explain exactly what I'm doing, what I'm doing and then talk about the model we're using.",
            "It's a mixture model and graphs and then about the parametric estimation.",
            "Exactly how do we estimate the parameters that are used in the model and then present a simulation study which is supposed to validate the?",
            "The parametric estimation."
        ],
        [
            "Of the models so.",
            "I'm not everybody knows why networks are important and why and why we want to study networks, so I'm not."
        ],
        [
            "I'm going to skip that slide and I'm going to introduce some notations that I need so.",
            "In a graph, you need a set of vertices, a set of edges and what is usually called the adjacency matrix, which is the matrix which includes the value of all the edges between between between the words."
        ],
        [
            "So for example, in this in this graph you have 1 two free vertices.",
            "You have 123 edges, an the adjacency matrix would look like this.",
            "That is, the value of the edge connecting one to two.",
            "That's this one would be for and exactly the same for all."
        ],
        [
            "Other edges in the graph.",
            "So in our mixture model we want to introduce some heterogeneity in the vertices, But the main idea is that the vertices are not all the same.",
            "We have some characteristics which differ among the vertices, so we suppose that the vertices are distributed among some classes, Q classes, and that's not in the classes as some connectivity properties and that the connectivity properties change with the classes."
        ],
        [
            "So to model this, we have to introduce a hidden variable which basically tells us if you pick a node.",
            "That I means is the class in which tells you which class your vertices belongs to, and so the proportion of vertices belonging to class small Q would be Alpha, Q an.",
            "We suppose that that that is the class of nod of vertices.",
            "I is just drawn following a multinomial.",
            "With the parameter Alpha."
        ],
        [
            "So for example, if you consider an example for eight nodes Anna free classes, one example of proportion parameters would be 1/4, one, 4th, 1/2, and you could have this kind of realization.",
            "This kind of realization, and so we now have a way to we now have some classes for our nodes.",
            "We just have to specify exactly how we put some values in the on the edges."
        ],
        [
            "Prograf so.",
            "To do so, we have to specify the distribution of the adjacency matrix and what we what we say is just that the value of edge of the edge xig depends on the class of, not I an on the class of, not G. So the class the value of the edge between I and G is drawn following a distribution which depends on the parameter which is completely.",
            "Classified by the class of the first node and the second node, and so to get all the information you need to.",
            "For example, simulate some graphs.",
            "You need to specify all the connectivity parameters and OK, forget this line.",
            "I should have removed it and forgot to do so and then."
        ],
        [
            "If I.",
            "Give you an example.",
            "I made mistakes also in this one, so I'm going to present an example to do exactly what we tell.",
            "Suppose we have exactly 3 classes in the graph.",
            "The squares, the circles and triangles, and we have this connectivity matrix.",
            "Suppose that the edges are drawn following your question distribution with mean them in that are specified in the adjustments in this connectivity matrix.",
            "What happens when you want to draw an edge from a triangle to triangle the value of?",
            "An edge from triangle to triangle is a question is a expression values with mean zero?",
            "So you expect you expect all edges going from triangle to triangle to have value 0.",
            "So we don't represent them in the graph.",
            "Then you want to do some edges from a triangle to square.",
            "This would follow a personal distribution with mean.",
            "Nine so you expect some most of the edges to have value, which is 1 or higher."
        ],
        [
            "This is exactly what happens and you have some edges with value 1, some edges with value 2, a few edges we value free or more than that, and then you do the same for all the other edges and then also the edges from a triangle to square.",
            "Since the mean is only .25, we expect not all of them you expect most of them to have value 0."
        ],
        [
            "Then them, but also some of them quite value one, and eventually the future value."
        ],
        [
            "Two and."
        ],
        [
            "Actually the same for all the kind of edges in."
        ],
        [
            "Rough."
        ],
        [
            "So what's the advantages of giving some value to an edge?",
            "First, you can deal with valued graphs, which is quite an advantage and you can use any probability distribution.",
            "I will come back to do any a bit later and."
        ],
        [
            "You can use for example Bernie if the only information you're interested in is the absence or the presence of."
        ],
        [
            "And then you can use a multinomial if you're interested in the nature of the match.",
            "For example, if you consider a social network, you would like to specify if the connection is a friendship loveship or.",
            "If the Oracle."
        ],
        [
            "And then you can use some quest wages, for example in Co authorship networks, the number of Co published paper is a natural integer, so."
        ],
        [
            "My son will be good and."
        ],
        [
            "You can use some motions and vibrate."
        ],
        [
            "Oceans and anything."
        ],
        [
            "Think about so mixture model is a good way, too easy."
        ],
        [
            "To generate valued graphs, but once you have generated a graph, there's the Hue are confronted to the reverse problem you.",
            "You observe a graph and you want to understand.",
            "If it was generated by such model, you would like to know the parameters under which it was simulated.",
            "So to do so, one way to do so is to use maximum likelihood estimators.",
            "To do so you need.",
            "You will need to complete data likelihood, which is written as this, but this requires the knowledge of the adjacency matrix.",
            "You observe that because you know the values of the edges between some nodes, but also you would also need to know to which class.",
            "Each nodes belong and usually this is not known.",
            "You only observe the values of the ages and not the classes to which each node belongs and instead of."
        ],
        [
            "The complete data likelihood you would need to you would have to deal with the observed data like huge, which is obtained by summing of overall configurations possible for the overall possible configurations, but."
        ],
        [
            "Uh.",
            "This sum is is intractable because you would need to some of our issue of Q classes and N vertices.",
            "There are something like Q to the power N configurations and the sum over Q to the parent configurations is not something you want to do and.",
            "So usually in statistics there is something called the EM algorithm which allows you to deal with this kind of observed data likelihood.",
            "But here this algorithm this algorithm fails because it requires to knowledge of the posterior distribution of the classes to which not belongs.",
            "Given the value of the ages.",
            "And this distribution is not nice, doesn't have a nice form, and so the same strategy doesn't do exactly."
        ],
        [
            "Doesn't do what we want.",
            "The main idea of what proposed in using variational inference is to do some pseudo likelihood maximization.",
            "To do so, we replace the complicated posterior distribution by a simple distribution of the probability for not to belong to a class, and we choose this simple distribution in such a way that the kullback Leiber distance between these complicated object and the simple object is smaller."
        ],
        [
            "But basically we optimize something which is.",
            "Functional of or simple distribution and which can be written as the quantity we would like to optimize, minus the distance between the simple distribution and the complicated distribution."
        ],
        [
            "At best, if the sample distribution is equal to the complicated distribution, there's nothing to do.",
            "We just automate with just maximizing the likelihood, but of course.",
            "But of course, if we were able to deal with this distribution, there would be nothing to do, so we stick with simple distributions for which this functional is attractable.",
            "This is exactly the same as doing we would like to maximize or quantity over this big space, because the real maximum is likely to like here, but we can only deal with these smaller space, and so we choose a point in this small space so that the distance between this object.",
            "And the object we will select is."
        ],
        [
            "Smallest possible.",
            "We do so we use a two step iterative algorithm.",
            "In the first step we optimize or functional with respect to the distribution, so we restricted ourselves to comfortable classes of function.",
            "The class of functions we choose is the completely factorized out completely factorized distributions.",
            "Basically we will.",
            "Consider a multinomial parameter for each vertice in the graph and we will try to.",
            "This multinomial parameter gives the probability that these vertices belong to each of the groups that I've used in my analysis, and we want to select these parameters so that the likelihood in the end is.",
            "As high as possible.",
            "Doing some straightforward computation we obtained at the this this so that the probability that not I belong to class Q given the value on the edges.",
            "Is just the solution of a fixed point equation and once we have the these parameters, we."
        ],
        [
            "Optimize or functional with respect to the parameters of the model that are.",
            "That is, the mixture proportions and the connectivity matrix.",
            "The mixture proportion as mixture proportion are subject to the constraint that we sum up to one and then.",
            "Just a small comment on this one today, the.",
            "Connectivity for the connectivity parameter for an edge linking and not from Group 2, two and two and out from Group L. It's written as a mark of something which is not nice, but for classical distributions all the distributions I talked before in my my talk, we have a closed expression of this parameter."
        ],
        [
            "Then there is the question of the model selection.",
            "I'm telling you that we have a model in which we have two classes and we don't know exactly how many classes during the model before hand.",
            "So we have to decide exactly how many classes we will use, and we do so using statistical criterion, which is big like and I don't want to enter into the details.",
            "What we do is that.",
            "We want to maximize the likelihood of or.",
            "Or data given a model, but we want to give.",
            "We want to penalize the model if it's too complicated, because obviously complicated model will fit the data better, but it might be only because it's more complicated, so we just we use a penalized likelihood criterion to decide the number of groups Hindi."
        ],
        [
            "And the so to study the validity of our model.",
            "We did some simulations and we simulated some graphs under our model and then used our estimates and then tried to find back to the parameters of our model with the method we proposed and the simulation setup with.",
            "You use this in undirected graph with free classes."
        ],
        [
            "We have a person valued edges."
        ],
        [
            "Use some different different number of."
        ],
        [
            "We used different number of different proportion mixtures from very balanced classes to very unbalanced."
        ],
        [
            "And then we used some.",
            "Strange connectivity metrics with the same connectivity metrics with the same.",
            "Value for all the diagonal terms.",
            "an A multiplier on the extra diagonal terms.",
            "This gamma includes the difficulty of the problem.",
            "If gamma is equal to 1, then all classes have exactly the same connectivity pattern and we are very hard to distinguish if gamma is very different from one, then the classes are very different connectivity patterns and there are quite easy to distinguish and the Lambda is just the mean value of an edge and then we did some.",
            "100 repeats for each setup."
        ],
        [
            "And the we tried to, we computed the root mean square error for all the estimates."
        ],
        [
            "And then.",
            "OK, I don't know if you can see anything or well well for the mixture proportions an for the value of the connectivity matrix.",
            "We see that in the hard case small number of vertices, small manage value and free similar class.",
            "Very similar classes and very unbalanced classes.",
            "The MSO is quite high, which means that you don't have a good estimates of the parameters or ask for the.",
            "Easy for the easy case that is a lot of nodes.",
            "High mean edge value.",
            "Very different classes and balanced and balanced classes.",
            "The FMC is quite small, which means that you have good estimates."
        ],
        [
            "Your parameters and then we try to be and we did the same for selecting the number of classes.",
            "So we used undirected graph with three classes, different number of vertices.",
            "What proved to me the main case in the previous study and the.",
            "For each case we did 100 repeats and each time we retrieved the queue that maximized or penalized or penalized likelihood criterion, and then."
        ],
        [
            "You can see in this table for 50 vertices, retrieve the good number of classes only 17% of the time, whereas for a higher number of vertices you retrieve the good number of classes with a higher frequency and the this is not surprising because you have only a small number of vertices and or penalized criterion wants to select the model, which is quite economical into a number of permit."
        ],
        [
            "And so, to conclude, I would just want to say that the mixture graph is a simple way to simulate networks that you can use many distributions in this graph to model different kinds of networks that you have a probabilistic model which captures some features of real networks.",
            "This is this.",
            "Data not shown mean that we used or a model to capture some features of real data, but I couldn't put them in the slides because I don't have much time and I don't.",
            "Well, because of time constraints and we have some variational approach is just to compute pseudo likelihood estimators and we have a statistical criterion to choose the number of classes which is not offend the case in which is not always the case in mixture models and I'm done.",
            "So I'll probably hand here."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you, I'm going to talk about some variational approach to uncover structuring valued graphs.",
                    "label": 0
                },
                {
                    "sent": "This is some work I've been doing with my advisor.",
                    "label": 0
                },
                {
                    "sent": "Silva has my lab Apple pie taking.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Chris, so I'm going first to explain exactly what I'm doing, what I'm doing and then talk about the model we're using.",
                    "label": 0
                },
                {
                    "sent": "It's a mixture model and graphs and then about the parametric estimation.",
                    "label": 0
                },
                {
                    "sent": "Exactly how do we estimate the parameters that are used in the model and then present a simulation study which is supposed to validate the?",
                    "label": 0
                },
                {
                    "sent": "The parametric estimation.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the models so.",
                    "label": 0
                },
                {
                    "sent": "I'm not everybody knows why networks are important and why and why we want to study networks, so I'm not.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to skip that slide and I'm going to introduce some notations that I need so.",
                    "label": 0
                },
                {
                    "sent": "In a graph, you need a set of vertices, a set of edges and what is usually called the adjacency matrix, which is the matrix which includes the value of all the edges between between between the words.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for example, in this in this graph you have 1 two free vertices.",
                    "label": 0
                },
                {
                    "sent": "You have 123 edges, an the adjacency matrix would look like this.",
                    "label": 1
                },
                {
                    "sent": "That is, the value of the edge connecting one to two.",
                    "label": 1
                },
                {
                    "sent": "That's this one would be for and exactly the same for all.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other edges in the graph.",
                    "label": 0
                },
                {
                    "sent": "So in our mixture model we want to introduce some heterogeneity in the vertices, But the main idea is that the vertices are not all the same.",
                    "label": 0
                },
                {
                    "sent": "We have some characteristics which differ among the vertices, so we suppose that the vertices are distributed among some classes, Q classes, and that's not in the classes as some connectivity properties and that the connectivity properties change with the classes.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to model this, we have to introduce a hidden variable which basically tells us if you pick a node.",
                    "label": 0
                },
                {
                    "sent": "That I means is the class in which tells you which class your vertices belongs to, and so the proportion of vertices belonging to class small Q would be Alpha, Q an.",
                    "label": 0
                },
                {
                    "sent": "We suppose that that that is the class of nod of vertices.",
                    "label": 0
                },
                {
                    "sent": "I is just drawn following a multinomial.",
                    "label": 0
                },
                {
                    "sent": "With the parameter Alpha.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, if you consider an example for eight nodes Anna free classes, one example of proportion parameters would be 1/4, one, 4th, 1/2, and you could have this kind of realization.",
                    "label": 0
                },
                {
                    "sent": "This kind of realization, and so we now have a way to we now have some classes for our nodes.",
                    "label": 0
                },
                {
                    "sent": "We just have to specify exactly how we put some values in the on the edges.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Prograf so.",
                    "label": 0
                },
                {
                    "sent": "To do so, we have to specify the distribution of the adjacency matrix and what we what we say is just that the value of edge of the edge xig depends on the class of, not I an on the class of, not G. So the class the value of the edge between I and G is drawn following a distribution which depends on the parameter which is completely.",
                    "label": 0
                },
                {
                    "sent": "Classified by the class of the first node and the second node, and so to get all the information you need to.",
                    "label": 0
                },
                {
                    "sent": "For example, simulate some graphs.",
                    "label": 0
                },
                {
                    "sent": "You need to specify all the connectivity parameters and OK, forget this line.",
                    "label": 0
                },
                {
                    "sent": "I should have removed it and forgot to do so and then.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I.",
                    "label": 0
                },
                {
                    "sent": "Give you an example.",
                    "label": 0
                },
                {
                    "sent": "I made mistakes also in this one, so I'm going to present an example to do exactly what we tell.",
                    "label": 0
                },
                {
                    "sent": "Suppose we have exactly 3 classes in the graph.",
                    "label": 0
                },
                {
                    "sent": "The squares, the circles and triangles, and we have this connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "Suppose that the edges are drawn following your question distribution with mean them in that are specified in the adjustments in this connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "What happens when you want to draw an edge from a triangle to triangle the value of?",
                    "label": 0
                },
                {
                    "sent": "An edge from triangle to triangle is a question is a expression values with mean zero?",
                    "label": 0
                },
                {
                    "sent": "So you expect you expect all edges going from triangle to triangle to have value 0.",
                    "label": 0
                },
                {
                    "sent": "So we don't represent them in the graph.",
                    "label": 0
                },
                {
                    "sent": "Then you want to do some edges from a triangle to square.",
                    "label": 0
                },
                {
                    "sent": "This would follow a personal distribution with mean.",
                    "label": 0
                },
                {
                    "sent": "Nine so you expect some most of the edges to have value, which is 1 or higher.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is exactly what happens and you have some edges with value 1, some edges with value 2, a few edges we value free or more than that, and then you do the same for all the other edges and then also the edges from a triangle to square.",
                    "label": 0
                },
                {
                    "sent": "Since the mean is only .25, we expect not all of them you expect most of them to have value 0.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then them, but also some of them quite value one, and eventually the future value.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two and.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually the same for all the kind of edges in.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rough.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what's the advantages of giving some value to an edge?",
                    "label": 1
                },
                {
                    "sent": "First, you can deal with valued graphs, which is quite an advantage and you can use any probability distribution.",
                    "label": 1
                },
                {
                    "sent": "I will come back to do any a bit later and.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can use for example Bernie if the only information you're interested in is the absence or the presence of.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then you can use a multinomial if you're interested in the nature of the match.",
                    "label": 1
                },
                {
                    "sent": "For example, if you consider a social network, you would like to specify if the connection is a friendship loveship or.",
                    "label": 0
                },
                {
                    "sent": "If the Oracle.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then you can use some quest wages, for example in Co authorship networks, the number of Co published paper is a natural integer, so.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My son will be good and.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can use some motions and vibrate.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oceans and anything.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Think about so mixture model is a good way, too easy.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To generate valued graphs, but once you have generated a graph, there's the Hue are confronted to the reverse problem you.",
                    "label": 0
                },
                {
                    "sent": "You observe a graph and you want to understand.",
                    "label": 0
                },
                {
                    "sent": "If it was generated by such model, you would like to know the parameters under which it was simulated.",
                    "label": 0
                },
                {
                    "sent": "So to do so, one way to do so is to use maximum likelihood estimators.",
                    "label": 1
                },
                {
                    "sent": "To do so you need.",
                    "label": 0
                },
                {
                    "sent": "You will need to complete data likelihood, which is written as this, but this requires the knowledge of the adjacency matrix.",
                    "label": 1
                },
                {
                    "sent": "You observe that because you know the values of the edges between some nodes, but also you would also need to know to which class.",
                    "label": 0
                },
                {
                    "sent": "Each nodes belong and usually this is not known.",
                    "label": 0
                },
                {
                    "sent": "You only observe the values of the ages and not the classes to which each node belongs and instead of.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The complete data likelihood you would need to you would have to deal with the observed data like huge, which is obtained by summing of overall configurations possible for the overall possible configurations, but.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "This sum is is intractable because you would need to some of our issue of Q classes and N vertices.",
                    "label": 0
                },
                {
                    "sent": "There are something like Q to the power N configurations and the sum over Q to the parent configurations is not something you want to do and.",
                    "label": 1
                },
                {
                    "sent": "So usually in statistics there is something called the EM algorithm which allows you to deal with this kind of observed data likelihood.",
                    "label": 1
                },
                {
                    "sent": "But here this algorithm this algorithm fails because it requires to knowledge of the posterior distribution of the classes to which not belongs.",
                    "label": 0
                },
                {
                    "sent": "Given the value of the ages.",
                    "label": 0
                },
                {
                    "sent": "And this distribution is not nice, doesn't have a nice form, and so the same strategy doesn't do exactly.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Doesn't do what we want.",
                    "label": 0
                },
                {
                    "sent": "The main idea of what proposed in using variational inference is to do some pseudo likelihood maximization.",
                    "label": 1
                },
                {
                    "sent": "To do so, we replace the complicated posterior distribution by a simple distribution of the probability for not to belong to a class, and we choose this simple distribution in such a way that the kullback Leiber distance between these complicated object and the simple object is smaller.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But basically we optimize something which is.",
                    "label": 0
                },
                {
                    "sent": "Functional of or simple distribution and which can be written as the quantity we would like to optimize, minus the distance between the simple distribution and the complicated distribution.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At best, if the sample distribution is equal to the complicated distribution, there's nothing to do.",
                    "label": 0
                },
                {
                    "sent": "We just automate with just maximizing the likelihood, but of course.",
                    "label": 0
                },
                {
                    "sent": "But of course, if we were able to deal with this distribution, there would be nothing to do, so we stick with simple distributions for which this functional is attractable.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the same as doing we would like to maximize or quantity over this big space, because the real maximum is likely to like here, but we can only deal with these smaller space, and so we choose a point in this small space so that the distance between this object.",
                    "label": 0
                },
                {
                    "sent": "And the object we will select is.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Smallest possible.",
                    "label": 0
                },
                {
                    "sent": "We do so we use a two step iterative algorithm.",
                    "label": 1
                },
                {
                    "sent": "In the first step we optimize or functional with respect to the distribution, so we restricted ourselves to comfortable classes of function.",
                    "label": 0
                },
                {
                    "sent": "The class of functions we choose is the completely factorized out completely factorized distributions.",
                    "label": 1
                },
                {
                    "sent": "Basically we will.",
                    "label": 0
                },
                {
                    "sent": "Consider a multinomial parameter for each vertice in the graph and we will try to.",
                    "label": 0
                },
                {
                    "sent": "This multinomial parameter gives the probability that these vertices belong to each of the groups that I've used in my analysis, and we want to select these parameters so that the likelihood in the end is.",
                    "label": 0
                },
                {
                    "sent": "As high as possible.",
                    "label": 0
                },
                {
                    "sent": "Doing some straightforward computation we obtained at the this this so that the probability that not I belong to class Q given the value on the edges.",
                    "label": 1
                },
                {
                    "sent": "Is just the solution of a fixed point equation and once we have the these parameters, we.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Optimize or functional with respect to the parameters of the model that are.",
                    "label": 0
                },
                {
                    "sent": "That is, the mixture proportions and the connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "The mixture proportion as mixture proportion are subject to the constraint that we sum up to one and then.",
                    "label": 0
                },
                {
                    "sent": "Just a small comment on this one today, the.",
                    "label": 0
                },
                {
                    "sent": "Connectivity for the connectivity parameter for an edge linking and not from Group 2, two and two and out from Group L. It's written as a mark of something which is not nice, but for classical distributions all the distributions I talked before in my my talk, we have a closed expression of this parameter.",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then there is the question of the model selection.",
                    "label": 1
                },
                {
                    "sent": "I'm telling you that we have a model in which we have two classes and we don't know exactly how many classes during the model before hand.",
                    "label": 0
                },
                {
                    "sent": "So we have to decide exactly how many classes we will use, and we do so using statistical criterion, which is big like and I don't want to enter into the details.",
                    "label": 0
                },
                {
                    "sent": "What we do is that.",
                    "label": 0
                },
                {
                    "sent": "We want to maximize the likelihood of or.",
                    "label": 1
                },
                {
                    "sent": "Or data given a model, but we want to give.",
                    "label": 0
                },
                {
                    "sent": "We want to penalize the model if it's too complicated, because obviously complicated model will fit the data better, but it might be only because it's more complicated, so we just we use a penalized likelihood criterion to decide the number of groups Hindi.",
                    "label": 1
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the so to study the validity of our model.",
                    "label": 0
                },
                {
                    "sent": "We did some simulations and we simulated some graphs under our model and then used our estimates and then tried to find back to the parameters of our model with the method we proposed and the simulation setup with.",
                    "label": 0
                },
                {
                    "sent": "You use this in undirected graph with free classes.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a person valued edges.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Use some different different number of.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We used different number of different proportion mixtures from very balanced classes to very unbalanced.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we used some.",
                    "label": 0
                },
                {
                    "sent": "Strange connectivity metrics with the same connectivity metrics with the same.",
                    "label": 0
                },
                {
                    "sent": "Value for all the diagonal terms.",
                    "label": 0
                },
                {
                    "sent": "an A multiplier on the extra diagonal terms.",
                    "label": 0
                },
                {
                    "sent": "This gamma includes the difficulty of the problem.",
                    "label": 1
                },
                {
                    "sent": "If gamma is equal to 1, then all classes have exactly the same connectivity pattern and we are very hard to distinguish if gamma is very different from one, then the classes are very different connectivity patterns and there are quite easy to distinguish and the Lambda is just the mean value of an edge and then we did some.",
                    "label": 1
                },
                {
                    "sent": "100 repeats for each setup.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the we tried to, we computed the root mean square error for all the estimates.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't know if you can see anything or well well for the mixture proportions an for the value of the connectivity matrix.",
                    "label": 0
                },
                {
                    "sent": "We see that in the hard case small number of vertices, small manage value and free similar class.",
                    "label": 0
                },
                {
                    "sent": "Very similar classes and very unbalanced classes.",
                    "label": 0
                },
                {
                    "sent": "The MSO is quite high, which means that you don't have a good estimates of the parameters or ask for the.",
                    "label": 0
                },
                {
                    "sent": "Easy for the easy case that is a lot of nodes.",
                    "label": 0
                },
                {
                    "sent": "High mean edge value.",
                    "label": 0
                },
                {
                    "sent": "Very different classes and balanced and balanced classes.",
                    "label": 0
                },
                {
                    "sent": "The FMC is quite small, which means that you have good estimates.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Your parameters and then we try to be and we did the same for selecting the number of classes.",
                    "label": 0
                },
                {
                    "sent": "So we used undirected graph with three classes, different number of vertices.",
                    "label": 1
                },
                {
                    "sent": "What proved to me the main case in the previous study and the.",
                    "label": 1
                },
                {
                    "sent": "For each case we did 100 repeats and each time we retrieved the queue that maximized or penalized or penalized likelihood criterion, and then.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can see in this table for 50 vertices, retrieve the good number of classes only 17% of the time, whereas for a higher number of vertices you retrieve the good number of classes with a higher frequency and the this is not surprising because you have only a small number of vertices and or penalized criterion wants to select the model, which is quite economical into a number of permit.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so, to conclude, I would just want to say that the mixture graph is a simple way to simulate networks that you can use many distributions in this graph to model different kinds of networks that you have a probabilistic model which captures some features of real networks.",
                    "label": 1
                },
                {
                    "sent": "This is this.",
                    "label": 0
                },
                {
                    "sent": "Data not shown mean that we used or a model to capture some features of real data, but I couldn't put them in the slides because I don't have much time and I don't.",
                    "label": 1
                },
                {
                    "sent": "Well, because of time constraints and we have some variational approach is just to compute pseudo likelihood estimators and we have a statistical criterion to choose the number of classes which is not offend the case in which is not always the case in mixture models and I'm done.",
                    "label": 0
                },
                {
                    "sent": "So I'll probably hand here.",
                    "label": 0
                }
            ]
        }
    }
}