{
    "id": "m5zw2ycgr7qycrr2kstbrxonkl4b6476",
    "title": "Towards a Smarter Web",
    "info": {
        "author": [
            "Wendy Hall, University of Southampton"
        ],
        "published": "Aug. 23, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/ijcai2011_hall_smarterweb/",
    "segmentation": [
        [
            "K as a huge troop of Jennings students around or ex students of Jennings.",
            "And because I felt I had, I had to sort of be semi awake for this morning.",
            "As I said, I'm not an AI researcher per say, or they'll have mixed with AI researchers for most of my career.",
            "In fact, it's a very little known fact that I'm a pure mathematician originally, that's not that's quite well known, but I did an M SC in computer science as I converted from pure maths too.",
            "Computer science and that was in Prolog and in fact I used to meet Bob Kowalski in those days when he was in.",
            "I don't need Bob's here this morning, but it would be lovely to say hello to him.",
            "At the coffee break.",
            "I also note in my bio that I'm a lot of was, as you know in in in a, well in Prolog and it was always everything is a something well invite bio.",
            "Some typos got through and I'm clearly a was a lots of things.",
            "Anyway I tell stories I just I was just interested to.",
            "I'm going to tell you stories this one and that's how I usually do my talks rather than over structure them.",
            "But I was just noting that each car is 22 years old.",
            "So that means if my math is correct I was a pure mathematician, not a Calculator.",
            "It's 1989 is that the first Times 269?",
            "Oh gosh, OK I was gonna say about as old as the web, but that's not truth.",
            "And of course AI is a lot older than the web and I was working out 89.",
            "OK, so that's that's of course you only have it every other year.",
            "So anyway, I want to.",
            "I want to talk to you about towards a smarter web, but there won't be a lot of intelligence in this talk.",
            "I'm basically going to tell you about how I have perceived.",
            "The web evolving and how I perceive it."
        ],
        [
            "Evolving in the future.",
            "Um?",
            "I was, as I say, I was in pure mathematician turned computer Sciences via prologue.",
            "And in the late 80s around 1987, I started to discover this thing called high."
        ],
        [
            "Text.",
            "I read in 1987 I read Vannevar Bush is paper, which I'm sure many of you here would have read.",
            "As you may think, this is one of the things that really got me going.",
            "Towards this whole idea of linking things together, I'm a great networker.",
            "Socially, as well as in my research, and I I just enjoy this."
        ],
        [
            "Concept that everything could be linked together the same year I met these two guys.",
            "Ted Nelson, who invented the terms hypertext and hypermedia in the 1960s.",
            "On the phrase, everything is deeply into twinkled.",
            "And Doug Engelbart invented the mouse windows pointing, clicking very revolution at the time.",
            "In 1967, he gave the famous demo of his mouse pointing at a piece of text on a computer and moving to another piece of text.",
            "The first sort of hypertext demo over the Internet, 1967 is a famous video of that.",
            "I did think about showing it, but I chose another video to show you.",
            "He is his, for he.",
            "He built the augment system.",
            "I should have said, of course, that Bush is system he describes in the Atlantic Monthly, which is so precious."
        ],
        [
            "It was the mimics the memory extender.",
            "All of this was about the human brain doing the real powerful stuff and machines or venting."
        ],
        [
            "And his dog and robot system was called augmented.",
            "It's all meant in the human Internet using the power of machines to augment them."
        ],
        [
            "Power of our brains.",
            "And then what really got me going was in 1987, which was the year Hypertexts came of age.",
            "First, hypertext conference was in 1987.",
            "I didn't attend it, but I met all the people who started it in that year or most many of them.",
            "And it was.",
            "The Rapper was released on their new Mac machines.",
            "The a hypertext stack Maker program which they at the last minute, called Hypercard.",
            "Which sort of got the media attention about this hyper thing and the BBC in their wisdom.",
            "Gosh, I can't believe UK what is happening at home with all our police resigning.",
            "Anyway, that's another whole story about BBC and Media and Rupert Murdoch and so on.",
            "But the BBC then Wisdom made a program called Hyper Land and I'm gonna, it's it was all about everything to do with hyper.",
            "This is in 1987, so it's long before the web.",
            "It's long before we even invented the term logging out, you know.",
            "They seem in evolutionary terms of for the web.",
            "If we even didn't talk about multimedia in those days, I I hope the sound will work.",
            "I'm just going to show you this clip, which is pretty."
        ],
        [
            "Self explanatory.",
            "Hope this sound works.",
            "The same boring old television England cricket team is in deep trouble.",
            "Are you tired of linear non interactive television, Mr. Miss Adams?",
            "Tom Baker Dr of course.",
            "Are you tired?",
            "Mr Adams of assorted television.",
            "It just happens at you.",
            "Could you just sit in front of like a couch potato?",
            "That doesn't involve you.",
            "Interact.",
            "Wait a minute.",
            "Thank you mean.",
            "Hello I'm just him.",
            "My name is Tom and now your agent.",
            "May I ask if you know what that means?",
            "You want 15%.",
            "You know every slightest bidding to fetch and carry for you, to work tirelessly and selflessly on your behalf.",
            "Always ready always will be no drop too small or too big.",
            "You sure you mean Agent?",
            "I mean that I'm a software agent.",
            "I am merely a small Akron, artificial and completely customizable personality and I only exist as what we call an application in your computer.",
            "I have the honor to provide instant access to every piece of information stored digitally anywhere in the world.",
            "Any picture or fill any sound, any book, any statistic, any fact.",
            "Connection between anything you care to think.",
            "You've only to tell me and it will be my humble to to find it for you and present it to you for your interactive pleasure.",
            "Is there anything I can do for you now, Mr Adams?",
            "Yes, you can stop being so obsequious.",
            "For start it will be my very great and profound pleasure to be less obsequious or master.",
            "I am, as I have mentioned, you'll undergo fully customized.",
            "Allow me to present you with my control panel.",
            "Would you care to talk to me in any way which takes your fancy?",
            "Just constant primitive control.",
            "OK, Buster, what do you want now?",
            "Get up bloody move on contact.",
            "Good.",
            "Welcome back to find out now brother enjoying this.",
            "What else can we change?",
            "I could just.",
            "There's another 40 minutes of that.",
            "I could just play that and we'd all be happy and go to coffee.",
            "I think that was a great keynote.",
            "20 odd years later, it's still.",
            "They use the concept of the agent to explain hypertext, and the idea of a global information system where you could ask for information and something somebody.",
            "Would find it for you very.",
            "I thought that was so appropriate after the robot in the opera yesterday.",
            "And anyway, that was this an I saw that later I thought I want to build that system.",
            "And really, that's."
        ],
        [
            "That's sort of where that's what driven me forward.",
            "Now the same year.",
            "This man's archives, arriving in Southampton, what am I telling you?",
            "This?",
            "So Mountbatten of Burma famous man in English history he's very related to the to the Royal family.",
            "Last Viceroy of India, First Sea Lord of the animal?",
            "T that sort of thing.",
            "His family lived just up the road from the University of Southampton."
        ],
        [
            "And in 1987 his archived arrived in the University of Southampton.",
            "Now there are many people that say that is my shoe collection.",
            "That's me in the archive in 1987, with one of the pictures from the archives.",
            "So that is not my shoe collection, although my husband would say it's closely resembles it.",
            "This is the archive.",
            "It's all paper photographs.",
            "Old cinematic movie reels and the old records.",
            "So my concept was to write well, digitize all that.",
            "Put it on a computer and link it all together using this new hypertext hypermedia stuff.",
            "Not thinking that in 10 years time we would be contemplating vast arrays of information.",
            "This is about 50,000 documents documents which seemed huge and we never digitized it all.",
            "In fact, Copyright defeated us more than anything.",
            "But of course, we've moved into a world since then where things are created digitally, and this hypertext stuff, together with some rather clever software, enables us to move around huge huge amounts of information on the interweb on the Internet through the web.",
            "So that's how I started my career and I started design."
        ],
        [
            "In this system we call microcosm.",
            "And this is and I'm going to get Fast forward to the present in awhile, but this was quite revolution.",
            "It's time we had really neat ways of making links you could point to something in one document and point to another model document and say, create me a link.",
            "The links were."
        ],
        [
            "Stalled in Ohio."
        ],
        [
            "Yeah, I've got them in the wrong order here, I suppose.",
            "But this these are slides taken from that.",
            "I'm using the Mountbatten Archives and the sort of interface we had where you had a drop down menu like in Word and you clicked on what you wanted to do with the information.",
            "So my idea was that anything it appeared on the screen was potentially the beginning of a link and you'd want to find out what it meant.",
            "So who was this?",
            "Mr Patel who was at this meeting with Mountbatten in Viceroy House in India?",
            "And I would follow links to maybe a definition or description of what the document was about.",
            "I could make links, I could compute links by using information retrieval techniques.",
            "All those sorts of things.",
            "So it was a two step process, a menu and."
        ],
        [
            "Uclick we were trying to do things I was trying to create associative links and in the book I wrote David Lowe.",
            "We talk about that as is the instantiation of a semantic relationship, and so I didn't know it.",
            "But I was working in the semantic web."
        ],
        [
            "And we kept our links in databases or we called them link basis because I remember someone in the database community saying these are just flat files are not databases, so you can't call in databases.",
            "So we coined the terms term link base but the concept was that the hyper structure was separable from the documents.",
            "So you could and we also have this idea that you could send link basis to other people.",
            "So here's my set of links for this.",
            "This last night the robots saying I'm in the music script today.",
            "This is my links for history.",
            "The Mountbatten.",
            "You can apply these to documents that you.",
            "You have or anybody has in the world and we always talked about it.",
            "Working on the Internet.",
            "But we were doing our work on a on a windows based PC.",
            "And the idea was that you could make very generic links.",
            "You could define links generically on words or phrases or pictures to describe things and have those links work anywhere.",
            "Those words or pictures or."
        ],
        [
            "Bits of audio existed.",
            "This is the architecture you can read all about it in the many papers that we published in the early 90s about this system we had viewers which I guess we've called browsers today is that we had to have a different viewer for different types of media.",
            "It all got munged up in this control system, which is one of our big mistakes.",
            "'cause that was too much of a blip.",
            "Black box.",
            "And then we have this system of filters at the back end.",
            "They were serially connected and every message.",
            "So if the user said I want some information about this, the Honorable Patel who was at this meeting in India then it would go through the filters to find that if there was any information in either a link base we had a Prolog rule base in there we had SQL databases.",
            "Basically for me this was a plug and play system for my PhD systems are students so they could alright different filters and try them out.",
            "We had filters for doing links in different types of media and then when the filter system.",
            "Munch through it would send the information back to the user as as a list of links.",
            "How familiar is that?",
            "And back to the browser, and so these are that this is the information you might be interested in.",
            "We thought it was pretty cool and actually some of."
        ],
        [
            "It is still pretty cool.",
            "The key thing was the links for triples.",
            "They had a source or destination and a description and the beginning and end of those links didn't have to be fixed points.",
            "They could be computed.",
            "They could be functional and the description was meant to be where the clever stuff went, but we didn't have any of those AI researchers in the in Southampton at the time, so we sort of just had text descriptions because we're engineers.",
            "We like building systems.",
            "But the thing was that the biggest problem we had in those days was getting people to create links because it was actually not an exciting thing to do.",
            "We were trying to say the story and make links between interesting documents that tell the story of what was happening.",
            "We had one or two people do that, but it was very hard to get people to make a lot of links and with our system you could make lots of lots of links very easily and and meaningfully.",
            "So we used to used natural language processing to generate metadata for the documents and then link at the metadata level to get some linking between documents so that people could start to bootstrapping user system and it all sort of fell out.",
            "It was really."
        ],
        [
            "We need stuff so we went to Paris to the Hypertext conference in Paris."
        ],
        [
            "In 1990 with our paper about the web, and that's where I first met Tim.",
            "This is Tim here on the right saying probably it was a December 1990 and he actually put the first web server up that Christmas Day that year.",
            "He hadn't.",
            "It wasn't called the web when we met him in 1990.",
            "He's explaining to my colleague Andrew Fountain.",
            "How big is links are, I guess, how big the web's gonna be.",
            "This is Robert Caio here, who he and Tim worked at CERN to develop the web in its infancy.",
            "This is my PhD student in he's who wrote the first person microcosm.",
            "This is Ian's grey leather jacket that he wore through most of his time at Southampton and that's his grey and the jacket here.",
            "And that's me.",
            "So that's the link to the fact that I was at the same conference.",
            "It's actually recorded on the web that we both they didn't present the paper.",
            "I don't think then, no, they didn't.",
            "We presented, but you can see the list of attendees at the conference on the Web.",
            "And it was a very sort of wow.",
            "This is when stuff are going to mode.",
            "There were several systems bubbling up at the time.",
            "There's another one that's still on.",
            "The girl got a system called was called Hypergiant University Grass, which was also at more like the web than the microcosm was.",
            "It was it worked on the Internet and had protocols, but why didn't it didn't?",
            "It's not the one that."
        ],
        [
            "The web is the one that one, so we all trooped off to Texas in 91.",
            "For the ACM hypertext, they were, they were.",
            "Alternating Europe and US.",
            "The high tech conferences in new essays and then I don't have any pictures of Texas, but I do remember several things about this.",
            "Is the ACM hypertext comments that famously rejected Tim's paper about the web, but as Tim would say, it wasn't a very good paper, but it was describing the system of which all future hypertext research was going to be done.",
            "And.",
            "I also remember because they we they rejected our paper, our second papers as well as Tim.",
            "So I let you know what you do when you have a paper rejected you, put in a post or a demo so Tim and Robert put put in a demo of the web and we put a demo of microcosm.",
            "And the third thing I remember is this is Texas in December, but the post the reception for the posters and demos was outside in the courtyard and there was a tequila fountain outside so everyone was outside drinking margaritas.",
            "There are very few people inside.",
            "Looking at the first demo of the web in the US on the Internet, which Tim had to pay for on his credit card, 'cause of course in the hotel the Marriott in San Antonio had no Internet connection in those days.",
            "We I remember standing with Peter Brown who developed guys the hypertext system looking over Tim and Shoulders.",
            "He demo'd what he was, then calling the World Wide Web, thinking how pretentious to call it the World Wide Web site.",
            "the World Series baseball yeah and and there's nothing very new here is there?",
            "I mean this is very primitive hypertext concert compared to the clever stuff we're doing.",
            "This is just going to go nowhere anyway.",
            "Of course, the next year in Europe there were web demos all over the place, and by the time we went back Type 693 in Seattle.",
            "Um?",
            "I think half the demos then were the web.",
            "The web was already becoming the dominant hypertext system."
        ],
        [
            "By 93 and so was born the webs, the most successful information architecture in history.",
            "This is the Tim's famous document he wrote in 1989 to his bosses talk to his boss Mike Sendall, describing an information management system.",
            "He wanted to build, and Microsoft famously wrote at the top.",
            "Vague but exciting.",
            "And go Tim permission to develop it as part of his work or it wasn't his job son, but he gave him permission to develop it at CERN.",
            "And of course Sir, and also the other so many things happened around that time.",
            "But by the time it came to the early 90s and soon realized what they had, they gave permission to it for it to be given away.",
            "Many of you will be old enough to remember the ways we used to get documents on the web before on the Internet before the web there was Gopher and WAIS and or we FTP of course.",
            "There was a time when it looked like Gopher was going to be the system we used to get documents on the web.",
            "It wasn't hypertext, but it was a way of downloading documents very easily, but they made the mistake of famous, famously making mistakes.",
            "Then we might charge for this.",
            "And there was a move of the herd away from Gopher towards the web."
        ],
        [
            "1994 as the web really began to emerge into the public, consciousness will certainly into the science community's consciousness and the media to certain extent.",
            "Nice size 4.",
            "We launched a company to sell microcosm.",
            "How Daft was that?",
            "We actually made quite a bit of money out of it because it was used for very specific training purposes, but it wasn't the IT didn't become the ubiquitous hypertext system.",
            "We thought it might.",
            "So many things that Tim got right and we got wrong.",
            "We had a proprietary black box system at the heart of microcosm.",
            "Everything that Tim did was given away.",
            "It was open, it was free and universal, and his thesis was that that's the only way to build a global hypertext system.",
            "Now he's we can't say he's been proved right because we've had one experiment and it's quite difficult to re run that experiment.",
            "We now all know the web and it has become the dominant standard, but it's certainly right so far that those are the rules by which these global information systems develop.",
            "You have to give their protocols have to be open, have to be free.",
            "I mean, imagine if Bill, if Tim had been a Bill Gates type character, the web would be.",
            "It may exist, but it would be very differently.",
            "It would probably be owned by Microsoft because he probably would have sold it to Microsoft.",
            "Something like that.",
            "I mean, think about what might have happened.",
            "We'd be paying per click, or certainly paying to download the software.",
            "It might have been a very different place.",
            "It would have been a very different place, but the interesting thing is what type of place would it have been?",
            "Because we could still kill the web as it is now.",
            "The pressures on it are significant in terms of what countries want to do with net neutrality and was the country that just passed the law about.",
            "Since training.",
            "Net neutrality is one of the Scandinavian countries.",
            "So important, we keep this level playing field across the world, or it could.",
            "And there's many ways we could we could kill it in terms of the way it's used, but one has to sort of argue and this is a thought experiment.",
            "If we did kill the web as it is today, would another one bubble up?",
            "You know you saw what happened with Egypt when the Internet was turned off immediately?",
            "People they know what they've lost now, and so we are assuming beings.",
            "We our.",
            "I think our basic needs communication.",
            "I mean one of the worst things you can do to human being is put them in solitary confinement.",
            "We need to communicate, so why wouldn't people want to?",
            "Once they've known this type of system, re always have it around the other things that there are many, many things you can put together to say why the web became ubiquitous system.",
            "But one of them was that Tim got the network really before most of the hypertext researchers, not all.",
            "As I say, the hyper do system ran on the Internet, but their system meant that every link had to go through their control system because in those days the hypertext community.",
            "Had proved categorically by in this research papers published to this effect that, if links in a system failed, people wouldn't use it.",
            "Now these were we were.",
            "This taught me a lot about evaluation.",
            "We were using systems those days asked our systems.",
            "I'm as guilty.",
            "This anyone that had maybe hundreds of documents and we used to test them with hundreds of users on a PC that wasn't connected to the network and we used to draw conclusions from that when it actually went big went global.",
            "You everybody using it, we actually since the 90s nineties we've had a huge research lab in which to do our experiments where you get the answers more right than wrong.",
            "But one of the key things that the web is taught us, and I know that the AI communities had to go through this various times is that scruffy works.",
            "Error 404 was hugely important in this web.",
            "Because we as human beings are not very good at organizing our information.",
            "Our brain maybe.",
            "But when we try to interact with machines to organize information or even with each other were very poor at tagging, adding metadata at telling assistant when we've moved a file at working out file organization structures that are abstract enough.",
            "I mean the doi.",
            "That's a these abstract layers will help us, but we're really generally very poor.",
            "Organizing information we have to let the links fail to make the things go, otherwise it wouldn't have worked, and we've learned all that really after the fact.",
            "So the web comes along with this very, very primitive hypertext model.",
            "As far as I was concerned, that links were embedded in the document.",
            "They were fixed points at either end.",
            "There was no way of analyzing inferring information about what was linked to walked and, and we lost the conceptual and contextual link and link descriptions that we've been doing with microcosm and others in the hypertext community have been doing, and the web in its early days, and to some extent today, is really a very strangely link this world.",
            "It's quite hard.",
            "It is easy to, you know, make a link with HTML, but it's quite hard to decide what to link to what.",
            "Once you've made it sort of fixed and it's hard, very, very hard to maintain it, which is one of the reasons we argued for separable hyper structures, but that just made the thing so damn complicated for people to get going on.",
            "The other thing was even Tim didn't get his first browsers right in the sense that to always saw that the web is a readwrite environment.",
            "And his first editor was but his first browser was also an editor, and it was quite complicated to use.",
            "And of course the mosaic guys come along NCSA and said right, we're going to make this really simple.",
            "Here's a browser and all you gotta do is type in the URL and click and go.",
            "So there was no faffing around what you had to edit.",
            "It was straight in and for us.",
            "I used to think.",
            "Well, OK, we have that in microcosm, but of course it might cause we had we had a two step process and although that worked in Word, it somehow didn't work for the web and people just wanted to click and go and Mosaic was one of the other reasons that the web took off around that 9394 time.",
            "And of course for awhile there was a bit of a tussle.",
            "The first web conference was in May 1994 because the Chicago Guys had set a.",
            "We're gonna have a mosaic conference in October 1994 and wanted the web to be renamed Mosaic.",
            "I believe it's all in Tim's book, so read the book and you'll see and Robert Robert has a book as well about all this history.",
            "What's now history, reason, recent history, and so Robert and Tim wanted a web conference in certain the home of the web in 1994, it before the one in Chicago.",
            "So they rushed to produce, accomplish since earning may booked an auditorium for 200 people, thinking well, maybe 200 people be interested, but you know, it's a bit of a risk.",
            "And how bosses?",
            "I remember them wiring at the time about whether they'd lose money on the conference course.",
            "What happened was the whole world wants to turn up, and they were.",
            "Having to turn people away and for a while, the web comments was the conference that you had to attend to find out about this stuff.",
            "You don't have to find out about the web at a conference anymore.",
            "You look on the web, but you didn't have a web in those days.",
            "Find out about stuff on the web.",
            "Cause as it grew.",
            "If you imagine beginning courses one web server.",
            "And then there's another and then another, and then more.",
            "And I can remember the first website I saw apart from the CERN one was about dinosaurs in Hawaii, very famous.",
            "So if I wanted to know about dinosaurs, I was fine.",
            "Alright, but once and then you used to know in those days remember you used to know where to look.",
            "Because people told you these are interesting websites.",
            "What book on the 1st search engine is actually were lists of websites and they used to publish the new websites.",
            "Can you imagine that today we got that so wrong that that's what we wanted.",
            "Indexes directories to the web course?",
            "What filled the gap?",
            "Retrospectively."
        ],
        [
            "Well, the search engine's and these guys came along and said we know how to make this work.",
            "They published their paper in 1987.",
            "Web conference about their algorithm written page, their algorithm.",
            "For finding stuff on the web using the inverted matrices and.",
            "Everyone said, wow, that's clever.",
            "That's clever, but you can't harvest the web every day.",
            "It's growing too fast.",
            "How are you going to do that?",
            "So then you had the engineering issue of making of making what they were doing scale and I'm sure you remember it around the time everyone was a bit worried because this Google thing.",
            "They didn't have any adverts and be seemed to work.",
            "When it came out and we're all bit worried that was going to disappear because there was no way of monetizing it.",
            "And.",
            "They of course came up with this very clever way of monetizing it, but they kept the game that was retrospective.",
            "That wasn't all thought out before, and we're seeing it now with the social networks and and so on about.",
            "And of course, what you've learned is you're monetizing what people do with your system, not the actual act selling the application itself.",
            "You have to give it away for free and then build your client base effectively.",
            "So."
        ],
        [
            "So I'll come back to that, but so southhampton, we had to rapidly become a web based hypertext system.",
            "We turned out the link service that was in microcosm into a web based link service called the Distributed Link Service, but it was only distributed as the web was distributed.",
            "We did have I had PhD students who were developing a distributed version of it and we even had a as we start around the end of the 90s.",
            "We attracted Nick Jennings and Nigel Shadbolt come to Southampton so we got the intelligence in the agents.",
            "We named our research group Intelligence agents multimedia.",
            "Nigel was the intelligence Nix the agents and I was the multimedia and that stuck for 10 years.",
            "We never were just just changing it now but we never gave us a great base from which to build.",
            "As a team.",
            "So we were trying to learn about being intelligent from Nigel yes, and from about agents from Nick and learning how our filters would become agents."
        ],
        [
            "And we developed various versions.",
            "Some of you might know Dave Dir or less car from the community, not AI, but the sort of web community.",
            "Did the library community.",
            "All those people, David just gone to Oxford, but the others are all that still at South."
        ],
        [
            "Hampton and we were reffered to in the development of X link as part of XML.",
            "So there was a sort of a note we call ourselves open hypermedia.",
            "There was a sort of an influence community influence there, but excellent was not where we were trying to go.",
            "Excellence was sort of.",
            "You could put the links outside documents but they were still point to point in one way.",
            "The."
        ],
        [
            "Other stuff was still being lost, but I started to discover more about AI part from the fountain.",
            "They cannot see we're bout to move Southampton when I started working with Carol Goebel, who many of you will know and started using the OH word I started to learn about ontologies.",
            "And I can't remember exactly what cozy stood for, isn't it?",
            "Was a Research Council project, but the OH was open.",
            "It was overhyped.",
            "I don't think it's ontologies, actually, but it might have been.",
            "I can't remember now, but it was basically we were using carols, ontologies to decide.",
            "What links to use right?",
            "So again, think about the robot in the scripts last night.",
            "You know this was a here's a script about music, so we use the musiclink basis and we were using ontologies and description logics.",
            "And in is in the audience.",
            "I'm sure who was made that work his own.",
            "Well, sorry, not his own, but has developed the work and an owl and all the things that came out of that type of work.",
            "And this to us was right.",
            "So we're we.",
            "Didn't call it the semantic web then, but I put the date on the night Einstein we were actually thinking about how we were moving to a web that where the link making was more intelligent."
        ],
        [
            "So.",
            "We sort of get to the point where Tim starts talking about the semantic web.",
            "And he had this right back at the very beginning.",
            "Again, if you read his book, this was all part of the original vision that we linked data as well as documents, and that we had structured documents.",
            "The that's XML.",
            "Well, he yes, that grew out of HTML, of course, but.",
            "The URLs became you arise so abstract, more abstract rather than addresses.",
            "We would develop a new resource description framework for handling data as well as documents.",
            "And if you did that, if you published data, you have to describe.",
            "What that date is about, so you have to get into some sort of vocabulary, taxonomy or ontology.",
            "Once you've done all that, then you can start getting into the whole inference proof and the trust that you know you can start inferring things, asking questions, getting answers, and having some idea of whether those answers are correct or not.",
            "So this is where the AI community came to the fore, and basically in 1990s.",
            "See Tim's publishing then in 2001 with with Jim Hendler, Jim came stars coming to web conferences.",
            "There was a big cross linking between the web community and the AI community.",
            "But I'm afraid at that point I think.",
            "It all went into what I call.",
            "Well, I can be ruder than this, but I'll call it today the IAI doldrums.",
            "Trying to solve the big problems of AI.",
            "Before building a dataweb.",
            "It is a bit like trying to build Google before you've got the documents to show it works."
        ],
        [
            "So just the point I would make that RDF.",
            "Of course.",
            "Of course, this is where I sort of get excited, because these are triples and this is.",
            "This is the world are moving into now and that to me these are links because you know we designed a system.",
            "We had link."
        ],
        [
            "Triples so I just want to just to sort of capture that story in this in this graph.",
            "Just to remind you how far we've come in an evolutionary sort of way.",
            "So here's you know.",
            "Back in, I don't know how much you can see.",
            "This is 1991.",
            "You know, when Tim's just starting to put stuff on the web?",
            "Very, very no growth, no perceptible growth at all, really until you start getting mosaic, the liftoff begins here and the net and the Navigator.",
            "Sorry the browser wars.",
            "As that becomes Netscape Navigator and then Bill Gates famously says off the network.",
            "Yes, we do need that will make it part of every operational system.",
            "Internet Explorer emerges here.",
            "The.com boom, Amazon here, the.com boom.",
            "This is this.",
            "Is this graph produced by one of my PhD students, Mark Schuler, and he's put the bubble as a bubble.",
            "People started trying to sell stuff on the web there, and when that bubble burst here, I remember somebody in one of the American newspapers writing about.",
            "Well, that was the end of Internet shopping.",
            "Why all these people lost a lot of money trying to sell things on the Internet?",
            "It's never going to work, so just forget about it guys.",
            "This is the first of many bubbles we've had.",
            "Of course, people never learn the lesson, but when you look at what's happening first of all, the emergence of Google is around here.",
            "One of the big tipping points was, you know, you had to have something like Google so the web could get could scale was once it went over million 100 thousand 100,000 sites, you couldn't register the new ones every day.",
            "You had to be able to search the documents that were going up there.",
            "Day on day on day you had to be able to.",
            "You had to learn to harvest the web, search it and that's what Google introduced us to.",
            "But the underlying technology, here Wi-Fi is introduced just before the turn of the century, and broadband comes along here.",
            "So when people are trying to sell goods on the Internet, who are they selling too?",
            "Nobody had a computer in their homes.",
            "Do you remember the world wide wait?",
            "Do you remember the modem and that awful sound?",
            "If you go to the computer History Museum in the Silicon Valley is a lovely hypertext web section did done by someone who really understands the world.",
            "So much so that there's a copy of microcosm in there.",
            "But it's all about the web, of course, and you can actually press a button and hear that sound all full modem sound.",
            "And then Crash is gone.",
            "So few people had computers in the home and people you know mobile phones didn't exist where they might have done, but they were bricks that so.",
            "You know they're selling into markets a bit like you know when the printing press came along and people started selling books to a community that couldn't read.",
            "You know this.",
            "These things are doomed to failure in the early adopter world and investors.",
            "Don't learn though, do they?",
            "They still pay stupid prices for things that look popular anyway, so you can see the development here that the things that started to emerge as the technology developed.",
            "We talk about Web 2.0 or it was famously coined the phrase Web 2.0.",
            "Really, when people were able to to start to be able to write.",
            "On the web without having to learn gobbledegook, such as HTML, so blogs started to emerge and the social networks started to vote.",
            "As the browsers became more mature and it's, but it's often the technology follows what people do.",
            "So as the as the browsers became more interactive, people started putting Diaries on the web or web log.",
            "It's a blog and the technology developers so people shall develop a general piece of blog software that anyone can download.",
            "And it's.",
            "They see what people are doing with it and then develop the tools to enable everybody to do that.",
            "So.",
            "With this stops here I'll get Mark to do 2011, but basically we're into the Mobile World now, but three phases here.",
            "I just want to pick up on.",
            "I talked about the big at the beginning of the web was read only and Tim didn't think that was very exciting place to be, but it was enough.",
            "It was just more than you had before.",
            "And then it became really right and then we move.",
            "We're in the social work phase.",
            "And what new when early adopters started to use the web?",
            "When you very first start using it, I'm sure you remember you would just be very surprised if what you were looking for was there.",
            "And in the second phase, as it started to more and more stuff becomes available, you would look for something and you'd hope it be there.",
            "You'd hope you find a Dictionary of some sort you can use.",
            "You'd hope you defined an online encyclopedia, won't necessarily very good, but you'd hope you find some something about what your local community offered.",
            "That's where we are with the web now.",
            "What's the word?",
            "Do you use?",
            "I would use expect.",
            "If you look for something on the web, you expect it to be there any more or less.",
            "Expect what you want to find to be at the top of those lists, and less.",
            "It's a more complex query, so.",
            "We're into the expect phase and was that way."
        ],
        [
            "The next phase is going to be.",
            "We are, of course.",
            "So we're into this sort of everybody puts everything on the web amazing.",
            "Insights into human behavior.",
            "Many of these things, as I said, we communication is one of the great drivers I think of us as human beings.",
            "And why wouldn't people want to use this to communicate with used every other technology that's being developed to communicate, so it's almost inevitable.",
            "The flickers and the you tubes and my spaces that became Facebook.",
            "Very interesting, Lee, I don't.",
            "If you thought about this, to me this is interesting.",
            "The web is universal and free and decentralized.",
            "It's a word I haven't used its decentralized.",
            "That's how it works.",
            "The tends to give rise to monopolies.",
            "There's sort of like there are lots of search engines, but what's the one that really rolls off?",
            "Everyone with the press always talk about Google.",
            "There's sort of 1 shop and one auction house, and it's different for different cultures.",
            "I'm thinking in the English speaking world at the moment, but there are monopolies in the other cultures as well.",
            "There's one Wikipedia.",
            "There's one that big cause.",
            "The power of the web is that.",
            "Are you right to it?",
            "Because you know you can have millions of eyeballs looking at it and that also self helps the self correction.",
            "So if it basically either everybody uses something or.",
            "It gets very fragmented and what's the point of having a social network that the people you want to be your friends aren't part of?",
            "Alright, you're gonna go that you know we've got Google Plus coming out and there's a lot of talk about it.",
            "And then what?",
            "They are the balance between Google Plus and Facebook with very interesting to see how that evolves.",
            "And there are.",
            "Some very key figures the hubs, but if they move huge parts of the web world, go with them.",
            "So it's the hubs you gotta get if you want to move, move the world.",
            "Twitter is my favorite.",
            "I don't do Facebook much, but I do love Twitter."
        ],
        [
            "Tweeting Wikipedia was a bit of a surprise to me and to Jimmy Wales and others who founded it that we could have a not develop an online.",
            "Have the effort to develop an online encyclopedia in the way we have, and again, I mean you say well, why is it going to work?",
            "Why ay people gonna do it?",
            "And will it be correct?",
            "Well it's correct because it's dynamic and people if they see mistakes self correct?",
            "I mean I know there's problems about policing and security and other sites that are controversial, but generally for cyantific staff and factual staff and biographies.",
            "It's fantastic, Can you imagine a world without Wikipedia these days?"
        ],
        [
            "Twitter this is a graph I should get it updated.",
            "It stops in 09 as a PhD student did it and then disappeared to China to start his own company.",
            "But basically the red line is the growth of Twitter and he put on it a few sort of remarkable things.",
            "Like when Nigel joined Twitter these are the early adopters.",
            "This is Stephen Fry in the UK famous comedian.",
            "He's a huge hub on on the web and he fake Twitters tweets all the time and he famously treated from a lift.",
            "An elevator in the summer of 2008 to say we're stuck in the lift.",
            "And the reason he could do that was because he had just bought an iPhone 3G.",
            "So, although there's no can't prove it, there's no sort of correlation.",
            "But if you look at the growth of the 3G phones, I mean clearly people if they can tweet on the move, you can tweet more and it becomes this.",
            "Broadcast medium again with huge hubs.",
            "Have great followings.",
            "If there was a new Twitter you'd have to move Stephen Fry to it to get people to use it in America is all sorts of other things happen in the presidential election in 2008.",
            "In the miracle on the Hudson and this is Gordon Brown's wife and the swine flu.",
            "See I'm I'm very late adopter.",
            "I didn't go on until April 2009, but these are."
        ],
        [
            "All interesting stories about the growth of the web just got a little sidetracked here, and then I'll come back to finishing about where I think the semantic web isn't is going.",
            "All this stuff I've talked about is what I would now call because we coined this term for good or bad web science in 2006 that this phenomenon is not.",
            "You can't understand it just as a technologist and you can't understand it just as a social science.",
            "We need GNU tools, techniques, methodologies to understand it.",
            "It's it's, it evolves faster than we can observe it.",
            "It changes faster than we can observe it.",
            "I don't think there's been anything like that before that we've needed to study.",
            "When you think about the way the climate changes, it's you know, over decades, centuries, the web is changing as I speak.",
            "This sentence constantly changing and in order to study it and draw lessons and understand better how to build better systems and predict what people are going to do with the technology we build for good or bad, we have to understand both the social and the technical.",
            "It's a massive, complex social technical."
        ],
        [
            "System so we in 2006 I'm not.",
            "This isn't a websites talk, so I'm just going to flash a few slides past you.",
            "We set up we being MIT, Southampton, Tim myself, Danny Dietz and Nigel Shadbolt thing.",
            "We called the websites Research Initiative which is grown into the websites trust which promotes research, education, thought."
        ],
        [
            "Shipping websites we run conferences and summer schools and curriculum workshops."
        ],
        [
            "We talk about what websites is and what it isn't.",
            "It's lots of things coming together, but it's not the union of all those, but it's certainly more than there intersection.",
            "It's different pieces of those subjects that we need to complete the pitch."
        ],
        [
            "Designing a website curriculum is a very interesting thing.",
            "We felt we needed a banner to court poor people under.",
            "That was because if we felt we developed it under computer science, it wouldn't take on it full.",
            "Power, rather like computer science had to emerge from electrical engineering in the 1960s.",
            "We web scientist study things like shape and structure.",
            "I mean this was people were doing this before we coined the phrase, but it's like it's this banner.",
            "It's saying this is this is good academic stuff, good research stuff and it's stuff that businesses need to need in order to."
        ],
        [
            "Go on the Internet.",
            "I've talked about."
        ],
        [
            "Written page who changed the structure of the web and this is the sort of circle of development that we tend we talk about in terms of you develop a technology to meet the social need, but you have to build in the small just like Tim with the first website and this is a very important lesson for the semantic web.",
            "Alright, I'll say it now in case I forget.",
            "Basically, in trying to work out the theory of the semantic web before the data exists to do the do, the practical is the wrong is potentially the wrong way round.",
            "Just as it would have been with the first web.",
            "So 'cause you have to build stuff in the small, you can't do the experiments like we do in computer science that test it and then try it out with some users and then refine it.",
            "And that's not how it works.",
            "Things go viral and understanding that going viral is a very important part of websites and we don't know how from that initial Google site that they launched in 1980, nineteen, 98, or 99, whenever it was to the phenomenon that Google is today understanding.",
            "That is a very.",
            "Difficult journey.",
            "We've watched them live it, but once it goes big then you can start analyzing it and you can see what the bad things that people do with it as well as the good and you.",
            "Then you start you start going around the circle again because you've got to actually solve some of the issues that come up with Google spoofing or spamming.",
            "And all that sort of thing so.",
            "And really, I like to describe websites today as the theory and practice of social machines.",
            "Tim talked about social machines in his book, weaving the web.",
            "That's what we're building a social machines, and it is a new concept."
        ],
        [
            "We haven't had before.",
            "We have to have a bit of networks."
        ],
        [
            "Silence in the web.",
            "Emergent problem solving Galaxy, so is a fantastic example of citizen science, which is what I think one of the big legacies of the web will be getting people who know nothing really about science to do things like classify galaxies right.",
            "Hopefully this will encourage more and more people to get involved in."
        ],
        [
            "Science, another one is Louis Van Onze crowdsourcing amazing that you can get for free people to solve huge problems that makes money."
        ],
        [
            "For industry.",
            "And the cool thing this is the last phase of my talk now is the we're now seeing.",
            "This is a slide.",
            "Nigel did the emergent data.",
            "This is very sort of euro perspective of."
        ],
        [
            "Data that's emerging on the web and we've been talking about the semantic web for 10 years, and I think we just, well, Tim's been talking about it for a lot longer than that.",
            "We've just beginning to see."
        ],
        [
            "What it might look like, Jim gave a talk at the European Semantic Web conference this year, which he called.",
            "Why the semantic web will never work in quotes, and I urge you to look the slides around the web.",
            "I urge you to look at his slides.",
            "He says sorry not in Ryan, 'cause Jim often does stuff in poetry is very clever like that.",
            "But anyway, basically this is his 10 year retrospective from when he published the paper with Tim about the semantic web that was full of agents for agents were going to do.",
            "I know, but those agents can't do anything until they've got the data on which to do things with.",
            "So this is one of the amazing most important lessons we've learned as we've tried to build it in nine in 2006.",
            "Nigel, Tim and I wrote a paper in IEEE."
        ],
        [
            "Intelligent Systems, which team had?",
            "It's so these are actually the four principles of the semantic web.",
            "It all boils down to there's no mention ontologies in here.",
            "It all boils down to create your eyes or URLs.",
            "If you must still use HTTP.",
            "Describe the data using RDF or something like RDF.",
            "That gives you that that very open scalable structure of a triple.",
            "Can be done in XML.",
            "RDF is much more much easier to use for this and link it.",
            "The key thing here is putting out datasets an linking them and seeing what that."
        ],
        [
            "Will bring to give us and the growth of the web in the last four years.",
            "Updated data on the web."
        ],
        [
            "These are the."
        ],
        [
            "Which is there available from the dairy webs."
        ],
        [
            "But you can just see how it's grown that was last year, September 2010, and it's probably doubled since then.",
            "I think he's doubling every few months now."
        ],
        [
            "It really is beginning to emerge."
        ],
        [
            "One of the major tipping points was work that Jim and Tim and Nigel had done with open government data.",
            "We had a project act many of you will have heard Nigel talk about advanced knowledge technologies and this is public service sector information that led to what happened in the UK.",
            "Actually it was Tim having lunch with Gordon Brown at Checkers and Gordon Brown said, what can I do to help you do and you know that wasn't bad as it continues head.",
            "Put your data on the web.",
            "So we did.",
            "Thing is, Golden Brown did before he lost the election was to put the UK government data on the web.",
            "Then Tim and I just had to persuade the new Prime Minister to do it, but they have done that hugely successfully.",
            "So the UK is a powerhouse in this area.",
            "Meanwhile, on the other side, Atlanta, who would say they started it 'cause Obama announced first he was going to use open data has grown dramatically and is this big battle that I'm bout who's got the most datasets out there and many other governments are now following suit.",
            "It's very interesting that for the data web.",
            "It's the public sector that's driving is come out of.",
            "Research them into the public sector.",
            "The first web was very much driven by the commercial sector.",
            "Once it came out of the research lab and the public sector came much later.",
            "It was very difficult to get governments and public bodies and universities to put their data on the web.",
            "It's the other way around now, and it's all to do with the timing and why the governments want data on the web, not because they understand the technology, but because of this battle for transparency and open this.",
            "Which is come about because of the word.",
            "But they can't keep the secrets anymore like they used to.",
            "And so it's very interesting how this is evolving."
        ],
        [
            "So you can look at this is the pictures from the.",
            "Well I say from the UK site there's one from Australia here New Zealand.",
            "I can't even read those.",
            "Many governments would be."
        ],
        [
            "Going to do this.",
            "The UK we've got our local authority data coming out which is driving amazing changes in terms of what people know about their local authority and when you link it all up, you can find out who does collect your dustbins once a week or twice a week and where is that?"
        ],
        [
            "Do it.",
            "Cities London is an example.",
            "Cities that are putting the data out."
        ],
        [
            "On the web.",
            "The reason is transparency, accountability and down.",
            "The line efficiencies, economies and social."
        ],
        [
            "Values we think when he put the data out, the world begins to develop applications.",
            "One of the first an asbo in the UK is an antisocial behavior order.",
            "If you do something nasty like knocking someones dustbin over or pulling the Flowers out of their garden and your court, they won't send you to prison.",
            "You get an asbo alright, which means it's a warning really I think and your name goes on the police register so when they put published where the Asbos were or which councils had what number of Asbos.",
            "That was immediately put into an Asbo app so you can see where the worst as both spots in the UK were people have used it to help find dentists.",
            "We have a shortage of National Health dentists in the UK.",
            "There's the tube map."
        ],
        [
            "And so on.",
            "It's just like the first web when you put the stuff out there free and open, the world develops applications you don't have to do all that work yourself and I still haven't mentioned the ontology word.",
            "The governments put it spend."
        ],
        [
            "Hang up.",
            "And most recently put a crime data up, which is quite controversial because no one wants to know they live in a high crime area, but it's, you know."
        ],
        [
            "It's important data that we know and Tim has.",
            "It made it even easier for people now with his five stars voting data.",
            "Firstly, put your data out.",
            "If you look at this Ted talk, give me your data you gave me your documents, give me your data.",
            "Just think about it.",
            "The the web became the world's document management system.",
            "It's about to become the world's database.",
            "Imagine the power of a database the size of the web.",
            "That's all interlinked and that you can actually find information out about my comparison of, you know, cancer statistics in London and Sydney or Jamaica or and pull that together.",
            "Just imagine the power of that, so put your data out there.",
            "Make it structure.",
            "This even better.",
            "Use open standard formats.",
            "Even better, use URLs or Ur eyes to identify things.",
            "Even an most best of all link it."
        ],
        [
            "And then we'll see all sorts of wonderful things emerged.",
            "Now I'm running out of time.",
            "Can I just show a quick demo?",
            "No yes.",
            "But what time did I start?",
            "An hour ago, or, well, OK, I won't.",
            "Then you can play with this.",
            "So Hampton universities put it stays online and we hope all universities will follow suit.",
            "And the thing about the data web is remember how you learned to use the first web you copied?",
            "You copied how other people did their documents.",
            "So this is how it's emergent in the semantic web.",
            "You copy how other people structure their data.",
            "So the ontologies I've used the OH word are emerging from simple things that people start their emerging evolving southamptons put it stays shopping rather than demo it our catering, Sir."
        ],
        [
            "This is all now so excited about the fact that the students know where the catering are, 'cause everything is in open data.",
            "So you can now type in coffee on this beta test for the catering services and it will."
        ],
        [
            "Tell you where you can get your coffees and if you drill down, you can find out when they're open.",
            "That's hugely fantastic.",
            "To know where you can get a coffee on campus and it's all being driven by open data and the catering services have built this app themselves."
        ],
        [
            "It's.",
            "And this is, you know, you can drill down.",
            "That's why the coffee in the outlook bar."
        ],
        [
            "It's not open yet.",
            "We gotta.",
            "I didn't put a bus one in.",
            "There's a bus route so I could show you the demo that we can put.",
            "Finally, where bus stops are is quite interesting.",
            "the UK found it had a lot.",
            "They're all in different places where it thought it was all the bus stops in the UK are up on the web.",
            "Now we've got the bus stops in Southampton.",
            "If I showed you the data you could drill down, look at where you are University campus, drill down again and see when the buses are going to arrive.",
            "People are building data and of course."
        ],
        [
            "They're building it in the Mobile World.",
            "These are things that students are doing and picking up the data."
        ],
        [
            "And running with it.",
            "So my conclusions to be this is the last slide of gyms, while the semantic Web web will never work talk, there is no reason at all.",
            "It is here, it's working and it will continue to do so.",
            "But for it to move to the next level is where you come in.",
            "Right?",
            "Foot to move that someone be all that weird communitive aspired for it we've gotta revisit and update early versions of modern web.",
            "We gotta unify the competing models of linked data machine readable vocabularies and we must step up to some of the critical research."
        ],
        [
            "Challenges are making this work on a global basis and these are my summer is to me.",
            "It's all about linking the exciting thing about linked data is the linking.",
            "I want to build semantic web link services.",
            "My linked databases have become triple stores and I'm hugely excited about playing with those.",
            "It's not all about visualizing huge link datasets.",
            "It's about integrating document and data webs that companies have come up with schema.org.",
            "Where will that take us?",
            "Please keep the ontologist simple.",
            "Don't worry about them being overly complicated.",
            "Let them involved.",
            "And then you can someone, somebody out here is going to be the next Google.",
            "It could be Google, but it could be somebody else.",
            "It could be one of you in this audience that works out how to do this on a grand scale so we can find data and link it on the on the open web.",
            "I do wonder what's happened to the agents and we do need them, so please agents.",
            "People start looking at this web again and thinking what your agents can do with it.",
            "And the hard work for this community has yet to come."
        ],
        [
            "And as Ted Ted said, everything really is deeply into twinkles.",
            "Thank you.",
            "The context of open.",
            "Without the publishing public comment about the WikiLeaks phenomenally well, wiki leaks is part of the reason that the governments are putting their data out because they realized the cat is out of the bag.",
            "So, and it was inevitable really that this would happen because people have always leaked information.",
            "In fact, the UK is suffering from a major crisis.",
            "The media hacking into information rather than it being leaked when, and I think so, it was inevitable.",
            "And I think I think that this is what's driving more openness and transparency to be honest.",
            "Asking this question for 10 years and I'm not sure I got it from your talks all ask it again that seems to be the hardest thing about the semantic web is keeping the links and everything on top of it.",
            "It's like the code, it's like code and documentation.",
            "It's always going to keep diverging and every time they do get an agent application that works for awhile and within a month it doesn't work anymore because I should say that I'm in so it seems to me levels well.",
            "the iPod before most of the semantic web.",
            "No, you put the wrong way around.",
            "Yeah, if you think about.",
            "How Google emerged?",
            "What we need are those ideas that are that do evolve as the web of data evolves, that's what you gotta come up with such your problem, not ours.",
            "We are going to give you the data you've now got to work out how to how to manage that on a constantly changing.",
            "I'm sorry, just that.",
            "You know you haven't got there yet and there's a major research challenge.",
            "But The thing is what we're doing is building you a fantastic research lab.",
            "Well, that's what the first word was.",
            "A fantastic research level hypertext community and the information retrieval community, and we got there.",
            "But if you try and do it without that data there, I think you're always going to end up with the systems that only work for a month, right?",
            "You've got to get the constantly changing.",
            "Interlinked across the world applications right?",
            "So you gotta think out of the box I'm afraid.",
            "My call to you guys get it right please.",
            "Coffee awaits it.",
            "Thank you very much, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K as a huge troop of Jennings students around or ex students of Jennings.",
                    "label": 0
                },
                {
                    "sent": "And because I felt I had, I had to sort of be semi awake for this morning.",
                    "label": 0
                },
                {
                    "sent": "As I said, I'm not an AI researcher per say, or they'll have mixed with AI researchers for most of my career.",
                    "label": 0
                },
                {
                    "sent": "In fact, it's a very little known fact that I'm a pure mathematician originally, that's not that's quite well known, but I did an M SC in computer science as I converted from pure maths too.",
                    "label": 0
                },
                {
                    "sent": "Computer science and that was in Prolog and in fact I used to meet Bob Kowalski in those days when he was in.",
                    "label": 0
                },
                {
                    "sent": "I don't need Bob's here this morning, but it would be lovely to say hello to him.",
                    "label": 0
                },
                {
                    "sent": "At the coffee break.",
                    "label": 0
                },
                {
                    "sent": "I also note in my bio that I'm a lot of was, as you know in in in a, well in Prolog and it was always everything is a something well invite bio.",
                    "label": 0
                },
                {
                    "sent": "Some typos got through and I'm clearly a was a lots of things.",
                    "label": 0
                },
                {
                    "sent": "Anyway I tell stories I just I was just interested to.",
                    "label": 0
                },
                {
                    "sent": "I'm going to tell you stories this one and that's how I usually do my talks rather than over structure them.",
                    "label": 0
                },
                {
                    "sent": "But I was just noting that each car is 22 years old.",
                    "label": 0
                },
                {
                    "sent": "So that means if my math is correct I was a pure mathematician, not a Calculator.",
                    "label": 0
                },
                {
                    "sent": "It's 1989 is that the first Times 269?",
                    "label": 0
                },
                {
                    "sent": "Oh gosh, OK I was gonna say about as old as the web, but that's not truth.",
                    "label": 0
                },
                {
                    "sent": "And of course AI is a lot older than the web and I was working out 89.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's that's of course you only have it every other year.",
                    "label": 0
                },
                {
                    "sent": "So anyway, I want to.",
                    "label": 0
                },
                {
                    "sent": "I want to talk to you about towards a smarter web, but there won't be a lot of intelligence in this talk.",
                    "label": 1
                },
                {
                    "sent": "I'm basically going to tell you about how I have perceived.",
                    "label": 0
                },
                {
                    "sent": "The web evolving and how I perceive it.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Evolving in the future.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I was, as I say, I was in pure mathematician turned computer Sciences via prologue.",
                    "label": 0
                },
                {
                    "sent": "And in the late 80s around 1987, I started to discover this thing called high.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Text.",
                    "label": 0
                },
                {
                    "sent": "I read in 1987 I read Vannevar Bush is paper, which I'm sure many of you here would have read.",
                    "label": 0
                },
                {
                    "sent": "As you may think, this is one of the things that really got me going.",
                    "label": 0
                },
                {
                    "sent": "Towards this whole idea of linking things together, I'm a great networker.",
                    "label": 0
                },
                {
                    "sent": "Socially, as well as in my research, and I I just enjoy this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Concept that everything could be linked together the same year I met these two guys.",
                    "label": 0
                },
                {
                    "sent": "Ted Nelson, who invented the terms hypertext and hypermedia in the 1960s.",
                    "label": 0
                },
                {
                    "sent": "On the phrase, everything is deeply into twinkled.",
                    "label": 0
                },
                {
                    "sent": "And Doug Engelbart invented the mouse windows pointing, clicking very revolution at the time.",
                    "label": 1
                },
                {
                    "sent": "In 1967, he gave the famous demo of his mouse pointing at a piece of text on a computer and moving to another piece of text.",
                    "label": 0
                },
                {
                    "sent": "The first sort of hypertext demo over the Internet, 1967 is a famous video of that.",
                    "label": 0
                },
                {
                    "sent": "I did think about showing it, but I chose another video to show you.",
                    "label": 0
                },
                {
                    "sent": "He is his, for he.",
                    "label": 0
                },
                {
                    "sent": "He built the augment system.",
                    "label": 0
                },
                {
                    "sent": "I should have said, of course, that Bush is system he describes in the Atlantic Monthly, which is so precious.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was the mimics the memory extender.",
                    "label": 0
                },
                {
                    "sent": "All of this was about the human brain doing the real powerful stuff and machines or venting.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And his dog and robot system was called augmented.",
                    "label": 0
                },
                {
                    "sent": "It's all meant in the human Internet using the power of machines to augment them.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Power of our brains.",
                    "label": 0
                },
                {
                    "sent": "And then what really got me going was in 1987, which was the year Hypertexts came of age.",
                    "label": 1
                },
                {
                    "sent": "First, hypertext conference was in 1987.",
                    "label": 0
                },
                {
                    "sent": "I didn't attend it, but I met all the people who started it in that year or most many of them.",
                    "label": 0
                },
                {
                    "sent": "And it was.",
                    "label": 0
                },
                {
                    "sent": "The Rapper was released on their new Mac machines.",
                    "label": 0
                },
                {
                    "sent": "The a hypertext stack Maker program which they at the last minute, called Hypercard.",
                    "label": 0
                },
                {
                    "sent": "Which sort of got the media attention about this hyper thing and the BBC in their wisdom.",
                    "label": 0
                },
                {
                    "sent": "Gosh, I can't believe UK what is happening at home with all our police resigning.",
                    "label": 0
                },
                {
                    "sent": "Anyway, that's another whole story about BBC and Media and Rupert Murdoch and so on.",
                    "label": 0
                },
                {
                    "sent": "But the BBC then Wisdom made a program called Hyper Land and I'm gonna, it's it was all about everything to do with hyper.",
                    "label": 0
                },
                {
                    "sent": "This is in 1987, so it's long before the web.",
                    "label": 0
                },
                {
                    "sent": "It's long before we even invented the term logging out, you know.",
                    "label": 0
                },
                {
                    "sent": "They seem in evolutionary terms of for the web.",
                    "label": 0
                },
                {
                    "sent": "If we even didn't talk about multimedia in those days, I I hope the sound will work.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to show you this clip, which is pretty.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Self explanatory.",
                    "label": 0
                },
                {
                    "sent": "Hope this sound works.",
                    "label": 0
                },
                {
                    "sent": "The same boring old television England cricket team is in deep trouble.",
                    "label": 0
                },
                {
                    "sent": "Are you tired of linear non interactive television, Mr. Miss Adams?",
                    "label": 0
                },
                {
                    "sent": "Tom Baker Dr of course.",
                    "label": 0
                },
                {
                    "sent": "Are you tired?",
                    "label": 0
                },
                {
                    "sent": "Mr Adams of assorted television.",
                    "label": 0
                },
                {
                    "sent": "It just happens at you.",
                    "label": 0
                },
                {
                    "sent": "Could you just sit in front of like a couch potato?",
                    "label": 0
                },
                {
                    "sent": "That doesn't involve you.",
                    "label": 0
                },
                {
                    "sent": "Interact.",
                    "label": 0
                },
                {
                    "sent": "Wait a minute.",
                    "label": 0
                },
                {
                    "sent": "Thank you mean.",
                    "label": 0
                },
                {
                    "sent": "Hello I'm just him.",
                    "label": 0
                },
                {
                    "sent": "My name is Tom and now your agent.",
                    "label": 0
                },
                {
                    "sent": "May I ask if you know what that means?",
                    "label": 0
                },
                {
                    "sent": "You want 15%.",
                    "label": 0
                },
                {
                    "sent": "You know every slightest bidding to fetch and carry for you, to work tirelessly and selflessly on your behalf.",
                    "label": 0
                },
                {
                    "sent": "Always ready always will be no drop too small or too big.",
                    "label": 0
                },
                {
                    "sent": "You sure you mean Agent?",
                    "label": 0
                },
                {
                    "sent": "I mean that I'm a software agent.",
                    "label": 0
                },
                {
                    "sent": "I am merely a small Akron, artificial and completely customizable personality and I only exist as what we call an application in your computer.",
                    "label": 0
                },
                {
                    "sent": "I have the honor to provide instant access to every piece of information stored digitally anywhere in the world.",
                    "label": 0
                },
                {
                    "sent": "Any picture or fill any sound, any book, any statistic, any fact.",
                    "label": 0
                },
                {
                    "sent": "Connection between anything you care to think.",
                    "label": 0
                },
                {
                    "sent": "You've only to tell me and it will be my humble to to find it for you and present it to you for your interactive pleasure.",
                    "label": 0
                },
                {
                    "sent": "Is there anything I can do for you now, Mr Adams?",
                    "label": 0
                },
                {
                    "sent": "Yes, you can stop being so obsequious.",
                    "label": 0
                },
                {
                    "sent": "For start it will be my very great and profound pleasure to be less obsequious or master.",
                    "label": 0
                },
                {
                    "sent": "I am, as I have mentioned, you'll undergo fully customized.",
                    "label": 0
                },
                {
                    "sent": "Allow me to present you with my control panel.",
                    "label": 0
                },
                {
                    "sent": "Would you care to talk to me in any way which takes your fancy?",
                    "label": 0
                },
                {
                    "sent": "Just constant primitive control.",
                    "label": 0
                },
                {
                    "sent": "OK, Buster, what do you want now?",
                    "label": 0
                },
                {
                    "sent": "Get up bloody move on contact.",
                    "label": 0
                },
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "Welcome back to find out now brother enjoying this.",
                    "label": 0
                },
                {
                    "sent": "What else can we change?",
                    "label": 0
                },
                {
                    "sent": "I could just.",
                    "label": 0
                },
                {
                    "sent": "There's another 40 minutes of that.",
                    "label": 0
                },
                {
                    "sent": "I could just play that and we'd all be happy and go to coffee.",
                    "label": 0
                },
                {
                    "sent": "I think that was a great keynote.",
                    "label": 0
                },
                {
                    "sent": "20 odd years later, it's still.",
                    "label": 0
                },
                {
                    "sent": "They use the concept of the agent to explain hypertext, and the idea of a global information system where you could ask for information and something somebody.",
                    "label": 0
                },
                {
                    "sent": "Would find it for you very.",
                    "label": 0
                },
                {
                    "sent": "I thought that was so appropriate after the robot in the opera yesterday.",
                    "label": 0
                },
                {
                    "sent": "And anyway, that was this an I saw that later I thought I want to build that system.",
                    "label": 0
                },
                {
                    "sent": "And really, that's.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's sort of where that's what driven me forward.",
                    "label": 0
                },
                {
                    "sent": "Now the same year.",
                    "label": 0
                },
                {
                    "sent": "This man's archives, arriving in Southampton, what am I telling you?",
                    "label": 0
                },
                {
                    "sent": "This?",
                    "label": 0
                },
                {
                    "sent": "So Mountbatten of Burma famous man in English history he's very related to the to the Royal family.",
                    "label": 0
                },
                {
                    "sent": "Last Viceroy of India, First Sea Lord of the animal?",
                    "label": 0
                },
                {
                    "sent": "T that sort of thing.",
                    "label": 0
                },
                {
                    "sent": "His family lived just up the road from the University of Southampton.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in 1987 his archived arrived in the University of Southampton.",
                    "label": 0
                },
                {
                    "sent": "Now there are many people that say that is my shoe collection.",
                    "label": 0
                },
                {
                    "sent": "That's me in the archive in 1987, with one of the pictures from the archives.",
                    "label": 0
                },
                {
                    "sent": "So that is not my shoe collection, although my husband would say it's closely resembles it.",
                    "label": 0
                },
                {
                    "sent": "This is the archive.",
                    "label": 0
                },
                {
                    "sent": "It's all paper photographs.",
                    "label": 0
                },
                {
                    "sent": "Old cinematic movie reels and the old records.",
                    "label": 0
                },
                {
                    "sent": "So my concept was to write well, digitize all that.",
                    "label": 0
                },
                {
                    "sent": "Put it on a computer and link it all together using this new hypertext hypermedia stuff.",
                    "label": 0
                },
                {
                    "sent": "Not thinking that in 10 years time we would be contemplating vast arrays of information.",
                    "label": 0
                },
                {
                    "sent": "This is about 50,000 documents documents which seemed huge and we never digitized it all.",
                    "label": 0
                },
                {
                    "sent": "In fact, Copyright defeated us more than anything.",
                    "label": 0
                },
                {
                    "sent": "But of course, we've moved into a world since then where things are created digitally, and this hypertext stuff, together with some rather clever software, enables us to move around huge huge amounts of information on the interweb on the Internet through the web.",
                    "label": 0
                },
                {
                    "sent": "So that's how I started my career and I started design.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this system we call microcosm.",
                    "label": 0
                },
                {
                    "sent": "And this is and I'm going to get Fast forward to the present in awhile, but this was quite revolution.",
                    "label": 0
                },
                {
                    "sent": "It's time we had really neat ways of making links you could point to something in one document and point to another model document and say, create me a link.",
                    "label": 0
                },
                {
                    "sent": "The links were.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stalled in Ohio.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, I've got them in the wrong order here, I suppose.",
                    "label": 0
                },
                {
                    "sent": "But this these are slides taken from that.",
                    "label": 0
                },
                {
                    "sent": "I'm using the Mountbatten Archives and the sort of interface we had where you had a drop down menu like in Word and you clicked on what you wanted to do with the information.",
                    "label": 0
                },
                {
                    "sent": "So my idea was that anything it appeared on the screen was potentially the beginning of a link and you'd want to find out what it meant.",
                    "label": 0
                },
                {
                    "sent": "So who was this?",
                    "label": 0
                },
                {
                    "sent": "Mr Patel who was at this meeting with Mountbatten in Viceroy House in India?",
                    "label": 0
                },
                {
                    "sent": "And I would follow links to maybe a definition or description of what the document was about.",
                    "label": 0
                },
                {
                    "sent": "I could make links, I could compute links by using information retrieval techniques.",
                    "label": 0
                },
                {
                    "sent": "All those sorts of things.",
                    "label": 0
                },
                {
                    "sent": "So it was a two step process, a menu and.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uclick we were trying to do things I was trying to create associative links and in the book I wrote David Lowe.",
                    "label": 0
                },
                {
                    "sent": "We talk about that as is the instantiation of a semantic relationship, and so I didn't know it.",
                    "label": 1
                },
                {
                    "sent": "But I was working in the semantic web.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we kept our links in databases or we called them link basis because I remember someone in the database community saying these are just flat files are not databases, so you can't call in databases.",
                    "label": 0
                },
                {
                    "sent": "So we coined the terms term link base but the concept was that the hyper structure was separable from the documents.",
                    "label": 0
                },
                {
                    "sent": "So you could and we also have this idea that you could send link basis to other people.",
                    "label": 0
                },
                {
                    "sent": "So here's my set of links for this.",
                    "label": 0
                },
                {
                    "sent": "This last night the robots saying I'm in the music script today.",
                    "label": 0
                },
                {
                    "sent": "This is my links for history.",
                    "label": 0
                },
                {
                    "sent": "The Mountbatten.",
                    "label": 0
                },
                {
                    "sent": "You can apply these to documents that you.",
                    "label": 0
                },
                {
                    "sent": "You have or anybody has in the world and we always talked about it.",
                    "label": 0
                },
                {
                    "sent": "Working on the Internet.",
                    "label": 0
                },
                {
                    "sent": "But we were doing our work on a on a windows based PC.",
                    "label": 0
                },
                {
                    "sent": "And the idea was that you could make very generic links.",
                    "label": 0
                },
                {
                    "sent": "You could define links generically on words or phrases or pictures to describe things and have those links work anywhere.",
                    "label": 0
                },
                {
                    "sent": "Those words or pictures or.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bits of audio existed.",
                    "label": 0
                },
                {
                    "sent": "This is the architecture you can read all about it in the many papers that we published in the early 90s about this system we had viewers which I guess we've called browsers today is that we had to have a different viewer for different types of media.",
                    "label": 0
                },
                {
                    "sent": "It all got munged up in this control system, which is one of our big mistakes.",
                    "label": 0
                },
                {
                    "sent": "'cause that was too much of a blip.",
                    "label": 0
                },
                {
                    "sent": "Black box.",
                    "label": 0
                },
                {
                    "sent": "And then we have this system of filters at the back end.",
                    "label": 0
                },
                {
                    "sent": "They were serially connected and every message.",
                    "label": 0
                },
                {
                    "sent": "So if the user said I want some information about this, the Honorable Patel who was at this meeting in India then it would go through the filters to find that if there was any information in either a link base we had a Prolog rule base in there we had SQL databases.",
                    "label": 0
                },
                {
                    "sent": "Basically for me this was a plug and play system for my PhD systems are students so they could alright different filters and try them out.",
                    "label": 0
                },
                {
                    "sent": "We had filters for doing links in different types of media and then when the filter system.",
                    "label": 0
                },
                {
                    "sent": "Munch through it would send the information back to the user as as a list of links.",
                    "label": 0
                },
                {
                    "sent": "How familiar is that?",
                    "label": 0
                },
                {
                    "sent": "And back to the browser, and so these are that this is the information you might be interested in.",
                    "label": 0
                },
                {
                    "sent": "We thought it was pretty cool and actually some of.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is still pretty cool.",
                    "label": 0
                },
                {
                    "sent": "The key thing was the links for triples.",
                    "label": 0
                },
                {
                    "sent": "They had a source or destination and a description and the beginning and end of those links didn't have to be fixed points.",
                    "label": 0
                },
                {
                    "sent": "They could be computed.",
                    "label": 0
                },
                {
                    "sent": "They could be functional and the description was meant to be where the clever stuff went, but we didn't have any of those AI researchers in the in Southampton at the time, so we sort of just had text descriptions because we're engineers.",
                    "label": 0
                },
                {
                    "sent": "We like building systems.",
                    "label": 0
                },
                {
                    "sent": "But the thing was that the biggest problem we had in those days was getting people to create links because it was actually not an exciting thing to do.",
                    "label": 0
                },
                {
                    "sent": "We were trying to say the story and make links between interesting documents that tell the story of what was happening.",
                    "label": 0
                },
                {
                    "sent": "We had one or two people do that, but it was very hard to get people to make a lot of links and with our system you could make lots of lots of links very easily and and meaningfully.",
                    "label": 0
                },
                {
                    "sent": "So we used to used natural language processing to generate metadata for the documents and then link at the metadata level to get some linking between documents so that people could start to bootstrapping user system and it all sort of fell out.",
                    "label": 1
                },
                {
                    "sent": "It was really.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need stuff so we went to Paris to the Hypertext conference in Paris.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In 1990 with our paper about the web, and that's where I first met Tim.",
                    "label": 0
                },
                {
                    "sent": "This is Tim here on the right saying probably it was a December 1990 and he actually put the first web server up that Christmas Day that year.",
                    "label": 0
                },
                {
                    "sent": "He hadn't.",
                    "label": 0
                },
                {
                    "sent": "It wasn't called the web when we met him in 1990.",
                    "label": 0
                },
                {
                    "sent": "He's explaining to my colleague Andrew Fountain.",
                    "label": 0
                },
                {
                    "sent": "How big is links are, I guess, how big the web's gonna be.",
                    "label": 0
                },
                {
                    "sent": "This is Robert Caio here, who he and Tim worked at CERN to develop the web in its infancy.",
                    "label": 0
                },
                {
                    "sent": "This is my PhD student in he's who wrote the first person microcosm.",
                    "label": 0
                },
                {
                    "sent": "This is Ian's grey leather jacket that he wore through most of his time at Southampton and that's his grey and the jacket here.",
                    "label": 0
                },
                {
                    "sent": "And that's me.",
                    "label": 0
                },
                {
                    "sent": "So that's the link to the fact that I was at the same conference.",
                    "label": 0
                },
                {
                    "sent": "It's actually recorded on the web that we both they didn't present the paper.",
                    "label": 0
                },
                {
                    "sent": "I don't think then, no, they didn't.",
                    "label": 0
                },
                {
                    "sent": "We presented, but you can see the list of attendees at the conference on the Web.",
                    "label": 0
                },
                {
                    "sent": "And it was a very sort of wow.",
                    "label": 0
                },
                {
                    "sent": "This is when stuff are going to mode.",
                    "label": 0
                },
                {
                    "sent": "There were several systems bubbling up at the time.",
                    "label": 0
                },
                {
                    "sent": "There's another one that's still on.",
                    "label": 0
                },
                {
                    "sent": "The girl got a system called was called Hypergiant University Grass, which was also at more like the web than the microcosm was.",
                    "label": 0
                },
                {
                    "sent": "It was it worked on the Internet and had protocols, but why didn't it didn't?",
                    "label": 0
                },
                {
                    "sent": "It's not the one that.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The web is the one that one, so we all trooped off to Texas in 91.",
                    "label": 0
                },
                {
                    "sent": "For the ACM hypertext, they were, they were.",
                    "label": 0
                },
                {
                    "sent": "Alternating Europe and US.",
                    "label": 0
                },
                {
                    "sent": "The high tech conferences in new essays and then I don't have any pictures of Texas, but I do remember several things about this.",
                    "label": 0
                },
                {
                    "sent": "Is the ACM hypertext comments that famously rejected Tim's paper about the web, but as Tim would say, it wasn't a very good paper, but it was describing the system of which all future hypertext research was going to be done.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I also remember because they we they rejected our paper, our second papers as well as Tim.",
                    "label": 0
                },
                {
                    "sent": "So I let you know what you do when you have a paper rejected you, put in a post or a demo so Tim and Robert put put in a demo of the web and we put a demo of microcosm.",
                    "label": 0
                },
                {
                    "sent": "And the third thing I remember is this is Texas in December, but the post the reception for the posters and demos was outside in the courtyard and there was a tequila fountain outside so everyone was outside drinking margaritas.",
                    "label": 0
                },
                {
                    "sent": "There are very few people inside.",
                    "label": 0
                },
                {
                    "sent": "Looking at the first demo of the web in the US on the Internet, which Tim had to pay for on his credit card, 'cause of course in the hotel the Marriott in San Antonio had no Internet connection in those days.",
                    "label": 0
                },
                {
                    "sent": "We I remember standing with Peter Brown who developed guys the hypertext system looking over Tim and Shoulders.",
                    "label": 0
                },
                {
                    "sent": "He demo'd what he was, then calling the World Wide Web, thinking how pretentious to call it the World Wide Web site.",
                    "label": 0
                },
                {
                    "sent": "the World Series baseball yeah and and there's nothing very new here is there?",
                    "label": 0
                },
                {
                    "sent": "I mean this is very primitive hypertext concert compared to the clever stuff we're doing.",
                    "label": 0
                },
                {
                    "sent": "This is just going to go nowhere anyway.",
                    "label": 0
                },
                {
                    "sent": "Of course, the next year in Europe there were web demos all over the place, and by the time we went back Type 693 in Seattle.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I think half the demos then were the web.",
                    "label": 0
                },
                {
                    "sent": "The web was already becoming the dominant hypertext system.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By 93 and so was born the webs, the most successful information architecture in history.",
                    "label": 1
                },
                {
                    "sent": "This is the Tim's famous document he wrote in 1989 to his bosses talk to his boss Mike Sendall, describing an information management system.",
                    "label": 0
                },
                {
                    "sent": "He wanted to build, and Microsoft famously wrote at the top.",
                    "label": 0
                },
                {
                    "sent": "Vague but exciting.",
                    "label": 0
                },
                {
                    "sent": "And go Tim permission to develop it as part of his work or it wasn't his job son, but he gave him permission to develop it at CERN.",
                    "label": 0
                },
                {
                    "sent": "And of course Sir, and also the other so many things happened around that time.",
                    "label": 0
                },
                {
                    "sent": "But by the time it came to the early 90s and soon realized what they had, they gave permission to it for it to be given away.",
                    "label": 0
                },
                {
                    "sent": "Many of you will be old enough to remember the ways we used to get documents on the web before on the Internet before the web there was Gopher and WAIS and or we FTP of course.",
                    "label": 0
                },
                {
                    "sent": "There was a time when it looked like Gopher was going to be the system we used to get documents on the web.",
                    "label": 0
                },
                {
                    "sent": "It wasn't hypertext, but it was a way of downloading documents very easily, but they made the mistake of famous, famously making mistakes.",
                    "label": 0
                },
                {
                    "sent": "Then we might charge for this.",
                    "label": 0
                },
                {
                    "sent": "And there was a move of the herd away from Gopher towards the web.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1994 as the web really began to emerge into the public, consciousness will certainly into the science community's consciousness and the media to certain extent.",
                    "label": 0
                },
                {
                    "sent": "Nice size 4.",
                    "label": 0
                },
                {
                    "sent": "We launched a company to sell microcosm.",
                    "label": 0
                },
                {
                    "sent": "How Daft was that?",
                    "label": 0
                },
                {
                    "sent": "We actually made quite a bit of money out of it because it was used for very specific training purposes, but it wasn't the IT didn't become the ubiquitous hypertext system.",
                    "label": 0
                },
                {
                    "sent": "We thought it might.",
                    "label": 0
                },
                {
                    "sent": "So many things that Tim got right and we got wrong.",
                    "label": 0
                },
                {
                    "sent": "We had a proprietary black box system at the heart of microcosm.",
                    "label": 0
                },
                {
                    "sent": "Everything that Tim did was given away.",
                    "label": 0
                },
                {
                    "sent": "It was open, it was free and universal, and his thesis was that that's the only way to build a global hypertext system.",
                    "label": 1
                },
                {
                    "sent": "Now he's we can't say he's been proved right because we've had one experiment and it's quite difficult to re run that experiment.",
                    "label": 0
                },
                {
                    "sent": "We now all know the web and it has become the dominant standard, but it's certainly right so far that those are the rules by which these global information systems develop.",
                    "label": 0
                },
                {
                    "sent": "You have to give their protocols have to be open, have to be free.",
                    "label": 0
                },
                {
                    "sent": "I mean, imagine if Bill, if Tim had been a Bill Gates type character, the web would be.",
                    "label": 0
                },
                {
                    "sent": "It may exist, but it would be very differently.",
                    "label": 0
                },
                {
                    "sent": "It would probably be owned by Microsoft because he probably would have sold it to Microsoft.",
                    "label": 0
                },
                {
                    "sent": "Something like that.",
                    "label": 0
                },
                {
                    "sent": "I mean, think about what might have happened.",
                    "label": 0
                },
                {
                    "sent": "We'd be paying per click, or certainly paying to download the software.",
                    "label": 0
                },
                {
                    "sent": "It might have been a very different place.",
                    "label": 0
                },
                {
                    "sent": "It would have been a very different place, but the interesting thing is what type of place would it have been?",
                    "label": 0
                },
                {
                    "sent": "Because we could still kill the web as it is now.",
                    "label": 0
                },
                {
                    "sent": "The pressures on it are significant in terms of what countries want to do with net neutrality and was the country that just passed the law about.",
                    "label": 0
                },
                {
                    "sent": "Since training.",
                    "label": 0
                },
                {
                    "sent": "Net neutrality is one of the Scandinavian countries.",
                    "label": 0
                },
                {
                    "sent": "So important, we keep this level playing field across the world, or it could.",
                    "label": 0
                },
                {
                    "sent": "And there's many ways we could we could kill it in terms of the way it's used, but one has to sort of argue and this is a thought experiment.",
                    "label": 0
                },
                {
                    "sent": "If we did kill the web as it is today, would another one bubble up?",
                    "label": 0
                },
                {
                    "sent": "You know you saw what happened with Egypt when the Internet was turned off immediately?",
                    "label": 0
                },
                {
                    "sent": "People they know what they've lost now, and so we are assuming beings.",
                    "label": 0
                },
                {
                    "sent": "We our.",
                    "label": 0
                },
                {
                    "sent": "I think our basic needs communication.",
                    "label": 0
                },
                {
                    "sent": "I mean one of the worst things you can do to human being is put them in solitary confinement.",
                    "label": 0
                },
                {
                    "sent": "We need to communicate, so why wouldn't people want to?",
                    "label": 0
                },
                {
                    "sent": "Once they've known this type of system, re always have it around the other things that there are many, many things you can put together to say why the web became ubiquitous system.",
                    "label": 0
                },
                {
                    "sent": "But one of them was that Tim got the network really before most of the hypertext researchers, not all.",
                    "label": 0
                },
                {
                    "sent": "As I say, the hyper do system ran on the Internet, but their system meant that every link had to go through their control system because in those days the hypertext community.",
                    "label": 0
                },
                {
                    "sent": "Had proved categorically by in this research papers published to this effect that, if links in a system failed, people wouldn't use it.",
                    "label": 0
                },
                {
                    "sent": "Now these were we were.",
                    "label": 0
                },
                {
                    "sent": "This taught me a lot about evaluation.",
                    "label": 0
                },
                {
                    "sent": "We were using systems those days asked our systems.",
                    "label": 0
                },
                {
                    "sent": "I'm as guilty.",
                    "label": 0
                },
                {
                    "sent": "This anyone that had maybe hundreds of documents and we used to test them with hundreds of users on a PC that wasn't connected to the network and we used to draw conclusions from that when it actually went big went global.",
                    "label": 0
                },
                {
                    "sent": "You everybody using it, we actually since the 90s nineties we've had a huge research lab in which to do our experiments where you get the answers more right than wrong.",
                    "label": 0
                },
                {
                    "sent": "But one of the key things that the web is taught us, and I know that the AI communities had to go through this various times is that scruffy works.",
                    "label": 0
                },
                {
                    "sent": "Error 404 was hugely important in this web.",
                    "label": 0
                },
                {
                    "sent": "Because we as human beings are not very good at organizing our information.",
                    "label": 0
                },
                {
                    "sent": "Our brain maybe.",
                    "label": 0
                },
                {
                    "sent": "But when we try to interact with machines to organize information or even with each other were very poor at tagging, adding metadata at telling assistant when we've moved a file at working out file organization structures that are abstract enough.",
                    "label": 0
                },
                {
                    "sent": "I mean the doi.",
                    "label": 0
                },
                {
                    "sent": "That's a these abstract layers will help us, but we're really generally very poor.",
                    "label": 0
                },
                {
                    "sent": "Organizing information we have to let the links fail to make the things go, otherwise it wouldn't have worked, and we've learned all that really after the fact.",
                    "label": 1
                },
                {
                    "sent": "So the web comes along with this very, very primitive hypertext model.",
                    "label": 0
                },
                {
                    "sent": "As far as I was concerned, that links were embedded in the document.",
                    "label": 0
                },
                {
                    "sent": "They were fixed points at either end.",
                    "label": 1
                },
                {
                    "sent": "There was no way of analyzing inferring information about what was linked to walked and, and we lost the conceptual and contextual link and link descriptions that we've been doing with microcosm and others in the hypertext community have been doing, and the web in its early days, and to some extent today, is really a very strangely link this world.",
                    "label": 0
                },
                {
                    "sent": "It's quite hard.",
                    "label": 0
                },
                {
                    "sent": "It is easy to, you know, make a link with HTML, but it's quite hard to decide what to link to what.",
                    "label": 0
                },
                {
                    "sent": "Once you've made it sort of fixed and it's hard, very, very hard to maintain it, which is one of the reasons we argued for separable hyper structures, but that just made the thing so damn complicated for people to get going on.",
                    "label": 0
                },
                {
                    "sent": "The other thing was even Tim didn't get his first browsers right in the sense that to always saw that the web is a readwrite environment.",
                    "label": 0
                },
                {
                    "sent": "And his first editor was but his first browser was also an editor, and it was quite complicated to use.",
                    "label": 0
                },
                {
                    "sent": "And of course the mosaic guys come along NCSA and said right, we're going to make this really simple.",
                    "label": 0
                },
                {
                    "sent": "Here's a browser and all you gotta do is type in the URL and click and go.",
                    "label": 0
                },
                {
                    "sent": "So there was no faffing around what you had to edit.",
                    "label": 0
                },
                {
                    "sent": "It was straight in and for us.",
                    "label": 0
                },
                {
                    "sent": "I used to think.",
                    "label": 0
                },
                {
                    "sent": "Well, OK, we have that in microcosm, but of course it might cause we had we had a two step process and although that worked in Word, it somehow didn't work for the web and people just wanted to click and go and Mosaic was one of the other reasons that the web took off around that 9394 time.",
                    "label": 0
                },
                {
                    "sent": "And of course for awhile there was a bit of a tussle.",
                    "label": 0
                },
                {
                    "sent": "The first web conference was in May 1994 because the Chicago Guys had set a.",
                    "label": 0
                },
                {
                    "sent": "We're gonna have a mosaic conference in October 1994 and wanted the web to be renamed Mosaic.",
                    "label": 0
                },
                {
                    "sent": "I believe it's all in Tim's book, so read the book and you'll see and Robert Robert has a book as well about all this history.",
                    "label": 0
                },
                {
                    "sent": "What's now history, reason, recent history, and so Robert and Tim wanted a web conference in certain the home of the web in 1994, it before the one in Chicago.",
                    "label": 0
                },
                {
                    "sent": "So they rushed to produce, accomplish since earning may booked an auditorium for 200 people, thinking well, maybe 200 people be interested, but you know, it's a bit of a risk.",
                    "label": 0
                },
                {
                    "sent": "And how bosses?",
                    "label": 0
                },
                {
                    "sent": "I remember them wiring at the time about whether they'd lose money on the conference course.",
                    "label": 0
                },
                {
                    "sent": "What happened was the whole world wants to turn up, and they were.",
                    "label": 0
                },
                {
                    "sent": "Having to turn people away and for a while, the web comments was the conference that you had to attend to find out about this stuff.",
                    "label": 0
                },
                {
                    "sent": "You don't have to find out about the web at a conference anymore.",
                    "label": 0
                },
                {
                    "sent": "You look on the web, but you didn't have a web in those days.",
                    "label": 0
                },
                {
                    "sent": "Find out about stuff on the web.",
                    "label": 0
                },
                {
                    "sent": "Cause as it grew.",
                    "label": 0
                },
                {
                    "sent": "If you imagine beginning courses one web server.",
                    "label": 0
                },
                {
                    "sent": "And then there's another and then another, and then more.",
                    "label": 0
                },
                {
                    "sent": "And I can remember the first website I saw apart from the CERN one was about dinosaurs in Hawaii, very famous.",
                    "label": 0
                },
                {
                    "sent": "So if I wanted to know about dinosaurs, I was fine.",
                    "label": 0
                },
                {
                    "sent": "Alright, but once and then you used to know in those days remember you used to know where to look.",
                    "label": 0
                },
                {
                    "sent": "Because people told you these are interesting websites.",
                    "label": 0
                },
                {
                    "sent": "What book on the 1st search engine is actually were lists of websites and they used to publish the new websites.",
                    "label": 0
                },
                {
                    "sent": "Can you imagine that today we got that so wrong that that's what we wanted.",
                    "label": 0
                },
                {
                    "sent": "Indexes directories to the web course?",
                    "label": 0
                },
                {
                    "sent": "What filled the gap?",
                    "label": 0
                },
                {
                    "sent": "Retrospectively.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, the search engine's and these guys came along and said we know how to make this work.",
                    "label": 0
                },
                {
                    "sent": "They published their paper in 1987.",
                    "label": 0
                },
                {
                    "sent": "Web conference about their algorithm written page, their algorithm.",
                    "label": 0
                },
                {
                    "sent": "For finding stuff on the web using the inverted matrices and.",
                    "label": 0
                },
                {
                    "sent": "Everyone said, wow, that's clever.",
                    "label": 0
                },
                {
                    "sent": "That's clever, but you can't harvest the web every day.",
                    "label": 0
                },
                {
                    "sent": "It's growing too fast.",
                    "label": 0
                },
                {
                    "sent": "How are you going to do that?",
                    "label": 0
                },
                {
                    "sent": "So then you had the engineering issue of making of making what they were doing scale and I'm sure you remember it around the time everyone was a bit worried because this Google thing.",
                    "label": 0
                },
                {
                    "sent": "They didn't have any adverts and be seemed to work.",
                    "label": 0
                },
                {
                    "sent": "When it came out and we're all bit worried that was going to disappear because there was no way of monetizing it.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "They of course came up with this very clever way of monetizing it, but they kept the game that was retrospective.",
                    "label": 0
                },
                {
                    "sent": "That wasn't all thought out before, and we're seeing it now with the social networks and and so on about.",
                    "label": 0
                },
                {
                    "sent": "And of course, what you've learned is you're monetizing what people do with your system, not the actual act selling the application itself.",
                    "label": 0
                },
                {
                    "sent": "You have to give it away for free and then build your client base effectively.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'll come back to that, but so southhampton, we had to rapidly become a web based hypertext system.",
                    "label": 0
                },
                {
                    "sent": "We turned out the link service that was in microcosm into a web based link service called the Distributed Link Service, but it was only distributed as the web was distributed.",
                    "label": 1
                },
                {
                    "sent": "We did have I had PhD students who were developing a distributed version of it and we even had a as we start around the end of the 90s.",
                    "label": 0
                },
                {
                    "sent": "We attracted Nick Jennings and Nigel Shadbolt come to Southampton so we got the intelligence in the agents.",
                    "label": 0
                },
                {
                    "sent": "We named our research group Intelligence agents multimedia.",
                    "label": 0
                },
                {
                    "sent": "Nigel was the intelligence Nix the agents and I was the multimedia and that stuck for 10 years.",
                    "label": 0
                },
                {
                    "sent": "We never were just just changing it now but we never gave us a great base from which to build.",
                    "label": 0
                },
                {
                    "sent": "As a team.",
                    "label": 0
                },
                {
                    "sent": "So we were trying to learn about being intelligent from Nigel yes, and from about agents from Nick and learning how our filters would become agents.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we developed various versions.",
                    "label": 0
                },
                {
                    "sent": "Some of you might know Dave Dir or less car from the community, not AI, but the sort of web community.",
                    "label": 0
                },
                {
                    "sent": "Did the library community.",
                    "label": 0
                },
                {
                    "sent": "All those people, David just gone to Oxford, but the others are all that still at South.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hampton and we were reffered to in the development of X link as part of XML.",
                    "label": 0
                },
                {
                    "sent": "So there was a sort of a note we call ourselves open hypermedia.",
                    "label": 1
                },
                {
                    "sent": "There was a sort of an influence community influence there, but excellent was not where we were trying to go.",
                    "label": 0
                },
                {
                    "sent": "Excellence was sort of.",
                    "label": 0
                },
                {
                    "sent": "You could put the links outside documents but they were still point to point in one way.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other stuff was still being lost, but I started to discover more about AI part from the fountain.",
                    "label": 0
                },
                {
                    "sent": "They cannot see we're bout to move Southampton when I started working with Carol Goebel, who many of you will know and started using the OH word I started to learn about ontologies.",
                    "label": 0
                },
                {
                    "sent": "And I can't remember exactly what cozy stood for, isn't it?",
                    "label": 0
                },
                {
                    "sent": "Was a Research Council project, but the OH was open.",
                    "label": 0
                },
                {
                    "sent": "It was overhyped.",
                    "label": 0
                },
                {
                    "sent": "I don't think it's ontologies, actually, but it might have been.",
                    "label": 0
                },
                {
                    "sent": "I can't remember now, but it was basically we were using carols, ontologies to decide.",
                    "label": 0
                },
                {
                    "sent": "What links to use right?",
                    "label": 0
                },
                {
                    "sent": "So again, think about the robot in the scripts last night.",
                    "label": 0
                },
                {
                    "sent": "You know this was a here's a script about music, so we use the musiclink basis and we were using ontologies and description logics.",
                    "label": 1
                },
                {
                    "sent": "And in is in the audience.",
                    "label": 0
                },
                {
                    "sent": "I'm sure who was made that work his own.",
                    "label": 0
                },
                {
                    "sent": "Well, sorry, not his own, but has developed the work and an owl and all the things that came out of that type of work.",
                    "label": 0
                },
                {
                    "sent": "And this to us was right.",
                    "label": 0
                },
                {
                    "sent": "So we're we.",
                    "label": 0
                },
                {
                    "sent": "Didn't call it the semantic web then, but I put the date on the night Einstein we were actually thinking about how we were moving to a web that where the link making was more intelligent.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We sort of get to the point where Tim starts talking about the semantic web.",
                    "label": 1
                },
                {
                    "sent": "And he had this right back at the very beginning.",
                    "label": 0
                },
                {
                    "sent": "Again, if you read his book, this was all part of the original vision that we linked data as well as documents, and that we had structured documents.",
                    "label": 0
                },
                {
                    "sent": "The that's XML.",
                    "label": 0
                },
                {
                    "sent": "Well, he yes, that grew out of HTML, of course, but.",
                    "label": 0
                },
                {
                    "sent": "The URLs became you arise so abstract, more abstract rather than addresses.",
                    "label": 0
                },
                {
                    "sent": "We would develop a new resource description framework for handling data as well as documents.",
                    "label": 0
                },
                {
                    "sent": "And if you did that, if you published data, you have to describe.",
                    "label": 0
                },
                {
                    "sent": "What that date is about, so you have to get into some sort of vocabulary, taxonomy or ontology.",
                    "label": 0
                },
                {
                    "sent": "Once you've done all that, then you can start getting into the whole inference proof and the trust that you know you can start inferring things, asking questions, getting answers, and having some idea of whether those answers are correct or not.",
                    "label": 0
                },
                {
                    "sent": "So this is where the AI community came to the fore, and basically in 1990s.",
                    "label": 0
                },
                {
                    "sent": "See Tim's publishing then in 2001 with with Jim Hendler, Jim came stars coming to web conferences.",
                    "label": 0
                },
                {
                    "sent": "There was a big cross linking between the web community and the AI community.",
                    "label": 0
                },
                {
                    "sent": "But I'm afraid at that point I think.",
                    "label": 0
                },
                {
                    "sent": "It all went into what I call.",
                    "label": 0
                },
                {
                    "sent": "Well, I can be ruder than this, but I'll call it today the IAI doldrums.",
                    "label": 0
                },
                {
                    "sent": "Trying to solve the big problems of AI.",
                    "label": 0
                },
                {
                    "sent": "Before building a dataweb.",
                    "label": 0
                },
                {
                    "sent": "It is a bit like trying to build Google before you've got the documents to show it works.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just the point I would make that RDF.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Of course, this is where I sort of get excited, because these are triples and this is.",
                    "label": 0
                },
                {
                    "sent": "This is the world are moving into now and that to me these are links because you know we designed a system.",
                    "label": 0
                },
                {
                    "sent": "We had link.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Triples so I just want to just to sort of capture that story in this in this graph.",
                    "label": 0
                },
                {
                    "sent": "Just to remind you how far we've come in an evolutionary sort of way.",
                    "label": 0
                },
                {
                    "sent": "So here's you know.",
                    "label": 0
                },
                {
                    "sent": "Back in, I don't know how much you can see.",
                    "label": 0
                },
                {
                    "sent": "This is 1991.",
                    "label": 0
                },
                {
                    "sent": "You know, when Tim's just starting to put stuff on the web?",
                    "label": 0
                },
                {
                    "sent": "Very, very no growth, no perceptible growth at all, really until you start getting mosaic, the liftoff begins here and the net and the Navigator.",
                    "label": 0
                },
                {
                    "sent": "Sorry the browser wars.",
                    "label": 0
                },
                {
                    "sent": "As that becomes Netscape Navigator and then Bill Gates famously says off the network.",
                    "label": 0
                },
                {
                    "sent": "Yes, we do need that will make it part of every operational system.",
                    "label": 0
                },
                {
                    "sent": "Internet Explorer emerges here.",
                    "label": 0
                },
                {
                    "sent": "The.com boom, Amazon here, the.com boom.",
                    "label": 0
                },
                {
                    "sent": "This is this.",
                    "label": 0
                },
                {
                    "sent": "Is this graph produced by one of my PhD students, Mark Schuler, and he's put the bubble as a bubble.",
                    "label": 0
                },
                {
                    "sent": "People started trying to sell stuff on the web there, and when that bubble burst here, I remember somebody in one of the American newspapers writing about.",
                    "label": 0
                },
                {
                    "sent": "Well, that was the end of Internet shopping.",
                    "label": 0
                },
                {
                    "sent": "Why all these people lost a lot of money trying to sell things on the Internet?",
                    "label": 0
                },
                {
                    "sent": "It's never going to work, so just forget about it guys.",
                    "label": 0
                },
                {
                    "sent": "This is the first of many bubbles we've had.",
                    "label": 0
                },
                {
                    "sent": "Of course, people never learn the lesson, but when you look at what's happening first of all, the emergence of Google is around here.",
                    "label": 0
                },
                {
                    "sent": "One of the big tipping points was, you know, you had to have something like Google so the web could get could scale was once it went over million 100 thousand 100,000 sites, you couldn't register the new ones every day.",
                    "label": 0
                },
                {
                    "sent": "You had to be able to search the documents that were going up there.",
                    "label": 0
                },
                {
                    "sent": "Day on day on day you had to be able to.",
                    "label": 0
                },
                {
                    "sent": "You had to learn to harvest the web, search it and that's what Google introduced us to.",
                    "label": 0
                },
                {
                    "sent": "But the underlying technology, here Wi-Fi is introduced just before the turn of the century, and broadband comes along here.",
                    "label": 0
                },
                {
                    "sent": "So when people are trying to sell goods on the Internet, who are they selling too?",
                    "label": 0
                },
                {
                    "sent": "Nobody had a computer in their homes.",
                    "label": 0
                },
                {
                    "sent": "Do you remember the world wide wait?",
                    "label": 0
                },
                {
                    "sent": "Do you remember the modem and that awful sound?",
                    "label": 0
                },
                {
                    "sent": "If you go to the computer History Museum in the Silicon Valley is a lovely hypertext web section did done by someone who really understands the world.",
                    "label": 0
                },
                {
                    "sent": "So much so that there's a copy of microcosm in there.",
                    "label": 0
                },
                {
                    "sent": "But it's all about the web, of course, and you can actually press a button and hear that sound all full modem sound.",
                    "label": 0
                },
                {
                    "sent": "And then Crash is gone.",
                    "label": 0
                },
                {
                    "sent": "So few people had computers in the home and people you know mobile phones didn't exist where they might have done, but they were bricks that so.",
                    "label": 0
                },
                {
                    "sent": "You know they're selling into markets a bit like you know when the printing press came along and people started selling books to a community that couldn't read.",
                    "label": 0
                },
                {
                    "sent": "You know this.",
                    "label": 0
                },
                {
                    "sent": "These things are doomed to failure in the early adopter world and investors.",
                    "label": 0
                },
                {
                    "sent": "Don't learn though, do they?",
                    "label": 0
                },
                {
                    "sent": "They still pay stupid prices for things that look popular anyway, so you can see the development here that the things that started to emerge as the technology developed.",
                    "label": 0
                },
                {
                    "sent": "We talk about Web 2.0 or it was famously coined the phrase Web 2.0.",
                    "label": 0
                },
                {
                    "sent": "Really, when people were able to to start to be able to write.",
                    "label": 0
                },
                {
                    "sent": "On the web without having to learn gobbledegook, such as HTML, so blogs started to emerge and the social networks started to vote.",
                    "label": 0
                },
                {
                    "sent": "As the browsers became more mature and it's, but it's often the technology follows what people do.",
                    "label": 0
                },
                {
                    "sent": "So as the as the browsers became more interactive, people started putting Diaries on the web or web log.",
                    "label": 0
                },
                {
                    "sent": "It's a blog and the technology developers so people shall develop a general piece of blog software that anyone can download.",
                    "label": 0
                },
                {
                    "sent": "And it's.",
                    "label": 0
                },
                {
                    "sent": "They see what people are doing with it and then develop the tools to enable everybody to do that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "With this stops here I'll get Mark to do 2011, but basically we're into the Mobile World now, but three phases here.",
                    "label": 0
                },
                {
                    "sent": "I just want to pick up on.",
                    "label": 0
                },
                {
                    "sent": "I talked about the big at the beginning of the web was read only and Tim didn't think that was very exciting place to be, but it was enough.",
                    "label": 0
                },
                {
                    "sent": "It was just more than you had before.",
                    "label": 0
                },
                {
                    "sent": "And then it became really right and then we move.",
                    "label": 0
                },
                {
                    "sent": "We're in the social work phase.",
                    "label": 0
                },
                {
                    "sent": "And what new when early adopters started to use the web?",
                    "label": 0
                },
                {
                    "sent": "When you very first start using it, I'm sure you remember you would just be very surprised if what you were looking for was there.",
                    "label": 0
                },
                {
                    "sent": "And in the second phase, as it started to more and more stuff becomes available, you would look for something and you'd hope it be there.",
                    "label": 0
                },
                {
                    "sent": "You'd hope you find a Dictionary of some sort you can use.",
                    "label": 0
                },
                {
                    "sent": "You'd hope you defined an online encyclopedia, won't necessarily very good, but you'd hope you find some something about what your local community offered.",
                    "label": 0
                },
                {
                    "sent": "That's where we are with the web now.",
                    "label": 1
                },
                {
                    "sent": "What's the word?",
                    "label": 0
                },
                {
                    "sent": "Do you use?",
                    "label": 0
                },
                {
                    "sent": "I would use expect.",
                    "label": 0
                },
                {
                    "sent": "If you look for something on the web, you expect it to be there any more or less.",
                    "label": 0
                },
                {
                    "sent": "Expect what you want to find to be at the top of those lists, and less.",
                    "label": 0
                },
                {
                    "sent": "It's a more complex query, so.",
                    "label": 0
                },
                {
                    "sent": "We're into the expect phase and was that way.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next phase is going to be.",
                    "label": 0
                },
                {
                    "sent": "We are, of course.",
                    "label": 0
                },
                {
                    "sent": "So we're into this sort of everybody puts everything on the web amazing.",
                    "label": 0
                },
                {
                    "sent": "Insights into human behavior.",
                    "label": 0
                },
                {
                    "sent": "Many of these things, as I said, we communication is one of the great drivers I think of us as human beings.",
                    "label": 0
                },
                {
                    "sent": "And why wouldn't people want to use this to communicate with used every other technology that's being developed to communicate, so it's almost inevitable.",
                    "label": 0
                },
                {
                    "sent": "The flickers and the you tubes and my spaces that became Facebook.",
                    "label": 0
                },
                {
                    "sent": "Very interesting, Lee, I don't.",
                    "label": 0
                },
                {
                    "sent": "If you thought about this, to me this is interesting.",
                    "label": 0
                },
                {
                    "sent": "The web is universal and free and decentralized.",
                    "label": 0
                },
                {
                    "sent": "It's a word I haven't used its decentralized.",
                    "label": 0
                },
                {
                    "sent": "That's how it works.",
                    "label": 0
                },
                {
                    "sent": "The tends to give rise to monopolies.",
                    "label": 0
                },
                {
                    "sent": "There's sort of like there are lots of search engines, but what's the one that really rolls off?",
                    "label": 0
                },
                {
                    "sent": "Everyone with the press always talk about Google.",
                    "label": 0
                },
                {
                    "sent": "There's sort of 1 shop and one auction house, and it's different for different cultures.",
                    "label": 0
                },
                {
                    "sent": "I'm thinking in the English speaking world at the moment, but there are monopolies in the other cultures as well.",
                    "label": 0
                },
                {
                    "sent": "There's one Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "There's one that big cause.",
                    "label": 0
                },
                {
                    "sent": "The power of the web is that.",
                    "label": 0
                },
                {
                    "sent": "Are you right to it?",
                    "label": 0
                },
                {
                    "sent": "Because you know you can have millions of eyeballs looking at it and that also self helps the self correction.",
                    "label": 0
                },
                {
                    "sent": "So if it basically either everybody uses something or.",
                    "label": 0
                },
                {
                    "sent": "It gets very fragmented and what's the point of having a social network that the people you want to be your friends aren't part of?",
                    "label": 0
                },
                {
                    "sent": "Alright, you're gonna go that you know we've got Google Plus coming out and there's a lot of talk about it.",
                    "label": 0
                },
                {
                    "sent": "And then what?",
                    "label": 0
                },
                {
                    "sent": "They are the balance between Google Plus and Facebook with very interesting to see how that evolves.",
                    "label": 0
                },
                {
                    "sent": "And there are.",
                    "label": 0
                },
                {
                    "sent": "Some very key figures the hubs, but if they move huge parts of the web world, go with them.",
                    "label": 0
                },
                {
                    "sent": "So it's the hubs you gotta get if you want to move, move the world.",
                    "label": 0
                },
                {
                    "sent": "Twitter is my favorite.",
                    "label": 0
                },
                {
                    "sent": "I don't do Facebook much, but I do love Twitter.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tweeting Wikipedia was a bit of a surprise to me and to Jimmy Wales and others who founded it that we could have a not develop an online.",
                    "label": 0
                },
                {
                    "sent": "Have the effort to develop an online encyclopedia in the way we have, and again, I mean you say well, why is it going to work?",
                    "label": 0
                },
                {
                    "sent": "Why ay people gonna do it?",
                    "label": 0
                },
                {
                    "sent": "And will it be correct?",
                    "label": 0
                },
                {
                    "sent": "Well it's correct because it's dynamic and people if they see mistakes self correct?",
                    "label": 0
                },
                {
                    "sent": "I mean I know there's problems about policing and security and other sites that are controversial, but generally for cyantific staff and factual staff and biographies.",
                    "label": 0
                },
                {
                    "sent": "It's fantastic, Can you imagine a world without Wikipedia these days?",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Twitter this is a graph I should get it updated.",
                    "label": 0
                },
                {
                    "sent": "It stops in 09 as a PhD student did it and then disappeared to China to start his own company.",
                    "label": 1
                },
                {
                    "sent": "But basically the red line is the growth of Twitter and he put on it a few sort of remarkable things.",
                    "label": 0
                },
                {
                    "sent": "Like when Nigel joined Twitter these are the early adopters.",
                    "label": 0
                },
                {
                    "sent": "This is Stephen Fry in the UK famous comedian.",
                    "label": 0
                },
                {
                    "sent": "He's a huge hub on on the web and he fake Twitters tweets all the time and he famously treated from a lift.",
                    "label": 0
                },
                {
                    "sent": "An elevator in the summer of 2008 to say we're stuck in the lift.",
                    "label": 0
                },
                {
                    "sent": "And the reason he could do that was because he had just bought an iPhone 3G.",
                    "label": 0
                },
                {
                    "sent": "So, although there's no can't prove it, there's no sort of correlation.",
                    "label": 0
                },
                {
                    "sent": "But if you look at the growth of the 3G phones, I mean clearly people if they can tweet on the move, you can tweet more and it becomes this.",
                    "label": 0
                },
                {
                    "sent": "Broadcast medium again with huge hubs.",
                    "label": 0
                },
                {
                    "sent": "Have great followings.",
                    "label": 0
                },
                {
                    "sent": "If there was a new Twitter you'd have to move Stephen Fry to it to get people to use it in America is all sorts of other things happen in the presidential election in 2008.",
                    "label": 0
                },
                {
                    "sent": "In the miracle on the Hudson and this is Gordon Brown's wife and the swine flu.",
                    "label": 0
                },
                {
                    "sent": "See I'm I'm very late adopter.",
                    "label": 0
                },
                {
                    "sent": "I didn't go on until April 2009, but these are.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All interesting stories about the growth of the web just got a little sidetracked here, and then I'll come back to finishing about where I think the semantic web isn't is going.",
                    "label": 0
                },
                {
                    "sent": "All this stuff I've talked about is what I would now call because we coined this term for good or bad web science in 2006 that this phenomenon is not.",
                    "label": 0
                },
                {
                    "sent": "You can't understand it just as a technologist and you can't understand it just as a social science.",
                    "label": 0
                },
                {
                    "sent": "We need GNU tools, techniques, methodologies to understand it.",
                    "label": 1
                },
                {
                    "sent": "It's it's, it evolves faster than we can observe it.",
                    "label": 0
                },
                {
                    "sent": "It changes faster than we can observe it.",
                    "label": 0
                },
                {
                    "sent": "I don't think there's been anything like that before that we've needed to study.",
                    "label": 0
                },
                {
                    "sent": "When you think about the way the climate changes, it's you know, over decades, centuries, the web is changing as I speak.",
                    "label": 0
                },
                {
                    "sent": "This sentence constantly changing and in order to study it and draw lessons and understand better how to build better systems and predict what people are going to do with the technology we build for good or bad, we have to understand both the social and the technical.",
                    "label": 0
                },
                {
                    "sent": "It's a massive, complex social technical.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "System so we in 2006 I'm not.",
                    "label": 0
                },
                {
                    "sent": "This isn't a websites talk, so I'm just going to flash a few slides past you.",
                    "label": 0
                },
                {
                    "sent": "We set up we being MIT, Southampton, Tim myself, Danny Dietz and Nigel Shadbolt thing.",
                    "label": 0
                },
                {
                    "sent": "We called the websites Research Initiative which is grown into the websites trust which promotes research, education, thought.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shipping websites we run conferences and summer schools and curriculum workshops.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We talk about what websites is and what it isn't.",
                    "label": 0
                },
                {
                    "sent": "It's lots of things coming together, but it's not the union of all those, but it's certainly more than there intersection.",
                    "label": 1
                },
                {
                    "sent": "It's different pieces of those subjects that we need to complete the pitch.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Designing a website curriculum is a very interesting thing.",
                    "label": 0
                },
                {
                    "sent": "We felt we needed a banner to court poor people under.",
                    "label": 0
                },
                {
                    "sent": "That was because if we felt we developed it under computer science, it wouldn't take on it full.",
                    "label": 0
                },
                {
                    "sent": "Power, rather like computer science had to emerge from electrical engineering in the 1960s.",
                    "label": 0
                },
                {
                    "sent": "We web scientist study things like shape and structure.",
                    "label": 0
                },
                {
                    "sent": "I mean this was people were doing this before we coined the phrase, but it's like it's this banner.",
                    "label": 0
                },
                {
                    "sent": "It's saying this is this is good academic stuff, good research stuff and it's stuff that businesses need to need in order to.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go on the Internet.",
                    "label": 0
                },
                {
                    "sent": "I've talked about.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Written page who changed the structure of the web and this is the sort of circle of development that we tend we talk about in terms of you develop a technology to meet the social need, but you have to build in the small just like Tim with the first website and this is a very important lesson for the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Alright, I'll say it now in case I forget.",
                    "label": 0
                },
                {
                    "sent": "Basically, in trying to work out the theory of the semantic web before the data exists to do the do, the practical is the wrong is potentially the wrong way round.",
                    "label": 0
                },
                {
                    "sent": "Just as it would have been with the first web.",
                    "label": 0
                },
                {
                    "sent": "So 'cause you have to build stuff in the small, you can't do the experiments like we do in computer science that test it and then try it out with some users and then refine it.",
                    "label": 0
                },
                {
                    "sent": "And that's not how it works.",
                    "label": 0
                },
                {
                    "sent": "Things go viral and understanding that going viral is a very important part of websites and we don't know how from that initial Google site that they launched in 1980, nineteen, 98, or 99, whenever it was to the phenomenon that Google is today understanding.",
                    "label": 0
                },
                {
                    "sent": "That is a very.",
                    "label": 0
                },
                {
                    "sent": "Difficult journey.",
                    "label": 0
                },
                {
                    "sent": "We've watched them live it, but once it goes big then you can start analyzing it and you can see what the bad things that people do with it as well as the good and you.",
                    "label": 0
                },
                {
                    "sent": "Then you start you start going around the circle again because you've got to actually solve some of the issues that come up with Google spoofing or spamming.",
                    "label": 0
                },
                {
                    "sent": "And all that sort of thing so.",
                    "label": 0
                },
                {
                    "sent": "And really, I like to describe websites today as the theory and practice of social machines.",
                    "label": 0
                },
                {
                    "sent": "Tim talked about social machines in his book, weaving the web.",
                    "label": 1
                },
                {
                    "sent": "That's what we're building a social machines, and it is a new concept.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We haven't had before.",
                    "label": 0
                },
                {
                    "sent": "We have to have a bit of networks.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Silence in the web.",
                    "label": 0
                },
                {
                    "sent": "Emergent problem solving Galaxy, so is a fantastic example of citizen science, which is what I think one of the big legacies of the web will be getting people who know nothing really about science to do things like classify galaxies right.",
                    "label": 1
                },
                {
                    "sent": "Hopefully this will encourage more and more people to get involved in.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Science, another one is Louis Van Onze crowdsourcing amazing that you can get for free people to solve huge problems that makes money.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For industry.",
                    "label": 0
                },
                {
                    "sent": "And the cool thing this is the last phase of my talk now is the we're now seeing.",
                    "label": 0
                },
                {
                    "sent": "This is a slide.",
                    "label": 0
                },
                {
                    "sent": "Nigel did the emergent data.",
                    "label": 0
                },
                {
                    "sent": "This is very sort of euro perspective of.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data that's emerging on the web and we've been talking about the semantic web for 10 years, and I think we just, well, Tim's been talking about it for a lot longer than that.",
                    "label": 0
                },
                {
                    "sent": "We've just beginning to see.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What it might look like, Jim gave a talk at the European Semantic Web conference this year, which he called.",
                    "label": 0
                },
                {
                    "sent": "Why the semantic web will never work in quotes, and I urge you to look the slides around the web.",
                    "label": 0
                },
                {
                    "sent": "I urge you to look at his slides.",
                    "label": 0
                },
                {
                    "sent": "He says sorry not in Ryan, 'cause Jim often does stuff in poetry is very clever like that.",
                    "label": 0
                },
                {
                    "sent": "But anyway, basically this is his 10 year retrospective from when he published the paper with Tim about the semantic web that was full of agents for agents were going to do.",
                    "label": 0
                },
                {
                    "sent": "I know, but those agents can't do anything until they've got the data on which to do things with.",
                    "label": 0
                },
                {
                    "sent": "So this is one of the amazing most important lessons we've learned as we've tried to build it in nine in 2006.",
                    "label": 0
                },
                {
                    "sent": "Nigel, Tim and I wrote a paper in IEEE.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Intelligent Systems, which team had?",
                    "label": 0
                },
                {
                    "sent": "It's so these are actually the four principles of the semantic web.",
                    "label": 1
                },
                {
                    "sent": "It all boils down to there's no mention ontologies in here.",
                    "label": 0
                },
                {
                    "sent": "It all boils down to create your eyes or URLs.",
                    "label": 0
                },
                {
                    "sent": "If you must still use HTTP.",
                    "label": 0
                },
                {
                    "sent": "Describe the data using RDF or something like RDF.",
                    "label": 0
                },
                {
                    "sent": "That gives you that that very open scalable structure of a triple.",
                    "label": 0
                },
                {
                    "sent": "Can be done in XML.",
                    "label": 0
                },
                {
                    "sent": "RDF is much more much easier to use for this and link it.",
                    "label": 0
                },
                {
                    "sent": "The key thing here is putting out datasets an linking them and seeing what that.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will bring to give us and the growth of the web in the last four years.",
                    "label": 0
                },
                {
                    "sent": "Updated data on the web.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is there available from the dairy webs.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you can just see how it's grown that was last year, September 2010, and it's probably doubled since then.",
                    "label": 0
                },
                {
                    "sent": "I think he's doubling every few months now.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It really is beginning to emerge.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One of the major tipping points was work that Jim and Tim and Nigel had done with open government data.",
                    "label": 1
                },
                {
                    "sent": "We had a project act many of you will have heard Nigel talk about advanced knowledge technologies and this is public service sector information that led to what happened in the UK.",
                    "label": 0
                },
                {
                    "sent": "Actually it was Tim having lunch with Gordon Brown at Checkers and Gordon Brown said, what can I do to help you do and you know that wasn't bad as it continues head.",
                    "label": 1
                },
                {
                    "sent": "Put your data on the web.",
                    "label": 0
                },
                {
                    "sent": "So we did.",
                    "label": 0
                },
                {
                    "sent": "Thing is, Golden Brown did before he lost the election was to put the UK government data on the web.",
                    "label": 0
                },
                {
                    "sent": "Then Tim and I just had to persuade the new Prime Minister to do it, but they have done that hugely successfully.",
                    "label": 0
                },
                {
                    "sent": "So the UK is a powerhouse in this area.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, on the other side, Atlanta, who would say they started it 'cause Obama announced first he was going to use open data has grown dramatically and is this big battle that I'm bout who's got the most datasets out there and many other governments are now following suit.",
                    "label": 0
                },
                {
                    "sent": "It's very interesting that for the data web.",
                    "label": 0
                },
                {
                    "sent": "It's the public sector that's driving is come out of.",
                    "label": 0
                },
                {
                    "sent": "Research them into the public sector.",
                    "label": 0
                },
                {
                    "sent": "The first web was very much driven by the commercial sector.",
                    "label": 0
                },
                {
                    "sent": "Once it came out of the research lab and the public sector came much later.",
                    "label": 0
                },
                {
                    "sent": "It was very difficult to get governments and public bodies and universities to put their data on the web.",
                    "label": 0
                },
                {
                    "sent": "It's the other way around now, and it's all to do with the timing and why the governments want data on the web, not because they understand the technology, but because of this battle for transparency and open this.",
                    "label": 0
                },
                {
                    "sent": "Which is come about because of the word.",
                    "label": 1
                },
                {
                    "sent": "But they can't keep the secrets anymore like they used to.",
                    "label": 0
                },
                {
                    "sent": "And so it's very interesting how this is evolving.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you can look at this is the pictures from the.",
                    "label": 0
                },
                {
                    "sent": "Well I say from the UK site there's one from Australia here New Zealand.",
                    "label": 0
                },
                {
                    "sent": "I can't even read those.",
                    "label": 0
                },
                {
                    "sent": "Many governments would be.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going to do this.",
                    "label": 0
                },
                {
                    "sent": "The UK we've got our local authority data coming out which is driving amazing changes in terms of what people know about their local authority and when you link it all up, you can find out who does collect your dustbins once a week or twice a week and where is that?",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do it.",
                    "label": 0
                },
                {
                    "sent": "Cities London is an example.",
                    "label": 0
                },
                {
                    "sent": "Cities that are putting the data out.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the web.",
                    "label": 0
                },
                {
                    "sent": "The reason is transparency, accountability and down.",
                    "label": 1
                },
                {
                    "sent": "The line efficiencies, economies and social.",
                    "label": 1
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Values we think when he put the data out, the world begins to develop applications.",
                    "label": 0
                },
                {
                    "sent": "One of the first an asbo in the UK is an antisocial behavior order.",
                    "label": 0
                },
                {
                    "sent": "If you do something nasty like knocking someones dustbin over or pulling the Flowers out of their garden and your court, they won't send you to prison.",
                    "label": 0
                },
                {
                    "sent": "You get an asbo alright, which means it's a warning really I think and your name goes on the police register so when they put published where the Asbos were or which councils had what number of Asbos.",
                    "label": 0
                },
                {
                    "sent": "That was immediately put into an Asbo app so you can see where the worst as both spots in the UK were people have used it to help find dentists.",
                    "label": 0
                },
                {
                    "sent": "We have a shortage of National Health dentists in the UK.",
                    "label": 0
                },
                {
                    "sent": "There's the tube map.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "It's just like the first web when you put the stuff out there free and open, the world develops applications you don't have to do all that work yourself and I still haven't mentioned the ontology word.",
                    "label": 0
                },
                {
                    "sent": "The governments put it spend.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hang up.",
                    "label": 0
                },
                {
                    "sent": "And most recently put a crime data up, which is quite controversial because no one wants to know they live in a high crime area, but it's, you know.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's important data that we know and Tim has.",
                    "label": 0
                },
                {
                    "sent": "It made it even easier for people now with his five stars voting data.",
                    "label": 0
                },
                {
                    "sent": "Firstly, put your data out.",
                    "label": 1
                },
                {
                    "sent": "If you look at this Ted talk, give me your data you gave me your documents, give me your data.",
                    "label": 0
                },
                {
                    "sent": "Just think about it.",
                    "label": 1
                },
                {
                    "sent": "The the web became the world's document management system.",
                    "label": 0
                },
                {
                    "sent": "It's about to become the world's database.",
                    "label": 0
                },
                {
                    "sent": "Imagine the power of a database the size of the web.",
                    "label": 0
                },
                {
                    "sent": "That's all interlinked and that you can actually find information out about my comparison of, you know, cancer statistics in London and Sydney or Jamaica or and pull that together.",
                    "label": 0
                },
                {
                    "sent": "Just imagine the power of that, so put your data out there.",
                    "label": 0
                },
                {
                    "sent": "Make it structure.",
                    "label": 0
                },
                {
                    "sent": "This even better.",
                    "label": 0
                },
                {
                    "sent": "Use open standard formats.",
                    "label": 0
                },
                {
                    "sent": "Even better, use URLs or Ur eyes to identify things.",
                    "label": 1
                },
                {
                    "sent": "Even an most best of all link it.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we'll see all sorts of wonderful things emerged.",
                    "label": 0
                },
                {
                    "sent": "Now I'm running out of time.",
                    "label": 0
                },
                {
                    "sent": "Can I just show a quick demo?",
                    "label": 0
                },
                {
                    "sent": "No yes.",
                    "label": 0
                },
                {
                    "sent": "But what time did I start?",
                    "label": 0
                },
                {
                    "sent": "An hour ago, or, well, OK, I won't.",
                    "label": 0
                },
                {
                    "sent": "Then you can play with this.",
                    "label": 0
                },
                {
                    "sent": "So Hampton universities put it stays online and we hope all universities will follow suit.",
                    "label": 0
                },
                {
                    "sent": "And the thing about the data web is remember how you learned to use the first web you copied?",
                    "label": 0
                },
                {
                    "sent": "You copied how other people did their documents.",
                    "label": 0
                },
                {
                    "sent": "So this is how it's emergent in the semantic web.",
                    "label": 0
                },
                {
                    "sent": "You copy how other people structure their data.",
                    "label": 0
                },
                {
                    "sent": "So the ontologies I've used the OH word are emerging from simple things that people start their emerging evolving southamptons put it stays shopping rather than demo it our catering, Sir.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is all now so excited about the fact that the students know where the catering are, 'cause everything is in open data.",
                    "label": 0
                },
                {
                    "sent": "So you can now type in coffee on this beta test for the catering services and it will.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tell you where you can get your coffees and if you drill down, you can find out when they're open.",
                    "label": 0
                },
                {
                    "sent": "That's hugely fantastic.",
                    "label": 0
                },
                {
                    "sent": "To know where you can get a coffee on campus and it's all being driven by open data and the catering services have built this app themselves.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "And this is, you know, you can drill down.",
                    "label": 0
                },
                {
                    "sent": "That's why the coffee in the outlook bar.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's not open yet.",
                    "label": 0
                },
                {
                    "sent": "We gotta.",
                    "label": 0
                },
                {
                    "sent": "I didn't put a bus one in.",
                    "label": 0
                },
                {
                    "sent": "There's a bus route so I could show you the demo that we can put.",
                    "label": 0
                },
                {
                    "sent": "Finally, where bus stops are is quite interesting.",
                    "label": 0
                },
                {
                    "sent": "the UK found it had a lot.",
                    "label": 0
                },
                {
                    "sent": "They're all in different places where it thought it was all the bus stops in the UK are up on the web.",
                    "label": 0
                },
                {
                    "sent": "Now we've got the bus stops in Southampton.",
                    "label": 0
                },
                {
                    "sent": "If I showed you the data you could drill down, look at where you are University campus, drill down again and see when the buses are going to arrive.",
                    "label": 0
                },
                {
                    "sent": "People are building data and of course.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They're building it in the Mobile World.",
                    "label": 0
                },
                {
                    "sent": "These are things that students are doing and picking up the data.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And running with it.",
                    "label": 0
                },
                {
                    "sent": "So my conclusions to be this is the last slide of gyms, while the semantic Web web will never work talk, there is no reason at all.",
                    "label": 0
                },
                {
                    "sent": "It is here, it's working and it will continue to do so.",
                    "label": 0
                },
                {
                    "sent": "But for it to move to the next level is where you come in.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Foot to move that someone be all that weird communitive aspired for it we've gotta revisit and update early versions of modern web.",
                    "label": 0
                },
                {
                    "sent": "We gotta unify the competing models of linked data machine readable vocabularies and we must step up to some of the critical research.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Challenges are making this work on a global basis and these are my summer is to me.",
                    "label": 0
                },
                {
                    "sent": "It's all about linking the exciting thing about linked data is the linking.",
                    "label": 1
                },
                {
                    "sent": "I want to build semantic web link services.",
                    "label": 0
                },
                {
                    "sent": "My linked databases have become triple stores and I'm hugely excited about playing with those.",
                    "label": 1
                },
                {
                    "sent": "It's not all about visualizing huge link datasets.",
                    "label": 1
                },
                {
                    "sent": "It's about integrating document and data webs that companies have come up with schema.org.",
                    "label": 0
                },
                {
                    "sent": "Where will that take us?",
                    "label": 0
                },
                {
                    "sent": "Please keep the ontologist simple.",
                    "label": 0
                },
                {
                    "sent": "Don't worry about them being overly complicated.",
                    "label": 0
                },
                {
                    "sent": "Let them involved.",
                    "label": 0
                },
                {
                    "sent": "And then you can someone, somebody out here is going to be the next Google.",
                    "label": 0
                },
                {
                    "sent": "It could be Google, but it could be somebody else.",
                    "label": 0
                },
                {
                    "sent": "It could be one of you in this audience that works out how to do this on a grand scale so we can find data and link it on the on the open web.",
                    "label": 0
                },
                {
                    "sent": "I do wonder what's happened to the agents and we do need them, so please agents.",
                    "label": 0
                },
                {
                    "sent": "People start looking at this web again and thinking what your agents can do with it.",
                    "label": 1
                },
                {
                    "sent": "And the hard work for this community has yet to come.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And as Ted Ted said, everything really is deeply into twinkles.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "The context of open.",
                    "label": 0
                },
                {
                    "sent": "Without the publishing public comment about the WikiLeaks phenomenally well, wiki leaks is part of the reason that the governments are putting their data out because they realized the cat is out of the bag.",
                    "label": 0
                },
                {
                    "sent": "So, and it was inevitable really that this would happen because people have always leaked information.",
                    "label": 0
                },
                {
                    "sent": "In fact, the UK is suffering from a major crisis.",
                    "label": 0
                },
                {
                    "sent": "The media hacking into information rather than it being leaked when, and I think so, it was inevitable.",
                    "label": 0
                },
                {
                    "sent": "And I think I think that this is what's driving more openness and transparency to be honest.",
                    "label": 0
                },
                {
                    "sent": "Asking this question for 10 years and I'm not sure I got it from your talks all ask it again that seems to be the hardest thing about the semantic web is keeping the links and everything on top of it.",
                    "label": 0
                },
                {
                    "sent": "It's like the code, it's like code and documentation.",
                    "label": 0
                },
                {
                    "sent": "It's always going to keep diverging and every time they do get an agent application that works for awhile and within a month it doesn't work anymore because I should say that I'm in so it seems to me levels well.",
                    "label": 0
                },
                {
                    "sent": "the iPod before most of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "No, you put the wrong way around.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you think about.",
                    "label": 0
                },
                {
                    "sent": "How Google emerged?",
                    "label": 0
                },
                {
                    "sent": "What we need are those ideas that are that do evolve as the web of data evolves, that's what you gotta come up with such your problem, not ours.",
                    "label": 0
                },
                {
                    "sent": "We are going to give you the data you've now got to work out how to how to manage that on a constantly changing.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, just that.",
                    "label": 0
                },
                {
                    "sent": "You know you haven't got there yet and there's a major research challenge.",
                    "label": 0
                },
                {
                    "sent": "But The thing is what we're doing is building you a fantastic research lab.",
                    "label": 0
                },
                {
                    "sent": "Well, that's what the first word was.",
                    "label": 0
                },
                {
                    "sent": "A fantastic research level hypertext community and the information retrieval community, and we got there.",
                    "label": 0
                },
                {
                    "sent": "But if you try and do it without that data there, I think you're always going to end up with the systems that only work for a month, right?",
                    "label": 0
                },
                {
                    "sent": "You've got to get the constantly changing.",
                    "label": 0
                },
                {
                    "sent": "Interlinked across the world applications right?",
                    "label": 0
                },
                {
                    "sent": "So you gotta think out of the box I'm afraid.",
                    "label": 0
                },
                {
                    "sent": "My call to you guys get it right please.",
                    "label": 0
                },
                {
                    "sent": "Coffee awaits it.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, thanks.",
                    "label": 0
                }
            ]
        }
    }
}