{
    "id": "m6hxc3stpebhh27anij574ucs6z4d7ci",
    "title": "Transfer Learning for Collaborative Filtering via a Rating-Matrix Generative Model",
    "info": {
        "coauthor": [
            "Bin Li, Department of Computer Science and Engineering, Fudan University"
        ],
        "published": "Aug. 26, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Computer Science->Network Analysis->Social Networks",
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/icml09_li_tlcfvrmgm/",
    "segmentation": [
        [
            "Good afternoon everyone.",
            "My topic is transfer training for collaborative filtering via rating matrix generative model and we aim to alleviate the sparsity problem in collaborative filtering by learning from multiple related CF tasks.",
            "This is joint work with Young Chung from Hong Kong University of Science and Technology and structure of the University."
        ],
        [
            "And this is the outline.",
            "First, I will state the motivation and next I will introduce the proposed rating matrix, generative model.",
            "And finally I will report the experimental results and let's."
        ],
        [
            "Begin with motivation.",
            "Sparsity problem is a major bottleneck for CF."
        ],
        [
            "And basically speaking, most CFOs methods are based on the idea of discovering latent user item clusters and try to sharing rating knowledge within clusters and look at this example.",
            "This is a sparse rating matrix and we try to cluster users and simultaneously cluster users and items and we can.",
            "Get a block matrix and based on the class result we can.",
            "Fix the missing values based on the user and item neighbors.",
            "But in real world case.",
            "User Kelly can rating a very limited number of ratings and the rating matrix is usually too sparse to well classed."
        ],
        [
            "So we wanted to share some knowledge."
        ],
        [
            "From the other domain domain.",
            "So idea is to pull the rating data from multiple related CF domains to discover better latent structure.",
            "Look at this bigger.",
            "This is rating matrix, but if I don't tell you where it is from.",
            "You don't know what it is.",
            "It came, it came from either movie or book or whatever website.",
            "For example, we just use movie and book website for example.",
            "System.",
            "So the first 2 rows and the 2nd, the 3rd and 4th rows respectively represent user Group and 1st column repent item Group and the last two column repent neither item Group.",
            "We can, we can say the item Group A, maybe a romance movies type style and the IT also can be romantic books and the Group B can be science fiction movies and it also can be science fiction books and the user group.",
            "Maybe girls in international movie database website famous website and it also can be.",
            "Closing Amazon.",
            "Ebusiness website, so if we if we can alignment.",
            "If we keep, we can match the two websites in user groups and item groups.",
            "Then we can connect.",
            "We can relate the two rating matrix.",
            "So users are related in interest and items are related insurance.",
            "This is imperative example, suppose."
        ],
        [
            "The first CF task is, uh?",
            "For a movie website and the second one from book website and the third one from music website and the first column is the original rating matrix after code class ring that is permuted rose and costs and put the same similar users and the users items in the.",
            "Labels, then we can get a blocker block rating matrix and we can further reduce into class level rating matrices.",
            "Then we can surprise fans out.",
            "Actually, the class level rating matrix, say share share common class level matrix.",
            "Is there a subset of this class level rating matrix?",
            "Next I will introduce the proposed."
        ],
        [
            "Rating matrix generative model."
        ],
        [
            "First I will state the problem.",
            "Setting suppose we are given C rating matrices in related domains in this domain.",
            "We have users user set and item set and there's a rating.",
            "Data are represented by a set of triplets.",
            "That is a user item and a rating.",
            "And we assume that the web the user sets and.",
            "Items have no overlaps across the different domains, and the ratings should be in the same scale.",
            "For example, from 125.",
            "Our goal is to learn a rating matrix generative model for the given related tasks on the Puerto Rican data."
        ],
        [
            "And the predictive missing values in each.",
            "In each rating rating corrupt CF tasks.",
            "This is.",
            "How the if that?",
            "Intuitive example I showed previously is an ideal case in real world, users may have multiple personalities.",
            "That is, 1 people can like more than one style and the item may have multiple attributes.",
            "So user and item items should be should simultaneously belong to multiple clusters.",
            "Suppose there are K user clusters and L item clusters.",
            "The marginal distributions for users and items can be denoted.",
            "By mixture models in terms of two.",
            "Cluster latent class are variables or one is the user latent class variables and the other is the item latent class variables so.",
            "Assume the user and item in.",
            "Independent from each other.",
            "Joint use item.",
            "Joint mixture model.",
            "Just the product of these two mixture models and like this so for any user item pair from this task task can be drawn from this model joint model."
        ],
        [
            "And.",
            "For a user item called cluster, it also should be have different properties to.",
            "To give different ratings.",
            "So for the case.",
            "K&L called code cluster rating.",
            "She will be joined.",
            "I could like hers, the equation 2 this is the intuitive, intuitive, bigger.",
            "This is the ideal case and four by four class level rating matrix matrix.",
            "In the previous case and we can extend it to a class level ranking model and this is a mixture Model 2 dimensional.",
            "Rating mix tomorrow and there's a rare figure is.",
            "Rating.",
            "Is the rating most likely to appear in the in this code, clusters combining the first model and the second model gives the rating matrix generative model."
        ],
        [
            "This shows the rating matrix generating process.",
            "This this is a shared rating matrix generative model and we draw users and items.",
            "This horizontal and vertical red lines means draw users and items from the shared rating matrix, generative model and across the crossing points of the horizontal and vertical lines generates the ratings for the missing values.",
            "And also for also for the observed ratings."
        ],
        [
            "And the next."
        ],
        [
            "So I will introduce how to learn and predicting based on the rating matrix generative model.",
            "There are five sets of parameters in regulations, general model needed to learn.",
            "That is, as a prior properties over user class and the item cluster and the conditional.",
            "Properties of user and item given given there given the corresponding user class and item.",
            "Cluster, and the conditional rating properties given the code cluster.",
            "We adopted EM algorithm to learn cesvi sets of parameters in eastep the joint.",
            "Posterior probability that this this is just actually this is the membership of the given rating triplet to the Co cluster is computed using the five sets of parameters in the first round.",
            "This by set of parameters should be initialized and in M step the five sets of parameters are operated based on based on these.",
            "Membership here I sleep is a complex equation.",
            "Note all the parameters are computed on the portal rating data.",
            "And next I will introduce."
        ],
        [
            "How to predict the missing values?",
            "For for, for the existing users, that means.",
            "So this user also in the training set.",
            "It is very very very easy.",
            "Just use this equation and these parameters are learned from in the training phase and for.",
            "New user, it is a little bit a little bit.",
            "Complex and see existing user we should we should solve a quadratic optimization problem to estimate to estimate the user cluster membership.",
            "That is to say, based on the given ratings for new user we we should first estimate estimate as user user cluster membership for this new user and use this optimizing problem.",
            "But but but this.",
            "Up to or problem is very coopey program is programming problem is very simple and.",
            "After get the.",
            "He was a cluster membership.",
            "Then we can put it, put this into the above equation and use use the above equation tool director predict the missing values."
        ],
        [
            "Finally, I will report the.",
            "Experimental."
        ],
        [
            "Results the compared methods we adopted is first is Pearson correlation coefficients as the baseline and the.",
            "Secondly, the flexible mixture model this is can be viewed as a single single task version of our.",
            "Necessary.",
            "Under the datasets.",
            "We used is movielens.",
            "Each movie and book crossing as the first 2 is movie rating.",
            "Matrices under the last one is a book rating matrix.",
            "We respectively select far 500 users and.",
            "100 items from each.",
            "Rating matrix and our and our method is.",
            "Our proposed proposed model is learned from the command combined rating data of these three rating, which is under the first one.",
            "First 2 is trained respectively.",
            "Say evaluation protocol is.",
            "We have different configurations for his experiments and satis.",
            "We use first 102 hundred 300 used for training and use last 200 users for testing and given 5 or 10 and 10 and 15 observer observable.",
            "Observe the ratings for each test user and the evaluation metric is mean absolute error.",
            "This is experiment."
        ],
        [
            "Results.",
            "Uh.",
            "This is the movie lens.",
            "We can see.",
            "Our result is the best.",
            "And."
        ],
        [
            "And and the other or different experiment configurations, the Rose means the training, the training sample size and the column means the given observed ratings for each user for each user.",
            "And this is the results on each movie."
        ],
        [
            "This is results on bookcrossing.",
            "We can find our.",
            "Our method is output from the compared methods or all three datasets and and or the configurations."
        ],
        [
            "Here's a summary.",
            "Refer to related the different.",
            "Rating matches from related CF domains in class level.",
            "Rating patterns and brides via a class level rating, model and transport rating knowledge via this model and the.",
            "It is a.",
            "Each task can benefit from one another, so we can alleviate sparsity problem instead of the future work.",
            "The first one is we want to quantify the relatedness and the second one is.",
            "We can see we are considered considering and a symmetric setting.",
            "That is how to transfer knowledge from relative density rating matrix to sparse one, that's sense."
        ],
        [
            "Curious, why did you use such time datasets for your evaluation?",
            "I mean, moving lenses are fairly small data set like down you took after school.",
            "So yeah, actually we want we want to find the.",
            "Of.",
            "More larger, larger datasets, but you know we.",
            "We try to learn multiple rate rating.",
            "Matrices dirty martini asleep.",
            "But if we if we we want to the consider the rate images are of the same side of the similar size.",
            "If we if one is more larger than the others, this one will dominate the results.",
            "So.",
            "This is this, so we only try try to.",
            "Use a similar size for different tasks.",
            "So wondering if you maybe this is with your future work with talk about related this.",
            "I'm going to experiment on two datasets that are not related at all.",
            "And see that place.",
            "You improve.",
            "You look like here you are his tryout books and movies.",
            "You said these tasks are related books and something not related at all.",
            "Mr.",
            "This system may result seeing negative transport.",
            "We transfer learning only work in the different domains.",
            "Maybe 8 must be related and the next step will we want to quantify the related in this but.",
            "These preliminary work we just intuitively intuitively to.",
            "Defines a relatedness butter.",
            "Next work.",
            "We want to quantify statistically.",
            "How do you know you're not just overfitting if you're only using one data set and then by using two you're somehow regularising and then you're getting better results, you mean overfitting.",
            "Right like you, I mean, it seems like if you have very little data, right?",
            "Just be overfitting on this.",
            "Oh yeah.",
            "Data you might be just saying, well, I'm regularizes alright.",
            "This was the.",
            "If if these tasks are related, the sparse one maybe see this one.",
            "Maybe a regular regularising term for for this password, as long as they are related, just the sparse one.",
            "If we written model just for sparse one single task learning just first password, this may be result in overfitting.",
            "But if we consider if we.",
            "Learn multiple related tasks.",
            "Maybe that's where just can work as a regularization term.",
            "Final question here, how many clusters do you use for over a year?",
            "How many clusters do use OK about 2250 just by?",
            "Empirically search.",
            "OK, thank you.",
            "This concludes the session."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon everyone.",
                    "label": 0
                },
                {
                    "sent": "My topic is transfer training for collaborative filtering via rating matrix generative model and we aim to alleviate the sparsity problem in collaborative filtering by learning from multiple related CF tasks.",
                    "label": 0
                },
                {
                    "sent": "This is joint work with Young Chung from Hong Kong University of Science and Technology and structure of the University.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the outline.",
                    "label": 0
                },
                {
                    "sent": "First, I will state the motivation and next I will introduce the proposed rating matrix, generative model.",
                    "label": 0
                },
                {
                    "sent": "And finally I will report the experimental results and let's.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Begin with motivation.",
                    "label": 0
                },
                {
                    "sent": "Sparsity problem is a major bottleneck for CF.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And basically speaking, most CFOs methods are based on the idea of discovering latent user item clusters and try to sharing rating knowledge within clusters and look at this example.",
                    "label": 1
                },
                {
                    "sent": "This is a sparse rating matrix and we try to cluster users and simultaneously cluster users and items and we can.",
                    "label": 0
                },
                {
                    "sent": "Get a block matrix and based on the class result we can.",
                    "label": 0
                },
                {
                    "sent": "Fix the missing values based on the user and item neighbors.",
                    "label": 0
                },
                {
                    "sent": "But in real world case.",
                    "label": 1
                },
                {
                    "sent": "User Kelly can rating a very limited number of ratings and the rating matrix is usually too sparse to well classed.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we wanted to share some knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "From the other domain domain.",
                    "label": 1
                },
                {
                    "sent": "So idea is to pull the rating data from multiple related CF domains to discover better latent structure.",
                    "label": 1
                },
                {
                    "sent": "Look at this bigger.",
                    "label": 0
                },
                {
                    "sent": "This is rating matrix, but if I don't tell you where it is from.",
                    "label": 0
                },
                {
                    "sent": "You don't know what it is.",
                    "label": 1
                },
                {
                    "sent": "It came, it came from either movie or book or whatever website.",
                    "label": 0
                },
                {
                    "sent": "For example, we just use movie and book website for example.",
                    "label": 0
                },
                {
                    "sent": "System.",
                    "label": 0
                },
                {
                    "sent": "So the first 2 rows and the 2nd, the 3rd and 4th rows respectively represent user Group and 1st column repent item Group and the last two column repent neither item Group.",
                    "label": 1
                },
                {
                    "sent": "We can, we can say the item Group A, maybe a romance movies type style and the IT also can be romantic books and the Group B can be science fiction movies and it also can be science fiction books and the user group.",
                    "label": 0
                },
                {
                    "sent": "Maybe girls in international movie database website famous website and it also can be.",
                    "label": 0
                },
                {
                    "sent": "Closing Amazon.",
                    "label": 0
                },
                {
                    "sent": "Ebusiness website, so if we if we can alignment.",
                    "label": 0
                },
                {
                    "sent": "If we keep, we can match the two websites in user groups and item groups.",
                    "label": 0
                },
                {
                    "sent": "Then we can connect.",
                    "label": 0
                },
                {
                    "sent": "We can relate the two rating matrix.",
                    "label": 1
                },
                {
                    "sent": "So users are related in interest and items are related insurance.",
                    "label": 0
                },
                {
                    "sent": "This is imperative example, suppose.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first CF task is, uh?",
                    "label": 0
                },
                {
                    "sent": "For a movie website and the second one from book website and the third one from music website and the first column is the original rating matrix after code class ring that is permuted rose and costs and put the same similar users and the users items in the.",
                    "label": 0
                },
                {
                    "sent": "Labels, then we can get a blocker block rating matrix and we can further reduce into class level rating matrices.",
                    "label": 0
                },
                {
                    "sent": "Then we can surprise fans out.",
                    "label": 0
                },
                {
                    "sent": "Actually, the class level rating matrix, say share share common class level matrix.",
                    "label": 0
                },
                {
                    "sent": "Is there a subset of this class level rating matrix?",
                    "label": 0
                },
                {
                    "sent": "Next I will introduce the proposed.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rating matrix generative model.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First I will state the problem.",
                    "label": 0
                },
                {
                    "sent": "Setting suppose we are given C rating matrices in related domains in this domain.",
                    "label": 1
                },
                {
                    "sent": "We have users user set and item set and there's a rating.",
                    "label": 0
                },
                {
                    "sent": "Data are represented by a set of triplets.",
                    "label": 0
                },
                {
                    "sent": "That is a user item and a rating.",
                    "label": 0
                },
                {
                    "sent": "And we assume that the web the user sets and.",
                    "label": 1
                },
                {
                    "sent": "Items have no overlaps across the different domains, and the ratings should be in the same scale.",
                    "label": 0
                },
                {
                    "sent": "For example, from 125.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to learn a rating matrix generative model for the given related tasks on the Puerto Rican data.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the predictive missing values in each.",
                    "label": 0
                },
                {
                    "sent": "In each rating rating corrupt CF tasks.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "How the if that?",
                    "label": 0
                },
                {
                    "sent": "Intuitive example I showed previously is an ideal case in real world, users may have multiple personalities.",
                    "label": 1
                },
                {
                    "sent": "That is, 1 people can like more than one style and the item may have multiple attributes.",
                    "label": 0
                },
                {
                    "sent": "So user and item items should be should simultaneously belong to multiple clusters.",
                    "label": 1
                },
                {
                    "sent": "Suppose there are K user clusters and L item clusters.",
                    "label": 1
                },
                {
                    "sent": "The marginal distributions for users and items can be denoted.",
                    "label": 0
                },
                {
                    "sent": "By mixture models in terms of two.",
                    "label": 0
                },
                {
                    "sent": "Cluster latent class are variables or one is the user latent class variables and the other is the item latent class variables so.",
                    "label": 0
                },
                {
                    "sent": "Assume the user and item in.",
                    "label": 0
                },
                {
                    "sent": "Independent from each other.",
                    "label": 0
                },
                {
                    "sent": "Joint use item.",
                    "label": 0
                },
                {
                    "sent": "Joint mixture model.",
                    "label": 0
                },
                {
                    "sent": "Just the product of these two mixture models and like this so for any user item pair from this task task can be drawn from this model joint model.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "For a user item called cluster, it also should be have different properties to.",
                    "label": 0
                },
                {
                    "sent": "To give different ratings.",
                    "label": 0
                },
                {
                    "sent": "So for the case.",
                    "label": 0
                },
                {
                    "sent": "K&L called code cluster rating.",
                    "label": 0
                },
                {
                    "sent": "She will be joined.",
                    "label": 0
                },
                {
                    "sent": "I could like hers, the equation 2 this is the intuitive, intuitive, bigger.",
                    "label": 0
                },
                {
                    "sent": "This is the ideal case and four by four class level rating matrix matrix.",
                    "label": 0
                },
                {
                    "sent": "In the previous case and we can extend it to a class level ranking model and this is a mixture Model 2 dimensional.",
                    "label": 0
                },
                {
                    "sent": "Rating mix tomorrow and there's a rare figure is.",
                    "label": 0
                },
                {
                    "sent": "Rating.",
                    "label": 0
                },
                {
                    "sent": "Is the rating most likely to appear in the in this code, clusters combining the first model and the second model gives the rating matrix generative model.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This shows the rating matrix generating process.",
                    "label": 1
                },
                {
                    "sent": "This this is a shared rating matrix generative model and we draw users and items.",
                    "label": 0
                },
                {
                    "sent": "This horizontal and vertical red lines means draw users and items from the shared rating matrix, generative model and across the crossing points of the horizontal and vertical lines generates the ratings for the missing values.",
                    "label": 1
                },
                {
                    "sent": "And also for also for the observed ratings.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the next.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I will introduce how to learn and predicting based on the rating matrix generative model.",
                    "label": 0
                },
                {
                    "sent": "There are five sets of parameters in regulations, general model needed to learn.",
                    "label": 0
                },
                {
                    "sent": "That is, as a prior properties over user class and the item cluster and the conditional.",
                    "label": 0
                },
                {
                    "sent": "Properties of user and item given given there given the corresponding user class and item.",
                    "label": 0
                },
                {
                    "sent": "Cluster, and the conditional rating properties given the code cluster.",
                    "label": 0
                },
                {
                    "sent": "We adopted EM algorithm to learn cesvi sets of parameters in eastep the joint.",
                    "label": 1
                },
                {
                    "sent": "Posterior probability that this this is just actually this is the membership of the given rating triplet to the Co cluster is computed using the five sets of parameters in the first round.",
                    "label": 1
                },
                {
                    "sent": "This by set of parameters should be initialized and in M step the five sets of parameters are operated based on based on these.",
                    "label": 0
                },
                {
                    "sent": "Membership here I sleep is a complex equation.",
                    "label": 0
                },
                {
                    "sent": "Note all the parameters are computed on the portal rating data.",
                    "label": 1
                },
                {
                    "sent": "And next I will introduce.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How to predict the missing values?",
                    "label": 1
                },
                {
                    "sent": "For for, for the existing users, that means.",
                    "label": 0
                },
                {
                    "sent": "So this user also in the training set.",
                    "label": 0
                },
                {
                    "sent": "It is very very very easy.",
                    "label": 0
                },
                {
                    "sent": "Just use this equation and these parameters are learned from in the training phase and for.",
                    "label": 0
                },
                {
                    "sent": "New user, it is a little bit a little bit.",
                    "label": 0
                },
                {
                    "sent": "Complex and see existing user we should we should solve a quadratic optimization problem to estimate to estimate the user cluster membership.",
                    "label": 1
                },
                {
                    "sent": "That is to say, based on the given ratings for new user we we should first estimate estimate as user user cluster membership for this new user and use this optimizing problem.",
                    "label": 0
                },
                {
                    "sent": "But but but this.",
                    "label": 0
                },
                {
                    "sent": "Up to or problem is very coopey program is programming problem is very simple and.",
                    "label": 0
                },
                {
                    "sent": "After get the.",
                    "label": 0
                },
                {
                    "sent": "He was a cluster membership.",
                    "label": 0
                },
                {
                    "sent": "Then we can put it, put this into the above equation and use use the above equation tool director predict the missing values.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, I will report the.",
                    "label": 0
                },
                {
                    "sent": "Experimental.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Results the compared methods we adopted is first is Pearson correlation coefficients as the baseline and the.",
                    "label": 1
                },
                {
                    "sent": "Secondly, the flexible mixture model this is can be viewed as a single single task version of our.",
                    "label": 0
                },
                {
                    "sent": "Necessary.",
                    "label": 0
                },
                {
                    "sent": "Under the datasets.",
                    "label": 0
                },
                {
                    "sent": "We used is movielens.",
                    "label": 0
                },
                {
                    "sent": "Each movie and book crossing as the first 2 is movie rating.",
                    "label": 0
                },
                {
                    "sent": "Matrices under the last one is a book rating matrix.",
                    "label": 0
                },
                {
                    "sent": "We respectively select far 500 users and.",
                    "label": 1
                },
                {
                    "sent": "100 items from each.",
                    "label": 0
                },
                {
                    "sent": "Rating matrix and our and our method is.",
                    "label": 0
                },
                {
                    "sent": "Our proposed proposed model is learned from the command combined rating data of these three rating, which is under the first one.",
                    "label": 0
                },
                {
                    "sent": "First 2 is trained respectively.",
                    "label": 0
                },
                {
                    "sent": "Say evaluation protocol is.",
                    "label": 0
                },
                {
                    "sent": "We have different configurations for his experiments and satis.",
                    "label": 0
                },
                {
                    "sent": "We use first 102 hundred 300 used for training and use last 200 users for testing and given 5 or 10 and 10 and 15 observer observable.",
                    "label": 1
                },
                {
                    "sent": "Observe the ratings for each test user and the evaluation metric is mean absolute error.",
                    "label": 1
                },
                {
                    "sent": "This is experiment.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Results.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "This is the movie lens.",
                    "label": 0
                },
                {
                    "sent": "We can see.",
                    "label": 0
                },
                {
                    "sent": "Our result is the best.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and the other or different experiment configurations, the Rose means the training, the training sample size and the column means the given observed ratings for each user for each user.",
                    "label": 0
                },
                {
                    "sent": "And this is the results on each movie.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is results on bookcrossing.",
                    "label": 0
                },
                {
                    "sent": "We can find our.",
                    "label": 0
                },
                {
                    "sent": "Our method is output from the compared methods or all three datasets and and or the configurations.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's a summary.",
                    "label": 0
                },
                {
                    "sent": "Refer to related the different.",
                    "label": 0
                },
                {
                    "sent": "Rating matches from related CF domains in class level.",
                    "label": 0
                },
                {
                    "sent": "Rating patterns and brides via a class level rating, model and transport rating knowledge via this model and the.",
                    "label": 1
                },
                {
                    "sent": "It is a.",
                    "label": 0
                },
                {
                    "sent": "Each task can benefit from one another, so we can alleviate sparsity problem instead of the future work.",
                    "label": 1
                },
                {
                    "sent": "The first one is we want to quantify the relatedness and the second one is.",
                    "label": 0
                },
                {
                    "sent": "We can see we are considered considering and a symmetric setting.",
                    "label": 0
                },
                {
                    "sent": "That is how to transfer knowledge from relative density rating matrix to sparse one, that's sense.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Curious, why did you use such time datasets for your evaluation?",
                    "label": 0
                },
                {
                    "sent": "I mean, moving lenses are fairly small data set like down you took after school.",
                    "label": 0
                },
                {
                    "sent": "So yeah, actually we want we want to find the.",
                    "label": 0
                },
                {
                    "sent": "Of.",
                    "label": 0
                },
                {
                    "sent": "More larger, larger datasets, but you know we.",
                    "label": 0
                },
                {
                    "sent": "We try to learn multiple rate rating.",
                    "label": 0
                },
                {
                    "sent": "Matrices dirty martini asleep.",
                    "label": 0
                },
                {
                    "sent": "But if we if we we want to the consider the rate images are of the same side of the similar size.",
                    "label": 0
                },
                {
                    "sent": "If we if one is more larger than the others, this one will dominate the results.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is this, so we only try try to.",
                    "label": 0
                },
                {
                    "sent": "Use a similar size for different tasks.",
                    "label": 0
                },
                {
                    "sent": "So wondering if you maybe this is with your future work with talk about related this.",
                    "label": 1
                },
                {
                    "sent": "I'm going to experiment on two datasets that are not related at all.",
                    "label": 0
                },
                {
                    "sent": "And see that place.",
                    "label": 0
                },
                {
                    "sent": "You improve.",
                    "label": 0
                },
                {
                    "sent": "You look like here you are his tryout books and movies.",
                    "label": 0
                },
                {
                    "sent": "You said these tasks are related books and something not related at all.",
                    "label": 0
                },
                {
                    "sent": "Mr.",
                    "label": 0
                },
                {
                    "sent": "This system may result seeing negative transport.",
                    "label": 0
                },
                {
                    "sent": "We transfer learning only work in the different domains.",
                    "label": 1
                },
                {
                    "sent": "Maybe 8 must be related and the next step will we want to quantify the related in this but.",
                    "label": 0
                },
                {
                    "sent": "These preliminary work we just intuitively intuitively to.",
                    "label": 0
                },
                {
                    "sent": "Defines a relatedness butter.",
                    "label": 0
                },
                {
                    "sent": "Next work.",
                    "label": 0
                },
                {
                    "sent": "We want to quantify statistically.",
                    "label": 0
                },
                {
                    "sent": "How do you know you're not just overfitting if you're only using one data set and then by using two you're somehow regularising and then you're getting better results, you mean overfitting.",
                    "label": 0
                },
                {
                    "sent": "Right like you, I mean, it seems like if you have very little data, right?",
                    "label": 0
                },
                {
                    "sent": "Just be overfitting on this.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah.",
                    "label": 0
                },
                {
                    "sent": "Data you might be just saying, well, I'm regularizes alright.",
                    "label": 0
                },
                {
                    "sent": "This was the.",
                    "label": 0
                },
                {
                    "sent": "If if these tasks are related, the sparse one maybe see this one.",
                    "label": 0
                },
                {
                    "sent": "Maybe a regular regularising term for for this password, as long as they are related, just the sparse one.",
                    "label": 0
                },
                {
                    "sent": "If we written model just for sparse one single task learning just first password, this may be result in overfitting.",
                    "label": 0
                },
                {
                    "sent": "But if we consider if we.",
                    "label": 0
                },
                {
                    "sent": "Learn multiple related tasks.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's where just can work as a regularization term.",
                    "label": 0
                },
                {
                    "sent": "Final question here, how many clusters do you use for over a year?",
                    "label": 0
                },
                {
                    "sent": "How many clusters do use OK about 2250 just by?",
                    "label": 0
                },
                {
                    "sent": "Empirically search.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "This concludes the session.",
                    "label": 0
                }
            ]
        }
    }
}