{
    "id": "m6qyneye5qlfd3cfqfjuxoaohfhxbxmd",
    "title": "Closing and Awards",
    "info": {
        "organizer": [
            "Steffen Staab, Institute for Web Science and Technologies (WeST), University of Koblenz-Landau"
        ],
        "published": "Dec. 1, 2015",
        "recorded": "October 2015",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2015_staab_closing/",
    "segmentation": [
        [
            "Because, as is common in all closing sessions of ISWC.",
            "We want to congratulate people, authors, software developers.",
            "Semantic Web and US through siast that.",
            "Contributed particularly noteworthy.",
            "Contributions to this conference.",
            "And you know, from the very beginning, we have very different tracks and very different modes in which we tell each other.",
            "What the holes many web is about.",
            "And so let."
        ],
        [
            "Start directly into the.",
            "Best posters and demos as either selected by you or as selected by the program Committee, guided by chaired by Jeff Pan Anserina Villata and having quite some help from Analisa, Gentilella, Andrea Giovanni, and Mauro Tregony.",
            "OK, let's get things started and things happen."
        ],
        [
            "Yeah, we have four awards for this year.",
            "We don't have two because it is difficult to have ways on the voting site together with the ways on the PC review size.",
            "So we decided to have 4 walls.",
            "We have two based on people's choices and two based on PC reviews.",
            "An so let's look at the voting bit further with the voting system was started from the post session finished by midnight yesterday.",
            "And there was a long table of one row for many posters.",
            "I'm sure people are always an voting for each others vote, so we don't."
        ],
        [
            "Late we have 3.",
            "Posters that are on the top of the voting list.",
            "So poster #55 gets.",
            "Five votes.",
            "Obviously, having five hours could take you to the first three, an 106 guests.",
            "5.",
            "Anne.",
            "Post 110 I guess 11 that means."
        ],
        [
            "And the People's Choice opposed the war goes to test driven assessment of our two IML mappings to improve datasets quality.",
            "Let's congratulate the authors.",
            "And please come up to the stage.",
            "And our staff shirt.",
            "Dimitri Marcus, Reuben Jens, Erik, Sebastian and Rick.",
            "So.",
            "Thank you.",
            "And so let's move on to the demo."
        ],
        [
            "Again, the top three are.",
            "Download 28.",
            "13 votes 71 Find boats an 88 six wells that means."
        ],
        [
            "People's Choice them award goes to intermodal public transit routing using link connections.",
            "So Peter and John, Joe Ruben, Oscar Patrick anrig.",
            "Congratulations, thank you.",
            "Well done, well done, thank you.",
            "Here is the line.",
            "We are professionals.",
            "So who's speaking rabbit?",
            "Well done.",
            "So the key question that we have in mind is to see if there's any posters or demos that could get a double awards.",
            "So let's look at that."
        ],
        [
            "Meditates.",
            "So the best paperwork candidates including an posted 9: tollages for save autonomous driving post this seven expressing no value information in RDF and Post 82 medical concept resolution.",
            "And the world goes to."
        ],
        [
            "82 medical concept resolution.",
            "Congratulations to Nitish can increase.",
            "Are they here?",
            "No, that's OK, yeah.",
            "OK, good, so let's move."
        ],
        [
            "Onto the best demo award.",
            "There are two, one from Optic, obviously.",
            "First one is done with 22 put talks, post dropping out to onto the.",
            "Now to RMM mappings from relational databases.",
            "And Demo 23 semantic access to see mainstream streaming data the Optic Way and also Demo 45 on Target Services based on crowdsourcing case.",
            "National gazeteer of historical places."
        ],
        [
            "And the workers to Demo 23 congratulations.",
            "Semantic access to Siemens streaming data the optic way.",
            "So Afghanis, Bastion, Mountain nesto Stephen Christian.",
            "In old school Christoph Arm at Dimitri.",
            "We have Stuart.",
            "Well done well done.",
            "Over to you.",
            "Nice smile.",
            "OK, thanks, that's all supposed to demo."
        ],
        [
            "OK, so these were the best posters and demos.",
            "Now we come to the Semantic Web challenge and for the Semantic Web challenge that is organized by Shore back over and have some specific prices by Elsevier.",
            "And.",
            "This is giving me a headache here.",
            "OK, so Sean.",
            "Thank you, this is a very big room.",
            "It's nice, astonishing.",
            "So thank you.",
            "So the challenge as usual, we had a number of good quality submissions.",
            "We had our presentations and demos going on at the same time as the demo and poster session, and we invited five of the submissions to go forward to give a presentation in the special session that we had yesterday.",
            "So you can see all the details of those five finalists on the website.",
            "If you look at the challenge website and I'd advise you to check out there, look at the papers.",
            "And see their demos and so from those five we selected 3.",
            "Submissions that would get awards and we have a joint second place so second place."
        ],
        [
            "Goes to."
        ],
        [
            "Towards the sales assistant using a product knowledge graph and exploiting knowledge bases for multi lingual and cross lingual semantic annotation and search.",
            "So do we have the.",
            "Do we have all we?",
            "Do we have some authors in the room?",
            "Please if you'd like to come up.",
            "Team yeah, right?",
            "No.",
            "There you go, congratulations.",
            "No, that's fine.",
            "Alright, so."
        ],
        [
            "So moving on to the winner and it's my pleasure to announce that the winner of the Semantic Web Challenge 2015."
        ],
        [
            "Is 360 at Expo Milano?",
            "And again, this comes with a very generous prize of $1500, which will probably buy a beer for each of the huge army of.",
            "Authors the certificates, but then you get the big check, but there's been some inflation.",
            "It's it's trunk.",
            "Alright.",
            "Thank you.",
            "OK, thank you very much.",
            "That concludes the challenge for this year.",
            "Thank you so.",
            "As you can see, we get more and more professional because the number of authors on these kind of submissions grows longer and longer.",
            "I mean, we don't quite reach the physics community with 2000 authors."
        ],
        [
            "Paper, but we're getting close, so we get to the next category, which is for the applied papers for the two tracks of in use and software, as well as datasets and ontologies and mature and Paul will announce the winners.",
            "Thank you very much and.",
            "So we are not going to be too long as you know this is a very common way of of doing awards."
        ],
        [
            "We had.",
            "Three nominees announced at the beginning, TR discovered Natural Language interface for querying and analyzing intering datasets, building and using a knowledge graph to combat human trafficking and semantic bridges for biodiversity science.",
            "We decided on the winner.",
            "As you can imagine, mostly based on the reviews and how the papers were appreciated by the reviewers.",
            "But we also went to the presentation and.",
            "Try to decide which one was most representative, especially of the track, and we're happy to announce that the winner is 1.",
            "Virtusa very.",
            "Real use case and what which is really driven by the scenario in the application they want to do and demonstrate the applicability of semantic technologies and they can be deployed in real case.",
            "So without further ado, so winner is."
        ],
        [
            "Building and using another drive to combat human trafficking.",
            "And as you can see I think a long list of also seems to be a trend in Windows this year so.",
            "Yes, you know what to do for next year.",
            "Invite everybody.",
            "Thank you."
        ],
        [
            "So now we get to the very last category of awards.",
            "It's about the best research papers for the students as well As for the general category and Oscar.",
            "Marcelo will announce these.",
            "OK.",
            "So.",
            "We already nominated 3."
        ],
        [
            "Best steel and research based in research paper awards.",
            "These were the candidates that we had.",
            "The process consisted in checking.",
            "Checking back again all the papers by a committee of people taking the presentations, trying to determine whether the comments that were done also during the review work consider during the presentation, and then.",
            "Do you have it already, OK?",
            "The end result paper award goes to.",
            "Yeah."
        ],
        [
            "These recycles Yannis grassy keys cost us a stefanidis Yorgos Florestan Genesis Abacus.",
            "Thought.",
            "Congratulations.",
            "You're young.",
            "Green line.",
            "Thank you."
        ],
        [
            "So now we have the candidates for the best Research paper award.",
            "There were three nominees, as you see over here general terminology, and that's only now.",
            "Recursion is sparkle, and Elodie lab experiments at lodl scale.",
            "Ann, we have followed exactly the same process as before and the winner of this best Research paper award."
        ],
        [
            "Is Elodie laugh as payments and elodie scale norms?",
            "They have one.",
            "So.",
            "Final round of applause for all these winners.",
            "I think this represents excellent work.",
            "In all these different categories."
        ],
        [
            "Now there is not much to say.",
            "Maybe some lengthy farewell and goodbye and see you again."
        ],
        [
            "Then we look forward.",
            "Also with some experience we gained during this conference.",
            "A couple of you were in the town Hall meeting, which was, I think, very productive and we just want to let you know that we continue thinking about how to shape the conference.",
            "For example, we as we announced in a town Hall meeting there will be something like a Journal track.",
            "The exact concept still needs to be developed, but there will be something coming for next year.",
            "We still think, for example how to deal with software already this year we had something like research objects for the research paper track.",
            "We will also continue to think with our partners LSV for example about how to deal with software.",
            "One of their initiatives that I want to point out is this origonal software publications where the idea is that when you submit an abstract and software form, you are for example chit hub repository.",
            "You end up with John contribution that citable, searchable version that can be versioned and you retain all rights.",
            "And I think especially for our kind of community where.",
            "Progress is often done by developing software.",
            "These are important ways to step forward."
        ],
        [
            "So as I said initially I SWC is about you and the semantic web.",
            "These are the kind of things we have seen in the past days and I was very happy to see you deliver them.",
            "So thank you very much and now well please think of how you can contribute to the oncoming years and."
        ],
        [
            "So this I want to hand over first to Natasha.",
            "Annoying to say a few words about what's coming next.",
            "So Switzer's Medical science Association.",
            "One of the things we do, except besides providing the password for the wireless, is decide select among the bids for the location for the conference 2 years from now and so.",
            "Assuming I can do this correctly, which again I can't.",
            "So for the Semantic Web conference in 2017."
        ],
        [
            "We're going to Vienna.",
            "Anne.",
            "I. I think actual Polaris is still here.",
            "One of the local chairs.",
            "So talk to him.",
            "Tell him which what you would like to see there and was that way."
        ],
        [
            "Sending it over to Israel 2016 organizers.",
            "OK, this is the very last part of the conference, so I want to introduce next conference briefly.",
            "So SLC 2016 is Kobe, so it's October 17 to 21st so.",
            "Kobe.",
            "So do not call back.",
            "Yeah, the callback.",
            "Is not so Michael Bay daddy.",
            "Maybe this one?",
            "Call back where are you expensive beef, but so Kobe is the city actually famous for port.",
            "Therefore it is one of the famous pose in the world.",
            "Um, actually so Cobra is a OneNote so fast boat, so it's open for Western country.",
            "So 150 years ago.",
            "So that is something like that.",
            "But of course it's not so.",
            "Now, so it's now seems like that.",
            "So I want to show short video so.",
            "So I think so.",
            "Passports to open source companies so.",
            "Go back is very so future looking city over trying so next challenge.",
            "So call back is full frame up for Japanese, so one of the favorite place to live.",
            "It's a mix and.",
            "More than and some traditional cultures.",
            "So OK, so that's the.",
            "To do so, Japan, do you know Japan where it is?",
            "Here it is.",
            "OK, so OK, so so carbon is located to the West part of Japan.",
            "So it's, uh, it's actually so 50 kilometer from Tokyo, so sorry, 500 kilometers from Tokyo and sober is in Port City and we have.",
            "Our conference is held in so Port Island is a man made so islands.",
            "So OK, so just keep so some cultures or new cruise and some also Hot Springs over in the mountainside.",
            "So also high Tech City so actually.",
            "So it's a Conference Center located so this.",
            "Samson Oxo bio science.",
            "Special distincts in in so Portland.",
            "So also Kobe located council area, so it's Osaka Kyoto and Nara is very close in in one hour, so we can just escapin.",
            "So look at some other city also.",
            "So.",
            "And how to access the callback?",
            "Is there really easy so for everyone so actually so we have so three international airports so and one also is Kansai.",
            "International Airport is very close to.",
            "Kobe so so Kansai International Airport.",
            "Have flights so from Paris Frank Rude as Mr Helsinki Rd sensors San Francisco and Vancouver so it's not so.",
            "Far so it's actually can.",
            "So just just use a ferry to just 24 kilometers from conference.",
            "Apple 2 Conference Center.",
            "So we can also use the high speed train from Tokyo, so venue is a code Convention Center is a.",
            "We use the whole building so and so all workshop, tutorial, main conferences hold in the single building, so it's probably very convenient for us like the main hold something exact.",
            "And so organized and so on.",
            "That piece of, uh, so generator is around you is not here, but so so she organized so very nice.",
            "Organization so.",
            "So and so also I organized local organizing committee so it's a we're so include so many Japanese researchers or actually there is some some groups or local community is also attend this conference.",
            "So we also some so collaboration with local organization like linked Open Data Initiative and also have a special interest group or Semantic Web Ontology and so every challenge.",
            "So it's something that we're happy to collaborate.",
            "So we have already opened so a website.",
            "So please check so this website so we will add so more information so later on.",
            "OK, see you at Kobe, that is.",
            "You still sitting there?",
            "Well, I have to say now.",
            "Basically you have to go home.",
            "I'm sorry it's a very nice time.",
            "It has been a very nice week.",
            "Thanks all for coming.",
            "Have a safe trip home and see you next year."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because, as is common in all closing sessions of ISWC.",
                    "label": 0
                },
                {
                    "sent": "We want to congratulate people, authors, software developers.",
                    "label": 0
                },
                {
                    "sent": "Semantic Web and US through siast that.",
                    "label": 0
                },
                {
                    "sent": "Contributed particularly noteworthy.",
                    "label": 0
                },
                {
                    "sent": "Contributions to this conference.",
                    "label": 0
                },
                {
                    "sent": "And you know, from the very beginning, we have very different tracks and very different modes in which we tell each other.",
                    "label": 0
                },
                {
                    "sent": "What the holes many web is about.",
                    "label": 0
                },
                {
                    "sent": "And so let.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Start directly into the.",
                    "label": 0
                },
                {
                    "sent": "Best posters and demos as either selected by you or as selected by the program Committee, guided by chaired by Jeff Pan Anserina Villata and having quite some help from Analisa, Gentilella, Andrea Giovanni, and Mauro Tregony.",
                    "label": 0
                },
                {
                    "sent": "OK, let's get things started and things happen.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, we have four awards for this year.",
                    "label": 0
                },
                {
                    "sent": "We don't have two because it is difficult to have ways on the voting site together with the ways on the PC review size.",
                    "label": 0
                },
                {
                    "sent": "So we decided to have 4 walls.",
                    "label": 0
                },
                {
                    "sent": "We have two based on people's choices and two based on PC reviews.",
                    "label": 1
                },
                {
                    "sent": "An so let's look at the voting bit further with the voting system was started from the post session finished by midnight yesterday.",
                    "label": 0
                },
                {
                    "sent": "And there was a long table of one row for many posters.",
                    "label": 0
                },
                {
                    "sent": "I'm sure people are always an voting for each others vote, so we don't.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Late we have 3.",
                    "label": 0
                },
                {
                    "sent": "Posters that are on the top of the voting list.",
                    "label": 0
                },
                {
                    "sent": "So poster #55 gets.",
                    "label": 0
                },
                {
                    "sent": "Five votes.",
                    "label": 0
                },
                {
                    "sent": "Obviously, having five hours could take you to the first three, an 106 guests.",
                    "label": 0
                },
                {
                    "sent": "5.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Post 110 I guess 11 that means.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the People's Choice opposed the war goes to test driven assessment of our two IML mappings to improve datasets quality.",
                    "label": 1
                },
                {
                    "sent": "Let's congratulate the authors.",
                    "label": 0
                },
                {
                    "sent": "And please come up to the stage.",
                    "label": 0
                },
                {
                    "sent": "And our staff shirt.",
                    "label": 0
                },
                {
                    "sent": "Dimitri Marcus, Reuben Jens, Erik, Sebastian and Rick.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "And so let's move on to the demo.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, the top three are.",
                    "label": 0
                },
                {
                    "sent": "Download 28.",
                    "label": 0
                },
                {
                    "sent": "13 votes 71 Find boats an 88 six wells that means.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "People's Choice them award goes to intermodal public transit routing using link connections.",
                    "label": 1
                },
                {
                    "sent": "So Peter and John, Joe Ruben, Oscar Patrick anrig.",
                    "label": 0
                },
                {
                    "sent": "Congratulations, thank you.",
                    "label": 0
                },
                {
                    "sent": "Well done, well done, thank you.",
                    "label": 0
                },
                {
                    "sent": "Here is the line.",
                    "label": 0
                },
                {
                    "sent": "We are professionals.",
                    "label": 0
                },
                {
                    "sent": "So who's speaking rabbit?",
                    "label": 0
                },
                {
                    "sent": "Well done.",
                    "label": 0
                },
                {
                    "sent": "So the key question that we have in mind is to see if there's any posters or demos that could get a double awards.",
                    "label": 0
                },
                {
                    "sent": "So let's look at that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Meditates.",
                    "label": 0
                },
                {
                    "sent": "So the best paperwork candidates including an posted 9: tollages for save autonomous driving post this seven expressing no value information in RDF and Post 82 medical concept resolution.",
                    "label": 1
                },
                {
                    "sent": "And the world goes to.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "82 medical concept resolution.",
                    "label": 0
                },
                {
                    "sent": "Congratulations to Nitish can increase.",
                    "label": 0
                },
                {
                    "sent": "Are they here?",
                    "label": 0
                },
                {
                    "sent": "No, that's OK, yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, good, so let's move.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Onto the best demo award.",
                    "label": 1
                },
                {
                    "sent": "There are two, one from Optic, obviously.",
                    "label": 0
                },
                {
                    "sent": "First one is done with 22 put talks, post dropping out to onto the.",
                    "label": 0
                },
                {
                    "sent": "Now to RMM mappings from relational databases.",
                    "label": 1
                },
                {
                    "sent": "And Demo 23 semantic access to see mainstream streaming data the Optic Way and also Demo 45 on Target Services based on crowdsourcing case.",
                    "label": 1
                },
                {
                    "sent": "National gazeteer of historical places.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the workers to Demo 23 congratulations.",
                    "label": 0
                },
                {
                    "sent": "Semantic access to Siemens streaming data the optic way.",
                    "label": 1
                },
                {
                    "sent": "So Afghanis, Bastion, Mountain nesto Stephen Christian.",
                    "label": 0
                },
                {
                    "sent": "In old school Christoph Arm at Dimitri.",
                    "label": 0
                },
                {
                    "sent": "We have Stuart.",
                    "label": 0
                },
                {
                    "sent": "Well done well done.",
                    "label": 0
                },
                {
                    "sent": "Over to you.",
                    "label": 0
                },
                {
                    "sent": "Nice smile.",
                    "label": 0
                },
                {
                    "sent": "OK, thanks, that's all supposed to demo.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so these were the best posters and demos.",
                    "label": 0
                },
                {
                    "sent": "Now we come to the Semantic Web challenge and for the Semantic Web challenge that is organized by Shore back over and have some specific prices by Elsevier.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This is giving me a headache here.",
                    "label": 0
                },
                {
                    "sent": "OK, so Sean.",
                    "label": 0
                },
                {
                    "sent": "Thank you, this is a very big room.",
                    "label": 0
                },
                {
                    "sent": "It's nice, astonishing.",
                    "label": 0
                },
                {
                    "sent": "So thank you.",
                    "label": 0
                },
                {
                    "sent": "So the challenge as usual, we had a number of good quality submissions.",
                    "label": 0
                },
                {
                    "sent": "We had our presentations and demos going on at the same time as the demo and poster session, and we invited five of the submissions to go forward to give a presentation in the special session that we had yesterday.",
                    "label": 0
                },
                {
                    "sent": "So you can see all the details of those five finalists on the website.",
                    "label": 0
                },
                {
                    "sent": "If you look at the challenge website and I'd advise you to check out there, look at the papers.",
                    "label": 0
                },
                {
                    "sent": "And see their demos and so from those five we selected 3.",
                    "label": 0
                },
                {
                    "sent": "Submissions that would get awards and we have a joint second place so second place.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Goes to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Towards the sales assistant using a product knowledge graph and exploiting knowledge bases for multi lingual and cross lingual semantic annotation and search.",
                    "label": 1
                },
                {
                    "sent": "So do we have the.",
                    "label": 0
                },
                {
                    "sent": "Do we have all we?",
                    "label": 0
                },
                {
                    "sent": "Do we have some authors in the room?",
                    "label": 0
                },
                {
                    "sent": "Please if you'd like to come up.",
                    "label": 0
                },
                {
                    "sent": "Team yeah, right?",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "There you go, congratulations.",
                    "label": 0
                },
                {
                    "sent": "No, that's fine.",
                    "label": 0
                },
                {
                    "sent": "Alright, so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So moving on to the winner and it's my pleasure to announce that the winner of the Semantic Web Challenge 2015.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is 360 at Expo Milano?",
                    "label": 0
                },
                {
                    "sent": "And again, this comes with a very generous prize of $1500, which will probably buy a beer for each of the huge army of.",
                    "label": 0
                },
                {
                    "sent": "Authors the certificates, but then you get the big check, but there's been some inflation.",
                    "label": 0
                },
                {
                    "sent": "It's it's trunk.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "That concludes the challenge for this year.",
                    "label": 0
                },
                {
                    "sent": "Thank you so.",
                    "label": 0
                },
                {
                    "sent": "As you can see, we get more and more professional because the number of authors on these kind of submissions grows longer and longer.",
                    "label": 0
                },
                {
                    "sent": "I mean, we don't quite reach the physics community with 2000 authors.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Paper, but we're getting close, so we get to the next category, which is for the applied papers for the two tracks of in use and software, as well as datasets and ontologies and mature and Paul will announce the winners.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much and.",
                    "label": 0
                },
                {
                    "sent": "So we are not going to be too long as you know this is a very common way of of doing awards.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We had.",
                    "label": 0
                },
                {
                    "sent": "Three nominees announced at the beginning, TR discovered Natural Language interface for querying and analyzing intering datasets, building and using a knowledge graph to combat human trafficking and semantic bridges for biodiversity science.",
                    "label": 1
                },
                {
                    "sent": "We decided on the winner.",
                    "label": 0
                },
                {
                    "sent": "As you can imagine, mostly based on the reviews and how the papers were appreciated by the reviewers.",
                    "label": 0
                },
                {
                    "sent": "But we also went to the presentation and.",
                    "label": 0
                },
                {
                    "sent": "Try to decide which one was most representative, especially of the track, and we're happy to announce that the winner is 1.",
                    "label": 0
                },
                {
                    "sent": "Virtusa very.",
                    "label": 0
                },
                {
                    "sent": "Real use case and what which is really driven by the scenario in the application they want to do and demonstrate the applicability of semantic technologies and they can be deployed in real case.",
                    "label": 0
                },
                {
                    "sent": "So without further ado, so winner is.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Building and using another drive to combat human trafficking.",
                    "label": 1
                },
                {
                    "sent": "And as you can see I think a long list of also seems to be a trend in Windows this year so.",
                    "label": 0
                },
                {
                    "sent": "Yes, you know what to do for next year.",
                    "label": 0
                },
                {
                    "sent": "Invite everybody.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we get to the very last category of awards.",
                    "label": 0
                },
                {
                    "sent": "It's about the best research papers for the students as well As for the general category and Oscar.",
                    "label": 0
                },
                {
                    "sent": "Marcelo will announce these.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We already nominated 3.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Best steel and research based in research paper awards.",
                    "label": 1
                },
                {
                    "sent": "These were the candidates that we had.",
                    "label": 0
                },
                {
                    "sent": "The process consisted in checking.",
                    "label": 0
                },
                {
                    "sent": "Checking back again all the papers by a committee of people taking the presentations, trying to determine whether the comments that were done also during the review work consider during the presentation, and then.",
                    "label": 0
                },
                {
                    "sent": "Do you have it already, OK?",
                    "label": 0
                },
                {
                    "sent": "The end result paper award goes to.",
                    "label": 1
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These recycles Yannis grassy keys cost us a stefanidis Yorgos Florestan Genesis Abacus.",
                    "label": 0
                },
                {
                    "sent": "Thought.",
                    "label": 0
                },
                {
                    "sent": "Congratulations.",
                    "label": 0
                },
                {
                    "sent": "You're young.",
                    "label": 0
                },
                {
                    "sent": "Green line.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we have the candidates for the best Research paper award.",
                    "label": 1
                },
                {
                    "sent": "There were three nominees, as you see over here general terminology, and that's only now.",
                    "label": 0
                },
                {
                    "sent": "Recursion is sparkle, and Elodie lab experiments at lodl scale.",
                    "label": 0
                },
                {
                    "sent": "Ann, we have followed exactly the same process as before and the winner of this best Research paper award.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is Elodie laugh as payments and elodie scale norms?",
                    "label": 0
                },
                {
                    "sent": "They have one.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Final round of applause for all these winners.",
                    "label": 0
                },
                {
                    "sent": "I think this represents excellent work.",
                    "label": 0
                },
                {
                    "sent": "In all these different categories.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now there is not much to say.",
                    "label": 0
                },
                {
                    "sent": "Maybe some lengthy farewell and goodbye and see you again.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we look forward.",
                    "label": 0
                },
                {
                    "sent": "Also with some experience we gained during this conference.",
                    "label": 0
                },
                {
                    "sent": "A couple of you were in the town Hall meeting, which was, I think, very productive and we just want to let you know that we continue thinking about how to shape the conference.",
                    "label": 0
                },
                {
                    "sent": "For example, we as we announced in a town Hall meeting there will be something like a Journal track.",
                    "label": 0
                },
                {
                    "sent": "The exact concept still needs to be developed, but there will be something coming for next year.",
                    "label": 0
                },
                {
                    "sent": "We still think, for example how to deal with software already this year we had something like research objects for the research paper track.",
                    "label": 0
                },
                {
                    "sent": "We will also continue to think with our partners LSV for example about how to deal with software.",
                    "label": 0
                },
                {
                    "sent": "One of their initiatives that I want to point out is this origonal software publications where the idea is that when you submit an abstract and software form, you are for example chit hub repository.",
                    "label": 0
                },
                {
                    "sent": "You end up with John contribution that citable, searchable version that can be versioned and you retain all rights.",
                    "label": 1
                },
                {
                    "sent": "And I think especially for our kind of community where.",
                    "label": 0
                },
                {
                    "sent": "Progress is often done by developing software.",
                    "label": 0
                },
                {
                    "sent": "These are important ways to step forward.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as I said initially I SWC is about you and the semantic web.",
                    "label": 1
                },
                {
                    "sent": "These are the kind of things we have seen in the past days and I was very happy to see you deliver them.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much and now well please think of how you can contribute to the oncoming years and.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this I want to hand over first to Natasha.",
                    "label": 0
                },
                {
                    "sent": "Annoying to say a few words about what's coming next.",
                    "label": 0
                },
                {
                    "sent": "So Switzer's Medical science Association.",
                    "label": 1
                },
                {
                    "sent": "One of the things we do, except besides providing the password for the wireless, is decide select among the bids for the location for the conference 2 years from now and so.",
                    "label": 0
                },
                {
                    "sent": "Assuming I can do this correctly, which again I can't.",
                    "label": 0
                },
                {
                    "sent": "So for the Semantic Web conference in 2017.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're going to Vienna.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "I. I think actual Polaris is still here.",
                    "label": 0
                },
                {
                    "sent": "One of the local chairs.",
                    "label": 0
                },
                {
                    "sent": "So talk to him.",
                    "label": 0
                },
                {
                    "sent": "Tell him which what you would like to see there and was that way.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sending it over to Israel 2016 organizers.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the very last part of the conference, so I want to introduce next conference briefly.",
                    "label": 0
                },
                {
                    "sent": "So SLC 2016 is Kobe, so it's October 17 to 21st so.",
                    "label": 0
                },
                {
                    "sent": "Kobe.",
                    "label": 0
                },
                {
                    "sent": "So do not call back.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the callback.",
                    "label": 0
                },
                {
                    "sent": "Is not so Michael Bay daddy.",
                    "label": 0
                },
                {
                    "sent": "Maybe this one?",
                    "label": 0
                },
                {
                    "sent": "Call back where are you expensive beef, but so Kobe is the city actually famous for port.",
                    "label": 0
                },
                {
                    "sent": "Therefore it is one of the famous pose in the world.",
                    "label": 0
                },
                {
                    "sent": "Um, actually so Cobra is a OneNote so fast boat, so it's open for Western country.",
                    "label": 0
                },
                {
                    "sent": "So 150 years ago.",
                    "label": 0
                },
                {
                    "sent": "So that is something like that.",
                    "label": 0
                },
                {
                    "sent": "But of course it's not so.",
                    "label": 0
                },
                {
                    "sent": "Now, so it's now seems like that.",
                    "label": 0
                },
                {
                    "sent": "So I want to show short video so.",
                    "label": 0
                },
                {
                    "sent": "So I think so.",
                    "label": 0
                },
                {
                    "sent": "Passports to open source companies so.",
                    "label": 0
                },
                {
                    "sent": "Go back is very so future looking city over trying so next challenge.",
                    "label": 0
                },
                {
                    "sent": "So call back is full frame up for Japanese, so one of the favorite place to live.",
                    "label": 0
                },
                {
                    "sent": "It's a mix and.",
                    "label": 0
                },
                {
                    "sent": "More than and some traditional cultures.",
                    "label": 0
                },
                {
                    "sent": "So OK, so that's the.",
                    "label": 0
                },
                {
                    "sent": "To do so, Japan, do you know Japan where it is?",
                    "label": 0
                },
                {
                    "sent": "Here it is.",
                    "label": 0
                },
                {
                    "sent": "OK, so OK, so so carbon is located to the West part of Japan.",
                    "label": 0
                },
                {
                    "sent": "So it's, uh, it's actually so 50 kilometer from Tokyo, so sorry, 500 kilometers from Tokyo and sober is in Port City and we have.",
                    "label": 0
                },
                {
                    "sent": "Our conference is held in so Port Island is a man made so islands.",
                    "label": 0
                },
                {
                    "sent": "So OK, so just keep so some cultures or new cruise and some also Hot Springs over in the mountainside.",
                    "label": 0
                },
                {
                    "sent": "So also high Tech City so actually.",
                    "label": 0
                },
                {
                    "sent": "So it's a Conference Center located so this.",
                    "label": 0
                },
                {
                    "sent": "Samson Oxo bio science.",
                    "label": 0
                },
                {
                    "sent": "Special distincts in in so Portland.",
                    "label": 0
                },
                {
                    "sent": "So also Kobe located council area, so it's Osaka Kyoto and Nara is very close in in one hour, so we can just escapin.",
                    "label": 0
                },
                {
                    "sent": "So look at some other city also.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And how to access the callback?",
                    "label": 0
                },
                {
                    "sent": "Is there really easy so for everyone so actually so we have so three international airports so and one also is Kansai.",
                    "label": 0
                },
                {
                    "sent": "International Airport is very close to.",
                    "label": 0
                },
                {
                    "sent": "Kobe so so Kansai International Airport.",
                    "label": 0
                },
                {
                    "sent": "Have flights so from Paris Frank Rude as Mr Helsinki Rd sensors San Francisco and Vancouver so it's not so.",
                    "label": 0
                },
                {
                    "sent": "Far so it's actually can.",
                    "label": 0
                },
                {
                    "sent": "So just just use a ferry to just 24 kilometers from conference.",
                    "label": 0
                },
                {
                    "sent": "Apple 2 Conference Center.",
                    "label": 0
                },
                {
                    "sent": "So we can also use the high speed train from Tokyo, so venue is a code Convention Center is a.",
                    "label": 0
                },
                {
                    "sent": "We use the whole building so and so all workshop, tutorial, main conferences hold in the single building, so it's probably very convenient for us like the main hold something exact.",
                    "label": 0
                },
                {
                    "sent": "And so organized and so on.",
                    "label": 0
                },
                {
                    "sent": "That piece of, uh, so generator is around you is not here, but so so she organized so very nice.",
                    "label": 0
                },
                {
                    "sent": "Organization so.",
                    "label": 0
                },
                {
                    "sent": "So and so also I organized local organizing committee so it's a we're so include so many Japanese researchers or actually there is some some groups or local community is also attend this conference.",
                    "label": 0
                },
                {
                    "sent": "So we also some so collaboration with local organization like linked Open Data Initiative and also have a special interest group or Semantic Web Ontology and so every challenge.",
                    "label": 0
                },
                {
                    "sent": "So it's something that we're happy to collaborate.",
                    "label": 0
                },
                {
                    "sent": "So we have already opened so a website.",
                    "label": 0
                },
                {
                    "sent": "So please check so this website so we will add so more information so later on.",
                    "label": 0
                },
                {
                    "sent": "OK, see you at Kobe, that is.",
                    "label": 0
                },
                {
                    "sent": "You still sitting there?",
                    "label": 0
                },
                {
                    "sent": "Well, I have to say now.",
                    "label": 0
                },
                {
                    "sent": "Basically you have to go home.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry it's a very nice time.",
                    "label": 0
                },
                {
                    "sent": "It has been a very nice week.",
                    "label": 0
                },
                {
                    "sent": "Thanks all for coming.",
                    "label": 0
                },
                {
                    "sent": "Have a safe trip home and see you next year.",
                    "label": 1
                }
            ]
        }
    }
}