{
    "id": "m6row2wtms7p7ryuw3tgqxc6ousxg5da",
    "title": "Arena – a public-private approach for development of a road user charging",
    "info": {
        "author": [
            "Inger Gustafsson, BMT Transport Solutions GmbH"
        ],
        "published": "May 5, 2008",
        "recorded": "April 2008",
        "category": [
            "Top->Business->Transportation and Logistics->Technology"
        ]
    },
    "url": "http://videolectures.net/tra08_gustafsson_appa/",
    "segmentation": [
        [
            "Thank you, I think we should all start by thanking our Italian colleague who decided to stay at home.",
            "Now at least we have a chance to get the coffee break.",
            "So I'm here to talk about institutional barriers for public private partnership, and it has a bit different focus.",
            "It's about knowledge development.",
            "And I've been the project manager for a project in Sweden called Arena which is looking into Rd user charging for Loris and it's in a very early stage looking at how could a concept we developed, how should it look like?",
            "So what I'm going to talk about is the experiences from that project and it's actually.",
            "I'm going to present to you a problem and I don't have the solution to it, so I hope you know I will be disappointed.",
            "But what we try to do within the project was to.",
            "Get the industry to work very close together with us and we failed.",
            "We had to put them out of the project again.",
            "So I'm going to tell you something about the religious charging in general.",
            "Tell you something about a project, how we tried to build it up, where we failed, and how we had to do a Plan B.",
            "And I feel a bit lonely because I wrote this paper together with the young, healthy and they never clean and they were actually supposed to sit in the audience today and support me.",
            "If you have any questions.",
            "But device in a Kuala Lumpur and John Quartersawn disease from his kids, so he's in bed.",
            "So therefore I will really focus the presentation on the case study and not on the theoretical framework.",
            "So."
        ],
        [
            "Lori Rd user charging is something that is really on the European agenda and I think you have seen that in other sessions.",
            "There would be presentation about it as well where you can learn more about the effects and impacts and things like that.",
            "I'm not going to talk about that on this map.",
            "You can see the countries who has already implemented it and a number of countries who are planning it.",
            "So I'm just going to show it to make sure that you have the picture.",
            "This is something quite big."
        ],
        [
            "Right now.",
            "But you also know that Rd user charges nothing you you're traveling through Europe and you have this systems in France and in Spain, and it's nothing really new.",
            "But what is new and what makes this very interesting and also open it up for the talk about innovation.",
            "Is that we are having a complete different situation.",
            "Now we have a technology that enable us to do.",
            "Other other type of the solutions.",
            "It will be possible or it is possible to know which weekend has been at which place at which time.",
            "These three basic ingredients opens up a lot of possibilities.",
            "So my my message is more or less it doesn't matter if you talk about Rd user charging or if we talk about smart insurances or if we talk about equal what we're talking about is that we have a new kind of infrastructure that opens up a lot of new possibilities.",
            "And this is in the borderland between public and private.",
            "It's not, it's not.",
            "Pure public, it's not.",
            "Put your private, so we have to find new ways of cooperation.",
            "Quick cooperate here to build really good knowledge.",
            "Sweden has been thinking about Rd user charging since long time, but since 2002 there was an investigation that suggested roads are charging.",
            "And there had been another decisions, and there's been investigations and there has been no decision.",
            "So we think there might be a decision this autumn.",
            "We don't know.",
            "But in parallel to this process."
        ],
        [
            "A number of research projects going on, and that's what I will focus on."
        ],
        [
            "Before the arena project started, we had a project called Tango Collect and one of the main findings from that project was you should not look into a issue like Rd user charging from a narrow point of view.",
            "Just finding a concept.",
            "You have to involve all the actors, so our idea with the arena project was to create an integrated approach and you can see on the picture here.",
            "You need to have the agencies and the authorities the one who provides the legal framework.",
            "You have to understand their role and they have to put put up their policy goals.",
            "You have to have the infrastructure operators who are the one who's going to be in charge of the systems.",
            "You have to have the users who's going to.",
            "Be part of the system and actually using it.",
            "You have to have the suppliers and I think.",
            "It's really important to have us have the supplies because they are the only one who have the operational experience.",
            "The other only one who knows what is going to cost the other.",
            "The real knowledge carrier and I've been a consultant of all my life and I think it's very important we consulting as well, but we don't have that kind of knowledge.",
            "And then."
        ],
        [
            "This idea about an integrated approach?",
            "That's nothing you.",
            "In Sweden we talk very much about the Swedish model or the triple Helix model, which is really about combining Academy Academy, government and.",
            "Stream using that as a basis of creating knowledge.",
            "So that was the basic idea for the project that was the starting point, and now I'm going to show you how we failed."
        ],
        [
            "Our starting idea was to have the the arena project and then to have a user advisory group where we would have the whole years and forward us and then to have an industry advisory group so we could.",
            "Discuss and interact."
        ],
        [
            "When the project was established, we had the two strong industry partners.",
            "One is building system and one of the very big in the mobile communication is freedom and.",
            "They decided they wanted to take part in the project, so they left this industry advisory group and became real project members.",
            "That's how we started off.",
            "Unfortunately, it turned out that was not a sustainable model after one year.",
            "Other industry partners who were in the Industry Advisory Group started to question this."
        ],
        [
            "They say, well, what, why, why can't we be part of the project as well and.",
            "We had a situation, a defective this situation with.",
            "Completely different stages of the industry partners.",
            "We had partners who got funding but also could influence how the project should be carried out because they were steering committee and then we had industry partners who could only react on our question.",
            "Also, when it comes to Rd user charging either I'm not.",
            "I don't know how much you know about it, but it's all of often quite dirty.",
            "Procurement process is was in Stockholm, was in Czechia and you see it all the time.",
            "Someone wins the bid and someone goes to court.",
            "And that takes time.",
            "So to Swedish Air Rd administration started to get cold feet.",
            "Realizing that this could.",
            "Be dangerous in the future situation when the actual procurement should start.",
            "But also the industry partners who were involved got scared, realizing that they might miss the chance of being the real bidder.",
            "And what is also very typical for Rd user charging is that you have one big bid by the win it or you lose it.",
            "And if you win it you have it for maybe 10 or 15 years or even longer.",
            "But if you lose it, you're up.",
            "So we had to take out these two partners so we were back."
        ],
        [
            "Starting point.",
            "So what we decided to do was Sir Plan B.",
            "Well, we took the industry advisory group and rearranged it to an industry forum.",
            "In this industry forum is completely open for anyone who wants to participate and maybe the name is a bit awkward as well because we have partners who are not industry.",
            "We have the.",
            "For example, another had traffic ministries participating.",
            "And within this industry forum.",
            "And we are having a very close cooperation with them.",
            "We're having a consultation process all the time when we do something with."
        ],
        [
            "Get out of them and ask him.",
            "Do you think this is a robust?",
            "Is this a good solution?",
            "Please comment.",
            "It also organized workshops where we get the people to come together and you should know that's interesting from two points of view on the one side we get the public private partners to to meet.",
            "You also get the industry partners who normally never talk to each other to sit at the same table and discuss.",
            "So for for us as a project, this has been extremely rewarding.",
            "We get our concept constantly tested, So what we have now I think is quite quite robust and also we provide this platform for the people to meet, which I think has an important at a various."
        ],
        [
            "And given the lack of time, you can just see this is an example of the partners of the industry forum.",
            "So it it has been extremely valuable.",
            "With this kind of interaction, but I think it's still a problem because it's not on an even level.",
            "We have a project, we do the development and we test it.",
            "I think it's really important that we get a situation where you can have a Co evaluation where you actually have an even partnership where you can bring out the best competence is and get to good solutions.",
            "So if I try to conclude what we have learned.",
            "Is that we tried to develop a public private partnership solution?"
        ],
        [
            "Even playing field, at least for the one who were in the project where we could work on a principle principle level.",
            "But it was not possible.",
            "And the arena project is now going into stage two.",
            "We have exactly the same problem.",
            "Now how should we include industry now?",
            "We probably have to do some kind of frameworks and do our own procurement process within the project and that will of course cost a lot of money and open up for conflicts as well."
        ],
        [
            "So I think there is not a perfect public private partnership model.",
            "Especially not when in this area and when you talk about future system suppliers.",
            "And what I think is quite interesting is that we had had no conflict between the authorities, the academia and the consultants, and I mean consultants are also possible future.",
            "Bidders, but that was never discussed.",
            "And I think.",
            "It's actually clear that we need to get a new framework."
        ],
        [
            "And.",
            "I also think this is something we need to take very serious.",
            "This is a problem.",
            "This is something that slows down our knowledge share development.",
            "I think to create this Sir Ewan and robust knowledge knowledge we need to combine the best competence is from different areas from public, private and academia.",
            "And we need an enabling framework to be able to do that without risking future procurement.",
            "And I think that framework should have in mind that Europe need really to be a stronger innovative region.",
            "So at least now I'm really up to coffee, but.",
            "I think if someone is interested and want to know more at the arena project, just finalized and we have one final report, it's we."
        ],
        [
            "Short maximum 50 pages.",
            "And that one is supported by a number of the detailed report.",
            "So if anyone has interest, just download them or you can come and talk to me."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you, I think we should all start by thanking our Italian colleague who decided to stay at home.",
                    "label": 0
                },
                {
                    "sent": "Now at least we have a chance to get the coffee break.",
                    "label": 0
                },
                {
                    "sent": "So I'm here to talk about institutional barriers for public private partnership, and it has a bit different focus.",
                    "label": 1
                },
                {
                    "sent": "It's about knowledge development.",
                    "label": 0
                },
                {
                    "sent": "And I've been the project manager for a project in Sweden called Arena which is looking into Rd user charging for Loris and it's in a very early stage looking at how could a concept we developed, how should it look like?",
                    "label": 0
                },
                {
                    "sent": "So what I'm going to talk about is the experiences from that project and it's actually.",
                    "label": 0
                },
                {
                    "sent": "I'm going to present to you a problem and I don't have the solution to it, so I hope you know I will be disappointed.",
                    "label": 0
                },
                {
                    "sent": "But what we try to do within the project was to.",
                    "label": 0
                },
                {
                    "sent": "Get the industry to work very close together with us and we failed.",
                    "label": 0
                },
                {
                    "sent": "We had to put them out of the project again.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to tell you something about the religious charging in general.",
                    "label": 0
                },
                {
                    "sent": "Tell you something about a project, how we tried to build it up, where we failed, and how we had to do a Plan B.",
                    "label": 0
                },
                {
                    "sent": "And I feel a bit lonely because I wrote this paper together with the young, healthy and they never clean and they were actually supposed to sit in the audience today and support me.",
                    "label": 0
                },
                {
                    "sent": "If you have any questions.",
                    "label": 0
                },
                {
                    "sent": "But device in a Kuala Lumpur and John Quartersawn disease from his kids, so he's in bed.",
                    "label": 0
                },
                {
                    "sent": "So therefore I will really focus the presentation on the case study and not on the theoretical framework.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lori Rd user charging is something that is really on the European agenda and I think you have seen that in other sessions.",
                    "label": 0
                },
                {
                    "sent": "There would be presentation about it as well where you can learn more about the effects and impacts and things like that.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to talk about that on this map.",
                    "label": 0
                },
                {
                    "sent": "You can see the countries who has already implemented it and a number of countries who are planning it.",
                    "label": 0
                },
                {
                    "sent": "So I'm just going to show it to make sure that you have the picture.",
                    "label": 0
                },
                {
                    "sent": "This is something quite big.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "But you also know that Rd user charges nothing you you're traveling through Europe and you have this systems in France and in Spain, and it's nothing really new.",
                    "label": 1
                },
                {
                    "sent": "But what is new and what makes this very interesting and also open it up for the talk about innovation.",
                    "label": 0
                },
                {
                    "sent": "Is that we are having a complete different situation.",
                    "label": 0
                },
                {
                    "sent": "Now we have a technology that enable us to do.",
                    "label": 0
                },
                {
                    "sent": "Other other type of the solutions.",
                    "label": 0
                },
                {
                    "sent": "It will be possible or it is possible to know which weekend has been at which place at which time.",
                    "label": 0
                },
                {
                    "sent": "These three basic ingredients opens up a lot of possibilities.",
                    "label": 0
                },
                {
                    "sent": "So my my message is more or less it doesn't matter if you talk about Rd user charging or if we talk about smart insurances or if we talk about equal what we're talking about is that we have a new kind of infrastructure that opens up a lot of new possibilities.",
                    "label": 0
                },
                {
                    "sent": "And this is in the borderland between public and private.",
                    "label": 0
                },
                {
                    "sent": "It's not, it's not.",
                    "label": 0
                },
                {
                    "sent": "Pure public, it's not.",
                    "label": 0
                },
                {
                    "sent": "Put your private, so we have to find new ways of cooperation.",
                    "label": 0
                },
                {
                    "sent": "Quick cooperate here to build really good knowledge.",
                    "label": 0
                },
                {
                    "sent": "Sweden has been thinking about Rd user charging since long time, but since 2002 there was an investigation that suggested roads are charging.",
                    "label": 0
                },
                {
                    "sent": "And there had been another decisions, and there's been investigations and there has been no decision.",
                    "label": 0
                },
                {
                    "sent": "So we think there might be a decision this autumn.",
                    "label": 0
                },
                {
                    "sent": "We don't know.",
                    "label": 0
                },
                {
                    "sent": "But in parallel to this process.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A number of research projects going on, and that's what I will focus on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Before the arena project started, we had a project called Tango Collect and one of the main findings from that project was you should not look into a issue like Rd user charging from a narrow point of view.",
                    "label": 0
                },
                {
                    "sent": "Just finding a concept.",
                    "label": 0
                },
                {
                    "sent": "You have to involve all the actors, so our idea with the arena project was to create an integrated approach and you can see on the picture here.",
                    "label": 1
                },
                {
                    "sent": "You need to have the agencies and the authorities the one who provides the legal framework.",
                    "label": 0
                },
                {
                    "sent": "You have to understand their role and they have to put put up their policy goals.",
                    "label": 0
                },
                {
                    "sent": "You have to have the infrastructure operators who are the one who's going to be in charge of the systems.",
                    "label": 1
                },
                {
                    "sent": "You have to have the users who's going to.",
                    "label": 0
                },
                {
                    "sent": "Be part of the system and actually using it.",
                    "label": 0
                },
                {
                    "sent": "You have to have the suppliers and I think.",
                    "label": 0
                },
                {
                    "sent": "It's really important to have us have the supplies because they are the only one who have the operational experience.",
                    "label": 0
                },
                {
                    "sent": "The other only one who knows what is going to cost the other.",
                    "label": 0
                },
                {
                    "sent": "The real knowledge carrier and I've been a consultant of all my life and I think it's very important we consulting as well, but we don't have that kind of knowledge.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This idea about an integrated approach?",
                    "label": 0
                },
                {
                    "sent": "That's nothing you.",
                    "label": 0
                },
                {
                    "sent": "In Sweden we talk very much about the Swedish model or the triple Helix model, which is really about combining Academy Academy, government and.",
                    "label": 0
                },
                {
                    "sent": "Stream using that as a basis of creating knowledge.",
                    "label": 0
                },
                {
                    "sent": "So that was the basic idea for the project that was the starting point, and now I'm going to show you how we failed.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our starting idea was to have the the arena project and then to have a user advisory group where we would have the whole years and forward us and then to have an industry advisory group so we could.",
                    "label": 0
                },
                {
                    "sent": "Discuss and interact.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When the project was established, we had the two strong industry partners.",
                    "label": 0
                },
                {
                    "sent": "One is building system and one of the very big in the mobile communication is freedom and.",
                    "label": 0
                },
                {
                    "sent": "They decided they wanted to take part in the project, so they left this industry advisory group and became real project members.",
                    "label": 0
                },
                {
                    "sent": "That's how we started off.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, it turned out that was not a sustainable model after one year.",
                    "label": 0
                },
                {
                    "sent": "Other industry partners who were in the Industry Advisory Group started to question this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They say, well, what, why, why can't we be part of the project as well and.",
                    "label": 0
                },
                {
                    "sent": "We had a situation, a defective this situation with.",
                    "label": 0
                },
                {
                    "sent": "Completely different stages of the industry partners.",
                    "label": 1
                },
                {
                    "sent": "We had partners who got funding but also could influence how the project should be carried out because they were steering committee and then we had industry partners who could only react on our question.",
                    "label": 1
                },
                {
                    "sent": "Also, when it comes to Rd user charging either I'm not.",
                    "label": 1
                },
                {
                    "sent": "I don't know how much you know about it, but it's all of often quite dirty.",
                    "label": 0
                },
                {
                    "sent": "Procurement process is was in Stockholm, was in Czechia and you see it all the time.",
                    "label": 0
                },
                {
                    "sent": "Someone wins the bid and someone goes to court.",
                    "label": 0
                },
                {
                    "sent": "And that takes time.",
                    "label": 0
                },
                {
                    "sent": "So to Swedish Air Rd administration started to get cold feet.",
                    "label": 0
                },
                {
                    "sent": "Realizing that this could.",
                    "label": 0
                },
                {
                    "sent": "Be dangerous in the future situation when the actual procurement should start.",
                    "label": 0
                },
                {
                    "sent": "But also the industry partners who were involved got scared, realizing that they might miss the chance of being the real bidder.",
                    "label": 0
                },
                {
                    "sent": "And what is also very typical for Rd user charging is that you have one big bid by the win it or you lose it.",
                    "label": 0
                },
                {
                    "sent": "And if you win it you have it for maybe 10 or 15 years or even longer.",
                    "label": 0
                },
                {
                    "sent": "But if you lose it, you're up.",
                    "label": 0
                },
                {
                    "sent": "So we had to take out these two partners so we were back.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Starting point.",
                    "label": 0
                },
                {
                    "sent": "So what we decided to do was Sir Plan B.",
                    "label": 1
                },
                {
                    "sent": "Well, we took the industry advisory group and rearranged it to an industry forum.",
                    "label": 0
                },
                {
                    "sent": "In this industry forum is completely open for anyone who wants to participate and maybe the name is a bit awkward as well because we have partners who are not industry.",
                    "label": 0
                },
                {
                    "sent": "We have the.",
                    "label": 0
                },
                {
                    "sent": "For example, another had traffic ministries participating.",
                    "label": 0
                },
                {
                    "sent": "And within this industry forum.",
                    "label": 1
                },
                {
                    "sent": "And we are having a very close cooperation with them.",
                    "label": 0
                },
                {
                    "sent": "We're having a consultation process all the time when we do something with.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Get out of them and ask him.",
                    "label": 0
                },
                {
                    "sent": "Do you think this is a robust?",
                    "label": 1
                },
                {
                    "sent": "Is this a good solution?",
                    "label": 0
                },
                {
                    "sent": "Please comment.",
                    "label": 0
                },
                {
                    "sent": "It also organized workshops where we get the people to come together and you should know that's interesting from two points of view on the one side we get the public private partners to to meet.",
                    "label": 1
                },
                {
                    "sent": "You also get the industry partners who normally never talk to each other to sit at the same table and discuss.",
                    "label": 0
                },
                {
                    "sent": "So for for us as a project, this has been extremely rewarding.",
                    "label": 0
                },
                {
                    "sent": "We get our concept constantly tested, So what we have now I think is quite quite robust and also we provide this platform for the people to meet, which I think has an important at a various.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And given the lack of time, you can just see this is an example of the partners of the industry forum.",
                    "label": 0
                },
                {
                    "sent": "So it it has been extremely valuable.",
                    "label": 0
                },
                {
                    "sent": "With this kind of interaction, but I think it's still a problem because it's not on an even level.",
                    "label": 0
                },
                {
                    "sent": "We have a project, we do the development and we test it.",
                    "label": 0
                },
                {
                    "sent": "I think it's really important that we get a situation where you can have a Co evaluation where you actually have an even partnership where you can bring out the best competence is and get to good solutions.",
                    "label": 0
                },
                {
                    "sent": "So if I try to conclude what we have learned.",
                    "label": 0
                },
                {
                    "sent": "Is that we tried to develop a public private partnership solution?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even playing field, at least for the one who were in the project where we could work on a principle principle level.",
                    "label": 0
                },
                {
                    "sent": "But it was not possible.",
                    "label": 0
                },
                {
                    "sent": "And the arena project is now going into stage two.",
                    "label": 0
                },
                {
                    "sent": "We have exactly the same problem.",
                    "label": 0
                },
                {
                    "sent": "Now how should we include industry now?",
                    "label": 0
                },
                {
                    "sent": "We probably have to do some kind of frameworks and do our own procurement process within the project and that will of course cost a lot of money and open up for conflicts as well.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I think there is not a perfect public private partnership model.",
                    "label": 0
                },
                {
                    "sent": "Especially not when in this area and when you talk about future system suppliers.",
                    "label": 1
                },
                {
                    "sent": "And what I think is quite interesting is that we had had no conflict between the authorities, the academia and the consultants, and I mean consultants are also possible future.",
                    "label": 1
                },
                {
                    "sent": "Bidders, but that was never discussed.",
                    "label": 0
                },
                {
                    "sent": "And I think.",
                    "label": 0
                },
                {
                    "sent": "It's actually clear that we need to get a new framework.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I also think this is something we need to take very serious.",
                    "label": 0
                },
                {
                    "sent": "This is a problem.",
                    "label": 0
                },
                {
                    "sent": "This is something that slows down our knowledge share development.",
                    "label": 0
                },
                {
                    "sent": "I think to create this Sir Ewan and robust knowledge knowledge we need to combine the best competence is from different areas from public, private and academia.",
                    "label": 1
                },
                {
                    "sent": "And we need an enabling framework to be able to do that without risking future procurement.",
                    "label": 0
                },
                {
                    "sent": "And I think that framework should have in mind that Europe need really to be a stronger innovative region.",
                    "label": 0
                },
                {
                    "sent": "So at least now I'm really up to coffee, but.",
                    "label": 0
                },
                {
                    "sent": "I think if someone is interested and want to know more at the arena project, just finalized and we have one final report, it's we.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Short maximum 50 pages.",
                    "label": 0
                },
                {
                    "sent": "And that one is supported by a number of the detailed report.",
                    "label": 0
                },
                {
                    "sent": "So if anyone has interest, just download them or you can come and talk to me.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}