{
    "id": "maj2vsa2755tpfhjjhf3tpgvzosst2y4",
    "title": "Climate Change and United Nations Studies in the Context of SEE Regional Inter-University Co-operation",
    "info": {
        "author": [
            "Branislava Lalić, University of Novi Sad"
        ],
        "published": "June 21, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Environment->Climate Change"
        ]
    },
    "url": "http://videolectures.net/ccandun2010_lalic_cscr/",
    "segmentation": [
        [
            "With this, I would suggest that we come to the next presentation from a banister valag from the University of Novi Sad.",
            "OK, something like Mr Rogers said about this workshop and presentation.",
            "So just just.",
            "OK, today I."
        ],
        [
            "I like to put more light on.",
            "Social responsibility."
        ],
        [
            "Of scientists and teachers.",
            "University teachers regarding this global campaign against climate change.",
            "I mean, when we are speaking about climate change, this story is always related to people.",
            "The way of living, migrations, mitigations, Wars, heritage art, I mean, climate change is for sure one of most important natural factors affecting way of living all."
        ],
        [
            "Around the world.",
            "And during the last decades of fantasy entry, I mean last at least 50 years of 20 century scientists invested enormous amount of energy and time in order to."
        ],
        [
            "Find answers on some very crucial questions.",
            "I mean, billions of something are invested in order to find out how climate will change and how it will affect our life.",
            "Whether some places on Earth will became less suitable for living, how to apply different mitigation techniques, and what to do if the patient is very own way out."
        ],
        [
            "I mean, accumulated knowledge and proposed solutions an enormous if you put on Google, for example requests request with books with climate change in the title, we will find more than three or 2000 tips.",
            "If you are looking for scientific projects about climate change, I think it's more than two millions project on Internet with this in the in the title.",
            "But what we are where what we are facing it?",
            "Is very weak link between science answer."
        ],
        [
            "SoC, I'm afraid that effectiveness with collective consciousness is very, very low level.",
            "I'm afraid that effectiveness of collective consciousness that does not following rate of climate change, and that's our crucial problem in in."
        ],
        [
            "This global campaign.",
            "So I would like just to remind you that this supposed yesterday we have much more information about that that more than 90% of all natural disasters among gold.",
            "Those re cyantific results all adaptation techniques or all projects.",
            "We still have millions and millions people suffering from climate change last year just in in year 2009, more than 55 million of people.",
            "How was affected by?"
        ],
        [
            "By extreme weather events and I mean billions of dollars are damaged.",
            "That is one of main problems I think is to put into conscious to put in mind of people on all levels, all generations, that climate change is irreversible process.",
            "That's very important task, no matter.",
            "No matter that if we are talking to two very young people or very old people, you know one of my favorite politicians frequently said if you have a fish.",
            "Can you make fish soup and if you eat this fish, I mean this hope you don't have a fish anymore.",
            "You can't go back.",
            "The similar situation is with climate change.",
            "We can't go back.",
            "We just have to hope that next step will be smaller, will be less steep, but we can't change what we already do.",
            "So I think that first of all, personal responsibility is most important one.",
            "You know when you go in the morning on your job and you go by car and if your car is very old one and if you emit a lot of gas is you have to be aware that you participate in global climate change for one 0.0001 degrees.",
            "You increase this global temperature.",
            "That's very important task when we can reduce this effect in people minds then we are.",
            "Then we are successful in our teaching on higher education.",
            "Of course, in this campaign media are very important because we are teaching.",
            "Also people working in media.",
            "But I'm afraid in our country I don't know what situation other countries.",
            "But in our country there is two too much sensationalism in media and there is not enough everyday life based strategy.",
            "I know last year Journal Premier Belgrade Journal.",
            "Maker one how to say article in which I supposed to set that we will grow bananas in Serbia.",
            "I will never said something like this but they wrote this on front page.",
            "And that's it.",
            "Yes, now we have anything from something like this educational system and the state responsibility.",
            "Of course, varying is important, but we have national strategies.",
            "We have.",
            "Communications, documents, politicians, everything else.",
            "But we still have this week links now between science society and policies."
        ],
        [
            "Or politicians, and besides all those accumulated knowledge in science, we still have greenhouse gas emission increase we have.",
            "Still we still have situations that most developed countries didn't sign Kyoto.",
            "We do not know what will be with Copenhagen and."
        ],
        [
            "Everything else, so we have problems.",
            "We have problem in communication through the decision makers, but I would like to make a little bit broader definition of decision makers.",
            "Usually people thinking about politicians when they said decision makers.",
            "I do not believe that politicians are real decision makers.",
            "You know the politicians.",
            "Thinking about politics and policies but.",
            "Real decision makers are farmers.",
            "Are school teachers.",
            "Are GPS economist banking banking's?",
            "I mean induce people working in industry because when, for example manager of Big Car Factory should put new filters or change technology of production then he have to decide what we will, what he will do when teacher in elementary school.",
            "I have to teach kids about climate change.",
            "He's real decision maker.",
            "He makes decisions about how he will do this and on which way.",
            "So I deeply believe that each day we are teaching and we are educating educating decision makers."
        ],
        [
            "But the question is how to improve this issue?",
            "Education because we are aware that all those links are very, very weak.",
            "We are not absolutely not satisfied with the results of."
        ],
        [
            "Our education well.",
            "Answer On this is of course education on some new level and some new approach to education is always good answer.",
            "University teachers have possibility and responsive."
        ],
        [
            "Related to to provide properly educated decision makers, and I think that this United Nation concept of studies, because I I mean forward about some other projects related to University, United Nation, University studies.",
            "This concept I think is ideal framework to harmonize our University curricula.",
            "I start from from this multi level and interdisciplinary approach.",
            "And I would like to present you one possible way how we can harmonize our University curricula and establish some kind of project related to this.",
            "Of course, first we have to move from basically descriptive to more quantitative way of teaching about climate change and their impact.",
            "I start from."
        ],
        [
            "And the concept a little bit modified, of course, but established in Australia.",
            "Australia have very interesting concept of education.",
            "Higher education in the climate change.",
            "And the there is supposed main topics which have to include in this query Cola our science of climate change.",
            "Of course in which we will teach students about Earth, climate system, greenhouse gas, greenhouse gases and things like this, but on different levels.",
            "For example, always level is pure phenomenology.",
            "Highest level is completely physically in chemistry and everything else based approach.",
            "Then we have, for example, impacts of climate change.",
            "It's important topic.",
            "It's next topic for all faculties.",
            "I mean when I say topic, I mean we should teach that at all faculties at University input studies how to assess climate change, impact tools for different kind of assessment.",
            "Then legislation and international negotiations.",
            "It's very important task even you are a physicist, you have to have some basic knowledge about Kyoto protocols, about IPCC, about different kinds of public problems related related to registration legislation.",
            "Then next, very important topics which have to be covered is ethics of climate change is specially important for students or flow.",
            "And Faculty of philosophy and different kinds of student cause.",
            "Question is who's for example is possible to conserve the protect and maintain the environment for the future?",
            "Who will be responsible for damage caused by climate change and how people can solve that kind of problems?",
            "It's very important task of course, address to faculty of Law and economics and banking.",
            "But on informative level important for.",
            "For students of."
        ],
        [
            "If I could give Sciences then economics of climate change.",
            "First of all, devoted to I said students of economics, banking, management and related to faculties, forms of energy generation.",
            "Of course on highest level for Faculty of Engineering but important also for Faculty of Economics, Loane Science solutions for reduced.",
            "Emission of course, and one topic which I add to this Australian concept is climate change and public health.",
            "I think that it shouldn't be teached on this informative level, especially students of medicine really have to have much more deeper and scientifically based impact on possible effects, causes and adaptation measures.",
            "But also people studying low and economics.",
            "And science have to have that kind of information, because for example if they became if they go to work in governmental institutions or local local governments, they really need knowledge about that.",
            "You know we have in Malta.",
            "In my town.",
            "I mean it's regular situation.",
            "If federal, hydro, metrological institutes make announcement, excuse me.",
            "Choose me.",
            "National National Hydrometeorological Service make announcement of very high temperatures or heat waves, then they or two in advance.",
            "They make some group of people and talking what to do with this?",
            "Then nothing.",
            "You can't do anything two days before heat wave you have to have strategy what to do in this situation and then take this strategy from the shelf and help people do this.",
            "Do that.",
            "I mean, that's very important."
        ],
        [
            "Ask so one possible University curriculum which can we test, for example, in some summer school with students from different faculties, is to make for example, this line 8 or 9 topics to invite students, few of them from different faculties and teach them.",
            "Teach them all those topics on different level and different grades just to test this possibility and to see how they will react, react and how they.",
            "We will accept dent kind of teaching of climate change.",
            "That's my suggestion for our further work as a possible solution."
        ],
        [
            "Thank you.",
            "Congratulations Branislava, this was really an excellent presentation.",
            "Really structuring a lot of these potential.",
            "Plans of action for the future, and I think we should work in this document also based on your suggestions.",
            "Well, I guess it's a wonderful concept, although I think that actually economics of climate change.",
            "It's you can understand that very differently because it's it's economy itself.",
            "Produce climate change to be so.",
            "But what you mean.",
            "But economics of climate change is something different, but what is because you mentioned that students of physics, for instance, they know very little about it, but they they know very little about economy itself.",
            "So I think this is one of the major major subjects here.",
            "For all that because we live in a dream sometimes 'cause if we know how international trade works then you see you can't stop climate change because of interconnectivity of all these things.",
            "So this should be a major subject to all technicians, not not just something that is my suggestion to put it in the Center for all those who have background in natural science, but in the second is about this.",
            "The climate change in and health this is to do much focused because I will tell you about this 2003 heat wave.",
            "It was attributed to the climate change heat itself.",
            "OK, no problem with that.",
            "But what about people who died?",
            "Did they die because of the heat wave or not?",
            "This question is still open and majority later after 2003 majority of serious study showed that in many cities they died because of the ozone concentration.",
            "Because of the traffic because but combined with a heat wave, what is my point?",
            "I think that we desperately need in the health system people who are dealing with environmental and health, air pollution, climate change and health, not just climate change, because this is a very narrow and we have the problem of air pollution and health all the time in the winter in so I would suggest to go for this subject more broadly, not just climate change but all related problems.",
            "Bad water.",
            "Air pollution because climate change tends to take them to to be to interconnect with these problems and make it really little.",
            "So this is my second suggestion to broaden this, not just climate change.",
            "It helps, but the big product.",
            "Thank you very much.",
            "I would just like to add that we are planning to have our next kolac regional colloquium on capacity building on global governance in the UN system on markets.",
            "Market failures and the role of global governance.",
            "Because externalities and not considering the climate cost environmental costs in the price signals of product and services is one of the main sources of climate change and other related problems.",
            "Also, Justin's additional information Georgia has been thank you very much for this most interesting presentation.",
            "I like the concept very much and it made me remembering of the curriculum of the Central European University.",
            "Which is operated in Hungary in Budapest, and they have climate change for for the students, and the structure is similar of course not as detailed as you presented, and I'm wondering whether you have some Contacts with them and you get you can ask them about their experience is what is the feedback from the students that because it has been going on for several years, so maybe it's good to contact them and exchange of views about that will be great.",
            "Dear thank you.",
            "I don't know exactly who was first, OK. Just to reply I have I had to post Doc on climate change is using an Open University in Budapest.",
            "They're more low oriented than science oriented, but what what I just would like to add few pieces.",
            "I think they are missed from this matrix.",
            "For me, the missing piece is not just greenhouse gases data, because if you come to data in Serbia, if you it is probably the same in the other countries.",
            "You're coming that different sources of data.",
            "All official are giving few times different date a few times.",
            "Multiple 34 I mean that means that we are we have two coming those somehow to do sources of data somehow somehow to to the.",
            "Generators of greenhouse gases, not just the data.",
            "This is 1 block that should be just not data is such are not enough in the region.",
            "Another thing I find a little bit missing, they are still.",
            "Although mitigation, the effects of mitigation measures are limited.",
            "It is useful to teach mitigation measures because it's linked to the pollution control.",
            "It's linked to IP.",
            "We see integral pollution and prevention control.",
            "It's linked to all issues coming to slow down grace greenhouse gases, including, for example, transport.",
            "This is in region, not touch at all.",
            "This is Miss Piece and one another words Professor Mariana, which mentioned this is some kind of to link the Swiss sustainable consumption and production.",
            "This consumption issues and.",
            "That means this is good metrics, but we should be some pieces to add and to look carefully what is missing and just to have one comment I'm for about now five years the Member of Advice, Environmental Social Advisory Committee of the Directory of EBRD in European Bank of Reconstruction and Development.",
            "These are.",
            "Pure economists.",
            "And when I came five years back there, they simple didn't understand what we are there about 10 of us or less than 10.",
            "We are meeting twice here to advise the director of Bank is putting the questions of questionable environmentally questionable projects.",
            "To see how we look at this.",
            "First year I really they they really couldn't understand what me or some other people are talking about.",
            "That means that about four years now we are starting to understand each other.",
            "We are now coming there with the they are they put in procurement, environmental friendly supply chain or something like this?",
            "Yeah, starting to understand each other but missed that that kind of.",
            "Vocabulary between different different background economists to understand what we are, they just couldn't understand the values.",
            "What we are talking about, they're just.",
            "Of the other of.",
            "The part of the scale, and this is very different in this is the issue, but you mentioned we have to find the language as some kind of natural science or or other scientists find the language that economists understand.",
            "Maybe they would like but they don't.",
            "And this is something that is really very important issue, but it is still not sold on.",
            "The global scale tool and it is 1 good.",
            "So it is.",
            "Now conference planning on.",
            "Climate change governance, Yale University.",
            "Before the UN meeting on Millennium Development Goals in York in September and they are now in the process, it is so so interesting to see what they're looking for, and this is a lot of answers will be.",
            "Then now they put governance in the center of the the story and after that they will develop science for the governance.",
            "This is what?",
            "Thank you.",
            "Just I would like to say a couple of words branislava I congratulate for your approach.",
            "I very appreciated I'm economist.",
            "And honestly, today's first day that I met one climate change economics.",
            "Then I'm very happy because of that.",
            "Professor Bogote said economics cause climate change.",
            "I completely agree with you and I would like to say.",
            "Economics could be seen not just as a part of the problem.",
            "I would like to say I would like to see economics also as a part of the solution.",
            "And we need actually, because we're teaching, we're talking about teaching climate change.",
            "I would like to say we need to change our mental schemes and this matrix is, for me is excellent tool.",
            "I would like to pay more attention of economics of climate change because we need to teach people in social Sciences about more about economics.",
            "How the economics caused the plan changes and how economics could help to solve the problems because we are now talking about climate change and some guys are making the money on climate exchanges and later on I will be talking a little bit about that.",
            "Also I would like to say also some some some some different that.",
            "Uh.",
            "Sometimes when we are I've been working for 17 years for state School of Economics here at Bellevue University in last five years I'm teaching couple of courses at Belgrade Banking Academy and I have two my young colleagues who recently graduated for both schools, schools, economics and BBA, and I'm not sure did any teacher on those cool even mentioned.",
            "Climate change.",
            "Alexander Dushko no.",
            "Can you imagine?",
            "Death on our University in social Sciences, in the field of economics, professors don't mention climate change.",
            "This is the terrible situation an we need sometimes.",
            "The first step how to find solution is to recognize the problem.",
            "Maybe later on I will.",
            "I will continue some of my ideas and I will explain in much more details.",
            "I will tell you, now you provoke me and I will tell you my my personal experience at the Faculty of Economics in Juliana.",
            "They realized that climate change is an issue.",
            "They they probably want to make some extra money on climate change, not to mitigate it, but anyway, and we give appropriate professore brush nickel.",
            "He's a very bright guy.",
            "He gets also some courses in this area, but then he said he invited me and he said, come and have some little.",
            "Part of my course, but for post graduates need not for them bachelors I say OK but I told him why don't you do it?",
            "He said I will lose my face.",
            "Make it not invite me to speak because I know better climate change because I'm outside.",
            "They're not sort of, you know my point and it was very interesting and I hate this course.",
            "It was a mixed group.",
            "People from Russia and Slovenia and Macedonia.",
            "And actually they've heard for the first time about externalities about all sorts of of these carbon imbedded in trade and and actually it was a very nice group.",
            "They they really listened.",
            "We we had a lot of discussion.",
            "But after the end of this course, they say OK, it's wonderful that we've heard this, but you know, when it was Russian study student who said it.",
            "But actually what you told us is directly opposite.",
            "What were we taught for four years?",
            "Profit, profit, maximizing profit.",
            "But all the solution in climate change lies in the opposite direction.",
            "So then I understood Professor Brush Nickel, who said you should teach there because I will lose my face.",
            "So this is huge problem.",
            "And and if you eat it, we have to do something like that, because economists probably don't want to lose their faces.",
            "OK, just one sentence.",
            "Sometimes we need to think out of the box and solution could be in one concept called knowledge management and life long learning.",
            "Good good.",
            "Agree something concerning something concerning.",
            "I'm sorry yes.",
            "Brownies lovers presentation there is much more.",
            "To the impact of climate change on fabrikal, then heat waves and whatever risk management with floods and all of that.",
            "There is a whole big area of human behavior.",
            "Which is causing climate change much more, which is concerned with nutrition and nutrition habits.",
            "And there is an that's a field that hasn't been covered by climate change.",
            "Health impact studies.",
            "It is a very important area, exactly.",
            "It's a very important area of health promotion.",
            "It is climate change diet.",
            "You could find it on it.",
            "Yes, I know, but I know I was.",
            "I was just mentioning that in study that you it says including.",
            "Oh, I know all kinds of things, but the most common for all the people which is nutrition which is connected with consumption an all the all the habits is not included in climate change, climate change, health impact.",
            "Which is, I think a very big mistake.",
            "I have a point that is also based on my personal experience.",
            "As a geographer, I insist to have always multidisciplinary team.",
            "Which never ended up to be transdisciplinary for a simple reason that everyone says I have the last word solution and the other one is always the guilty.",
            "I think we don't go very far with this approach.",
            "So before we move a step ahead together is as a learning community.",
            "Each of us may step once back and see that there might be another way out of the box.",
            "I don't think he's honest to give the wall responsibility to some.",
            "Well identified categories, it's easy to say this bloody economists.",
            "They're part of the problem and they are not yet part of this solution.",
            "Politicians, Mamma Mia, they don't get anything.",
            "I got to know good politicians.",
            "Luckily and bad politician I got in a good NGO and bad in jail etc etc etc.",
            "So I think it's good physicists and bad physicist.",
            "Why not good Umm Bellevue and so now I'm talking to you as professor or a locators whatever you like to see yourself.",
            "And you have a great social responsibility means to to instill into into this beautiful minds that are coming to your lectures of principle of individual responsibility.",
            "Because if you see any graph on the emission, the highest peak is the pic that is the sum of each individual's behavior.",
            "So today I came by bicycle and I'm happy I did it.",
            "I cannot wait that Baghdad will will be equipped with the biking roads that I don't know when it's going to be here.",
            "So let's work on this.",
            "And before we give responsibility to someone else.",
            "I mean there an Association of environmental economists and Carla Carroll is one of them that I mentioned to you before they are trying to do their best to contaminate the other colleagues.",
            "So there good example, let's let's use them, you know, and let's try to dismantle this idea that there's some bad categories per say.",
            "I think it doesn't really help.",
            "Thank you.",
            "And then very very short.",
            "Just really a comment on something that struck me as a manifestation of of how we ourselves catch ourselves inside the box.",
            "The growing bananas in Serbia.",
            "I don't think you should dismiss it out of the box right away, because if he primary Lovins can grow bananas at 3000 meters in Colorado with zero carbon inputs, I don't see why we cannot do that, considering that big transport them and create emissions.",
            "From Brazil or Ecuador so and so, growing bananas is feasible.",
            "Brenda.",
            "Yes, I agree with Georgia, it's this we should not.",
            "Jebel easy we should not demonise a certain category of people or disciplines and everything but there is a basic flaw.",
            "There is a basic fundamental flaw in the in certain disciplines which values underlying certain disciplines and that we can change.",
            "For example, when Logica said if you learn a discipline.",
            "Yeah, I mean you you become an economist.",
            "Profit for the sake of profit.",
            "There is a problem here.",
            "So it's not a discipline of people who are doing a learning.",
            "It's the it's flawed by the value, the underlying values of a discipline.",
            "And here I see really a problem and maybe there should be a rethinking of the the underlying values of economix of finance etc etc.",
            "And this is this is the flow and because of course profit is not bad in itself, but.",
            "Making profit as a goal in life for the food for the betterment of the World Food.",
            "I mean for this is a problem.",
            "I'm sorry but it has always been very shocking to me and I think here we have to to do something.",
            "For Babs, adding for information also, UNESCO is now preparing Universal Declaration on ethical principles related to climate change.",
            "So they are considering the feasibility and they are drafting a text and there will be next week regional governmental consultation on this here in Belgrade as well."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With this, I would suggest that we come to the next presentation from a banister valag from the University of Novi Sad.",
                    "label": 1
                },
                {
                    "sent": "OK, something like Mr Rogers said about this workshop and presentation.",
                    "label": 0
                },
                {
                    "sent": "So just just.",
                    "label": 0
                },
                {
                    "sent": "OK, today I.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I like to put more light on.",
                    "label": 0
                },
                {
                    "sent": "Social responsibility.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of scientists and teachers.",
                    "label": 0
                },
                {
                    "sent": "University teachers regarding this global campaign against climate change.",
                    "label": 1
                },
                {
                    "sent": "I mean, when we are speaking about climate change, this story is always related to people.",
                    "label": 0
                },
                {
                    "sent": "The way of living, migrations, mitigations, Wars, heritage art, I mean, climate change is for sure one of most important natural factors affecting way of living all.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Around the world.",
                    "label": 0
                },
                {
                    "sent": "And during the last decades of fantasy entry, I mean last at least 50 years of 20 century scientists invested enormous amount of energy and time in order to.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Find answers on some very crucial questions.",
                    "label": 0
                },
                {
                    "sent": "I mean, billions of something are invested in order to find out how climate will change and how it will affect our life.",
                    "label": 1
                },
                {
                    "sent": "Whether some places on Earth will became less suitable for living, how to apply different mitigation techniques, and what to do if the patient is very own way out.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mean, accumulated knowledge and proposed solutions an enormous if you put on Google, for example requests request with books with climate change in the title, we will find more than three or 2000 tips.",
                    "label": 1
                },
                {
                    "sent": "If you are looking for scientific projects about climate change, I think it's more than two millions project on Internet with this in the in the title.",
                    "label": 0
                },
                {
                    "sent": "But what we are where what we are facing it?",
                    "label": 0
                },
                {
                    "sent": "Is very weak link between science answer.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "SoC, I'm afraid that effectiveness with collective consciousness is very, very low level.",
                    "label": 0
                },
                {
                    "sent": "I'm afraid that effectiveness of collective consciousness that does not following rate of climate change, and that's our crucial problem in in.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This global campaign.",
                    "label": 0
                },
                {
                    "sent": "So I would like just to remind you that this supposed yesterday we have much more information about that that more than 90% of all natural disasters among gold.",
                    "label": 0
                },
                {
                    "sent": "Those re cyantific results all adaptation techniques or all projects.",
                    "label": 0
                },
                {
                    "sent": "We still have millions and millions people suffering from climate change last year just in in year 2009, more than 55 million of people.",
                    "label": 0
                },
                {
                    "sent": "How was affected by?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By extreme weather events and I mean billions of dollars are damaged.",
                    "label": 0
                },
                {
                    "sent": "That is one of main problems I think is to put into conscious to put in mind of people on all levels, all generations, that climate change is irreversible process.",
                    "label": 0
                },
                {
                    "sent": "That's very important task, no matter.",
                    "label": 0
                },
                {
                    "sent": "No matter that if we are talking to two very young people or very old people, you know one of my favorite politicians frequently said if you have a fish.",
                    "label": 0
                },
                {
                    "sent": "Can you make fish soup and if you eat this fish, I mean this hope you don't have a fish anymore.",
                    "label": 0
                },
                {
                    "sent": "You can't go back.",
                    "label": 0
                },
                {
                    "sent": "The similar situation is with climate change.",
                    "label": 1
                },
                {
                    "sent": "We can't go back.",
                    "label": 0
                },
                {
                    "sent": "We just have to hope that next step will be smaller, will be less steep, but we can't change what we already do.",
                    "label": 0
                },
                {
                    "sent": "So I think that first of all, personal responsibility is most important one.",
                    "label": 0
                },
                {
                    "sent": "You know when you go in the morning on your job and you go by car and if your car is very old one and if you emit a lot of gas is you have to be aware that you participate in global climate change for one 0.0001 degrees.",
                    "label": 0
                },
                {
                    "sent": "You increase this global temperature.",
                    "label": 0
                },
                {
                    "sent": "That's very important task when we can reduce this effect in people minds then we are.",
                    "label": 0
                },
                {
                    "sent": "Then we are successful in our teaching on higher education.",
                    "label": 0
                },
                {
                    "sent": "Of course, in this campaign media are very important because we are teaching.",
                    "label": 0
                },
                {
                    "sent": "Also people working in media.",
                    "label": 0
                },
                {
                    "sent": "But I'm afraid in our country I don't know what situation other countries.",
                    "label": 0
                },
                {
                    "sent": "But in our country there is two too much sensationalism in media and there is not enough everyday life based strategy.",
                    "label": 1
                },
                {
                    "sent": "I know last year Journal Premier Belgrade Journal.",
                    "label": 0
                },
                {
                    "sent": "Maker one how to say article in which I supposed to set that we will grow bananas in Serbia.",
                    "label": 0
                },
                {
                    "sent": "I will never said something like this but they wrote this on front page.",
                    "label": 1
                },
                {
                    "sent": "And that's it.",
                    "label": 1
                },
                {
                    "sent": "Yes, now we have anything from something like this educational system and the state responsibility.",
                    "label": 1
                },
                {
                    "sent": "Of course, varying is important, but we have national strategies.",
                    "label": 0
                },
                {
                    "sent": "We have.",
                    "label": 0
                },
                {
                    "sent": "Communications, documents, politicians, everything else.",
                    "label": 0
                },
                {
                    "sent": "But we still have this week links now between science society and policies.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or politicians, and besides all those accumulated knowledge in science, we still have greenhouse gas emission increase we have.",
                    "label": 0
                },
                {
                    "sent": "Still we still have situations that most developed countries didn't sign Kyoto.",
                    "label": 1
                },
                {
                    "sent": "We do not know what will be with Copenhagen and.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Everything else, so we have problems.",
                    "label": 0
                },
                {
                    "sent": "We have problem in communication through the decision makers, but I would like to make a little bit broader definition of decision makers.",
                    "label": 1
                },
                {
                    "sent": "Usually people thinking about politicians when they said decision makers.",
                    "label": 0
                },
                {
                    "sent": "I do not believe that politicians are real decision makers.",
                    "label": 0
                },
                {
                    "sent": "You know the politicians.",
                    "label": 0
                },
                {
                    "sent": "Thinking about politics and policies but.",
                    "label": 0
                },
                {
                    "sent": "Real decision makers are farmers.",
                    "label": 1
                },
                {
                    "sent": "Are school teachers.",
                    "label": 0
                },
                {
                    "sent": "Are GPS economist banking banking's?",
                    "label": 1
                },
                {
                    "sent": "I mean induce people working in industry because when, for example manager of Big Car Factory should put new filters or change technology of production then he have to decide what we will, what he will do when teacher in elementary school.",
                    "label": 0
                },
                {
                    "sent": "I have to teach kids about climate change.",
                    "label": 0
                },
                {
                    "sent": "He's real decision maker.",
                    "label": 0
                },
                {
                    "sent": "He makes decisions about how he will do this and on which way.",
                    "label": 0
                },
                {
                    "sent": "So I deeply believe that each day we are teaching and we are educating educating decision makers.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the question is how to improve this issue?",
                    "label": 0
                },
                {
                    "sent": "Education because we are aware that all those links are very, very weak.",
                    "label": 0
                },
                {
                    "sent": "We are not absolutely not satisfied with the results of.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our education well.",
                    "label": 0
                },
                {
                    "sent": "Answer On this is of course education on some new level and some new approach to education is always good answer.",
                    "label": 1
                },
                {
                    "sent": "University teachers have possibility and responsive.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Related to to provide properly educated decision makers, and I think that this United Nation concept of studies, because I I mean forward about some other projects related to University, United Nation, University studies.",
                    "label": 0
                },
                {
                    "sent": "This concept I think is ideal framework to harmonize our University curricula.",
                    "label": 1
                },
                {
                    "sent": "I start from from this multi level and interdisciplinary approach.",
                    "label": 1
                },
                {
                    "sent": "And I would like to present you one possible way how we can harmonize our University curricula and establish some kind of project related to this.",
                    "label": 0
                },
                {
                    "sent": "Of course, first we have to move from basically descriptive to more quantitative way of teaching about climate change and their impact.",
                    "label": 1
                },
                {
                    "sent": "I start from.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the concept a little bit modified, of course, but established in Australia.",
                    "label": 0
                },
                {
                    "sent": "Australia have very interesting concept of education.",
                    "label": 0
                },
                {
                    "sent": "Higher education in the climate change.",
                    "label": 1
                },
                {
                    "sent": "And the there is supposed main topics which have to include in this query Cola our science of climate change.",
                    "label": 1
                },
                {
                    "sent": "Of course in which we will teach students about Earth, climate system, greenhouse gas, greenhouse gases and things like this, but on different levels.",
                    "label": 0
                },
                {
                    "sent": "For example, always level is pure phenomenology.",
                    "label": 0
                },
                {
                    "sent": "Highest level is completely physically in chemistry and everything else based approach.",
                    "label": 1
                },
                {
                    "sent": "Then we have, for example, impacts of climate change.",
                    "label": 0
                },
                {
                    "sent": "It's important topic.",
                    "label": 1
                },
                {
                    "sent": "It's next topic for all faculties.",
                    "label": 0
                },
                {
                    "sent": "I mean when I say topic, I mean we should teach that at all faculties at University input studies how to assess climate change, impact tools for different kind of assessment.",
                    "label": 1
                },
                {
                    "sent": "Then legislation and international negotiations.",
                    "label": 0
                },
                {
                    "sent": "It's very important task even you are a physicist, you have to have some basic knowledge about Kyoto protocols, about IPCC, about different kinds of public problems related related to registration legislation.",
                    "label": 0
                },
                {
                    "sent": "Then next, very important topics which have to be covered is ethics of climate change is specially important for students or flow.",
                    "label": 0
                },
                {
                    "sent": "And Faculty of philosophy and different kinds of student cause.",
                    "label": 0
                },
                {
                    "sent": "Question is who's for example is possible to conserve the protect and maintain the environment for the future?",
                    "label": 1
                },
                {
                    "sent": "Who will be responsible for damage caused by climate change and how people can solve that kind of problems?",
                    "label": 0
                },
                {
                    "sent": "It's very important task of course, address to faculty of Law and economics and banking.",
                    "label": 0
                },
                {
                    "sent": "But on informative level important for.",
                    "label": 0
                },
                {
                    "sent": "For students of.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I could give Sciences then economics of climate change.",
                    "label": 1
                },
                {
                    "sent": "First of all, devoted to I said students of economics, banking, management and related to faculties, forms of energy generation.",
                    "label": 0
                },
                {
                    "sent": "Of course on highest level for Faculty of Engineering but important also for Faculty of Economics, Loane Science solutions for reduced.",
                    "label": 0
                },
                {
                    "sent": "Emission of course, and one topic which I add to this Australian concept is climate change and public health.",
                    "label": 1
                },
                {
                    "sent": "I think that it shouldn't be teached on this informative level, especially students of medicine really have to have much more deeper and scientifically based impact on possible effects, causes and adaptation measures.",
                    "label": 0
                },
                {
                    "sent": "But also people studying low and economics.",
                    "label": 0
                },
                {
                    "sent": "And science have to have that kind of information, because for example if they became if they go to work in governmental institutions or local local governments, they really need knowledge about that.",
                    "label": 0
                },
                {
                    "sent": "You know we have in Malta.",
                    "label": 0
                },
                {
                    "sent": "In my town.",
                    "label": 0
                },
                {
                    "sent": "I mean it's regular situation.",
                    "label": 1
                },
                {
                    "sent": "If federal, hydro, metrological institutes make announcement, excuse me.",
                    "label": 0
                },
                {
                    "sent": "Choose me.",
                    "label": 0
                },
                {
                    "sent": "National National Hydrometeorological Service make announcement of very high temperatures or heat waves, then they or two in advance.",
                    "label": 0
                },
                {
                    "sent": "They make some group of people and talking what to do with this?",
                    "label": 0
                },
                {
                    "sent": "Then nothing.",
                    "label": 0
                },
                {
                    "sent": "You can't do anything two days before heat wave you have to have strategy what to do in this situation and then take this strategy from the shelf and help people do this.",
                    "label": 0
                },
                {
                    "sent": "Do that.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's very important.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ask so one possible University curriculum which can we test, for example, in some summer school with students from different faculties, is to make for example, this line 8 or 9 topics to invite students, few of them from different faculties and teach them.",
                    "label": 0
                },
                {
                    "sent": "Teach them all those topics on different level and different grades just to test this possibility and to see how they will react, react and how they.",
                    "label": 0
                },
                {
                    "sent": "We will accept dent kind of teaching of climate change.",
                    "label": 0
                },
                {
                    "sent": "That's my suggestion for our further work as a possible solution.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Congratulations Branislava, this was really an excellent presentation.",
                    "label": 0
                },
                {
                    "sent": "Really structuring a lot of these potential.",
                    "label": 0
                },
                {
                    "sent": "Plans of action for the future, and I think we should work in this document also based on your suggestions.",
                    "label": 0
                },
                {
                    "sent": "Well, I guess it's a wonderful concept, although I think that actually economics of climate change.",
                    "label": 0
                },
                {
                    "sent": "It's you can understand that very differently because it's it's economy itself.",
                    "label": 0
                },
                {
                    "sent": "Produce climate change to be so.",
                    "label": 0
                },
                {
                    "sent": "But what you mean.",
                    "label": 0
                },
                {
                    "sent": "But economics of climate change is something different, but what is because you mentioned that students of physics, for instance, they know very little about it, but they they know very little about economy itself.",
                    "label": 0
                },
                {
                    "sent": "So I think this is one of the major major subjects here.",
                    "label": 0
                },
                {
                    "sent": "For all that because we live in a dream sometimes 'cause if we know how international trade works then you see you can't stop climate change because of interconnectivity of all these things.",
                    "label": 0
                },
                {
                    "sent": "So this should be a major subject to all technicians, not not just something that is my suggestion to put it in the Center for all those who have background in natural science, but in the second is about this.",
                    "label": 0
                },
                {
                    "sent": "The climate change in and health this is to do much focused because I will tell you about this 2003 heat wave.",
                    "label": 0
                },
                {
                    "sent": "It was attributed to the climate change heat itself.",
                    "label": 0
                },
                {
                    "sent": "OK, no problem with that.",
                    "label": 0
                },
                {
                    "sent": "But what about people who died?",
                    "label": 0
                },
                {
                    "sent": "Did they die because of the heat wave or not?",
                    "label": 0
                },
                {
                    "sent": "This question is still open and majority later after 2003 majority of serious study showed that in many cities they died because of the ozone concentration.",
                    "label": 0
                },
                {
                    "sent": "Because of the traffic because but combined with a heat wave, what is my point?",
                    "label": 0
                },
                {
                    "sent": "I think that we desperately need in the health system people who are dealing with environmental and health, air pollution, climate change and health, not just climate change, because this is a very narrow and we have the problem of air pollution and health all the time in the winter in so I would suggest to go for this subject more broadly, not just climate change but all related problems.",
                    "label": 0
                },
                {
                    "sent": "Bad water.",
                    "label": 0
                },
                {
                    "sent": "Air pollution because climate change tends to take them to to be to interconnect with these problems and make it really little.",
                    "label": 0
                },
                {
                    "sent": "So this is my second suggestion to broaden this, not just climate change.",
                    "label": 0
                },
                {
                    "sent": "It helps, but the big product.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "I would just like to add that we are planning to have our next kolac regional colloquium on capacity building on global governance in the UN system on markets.",
                    "label": 0
                },
                {
                    "sent": "Market failures and the role of global governance.",
                    "label": 0
                },
                {
                    "sent": "Because externalities and not considering the climate cost environmental costs in the price signals of product and services is one of the main sources of climate change and other related problems.",
                    "label": 0
                },
                {
                    "sent": "Also, Justin's additional information Georgia has been thank you very much for this most interesting presentation.",
                    "label": 0
                },
                {
                    "sent": "I like the concept very much and it made me remembering of the curriculum of the Central European University.",
                    "label": 0
                },
                {
                    "sent": "Which is operated in Hungary in Budapest, and they have climate change for for the students, and the structure is similar of course not as detailed as you presented, and I'm wondering whether you have some Contacts with them and you get you can ask them about their experience is what is the feedback from the students that because it has been going on for several years, so maybe it's good to contact them and exchange of views about that will be great.",
                    "label": 0
                },
                {
                    "sent": "Dear thank you.",
                    "label": 0
                },
                {
                    "sent": "I don't know exactly who was first, OK. Just to reply I have I had to post Doc on climate change is using an Open University in Budapest.",
                    "label": 0
                },
                {
                    "sent": "They're more low oriented than science oriented, but what what I just would like to add few pieces.",
                    "label": 0
                },
                {
                    "sent": "I think they are missed from this matrix.",
                    "label": 0
                },
                {
                    "sent": "For me, the missing piece is not just greenhouse gases data, because if you come to data in Serbia, if you it is probably the same in the other countries.",
                    "label": 0
                },
                {
                    "sent": "You're coming that different sources of data.",
                    "label": 0
                },
                {
                    "sent": "All official are giving few times different date a few times.",
                    "label": 0
                },
                {
                    "sent": "Multiple 34 I mean that means that we are we have two coming those somehow to do sources of data somehow somehow to to the.",
                    "label": 0
                },
                {
                    "sent": "Generators of greenhouse gases, not just the data.",
                    "label": 0
                },
                {
                    "sent": "This is 1 block that should be just not data is such are not enough in the region.",
                    "label": 0
                },
                {
                    "sent": "Another thing I find a little bit missing, they are still.",
                    "label": 0
                },
                {
                    "sent": "Although mitigation, the effects of mitigation measures are limited.",
                    "label": 0
                },
                {
                    "sent": "It is useful to teach mitigation measures because it's linked to the pollution control.",
                    "label": 0
                },
                {
                    "sent": "It's linked to IP.",
                    "label": 0
                },
                {
                    "sent": "We see integral pollution and prevention control.",
                    "label": 0
                },
                {
                    "sent": "It's linked to all issues coming to slow down grace greenhouse gases, including, for example, transport.",
                    "label": 0
                },
                {
                    "sent": "This is in region, not touch at all.",
                    "label": 0
                },
                {
                    "sent": "This is Miss Piece and one another words Professor Mariana, which mentioned this is some kind of to link the Swiss sustainable consumption and production.",
                    "label": 0
                },
                {
                    "sent": "This consumption issues and.",
                    "label": 0
                },
                {
                    "sent": "That means this is good metrics, but we should be some pieces to add and to look carefully what is missing and just to have one comment I'm for about now five years the Member of Advice, Environmental Social Advisory Committee of the Directory of EBRD in European Bank of Reconstruction and Development.",
                    "label": 0
                },
                {
                    "sent": "These are.",
                    "label": 0
                },
                {
                    "sent": "Pure economists.",
                    "label": 0
                },
                {
                    "sent": "And when I came five years back there, they simple didn't understand what we are there about 10 of us or less than 10.",
                    "label": 0
                },
                {
                    "sent": "We are meeting twice here to advise the director of Bank is putting the questions of questionable environmentally questionable projects.",
                    "label": 0
                },
                {
                    "sent": "To see how we look at this.",
                    "label": 0
                },
                {
                    "sent": "First year I really they they really couldn't understand what me or some other people are talking about.",
                    "label": 0
                },
                {
                    "sent": "That means that about four years now we are starting to understand each other.",
                    "label": 0
                },
                {
                    "sent": "We are now coming there with the they are they put in procurement, environmental friendly supply chain or something like this?",
                    "label": 0
                },
                {
                    "sent": "Yeah, starting to understand each other but missed that that kind of.",
                    "label": 0
                },
                {
                    "sent": "Vocabulary between different different background economists to understand what we are, they just couldn't understand the values.",
                    "label": 0
                },
                {
                    "sent": "What we are talking about, they're just.",
                    "label": 0
                },
                {
                    "sent": "Of the other of.",
                    "label": 0
                },
                {
                    "sent": "The part of the scale, and this is very different in this is the issue, but you mentioned we have to find the language as some kind of natural science or or other scientists find the language that economists understand.",
                    "label": 0
                },
                {
                    "sent": "Maybe they would like but they don't.",
                    "label": 0
                },
                {
                    "sent": "And this is something that is really very important issue, but it is still not sold on.",
                    "label": 0
                },
                {
                    "sent": "The global scale tool and it is 1 good.",
                    "label": 0
                },
                {
                    "sent": "So it is.",
                    "label": 0
                },
                {
                    "sent": "Now conference planning on.",
                    "label": 0
                },
                {
                    "sent": "Climate change governance, Yale University.",
                    "label": 0
                },
                {
                    "sent": "Before the UN meeting on Millennium Development Goals in York in September and they are now in the process, it is so so interesting to see what they're looking for, and this is a lot of answers will be.",
                    "label": 0
                },
                {
                    "sent": "Then now they put governance in the center of the the story and after that they will develop science for the governance.",
                    "label": 0
                },
                {
                    "sent": "This is what?",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Just I would like to say a couple of words branislava I congratulate for your approach.",
                    "label": 0
                },
                {
                    "sent": "I very appreciated I'm economist.",
                    "label": 0
                },
                {
                    "sent": "And honestly, today's first day that I met one climate change economics.",
                    "label": 0
                },
                {
                    "sent": "Then I'm very happy because of that.",
                    "label": 0
                },
                {
                    "sent": "Professor Bogote said economics cause climate change.",
                    "label": 0
                },
                {
                    "sent": "I completely agree with you and I would like to say.",
                    "label": 0
                },
                {
                    "sent": "Economics could be seen not just as a part of the problem.",
                    "label": 0
                },
                {
                    "sent": "I would like to say I would like to see economics also as a part of the solution.",
                    "label": 0
                },
                {
                    "sent": "And we need actually, because we're teaching, we're talking about teaching climate change.",
                    "label": 0
                },
                {
                    "sent": "I would like to say we need to change our mental schemes and this matrix is, for me is excellent tool.",
                    "label": 0
                },
                {
                    "sent": "I would like to pay more attention of economics of climate change because we need to teach people in social Sciences about more about economics.",
                    "label": 0
                },
                {
                    "sent": "How the economics caused the plan changes and how economics could help to solve the problems because we are now talking about climate change and some guys are making the money on climate exchanges and later on I will be talking a little bit about that.",
                    "label": 0
                },
                {
                    "sent": "Also I would like to say also some some some some different that.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Sometimes when we are I've been working for 17 years for state School of Economics here at Bellevue University in last five years I'm teaching couple of courses at Belgrade Banking Academy and I have two my young colleagues who recently graduated for both schools, schools, economics and BBA, and I'm not sure did any teacher on those cool even mentioned.",
                    "label": 0
                },
                {
                    "sent": "Climate change.",
                    "label": 0
                },
                {
                    "sent": "Alexander Dushko no.",
                    "label": 0
                },
                {
                    "sent": "Can you imagine?",
                    "label": 0
                },
                {
                    "sent": "Death on our University in social Sciences, in the field of economics, professors don't mention climate change.",
                    "label": 0
                },
                {
                    "sent": "This is the terrible situation an we need sometimes.",
                    "label": 0
                },
                {
                    "sent": "The first step how to find solution is to recognize the problem.",
                    "label": 0
                },
                {
                    "sent": "Maybe later on I will.",
                    "label": 0
                },
                {
                    "sent": "I will continue some of my ideas and I will explain in much more details.",
                    "label": 0
                },
                {
                    "sent": "I will tell you, now you provoke me and I will tell you my my personal experience at the Faculty of Economics in Juliana.",
                    "label": 0
                },
                {
                    "sent": "They realized that climate change is an issue.",
                    "label": 0
                },
                {
                    "sent": "They they probably want to make some extra money on climate change, not to mitigate it, but anyway, and we give appropriate professore brush nickel.",
                    "label": 0
                },
                {
                    "sent": "He's a very bright guy.",
                    "label": 0
                },
                {
                    "sent": "He gets also some courses in this area, but then he said he invited me and he said, come and have some little.",
                    "label": 0
                },
                {
                    "sent": "Part of my course, but for post graduates need not for them bachelors I say OK but I told him why don't you do it?",
                    "label": 0
                },
                {
                    "sent": "He said I will lose my face.",
                    "label": 0
                },
                {
                    "sent": "Make it not invite me to speak because I know better climate change because I'm outside.",
                    "label": 0
                },
                {
                    "sent": "They're not sort of, you know my point and it was very interesting and I hate this course.",
                    "label": 0
                },
                {
                    "sent": "It was a mixed group.",
                    "label": 0
                },
                {
                    "sent": "People from Russia and Slovenia and Macedonia.",
                    "label": 0
                },
                {
                    "sent": "And actually they've heard for the first time about externalities about all sorts of of these carbon imbedded in trade and and actually it was a very nice group.",
                    "label": 0
                },
                {
                    "sent": "They they really listened.",
                    "label": 0
                },
                {
                    "sent": "We we had a lot of discussion.",
                    "label": 0
                },
                {
                    "sent": "But after the end of this course, they say OK, it's wonderful that we've heard this, but you know, when it was Russian study student who said it.",
                    "label": 0
                },
                {
                    "sent": "But actually what you told us is directly opposite.",
                    "label": 0
                },
                {
                    "sent": "What were we taught for four years?",
                    "label": 0
                },
                {
                    "sent": "Profit, profit, maximizing profit.",
                    "label": 0
                },
                {
                    "sent": "But all the solution in climate change lies in the opposite direction.",
                    "label": 0
                },
                {
                    "sent": "So then I understood Professor Brush Nickel, who said you should teach there because I will lose my face.",
                    "label": 0
                },
                {
                    "sent": "So this is huge problem.",
                    "label": 0
                },
                {
                    "sent": "And and if you eat it, we have to do something like that, because economists probably don't want to lose their faces.",
                    "label": 0
                },
                {
                    "sent": "OK, just one sentence.",
                    "label": 0
                },
                {
                    "sent": "Sometimes we need to think out of the box and solution could be in one concept called knowledge management and life long learning.",
                    "label": 0
                },
                {
                    "sent": "Good good.",
                    "label": 0
                },
                {
                    "sent": "Agree something concerning something concerning.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry yes.",
                    "label": 0
                },
                {
                    "sent": "Brownies lovers presentation there is much more.",
                    "label": 0
                },
                {
                    "sent": "To the impact of climate change on fabrikal, then heat waves and whatever risk management with floods and all of that.",
                    "label": 0
                },
                {
                    "sent": "There is a whole big area of human behavior.",
                    "label": 0
                },
                {
                    "sent": "Which is causing climate change much more, which is concerned with nutrition and nutrition habits.",
                    "label": 0
                },
                {
                    "sent": "And there is an that's a field that hasn't been covered by climate change.",
                    "label": 0
                },
                {
                    "sent": "Health impact studies.",
                    "label": 0
                },
                {
                    "sent": "It is a very important area, exactly.",
                    "label": 0
                },
                {
                    "sent": "It's a very important area of health promotion.",
                    "label": 0
                },
                {
                    "sent": "It is climate change diet.",
                    "label": 0
                },
                {
                    "sent": "You could find it on it.",
                    "label": 0
                },
                {
                    "sent": "Yes, I know, but I know I was.",
                    "label": 0
                },
                {
                    "sent": "I was just mentioning that in study that you it says including.",
                    "label": 0
                },
                {
                    "sent": "Oh, I know all kinds of things, but the most common for all the people which is nutrition which is connected with consumption an all the all the habits is not included in climate change, climate change, health impact.",
                    "label": 0
                },
                {
                    "sent": "Which is, I think a very big mistake.",
                    "label": 0
                },
                {
                    "sent": "I have a point that is also based on my personal experience.",
                    "label": 0
                },
                {
                    "sent": "As a geographer, I insist to have always multidisciplinary team.",
                    "label": 0
                },
                {
                    "sent": "Which never ended up to be transdisciplinary for a simple reason that everyone says I have the last word solution and the other one is always the guilty.",
                    "label": 0
                },
                {
                    "sent": "I think we don't go very far with this approach.",
                    "label": 0
                },
                {
                    "sent": "So before we move a step ahead together is as a learning community.",
                    "label": 0
                },
                {
                    "sent": "Each of us may step once back and see that there might be another way out of the box.",
                    "label": 0
                },
                {
                    "sent": "I don't think he's honest to give the wall responsibility to some.",
                    "label": 0
                },
                {
                    "sent": "Well identified categories, it's easy to say this bloody economists.",
                    "label": 0
                },
                {
                    "sent": "They're part of the problem and they are not yet part of this solution.",
                    "label": 0
                },
                {
                    "sent": "Politicians, Mamma Mia, they don't get anything.",
                    "label": 0
                },
                {
                    "sent": "I got to know good politicians.",
                    "label": 0
                },
                {
                    "sent": "Luckily and bad politician I got in a good NGO and bad in jail etc etc etc.",
                    "label": 0
                },
                {
                    "sent": "So I think it's good physicists and bad physicist.",
                    "label": 0
                },
                {
                    "sent": "Why not good Umm Bellevue and so now I'm talking to you as professor or a locators whatever you like to see yourself.",
                    "label": 0
                },
                {
                    "sent": "And you have a great social responsibility means to to instill into into this beautiful minds that are coming to your lectures of principle of individual responsibility.",
                    "label": 0
                },
                {
                    "sent": "Because if you see any graph on the emission, the highest peak is the pic that is the sum of each individual's behavior.",
                    "label": 0
                },
                {
                    "sent": "So today I came by bicycle and I'm happy I did it.",
                    "label": 0
                },
                {
                    "sent": "I cannot wait that Baghdad will will be equipped with the biking roads that I don't know when it's going to be here.",
                    "label": 0
                },
                {
                    "sent": "So let's work on this.",
                    "label": 0
                },
                {
                    "sent": "And before we give responsibility to someone else.",
                    "label": 0
                },
                {
                    "sent": "I mean there an Association of environmental economists and Carla Carroll is one of them that I mentioned to you before they are trying to do their best to contaminate the other colleagues.",
                    "label": 0
                },
                {
                    "sent": "So there good example, let's let's use them, you know, and let's try to dismantle this idea that there's some bad categories per say.",
                    "label": 0
                },
                {
                    "sent": "I think it doesn't really help.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "And then very very short.",
                    "label": 0
                },
                {
                    "sent": "Just really a comment on something that struck me as a manifestation of of how we ourselves catch ourselves inside the box.",
                    "label": 0
                },
                {
                    "sent": "The growing bananas in Serbia.",
                    "label": 0
                },
                {
                    "sent": "I don't think you should dismiss it out of the box right away, because if he primary Lovins can grow bananas at 3000 meters in Colorado with zero carbon inputs, I don't see why we cannot do that, considering that big transport them and create emissions.",
                    "label": 0
                },
                {
                    "sent": "From Brazil or Ecuador so and so, growing bananas is feasible.",
                    "label": 0
                },
                {
                    "sent": "Brenda.",
                    "label": 0
                },
                {
                    "sent": "Yes, I agree with Georgia, it's this we should not.",
                    "label": 0
                },
                {
                    "sent": "Jebel easy we should not demonise a certain category of people or disciplines and everything but there is a basic flaw.",
                    "label": 0
                },
                {
                    "sent": "There is a basic fundamental flaw in the in certain disciplines which values underlying certain disciplines and that we can change.",
                    "label": 0
                },
                {
                    "sent": "For example, when Logica said if you learn a discipline.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean you you become an economist.",
                    "label": 0
                },
                {
                    "sent": "Profit for the sake of profit.",
                    "label": 0
                },
                {
                    "sent": "There is a problem here.",
                    "label": 0
                },
                {
                    "sent": "So it's not a discipline of people who are doing a learning.",
                    "label": 0
                },
                {
                    "sent": "It's the it's flawed by the value, the underlying values of a discipline.",
                    "label": 0
                },
                {
                    "sent": "And here I see really a problem and maybe there should be a rethinking of the the underlying values of economix of finance etc etc.",
                    "label": 0
                },
                {
                    "sent": "And this is this is the flow and because of course profit is not bad in itself, but.",
                    "label": 0
                },
                {
                    "sent": "Making profit as a goal in life for the food for the betterment of the World Food.",
                    "label": 0
                },
                {
                    "sent": "I mean for this is a problem.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry but it has always been very shocking to me and I think here we have to to do something.",
                    "label": 0
                },
                {
                    "sent": "For Babs, adding for information also, UNESCO is now preparing Universal Declaration on ethical principles related to climate change.",
                    "label": 1
                },
                {
                    "sent": "So they are considering the feasibility and they are drafting a text and there will be next week regional governmental consultation on this here in Belgrade as well.",
                    "label": 0
                }
            ]
        }
    }
}