{
    "id": "mbltwufkppwqxezaq2f7zxgmowt6dzsq",
    "title": "The launch of CEMROL: the charms and challenges of developing an academic crowdsourcing platform",
    "info": {
        "author": [
            "Karen Hollewand, Utrecht University"
        ],
        "published": "April 8, 2019",
        "recorded": "March 2019",
        "category": [
            "Top->Humanities->Languages",
            "Top->Computer Science->Crowdsourcing"
        ]
    },
    "url": "http://videolectures.net/3rdAnnualActionMeeting2019_hollewand_launch_cemrol/",
    "segmentation": [
        [
            "Thank you for the invitation.",
            "I'm very happy to be here.",
            "It's very new world to me and I'm learning a lot.",
            "So thank you for that.",
            "Thank you for letting me be here.",
            "So I'm here today to discuss several, which is a crowdsourcing platform created for historical research project and it is I will try and tell you as much as I can about the platform, but just a bit of a warning.",
            "It's very different than what has been discussed earlier today.",
            "We are focusing very much on documents, not so much on language itself.",
            "But we're talking about data.",
            "We're talking bout crowd getting a crowd involved.",
            "So I will tell you what we do, and I hope I can interest some of you, say some useful things for you.",
            "So I will be."
        ],
        [
            "We introduced a skill net project.",
            "The research projects Den says something about our sources and data and conclude by talking about Central and its development in comparison to.",
            "I think all the projects that have gone before.",
            "We are very, very small, but we don't mind.",
            "We're still proud of what we what we were doing at Central."
        ],
        [
            "So first of all, I'm a postdoc.",
            "I'm historian.",
            "I'm opposed to get skill Knutson Skillnet stands for sharing knowledge and learn tan literary networks.",
            "The project started in 2018, so very recently at the University of Utrecht, but it is funded by the European Research Council and our project studies what we call the Republic of Letters, the scientific community that existed in Europe between roughly 1500 and 1800s.",
            "The early modern.",
            "Our team, consisting of PHD's an postdocs, studies, for example, the social networks of scholars in the early modern days, the ways in which scholars related to the ideal of sharing knowledge and methods they use to communicate this ideal to future generations.",
            "We all study very different different aspects, but our data and our approach is similar.",
            "We combine methods of digital humanities as well as traditional methods so close and distant reading, and we focus mainly on.",
            "Early modern correspondence.",
            "The people who constituted the Republic of Letters communicated via letters.",
            "This was their email, their social media, their main means of communication.",
            "So in letters they introduced themselves.",
            "They discussed the news.",
            "They discuss new publications, recent ideas, but also they shared sources.",
            "So this ends books to each other manuscripts, but also sometimes specimen they found, etc.",
            "And this via close study and digital analysis of these letters that we attempt to better understand this scholarly community."
        ],
        [
            "So to give you a code is 5 research projects in in.",
            "In our larger project at Skillnet and this is some of what we are working on."
        ],
        [
            "So to give you an idea of our data."
        ],
        [
            "Yes, so these are the letters of 1 scholar, at least.",
            "A sample of them hardly unbathed Lanza Dutch color, and the data we have, the letters we have.",
            "Really the difference.",
            "What we have now would have been preserved, so some of the letters are still in manuscripts in archives and libraries all over Europe.",
            "Some of the letters have been published in the early modern period.",
            "You can see one at the top.",
            "There an example.",
            "Some letters were published in the last 50 years and others have already been digitized and been published online.",
            "So for instance, on the website.",
            "Early modern letters online, which offers a lot of data on on letters.",
            "So what is the data we want to have from these letters?"
        ],
        [
            "I will give you an example.",
            "This is a letter from Babylon to Isaac Fortius in January 1684.",
            "Um and the first kind of type of date."
        ],
        [
            "So we are looking for.",
            "Is that what we call the metadata of a letter and there is a basic information so."
        ],
        [
            "It means we want to know who sent the letter, who received the letter."
        ],
        [
            "I want to know the date or the dates of the letter when it was sent and sometimes it says also when it was received we."
        ],
        [
            "To know the places where was it sent from?",
            "Where was it sent to?"
        ],
        [
            "And also we're interested in the language of the letter.",
            "What was it composed in?"
        ],
        [
            "And we always look forward in keep it as well.",
            "The first line of the letter so we can compare if we have one letter sent on the same date.",
            "If it is actually copies of the same letter, so that's the first type of data we are looking for in our research project, the 2nd."
        ],
        [
            "Time is it.",
            "You can imagine the contents of the letter or the full text letter and this."
        ],
        [
            "Really, the whole the text as a whole, we want to know what subjects people are discussing, which people are mentioned.",
            "What quotations are in there, what, which works are cited etc etc.",
            "You can imagine the content of letter can be about almost everything.",
            "So, um.",
            "We need this data of course in digitized form.",
            "We need to let us as we call it marked by which marked by the metadata and we need them also transcribed.",
            "We need to full content in digital digital form and many letters have already been digitized, but there's still much work to be done and This is why we need the crowd, so to speak."
        ],
        [
            "So.",
            "This is the origin of our simril."
        ],
        [
            "Project which stands for collecting the epistolary metadata of the Republic of Letters, and just started the development of the platform, started when the project started, so this was early.",
            "In 2018, we started the first plans our developers started working on the 1st prototype and finished by late summer last year, and we launched Central as we launched several 14 December 2018.",
            "So it's exactly 3 months ago today, so we're still very new and I want to stress this very much a work in progress.",
            "We're still not very happy with older features, but in general it's working and we have a very small but active group of contributors.",
            "Um, I could discuss many different aspects of some rule, but I will focus most of all now on the different choices we've made in its development.",
            "'cause I think that might be most beneficial for all of you.",
            "So."
        ],
        [
            "Um?",
            "A guiding force behind all of our choices was on the one hand, the academic point of view.",
            "So what do we as researchers need and what is most useful for us, and what can actually be outsourced to the crowd?",
            "And on the other hand, there was the public perspective, the view of the crowd.",
            "So what can they do?",
            "What do they want to do, and how can we make certain tasks interesting and simple?",
            "A first choice we made was to focus on the meta data of letters.",
            "Since most of the members of our team focused on the basic information of letters.",
            "So Sender, recipient date and places this would assist most of our research projects and also it would be relatively easy.",
            "The crowd would not need much training to look at a letter and see, hey, this is the sender.",
            "This is the recipient is the date of the letter and it was made even simpler by our choice to focus on modern additions of letters.",
            "So not on handwritten letters, not on manuscripts that might be hard to read.",
            "Put on a letter said I've already been published in TypeScript.",
            "2nd we made."
        ],
        [
            "Important choices in the development of the platform.",
            "We, for example, decided to create our own and not Jordan established crowdsourcing platform.",
            "Like for instance failure Hamden, Phalombe and is a Dutch platform which brings together many different projects that need the public and that focus on national heritage.",
            "For example, there's a program that asks to help and gather information from notary acts.",
            "This is similar information that we need collected from our letter, so names, dates and places.",
            "So joining Failure Home that would have made our project available to a large crowd that was already engaged with with crowdsourcing.",
            "Yet in the end we decided against it mainly because the site is all in Dutch and our project as well as our data is very international and multilingual and we really wanted to work with an international crowd and engaged international crowd.",
            "And then also we wanted to have a bit more control over the platform and not leave that all up to fail Honda.",
            "2nd we made sorry following from this decision.",
            "We had to make up our minds about the developers that would create our platform.",
            "We had several options in an inside and outside academia, but in the end we ended up hiring what is called the digital Humanities lab.",
            "This is part of the University of Utrecht.",
            "There are many reasons for this, but mainly it was already part of the humanities Department that we work in as well and the developers they already had experience with working with cultural history projects with historical documents and with dealing with academics like ourselves.",
            "So that was the best fit for us in the end.",
            "And then in conversation with the digital Humanities lab, even though we didn't join fail under the established platform, we still had to decide if we could create our own framework while creating something from the ground up.",
            "It turns way too expensive and way to complicate it.",
            "So we adopted a framework, so to speak, and we chose Scribe, which is an open source framework for community transcript projects and we decided on this one because it offered all the functions we need it.",
            "So by late summer last year, several was developed, yet many choices were to follow that I will not get into, but I think it's important to mention that we were still large.",
            "Lot of work to do because the editing process took much longer than we all expected fine tuning the interface was very time consuming, yet very important.",
            "So I'm for instance talking about the design of the tutorials.",
            "So where do you put a tutorial?",
            "When does it pop up?",
            "What do you explain?",
            "What do you not explain an how do you explain it in the best and most effective way without?",
            "Making it an hour long tutorial and of course we also friends to design the buttons.",
            "Something very simple that you click on their shape, their size, their color, how many you put on the page, what is a logical place etc.",
            "Very complex world to US academics, but now don't worry, I've described it for way too long, probably.",
            "So let's get into some role.",
            "And of course this is the most.",
            "Daunting thing of the presentation to see if it works now.",
            "So I just type it in.",
            "When?",
            "This can someone help me with the?",
            "I'm sorry this is not my own.",
            "I press the link but it's just opening it up.",
            "It's not going there.",
            "Yes I do, but I can't.",
            "Oh here we go.",
            "There we go.",
            "Here it is.",
            "Perfect.",
            "This is the Internet Internet connection that is very slow.",
            "Is that OK?",
            "Scores would be great if I can actually show it to you.",
            "I know.",
            "We discovered.",
            "Let me just try to oh here we go home alright, so this is a bit zoomed in.",
            "But I'll try anyway to.",
            "We should have.",
            "Yeah, here we go.",
            "So on our home page I'm just inviting all of you to look at this on your computers later.",
            "'cause this is not really working on this computer unfortunately.",
            "Not sure why.",
            "Just going to try and load.",
            "This part and we'll see how far we come.",
            "So while this is loading, so basically what we do and it's a bit hard to describe without here we go so.",
            "We won't have many images, but for those who have a laptop, look at it at your laptop or else I will just try to explain as best I can.",
            "Let me try to get this page up.",
            "That might be best.",
            "So we have two tasks in several.",
            "Basically we show people additions of letters, so these are all in type script that asks for either to mark or two transcribe when you Mark.",
            "That means you kind of draw boxes around the data we want, so we want to know the sender, the recipient, the date.",
            "Yes, and if you recognize that was on a certain page, you draw a box around them and that's the only task you have have to do, and then you go to the next page.",
            "So for every page we ask you.",
            "To show us if there's data on there that we need.",
            "So that's the first task.",
            "OK, the Internet's really not.",
            "Working with us at all.",
            "Oh here we go.",
            "Can I somehow get out of the presentation mode?",
            "Because this is.",
            "Can't do anything at this point.",
            "Alright, so that's the first task.",
            "The mark and then OK. Now it's just.",
            "Who's who's computer?",
            "Is this 'cause I can't?",
            "Just close it.",
            "Yeah, OK. Alright.",
            "I'm sorry I was counting on this too.",
            "To work.",
            "Yeah.",
            "MacBook Air, right?",
            "Yeah, it's not reacting.",
            "This is what it is doing.",
            "Can I get some ones?",
            "Home.",
            "So it is the presentation mode.",
            "Yeah, OK well.",
            "OK, so basically I can't show you now.",
            "There's a little clip later that shows you a little bit, but that's very unfortunate.",
            "I can't really show you what's going on.",
            "It works well, doesn't matter.",
            "So after the boxes are drawn you type in what is in those boxes.",
            "And this way we transcribe the letters letters as well.",
            "I will try to see if I can fix this by getting my own computer and hook it up, but for now."
        ],
        [
            "I just want to show you little clip and say something about our audience.",
            "So for some role we didn't have a specific audience in mind's really.",
            "The whole public was our audience.",
            "We wanted everyone to feel invited to contribute all ages or interests because people who speak different languages.",
            "To promote some rule, we organized the launch.",
            "We were a lot on social media, but we also targeted specific interest groups of big interest Group for us turned out to be the alumni of the University wanted to be involved with something, a scholarly, academic and Aruna Hunua different languages, but there were also, for instance, historical societies that we talked to, and those were those were interested people as well, but also teachers, teachers in history who want their students to get an idea of primary sources.",
            "But you cannot really get their students to go to the archive and via our system they can get a sense of primary documents just from from home from their computers.",
            "So let's hope the next part."
        ],
        [
            "Works.",
            "So this is a little clip.",
            "That we designed, it was designed by humanity departments to kind of promote our our platform and to really introduce it to everyone who is interested.",
            "That's why I will show you in full if it works."
        ],
        [
            "You all go to the website and look at the clip.",
            "It's very beautiful, but I would just run you through the website not away here.",
            "So this is our websites and roll your own new so we press get started and here we see the two different tasks.",
            "So this is the first task which is to mark.",
            "So this is the bit you identify the basic information for us and this is easy as just drawing boxes around the information and then it saves it for us.",
            "Second task is to transcribe.",
            "So the boxes that have been drawn by you or someone else.",
            "You don't type in that information, and that gets, so it's quite simple straightforward, so I will show you how it works in the program.",
            "So first we select our language.",
            "There's many different around, so it's set to English today.",
            "Then there's another choice that you can make, and this was actually suggested by our volunteers that they wanted to kind of decide who they were working on.",
            "So which early modern scholar.",
            "So we see some familiar faces for some.",
            "Hopefully John Locke is there.",
            "Alexander Pope today will have a brief look at.",
            "Robert Boyle his letters.",
            "So this is the interface.",
            "As you can see, the tutorial always pops up because it's our was our experience that people otherwise just start and then haven't looked at the tutorial at all and then forget that there might be a tutorial.",
            "But of course we have all done this before, so we're going to click away tutorial.",
            "So just the interface on the left.",
            "We have a navigation so you can zoom in and out.",
            "You can see the different pages there and you can also hide or show the markings of other people.",
            "So our system works that.",
            "Three people have a mark.",
            "Have to mark a page before it's saved and taken out of the interface.",
            "This is of course because someone might miss something someone might have identified the wrong thing and then someone else can can correct that.",
            "So now we have to go to actually a page where there is some data on it.",
            "Early 1 letters can be hundreds of pages long and of course we only want the metadata so that is correct.",
            "That is at the beginning of the start of a left at the end of the start of a letter.",
            "So I'm just going to quickly run through to see.",
            "Where this where the next letter starts?",
            "Here we go.",
            "So here we have so someone else is marking, so I'm just going to hide them for.",
            "Our sake, so here we have to start of a letter and now we go to the rights to the interface on the right an we let our users go through a number of questions and the first question is always is there anything left to mark on this page?",
            "'cause there's a lot of pages.",
            "I just said that they have no date on it.",
            "So here we have anything.",
            "Yes we have something to mark those data on there that we want.",
            "So there's a beginning of a letter.",
            "Yes, the 3rd letter starts here.",
            "So then we literally just draw a line here at the beginning of letter.",
            "So this tells us the beginning of letter.",
            "Why do we want to know?",
            "Of course it doesn't.",
            "It usually works that it stays there.",
            "What do you want to give letter?",
            "We sometimes don't know how many letters are in volume, so we want to begin in the end to see how long is a letter, how many pages, etc.",
            "It takes you through different questions.",
            "I will just leave, well not presents.",
            "For instance the in keep it as I just told you we want to know the first line, so here we draw around the first line and then we press next.",
            "So here we go through the whole there's.",
            "I'm just going to say no.",
            "I'm just going to do very bad job on this letter to get to the end.",
            "Other things that so then we go when we have finished all the questions to the next page all I think we see on the right is the bad page.",
            "Maybe there's a glitch.",
            "Maybe there's a black page.",
            "We also put our email address there in case or any questions people can go back to the tutorial.",
            "And they can also share a page on Facebook on Twitter if they want to.",
            "So next task very quickly is the transcribe option.",
            "So again, we go to Robert Boyle.",
            "And here we see, for instance, that someone has draw drawn a box around the date.",
            "So now we simply as it asks enter.",
            "The date is given the 1st of October.",
            "1685 so as we enter the language, there's a lot of questions about the date.",
            "I won't go into that now.",
            "'cause in the early one period you can record a date in many different ways.",
            "And of course here we have don't have it set.",
            "Quick set of questions, but there's different things that happen here and then we go to the next entry or doesn't want to give itself the place, for instance.",
            "So this is how it how it works.",
            "Are several.",
            "We do have some records here on how many people have been there.",
            "How many pages have been marked, etc.",
            "So I think the PowerPoint.",
            "Yeah, I don't have that here, but on the PowerPoint I had some results so we've only been here.",
            "Been going for three months, but we think we've been very successful.",
            "But I've heard about millions of people today, so maybe we have not been that successful.",
            "But we've had 76 unique users in the last month.",
            "They have undertaken 226.",
            "Sessions, some sessions were five seconds long.",
            "Some sessions were six hours long, so that's one session of them would be pretty good and then 37,000 classifications were made in a classification is when they draw one box or transcribe one word.",
            "So we were actually very happy with that, specially 'cause you know we're still developing.",
            "We're still seeing if the interface works or if the program works at all.",
            "So it's small, but also we're not looking for millions of people were looking for a small and active crowd contributing to our research.",
            "So we're working at the moment at improving our platform.",
            "We for instance want to add more context on the people that are in the platform, so the people, the scholars and a different addition.",
            "So who you know whose letters are you working on?",
            "And we're also working on an optional personal log in, and we've heard from any other crowdsourcing projects that this.",
            "You know, people want to know how much did they do.",
            "They want rewards, they want to see you know aboard who has been the best contributor.",
            "They want a forum to discuss things on so we're working on that as well.",
            "We're scheduling the first meeting with volunteers next month to come together and get input from them.",
            "To see what they would like to see changed on the website or added to the website.",
            "And of course we're also looking for new crowds, so if any of you are still interested after this kind of, you know.",
            "Um, unsure presentation.",
            "Please go to the website or ask your children to do so.",
            "Your colleagues, your parents, your friends.",
            "You could do one letter.",
            "You can do many letters and we hope to see you at the site.",
            "So several that 100 Datsun L Thank you very much for your attention."
        ],
        [
            "For an interesting thought.",
            "Microphone doesn't work.",
            "Do you have any?",
            "Do we have any questions?",
            "Sorry.",
            "Got any questions in the crowd?",
            "I was just sorry I didn't see you.",
            "I was just curious to know how you cope with the specific spelling issue, because that I mean.",
            "He on the example you show, we could see that the F&S is very similar and I guess there may be some other like typographical.",
            "This phenomenon that we, as modern user of those languages we do, we do not know.",
            "So do you have to teach that to the people that use the platform?",
            "Yeah, so in our transcribed tutorial we go over the main things that people might encounter.",
            "So the S or the F for instance, but also for the dates the Roman dates, how they might have looked like certain abbreviations that they might encounter.",
            "But literally we.",
            "So we do.",
            "We do give a short overview, but it's hard to to teach him everything because that would take, you know, a long time.",
            "So we really asked him to enter what they see, and so if there's a never set of an S at the back end, we will.",
            "We will pick up on that.",
            "And of course three people are working on the same letter, so you also get 3 three times today to.",
            "But there's something.",
            "Definitely that's you know, that's it.",
            "It won't be perfect.",
            "Clean clean data because of those things.",
            "And sometimes there's things you don't.",
            "We don't think about that might be in there.",
            "I mean we have thousands of pages, thousands of different books, so you know, we kind of hope that the crowd will say, hey, I have no idea what this is.",
            "Can you help me and we say Oh yeah, we pulled that in this tutorial.",
            "So yeah, thank you.",
            "One more here.",
            "See I already congratulations a great presentation and and also you are good in waiting for help and everything else.",
            "I really enjoy your project and I am already on your website.",
            "I see you have also Greek to Latin so you also work with Kilik with Greek characters.",
            "No, but some of this I don't it might be.",
            "I'm not sure, so we have looked at Hebrew and Greek so but Greek and Latin is often when there's Greek quotations in a Latin letter, but as far as I know, we don't have full letters in Greek, but maybe there's.",
            "This is what I see here.",
            "OK, well, yeah, it's amazing actors, it's old click yes.",
            "So did you.",
            "Which which language did you press?",
            "'cause that's something I need Greek to Latin.",
            "Options in my something new everyday.",
            "Oh no, there shouldn't be a fully Greek letter 'cause that's would be a bit difficult, but if you found one that's great and I'm going to look into how you how you do work with our characters and let him know we don't.",
            "So that's why I'm curious how you get to see it.",
            "Letter that is fully, you know I will.",
            "I completely believe you.",
            "But yeah, interesting.",
            "So now we we have looked into that.",
            "We had also people with Hebrew sources getting involved, but that got very complicated for the different direction.",
            "But yeah, I'm going to.",
            "I'm going to have a look at what you found, yeah?",
            "Thank you next question, please very interesting.",
            "Do you have any redundancy in the labeling and in the transcription I mean or you just trust the users, no, so that's why we have two to three users, do it.",
            "And then of course we have to do a quick browse ourselves to see how how they did.",
            "How do you compare larger selection with a smaller selection?",
            "Which is the right one for instance?",
            "Oh you mean with drawing the boxes?",
            "Yes.",
            "Well, of course the boxes are drawn and then someone else transcribes them.",
            "So I need to transcribe process.",
            "You know we have certain cutoff.",
            "So for instance, if for the first lined in keep it, they select not one line but a whole page.",
            "It will cut them off after 10 words, so they can't transcribe more, so it's all connected to each other when they enter the date, they can't, and they can't enter 3 lines of text for instance.",
            "So in the transcribe process we hope to get those you know.",
            "First errors out, but of course there will always be errors.",
            "Hours in there you can't, yeah.",
            "Thank you, do we have more questions here?",
            "No, I was just wondering how we can use this for language teaching.",
            "May be scanned documents in a PDF marking various grammars, grammar, various mistakes, stylistics or grammar or vocabulary.",
            "Note by correcting, but only to mark.",
            "This is a grammatical mistake.",
            "This is a vocabulary mistake.",
            "This stylistic mistake.",
            "I was just brainstorming while you were presenting how that could be adapted to scan documents.",
            "At least.",
            "Yeah, I think it's very important we have looked at just doing transcribing.",
            "But when we saw scribe, I think some people, just, you know, you don't have to do both.",
            "So people really just like to draw the boxes and they don't like to, you know it's a bit more complicated transcribing it.",
            "You have a bit more.",
            "You have to go through a longer tutorial for instance, so it helps with different tasks.",
            "You give people some people just like, you know, identify, and then you know go through it quite quickly, while others want to really be involved and see OK. What is the date and like that kind of puzzling.",
            "So I think for language you can.",
            "You know instead of asking them just to transcribe or just you know type in what they see you can you can have.",
            "First step that is may be fun for the reason why I was thinking about the PDF scanned documents was because not everyone is killed in typing.",
            "Some people take a long time to type a text or document.",
            "Some people just write it by hands and scan it and put it up, upload it to the crowd and wait for feedback.",
            "So that's from me, that's my commander.",
            "Thank you very much everyone.",
            "For for listening.",
            "And now we would like to welcome the next speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for the invitation.",
                    "label": 0
                },
                {
                    "sent": "I'm very happy to be here.",
                    "label": 0
                },
                {
                    "sent": "It's very new world to me and I'm learning a lot.",
                    "label": 0
                },
                {
                    "sent": "So thank you for that.",
                    "label": 0
                },
                {
                    "sent": "Thank you for letting me be here.",
                    "label": 0
                },
                {
                    "sent": "So I'm here today to discuss several, which is a crowdsourcing platform created for historical research project and it is I will try and tell you as much as I can about the platform, but just a bit of a warning.",
                    "label": 0
                },
                {
                    "sent": "It's very different than what has been discussed earlier today.",
                    "label": 0
                },
                {
                    "sent": "We are focusing very much on documents, not so much on language itself.",
                    "label": 0
                },
                {
                    "sent": "But we're talking about data.",
                    "label": 0
                },
                {
                    "sent": "We're talking bout crowd getting a crowd involved.",
                    "label": 0
                },
                {
                    "sent": "So I will tell you what we do, and I hope I can interest some of you, say some useful things for you.",
                    "label": 0
                },
                {
                    "sent": "So I will be.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We introduced a skill net project.",
                    "label": 0
                },
                {
                    "sent": "The research projects Den says something about our sources and data and conclude by talking about Central and its development in comparison to.",
                    "label": 1
                },
                {
                    "sent": "I think all the projects that have gone before.",
                    "label": 0
                },
                {
                    "sent": "We are very, very small, but we don't mind.",
                    "label": 0
                },
                {
                    "sent": "We're still proud of what we what we were doing at Central.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first of all, I'm a postdoc.",
                    "label": 0
                },
                {
                    "sent": "I'm historian.",
                    "label": 0
                },
                {
                    "sent": "I'm opposed to get skill Knutson Skillnet stands for sharing knowledge and learn tan literary networks.",
                    "label": 0
                },
                {
                    "sent": "The project started in 2018, so very recently at the University of Utrecht, but it is funded by the European Research Council and our project studies what we call the Republic of Letters, the scientific community that existed in Europe between roughly 1500 and 1800s.",
                    "label": 0
                },
                {
                    "sent": "The early modern.",
                    "label": 0
                },
                {
                    "sent": "Our team, consisting of PHD's an postdocs, studies, for example, the social networks of scholars in the early modern days, the ways in which scholars related to the ideal of sharing knowledge and methods they use to communicate this ideal to future generations.",
                    "label": 0
                },
                {
                    "sent": "We all study very different different aspects, but our data and our approach is similar.",
                    "label": 0
                },
                {
                    "sent": "We combine methods of digital humanities as well as traditional methods so close and distant reading, and we focus mainly on.",
                    "label": 0
                },
                {
                    "sent": "Early modern correspondence.",
                    "label": 0
                },
                {
                    "sent": "The people who constituted the Republic of Letters communicated via letters.",
                    "label": 1
                },
                {
                    "sent": "This was their email, their social media, their main means of communication.",
                    "label": 0
                },
                {
                    "sent": "So in letters they introduced themselves.",
                    "label": 0
                },
                {
                    "sent": "They discussed the news.",
                    "label": 0
                },
                {
                    "sent": "They discuss new publications, recent ideas, but also they shared sources.",
                    "label": 0
                },
                {
                    "sent": "So this ends books to each other manuscripts, but also sometimes specimen they found, etc.",
                    "label": 0
                },
                {
                    "sent": "And this via close study and digital analysis of these letters that we attempt to better understand this scholarly community.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to give you a code is 5 research projects in in.",
                    "label": 0
                },
                {
                    "sent": "In our larger project at Skillnet and this is some of what we are working on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to give you an idea of our data.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, so these are the letters of 1 scholar, at least.",
                    "label": 1
                },
                {
                    "sent": "A sample of them hardly unbathed Lanza Dutch color, and the data we have, the letters we have.",
                    "label": 0
                },
                {
                    "sent": "Really the difference.",
                    "label": 0
                },
                {
                    "sent": "What we have now would have been preserved, so some of the letters are still in manuscripts in archives and libraries all over Europe.",
                    "label": 0
                },
                {
                    "sent": "Some of the letters have been published in the early modern period.",
                    "label": 0
                },
                {
                    "sent": "You can see one at the top.",
                    "label": 0
                },
                {
                    "sent": "There an example.",
                    "label": 0
                },
                {
                    "sent": "Some letters were published in the last 50 years and others have already been digitized and been published online.",
                    "label": 0
                },
                {
                    "sent": "So for instance, on the website.",
                    "label": 0
                },
                {
                    "sent": "Early modern letters online, which offers a lot of data on on letters.",
                    "label": 0
                },
                {
                    "sent": "So what is the data we want to have from these letters?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will give you an example.",
                    "label": 0
                },
                {
                    "sent": "This is a letter from Babylon to Isaac Fortius in January 1684.",
                    "label": 1
                },
                {
                    "sent": "Um and the first kind of type of date.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we are looking for.",
                    "label": 0
                },
                {
                    "sent": "Is that what we call the metadata of a letter and there is a basic information so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It means we want to know who sent the letter, who received the letter.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to know the date or the dates of the letter when it was sent and sometimes it says also when it was received we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To know the places where was it sent from?",
                    "label": 0
                },
                {
                    "sent": "Where was it sent to?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also we're interested in the language of the letter.",
                    "label": 0
                },
                {
                    "sent": "What was it composed in?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we always look forward in keep it as well.",
                    "label": 0
                },
                {
                    "sent": "The first line of the letter so we can compare if we have one letter sent on the same date.",
                    "label": 0
                },
                {
                    "sent": "If it is actually copies of the same letter, so that's the first type of data we are looking for in our research project, the 2nd.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Time is it.",
                    "label": 0
                },
                {
                    "sent": "You can imagine the contents of the letter or the full text letter and this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Really, the whole the text as a whole, we want to know what subjects people are discussing, which people are mentioned.",
                    "label": 0
                },
                {
                    "sent": "What quotations are in there, what, which works are cited etc etc.",
                    "label": 0
                },
                {
                    "sent": "You can imagine the content of letter can be about almost everything.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "We need this data of course in digitized form.",
                    "label": 0
                },
                {
                    "sent": "We need to let us as we call it marked by which marked by the metadata and we need them also transcribed.",
                    "label": 0
                },
                {
                    "sent": "We need to full content in digital digital form and many letters have already been digitized, but there's still much work to be done and This is why we need the crowd, so to speak.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is the origin of our simril.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Project which stands for collecting the epistolary metadata of the Republic of Letters, and just started the development of the platform, started when the project started, so this was early.",
                    "label": 1
                },
                {
                    "sent": "In 2018, we started the first plans our developers started working on the 1st prototype and finished by late summer last year, and we launched Central as we launched several 14 December 2018.",
                    "label": 0
                },
                {
                    "sent": "So it's exactly 3 months ago today, so we're still very new and I want to stress this very much a work in progress.",
                    "label": 0
                },
                {
                    "sent": "We're still not very happy with older features, but in general it's working and we have a very small but active group of contributors.",
                    "label": 0
                },
                {
                    "sent": "Um, I could discuss many different aspects of some rule, but I will focus most of all now on the different choices we've made in its development.",
                    "label": 0
                },
                {
                    "sent": "'cause I think that might be most beneficial for all of you.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "A guiding force behind all of our choices was on the one hand, the academic point of view.",
                    "label": 0
                },
                {
                    "sent": "So what do we as researchers need and what is most useful for us, and what can actually be outsourced to the crowd?",
                    "label": 0
                },
                {
                    "sent": "And on the other hand, there was the public perspective, the view of the crowd.",
                    "label": 0
                },
                {
                    "sent": "So what can they do?",
                    "label": 0
                },
                {
                    "sent": "What do they want to do, and how can we make certain tasks interesting and simple?",
                    "label": 0
                },
                {
                    "sent": "A first choice we made was to focus on the meta data of letters.",
                    "label": 1
                },
                {
                    "sent": "Since most of the members of our team focused on the basic information of letters.",
                    "label": 1
                },
                {
                    "sent": "So Sender, recipient date and places this would assist most of our research projects and also it would be relatively easy.",
                    "label": 0
                },
                {
                    "sent": "The crowd would not need much training to look at a letter and see, hey, this is the sender.",
                    "label": 0
                },
                {
                    "sent": "This is the recipient is the date of the letter and it was made even simpler by our choice to focus on modern additions of letters.",
                    "label": 0
                },
                {
                    "sent": "So not on handwritten letters, not on manuscripts that might be hard to read.",
                    "label": 0
                },
                {
                    "sent": "Put on a letter said I've already been published in TypeScript.",
                    "label": 0
                },
                {
                    "sent": "2nd we made.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Important choices in the development of the platform.",
                    "label": 0
                },
                {
                    "sent": "We, for example, decided to create our own and not Jordan established crowdsourcing platform.",
                    "label": 0
                },
                {
                    "sent": "Like for instance failure Hamden, Phalombe and is a Dutch platform which brings together many different projects that need the public and that focus on national heritage.",
                    "label": 0
                },
                {
                    "sent": "For example, there's a program that asks to help and gather information from notary acts.",
                    "label": 0
                },
                {
                    "sent": "This is similar information that we need collected from our letter, so names, dates and places.",
                    "label": 0
                },
                {
                    "sent": "So joining Failure Home that would have made our project available to a large crowd that was already engaged with with crowdsourcing.",
                    "label": 0
                },
                {
                    "sent": "Yet in the end we decided against it mainly because the site is all in Dutch and our project as well as our data is very international and multilingual and we really wanted to work with an international crowd and engaged international crowd.",
                    "label": 0
                },
                {
                    "sent": "And then also we wanted to have a bit more control over the platform and not leave that all up to fail Honda.",
                    "label": 0
                },
                {
                    "sent": "2nd we made sorry following from this decision.",
                    "label": 0
                },
                {
                    "sent": "We had to make up our minds about the developers that would create our platform.",
                    "label": 0
                },
                {
                    "sent": "We had several options in an inside and outside academia, but in the end we ended up hiring what is called the digital Humanities lab.",
                    "label": 0
                },
                {
                    "sent": "This is part of the University of Utrecht.",
                    "label": 0
                },
                {
                    "sent": "There are many reasons for this, but mainly it was already part of the humanities Department that we work in as well and the developers they already had experience with working with cultural history projects with historical documents and with dealing with academics like ourselves.",
                    "label": 0
                },
                {
                    "sent": "So that was the best fit for us in the end.",
                    "label": 0
                },
                {
                    "sent": "And then in conversation with the digital Humanities lab, even though we didn't join fail under the established platform, we still had to decide if we could create our own framework while creating something from the ground up.",
                    "label": 1
                },
                {
                    "sent": "It turns way too expensive and way to complicate it.",
                    "label": 0
                },
                {
                    "sent": "So we adopted a framework, so to speak, and we chose Scribe, which is an open source framework for community transcript projects and we decided on this one because it offered all the functions we need it.",
                    "label": 0
                },
                {
                    "sent": "So by late summer last year, several was developed, yet many choices were to follow that I will not get into, but I think it's important to mention that we were still large.",
                    "label": 0
                },
                {
                    "sent": "Lot of work to do because the editing process took much longer than we all expected fine tuning the interface was very time consuming, yet very important.",
                    "label": 0
                },
                {
                    "sent": "So I'm for instance talking about the design of the tutorials.",
                    "label": 0
                },
                {
                    "sent": "So where do you put a tutorial?",
                    "label": 0
                },
                {
                    "sent": "When does it pop up?",
                    "label": 0
                },
                {
                    "sent": "What do you explain?",
                    "label": 0
                },
                {
                    "sent": "What do you not explain an how do you explain it in the best and most effective way without?",
                    "label": 0
                },
                {
                    "sent": "Making it an hour long tutorial and of course we also friends to design the buttons.",
                    "label": 0
                },
                {
                    "sent": "Something very simple that you click on their shape, their size, their color, how many you put on the page, what is a logical place etc.",
                    "label": 0
                },
                {
                    "sent": "Very complex world to US academics, but now don't worry, I've described it for way too long, probably.",
                    "label": 0
                },
                {
                    "sent": "So let's get into some role.",
                    "label": 0
                },
                {
                    "sent": "And of course this is the most.",
                    "label": 0
                },
                {
                    "sent": "Daunting thing of the presentation to see if it works now.",
                    "label": 0
                },
                {
                    "sent": "So I just type it in.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                },
                {
                    "sent": "This can someone help me with the?",
                    "label": 0
                },
                {
                    "sent": "I'm sorry this is not my own.",
                    "label": 0
                },
                {
                    "sent": "I press the link but it's just opening it up.",
                    "label": 0
                },
                {
                    "sent": "It's not going there.",
                    "label": 0
                },
                {
                    "sent": "Yes I do, but I can't.",
                    "label": 0
                },
                {
                    "sent": "Oh here we go.",
                    "label": 0
                },
                {
                    "sent": "There we go.",
                    "label": 0
                },
                {
                    "sent": "Here it is.",
                    "label": 0
                },
                {
                    "sent": "Perfect.",
                    "label": 0
                },
                {
                    "sent": "This is the Internet Internet connection that is very slow.",
                    "label": 0
                },
                {
                    "sent": "Is that OK?",
                    "label": 0
                },
                {
                    "sent": "Scores would be great if I can actually show it to you.",
                    "label": 0
                },
                {
                    "sent": "I know.",
                    "label": 0
                },
                {
                    "sent": "We discovered.",
                    "label": 0
                },
                {
                    "sent": "Let me just try to oh here we go home alright, so this is a bit zoomed in.",
                    "label": 0
                },
                {
                    "sent": "But I'll try anyway to.",
                    "label": 0
                },
                {
                    "sent": "We should have.",
                    "label": 0
                },
                {
                    "sent": "Yeah, here we go.",
                    "label": 0
                },
                {
                    "sent": "So on our home page I'm just inviting all of you to look at this on your computers later.",
                    "label": 0
                },
                {
                    "sent": "'cause this is not really working on this computer unfortunately.",
                    "label": 0
                },
                {
                    "sent": "Not sure why.",
                    "label": 0
                },
                {
                    "sent": "Just going to try and load.",
                    "label": 0
                },
                {
                    "sent": "This part and we'll see how far we come.",
                    "label": 0
                },
                {
                    "sent": "So while this is loading, so basically what we do and it's a bit hard to describe without here we go so.",
                    "label": 0
                },
                {
                    "sent": "We won't have many images, but for those who have a laptop, look at it at your laptop or else I will just try to explain as best I can.",
                    "label": 0
                },
                {
                    "sent": "Let me try to get this page up.",
                    "label": 0
                },
                {
                    "sent": "That might be best.",
                    "label": 0
                },
                {
                    "sent": "So we have two tasks in several.",
                    "label": 0
                },
                {
                    "sent": "Basically we show people additions of letters, so these are all in type script that asks for either to mark or two transcribe when you Mark.",
                    "label": 0
                },
                {
                    "sent": "That means you kind of draw boxes around the data we want, so we want to know the sender, the recipient, the date.",
                    "label": 0
                },
                {
                    "sent": "Yes, and if you recognize that was on a certain page, you draw a box around them and that's the only task you have have to do, and then you go to the next page.",
                    "label": 0
                },
                {
                    "sent": "So for every page we ask you.",
                    "label": 0
                },
                {
                    "sent": "To show us if there's data on there that we need.",
                    "label": 0
                },
                {
                    "sent": "So that's the first task.",
                    "label": 0
                },
                {
                    "sent": "OK, the Internet's really not.",
                    "label": 0
                },
                {
                    "sent": "Working with us at all.",
                    "label": 0
                },
                {
                    "sent": "Oh here we go.",
                    "label": 0
                },
                {
                    "sent": "Can I somehow get out of the presentation mode?",
                    "label": 0
                },
                {
                    "sent": "Because this is.",
                    "label": 0
                },
                {
                    "sent": "Can't do anything at this point.",
                    "label": 0
                },
                {
                    "sent": "Alright, so that's the first task.",
                    "label": 0
                },
                {
                    "sent": "The mark and then OK. Now it's just.",
                    "label": 0
                },
                {
                    "sent": "Who's who's computer?",
                    "label": 0
                },
                {
                    "sent": "Is this 'cause I can't?",
                    "label": 0
                },
                {
                    "sent": "Just close it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK. Alright.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry I was counting on this too.",
                    "label": 0
                },
                {
                    "sent": "To work.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "MacBook Air, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's not reacting.",
                    "label": 0
                },
                {
                    "sent": "This is what it is doing.",
                    "label": 0
                },
                {
                    "sent": "Can I get some ones?",
                    "label": 0
                },
                {
                    "sent": "Home.",
                    "label": 0
                },
                {
                    "sent": "So it is the presentation mode.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK well.",
                    "label": 0
                },
                {
                    "sent": "OK, so basically I can't show you now.",
                    "label": 0
                },
                {
                    "sent": "There's a little clip later that shows you a little bit, but that's very unfortunate.",
                    "label": 0
                },
                {
                    "sent": "I can't really show you what's going on.",
                    "label": 0
                },
                {
                    "sent": "It works well, doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "So after the boxes are drawn you type in what is in those boxes.",
                    "label": 0
                },
                {
                    "sent": "And this way we transcribe the letters letters as well.",
                    "label": 0
                },
                {
                    "sent": "I will try to see if I can fix this by getting my own computer and hook it up, but for now.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I just want to show you little clip and say something about our audience.",
                    "label": 0
                },
                {
                    "sent": "So for some role we didn't have a specific audience in mind's really.",
                    "label": 0
                },
                {
                    "sent": "The whole public was our audience.",
                    "label": 0
                },
                {
                    "sent": "We wanted everyone to feel invited to contribute all ages or interests because people who speak different languages.",
                    "label": 0
                },
                {
                    "sent": "To promote some rule, we organized the launch.",
                    "label": 0
                },
                {
                    "sent": "We were a lot on social media, but we also targeted specific interest groups of big interest Group for us turned out to be the alumni of the University wanted to be involved with something, a scholarly, academic and Aruna Hunua different languages, but there were also, for instance, historical societies that we talked to, and those were those were interested people as well, but also teachers, teachers in history who want their students to get an idea of primary sources.",
                    "label": 0
                },
                {
                    "sent": "But you cannot really get their students to go to the archive and via our system they can get a sense of primary documents just from from home from their computers.",
                    "label": 0
                },
                {
                    "sent": "So let's hope the next part.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works.",
                    "label": 0
                },
                {
                    "sent": "So this is a little clip.",
                    "label": 0
                },
                {
                    "sent": "That we designed, it was designed by humanity departments to kind of promote our our platform and to really introduce it to everyone who is interested.",
                    "label": 0
                },
                {
                    "sent": "That's why I will show you in full if it works.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You all go to the website and look at the clip.",
                    "label": 0
                },
                {
                    "sent": "It's very beautiful, but I would just run you through the website not away here.",
                    "label": 0
                },
                {
                    "sent": "So this is our websites and roll your own new so we press get started and here we see the two different tasks.",
                    "label": 0
                },
                {
                    "sent": "So this is the first task which is to mark.",
                    "label": 0
                },
                {
                    "sent": "So this is the bit you identify the basic information for us and this is easy as just drawing boxes around the information and then it saves it for us.",
                    "label": 0
                },
                {
                    "sent": "Second task is to transcribe.",
                    "label": 0
                },
                {
                    "sent": "So the boxes that have been drawn by you or someone else.",
                    "label": 0
                },
                {
                    "sent": "You don't type in that information, and that gets, so it's quite simple straightforward, so I will show you how it works in the program.",
                    "label": 0
                },
                {
                    "sent": "So first we select our language.",
                    "label": 0
                },
                {
                    "sent": "There's many different around, so it's set to English today.",
                    "label": 0
                },
                {
                    "sent": "Then there's another choice that you can make, and this was actually suggested by our volunteers that they wanted to kind of decide who they were working on.",
                    "label": 0
                },
                {
                    "sent": "So which early modern scholar.",
                    "label": 0
                },
                {
                    "sent": "So we see some familiar faces for some.",
                    "label": 0
                },
                {
                    "sent": "Hopefully John Locke is there.",
                    "label": 0
                },
                {
                    "sent": "Alexander Pope today will have a brief look at.",
                    "label": 0
                },
                {
                    "sent": "Robert Boyle his letters.",
                    "label": 0
                },
                {
                    "sent": "So this is the interface.",
                    "label": 0
                },
                {
                    "sent": "As you can see, the tutorial always pops up because it's our was our experience that people otherwise just start and then haven't looked at the tutorial at all and then forget that there might be a tutorial.",
                    "label": 0
                },
                {
                    "sent": "But of course we have all done this before, so we're going to click away tutorial.",
                    "label": 0
                },
                {
                    "sent": "So just the interface on the left.",
                    "label": 0
                },
                {
                    "sent": "We have a navigation so you can zoom in and out.",
                    "label": 0
                },
                {
                    "sent": "You can see the different pages there and you can also hide or show the markings of other people.",
                    "label": 0
                },
                {
                    "sent": "So our system works that.",
                    "label": 0
                },
                {
                    "sent": "Three people have a mark.",
                    "label": 0
                },
                {
                    "sent": "Have to mark a page before it's saved and taken out of the interface.",
                    "label": 0
                },
                {
                    "sent": "This is of course because someone might miss something someone might have identified the wrong thing and then someone else can can correct that.",
                    "label": 0
                },
                {
                    "sent": "So now we have to go to actually a page where there is some data on it.",
                    "label": 0
                },
                {
                    "sent": "Early 1 letters can be hundreds of pages long and of course we only want the metadata so that is correct.",
                    "label": 0
                },
                {
                    "sent": "That is at the beginning of the start of a left at the end of the start of a letter.",
                    "label": 0
                },
                {
                    "sent": "So I'm just going to quickly run through to see.",
                    "label": 0
                },
                {
                    "sent": "Where this where the next letter starts?",
                    "label": 0
                },
                {
                    "sent": "Here we go.",
                    "label": 0
                },
                {
                    "sent": "So here we have so someone else is marking, so I'm just going to hide them for.",
                    "label": 0
                },
                {
                    "sent": "Our sake, so here we have to start of a letter and now we go to the rights to the interface on the right an we let our users go through a number of questions and the first question is always is there anything left to mark on this page?",
                    "label": 0
                },
                {
                    "sent": "'cause there's a lot of pages.",
                    "label": 0
                },
                {
                    "sent": "I just said that they have no date on it.",
                    "label": 0
                },
                {
                    "sent": "So here we have anything.",
                    "label": 0
                },
                {
                    "sent": "Yes we have something to mark those data on there that we want.",
                    "label": 0
                },
                {
                    "sent": "So there's a beginning of a letter.",
                    "label": 0
                },
                {
                    "sent": "Yes, the 3rd letter starts here.",
                    "label": 0
                },
                {
                    "sent": "So then we literally just draw a line here at the beginning of letter.",
                    "label": 0
                },
                {
                    "sent": "So this tells us the beginning of letter.",
                    "label": 0
                },
                {
                    "sent": "Why do we want to know?",
                    "label": 0
                },
                {
                    "sent": "Of course it doesn't.",
                    "label": 0
                },
                {
                    "sent": "It usually works that it stays there.",
                    "label": 0
                },
                {
                    "sent": "What do you want to give letter?",
                    "label": 0
                },
                {
                    "sent": "We sometimes don't know how many letters are in volume, so we want to begin in the end to see how long is a letter, how many pages, etc.",
                    "label": 0
                },
                {
                    "sent": "It takes you through different questions.",
                    "label": 0
                },
                {
                    "sent": "I will just leave, well not presents.",
                    "label": 0
                },
                {
                    "sent": "For instance the in keep it as I just told you we want to know the first line, so here we draw around the first line and then we press next.",
                    "label": 0
                },
                {
                    "sent": "So here we go through the whole there's.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to say no.",
                    "label": 0
                },
                {
                    "sent": "I'm just going to do very bad job on this letter to get to the end.",
                    "label": 0
                },
                {
                    "sent": "Other things that so then we go when we have finished all the questions to the next page all I think we see on the right is the bad page.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's a glitch.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's a black page.",
                    "label": 0
                },
                {
                    "sent": "We also put our email address there in case or any questions people can go back to the tutorial.",
                    "label": 0
                },
                {
                    "sent": "And they can also share a page on Facebook on Twitter if they want to.",
                    "label": 0
                },
                {
                    "sent": "So next task very quickly is the transcribe option.",
                    "label": 0
                },
                {
                    "sent": "So again, we go to Robert Boyle.",
                    "label": 0
                },
                {
                    "sent": "And here we see, for instance, that someone has draw drawn a box around the date.",
                    "label": 0
                },
                {
                    "sent": "So now we simply as it asks enter.",
                    "label": 0
                },
                {
                    "sent": "The date is given the 1st of October.",
                    "label": 0
                },
                {
                    "sent": "1685 so as we enter the language, there's a lot of questions about the date.",
                    "label": 0
                },
                {
                    "sent": "I won't go into that now.",
                    "label": 0
                },
                {
                    "sent": "'cause in the early one period you can record a date in many different ways.",
                    "label": 0
                },
                {
                    "sent": "And of course here we have don't have it set.",
                    "label": 0
                },
                {
                    "sent": "Quick set of questions, but there's different things that happen here and then we go to the next entry or doesn't want to give itself the place, for instance.",
                    "label": 0
                },
                {
                    "sent": "So this is how it how it works.",
                    "label": 0
                },
                {
                    "sent": "Are several.",
                    "label": 0
                },
                {
                    "sent": "We do have some records here on how many people have been there.",
                    "label": 0
                },
                {
                    "sent": "How many pages have been marked, etc.",
                    "label": 0
                },
                {
                    "sent": "So I think the PowerPoint.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I don't have that here, but on the PowerPoint I had some results so we've only been here.",
                    "label": 0
                },
                {
                    "sent": "Been going for three months, but we think we've been very successful.",
                    "label": 0
                },
                {
                    "sent": "But I've heard about millions of people today, so maybe we have not been that successful.",
                    "label": 0
                },
                {
                    "sent": "But we've had 76 unique users in the last month.",
                    "label": 0
                },
                {
                    "sent": "They have undertaken 226.",
                    "label": 0
                },
                {
                    "sent": "Sessions, some sessions were five seconds long.",
                    "label": 0
                },
                {
                    "sent": "Some sessions were six hours long, so that's one session of them would be pretty good and then 37,000 classifications were made in a classification is when they draw one box or transcribe one word.",
                    "label": 0
                },
                {
                    "sent": "So we were actually very happy with that, specially 'cause you know we're still developing.",
                    "label": 0
                },
                {
                    "sent": "We're still seeing if the interface works or if the program works at all.",
                    "label": 0
                },
                {
                    "sent": "So it's small, but also we're not looking for millions of people were looking for a small and active crowd contributing to our research.",
                    "label": 0
                },
                {
                    "sent": "So we're working at the moment at improving our platform.",
                    "label": 0
                },
                {
                    "sent": "We for instance want to add more context on the people that are in the platform, so the people, the scholars and a different addition.",
                    "label": 0
                },
                {
                    "sent": "So who you know whose letters are you working on?",
                    "label": 0
                },
                {
                    "sent": "And we're also working on an optional personal log in, and we've heard from any other crowdsourcing projects that this.",
                    "label": 0
                },
                {
                    "sent": "You know, people want to know how much did they do.",
                    "label": 0
                },
                {
                    "sent": "They want rewards, they want to see you know aboard who has been the best contributor.",
                    "label": 0
                },
                {
                    "sent": "They want a forum to discuss things on so we're working on that as well.",
                    "label": 0
                },
                {
                    "sent": "We're scheduling the first meeting with volunteers next month to come together and get input from them.",
                    "label": 0
                },
                {
                    "sent": "To see what they would like to see changed on the website or added to the website.",
                    "label": 0
                },
                {
                    "sent": "And of course we're also looking for new crowds, so if any of you are still interested after this kind of, you know.",
                    "label": 0
                },
                {
                    "sent": "Um, unsure presentation.",
                    "label": 0
                },
                {
                    "sent": "Please go to the website or ask your children to do so.",
                    "label": 0
                },
                {
                    "sent": "Your colleagues, your parents, your friends.",
                    "label": 0
                },
                {
                    "sent": "You could do one letter.",
                    "label": 0
                },
                {
                    "sent": "You can do many letters and we hope to see you at the site.",
                    "label": 0
                },
                {
                    "sent": "So several that 100 Datsun L Thank you very much for your attention.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For an interesting thought.",
                    "label": 0
                },
                {
                    "sent": "Microphone doesn't work.",
                    "label": 0
                },
                {
                    "sent": "Do you have any?",
                    "label": 0
                },
                {
                    "sent": "Do we have any questions?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Got any questions in the crowd?",
                    "label": 0
                },
                {
                    "sent": "I was just sorry I didn't see you.",
                    "label": 0
                },
                {
                    "sent": "I was just curious to know how you cope with the specific spelling issue, because that I mean.",
                    "label": 0
                },
                {
                    "sent": "He on the example you show, we could see that the F&S is very similar and I guess there may be some other like typographical.",
                    "label": 0
                },
                {
                    "sent": "This phenomenon that we, as modern user of those languages we do, we do not know.",
                    "label": 0
                },
                {
                    "sent": "So do you have to teach that to the people that use the platform?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so in our transcribed tutorial we go over the main things that people might encounter.",
                    "label": 0
                },
                {
                    "sent": "So the S or the F for instance, but also for the dates the Roman dates, how they might have looked like certain abbreviations that they might encounter.",
                    "label": 0
                },
                {
                    "sent": "But literally we.",
                    "label": 0
                },
                {
                    "sent": "So we do.",
                    "label": 0
                },
                {
                    "sent": "We do give a short overview, but it's hard to to teach him everything because that would take, you know, a long time.",
                    "label": 0
                },
                {
                    "sent": "So we really asked him to enter what they see, and so if there's a never set of an S at the back end, we will.",
                    "label": 0
                },
                {
                    "sent": "We will pick up on that.",
                    "label": 0
                },
                {
                    "sent": "And of course three people are working on the same letter, so you also get 3 three times today to.",
                    "label": 0
                },
                {
                    "sent": "But there's something.",
                    "label": 0
                },
                {
                    "sent": "Definitely that's you know, that's it.",
                    "label": 0
                },
                {
                    "sent": "It won't be perfect.",
                    "label": 0
                },
                {
                    "sent": "Clean clean data because of those things.",
                    "label": 0
                },
                {
                    "sent": "And sometimes there's things you don't.",
                    "label": 0
                },
                {
                    "sent": "We don't think about that might be in there.",
                    "label": 0
                },
                {
                    "sent": "I mean we have thousands of pages, thousands of different books, so you know, we kind of hope that the crowd will say, hey, I have no idea what this is.",
                    "label": 0
                },
                {
                    "sent": "Can you help me and we say Oh yeah, we pulled that in this tutorial.",
                    "label": 0
                },
                {
                    "sent": "So yeah, thank you.",
                    "label": 0
                },
                {
                    "sent": "One more here.",
                    "label": 0
                },
                {
                    "sent": "See I already congratulations a great presentation and and also you are good in waiting for help and everything else.",
                    "label": 0
                },
                {
                    "sent": "I really enjoy your project and I am already on your website.",
                    "label": 0
                },
                {
                    "sent": "I see you have also Greek to Latin so you also work with Kilik with Greek characters.",
                    "label": 0
                },
                {
                    "sent": "No, but some of this I don't it might be.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure, so we have looked at Hebrew and Greek so but Greek and Latin is often when there's Greek quotations in a Latin letter, but as far as I know, we don't have full letters in Greek, but maybe there's.",
                    "label": 0
                },
                {
                    "sent": "This is what I see here.",
                    "label": 0
                },
                {
                    "sent": "OK, well, yeah, it's amazing actors, it's old click yes.",
                    "label": 0
                },
                {
                    "sent": "So did you.",
                    "label": 0
                },
                {
                    "sent": "Which which language did you press?",
                    "label": 0
                },
                {
                    "sent": "'cause that's something I need Greek to Latin.",
                    "label": 0
                },
                {
                    "sent": "Options in my something new everyday.",
                    "label": 0
                },
                {
                    "sent": "Oh no, there shouldn't be a fully Greek letter 'cause that's would be a bit difficult, but if you found one that's great and I'm going to look into how you how you do work with our characters and let him know we don't.",
                    "label": 0
                },
                {
                    "sent": "So that's why I'm curious how you get to see it.",
                    "label": 0
                },
                {
                    "sent": "Letter that is fully, you know I will.",
                    "label": 0
                },
                {
                    "sent": "I completely believe you.",
                    "label": 0
                },
                {
                    "sent": "But yeah, interesting.",
                    "label": 0
                },
                {
                    "sent": "So now we we have looked into that.",
                    "label": 0
                },
                {
                    "sent": "We had also people with Hebrew sources getting involved, but that got very complicated for the different direction.",
                    "label": 0
                },
                {
                    "sent": "But yeah, I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I'm going to have a look at what you found, yeah?",
                    "label": 0
                },
                {
                    "sent": "Thank you next question, please very interesting.",
                    "label": 0
                },
                {
                    "sent": "Do you have any redundancy in the labeling and in the transcription I mean or you just trust the users, no, so that's why we have two to three users, do it.",
                    "label": 0
                },
                {
                    "sent": "And then of course we have to do a quick browse ourselves to see how how they did.",
                    "label": 0
                },
                {
                    "sent": "How do you compare larger selection with a smaller selection?",
                    "label": 0
                },
                {
                    "sent": "Which is the right one for instance?",
                    "label": 0
                },
                {
                    "sent": "Oh you mean with drawing the boxes?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Well, of course the boxes are drawn and then someone else transcribes them.",
                    "label": 0
                },
                {
                    "sent": "So I need to transcribe process.",
                    "label": 0
                },
                {
                    "sent": "You know we have certain cutoff.",
                    "label": 0
                },
                {
                    "sent": "So for instance, if for the first lined in keep it, they select not one line but a whole page.",
                    "label": 0
                },
                {
                    "sent": "It will cut them off after 10 words, so they can't transcribe more, so it's all connected to each other when they enter the date, they can't, and they can't enter 3 lines of text for instance.",
                    "label": 0
                },
                {
                    "sent": "So in the transcribe process we hope to get those you know.",
                    "label": 0
                },
                {
                    "sent": "First errors out, but of course there will always be errors.",
                    "label": 0
                },
                {
                    "sent": "Hours in there you can't, yeah.",
                    "label": 0
                },
                {
                    "sent": "Thank you, do we have more questions here?",
                    "label": 0
                },
                {
                    "sent": "No, I was just wondering how we can use this for language teaching.",
                    "label": 0
                },
                {
                    "sent": "May be scanned documents in a PDF marking various grammars, grammar, various mistakes, stylistics or grammar or vocabulary.",
                    "label": 0
                },
                {
                    "sent": "Note by correcting, but only to mark.",
                    "label": 0
                },
                {
                    "sent": "This is a grammatical mistake.",
                    "label": 0
                },
                {
                    "sent": "This is a vocabulary mistake.",
                    "label": 0
                },
                {
                    "sent": "This stylistic mistake.",
                    "label": 0
                },
                {
                    "sent": "I was just brainstorming while you were presenting how that could be adapted to scan documents.",
                    "label": 0
                },
                {
                    "sent": "At least.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think it's very important we have looked at just doing transcribing.",
                    "label": 0
                },
                {
                    "sent": "But when we saw scribe, I think some people, just, you know, you don't have to do both.",
                    "label": 0
                },
                {
                    "sent": "So people really just like to draw the boxes and they don't like to, you know it's a bit more complicated transcribing it.",
                    "label": 0
                },
                {
                    "sent": "You have a bit more.",
                    "label": 0
                },
                {
                    "sent": "You have to go through a longer tutorial for instance, so it helps with different tasks.",
                    "label": 0
                },
                {
                    "sent": "You give people some people just like, you know, identify, and then you know go through it quite quickly, while others want to really be involved and see OK. What is the date and like that kind of puzzling.",
                    "label": 0
                },
                {
                    "sent": "So I think for language you can.",
                    "label": 0
                },
                {
                    "sent": "You know instead of asking them just to transcribe or just you know type in what they see you can you can have.",
                    "label": 0
                },
                {
                    "sent": "First step that is may be fun for the reason why I was thinking about the PDF scanned documents was because not everyone is killed in typing.",
                    "label": 0
                },
                {
                    "sent": "Some people take a long time to type a text or document.",
                    "label": 0
                },
                {
                    "sent": "Some people just write it by hands and scan it and put it up, upload it to the crowd and wait for feedback.",
                    "label": 0
                },
                {
                    "sent": "So that's from me, that's my commander.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much everyone.",
                    "label": 1
                },
                {
                    "sent": "For for listening.",
                    "label": 0
                },
                {
                    "sent": "And now we would like to welcome the next speaker.",
                    "label": 0
                }
            ]
        }
    }
}