{
    "id": "mcgt7nxwzox25nqjzeofqs4z3spmqncb",
    "title": "Automatic Modeling of User's Real World Activities from the Web for Semantic IR",
    "info": {
        "author": [
            "Yusuke Fukazawa, NTT DOCOMO, Inc."
        ],
        "published": "May 17, 2010",
        "recorded": "April 2010",
        "category": [
            "Top->Computer Science->Semantic Search"
        ]
    },
    "url": "http://videolectures.net/www2010_fukazawa_amu/",
    "segmentation": [
        [
            "OK, so I suggest we get started.",
            "Our first paper in this session is an automatic modeling of users real world activities from the web for Semantic IR, and it's going to be presented by Yusuke for Cassava.",
            "Thanks so much.",
            "Hello my name is use gift card so I'm coming from Japan.",
            "I'm working at the empty docomo.",
            "This is a mobile telephone company at Japan, so the title and presentation here is a automatic modeling of users.",
            "We're TTS from the web for the."
        ],
        [
            "Semantic layer, so I'm going to talk about introduction of what task, model based semantic iron and then going to talk about possible approaches to automatic modeling of task model and then more specific topics.",
            "I'll talk about occasional here creation ship between the tasks on the experiment and then conclude this presentation."
        ],
        [
            "So we have been.",
            "Researching about the task models from the at the SABC 2005 and 2006.",
            "We consider the task model at the infrastructure of for the mobile semantic I'll because we're from the mobile telecom company, so we are very interested in users activities in outside outside.",
            "So we're going to model the other activities from the viewpoint of tasks I mean in, for example in the theme park domain, if you still want to go to the theme park.",
            "User must divide these tasks more to the more concrete tasks like.",
            "User first finds a theme park and then go to the move to the theme park and then check attractions so user can find.",
            "Bike.",
            "Concretizing the tasks to the be more concrete.",
            "Contents Mobile This is the mobile content associated with more concrete tasks.",
            "By concretizing the user request using this task, Morris user can easily find the moral contents in outside.",
            "So."
        ],
        [
            "What we have done in the past is to create the task model.",
            "Distance model is is for the movie domains.",
            "And we manually associate these content to the concrete as it looks like at first user go to the watch movie and then user must decide movie title and movie theater and you want to decide the movie title.",
            "User must check the movie story or something like this so that the user can find the.",
            "These contents by using the these dust models actually user can query like natural languages and then.",
            "Um in the servers.",
            "Um Machine gun is find the.",
            "Similar tasks and then present user to the the associated your eyes.",
            "So, but this stuff murder construct constructed by the domain expert.",
            "So, but this approach, such sacrifices from the narrow coverage and does plating the test model.",
            "So here we hear what we want to hear is to investigate the automatic modeling over users real activities from the web.",
            "Because in the web user can.",
            "Lights the Brooks were treated and inappropriate sitters.",
            "User can input their daily activities like I watched the movie with him with him or with her and I went to the same park or something like that.",
            "So we extract some these activities from the web and automatically construct the the test models."
        ],
        [
            "So in the past approaches to automatic task modeling, it's in from the structured data.",
            "It is ranked game in the game.",
            "The system asks the user to what user want to do, what you should do, what are you doing for the watching the movies and the user answers some questions.",
            "It's like sound systems or DVD or televisions or something.",
            "Let's say after that the system automatically creates the task models.",
            "To concretize or watch a movie and watch a movie and then use, I need to do something like that.",
            "So in addition to this, in from the know how side it's like this for the making of making a tea.",
            "There's some procedures to make a deal.",
            "It's like your default or for some photo waters at Miracle something like this is on the web, so actually by extracting, analyzing these datas and then construct task models.",
            "This was done in the past and from the unstructured data.",
            "It's from the land.",
            "Don't axiomatics relationships between the two concepts in the medical domain.",
            "It's like high sodium diet is associated with hypertension, is associated with hypertension is it's like a task so.",
            "But what they did not is they did not focus on automatic addition.",
            "Over here, correlation ships between activities.",
            "So here we want to extract the hero creation ships between activities."
        ],
        [
            "So I'll talk about the right way task model.",
            "What I want to extract from the web.",
            "The definition of the regulators model.",
            "There are three concepts, domain and parent tasks.",
            "I'm sure that our tasks from task is very abstract.",
            "Tasks answer taxes, more concrete tasks associated with the printers, but in the parenthesis there's a.",
            "Tasks associated with the domain.",
            "It's like watch a movie or make a movie or something result Inotera task.",
            "There's a more concrete test concretizing by the the tasks current tasks.",
            "There's a series processes to automatic modeling, but first we need to process extract parent tasks and then I extract the talent activities from the web and then after that I created the children tasks different tasks.",
            "It's so press 1.",
            "Press it down by in the past so I just talk about the processor in this."
        ],
        [
            "Presentations.",
            "So there's very few minutes, so I skip this."
        ],
        [
            "So in the process 3.",
            "The problem here is the.",
            "What is the?",
            "Which one is more appropriate.",
            "Parent asks for the Bible by movie chairs.",
            "In a human you can easily understand which is the.",
            "Best match the parent asks.",
            "In this case, what movie is best match to buy movie tickets?",
            "Comparing to the make the movies, so how the machine can learn or extract?",
            "The relationships between the watch, movie and buy movie tickets from the web.",
            "That's what I want to hear.",
            "Do here, so the idea simply applying the idea of the PMI RPM R means.",
            "There is a method to calculate the semantic distance between the two concepts, it's like.",
            "The.",
            "Equation is like this.",
            "It's very easy to understand.",
            "I think there's a concept and concept beyond that.",
            "Semantic distance can be measured by the by.",
            "This equations hit means some what?",
            "Googles.",
            "Number of the search results.",
            "So it's very easy to understand so, but.",
            "Then applying this idea.",
            "You can easily apply this idea by input.",
            "Watch a movie and maybe we get to the A&B so it's very easy."
        ],
        [
            "But there's other problems with this.",
            "This table shows a combination of Saturday task, children, tasks and fantastic green area shows, children, tasks and precious.",
            "Current tasks.",
            "In the in the green area, in the right side.",
            "In the left side there is the same.",
            "Description of the children tasks it's for example in the movie.",
            "Tickets is exactly the same.",
            "Same description in the web, but in the middle there's a semantically similar descriptions.",
            "Is like buy tickets of the matrix or Get movie tickets and then left side in the right side.",
            "Sorry there's a similar distribution but very different activities.",
            "It's like buy drink Sarah movie ticket or something like that.",
            "So what we want to hear is what in the past approaches just capture the top left.",
            "Fine, only the top left side and there's a very few because you can easily understand that this idea because Google search, result viral midgets and watch movie is very little.",
            "Is one or two or three or something like that, so this equation cannot be calculated easy, so.",
            "This area is very small."
        ],
        [
            "So the idea combination of hair color relationships this area because there's a similar discussion with a similar similar activities with similar descriptions.",
            "It means assignment semantics.",
            "Similar activities is areas it's like buy movie ticket value by scattered matrix, it's it's.",
            "We can understand this.",
            "This activity is very similar to the activities or buy movie tickets, so we want to capture these similar description or of similar activities as the the The Children Task or Parent ASK.",
            "So this area we what we want to capture here is to this area."
        ],
        [
            "However, there is a problem.",
            "There's a big.",
            "Semantically, big difference between the these activities cause by drink and drive it scattered.",
            "The matrix is very different but we.",
            "We can understand easily the difference, but in the system for the system.",
            "This difference cannot be easily understood because in in the description.",
            "There's a birthday Christian has pottery has the same.",
            "No above of the of the target tasks.",
            "It's like for the buy movie tickets by which gets invited over metrics.",
            "its IT looks similar but which gets on by drink it's it's like she may have got both of them have their bye.",
            "It it also says that it can be said also in the Bible, which gets an get movie ticket is it tracks a man?",
            "Bourbon, which gets on the ceremonies get it's it's like same, but because both of them have the same known the movie tickets so.",
            "The system cannot be understood.",
            "The difference between them."
        ],
        [
            "So what?",
            "We our approach is to we don't directly tell the difference between them.",
            "We just investigate the influence of the different activities.",
            "With similar description to calculate here correlation ship.",
            "So we make three patents Minnesota permit to include different distinctions of different activities.",
            "Of certain tasks and missiles, Syrian without phone is exactly I. I will describe more detail about this in."
        ],
        [
            "Next section.",
            "It's like in a mess 02.",
            "We include these different activities with similar description and how the noisy data is is influenced.",
            "The calculation on the PM IR.",
            "In order to include this right side area.",
            "We just divide the student asked into the non prod and prod prod.",
            "It's like information.",
            "Xi'an means the children own part of the children, tasks unknown part of the above tasks.",
            "And then.",
            "We calculate it like the PMI is it's.",
            "It's like this.",
            "How to introduce this equation is in a paper, so if you're interested in the receipt papers on this PMICNB, is it you can calculate its like movie tickets and watch movie because no part of children task is the movie tickets.",
            "So we can extract from me by the group.",
            "The same month your my CBB.",
            "It's like this.",
            "So."
        ],
        [
            "Message 3 it's like this.",
            "In this case the parent asks.",
            "Is divided to the non fault on Barbara?",
            "And then calculate it.",
            "By using the equations interact information, P functional tasks of the known part and part of the.",
            "Parent note."
        ],
        [
            "Just.",
            "And finally we divide all the old tasks into the known pattern buttons and calculate PMI using this."
        ],
        [
            "So the expenses setup compared methods 124 by year of the predicting the parent tasks of target children tasks.",
            "The correct order children task involves movie and book domains.",
            "And to synchronize problem which is a few parent asks candidates as far as look domain.",
            "Cool, alright book on in the movie domain.",
            "Watch a movie or make movies."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I suggest we get started.",
                    "label": 0
                },
                {
                    "sent": "Our first paper in this session is an automatic modeling of users real world activities from the web for Semantic IR, and it's going to be presented by Yusuke for Cassava.",
                    "label": 1
                },
                {
                    "sent": "Thanks so much.",
                    "label": 0
                },
                {
                    "sent": "Hello my name is use gift card so I'm coming from Japan.",
                    "label": 0
                },
                {
                    "sent": "I'm working at the empty docomo.",
                    "label": 0
                },
                {
                    "sent": "This is a mobile telephone company at Japan, so the title and presentation here is a automatic modeling of users.",
                    "label": 0
                },
                {
                    "sent": "We're TTS from the web for the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Semantic layer, so I'm going to talk about introduction of what task, model based semantic iron and then going to talk about possible approaches to automatic modeling of task model and then more specific topics.",
                    "label": 0
                },
                {
                    "sent": "I'll talk about occasional here creation ship between the tasks on the experiment and then conclude this presentation.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have been.",
                    "label": 0
                },
                {
                    "sent": "Researching about the task models from the at the SABC 2005 and 2006.",
                    "label": 0
                },
                {
                    "sent": "We consider the task model at the infrastructure of for the mobile semantic I'll because we're from the mobile telecom company, so we are very interested in users activities in outside outside.",
                    "label": 0
                },
                {
                    "sent": "So we're going to model the other activities from the viewpoint of tasks I mean in, for example in the theme park domain, if you still want to go to the theme park.",
                    "label": 1
                },
                {
                    "sent": "User must divide these tasks more to the more concrete tasks like.",
                    "label": 0
                },
                {
                    "sent": "User first finds a theme park and then go to the move to the theme park and then check attractions so user can find.",
                    "label": 1
                },
                {
                    "sent": "Bike.",
                    "label": 0
                },
                {
                    "sent": "Concretizing the tasks to the be more concrete.",
                    "label": 0
                },
                {
                    "sent": "Contents Mobile This is the mobile content associated with more concrete tasks.",
                    "label": 0
                },
                {
                    "sent": "By concretizing the user request using this task, Morris user can easily find the moral contents in outside.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we have done in the past is to create the task model.",
                    "label": 0
                },
                {
                    "sent": "Distance model is is for the movie domains.",
                    "label": 0
                },
                {
                    "sent": "And we manually associate these content to the concrete as it looks like at first user go to the watch movie and then user must decide movie title and movie theater and you want to decide the movie title.",
                    "label": 0
                },
                {
                    "sent": "User must check the movie story or something like this so that the user can find the.",
                    "label": 0
                },
                {
                    "sent": "These contents by using the these dust models actually user can query like natural languages and then.",
                    "label": 0
                },
                {
                    "sent": "Um in the servers.",
                    "label": 0
                },
                {
                    "sent": "Um Machine gun is find the.",
                    "label": 0
                },
                {
                    "sent": "Similar tasks and then present user to the the associated your eyes.",
                    "label": 0
                },
                {
                    "sent": "So, but this stuff murder construct constructed by the domain expert.",
                    "label": 0
                },
                {
                    "sent": "So, but this approach, such sacrifices from the narrow coverage and does plating the test model.",
                    "label": 1
                },
                {
                    "sent": "So here we hear what we want to hear is to investigate the automatic modeling over users real activities from the web.",
                    "label": 1
                },
                {
                    "sent": "Because in the web user can.",
                    "label": 0
                },
                {
                    "sent": "Lights the Brooks were treated and inappropriate sitters.",
                    "label": 0
                },
                {
                    "sent": "User can input their daily activities like I watched the movie with him with him or with her and I went to the same park or something like that.",
                    "label": 0
                },
                {
                    "sent": "So we extract some these activities from the web and automatically construct the the test models.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the past approaches to automatic task modeling, it's in from the structured data.",
                    "label": 1
                },
                {
                    "sent": "It is ranked game in the game.",
                    "label": 0
                },
                {
                    "sent": "The system asks the user to what user want to do, what you should do, what are you doing for the watching the movies and the user answers some questions.",
                    "label": 0
                },
                {
                    "sent": "It's like sound systems or DVD or televisions or something.",
                    "label": 0
                },
                {
                    "sent": "Let's say after that the system automatically creates the task models.",
                    "label": 0
                },
                {
                    "sent": "To concretize or watch a movie and watch a movie and then use, I need to do something like that.",
                    "label": 0
                },
                {
                    "sent": "So in addition to this, in from the know how side it's like this for the making of making a tea.",
                    "label": 0
                },
                {
                    "sent": "There's some procedures to make a deal.",
                    "label": 0
                },
                {
                    "sent": "It's like your default or for some photo waters at Miracle something like this is on the web, so actually by extracting, analyzing these datas and then construct task models.",
                    "label": 0
                },
                {
                    "sent": "This was done in the past and from the unstructured data.",
                    "label": 0
                },
                {
                    "sent": "It's from the land.",
                    "label": 1
                },
                {
                    "sent": "Don't axiomatics relationships between the two concepts in the medical domain.",
                    "label": 0
                },
                {
                    "sent": "It's like high sodium diet is associated with hypertension, is associated with hypertension is it's like a task so.",
                    "label": 1
                },
                {
                    "sent": "But what they did not is they did not focus on automatic addition.",
                    "label": 1
                },
                {
                    "sent": "Over here, correlation ships between activities.",
                    "label": 0
                },
                {
                    "sent": "So here we want to extract the hero creation ships between activities.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'll talk about the right way task model.",
                    "label": 0
                },
                {
                    "sent": "What I want to extract from the web.",
                    "label": 1
                },
                {
                    "sent": "The definition of the regulators model.",
                    "label": 1
                },
                {
                    "sent": "There are three concepts, domain and parent tasks.",
                    "label": 0
                },
                {
                    "sent": "I'm sure that our tasks from task is very abstract.",
                    "label": 0
                },
                {
                    "sent": "Tasks answer taxes, more concrete tasks associated with the printers, but in the parenthesis there's a.",
                    "label": 0
                },
                {
                    "sent": "Tasks associated with the domain.",
                    "label": 0
                },
                {
                    "sent": "It's like watch a movie or make a movie or something result Inotera task.",
                    "label": 0
                },
                {
                    "sent": "There's a more concrete test concretizing by the the tasks current tasks.",
                    "label": 0
                },
                {
                    "sent": "There's a series processes to automatic modeling, but first we need to process extract parent tasks and then I extract the talent activities from the web and then after that I created the children tasks different tasks.",
                    "label": 1
                },
                {
                    "sent": "It's so press 1.",
                    "label": 0
                },
                {
                    "sent": "Press it down by in the past so I just talk about the processor in this.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Presentations.",
                    "label": 0
                },
                {
                    "sent": "So there's very few minutes, so I skip this.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the process 3.",
                    "label": 1
                },
                {
                    "sent": "The problem here is the.",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "Which one is more appropriate.",
                    "label": 0
                },
                {
                    "sent": "Parent asks for the Bible by movie chairs.",
                    "label": 0
                },
                {
                    "sent": "In a human you can easily understand which is the.",
                    "label": 0
                },
                {
                    "sent": "Best match the parent asks.",
                    "label": 0
                },
                {
                    "sent": "In this case, what movie is best match to buy movie tickets?",
                    "label": 0
                },
                {
                    "sent": "Comparing to the make the movies, so how the machine can learn or extract?",
                    "label": 0
                },
                {
                    "sent": "The relationships between the watch, movie and buy movie tickets from the web.",
                    "label": 1
                },
                {
                    "sent": "That's what I want to hear.",
                    "label": 0
                },
                {
                    "sent": "Do here, so the idea simply applying the idea of the PMI RPM R means.",
                    "label": 1
                },
                {
                    "sent": "There is a method to calculate the semantic distance between the two concepts, it's like.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Equation is like this.",
                    "label": 0
                },
                {
                    "sent": "It's very easy to understand.",
                    "label": 0
                },
                {
                    "sent": "I think there's a concept and concept beyond that.",
                    "label": 0
                },
                {
                    "sent": "Semantic distance can be measured by the by.",
                    "label": 0
                },
                {
                    "sent": "This equations hit means some what?",
                    "label": 0
                },
                {
                    "sent": "Googles.",
                    "label": 0
                },
                {
                    "sent": "Number of the search results.",
                    "label": 0
                },
                {
                    "sent": "So it's very easy to understand so, but.",
                    "label": 0
                },
                {
                    "sent": "Then applying this idea.",
                    "label": 0
                },
                {
                    "sent": "You can easily apply this idea by input.",
                    "label": 0
                },
                {
                    "sent": "Watch a movie and maybe we get to the A&B so it's very easy.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But there's other problems with this.",
                    "label": 0
                },
                {
                    "sent": "This table shows a combination of Saturday task, children, tasks and fantastic green area shows, children, tasks and precious.",
                    "label": 0
                },
                {
                    "sent": "Current tasks.",
                    "label": 0
                },
                {
                    "sent": "In the in the green area, in the right side.",
                    "label": 0
                },
                {
                    "sent": "In the left side there is the same.",
                    "label": 0
                },
                {
                    "sent": "Description of the children tasks it's for example in the movie.",
                    "label": 0
                },
                {
                    "sent": "Tickets is exactly the same.",
                    "label": 1
                },
                {
                    "sent": "Same description in the web, but in the middle there's a semantically similar descriptions.",
                    "label": 0
                },
                {
                    "sent": "Is like buy tickets of the matrix or Get movie tickets and then left side in the right side.",
                    "label": 1
                },
                {
                    "sent": "Sorry there's a similar distribution but very different activities.",
                    "label": 0
                },
                {
                    "sent": "It's like buy drink Sarah movie ticket or something like that.",
                    "label": 0
                },
                {
                    "sent": "So what we want to hear is what in the past approaches just capture the top left.",
                    "label": 0
                },
                {
                    "sent": "Fine, only the top left side and there's a very few because you can easily understand that this idea because Google search, result viral midgets and watch movie is very little.",
                    "label": 0
                },
                {
                    "sent": "Is one or two or three or something like that, so this equation cannot be calculated easy, so.",
                    "label": 0
                },
                {
                    "sent": "This area is very small.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea combination of hair color relationships this area because there's a similar discussion with a similar similar activities with similar descriptions.",
                    "label": 1
                },
                {
                    "sent": "It means assignment semantics.",
                    "label": 1
                },
                {
                    "sent": "Similar activities is areas it's like buy movie ticket value by scattered matrix, it's it's.",
                    "label": 0
                },
                {
                    "sent": "We can understand this.",
                    "label": 0
                },
                {
                    "sent": "This activity is very similar to the activities or buy movie tickets, so we want to capture these similar description or of similar activities as the the The Children Task or Parent ASK.",
                    "label": 1
                },
                {
                    "sent": "So this area we what we want to capture here is to this area.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "However, there is a problem.",
                    "label": 0
                },
                {
                    "sent": "There's a big.",
                    "label": 0
                },
                {
                    "sent": "Semantically, big difference between the these activities cause by drink and drive it scattered.",
                    "label": 1
                },
                {
                    "sent": "The matrix is very different but we.",
                    "label": 0
                },
                {
                    "sent": "We can understand easily the difference, but in the system for the system.",
                    "label": 1
                },
                {
                    "sent": "This difference cannot be easily understood because in in the description.",
                    "label": 0
                },
                {
                    "sent": "There's a birthday Christian has pottery has the same.",
                    "label": 1
                },
                {
                    "sent": "No above of the of the target tasks.",
                    "label": 0
                },
                {
                    "sent": "It's like for the buy movie tickets by which gets invited over metrics.",
                    "label": 1
                },
                {
                    "sent": "its IT looks similar but which gets on by drink it's it's like she may have got both of them have their bye.",
                    "label": 1
                },
                {
                    "sent": "It it also says that it can be said also in the Bible, which gets an get movie ticket is it tracks a man?",
                    "label": 0
                },
                {
                    "sent": "Bourbon, which gets on the ceremonies get it's it's like same, but because both of them have the same known the movie tickets so.",
                    "label": 1
                },
                {
                    "sent": "The system cannot be understood.",
                    "label": 0
                },
                {
                    "sent": "The difference between them.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what?",
                    "label": 0
                },
                {
                    "sent": "We our approach is to we don't directly tell the difference between them.",
                    "label": 1
                },
                {
                    "sent": "We just investigate the influence of the different activities.",
                    "label": 0
                },
                {
                    "sent": "With similar description to calculate here correlation ship.",
                    "label": 0
                },
                {
                    "sent": "So we make three patents Minnesota permit to include different distinctions of different activities.",
                    "label": 1
                },
                {
                    "sent": "Of certain tasks and missiles, Syrian without phone is exactly I. I will describe more detail about this in.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next section.",
                    "label": 0
                },
                {
                    "sent": "It's like in a mess 02.",
                    "label": 0
                },
                {
                    "sent": "We include these different activities with similar description and how the noisy data is is influenced.",
                    "label": 1
                },
                {
                    "sent": "The calculation on the PM IR.",
                    "label": 0
                },
                {
                    "sent": "In order to include this right side area.",
                    "label": 0
                },
                {
                    "sent": "We just divide the student asked into the non prod and prod prod.",
                    "label": 0
                },
                {
                    "sent": "It's like information.",
                    "label": 0
                },
                {
                    "sent": "Xi'an means the children own part of the children, tasks unknown part of the above tasks.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "We calculate it like the PMI is it's.",
                    "label": 0
                },
                {
                    "sent": "It's like this.",
                    "label": 1
                },
                {
                    "sent": "How to introduce this equation is in a paper, so if you're interested in the receipt papers on this PMICNB, is it you can calculate its like movie tickets and watch movie because no part of children task is the movie tickets.",
                    "label": 1
                },
                {
                    "sent": "So we can extract from me by the group.",
                    "label": 0
                },
                {
                    "sent": "The same month your my CBB.",
                    "label": 0
                },
                {
                    "sent": "It's like this.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Message 3 it's like this.",
                    "label": 0
                },
                {
                    "sent": "In this case the parent asks.",
                    "label": 0
                },
                {
                    "sent": "Is divided to the non fault on Barbara?",
                    "label": 0
                },
                {
                    "sent": "And then calculate it.",
                    "label": 0
                },
                {
                    "sent": "By using the equations interact information, P functional tasks of the known part and part of the.",
                    "label": 0
                },
                {
                    "sent": "Parent note.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just.",
                    "label": 0
                },
                {
                    "sent": "And finally we divide all the old tasks into the known pattern buttons and calculate PMI using this.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the expenses setup compared methods 124 by year of the predicting the parent tasks of target children tasks.",
                    "label": 0
                },
                {
                    "sent": "The correct order children task involves movie and book domains.",
                    "label": 1
                },
                {
                    "sent": "And to synchronize problem which is a few parent asks candidates as far as look domain.",
                    "label": 1
                },
                {
                    "sent": "Cool, alright book on in the movie domain.",
                    "label": 0
                },
                {
                    "sent": "Watch a movie or make movies.",
                    "label": 0
                }
            ]
        }
    }
}