{
    "id": "mdszj7tjuqanmwul2rkfc67ehx3tj6og",
    "title": "Moddeling and analysis of user behavior in online communities",
    "info": {
        "author": [
            "Matthew Rowe, School of Computing and Communications, Lancaster University"
        ],
        "published": "Nov. 25, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Social Computing"
        ]
    },
    "url": "http://videolectures.net/iswc2011_rowe_communities/",
    "segmentation": [
        [
            "And yes, so I'm a few row and today I'm going to present work they've done in collaboration with Sophia.",
            "I'm glad too, and Harry Fellani, also from Kmart, and this works about modeling and analysis of user behavior in online."
        ],
        [
            "It is so.",
            "When you think about online communities but now providing very useful resource people to talk, discuss ideas and come up with new concepts in a collaborative environment ever also used for customer support?",
            "So it might be that you're like a company officer product and you want to provide like a support service.",
            "So by providing Community users can describe the problem by having an acuity can be used to resolve such problems and managing and hosting communities so can be expensive and time consuming.",
            "So the moderators and the host the Community have to invest a lot of time and awesome money into supporting these communities.",
            "So given these large investments, it's essential that such communities flourish, remain active.",
            "In essence, they need to remain healthy."
        ],
        [
            "OK, so if you look at an example of a community this is 1 forum taken from balls dying.",
            "So Paul studies a Irish Community message board and if you look here, receive overtime, there's an increase in activity that's going on in in the forum, so be interested to know what's the Community look like at this point here.",
            "What's the characteristics in the dynamics of the community that actually led to this increase in activity overtime Conversely?"
        ],
        [
            "We can also look at another community, so this is a David Hasselhoff community from Balls Daddy and what we find here is this large peak or spiking activity.",
            "And then it gradually decrease overtime.",
            "So Conversely we can try and look and see.",
            "What actually happened to this community wide?",
            "It become increasingly inactive overtime."
        ],
        [
            "So this brings on to this notion of health and how we can try engager.",
            "So existing existing work looks at some basic measures like post count.",
            "So what's the actual activity in Community use accounts?",
            "How many?",
            "How many users are actually participating and also interaction and communication?",
            "So this notion that if the communities remaining healthy, there's a lot of interaction going on and people are communicating, communicating with one another.",
            "We can also look at behavior.",
            "So the notion that our people behaving in a way.",
            "That resembles like a healthy communities where we can gauge this and what we found when we look for through the literature, there's some early work by Jenny Preece around about 2000 and the first thing that she found was that domination of 1 type of behavior in online community can lead to churn, sojourners, notion that you will leave the community, and this is quite a big problem for Community operates because they don't want to have people leaving water invest a lot of money in, and she also found their behavior in online communities also influenced by the roles for user shoot.",
            "So it might be that.",
            "You start interacting their community and a certain roles or certain people in that community who influenced how you behave, and overtime it changes the dynamics of the Community.",
            "So if once provides some health insights needs, filter monitors behavior every time and then combine it with some basic so health metrics like post count for example, and this would give us some way that we can actually track to see how the Community is actually changing and evolving over."
        ],
        [
            "I'm so in order support Community owners, we need to use four steps.",
            "So first of all we need to monitor and capture member activities.",
            "We need to know what actions are actually going on the community.",
            "How would people interacting and what are they doing then we can try and analyze emerging behavior overtime so you can try and understand how those actions correlate with certain behavior.",
            "But after that we can try and we can look at the correlation between behaving community evolution.",
            "So we get a notion of how if certain behavior exists.",
            "In the community, then it's likely to evolve in this with certain way and then after that we can learn when to intervene to influence the Community is going back to early example of where the Community's health or the activity diminished overtime would be interested in.",
            "We could actually understand what she calls that and learn when to intervene to stop it from occurring."
        ],
        [
            "So in this paper, going to look at the first of these three tasks, right so the monitoring be analysis and then trying to gain some understanding of the correlation between behavior and how community evolves."
        ],
        [
            "So there's three contributions in our paper free main ones, so the first one is we're going to be providing ontologies, model, behavior, roles.",
            "This allows us to capture behavior overtime in different contexts.",
            "Then we can infer the users roles in online communities, and for this we use semantic rule based method, and then after that we provide some analysis of Community health through this role composition, so we're able to actually identify behavior and correlated out of activity overtime and understand the patterns which exists in these communities with analyze."
        ],
        [
            "So in this talk I'm going to go through these various stages.",
            "1st I'm going to present the ontology, but I'm going to go for the features we've used to capture this behavior.",
            "Now I'm going to explain the community roles that we've we've derived from the literature and then presenting approach for how we can actually analyze this behavior, construct some semantic rules which you can then use to label uses with the roles they having.",
            "Communities.",
            "Then after that provide some analysis of community health and how we can predict it, and the findings from this work."
        ],
        [
            "OK, so moving on the 1st first piece work amounts presented this ontology.",
            "So what this allows us to do an?",
            "We extended shock in this case.",
            "So what allows us to do is to actually save a user account.",
            "So this thing that's in red here is a member of the Community, so use as a member of the Community.",
            "We can extend shock and use it for that.",
            "We can also say that users participate in this forum here because they're making a post which isn't afraid.",
            "So we have a link between the user and the community in which are interacting.",
            "And then after that we have this notion of a time frame.",
            "So what we can do is we can capture the user's behavior in this community over time and then from this we can drive a roll and anything about this is it allows us to actually say that a user can have multiple roles in multiple communities in given context.",
            "So it might be that at one time frame I have.",
            "I assume this one behaviour role and then next time frame we've got a different one.",
            "And also it might be at the same time frame.",
            "I've got different roles in different communities."
        ],
        [
            "For our features, we can we have the 7 features here and this allows us to actually describe the behavior or how the users participating interacting in the Community.",
            "So for the first one for indegree ratio, this measures the proportion of users are given users interacted with in the Community, so it's a bit like sort of like concentration of participation, so if this is high it means that the user is interacting with a lot of users in the Community, whereas if it's low but more likely to interact with smaller cliques and then supposed replied ratio.",
            "So this measures the popularity of the user in the Community.",
            "This how many posts where I posted that get a reply.",
            "Then you got friend initiation ratio.",
            "Is this proportion of threads that have been started in the community that that have been started by the user and this allows us to gauge the extent to which users actually initiating and driving sort of activity in the Community.",
            "But in BI directional threads ratio.",
            "So this is the level of reciprocity that occurs in threads that user participates in.",
            "So this is that if I make a post.",
            "And somebody replies to me.",
            "I replied to that user, not designates a reciprocal action.",
            "From this we can actually gauge to what extent interactions taking place with users and then BI directional neighbors ratio again.",
            "Another measure of reciprocity and average posts per thread.",
            "This measures the level of discussion that's going on in the Community, so this is high.",
            "It basically means that the users engaging in quite high activity threads, so it's more conversation driven.",
            "And then we got standard deviation of post for Fred.",
            "This measures for distribution.",
            "As the average posts per thread measure."
        ],
        [
            "So based on this, we then wanted to look at some Community role.",
            "So could we actually?",
            "Take behavior that use exhibit an actually come up with some discrete labels that could be that could be used to describe those service users.",
            "So in Jeffrey Chan's paper, along with his colleagues in 2010 the websites conference, he came with a distinct roles which message boards users exhibit right?",
            "So what we doing for each one of these in?",
            "Five days in the in grace details give you an idea of what they are, so I'm trying to do is we're trying to take pictures from popular culture to try and link these roles.",
            "So give you some grounding right, so bear with me."
        ],
        [
            "Right, elitist right?",
            "Do you know who this is?",
            "Who you see people are you should do right.",
            "So will lead to people who they interact in certain cliques, right?",
            "So video really in the community.",
            "They get a lot of sort of BI directional threads.",
            "Those levels of reciprocity going on, but they only interact with certain cliques without having a high indegree ratio."
        ],
        [
            "When he got joining conversation list right?",
            "So it might be that like discussions are going on and this person will actually sort of chip in and sort of discuss there not too bothered about initiating or starting discussions.",
            "They just want to sort of join in and get a conversation going discussion."
        ],
        [
            "And the third one is popular initiator, so you know this guy is.",
            "Yeah, some people do right.",
            "OK, so is Bill O'Reilly.",
            "He's like an Anchorman for Fox News and he's well known for sort of winding people up instead of getting a discussion going and sort of initiating.",
            "So in this case, Bill's role in the community would be more aligned with.",
            "He just wants to start discussions getting stuff going.",
            "He's not too bothered about sort of conversation."
        ],
        [
            "Afterwards and he got popular participant so popular participant has a fairly high indegree ratio and medium statistics everything else, so this is like they contribute and they might initiate discussions.",
            "But whenever they do contribute to community they get a lot of feedback.",
            "They have quite high in."
        ],
        [
            "Three right?",
            "And then we got technology users.",
            "So largely what happens with technology uses the they interact, but whenever they post something, they just ignore that don't get a reply when they try and post like afraid to get something started, nothing happens."
        ],
        [
            "So based on these eight rolls were able to do was we analyze the literature and came up with the features that resemble these roles and what we're able to do is variable to attach a feature with a level.",
            "So a level is either low, medium or high, and based on this we can say, but an elitist should have a low in degree ratio 'cause they don't participate.",
            "Many people they participate in cliques.",
            "Which of the high bidirectional threads ratio?",
            "Because a lot of the content they do.",
            "Interactive gets replies.",
            "Lot of reciprocal actions going on within that clique.",
            "Also, there's a low BI directional neighbors ratio as well.",
            "So based on this we have what we call our Skelton rule base right, and this provides a link for each role between a feature and a level, and from this week and then derive some rules we can use actually classify the useless by the roll."
        ],
        [
            "So to do this, we have this four stage approach, so we take a bunch of users and given time, time step and first of all we construct the features for them.",
            "So we construct the social network features this reciprocity features and the participation features that went through before and then after that we derive bins so.",
            "But driving bins were able to actually dynamically generate these rule.",
            "These levels given time step, so it might be that the actual distribution of the feature shifts between time steps, so that direct by just driving these bins we can get this cut off point for what is low.",
            "The cut off points.",
            "What is medium and a cut off points?",
            "What is high and basic?",
            "Basically after that we can compile our rule base because we are Skelton rules and we have these these levels and then after this we can then apply the rules to the user and this gives us nice community composition at given time step."
        ],
        [
            "So how do we actually apply these rules?",
            "So, in essence, our rules are just sparkle construct queries, but we use PIN functions within there to actually derive the type of the role that users should."
        ],
        [
            "So this part in the where clause.",
            "Here is a spin function and it's basically saying that this user here that's designated by this variable.",
            "This get me the role type for this user has right?",
            "So because all our data is created using this ontology, we have this link between the user and the behavior Dave exhibited at a given time step and we run this classifier.",
            "Basically this small spin function and it basically returns this type here, which is most relevant to the user given their features.",
            "Alright, so.",
            "If you want to know more, you can have look at spin here and it explains how these functions work."
        ],
        [
            "And then the second second part of this where clause and she says right K give me ur eye of this role type."
        ],
        [
            "And from this I can then start assigning the user.",
            "I can construct a link between the user and the role I have and the nice thing about this is that we have this user here and he has a role.",
            "But there's also a context which is a scientist role, right?",
            "So going back to our previous ontology that was describing using this method, it means that a user can have multiple roles in different contexts.",
            "This could be that they have a different role at different times in the same community, but it also could have different roles in different communities at the same time.",
            "Is important because what what you behavior exhibit at 1 one time step or in one community.",
            "One context will differ from another and this allows us to."
        ],
        [
            "Capture it.",
            "So what can we do with this approach?",
            "So the initial thing wants to look at is, can we actually analyze community health?",
            "Can we actually answer this question?",
            "How is Community role composition associative activity?",
            "So to do this we took the bus a Irish Community message board.",
            "We were provided the full data set, but we just looked at a subset of it.",
            "So we looked all post from 2000 four 2006 and provide some qualitative analysis.",
            "We just wanted to look at free forums with different sort of levels activity.",
            "So we just looked at commuting in transport, which discuss is obviously travel and that sort of thing, and so rugby and we looked at mobile phones and PDAs, so each one of these forms gives a different topic.",
            "We can analyze.",
            "What we do is we then measured at 12 equal increments this role composition and also the number of posts.",
            "So role composition is the percentage of users who take on a specific role, so might be to a given time step is 20% elitist.",
            "The 10% grunts so and so forth.",
            "And also we got number of posts.",
            "What we can do from this is we can then correlate to see how this composition matches against this activity, and we can learn what patterns are existing so."
        ],
        [
            "First of all, I'm just going to show you a cicarella Graham's basically shows what's going on in Form 246, so the way to read this is along the diagonal.",
            "Here we have the roll labels and in the bottom right corner we've got the posts and what you want to do is you want to basically look at this line here to see how posts are correlated with these different roles, and so basically the way to read this also is that these pie charts indicate the level of correlation that's going on between these two variables, right?",
            "So if it's a full circle and it's blue, it means a positive correlation of 1.",
            "Is full circle and it's red.",
            "It means there's a negative correlation of 1.",
            "So what we can we can?",
            "What we see here is that elitists.",
            "When we look at this pie chart here, an elitist is correlated with post such for an increase in elitist would equate to an increase increase in post right?",
            "So that role in this community is actually associated with an increase in activity.",
            "I'm not saying it causes it, but it's correlated with its associated with it.",
            "And also we find that popular participants as well as associated with an increase in post counts.",
            "So we're trying to see how this like this behavior is actually associated with increasing activity in the Community.",
            "Conversely, we also find that an increased ignored users actually affects the activity community by decreasing.",
            "So is this negative Association going on there?",
            "And the same for taxi turns here.",
            "So tax returns are users.",
            "I didn't explain this role before, but taxed entities who oppose very infrequently, so they might post once or twice.",
            "So an increase in that type of user associated with.",
            "A decrease in post."
        ],
        [
            "Counts.",
            "And then when we look across the frequencies, we started to see that these patterns are actually consistent, but it's also submitted.",
            "DS increases as well.",
            "So what we find is that for an ignored user is actually pretty consistently get dislike, negative correlation and we also get a positive correlation for all the elitists as well.",
            "So that one there on there that one there.",
            "But Interestingly, in commuting in transport we find that conversation listen more important than in rugby and Form 1.",
            "And also in from 4 one talking about mobile phones and PDAs, we find that there's a pretty obvious negative correlation for supporters.",
            "So in that case actually having that role in the Community seems to actually have a decreasing effect on how far is associated.",
            "But so the next piece of analysis that we wanted."
        ],
        [
            "Account was, you know, what happens overtime when we look at these compositions and the actual change in these roll percentages.",
            "And how is this associated with the actual sort of post counts going up.",
            "So the black line here is the post count overtime and in each phase of alliances percentage of the actual role roles that people assume in the Community.",
            "What we find is that around about this time step here we start to get this gradual increase in activity and we also see in the role composition is for this kind of like stability.",
            "Round about here.",
            "So earlier on we get this fluctuation and this is shown to actually sort of be associated with this sort of like not so much and not so much an increase but overtime as this reached a stable sort of composition we get this increased activity."
        ],
        [
            "And we also found this is quite consistent with Form 411 as well, so we have this increase in post count overtime and this is shown to be.",
            "Associated visibility.",
            "Whereas when we look at the rugby forum, we have this sort of fluctuation in the roles and that is shown to be associated with this fluctuation in post camp.",
            "So it's the first piece of analysis we did and it kind of showed us the roles that people assume the community knows percentages, how their associated activity.",
            "So, um."
        ],
        [
            "The next piece of analysis what we want to do is want to try and see if we can actually predict the Community health for this activity based on the role composition.",
            "So we've identified we've been able to use our rule based approach to derive this composition, but how does it actually affect what's happening in the Community house?",
            "It's actually associated with it, so the first experiment we wanted to do is try and predict either an increase or decrease in activity.",
            "So we did this once we measured at a given time step the role composition use each of those eight roles as a feature of what's going on community.",
            "When our class labels binary is either an increase or decrease in activity and then we perform 10 fold cross validation with J48 decision tree to try and predict what's going on.",
            "So this increase or decreases from the last time step web activities going up or down and in the second experiment we wanted to do was to look to try and predict the actual post count from this role composition.",
            "So for this we use regression model are independent variables with the roles and their percentages and are dependent variables.",
            "Suppose count what trying to do is look at the coefficient of determination and see how big that sort of correlation was.",
            "Prediction based on that model would be effective, so for the."
        ],
        [
            "First task for our prediction for the increase or decrease in activity.",
            "What fun performed 246 so this is the commuting and transport form.",
            "We get this fairly high F measure here, showing that we are actually able to do this prediction fairly accurately, then perform 38.",
            "We find out because this fluctuation activity, our patterns are.",
            "It was obvious and we can't do it as accurately.",
            "So what we did.",
            "Also we combined all the data together in this.",
            "All this all this all case here and what is allowed us to do is basically take all the forms but all the data together and see if there's these general patterns across was going.",
            "And what we find is that for the receiver operator characteristic curve, the area under it we get this low number, so indicates that we're not able to do this prediction very well in terms of actually detecting false positives."
        ],
        [
            "So for our second prediction task, where he wants to look at was, can we actually do this correlation?",
            "Can we actually take these roll percentages and try and predict this post count?",
            "And for this I'm just showing Form 38 here 'cause it had the highest R-squared value.",
            "This value.",
            "Here we find this fairly large correlation between or in the model being able to predict this post Council.",
            "It's fairly accurate doing that.",
            "But Interestingly what we find is that when we look at the coefficients in the model and for the variables that around the statistically significant, we find an increase in popular initiators.",
            "An increase in popular participants coupled with the decrease in supporters and ignored users.",
            "Least this increase in activity.",
            "Alright, so this is this is showing you what a an increasing activity community should contain in terms of the rolls.",
            "So if you get a forum or community where you exhibit these roles developing at this sort of this rate judged by these coefficients, you will get an increase in activity in this context."
        ],
        [
            "So I found this from this work.",
            "What we found is that active communities contain more elitist and popular participants, so we're able to save even know, elitist only interacted a small clique of users and we're still able to use that roller.",
            "That rolls actually still a good thing to have in the community, where we also found was unhealthy.",
            "Communities contain more tax returns and ignored users, which kind of like makes sense.",
            "So if the community is not not actually interacting and allowing people to kind of get responses to their questions or whatever.",
            "And get that increasing activity.",
            "We also found that it was idiosyncratic compositions as well.",
            "So getting back to what was going on in the natural prediction experiment when we looked at the coefficients in the model of those different communities, we found there was still like different behavior that was being exhibited.",
            "And we also found this table mixed composition, increased activity, overtime."
        ],
        [
            "So the future work that we have come up with.",
            "First of all, we want to look at micro level role analysis, so we've identified what's going on in the community, but is for actually user sort of like roll lifecycles that that occur, so it might be that you know you're not likely to jump from an elitist to even ignored user straight away.",
            "You probably go through this path a developing roles overtime, and can we actually identify those and another key piece of work we need to do is to identify key community users, so there might be users like those elitists or whatever that you don't want to leave because for those to churn it could actually.",
            "Affect your community activity that's going on and then also explore alternative methods for Dennis Role labeling.",
            "So although these semantic rule based method and it allows us to actually very very easily and efficiently derive these these roles for users were still missing around about 29% of the users, that's a fairly big chunks on classified an.",
            "And also we want to extend our analysis for the Community types.",
            "So at the moment we're just looking at discussion message boards, but our theory is that the actual dynamics of different communities will leave these different role compositions being uncovered.",
            "Might be like an enterprise community has certain roles that just don't exist here and then.",
            "Social networking platforms, which are more driven around sort of like friend networks rather than sort of community message boards will have different dynamics as well in different role compositions as a result."
        ],
        [
            "So to conclude what I've done is, I've presented an approach to label user roles are ontology allows us to capture this user behaviors numeric attributes and we can also come up with this contextual sort of roll label.",
            "So it might be less are saying it allows us to actually say that a user has specific role in the given context and that context change we can come up with a new role for the user and user semantic rules were actually able to infer the user role types based on that data we've captured an.",
            "Another thing is what we found was that the actual roles we use for only a subset of the literature and actually much more geared towards this message board environment.",
            "So if we're going to extend our analysis over different Community types like that, that enterprise community or social networking one, then we need to be able to come up with different roles which will actually embody what's going on in the Community.",
            "But our approach allows that because it's dynamic nature, and in fact we're using ontologies captured out, we can easily extend it into into different Community types and to finish off.",
            "As I said before, we found that the.",
            "Composition is correlated with activity and we can say that increasing needs to roll types leads to an increase in activity, while an increase in tax returns and ignored users Lisa decrease and we also found this stable composition when it's mixed.",
            "Actually least this increase in help.",
            "OK so."
        ],
        [
            "But say if you got any questions, that's my email address that I'm on Twitter and there's papers and stuff online on that website, so yeah, that's it.",
            "So you mentioned in your talk the connection between the healthiness of the Community and the different roles you find in the Community.",
            "For example, the ignored user, but in how far is this really property of the single user that he gets ignored or property of the community is?",
            "So for example, if it's very inactive community, it is very likely to get ignored.",
            "So in how far are there?",
            "Is there really a clustering, for example, of getting ignored with regard to certain users or in how far is it?",
            "For example, also, could incidents be cause this specific user just posted one single post in the community and just got ignored for this single post?",
            "And yeah, it's definitely affected by activity in the dynamics of what's going on.",
            "There's no doubt about that.",
            "But the way we actually derive these these bins in the rule based approach does account for that.",
            "So because it's dynamic, what is low activity or sort of the low level of 1 behavior feature will differ overtime.",
            "So say for your example, if I post like 3 questions, I only get replies to like 2 of, But that's pretty much how the Community works and that would be like a mid level sort of range that behavior.",
            "So I mean it's a allows to account for that for some extent.",
            "I agree that the activity does have a codependence on what were the actual rules.",
            "Yeah, the roles you can derive from.",
            "Well, my question is actually quite a related to the last question.",
            "I was just thinking is it even?",
            "Are these ignored and taciturn users part of the community or are they just sort of?",
            "The community, when it starts to die or let users just become taciturn and ignored would be more interesting to sort of actually filter them out and see how to community health, how the active users and not ignored users affecting health.",
            "Yeah, the problem, the problem.",
            "But there is surely you need to take into consideration those those types of users because I mean if you've gotten if you got an increase in that users high, you need to be able to study it and understand what's actually going on is the sort of other behavior at play that's actually affecting that in in Jeffrey Chan's previous work they did some filtering so they basically remove certain user but we don't want to do that because we felt it would actually impact upon the analysis we did and we wanted to basically take into consideration all users types.",
            "In the analysis, so one thing that you don't really consider and you, I think you might be going to look at in future work I don't know is you don't have any kind of notion of.",
            "Trust your expertise.",
            "So how much what people actually say is is kind of valid and knowledgeable, and how?",
            "How much of an expert?",
            "They're so typically.",
            "I mean, one way in which this is done is by measuring how much people agree with the community as a whole, for example.",
            "So I wondered if you had any plans to look at that at all.",
            "Yeah, we were planning to actually extend this to be like agreement network sort of analysis, right?",
            "If you notice the actual features, we don't look at the content so exactly we just.",
            "We just look at the reply to graph and what's going on.",
            "The nice thing about nice and Miss provides an eyesore foundation to extend this to like content based analysis, so we cannot be trying look like you said who are the experts?",
            "Lever gratitude that's going on when you share something in the community and how much you participate in terms of that sense.",
            "Sure, I mean that brings another dimension because you're you start looking at the meaning of text, and that's obviously that's going to be more difficult to do, but it would be nice to include that.",
            "Yeah, I mean on the nice sort things about both days we have this.",
            "We have like the notion of thanks as well so.",
            "So we don't have this in the data we are going to look into getting.",
            "We're going to look to actually get it for the next data set, and this allowed to say that you know if you made a post of the communities can actually thank you for that.",
            "So we actually have to do any analysis we can kind of get this agreement from that in terms of gratitude as well.",
            "OK, let's thank Matthew again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And yes, so I'm a few row and today I'm going to present work they've done in collaboration with Sophia.",
                    "label": 0
                },
                {
                    "sent": "I'm glad too, and Harry Fellani, also from Kmart, and this works about modeling and analysis of user behavior in online.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is so.",
                    "label": 0
                },
                {
                    "sent": "When you think about online communities but now providing very useful resource people to talk, discuss ideas and come up with new concepts in a collaborative environment ever also used for customer support?",
                    "label": 0
                },
                {
                    "sent": "So it might be that you're like a company officer product and you want to provide like a support service.",
                    "label": 0
                },
                {
                    "sent": "So by providing Community users can describe the problem by having an acuity can be used to resolve such problems and managing and hosting communities so can be expensive and time consuming.",
                    "label": 1
                },
                {
                    "sent": "So the moderators and the host the Community have to invest a lot of time and awesome money into supporting these communities.",
                    "label": 1
                },
                {
                    "sent": "So given these large investments, it's essential that such communities flourish, remain active.",
                    "label": 0
                },
                {
                    "sent": "In essence, they need to remain healthy.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so if you look at an example of a community this is 1 forum taken from balls dying.",
                    "label": 0
                },
                {
                    "sent": "So Paul studies a Irish Community message board and if you look here, receive overtime, there's an increase in activity that's going on in in the forum, so be interested to know what's the Community look like at this point here.",
                    "label": 1
                },
                {
                    "sent": "What's the characteristics in the dynamics of the community that actually led to this increase in activity overtime Conversely?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can also look at another community, so this is a David Hasselhoff community from Balls Daddy and what we find here is this large peak or spiking activity.",
                    "label": 0
                },
                {
                    "sent": "And then it gradually decrease overtime.",
                    "label": 0
                },
                {
                    "sent": "So Conversely we can try and look and see.",
                    "label": 0
                },
                {
                    "sent": "What actually happened to this community wide?",
                    "label": 0
                },
                {
                    "sent": "It become increasingly inactive overtime.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this brings on to this notion of health and how we can try engager.",
                    "label": 0
                },
                {
                    "sent": "So existing existing work looks at some basic measures like post count.",
                    "label": 0
                },
                {
                    "sent": "So what's the actual activity in Community use accounts?",
                    "label": 0
                },
                {
                    "sent": "How many?",
                    "label": 0
                },
                {
                    "sent": "How many users are actually participating and also interaction and communication?",
                    "label": 0
                },
                {
                    "sent": "So this notion that if the communities remaining healthy, there's a lot of interaction going on and people are communicating, communicating with one another.",
                    "label": 0
                },
                {
                    "sent": "We can also look at behavior.",
                    "label": 0
                },
                {
                    "sent": "So the notion that our people behaving in a way.",
                    "label": 0
                },
                {
                    "sent": "That resembles like a healthy communities where we can gauge this and what we found when we look for through the literature, there's some early work by Jenny Preece around about 2000 and the first thing that she found was that domination of 1 type of behavior in online community can lead to churn, sojourners, notion that you will leave the community, and this is quite a big problem for Community operates because they don't want to have people leaving water invest a lot of money in, and she also found their behavior in online communities also influenced by the roles for user shoot.",
                    "label": 1
                },
                {
                    "sent": "So it might be that.",
                    "label": 0
                },
                {
                    "sent": "You start interacting their community and a certain roles or certain people in that community who influenced how you behave, and overtime it changes the dynamics of the Community.",
                    "label": 1
                },
                {
                    "sent": "So if once provides some health insights needs, filter monitors behavior every time and then combine it with some basic so health metrics like post count for example, and this would give us some way that we can actually track to see how the Community is actually changing and evolving over.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm so in order support Community owners, we need to use four steps.",
                    "label": 0
                },
                {
                    "sent": "So first of all we need to monitor and capture member activities.",
                    "label": 1
                },
                {
                    "sent": "We need to know what actions are actually going on the community.",
                    "label": 0
                },
                {
                    "sent": "How would people interacting and what are they doing then we can try and analyze emerging behavior overtime so you can try and understand how those actions correlate with certain behavior.",
                    "label": 1
                },
                {
                    "sent": "But after that we can try and we can look at the correlation between behaving community evolution.",
                    "label": 0
                },
                {
                    "sent": "So we get a notion of how if certain behavior exists.",
                    "label": 0
                },
                {
                    "sent": "In the community, then it's likely to evolve in this with certain way and then after that we can learn when to intervene to influence the Community is going back to early example of where the Community's health or the activity diminished overtime would be interested in.",
                    "label": 1
                },
                {
                    "sent": "We could actually understand what she calls that and learn when to intervene to stop it from occurring.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this paper, going to look at the first of these three tasks, right so the monitoring be analysis and then trying to gain some understanding of the correlation between behavior and how community evolves.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there's three contributions in our paper free main ones, so the first one is we're going to be providing ontologies, model, behavior, roles.",
                    "label": 0
                },
                {
                    "sent": "This allows us to capture behavior overtime in different contexts.",
                    "label": 0
                },
                {
                    "sent": "Then we can infer the users roles in online communities, and for this we use semantic rule based method, and then after that we provide some analysis of Community health through this role composition, so we're able to actually identify behavior and correlated out of activity overtime and understand the patterns which exists in these communities with analyze.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in this talk I'm going to go through these various stages.",
                    "label": 0
                },
                {
                    "sent": "1st I'm going to present the ontology, but I'm going to go for the features we've used to capture this behavior.",
                    "label": 0
                },
                {
                    "sent": "Now I'm going to explain the community roles that we've we've derived from the literature and then presenting approach for how we can actually analyze this behavior, construct some semantic rules which you can then use to label uses with the roles they having.",
                    "label": 1
                },
                {
                    "sent": "Communities.",
                    "label": 0
                },
                {
                    "sent": "Then after that provide some analysis of community health and how we can predict it, and the findings from this work.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so moving on the 1st first piece work amounts presented this ontology.",
                    "label": 0
                },
                {
                    "sent": "So what this allows us to do an?",
                    "label": 0
                },
                {
                    "sent": "We extended shock in this case.",
                    "label": 0
                },
                {
                    "sent": "So what allows us to do is to actually save a user account.",
                    "label": 0
                },
                {
                    "sent": "So this thing that's in red here is a member of the Community, so use as a member of the Community.",
                    "label": 0
                },
                {
                    "sent": "We can extend shock and use it for that.",
                    "label": 0
                },
                {
                    "sent": "We can also say that users participate in this forum here because they're making a post which isn't afraid.",
                    "label": 0
                },
                {
                    "sent": "So we have a link between the user and the community in which are interacting.",
                    "label": 0
                },
                {
                    "sent": "And then after that we have this notion of a time frame.",
                    "label": 0
                },
                {
                    "sent": "So what we can do is we can capture the user's behavior in this community over time and then from this we can drive a roll and anything about this is it allows us to actually say that a user can have multiple roles in multiple communities in given context.",
                    "label": 0
                },
                {
                    "sent": "So it might be that at one time frame I have.",
                    "label": 0
                },
                {
                    "sent": "I assume this one behaviour role and then next time frame we've got a different one.",
                    "label": 0
                },
                {
                    "sent": "And also it might be at the same time frame.",
                    "label": 0
                },
                {
                    "sent": "I've got different roles in different communities.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For our features, we can we have the 7 features here and this allows us to actually describe the behavior or how the users participating interacting in the Community.",
                    "label": 0
                },
                {
                    "sent": "So for the first one for indegree ratio, this measures the proportion of users are given users interacted with in the Community, so it's a bit like sort of like concentration of participation, so if this is high it means that the user is interacting with a lot of users in the Community, whereas if it's low but more likely to interact with smaller cliques and then supposed replied ratio.",
                    "label": 0
                },
                {
                    "sent": "So this measures the popularity of the user in the Community.",
                    "label": 0
                },
                {
                    "sent": "This how many posts where I posted that get a reply.",
                    "label": 1
                },
                {
                    "sent": "Then you got friend initiation ratio.",
                    "label": 1
                },
                {
                    "sent": "Is this proportion of threads that have been started in the community that that have been started by the user and this allows us to gauge the extent to which users actually initiating and driving sort of activity in the Community.",
                    "label": 1
                },
                {
                    "sent": "But in BI directional threads ratio.",
                    "label": 0
                },
                {
                    "sent": "So this is the level of reciprocity that occurs in threads that user participates in.",
                    "label": 0
                },
                {
                    "sent": "So this is that if I make a post.",
                    "label": 0
                },
                {
                    "sent": "And somebody replies to me.",
                    "label": 1
                },
                {
                    "sent": "I replied to that user, not designates a reciprocal action.",
                    "label": 0
                },
                {
                    "sent": "From this we can actually gauge to what extent interactions taking place with users and then BI directional neighbors ratio again.",
                    "label": 1
                },
                {
                    "sent": "Another measure of reciprocity and average posts per thread.",
                    "label": 1
                },
                {
                    "sent": "This measures the level of discussion that's going on in the Community, so this is high.",
                    "label": 0
                },
                {
                    "sent": "It basically means that the users engaging in quite high activity threads, so it's more conversation driven.",
                    "label": 0
                },
                {
                    "sent": "And then we got standard deviation of post for Fred.",
                    "label": 0
                },
                {
                    "sent": "This measures for distribution.",
                    "label": 1
                },
                {
                    "sent": "As the average posts per thread measure.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So based on this, we then wanted to look at some Community role.",
                    "label": 0
                },
                {
                    "sent": "So could we actually?",
                    "label": 0
                },
                {
                    "sent": "Take behavior that use exhibit an actually come up with some discrete labels that could be that could be used to describe those service users.",
                    "label": 0
                },
                {
                    "sent": "So in Jeffrey Chan's paper, along with his colleagues in 2010 the websites conference, he came with a distinct roles which message boards users exhibit right?",
                    "label": 0
                },
                {
                    "sent": "So what we doing for each one of these in?",
                    "label": 0
                },
                {
                    "sent": "Five days in the in grace details give you an idea of what they are, so I'm trying to do is we're trying to take pictures from popular culture to try and link these roles.",
                    "label": 0
                },
                {
                    "sent": "So give you some grounding right, so bear with me.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, elitist right?",
                    "label": 0
                },
                {
                    "sent": "Do you know who this is?",
                    "label": 0
                },
                {
                    "sent": "Who you see people are you should do right.",
                    "label": 0
                },
                {
                    "sent": "So will lead to people who they interact in certain cliques, right?",
                    "label": 0
                },
                {
                    "sent": "So video really in the community.",
                    "label": 0
                },
                {
                    "sent": "They get a lot of sort of BI directional threads.",
                    "label": 0
                },
                {
                    "sent": "Those levels of reciprocity going on, but they only interact with certain cliques without having a high indegree ratio.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When he got joining conversation list right?",
                    "label": 0
                },
                {
                    "sent": "So it might be that like discussions are going on and this person will actually sort of chip in and sort of discuss there not too bothered about initiating or starting discussions.",
                    "label": 0
                },
                {
                    "sent": "They just want to sort of join in and get a conversation going discussion.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the third one is popular initiator, so you know this guy is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, some people do right.",
                    "label": 0
                },
                {
                    "sent": "OK, so is Bill O'Reilly.",
                    "label": 0
                },
                {
                    "sent": "He's like an Anchorman for Fox News and he's well known for sort of winding people up instead of getting a discussion going and sort of initiating.",
                    "label": 0
                },
                {
                    "sent": "So in this case, Bill's role in the community would be more aligned with.",
                    "label": 0
                },
                {
                    "sent": "He just wants to start discussions getting stuff going.",
                    "label": 0
                },
                {
                    "sent": "He's not too bothered about sort of conversation.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Afterwards and he got popular participant so popular participant has a fairly high indegree ratio and medium statistics everything else, so this is like they contribute and they might initiate discussions.",
                    "label": 0
                },
                {
                    "sent": "But whenever they do contribute to community they get a lot of feedback.",
                    "label": 0
                },
                {
                    "sent": "They have quite high in.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Three right?",
                    "label": 0
                },
                {
                    "sent": "And then we got technology users.",
                    "label": 0
                },
                {
                    "sent": "So largely what happens with technology uses the they interact, but whenever they post something, they just ignore that don't get a reply when they try and post like afraid to get something started, nothing happens.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So based on these eight rolls were able to do was we analyze the literature and came up with the features that resemble these roles and what we're able to do is variable to attach a feature with a level.",
                    "label": 0
                },
                {
                    "sent": "So a level is either low, medium or high, and based on this we can say, but an elitist should have a low in degree ratio 'cause they don't participate.",
                    "label": 0
                },
                {
                    "sent": "Many people they participate in cliques.",
                    "label": 0
                },
                {
                    "sent": "Which of the high bidirectional threads ratio?",
                    "label": 0
                },
                {
                    "sent": "Because a lot of the content they do.",
                    "label": 0
                },
                {
                    "sent": "Interactive gets replies.",
                    "label": 0
                },
                {
                    "sent": "Lot of reciprocal actions going on within that clique.",
                    "label": 0
                },
                {
                    "sent": "Also, there's a low BI directional neighbors ratio as well.",
                    "label": 0
                },
                {
                    "sent": "So based on this we have what we call our Skelton rule base right, and this provides a link for each role between a feature and a level, and from this week and then derive some rules we can use actually classify the useless by the roll.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to do this, we have this four stage approach, so we take a bunch of users and given time, time step and first of all we construct the features for them.",
                    "label": 0
                },
                {
                    "sent": "So we construct the social network features this reciprocity features and the participation features that went through before and then after that we derive bins so.",
                    "label": 0
                },
                {
                    "sent": "But driving bins were able to actually dynamically generate these rule.",
                    "label": 0
                },
                {
                    "sent": "These levels given time step, so it might be that the actual distribution of the feature shifts between time steps, so that direct by just driving these bins we can get this cut off point for what is low.",
                    "label": 0
                },
                {
                    "sent": "The cut off points.",
                    "label": 0
                },
                {
                    "sent": "What is medium and a cut off points?",
                    "label": 0
                },
                {
                    "sent": "What is high and basic?",
                    "label": 0
                },
                {
                    "sent": "Basically after that we can compile our rule base because we are Skelton rules and we have these these levels and then after this we can then apply the rules to the user and this gives us nice community composition at given time step.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how do we actually apply these rules?",
                    "label": 0
                },
                {
                    "sent": "So, in essence, our rules are just sparkle construct queries, but we use PIN functions within there to actually derive the type of the role that users should.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this part in the where clause.",
                    "label": 0
                },
                {
                    "sent": "Here is a spin function and it's basically saying that this user here that's designated by this variable.",
                    "label": 0
                },
                {
                    "sent": "This get me the role type for this user has right?",
                    "label": 1
                },
                {
                    "sent": "So because all our data is created using this ontology, we have this link between the user and the behavior Dave exhibited at a given time step and we run this classifier.",
                    "label": 0
                },
                {
                    "sent": "Basically this small spin function and it basically returns this type here, which is most relevant to the user given their features.",
                    "label": 1
                },
                {
                    "sent": "Alright, so.",
                    "label": 0
                },
                {
                    "sent": "If you want to know more, you can have look at spin here and it explains how these functions work.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then the second second part of this where clause and she says right K give me ur eye of this role type.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And from this I can then start assigning the user.",
                    "label": 0
                },
                {
                    "sent": "I can construct a link between the user and the role I have and the nice thing about this is that we have this user here and he has a role.",
                    "label": 1
                },
                {
                    "sent": "But there's also a context which is a scientist role, right?",
                    "label": 0
                },
                {
                    "sent": "So going back to our previous ontology that was describing using this method, it means that a user can have multiple roles in different contexts.",
                    "label": 1
                },
                {
                    "sent": "This could be that they have a different role at different times in the same community, but it also could have different roles in different communities at the same time.",
                    "label": 0
                },
                {
                    "sent": "Is important because what what you behavior exhibit at 1 one time step or in one community.",
                    "label": 0
                },
                {
                    "sent": "One context will differ from another and this allows us to.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Capture it.",
                    "label": 0
                },
                {
                    "sent": "So what can we do with this approach?",
                    "label": 0
                },
                {
                    "sent": "So the initial thing wants to look at is, can we actually analyze community health?",
                    "label": 0
                },
                {
                    "sent": "Can we actually answer this question?",
                    "label": 0
                },
                {
                    "sent": "How is Community role composition associative activity?",
                    "label": 1
                },
                {
                    "sent": "So to do this we took the bus a Irish Community message board.",
                    "label": 0
                },
                {
                    "sent": "We were provided the full data set, but we just looked at a subset of it.",
                    "label": 0
                },
                {
                    "sent": "So we looked all post from 2000 four 2006 and provide some qualitative analysis.",
                    "label": 0
                },
                {
                    "sent": "We just wanted to look at free forums with different sort of levels activity.",
                    "label": 0
                },
                {
                    "sent": "So we just looked at commuting in transport, which discuss is obviously travel and that sort of thing, and so rugby and we looked at mobile phones and PDAs, so each one of these forms gives a different topic.",
                    "label": 0
                },
                {
                    "sent": "We can analyze.",
                    "label": 0
                },
                {
                    "sent": "What we do is we then measured at 12 equal increments this role composition and also the number of posts.",
                    "label": 0
                },
                {
                    "sent": "So role composition is the percentage of users who take on a specific role, so might be to a given time step is 20% elitist.",
                    "label": 0
                },
                {
                    "sent": "The 10% grunts so and so forth.",
                    "label": 0
                },
                {
                    "sent": "And also we got number of posts.",
                    "label": 0
                },
                {
                    "sent": "What we can do from this is we can then correlate to see how this composition matches against this activity, and we can learn what patterns are existing so.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, I'm just going to show you a cicarella Graham's basically shows what's going on in Form 246, so the way to read this is along the diagonal.",
                    "label": 0
                },
                {
                    "sent": "Here we have the roll labels and in the bottom right corner we've got the posts and what you want to do is you want to basically look at this line here to see how posts are correlated with these different roles, and so basically the way to read this also is that these pie charts indicate the level of correlation that's going on between these two variables, right?",
                    "label": 0
                },
                {
                    "sent": "So if it's a full circle and it's blue, it means a positive correlation of 1.",
                    "label": 0
                },
                {
                    "sent": "Is full circle and it's red.",
                    "label": 0
                },
                {
                    "sent": "It means there's a negative correlation of 1.",
                    "label": 0
                },
                {
                    "sent": "So what we can we can?",
                    "label": 0
                },
                {
                    "sent": "What we see here is that elitists.",
                    "label": 0
                },
                {
                    "sent": "When we look at this pie chart here, an elitist is correlated with post such for an increase in elitist would equate to an increase increase in post right?",
                    "label": 0
                },
                {
                    "sent": "So that role in this community is actually associated with an increase in activity.",
                    "label": 0
                },
                {
                    "sent": "I'm not saying it causes it, but it's correlated with its associated with it.",
                    "label": 0
                },
                {
                    "sent": "And also we find that popular participants as well as associated with an increase in post counts.",
                    "label": 0
                },
                {
                    "sent": "So we're trying to see how this like this behavior is actually associated with increasing activity in the Community.",
                    "label": 0
                },
                {
                    "sent": "Conversely, we also find that an increased ignored users actually affects the activity community by decreasing.",
                    "label": 0
                },
                {
                    "sent": "So is this negative Association going on there?",
                    "label": 0
                },
                {
                    "sent": "And the same for taxi turns here.",
                    "label": 0
                },
                {
                    "sent": "So tax returns are users.",
                    "label": 0
                },
                {
                    "sent": "I didn't explain this role before, but taxed entities who oppose very infrequently, so they might post once or twice.",
                    "label": 0
                },
                {
                    "sent": "So an increase in that type of user associated with.",
                    "label": 1
                },
                {
                    "sent": "A decrease in post.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Counts.",
                    "label": 0
                },
                {
                    "sent": "And then when we look across the frequencies, we started to see that these patterns are actually consistent, but it's also submitted.",
                    "label": 0
                },
                {
                    "sent": "DS increases as well.",
                    "label": 0
                },
                {
                    "sent": "So what we find is that for an ignored user is actually pretty consistently get dislike, negative correlation and we also get a positive correlation for all the elitists as well.",
                    "label": 0
                },
                {
                    "sent": "So that one there on there that one there.",
                    "label": 0
                },
                {
                    "sent": "But Interestingly, in commuting in transport we find that conversation listen more important than in rugby and Form 1.",
                    "label": 0
                },
                {
                    "sent": "And also in from 4 one talking about mobile phones and PDAs, we find that there's a pretty obvious negative correlation for supporters.",
                    "label": 1
                },
                {
                    "sent": "So in that case actually having that role in the Community seems to actually have a decreasing effect on how far is associated.",
                    "label": 0
                },
                {
                    "sent": "But so the next piece of analysis that we wanted.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Account was, you know, what happens overtime when we look at these compositions and the actual change in these roll percentages.",
                    "label": 0
                },
                {
                    "sent": "And how is this associated with the actual sort of post counts going up.",
                    "label": 0
                },
                {
                    "sent": "So the black line here is the post count overtime and in each phase of alliances percentage of the actual role roles that people assume in the Community.",
                    "label": 0
                },
                {
                    "sent": "What we find is that around about this time step here we start to get this gradual increase in activity and we also see in the role composition is for this kind of like stability.",
                    "label": 0
                },
                {
                    "sent": "Round about here.",
                    "label": 0
                },
                {
                    "sent": "So earlier on we get this fluctuation and this is shown to actually sort of be associated with this sort of like not so much and not so much an increase but overtime as this reached a stable sort of composition we get this increased activity.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also found this is quite consistent with Form 411 as well, so we have this increase in post count overtime and this is shown to be.",
                    "label": 0
                },
                {
                    "sent": "Associated visibility.",
                    "label": 0
                },
                {
                    "sent": "Whereas when we look at the rugby forum, we have this sort of fluctuation in the roles and that is shown to be associated with this fluctuation in post camp.",
                    "label": 0
                },
                {
                    "sent": "So it's the first piece of analysis we did and it kind of showed us the roles that people assume the community knows percentages, how their associated activity.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next piece of analysis what we want to do is want to try and see if we can actually predict the Community health for this activity based on the role composition.",
                    "label": 0
                },
                {
                    "sent": "So we've identified we've been able to use our rule based approach to derive this composition, but how does it actually affect what's happening in the Community house?",
                    "label": 0
                },
                {
                    "sent": "It's actually associated with it, so the first experiment we wanted to do is try and predict either an increase or decrease in activity.",
                    "label": 0
                },
                {
                    "sent": "So we did this once we measured at a given time step the role composition use each of those eight roles as a feature of what's going on community.",
                    "label": 0
                },
                {
                    "sent": "When our class labels binary is either an increase or decrease in activity and then we perform 10 fold cross validation with J48 decision tree to try and predict what's going on.",
                    "label": 1
                },
                {
                    "sent": "So this increase or decreases from the last time step web activities going up or down and in the second experiment we wanted to do was to look to try and predict the actual post count from this role composition.",
                    "label": 0
                },
                {
                    "sent": "So for this we use regression model are independent variables with the roles and their percentages and are dependent variables.",
                    "label": 0
                },
                {
                    "sent": "Suppose count what trying to do is look at the coefficient of determination and see how big that sort of correlation was.",
                    "label": 0
                },
                {
                    "sent": "Prediction based on that model would be effective, so for the.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First task for our prediction for the increase or decrease in activity.",
                    "label": 1
                },
                {
                    "sent": "What fun performed 246 so this is the commuting and transport form.",
                    "label": 0
                },
                {
                    "sent": "We get this fairly high F measure here, showing that we are actually able to do this prediction fairly accurately, then perform 38.",
                    "label": 0
                },
                {
                    "sent": "We find out because this fluctuation activity, our patterns are.",
                    "label": 0
                },
                {
                    "sent": "It was obvious and we can't do it as accurately.",
                    "label": 0
                },
                {
                    "sent": "So what we did.",
                    "label": 1
                },
                {
                    "sent": "Also we combined all the data together in this.",
                    "label": 0
                },
                {
                    "sent": "All this all this all case here and what is allowed us to do is basically take all the forms but all the data together and see if there's these general patterns across was going.",
                    "label": 0
                },
                {
                    "sent": "And what we find is that for the receiver operator characteristic curve, the area under it we get this low number, so indicates that we're not able to do this prediction very well in terms of actually detecting false positives.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for our second prediction task, where he wants to look at was, can we actually do this correlation?",
                    "label": 0
                },
                {
                    "sent": "Can we actually take these roll percentages and try and predict this post count?",
                    "label": 0
                },
                {
                    "sent": "And for this I'm just showing Form 38 here 'cause it had the highest R-squared value.",
                    "label": 0
                },
                {
                    "sent": "This value.",
                    "label": 0
                },
                {
                    "sent": "Here we find this fairly large correlation between or in the model being able to predict this post Council.",
                    "label": 0
                },
                {
                    "sent": "It's fairly accurate doing that.",
                    "label": 0
                },
                {
                    "sent": "But Interestingly what we find is that when we look at the coefficients in the model and for the variables that around the statistically significant, we find an increase in popular initiators.",
                    "label": 0
                },
                {
                    "sent": "An increase in popular participants coupled with the decrease in supporters and ignored users.",
                    "label": 0
                },
                {
                    "sent": "Least this increase in activity.",
                    "label": 0
                },
                {
                    "sent": "Alright, so this is this is showing you what a an increasing activity community should contain in terms of the rolls.",
                    "label": 0
                },
                {
                    "sent": "So if you get a forum or community where you exhibit these roles developing at this sort of this rate judged by these coefficients, you will get an increase in activity in this context.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I found this from this work.",
                    "label": 0
                },
                {
                    "sent": "What we found is that active communities contain more elitist and popular participants, so we're able to save even know, elitist only interacted a small clique of users and we're still able to use that roller.",
                    "label": 1
                },
                {
                    "sent": "That rolls actually still a good thing to have in the community, where we also found was unhealthy.",
                    "label": 0
                },
                {
                    "sent": "Communities contain more tax returns and ignored users, which kind of like makes sense.",
                    "label": 1
                },
                {
                    "sent": "So if the community is not not actually interacting and allowing people to kind of get responses to their questions or whatever.",
                    "label": 1
                },
                {
                    "sent": "And get that increasing activity.",
                    "label": 1
                },
                {
                    "sent": "We also found that it was idiosyncratic compositions as well.",
                    "label": 0
                },
                {
                    "sent": "So getting back to what was going on in the natural prediction experiment when we looked at the coefficients in the model of those different communities, we found there was still like different behavior that was being exhibited.",
                    "label": 0
                },
                {
                    "sent": "And we also found this table mixed composition, increased activity, overtime.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the future work that we have come up with.",
                    "label": 1
                },
                {
                    "sent": "First of all, we want to look at micro level role analysis, so we've identified what's going on in the community, but is for actually user sort of like roll lifecycles that that occur, so it might be that you know you're not likely to jump from an elitist to even ignored user straight away.",
                    "label": 0
                },
                {
                    "sent": "You probably go through this path a developing roles overtime, and can we actually identify those and another key piece of work we need to do is to identify key community users, so there might be users like those elitists or whatever that you don't want to leave because for those to churn it could actually.",
                    "label": 0
                },
                {
                    "sent": "Affect your community activity that's going on and then also explore alternative methods for Dennis Role labeling.",
                    "label": 1
                },
                {
                    "sent": "So although these semantic rule based method and it allows us to actually very very easily and efficiently derive these these roles for users were still missing around about 29% of the users, that's a fairly big chunks on classified an.",
                    "label": 0
                },
                {
                    "sent": "And also we want to extend our analysis for the Community types.",
                    "label": 0
                },
                {
                    "sent": "So at the moment we're just looking at discussion message boards, but our theory is that the actual dynamics of different communities will leave these different role compositions being uncovered.",
                    "label": 0
                },
                {
                    "sent": "Might be like an enterprise community has certain roles that just don't exist here and then.",
                    "label": 0
                },
                {
                    "sent": "Social networking platforms, which are more driven around sort of like friend networks rather than sort of community message boards will have different dynamics as well in different role compositions as a result.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude what I've done is, I've presented an approach to label user roles are ontology allows us to capture this user behaviors numeric attributes and we can also come up with this contextual sort of roll label.",
                    "label": 1
                },
                {
                    "sent": "So it might be less are saying it allows us to actually say that a user has specific role in the given context and that context change we can come up with a new role for the user and user semantic rules were actually able to infer the user role types based on that data we've captured an.",
                    "label": 1
                },
                {
                    "sent": "Another thing is what we found was that the actual roles we use for only a subset of the literature and actually much more geared towards this message board environment.",
                    "label": 0
                },
                {
                    "sent": "So if we're going to extend our analysis over different Community types like that, that enterprise community or social networking one, then we need to be able to come up with different roles which will actually embody what's going on in the Community.",
                    "label": 0
                },
                {
                    "sent": "But our approach allows that because it's dynamic nature, and in fact we're using ontologies captured out, we can easily extend it into into different Community types and to finish off.",
                    "label": 1
                },
                {
                    "sent": "As I said before, we found that the.",
                    "label": 0
                },
                {
                    "sent": "Composition is correlated with activity and we can say that increasing needs to roll types leads to an increase in activity, while an increase in tax returns and ignored users Lisa decrease and we also found this stable composition when it's mixed.",
                    "label": 0
                },
                {
                    "sent": "Actually least this increase in help.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But say if you got any questions, that's my email address that I'm on Twitter and there's papers and stuff online on that website, so yeah, that's it.",
                    "label": 0
                },
                {
                    "sent": "So you mentioned in your talk the connection between the healthiness of the Community and the different roles you find in the Community.",
                    "label": 0
                },
                {
                    "sent": "For example, the ignored user, but in how far is this really property of the single user that he gets ignored or property of the community is?",
                    "label": 0
                },
                {
                    "sent": "So for example, if it's very inactive community, it is very likely to get ignored.",
                    "label": 0
                },
                {
                    "sent": "So in how far are there?",
                    "label": 0
                },
                {
                    "sent": "Is there really a clustering, for example, of getting ignored with regard to certain users or in how far is it?",
                    "label": 0
                },
                {
                    "sent": "For example, also, could incidents be cause this specific user just posted one single post in the community and just got ignored for this single post?",
                    "label": 0
                },
                {
                    "sent": "And yeah, it's definitely affected by activity in the dynamics of what's going on.",
                    "label": 0
                },
                {
                    "sent": "There's no doubt about that.",
                    "label": 0
                },
                {
                    "sent": "But the way we actually derive these these bins in the rule based approach does account for that.",
                    "label": 0
                },
                {
                    "sent": "So because it's dynamic, what is low activity or sort of the low level of 1 behavior feature will differ overtime.",
                    "label": 0
                },
                {
                    "sent": "So say for your example, if I post like 3 questions, I only get replies to like 2 of, But that's pretty much how the Community works and that would be like a mid level sort of range that behavior.",
                    "label": 0
                },
                {
                    "sent": "So I mean it's a allows to account for that for some extent.",
                    "label": 0
                },
                {
                    "sent": "I agree that the activity does have a codependence on what were the actual rules.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the roles you can derive from.",
                    "label": 0
                },
                {
                    "sent": "Well, my question is actually quite a related to the last question.",
                    "label": 0
                },
                {
                    "sent": "I was just thinking is it even?",
                    "label": 0
                },
                {
                    "sent": "Are these ignored and taciturn users part of the community or are they just sort of?",
                    "label": 0
                },
                {
                    "sent": "The community, when it starts to die or let users just become taciturn and ignored would be more interesting to sort of actually filter them out and see how to community health, how the active users and not ignored users affecting health.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the problem, the problem.",
                    "label": 0
                },
                {
                    "sent": "But there is surely you need to take into consideration those those types of users because I mean if you've gotten if you got an increase in that users high, you need to be able to study it and understand what's actually going on is the sort of other behavior at play that's actually affecting that in in Jeffrey Chan's previous work they did some filtering so they basically remove certain user but we don't want to do that because we felt it would actually impact upon the analysis we did and we wanted to basically take into consideration all users types.",
                    "label": 0
                },
                {
                    "sent": "In the analysis, so one thing that you don't really consider and you, I think you might be going to look at in future work I don't know is you don't have any kind of notion of.",
                    "label": 0
                },
                {
                    "sent": "Trust your expertise.",
                    "label": 0
                },
                {
                    "sent": "So how much what people actually say is is kind of valid and knowledgeable, and how?",
                    "label": 0
                },
                {
                    "sent": "How much of an expert?",
                    "label": 0
                },
                {
                    "sent": "They're so typically.",
                    "label": 0
                },
                {
                    "sent": "I mean, one way in which this is done is by measuring how much people agree with the community as a whole, for example.",
                    "label": 0
                },
                {
                    "sent": "So I wondered if you had any plans to look at that at all.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we were planning to actually extend this to be like agreement network sort of analysis, right?",
                    "label": 0
                },
                {
                    "sent": "If you notice the actual features, we don't look at the content so exactly we just.",
                    "label": 0
                },
                {
                    "sent": "We just look at the reply to graph and what's going on.",
                    "label": 0
                },
                {
                    "sent": "The nice thing about nice and Miss provides an eyesore foundation to extend this to like content based analysis, so we cannot be trying look like you said who are the experts?",
                    "label": 0
                },
                {
                    "sent": "Lever gratitude that's going on when you share something in the community and how much you participate in terms of that sense.",
                    "label": 0
                },
                {
                    "sent": "Sure, I mean that brings another dimension because you're you start looking at the meaning of text, and that's obviously that's going to be more difficult to do, but it would be nice to include that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean on the nice sort things about both days we have this.",
                    "label": 0
                },
                {
                    "sent": "We have like the notion of thanks as well so.",
                    "label": 0
                },
                {
                    "sent": "So we don't have this in the data we are going to look into getting.",
                    "label": 0
                },
                {
                    "sent": "We're going to look to actually get it for the next data set, and this allowed to say that you know if you made a post of the communities can actually thank you for that.",
                    "label": 0
                },
                {
                    "sent": "So we actually have to do any analysis we can kind of get this agreement from that in terms of gratitude as well.",
                    "label": 0
                },
                {
                    "sent": "OK, let's thank Matthew again.",
                    "label": 0
                }
            ]
        }
    }
}