{
    "id": "mfbzhj3ubu6oprmlvjcemzybcvzotij2",
    "title": "Semantic technologies: an introduction",
    "info": {
        "author": [
            "Tomás Pariente Lobo, Atos Research & Innovation, Atos Origin"
        ],
        "published": "Feb. 9, 2009",
        "recorded": "January 2009",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/taoiw09_pariente_semintro/",
    "segmentation": [
        [
            "I think that in any case we need to have a common ground on what the semantic web is.",
            "An ontologies are and all this stuff."
        ],
        [
            "So let's introduce.",
            "First agenda this I will have the first introduction in the semantic Web.",
            "Then I am going to spend a little bit of time on the semantic web service aside because it's something that is quite related with with cow and then a few words about application of semantic technologies.",
            "In some some fields I'm not going to give any any.",
            "Details, because this is a very.",
            "You broke the.",
            "Very broad agenda for an introduction of the semantic Web, but at least just to have for you to have a look at the semantic web is about and the application fields.",
            "That some of the words."
        ],
        [
            "Sing for.",
            "So first of all from I would like to start from the current status of the order Web today and then go into the semantic Web.",
            "So as you know, the web presented content in multiple ways.",
            "There's not only textual test, well content, but there is multimedia content as well As for content can be in many languages.",
            "As you know French, English, Spanish, any type of language.",
            "So this is something that is clear.",
            "That we humans are able to process, but it's not so clear that machine could process in a way so the as we are, say intelligence, we can take this content an be we are able to process it.",
            "Making deductions because we our mind is capable of doing this type of reasoning and this action can be based on incomplete information.",
            "We can complete the gaps using our minds and we can link the different context.",
            "Finding the web using free Association using our reasoning capabilities.",
            "So we are used to make it with several sensors, not only with the with the our site, but with our hearing and all our sensors.",
            "So the web some user interface on the web, not only based on visual information but in other type of sensors as well.",
            "So.",
            "Let's say let's say that the web has a revolutionary impact in our way of working because we use usually the web for working nowadays, studying, or even having fun.",
            "As you, as you already know, and they will provide access, provides access to almost almost anytime, anywhere to everybody.",
            "So this is true.",
            "That has some major change that we have.",
            "We have seen during the last years and this is the current status, let's say."
        ],
        [
            "Work today.",
            "But there are some tasks that we perform in Internet that there is also the combination of all of this data.",
            "Not this coming forward from different resources, not only from one web page, but we can go and navigate to too many webpages.",
            "An income somehow combined all this information in order to get our our goal.",
            "For instance, we have a couple of examples like hotels, rental flight we want to.",
            "Go to a someplace we will go to the Internet with book flights.",
            "We book hotels, we rent cars for Internet, so this is something that is a complex process that we say as humans are capable of dealing with in the current in the current graph.",
            "Or search on better libraries and you can think of many examples of this type of behavior that we humans have on the web.",
            "Even if they they all this information comes from different technologies there or languages we are able somehow sonar abilities, but we can.",
            "We can combine all this information.",
            "So let's say that there are many informational too much information on the web is human oriented cause the work is made basically for humans.",
            "Therefore, it's difficult to organize an and automate, and this is a problem that that from the past year we are we."
        ],
        [
            "Or we're dealing with.",
            "On the other hand, the matching machines are ignorant, if not in the way that they are not able to reason exactly the same way that that we do, so they don't know exactly how to deal with incomplete information.",
            "They they find information about one thing, but it's incomplete.",
            "They cannot process in the same way that we that we do so in the web.",
            "This is a problem.",
            "Where there are some contents on the web that the machines cannot process easily or that they cannot extract knowledge from this content on the web.",
            "We have here the example of yeibicheii or bandits in there that they cannot access to this information and process it and extract knowledge from there as we do because we have to look at the visual diagram or at at the cartoon and we are able to see to see what is what is going on with the.",
            "On the other hand, there in the past years we have developed some software there based on artificial artificial intelligence techniques that was able to extract automatically or semiautomatically information from from these resources, but traditionally it was very expensive.",
            "So what we needed was an evolution of this in order to get this information.",
            "Ray and of course we have had difficulties from binary information for machines, but she is having difficulties and combine information because they don't have a common vocabulary in a way for us it's very easy to see, for instance this full creator and other author and think OK, this should be more or less the same, but for machine this is not clear at all.",
            "These are only test and that cannot be processed any easily.",
            "So XML is under step on this direction, but this terminology differences marked.",
            "A problem, and this is what we need to do.",
            "So this is a challenge, a challenge for the web.",
            "From the Human base web, we have to go to machine matching based or human and machine based weapon in order to automate some processes and the different agents we have to be able to understand what the weapon knowledge is about.",
            "Yeah, so yeah for that.",
            "What we what we need is to describe in our this knowledge of this information that we have on the web in a way that the machines could understand and that's it."
        ],
        [
            "This is where the semantic web technologies is about.",
            "Sorry, I shot the sample of how the code is.",
            "The current web is based on HTML.",
            "So if you have a look at, this is a typical web page with the typical.",
            "The correct email, a source that you can click in your browser.",
            "You can see this type of shows, so you see here that the for instance with the retail price which is $1313.00.",
            "So you are able to understand easily what this retirement retail price is about.",
            "But imagine a machine that they cannot cannot straight from here.",
            "Really, the meaning of this information because they OK.",
            "Yes, if you are doing the data mining process you can say OK, this this price is the retail price but you have to program it.",
            "It's not completely automated process so.",
            "So what this is what software agents will do?",
            "This guess about the meaning of this information.",
            "With this information we don't have their complete, let's say, tagging in order to get their real knowledge of this behind this in for me."
        ],
        [
            "So you probably know this guy.",
            "This is Tim purposely, which is the one of the inventors of the web.",
            "Another with the semantic Web as well.",
            "So he defined in a way the Semantic Web exhibition.",
            "Is this idea of having that data on the web link it that can be used by machines for automation, integration and reuse of data across various applications?",
            "So this is a division that he had to.",
            "The semantic web is what really semantic web is about, so you have an infrastructure where machine can comprehend semantic data.",
            "Data understands the knowledge of humans.",
            "So the idea is that machines are therefore in general for human purposes, so they.",
            "They need to extract information knowledge and presented today to the humans in a better way.",
            "That's the main.",
            "The main goal of the agents.",
            "Companies that are on the web.",
            "So the idea is is that this infrastructure can improve and enhance the knowledge that they were humans.",
            "Construction work in the same way.",
            "So meaningful information enables machine to infer knowledge.",
            "This is 1 important thing that there are a lot of a lot of knowledge that are that is somehow hidden behind the scenes and this is not this can be a strategically it is.",
            "If it is, that's a annotated in the in the in a good way."
        ],
        [
            "So what a sample of the same type of word using in this case, an ontology.",
            "I'm going to define.",
            "Better with an ontology is, although you probably know more than me.",
            "Even so, this is an example of how using a couple a couple of ontologies, music, Ontology and Commerce Ontology that has defined some common vocabulary like title, artist, currency, product price and so on will define the different different.",
            "Let's say parts of this web page so we can see here that the retail prices.",
            "Uh, I guess middle tier back here that is priced that it's the price that is based on the concept that is in the in the E Commerce and treasure.",
            "Do help with this below this is a dummy example of how an ontology would look like, but this is the same.",
            "The same information can be taking away that machine that knows this ontology can understand in a way this is an example."
        ],
        [
            "Yeah, this guy is not Bill Clinton, although it's very it.",
            "Looks like him is Miles Davis is 1 semantic weapon, some answer with three zero at SQL it some advantages of this type of technologies.",
            "He says that he said that the key notion of the semantic technologies to represent meanings and knowledge separated from the contents in a digital format that was humans and machines could access or interpret.",
            "He's talking about information that is somehow separated information and knowledge is are somehow separated and it can be interpretable by both human and machine, which is what the website is really about.",
            "And this is a very important, very important thing.",
            "Separating knowledge from information we have young said before.",
            "With the Semantic web server layers, we have the information, the data one of the layers, the modeling of the knowledge is in another layer.",
            "I even the instances of this of this model are in a different layer, so this having this separation we can easily.",
            "Ted, do perform some machine processing that here and help us on delivering this knowledge."
        ],
        [
            "To the humans.",
            "So what do we really need?",
            "Having this in mind?",
            "So we have that data, but you have to give meaning to the data.",
            "This data that has been displayed.",
            "We have to make it machine understandable as I told you before.",
            "We have to tie up all of this meeting together.",
            "Let's say having we will see what ontologies we're having an ontology that ties all this meaning.",
            "Give her the machines the tools or intelligence to that.",
            "Use an correctly recognize what humans are using word for.",
            "Let's say, let's say we have a mind we have recently process.",
            "We have say in order to get some machine understandable web we need to do to, let's say to give to the web a reasoning process if not similar to us at at least two hours of this, something that is close in away.",
            "So the building blocks will be.",
            "Data.",
            "Resources that are marked up with descriptions based on the model.",
            "That is, an ontology.",
            "Ontologies of course.",
            "That is this common understanding of the domain that the young was talking about before.",
            "This is what semantic web design is about.",
            "Mostly the semantic web can be seen as infrastructure based on metadata to reason over the web.",
            "Yeah, I'm talking always about semantic web, but we should probably talk about semantic technologies that you requested.",
            "This technology is not only based on web on the web, but I guess this is a good starting point.",
            "In order to get a feeling of what that semantic technologies are about.",
            "So the this is important to to say that this is an aneurysm territory is not an attribute that will replace everything.",
            "That is the idea that this is another reason that we collaborate with other ontology with other technologies in order to achieve our goals.",
            "So the idea is that you have a process that works perfectly with a given technology, maybe without using semantic technologies.",
            "We can improve and handsome how this process is not about replacing the.",
            "Or any basement, but about, let's say giving some extra extra hour full tools in order to get some chips and some of the issues that cannot be achieved with the current status of the audit authority."
        ],
        [
            "What we can see here is that the.",
            "So let's say the current web is static, static in away and syntactic.",
            "They say no, we don't have semantic information at.",
            "This poses several problems in information finding, extracting, representing information, interpreting this information, and maintaining this information.",
            "And this is how aggravated, because we have the web is growing up, growing all the time, so we have billions of users and billions of web pages, and it's increasing all the time.",
            "So finding the right information is not.",
            "So we see that it could be maybe 10 or 15 years ago nowadays is we are overwhelmed by information."
        ],
        [
            "Just take another stab Lish.",
            "What what we want to do achieve his by marking somehow but having this word semantic web into account going from the syntactic part of the semantic part, giving the web the better, better knowledge is trapped in another presentation in order to make it Mac machine readable, that's like."
        ],
        [
            "Yeah.",
            "So.",
            "What we have here is there the ontology stack.",
            "This is the semantic web stack.",
            "This is an illustration that you can find, for instance in Wikipedia.",
            "Searching for this and this is an illustration of the hierarchy of languages.",
            "Why you think you can see?",
            "Probably that is based on the previous status on the web, so we are not.",
            "This is not revolutionary, so is evolutionary in a way we are building on top of identifiers like where I store XML, but you can see there's an.",
            "Some new words or words that you already know, like at the FADFSI will spark your so that we are building on top of these layers in order to give more meaning that you get to be permanent to the data into the knowledge.",
            "This cave first illustration was created by the guy I presented before the team versus Lee.",
            "Any siblings, so it's not a final one.",
            "This is the latest one that is in the week in the Wikipedia and every day you can see changes on this.",
            "So they are in a way, where did you see the?",
            "Illustration or there, this this RDF stuff is very very well even for declaring your love to a woman because it's very some say.",
            "The same distracted us as a human sentence subject object predicate.",
            "So in a way we're trying to represent the knowledge in a way that is understandable not only format is bad for you."
        ],
        [
            "This is more or less they're saying, but from a from, let's say the languages where point of view the knowledge representation versus the increases, metadata and knowledge representation, and increasing, decreasing their reasoning capability so you can see here many, many many words, you see that the different logic levels that we do increase on the.",
            "On both sides you are going more.",
            "Let's say two away that it's more difficult, more difficult to interpret.",
            "Even for machines becausw.",
            "If you do give many logics, too many semantics to an expression.",
            "In the end where is difficult to understand even for matches is not so easy.",
            "We are nowadays more less working with the somehow in the middle.",
            "Using this out, that is ontology web language representation at the F at DFS subscription logic we are more or less nowadays using this, but there are many research and all this stuff is just for you to have a look at the.",
            "At."
        ],
        [
            "No less representation.",
            "But the important thing is to define clearly what an ontology is, because we're having talking about all this all the time.",
            "But what is really ontology this?",
            "This is a classical definition was given by Tom Groovers and years ago an did you look at it?",
            "Probably you don't understand anything, but I'm going to go into details now.",
            "So he said and ontologies have formal explicit specification of our share.",
            "Ghost comes at police station, very clear.",
            "If we go into details, we say we can see this this world shared with conceptual knowledge.",
            "No knowledge of having somehow concentrated between between different people.",
            "On this shirt I'm on all these people.",
            "Conceptualization means that.",
            "Top Model is, let's say, I suppose is always a simplified view.",
            "The world of the domain that we are that we are dealing with and we want to represent it in a way that can be can be used by others.",
            "So we have to share uncontestable eyes in a way.",
            "Form I mean that is machine readable, which is the name of the.",
            "The website I told you before.",
            "An explicit specification means that this model is a stock model is based on several objects that such as concept properties, relation functions, actions, constraints that are explicitly defined, and this is very important that should be explicit, is not something that is aromatic in a way.",
            "This is something that is explicit, so you have a look at this sentence having in mind all this this gives you.",
            "This computer gives you an idea of a better idea what an ontology releases a model that is shared that is explicit and based on commercial properties, relations and that can be readable by machines.",
            "Or this is the main the main goal of an ontology.",
            "In a way you have seen this in another movies, so analogy is not going to.",
            "We like the so running that roller three of the rings is not going to take over over.",
            "There were, but the idea is that even the even this ring was distributed because you have this definition of the ring will have many rings that you have in you have seen the film.",
            "You have many reasons but all of them are somehow related to the first one.",
            "So we have some markets between them.",
            "I mean this only if I have to hurry up."
        ],
        [
            "I guess keep the surrounding.",
            "So I talked to you about concentration.",
            "She functions instances of axioms so this."
        ],
        [
            "Smallest clear.",
            "And there are several methodologies around how to engineer ontology.",
            "I'm going to show you very briefly and methodology.",
            "For instance, happy in the developing another European project.",
            "This is called the Neon project, but all of the methodologies are more or less similar.",
            "So in a new project we have this series of steps that have to be done in order to engineer to create a new ontology.",
            "This is ontology specification where you specify the goals and.",
            "Main question that you are going to perform to ontology, the conceptualization they are, the creation of the first creation of the model formalisation.",
            "The model is going to be some specific concepts, obvious properties.",
            "And the final implementation, which is the final, the final status odontology, and for that we discovered this methodology is not going to it as I have many steps.",
            "But the main thing is that this methodology is all mythological related with ontology engineering.",
            "Are reusing somehow the stuff that is right now right now on the web?",
            "Because in the past it was complicated to start from scratch creating ontology.",
            "But now there are many ontology on the web.",
            "You can download it, use it, use them.",
            "Yeah, or even even modify them in order to achieve your goals.",
            "So this this methodology as many others reuse these ontologies and proper, let's say, propose some steps to be done and in order to to create this ontologies.",
            "But this is.",
            "I know a manual process that is costly and in the end you have a very good ontology, but this is a costly process so."
        ],
        [
            "So the main idea.",
            "Is to have a son semi automatic support automatic support in order to create ontology or at least for the first steps of creating of your ontology creation or engineering.",
            "This is what the ontology learning or distance learning is about.",
            "And there are of course wasting automatic becausw.",
            "On the one hand, we are facilitating to humans their way of creating ontologies, Internet roses, and on the other hand.",
            "Is clear that humans should be in the loop somehow.",
            "Becausw they we need to, let's say to assess that there was a.",
            "Is there is correct imaginal?",
            "I need health ontology and we fail creating ontology automatically.",
            "It can be a mess if we are dealing with patients or something.",
            "All this stuff so our human has usually has to be on the loop.",
            "This is one more less work that out.",
            "It's about it and we have one of the objectives to this semi automatic domain ontology creation from documentation and legacy content."
        ],
        [
            "So this is 1 important thing."
        ],
        [
            "A few words very, very quickly about semantic web services.",
            "This is what web services about this hobby is providing some dynamism to the web, making some softwares or certain application available to the users that probably the pass was closed to internal system with a given industry or or it was not so available on the web or no web based infrastructure this."
        ],
        [
            "The.",
            "I'm going to go very quickly because you probably know what services about is.",
            "A is usually connected with the SOA that was with the.",
            "These open architectures they have usually this this characteristic loosely coupled distributed."
        ],
        [
            "And that functionality.",
            "They are basic normally or in the past it was based on UDDI, their definition of their services was I XML like which is file which is the whistle file.",
            "This normally they serve consumer have to discover the service.",
            "The idea was that we will have an UDDI that there was a kind of registry or yellow page for discovering services."
        ],
        [
            "But in the end, this you did I didn't work very well.",
            "Then send invitation with the.",
            "But in fact if you go to the UDS not so easy to find the services and many people that don't put their services in an UDDI Reggie."
        ],
        [
            "Three so.",
            "This is the idea I'm going."
        ],
        [
            "Quickly, because otherwise I don't have time to finish everything.",
            "This is a weasel at typical weasel file with the different methods that they provide to access to the systems with the operations input outputs the binding to the real services, whether the."
        ],
        [
            "Yes, RBCS.",
            "But of course we have some problems.",
            "This description are syntactic.",
            "Is our XML basic based, but they are syntactic.",
            "We do see here there that you have to provide a price on a string.",
            "This this price we don't really know how these prices provided.",
            "If it is in euros in dollars.",
            "If you have to put there the.",
            "Decimals or whatever, so it's difficult to even understand, although it was made in the first in the first place for a better understanding.",
            "And of course, if you have to, you have to somehow compose the services where not only one service, but several service together is a problem.",
            "Do it automatically, do it automatically cause where you don't have the tools for out of this process.",
            "Automation so so easily.",
            "And there is a subtitle before approved by adoption.",
            "So discovering service on the work is not an asset as most of the services you discover this week 'cause you can find them.",
            "In Google or or you know about them because they are provided by you or your colleagues or whatever."
        ],
        [
            "So the idea is going from this program is going to.",
            "I'm having in mind that we have this.",
            "Semantic approach going to another layer that would be the semantic web service that will probably will provide dynamism to the semantic web and web services bringing their work to do it."
        ],
        [
            "Full potential so.",
            "Semantic Web services is about semantic web technology applied to web service technology.",
            "Let's say we have all these semantic technology or ontologies and somehow we have to provide this.",
            "We have to apply this technology to the web services in order to be able to describe service properties.",
            "To search for these services too.",
            "Create, create compositional services that can be automated somehow an executed by by machines, not only you create compose services that we have seen before.",
            "In the case of the sample of their tuition.",
            "But the machine that can come that that can be out there that can automate somehow the composition of services."
        ],
        [
            "Yeah, well, this is more of the same we have there.",
            "We are not building from scratch again.",
            "We are.",
            "We are based on web service, technology, web Services standards an using semantics.",
            "We're building semantic."
        ],
        [
            "Services there are many or several frameworks or languages that deals with semantic ontologies with semantic web services and not going to into details of the difference between these within these layers.",
            "But an example is with more, which is an European initiative of the scoring semantic Web."
        ],
        [
            "Services and an example of a typical invocation of this sample is that someone user has a goal he wants to buy a ticket flight ticket and make a hotel reservation and instead of going directly to the web pages that he knows, he just asked to the system to find for him services that match with the with the code.",
            "Then the system will decide and discover some services, one for prison for.",
            "Flight reservation, another one for a hotel reservation.",
            "It will decide this system will point to these services and then retrieve the result for the users.",
            "That hopefully will be happy with the results.",
            "Instead of having to find, find them by making stops and this is an example of how."
        ],
        [
            "On the web services."
        ],
        [
            "Work.",
            "A few words about."
        ],
        [
            "Application of semantic technologies you have seen previously this image.",
            "Very well known, so one of the Semantic Web application areas is semantic interoperability.",
            "We describe with a common terminology.",
            "In different applications and data we are helping in the interoperability in the interpretive problem we are.",
            "We are helping to understand these applications of these data to understand each other.",
            "Is transforming information into knowledge learning this knowledge is a as you have seen, is one of the applications applications.",
            "Discovery discoveries about having annotation of different data, available sources and so on, we are able to better discover what they're doing an execute them.",
            "Yeah, this is applied as well for search and navigation based on semantics, so it's seeing you can see beyond what it normally other other.",
            "Order engines search engines will will look for.",
            "Typically, an application is for instance semantic desktop.",
            "So you mark you market with I come on a common language, common terminology.",
            "We might go there, or what do you have in your desktop?",
            "And then you are able to better locate and and work with which you only sources.",
            "Composition, automatic complexity from simple things, this is something that we have been talking about before.",
            "And if we apply recently, no to all these things, we have systems that know what they are with information they are dealing with, the with the knowledge, and there are many other media other possible applications.",
            "Assassin architectures, we cause the collaboration.",
            "We have not been talking about 20 between 2 zero is quite related in a way with the semantic technologies and they work together very closely in some some possible applications on college engineering, information sharing, assessment systems and so on.",
            "So there are many, many possible applications that can be achieved because it is unreasonable."
        ],
        [
            "Buddy so semantic web is have some many strong foundation that have strong foundation research results.",
            "But we until now we have very few real industrial implementation.",
            "There are some but not many.",
            "Of course this is be cause there are a life cycle of adoption of technology as well as as we probably know, so right now we are more or less in this one to six points.",
            "We are now at 4, moving to five.",
            "Probably this is my opinion.",
            "And so we are not is used by some some people, but businesses still have not adopted."
        ],
        [
            "The technology.",
            "So we are more or less finishing or in the early adopters markets, but not in the in the mainstream markets.",
            "But we are close now and we, as you have seen the previous presentation, there has been research for many years in this respect and now we are reaching the markets and still there is research going on, But in this specific parts."
        ],
        [
            "Well, this is a revolution of the website.",
            "According to the radar networks.",
            "We are now more listed in this with 3.0 or rich and this with wet.",
            "Reconsider with some mixture in a in a way between semantic technologies with Web 20.",
            "This social social thing that is going around but we are going or this is the definition to a better world.",
            "They will wait for zero or or the future.",
            "The future Internet that is calling other in other places that is happening in a way that the web will be.",
            "Platform 4 for executing application not only for search for for communication that."
        ],
        [
            "So the main idea is there or these leases life.",
            "There are of course some do's and don'ts regarding the adoption of this technology, and this is some guidelines for the semantic Web adoption.",
            "I'm not going to details like the idea is that if you want to adopt this technology, as with any technology, the 1st first thing to do is to create a pilot at the first prototype, start from there and then see if it fits your needs.",
            "An find out what you can do later on, but of course it's a new technology so you have to train people on this, your organizations and what you do.",
            "You shouldn't do is to go it alone because semantic web, although is simply in a way, is complex, so it's better to get some help on this.",
            "And you don't.",
            "You shouldn't be impatient because this is a technology that is growing.",
            "You can start from some pilots and then continue with that."
        ],
        [
            "So this is a recap of what we have been talking about, so it's about automatic worries about integrate data, content application and processes via various shared ontology.",
            "A.",
            "We said technologies are meaning centered.",
            "They're dealing with metadata ontologies which this semantic web technology you support.",
            "That integration, enterprise interoperability.",
            "The discovery and composition of web services and web services in general an it's based on the standards that were used.",
            "ECS standards for many that I use for creating many, many things so their main things that stresses that semantics are here to stay.",
            "Hopefully this is what we think.",
            "So probably will improve your way of dealing with information."
        ],
        [
            "Knowledge in the future.",
            "And does it?",
            "You have any questions?",
            "No, no you have.",
            "We have many too much time but we.",
            "Yeah, but.",
            "Robert, programmer.",
            "What you see?",
            "Which is not the way to make the comparison between the weapon.",
            "No.",
            "1482 leaving now.",
            "So.",
            "What did you think about that?",
            "Pickle you cannot argue you cannot make the comparison between programming.",
            "Jason was made not for adoption purposes, but in order to understand what semantic work is about.",
            "It is true that semantic web has been around for four 8 to 10 years.",
            "But is a technology that is, let's say, emerging is not at the process of 1st of research on some problems that we had in the past and we still have some time to resolve in order to make the technology available and the performance to be the one.",
            "That we expect.",
            "And now I think the semantic web is.",
            "Taking off as just as you said, it is not, let's say, a spectacular for the technologies.",
            "Take off of all the technology such as what to say or something like that, but I think they signal is being adopted by many companies right now.",
            "So The thing is that.",
            "So somebody is not only about semantic search or semantic web services, there are many fields, many layers on this generation total technology, so some people are using it for.",
            "Let's say you get started a small not to go into the whole potential and this is the way the way to proceed.",
            "Starting small and then we hope that it will take off in the next few years.",
            "But of course it's not compatible in terms of, let's say, coverage with the current web.",
            "Do you have time images?",
            "Yeah, I was wondering what type of project to test in Spain in what type of industry?",
            "The process we are now example in at the story in Spain we are, you know, creating a prototype or in the internal web and the Internet.",
            "In order to to annotate in or within a small, let's say domain, this model main annotating content of the work in order to give a semantic search improves.",
            "This is an example of adoption that we are implementing right now is not as still available, but it's going to be in a few months."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think that in any case we need to have a common ground on what the semantic web is.",
                    "label": 0
                },
                {
                    "sent": "An ontologies are and all this stuff.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's introduce.",
                    "label": 0
                },
                {
                    "sent": "First agenda this I will have the first introduction in the semantic Web.",
                    "label": 0
                },
                {
                    "sent": "Then I am going to spend a little bit of time on the semantic web service aside because it's something that is quite related with with cow and then a few words about application of semantic technologies.",
                    "label": 0
                },
                {
                    "sent": "In some some fields I'm not going to give any any.",
                    "label": 0
                },
                {
                    "sent": "Details, because this is a very.",
                    "label": 0
                },
                {
                    "sent": "You broke the.",
                    "label": 0
                },
                {
                    "sent": "Very broad agenda for an introduction of the semantic Web, but at least just to have for you to have a look at the semantic web is about and the application fields.",
                    "label": 1
                },
                {
                    "sent": "That some of the words.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sing for.",
                    "label": 0
                },
                {
                    "sent": "So first of all from I would like to start from the current status of the order Web today and then go into the semantic Web.",
                    "label": 0
                },
                {
                    "sent": "So as you know, the web presented content in multiple ways.",
                    "label": 1
                },
                {
                    "sent": "There's not only textual test, well content, but there is multimedia content as well As for content can be in many languages.",
                    "label": 1
                },
                {
                    "sent": "As you know French, English, Spanish, any type of language.",
                    "label": 0
                },
                {
                    "sent": "So this is something that is clear.",
                    "label": 1
                },
                {
                    "sent": "That we humans are able to process, but it's not so clear that machine could process in a way so the as we are, say intelligence, we can take this content an be we are able to process it.",
                    "label": 1
                },
                {
                    "sent": "Making deductions because we our mind is capable of doing this type of reasoning and this action can be based on incomplete information.",
                    "label": 1
                },
                {
                    "sent": "We can complete the gaps using our minds and we can link the different context.",
                    "label": 0
                },
                {
                    "sent": "Finding the web using free Association using our reasoning capabilities.",
                    "label": 0
                },
                {
                    "sent": "So we are used to make it with several sensors, not only with the with the our site, but with our hearing and all our sensors.",
                    "label": 0
                },
                {
                    "sent": "So the web some user interface on the web, not only based on visual information but in other type of sensors as well.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let's say let's say that the web has a revolutionary impact in our way of working because we use usually the web for working nowadays, studying, or even having fun.",
                    "label": 0
                },
                {
                    "sent": "As you, as you already know, and they will provide access, provides access to almost almost anytime, anywhere to everybody.",
                    "label": 0
                },
                {
                    "sent": "So this is true.",
                    "label": 0
                },
                {
                    "sent": "That has some major change that we have.",
                    "label": 0
                },
                {
                    "sent": "We have seen during the last years and this is the current status, let's say.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Work today.",
                    "label": 0
                },
                {
                    "sent": "But there are some tasks that we perform in Internet that there is also the combination of all of this data.",
                    "label": 0
                },
                {
                    "sent": "Not this coming forward from different resources, not only from one web page, but we can go and navigate to too many webpages.",
                    "label": 0
                },
                {
                    "sent": "An income somehow combined all this information in order to get our our goal.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have a couple of examples like hotels, rental flight we want to.",
                    "label": 0
                },
                {
                    "sent": "Go to a someplace we will go to the Internet with book flights.",
                    "label": 0
                },
                {
                    "sent": "We book hotels, we rent cars for Internet, so this is something that is a complex process that we say as humans are capable of dealing with in the current in the current graph.",
                    "label": 0
                },
                {
                    "sent": "Or search on better libraries and you can think of many examples of this type of behavior that we humans have on the web.",
                    "label": 0
                },
                {
                    "sent": "Even if they they all this information comes from different technologies there or languages we are able somehow sonar abilities, but we can.",
                    "label": 1
                },
                {
                    "sent": "We can combine all this information.",
                    "label": 0
                },
                {
                    "sent": "So let's say that there are many informational too much information on the web is human oriented cause the work is made basically for humans.",
                    "label": 0
                },
                {
                    "sent": "Therefore, it's difficult to organize an and automate, and this is a problem that that from the past year we are we.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or we're dealing with.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, the matching machines are ignorant, if not in the way that they are not able to reason exactly the same way that that we do, so they don't know exactly how to deal with incomplete information.",
                    "label": 1
                },
                {
                    "sent": "They they find information about one thing, but it's incomplete.",
                    "label": 0
                },
                {
                    "sent": "They cannot process in the same way that we that we do so in the web.",
                    "label": 0
                },
                {
                    "sent": "This is a problem.",
                    "label": 0
                },
                {
                    "sent": "Where there are some contents on the web that the machines cannot process easily or that they cannot extract knowledge from this content on the web.",
                    "label": 0
                },
                {
                    "sent": "We have here the example of yeibicheii or bandits in there that they cannot access to this information and process it and extract knowledge from there as we do because we have to look at the visual diagram or at at the cartoon and we are able to see to see what is what is going on with the.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, there in the past years we have developed some software there based on artificial artificial intelligence techniques that was able to extract automatically or semiautomatically information from from these resources, but traditionally it was very expensive.",
                    "label": 0
                },
                {
                    "sent": "So what we needed was an evolution of this in order to get this information.",
                    "label": 0
                },
                {
                    "sent": "Ray and of course we have had difficulties from binary information for machines, but she is having difficulties and combine information because they don't have a common vocabulary in a way for us it's very easy to see, for instance this full creator and other author and think OK, this should be more or less the same, but for machine this is not clear at all.",
                    "label": 0
                },
                {
                    "sent": "These are only test and that cannot be processed any easily.",
                    "label": 0
                },
                {
                    "sent": "So XML is under step on this direction, but this terminology differences marked.",
                    "label": 0
                },
                {
                    "sent": "A problem, and this is what we need to do.",
                    "label": 0
                },
                {
                    "sent": "So this is a challenge, a challenge for the web.",
                    "label": 0
                },
                {
                    "sent": "From the Human base web, we have to go to machine matching based or human and machine based weapon in order to automate some processes and the different agents we have to be able to understand what the weapon knowledge is about.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so yeah for that.",
                    "label": 0
                },
                {
                    "sent": "What we what we need is to describe in our this knowledge of this information that we have on the web in a way that the machines could understand and that's it.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is where the semantic web technologies is about.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I shot the sample of how the code is.",
                    "label": 0
                },
                {
                    "sent": "The current web is based on HTML.",
                    "label": 1
                },
                {
                    "sent": "So if you have a look at, this is a typical web page with the typical.",
                    "label": 0
                },
                {
                    "sent": "The correct email, a source that you can click in your browser.",
                    "label": 0
                },
                {
                    "sent": "You can see this type of shows, so you see here that the for instance with the retail price which is $1313.00.",
                    "label": 0
                },
                {
                    "sent": "So you are able to understand easily what this retirement retail price is about.",
                    "label": 0
                },
                {
                    "sent": "But imagine a machine that they cannot cannot straight from here.",
                    "label": 0
                },
                {
                    "sent": "Really, the meaning of this information because they OK.",
                    "label": 0
                },
                {
                    "sent": "Yes, if you are doing the data mining process you can say OK, this this price is the retail price but you have to program it.",
                    "label": 0
                },
                {
                    "sent": "It's not completely automated process so.",
                    "label": 0
                },
                {
                    "sent": "So what this is what software agents will do?",
                    "label": 0
                },
                {
                    "sent": "This guess about the meaning of this information.",
                    "label": 0
                },
                {
                    "sent": "With this information we don't have their complete, let's say, tagging in order to get their real knowledge of this behind this in for me.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you probably know this guy.",
                    "label": 0
                },
                {
                    "sent": "This is Tim purposely, which is the one of the inventors of the web.",
                    "label": 0
                },
                {
                    "sent": "Another with the semantic Web as well.",
                    "label": 0
                },
                {
                    "sent": "So he defined in a way the Semantic Web exhibition.",
                    "label": 0
                },
                {
                    "sent": "Is this idea of having that data on the web link it that can be used by machines for automation, integration and reuse of data across various applications?",
                    "label": 0
                },
                {
                    "sent": "So this is a division that he had to.",
                    "label": 0
                },
                {
                    "sent": "The semantic web is what really semantic web is about, so you have an infrastructure where machine can comprehend semantic data.",
                    "label": 0
                },
                {
                    "sent": "Data understands the knowledge of humans.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that machines are therefore in general for human purposes, so they.",
                    "label": 0
                },
                {
                    "sent": "They need to extract information knowledge and presented today to the humans in a better way.",
                    "label": 0
                },
                {
                    "sent": "That's the main.",
                    "label": 0
                },
                {
                    "sent": "The main goal of the agents.",
                    "label": 0
                },
                {
                    "sent": "Companies that are on the web.",
                    "label": 0
                },
                {
                    "sent": "So the idea is is that this infrastructure can improve and enhance the knowledge that they were humans.",
                    "label": 0
                },
                {
                    "sent": "Construction work in the same way.",
                    "label": 0
                },
                {
                    "sent": "So meaningful information enables machine to infer knowledge.",
                    "label": 0
                },
                {
                    "sent": "This is 1 important thing that there are a lot of a lot of knowledge that are that is somehow hidden behind the scenes and this is not this can be a strategically it is.",
                    "label": 0
                },
                {
                    "sent": "If it is, that's a annotated in the in the in a good way.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what a sample of the same type of word using in this case, an ontology.",
                    "label": 0
                },
                {
                    "sent": "I'm going to define.",
                    "label": 0
                },
                {
                    "sent": "Better with an ontology is, although you probably know more than me.",
                    "label": 0
                },
                {
                    "sent": "Even so, this is an example of how using a couple a couple of ontologies, music, Ontology and Commerce Ontology that has defined some common vocabulary like title, artist, currency, product price and so on will define the different different.",
                    "label": 0
                },
                {
                    "sent": "Let's say parts of this web page so we can see here that the retail prices.",
                    "label": 0
                },
                {
                    "sent": "Uh, I guess middle tier back here that is priced that it's the price that is based on the concept that is in the in the E Commerce and treasure.",
                    "label": 0
                },
                {
                    "sent": "Do help with this below this is a dummy example of how an ontology would look like, but this is the same.",
                    "label": 0
                },
                {
                    "sent": "The same information can be taking away that machine that knows this ontology can understand in a way this is an example.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, this guy is not Bill Clinton, although it's very it.",
                    "label": 0
                },
                {
                    "sent": "Looks like him is Miles Davis is 1 semantic weapon, some answer with three zero at SQL it some advantages of this type of technologies.",
                    "label": 0
                },
                {
                    "sent": "He says that he said that the key notion of the semantic technologies to represent meanings and knowledge separated from the contents in a digital format that was humans and machines could access or interpret.",
                    "label": 0
                },
                {
                    "sent": "He's talking about information that is somehow separated information and knowledge is are somehow separated and it can be interpretable by both human and machine, which is what the website is really about.",
                    "label": 0
                },
                {
                    "sent": "And this is a very important, very important thing.",
                    "label": 0
                },
                {
                    "sent": "Separating knowledge from information we have young said before.",
                    "label": 0
                },
                {
                    "sent": "With the Semantic web server layers, we have the information, the data one of the layers, the modeling of the knowledge is in another layer.",
                    "label": 0
                },
                {
                    "sent": "I even the instances of this of this model are in a different layer, so this having this separation we can easily.",
                    "label": 0
                },
                {
                    "sent": "Ted, do perform some machine processing that here and help us on delivering this knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To the humans.",
                    "label": 0
                },
                {
                    "sent": "So what do we really need?",
                    "label": 1
                },
                {
                    "sent": "Having this in mind?",
                    "label": 0
                },
                {
                    "sent": "So we have that data, but you have to give meaning to the data.",
                    "label": 1
                },
                {
                    "sent": "This data that has been displayed.",
                    "label": 0
                },
                {
                    "sent": "We have to make it machine understandable as I told you before.",
                    "label": 0
                },
                {
                    "sent": "We have to tie up all of this meeting together.",
                    "label": 1
                },
                {
                    "sent": "Let's say having we will see what ontologies we're having an ontology that ties all this meaning.",
                    "label": 0
                },
                {
                    "sent": "Give her the machines the tools or intelligence to that.",
                    "label": 0
                },
                {
                    "sent": "Use an correctly recognize what humans are using word for.",
                    "label": 1
                },
                {
                    "sent": "Let's say, let's say we have a mind we have recently process.",
                    "label": 0
                },
                {
                    "sent": "We have say in order to get some machine understandable web we need to do to, let's say to give to the web a reasoning process if not similar to us at at least two hours of this, something that is close in away.",
                    "label": 0
                },
                {
                    "sent": "So the building blocks will be.",
                    "label": 0
                },
                {
                    "sent": "Data.",
                    "label": 0
                },
                {
                    "sent": "Resources that are marked up with descriptions based on the model.",
                    "label": 0
                },
                {
                    "sent": "That is, an ontology.",
                    "label": 0
                },
                {
                    "sent": "Ontologies of course.",
                    "label": 0
                },
                {
                    "sent": "That is this common understanding of the domain that the young was talking about before.",
                    "label": 0
                },
                {
                    "sent": "This is what semantic web design is about.",
                    "label": 0
                },
                {
                    "sent": "Mostly the semantic web can be seen as infrastructure based on metadata to reason over the web.",
                    "label": 1
                },
                {
                    "sent": "Yeah, I'm talking always about semantic web, but we should probably talk about semantic technologies that you requested.",
                    "label": 0
                },
                {
                    "sent": "This technology is not only based on web on the web, but I guess this is a good starting point.",
                    "label": 0
                },
                {
                    "sent": "In order to get a feeling of what that semantic technologies are about.",
                    "label": 0
                },
                {
                    "sent": "So the this is important to to say that this is an aneurysm territory is not an attribute that will replace everything.",
                    "label": 0
                },
                {
                    "sent": "That is the idea that this is another reason that we collaborate with other ontology with other technologies in order to achieve our goals.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that you have a process that works perfectly with a given technology, maybe without using semantic technologies.",
                    "label": 0
                },
                {
                    "sent": "We can improve and handsome how this process is not about replacing the.",
                    "label": 0
                },
                {
                    "sent": "Or any basement, but about, let's say giving some extra extra hour full tools in order to get some chips and some of the issues that cannot be achieved with the current status of the audit authority.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we can see here is that the.",
                    "label": 0
                },
                {
                    "sent": "So let's say the current web is static, static in away and syntactic.",
                    "label": 0
                },
                {
                    "sent": "They say no, we don't have semantic information at.",
                    "label": 0
                },
                {
                    "sent": "This poses several problems in information finding, extracting, representing information, interpreting this information, and maintaining this information.",
                    "label": 1
                },
                {
                    "sent": "And this is how aggravated, because we have the web is growing up, growing all the time, so we have billions of users and billions of web pages, and it's increasing all the time.",
                    "label": 0
                },
                {
                    "sent": "So finding the right information is not.",
                    "label": 0
                },
                {
                    "sent": "So we see that it could be maybe 10 or 15 years ago nowadays is we are overwhelmed by information.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just take another stab Lish.",
                    "label": 0
                },
                {
                    "sent": "What what we want to do achieve his by marking somehow but having this word semantic web into account going from the syntactic part of the semantic part, giving the web the better, better knowledge is trapped in another presentation in order to make it Mac machine readable, that's like.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What we have here is there the ontology stack.",
                    "label": 0
                },
                {
                    "sent": "This is the semantic web stack.",
                    "label": 0
                },
                {
                    "sent": "This is an illustration that you can find, for instance in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Searching for this and this is an illustration of the hierarchy of languages.",
                    "label": 0
                },
                {
                    "sent": "Why you think you can see?",
                    "label": 0
                },
                {
                    "sent": "Probably that is based on the previous status on the web, so we are not.",
                    "label": 0
                },
                {
                    "sent": "This is not revolutionary, so is evolutionary in a way we are building on top of identifiers like where I store XML, but you can see there's an.",
                    "label": 0
                },
                {
                    "sent": "Some new words or words that you already know, like at the FADFSI will spark your so that we are building on top of these layers in order to give more meaning that you get to be permanent to the data into the knowledge.",
                    "label": 0
                },
                {
                    "sent": "This cave first illustration was created by the guy I presented before the team versus Lee.",
                    "label": 0
                },
                {
                    "sent": "Any siblings, so it's not a final one.",
                    "label": 0
                },
                {
                    "sent": "This is the latest one that is in the week in the Wikipedia and every day you can see changes on this.",
                    "label": 0
                },
                {
                    "sent": "So they are in a way, where did you see the?",
                    "label": 0
                },
                {
                    "sent": "Illustration or there, this this RDF stuff is very very well even for declaring your love to a woman because it's very some say.",
                    "label": 0
                },
                {
                    "sent": "The same distracted us as a human sentence subject object predicate.",
                    "label": 0
                },
                {
                    "sent": "So in a way we're trying to represent the knowledge in a way that is understandable not only format is bad for you.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is more or less they're saying, but from a from, let's say the languages where point of view the knowledge representation versus the increases, metadata and knowledge representation, and increasing, decreasing their reasoning capability so you can see here many, many many words, you see that the different logic levels that we do increase on the.",
                    "label": 0
                },
                {
                    "sent": "On both sides you are going more.",
                    "label": 0
                },
                {
                    "sent": "Let's say two away that it's more difficult, more difficult to interpret.",
                    "label": 0
                },
                {
                    "sent": "Even for machines becausw.",
                    "label": 0
                },
                {
                    "sent": "If you do give many logics, too many semantics to an expression.",
                    "label": 0
                },
                {
                    "sent": "In the end where is difficult to understand even for matches is not so easy.",
                    "label": 0
                },
                {
                    "sent": "We are nowadays more less working with the somehow in the middle.",
                    "label": 0
                },
                {
                    "sent": "Using this out, that is ontology web language representation at the F at DFS subscription logic we are more or less nowadays using this, but there are many research and all this stuff is just for you to have a look at the.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No less representation.",
                    "label": 0
                },
                {
                    "sent": "But the important thing is to define clearly what an ontology is, because we're having talking about all this all the time.",
                    "label": 1
                },
                {
                    "sent": "But what is really ontology this?",
                    "label": 0
                },
                {
                    "sent": "This is a classical definition was given by Tom Groovers and years ago an did you look at it?",
                    "label": 0
                },
                {
                    "sent": "Probably you don't understand anything, but I'm going to go into details now.",
                    "label": 0
                },
                {
                    "sent": "So he said and ontologies have formal explicit specification of our share.",
                    "label": 1
                },
                {
                    "sent": "Ghost comes at police station, very clear.",
                    "label": 0
                },
                {
                    "sent": "If we go into details, we say we can see this this world shared with conceptual knowledge.",
                    "label": 0
                },
                {
                    "sent": "No knowledge of having somehow concentrated between between different people.",
                    "label": 0
                },
                {
                    "sent": "On this shirt I'm on all these people.",
                    "label": 1
                },
                {
                    "sent": "Conceptualization means that.",
                    "label": 0
                },
                {
                    "sent": "Top Model is, let's say, I suppose is always a simplified view.",
                    "label": 0
                },
                {
                    "sent": "The world of the domain that we are that we are dealing with and we want to represent it in a way that can be can be used by others.",
                    "label": 1
                },
                {
                    "sent": "So we have to share uncontestable eyes in a way.",
                    "label": 0
                },
                {
                    "sent": "Form I mean that is machine readable, which is the name of the.",
                    "label": 0
                },
                {
                    "sent": "The website I told you before.",
                    "label": 0
                },
                {
                    "sent": "An explicit specification means that this model is a stock model is based on several objects that such as concept properties, relation functions, actions, constraints that are explicitly defined, and this is very important that should be explicit, is not something that is aromatic in a way.",
                    "label": 0
                },
                {
                    "sent": "This is something that is explicit, so you have a look at this sentence having in mind all this this gives you.",
                    "label": 0
                },
                {
                    "sent": "This computer gives you an idea of a better idea what an ontology releases a model that is shared that is explicit and based on commercial properties, relations and that can be readable by machines.",
                    "label": 0
                },
                {
                    "sent": "Or this is the main the main goal of an ontology.",
                    "label": 0
                },
                {
                    "sent": "In a way you have seen this in another movies, so analogy is not going to.",
                    "label": 0
                },
                {
                    "sent": "We like the so running that roller three of the rings is not going to take over over.",
                    "label": 0
                },
                {
                    "sent": "There were, but the idea is that even the even this ring was distributed because you have this definition of the ring will have many rings that you have in you have seen the film.",
                    "label": 0
                },
                {
                    "sent": "You have many reasons but all of them are somehow related to the first one.",
                    "label": 0
                },
                {
                    "sent": "So we have some markets between them.",
                    "label": 0
                },
                {
                    "sent": "I mean this only if I have to hurry up.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I guess keep the surrounding.",
                    "label": 0
                },
                {
                    "sent": "So I talked to you about concentration.",
                    "label": 0
                },
                {
                    "sent": "She functions instances of axioms so this.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Smallest clear.",
                    "label": 0
                },
                {
                    "sent": "And there are several methodologies around how to engineer ontology.",
                    "label": 0
                },
                {
                    "sent": "I'm going to show you very briefly and methodology.",
                    "label": 0
                },
                {
                    "sent": "For instance, happy in the developing another European project.",
                    "label": 0
                },
                {
                    "sent": "This is called the Neon project, but all of the methodologies are more or less similar.",
                    "label": 0
                },
                {
                    "sent": "So in a new project we have this series of steps that have to be done in order to engineer to create a new ontology.",
                    "label": 0
                },
                {
                    "sent": "This is ontology specification where you specify the goals and.",
                    "label": 0
                },
                {
                    "sent": "Main question that you are going to perform to ontology, the conceptualization they are, the creation of the first creation of the model formalisation.",
                    "label": 0
                },
                {
                    "sent": "The model is going to be some specific concepts, obvious properties.",
                    "label": 0
                },
                {
                    "sent": "And the final implementation, which is the final, the final status odontology, and for that we discovered this methodology is not going to it as I have many steps.",
                    "label": 0
                },
                {
                    "sent": "But the main thing is that this methodology is all mythological related with ontology engineering.",
                    "label": 0
                },
                {
                    "sent": "Are reusing somehow the stuff that is right now right now on the web?",
                    "label": 0
                },
                {
                    "sent": "Because in the past it was complicated to start from scratch creating ontology.",
                    "label": 0
                },
                {
                    "sent": "But now there are many ontology on the web.",
                    "label": 0
                },
                {
                    "sent": "You can download it, use it, use them.",
                    "label": 0
                },
                {
                    "sent": "Yeah, or even even modify them in order to achieve your goals.",
                    "label": 0
                },
                {
                    "sent": "So this this methodology as many others reuse these ontologies and proper, let's say, propose some steps to be done and in order to to create this ontologies.",
                    "label": 0
                },
                {
                    "sent": "But this is.",
                    "label": 0
                },
                {
                    "sent": "I know a manual process that is costly and in the end you have a very good ontology, but this is a costly process so.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the main idea.",
                    "label": 0
                },
                {
                    "sent": "Is to have a son semi automatic support automatic support in order to create ontology or at least for the first steps of creating of your ontology creation or engineering.",
                    "label": 0
                },
                {
                    "sent": "This is what the ontology learning or distance learning is about.",
                    "label": 0
                },
                {
                    "sent": "And there are of course wasting automatic becausw.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, we are facilitating to humans their way of creating ontologies, Internet roses, and on the other hand.",
                    "label": 0
                },
                {
                    "sent": "Is clear that humans should be in the loop somehow.",
                    "label": 1
                },
                {
                    "sent": "Becausw they we need to, let's say to assess that there was a.",
                    "label": 0
                },
                {
                    "sent": "Is there is correct imaginal?",
                    "label": 1
                },
                {
                    "sent": "I need health ontology and we fail creating ontology automatically.",
                    "label": 0
                },
                {
                    "sent": "It can be a mess if we are dealing with patients or something.",
                    "label": 0
                },
                {
                    "sent": "All this stuff so our human has usually has to be on the loop.",
                    "label": 1
                },
                {
                    "sent": "This is one more less work that out.",
                    "label": 0
                },
                {
                    "sent": "It's about it and we have one of the objectives to this semi automatic domain ontology creation from documentation and legacy content.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is 1 important thing.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A few words very, very quickly about semantic web services.",
                    "label": 0
                },
                {
                    "sent": "This is what web services about this hobby is providing some dynamism to the web, making some softwares or certain application available to the users that probably the pass was closed to internal system with a given industry or or it was not so available on the web or no web based infrastructure this.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "I'm going to go very quickly because you probably know what services about is.",
                    "label": 0
                },
                {
                    "sent": "A is usually connected with the SOA that was with the.",
                    "label": 0
                },
                {
                    "sent": "These open architectures they have usually this this characteristic loosely coupled distributed.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that functionality.",
                    "label": 0
                },
                {
                    "sent": "They are basic normally or in the past it was based on UDDI, their definition of their services was I XML like which is file which is the whistle file.",
                    "label": 0
                },
                {
                    "sent": "This normally they serve consumer have to discover the service.",
                    "label": 0
                },
                {
                    "sent": "The idea was that we will have an UDDI that there was a kind of registry or yellow page for discovering services.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But in the end, this you did I didn't work very well.",
                    "label": 0
                },
                {
                    "sent": "Then send invitation with the.",
                    "label": 0
                },
                {
                    "sent": "But in fact if you go to the UDS not so easy to find the services and many people that don't put their services in an UDDI Reggie.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Three so.",
                    "label": 0
                },
                {
                    "sent": "This is the idea I'm going.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quickly, because otherwise I don't have time to finish everything.",
                    "label": 0
                },
                {
                    "sent": "This is a weasel at typical weasel file with the different methods that they provide to access to the systems with the operations input outputs the binding to the real services, whether the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, RBCS.",
                    "label": 0
                },
                {
                    "sent": "But of course we have some problems.",
                    "label": 0
                },
                {
                    "sent": "This description are syntactic.",
                    "label": 0
                },
                {
                    "sent": "Is our XML basic based, but they are syntactic.",
                    "label": 1
                },
                {
                    "sent": "We do see here there that you have to provide a price on a string.",
                    "label": 0
                },
                {
                    "sent": "This this price we don't really know how these prices provided.",
                    "label": 0
                },
                {
                    "sent": "If it is in euros in dollars.",
                    "label": 0
                },
                {
                    "sent": "If you have to put there the.",
                    "label": 1
                },
                {
                    "sent": "Decimals or whatever, so it's difficult to even understand, although it was made in the first in the first place for a better understanding.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you have to, you have to somehow compose the services where not only one service, but several service together is a problem.",
                    "label": 0
                },
                {
                    "sent": "Do it automatically, do it automatically cause where you don't have the tools for out of this process.",
                    "label": 0
                },
                {
                    "sent": "Automation so so easily.",
                    "label": 0
                },
                {
                    "sent": "And there is a subtitle before approved by adoption.",
                    "label": 0
                },
                {
                    "sent": "So discovering service on the work is not an asset as most of the services you discover this week 'cause you can find them.",
                    "label": 0
                },
                {
                    "sent": "In Google or or you know about them because they are provided by you or your colleagues or whatever.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea is going from this program is going to.",
                    "label": 0
                },
                {
                    "sent": "I'm having in mind that we have this.",
                    "label": 0
                },
                {
                    "sent": "Semantic approach going to another layer that would be the semantic web service that will probably will provide dynamism to the semantic web and web services bringing their work to do it.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Full potential so.",
                    "label": 0
                },
                {
                    "sent": "Semantic Web services is about semantic web technology applied to web service technology.",
                    "label": 1
                },
                {
                    "sent": "Let's say we have all these semantic technology or ontologies and somehow we have to provide this.",
                    "label": 0
                },
                {
                    "sent": "We have to apply this technology to the web services in order to be able to describe service properties.",
                    "label": 1
                },
                {
                    "sent": "To search for these services too.",
                    "label": 0
                },
                {
                    "sent": "Create, create compositional services that can be automated somehow an executed by by machines, not only you create compose services that we have seen before.",
                    "label": 0
                },
                {
                    "sent": "In the case of the sample of their tuition.",
                    "label": 0
                },
                {
                    "sent": "But the machine that can come that that can be out there that can automate somehow the composition of services.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, well, this is more of the same we have there.",
                    "label": 0
                },
                {
                    "sent": "We are not building from scratch again.",
                    "label": 0
                },
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "We are based on web service, technology, web Services standards an using semantics.",
                    "label": 0
                },
                {
                    "sent": "We're building semantic.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Services there are many or several frameworks or languages that deals with semantic ontologies with semantic web services and not going to into details of the difference between these within these layers.",
                    "label": 0
                },
                {
                    "sent": "But an example is with more, which is an European initiative of the scoring semantic Web.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Services and an example of a typical invocation of this sample is that someone user has a goal he wants to buy a ticket flight ticket and make a hotel reservation and instead of going directly to the web pages that he knows, he just asked to the system to find for him services that match with the with the code.",
                    "label": 1
                },
                {
                    "sent": "Then the system will decide and discover some services, one for prison for.",
                    "label": 0
                },
                {
                    "sent": "Flight reservation, another one for a hotel reservation.",
                    "label": 0
                },
                {
                    "sent": "It will decide this system will point to these services and then retrieve the result for the users.",
                    "label": 0
                },
                {
                    "sent": "That hopefully will be happy with the results.",
                    "label": 0
                },
                {
                    "sent": "Instead of having to find, find them by making stops and this is an example of how.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the web services.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work.",
                    "label": 0
                },
                {
                    "sent": "A few words about.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Application of semantic technologies you have seen previously this image.",
                    "label": 0
                },
                {
                    "sent": "Very well known, so one of the Semantic Web application areas is semantic interoperability.",
                    "label": 1
                },
                {
                    "sent": "We describe with a common terminology.",
                    "label": 0
                },
                {
                    "sent": "In different applications and data we are helping in the interoperability in the interpretive problem we are.",
                    "label": 0
                },
                {
                    "sent": "We are helping to understand these applications of these data to understand each other.",
                    "label": 0
                },
                {
                    "sent": "Is transforming information into knowledge learning this knowledge is a as you have seen, is one of the applications applications.",
                    "label": 1
                },
                {
                    "sent": "Discovery discoveries about having annotation of different data, available sources and so on, we are able to better discover what they're doing an execute them.",
                    "label": 1
                },
                {
                    "sent": "Yeah, this is applied as well for search and navigation based on semantics, so it's seeing you can see beyond what it normally other other.",
                    "label": 0
                },
                {
                    "sent": "Order engines search engines will will look for.",
                    "label": 1
                },
                {
                    "sent": "Typically, an application is for instance semantic desktop.",
                    "label": 0
                },
                {
                    "sent": "So you mark you market with I come on a common language, common terminology.",
                    "label": 0
                },
                {
                    "sent": "We might go there, or what do you have in your desktop?",
                    "label": 0
                },
                {
                    "sent": "And then you are able to better locate and and work with which you only sources.",
                    "label": 1
                },
                {
                    "sent": "Composition, automatic complexity from simple things, this is something that we have been talking about before.",
                    "label": 0
                },
                {
                    "sent": "And if we apply recently, no to all these things, we have systems that know what they are with information they are dealing with, the with the knowledge, and there are many other media other possible applications.",
                    "label": 0
                },
                {
                    "sent": "Assassin architectures, we cause the collaboration.",
                    "label": 0
                },
                {
                    "sent": "We have not been talking about 20 between 2 zero is quite related in a way with the semantic technologies and they work together very closely in some some possible applications on college engineering, information sharing, assessment systems and so on.",
                    "label": 0
                },
                {
                    "sent": "So there are many, many possible applications that can be achieved because it is unreasonable.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Buddy so semantic web is have some many strong foundation that have strong foundation research results.",
                    "label": 1
                },
                {
                    "sent": "But we until now we have very few real industrial implementation.",
                    "label": 0
                },
                {
                    "sent": "There are some but not many.",
                    "label": 0
                },
                {
                    "sent": "Of course this is be cause there are a life cycle of adoption of technology as well as as we probably know, so right now we are more or less in this one to six points.",
                    "label": 1
                },
                {
                    "sent": "We are now at 4, moving to five.",
                    "label": 0
                },
                {
                    "sent": "Probably this is my opinion.",
                    "label": 0
                },
                {
                    "sent": "And so we are not is used by some some people, but businesses still have not adopted.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The technology.",
                    "label": 0
                },
                {
                    "sent": "So we are more or less finishing or in the early adopters markets, but not in the in the mainstream markets.",
                    "label": 0
                },
                {
                    "sent": "But we are close now and we, as you have seen the previous presentation, there has been research for many years in this respect and now we are reaching the markets and still there is research going on, But in this specific parts.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, this is a revolution of the website.",
                    "label": 0
                },
                {
                    "sent": "According to the radar networks.",
                    "label": 0
                },
                {
                    "sent": "We are now more listed in this with 3.0 or rich and this with wet.",
                    "label": 0
                },
                {
                    "sent": "Reconsider with some mixture in a in a way between semantic technologies with Web 20.",
                    "label": 0
                },
                {
                    "sent": "This social social thing that is going around but we are going or this is the definition to a better world.",
                    "label": 0
                },
                {
                    "sent": "They will wait for zero or or the future.",
                    "label": 0
                },
                {
                    "sent": "The future Internet that is calling other in other places that is happening in a way that the web will be.",
                    "label": 0
                },
                {
                    "sent": "Platform 4 for executing application not only for search for for communication that.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the main idea is there or these leases life.",
                    "label": 0
                },
                {
                    "sent": "There are of course some do's and don'ts regarding the adoption of this technology, and this is some guidelines for the semantic Web adoption.",
                    "label": 1
                },
                {
                    "sent": "I'm not going to details like the idea is that if you want to adopt this technology, as with any technology, the 1st first thing to do is to create a pilot at the first prototype, start from there and then see if it fits your needs.",
                    "label": 0
                },
                {
                    "sent": "An find out what you can do later on, but of course it's a new technology so you have to train people on this, your organizations and what you do.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't do is to go it alone because semantic web, although is simply in a way, is complex, so it's better to get some help on this.",
                    "label": 1
                },
                {
                    "sent": "And you don't.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't be impatient because this is a technology that is growing.",
                    "label": 0
                },
                {
                    "sent": "You can start from some pilots and then continue with that.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is a recap of what we have been talking about, so it's about automatic worries about integrate data, content application and processes via various shared ontology.",
                    "label": 1
                },
                {
                    "sent": "A.",
                    "label": 1
                },
                {
                    "sent": "We said technologies are meaning centered.",
                    "label": 0
                },
                {
                    "sent": "They're dealing with metadata ontologies which this semantic web technology you support.",
                    "label": 0
                },
                {
                    "sent": "That integration, enterprise interoperability.",
                    "label": 0
                },
                {
                    "sent": "The discovery and composition of web services and web services in general an it's based on the standards that were used.",
                    "label": 1
                },
                {
                    "sent": "ECS standards for many that I use for creating many, many things so their main things that stresses that semantics are here to stay.",
                    "label": 0
                },
                {
                    "sent": "Hopefully this is what we think.",
                    "label": 0
                },
                {
                    "sent": "So probably will improve your way of dealing with information.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Knowledge in the future.",
                    "label": 0
                },
                {
                    "sent": "And does it?",
                    "label": 0
                },
                {
                    "sent": "You have any questions?",
                    "label": 0
                },
                {
                    "sent": "No, no you have.",
                    "label": 0
                },
                {
                    "sent": "We have many too much time but we.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but.",
                    "label": 0
                },
                {
                    "sent": "Robert, programmer.",
                    "label": 0
                },
                {
                    "sent": "What you see?",
                    "label": 0
                },
                {
                    "sent": "Which is not the way to make the comparison between the weapon.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "1482 leaving now.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What did you think about that?",
                    "label": 0
                },
                {
                    "sent": "Pickle you cannot argue you cannot make the comparison between programming.",
                    "label": 0
                },
                {
                    "sent": "Jason was made not for adoption purposes, but in order to understand what semantic work is about.",
                    "label": 0
                },
                {
                    "sent": "It is true that semantic web has been around for four 8 to 10 years.",
                    "label": 0
                },
                {
                    "sent": "But is a technology that is, let's say, emerging is not at the process of 1st of research on some problems that we had in the past and we still have some time to resolve in order to make the technology available and the performance to be the one.",
                    "label": 0
                },
                {
                    "sent": "That we expect.",
                    "label": 0
                },
                {
                    "sent": "And now I think the semantic web is.",
                    "label": 0
                },
                {
                    "sent": "Taking off as just as you said, it is not, let's say, a spectacular for the technologies.",
                    "label": 0
                },
                {
                    "sent": "Take off of all the technology such as what to say or something like that, but I think they signal is being adopted by many companies right now.",
                    "label": 0
                },
                {
                    "sent": "So The thing is that.",
                    "label": 0
                },
                {
                    "sent": "So somebody is not only about semantic search or semantic web services, there are many fields, many layers on this generation total technology, so some people are using it for.",
                    "label": 0
                },
                {
                    "sent": "Let's say you get started a small not to go into the whole potential and this is the way the way to proceed.",
                    "label": 0
                },
                {
                    "sent": "Starting small and then we hope that it will take off in the next few years.",
                    "label": 0
                },
                {
                    "sent": "But of course it's not compatible in terms of, let's say, coverage with the current web.",
                    "label": 0
                },
                {
                    "sent": "Do you have time images?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I was wondering what type of project to test in Spain in what type of industry?",
                    "label": 0
                },
                {
                    "sent": "The process we are now example in at the story in Spain we are, you know, creating a prototype or in the internal web and the Internet.",
                    "label": 0
                },
                {
                    "sent": "In order to to annotate in or within a small, let's say domain, this model main annotating content of the work in order to give a semantic search improves.",
                    "label": 0
                },
                {
                    "sent": "This is an example of adoption that we are implementing right now is not as still available, but it's going to be in a few months.",
                    "label": 0
                }
            ]
        }
    }
}