{
    "id": "mgevn7ujgwud6crydxi3t4piiy5fk4aa",
    "title": "Using the Web to do Social Science",
    "info": {
        "author": [
            "Duncan Watts, Microsoft Research"
        ],
        "published": "Feb. 1, 2011",
        "recorded": "October 2010",
        "category": [
            "Top->Social Sciences->Society",
            "Top->Computers->Multimedia"
        ]
    },
    "url": "http://videolectures.net/acmmm2010_watts_uws/",
    "segmentation": [
        [
            "I think everybody is with him for the highlight today.",
            "So I'm not Duncan Watts yet.",
            "OK, I'm going to see say a few words about House Speaker.",
            "Doctor, what is a?",
            "Perhaps he's a stranger to our conference here, but it's definitely not a stranger to broad fields of community, social science network, and actually his background come from very, very broad areas.",
            "So let me try to introduce a little bit here.",
            "He currently directs the Human Social Dynamics Group in Yahoo Research, and he is also at the same time faculty member of Santa Fe Institute, which is very prestigious and well known organization.",
            "Informally, he was a colleague of me for professor of Sociology at Columbia University, and he is best known for his popular book, one of the best selling book in sociology and social Sciences, called 6 degrees.",
            "Assigns of connected age.",
            "Some of you probably have read it.",
            "Of course I have read it and is very popular influential.",
            "His background is very interesting, not from multimedia, but he got his undergraduate degree in physics.",
            "From New South Wales University in Australia and he got his PhD from theoretical, an experimental applied mechanics in Cornell University, and it's very interesting now.",
            "Actually at the end he became a full professor in sociology and now he is a group leader of a social science research in Yahoo.",
            "So it would be wonderful to imagine you have a career like that.",
            "So I think today I think his bio is very long.",
            "I'm not going to take his time here everybody.",
            "Again, for the wonderful talk he has been doing a lot of social science in Yahoo in different aspects and today he's going to reduce his vision and some of the work and using the web to do social science.",
            "So let's welcome Doctor Watt.",
            "Thank you Sifu for that very kind introduction and thanks for having me here.",
            "It's great to be here.",
            "Do I do I push the button that says danger?",
            "To move the slides at this point, not the dangerous one."
        ],
        [
            "Great thank you.",
            "Thanks for that I see.",
            "OK, thank you.",
            "So I want to start out by talking a little bit about the field that I come from, at least at least in recent years.",
            "Which is sociology and sociology may not be very familiar with as a discipline.",
            "It's a very broad discipline.",
            "It's a little hard to describe what sociology is, but from, you know, from my sort of idiosyncratic perspective.",
            "What makes social science social?",
            "And the the sort of core interesting analytical problem for someone like me.",
            "And the reason why I've sort of become fascinated with sociology is that you take in the social world, you take a group of people and you put them together and they interact with each other.",
            "And somehow they produce something other than just a group of people.",
            "They produce families, they produce firms, markets, cultures, and the question of how you get from this sort of micro level of individuals to the macro level of the social world and institutions is innocence.",
            "The core theoretical question of.",
            "Sociology.",
            "It's also, you know, the core theoretical question of most of the other social Sciences as well, like economics and political science, and all of them have essentially the same difficulty, which is that getting from the micro to the macro is extremely difficult, and so if you look at the social and behavioral Sciences, they tend to sort of divide up into these two scales.",
            "So we have microeconomics and we have macroeconomics, but it's very difficult to go from.",
            "The micro to macro and you have psychology as a whole field of sociology as a whole field, but it's very difficult to to bridge the two.",
            "And if you sort of look back through the history of sociology, there's a lot of discussion about this.",
            "They call it the micro macro problem and the thought is that you know the reason where all the different.",
            "The explanation for where the difficulty comes from is that you have these between individuals.",
            "You have these sort of very complex networks of interaction.",
            "Through which information passes where people influencing each other and changing their behavior in this sort of ongoing dynamic process, and the result is that you get this kind of emergent behavior, so this is, you know if we mentioned the Santa Fe Institute, which is one of the places that they really sort of originative what's now called the Sciences of complexity.",
            "And so outside of sociology, this phenomenon of the micro becoming the macro is something that people call emergence.",
            "And so when you look at something like systemic risk in financial system, which has been a very.",
            "Popular topic of conversation.",
            "The last couple of years you have these sort of this.",
            "These phenomena, that sort of emerge at aggregate levels that are very difficult to explain or predict in terms of things happening at micro."
        ],
        [
            "Bulls so.",
            "You know why has sociology and the social Sciences in general had so much trouble?",
            "Cracking this micro macro problem, well actually everyone's had trouble cracking it.",
            "It's difficult wherever we encounter it.",
            "Sociology is that there's really no getting away from it.",
            "So if we if we go back sort of 100 years throughout the history of sociology, sociologists have always been sort of aware of the importance of these networks, but the problem is that we haven't been able to measure them.",
            "That you have millions or of people, so have billions or trillions of edges connecting them in these networks.",
            "And really, none of this is observable.",
            "The other problem is that you can't really do sort of macro scale experiments you can't put.",
            "An army in a lab, as it were, and try to sort of tune the knobs to see if you can.",
            "If you can understand the causal.",
            "Effects.",
            "Of phenomenon at that sort of macro scale, so it's very hard to do science in the way that we sort of think about science from a natural science perspective when you can't really measure anything that you care about, and you can't test your theories with experiments.",
            "And so I think what's exciting these days and what motivates this talk is that something very interesting is happening in this current era where we have these sort of technological revolution associated with the web.",
            "And more broadly, the Internet.",
            "And also electronic communications devices and platforms that are effectively sort of lighting up these social networks that are allowing us to measure interactions and behavior in real time on very very large scales at sort of unprecedented levels of resolution.",
            "And also something that I want to talk about a bit today is the ability to do experiments on a very large scale.",
            "And you know, I use the phrase the web sort of loosely here.",
            "I really, I say, using the web to do social science.",
            "I really mean all of these technologies together, so I hope you will sort of forgive me for that sloppy terminology."
        ],
        [
            "So what I want to do for the rest of the talk is really just sort of describe a series of four projects that I've worked on over the last 10 years.",
            "Really 9 or 10 years.",
            "That are sort of loosely connected by this theme of of using the web to do social science and and also sort of substantive theme of social networks and what their structure is like and how they affect other kinds of questions that sociologists are interested in, and I'll try to sort of motivate each question separately in terms of the problem that that we were interested in at the time, and what we were trying to understand and also explain what we learned about.",
            "The the methodological lessons that we learned along the way and finally I'll try to wrap up with some suggestions for what we."
        ],
        [
            "I do in the future.",
            "So the first one is, uh, an experiment that actually goes back a long way, and many of you have probably heard of this experiment was done by the social psychologist Stanley Milgram and his graduate student Jeffrey Travis back in the 1960s and they were interested in this question, which was sort of popular in folklore and also in sociology.",
            "Even back then called the small world problem, which was the idea that everyone in the world could be connected to everyone else through just a short chain of intermediaries and millgram being an experimental person decided to test this hypothesis with an experiment.",
            "So we picked a friend of his, a stockbroker who lived outside of Boston in Sharon, MA and he labeled him the target of this experiment.",
            "And then he picked 300 other people from Omaha, NE and also from 100 of them from Boston itself, and each one of these centers was given the task of trying to get a packet, a letter of some kind to the target person, and they were given all sorts of information about his full name, his address, his wife's maiden name, his use of military service is Aqua.",
            "Creation and so on.",
            "Plenty of information to identify him uniquely, but the catch was they could only send it to him if they knew him on a first name basis, and that being very unlikely what they had to do instead was sent it to someone who they did know on a first name basis who they thought was closer to the target then they were, and so these sort of 2nd generation people got the letters and they were given the same instructions to pass it onto a third generation, and so on.",
            "And so these letters kind of percolated their way across the country in the form of letter chains.",
            "In about 20% of them reached the target, which actually sort of remarkable completion, right?",
            "Once you try to do these sorts of experiments yourself, and the Milgram found was that the average length of the change that got to the target was six.",
            "And this, we presume, is where the famous phrase 6 degrees of separation comes from.",
            "Although Morgan actually never used that phrase himself.",
            "So this was a remarkable result of the time, and we're so used to this idea of 6 degrees now that it's, it seems obvious, but but people were very surprised back then.",
            "I thought it would be, you know, hundreds of steps to get from Omaha to Boston."
        ],
        [
            "So fast forwarding many years now back at Columbia.",
            "When I first started teaching there, we decided to try to recreate.",
            "Milgram's experiment, except you know, this was sort of when email had really just become, you know, close to universal and.",
            "We thought we would try to do this using email rather than physical packets, and so the nice thing about doing this on the web is that we could do it on a much larger scale.",
            "So whereas Millgram had just one target and 300 chains, we had 18 different targets around the world from 15 different countries and we got more than 24,000 people to initiate change to one of these 18 different targets, and we actually had a much lower completion rate than.",
            "And now Grim did, but we had over 400 of these messages eventually reach their targets, and in the process they pass through through more than 60,000 individuals in 166 countries.",
            "So I think there's 190 two countries in the United Nations, so.",
            "For all its problems, this experiment was getting close to something like the scale."
        ],
        [
            "Whole world so this this image shows.",
            "One such target, so this is my old advisor, Steve Strogatz, who's a mathematician at Cornell University in that Big Red Dot, is centered on Ithaca, NY, and he insisted on being a target for this experiment.",
            "It's sort of a people really like this.",
            "They like to be targets for these things, 'cause it's sort of a kind of a measure of your sort of social connectivity.",
            "So here's about 7000 dots that are all the letters that the email they all of the sort of the senders who were assigned Strogatz as a target, and you can see they start out all over the world.",
            "Each one of these frames, so this is desiard, agrees this is the first degree second degree to 3rd degree, so this is degree 8.",
            "So you can see that everything that's going to get to him.",
            "Is going to get him in in eight steps or less and you can see some interesting patterns.",
            "How these these targets these these these messages kind of converge on the major cities of the US and Western Europe before finally making their way to Ithaca, mostly via New York."
        ],
        [
            "So what do we find?",
            "Well, the old result is actually sort of surprisingly accurate.",
            "The median length of the changes about 7:00, and there's lots of other results as well that we published since.",
            "But the point I want to emphasize here, and I just sort of make this comment broadly for all the papers that I'm going to discuss today, that I don't really have time to go into all the details, and I'll certainly be happy to give you the references at end if you're interested.",
            "But the point I want to emphasize here is that we.",
            "Ran this experiment very naively, I think.",
            "And almost 0 cost.",
            "It was just my graduate student, Robbie Mohammed.",
            "Sort of learning how to to to to to set up the website and somehow we managed to get over 60,000 people to participate in this experiment, and so I think in a way that an equally important discovery was what we call the Board at Work Network.",
            "So this is a network of millions of people around the world who are sitting at their desks.",
            "And they're bored and they're looking for something to do other than work.",
            "And they have a computer on their desk in front of them, and if you can think of something for them to do for a few minutes, that's mildly entertaining, and importantly, doesn't make any noise.",
            "They will do social science for you.",
            "And of course, if you're you know if you're if you're Mark Zuckerberg, you think, well, they'll make you know make you a billionaire, but they also do social science for you.",
            "So this guy is thinking what else can we do and."
        ],
        [
            "The next project that came along was associated with my graduate student at the time, Matthew Salganik, who's now a sociology professor at Princeton, and the problem that we were interested in was this sort of stylistic observation about cultural markets markets.",
            "For things like books, movies, music, art, and so on.",
            "And if you look at these markets, there's a couple of striking features that they have.",
            "One is that.",
            "Popular things are not just more popular than average.",
            "There are many, many orders of magnitude more popular than average.",
            "If you look at best selling books like the Harry Potter series, if you look at blockbuster movies like Avatar or Titanic.",
            "Michael Jackson's thriller.",
            "You know these are objects that are are sort of, you know, 3456 orders of magnitude more successful than an average object in one of those markets.",
            "And so you have this massive inequality very, very striking inequality when you look across six.",
            "Look at success across markets, but you might think, well, these things are.",
            "You know, if you.",
            "Popular things are the successful things are so much more successful than average, they must be sort of qualitatively different.",
            "They must be different in a way that is sort of obvious.",
            "At the outset, and yet if you look at all these examples, many of them came as a complete surprise, right?",
            "So the Harry Potter series is a good example of that.",
            "It was.",
            "It was JK Rowling's original manuscript was rejected by about eight children's publishing houses before it was finally picked up by Bloomsbury, which was back there in a very small, independent press.",
            "Now it's a very large, independent press.",
            "And those a children's publishers no doubt feel like complete idiots, but they're in good company because you and there's just so many stories of sort of blockbuster movies and an artists.",
            "And so on, who who were, who were not predicted by motivated professional people who have lots of experience in those industries.",
            "So so the question we were interested in is how do you reconcile these observations that successful things are much more successful than average and yet also highly unpredictable an hour.",
            "What was that?",
            "Again, sort of going back to this micro macro problem that you that when people individuals make decisions about these kinds of in these markets, there are influenced by what other people are doing.",
            "So there's this sort of individual level process of social influence going on, and that somehow these all these little influences are piling up to generate this inequality.",
            "And I'm pretty unpredictability now.",
            "We had actually done some theoretical work on this in the past, and what we wanted to do now is to try to verify this work with.",
            "With something like a lab experiment where we put people into control conditions that we can that we can very systematically and examine whether social influence generates this kind of effect.",
            "The problem with doing this kind of experiment, however, is that you need a lot of people, so for every market that you want to.",
            "To simulate in a in a lab you need you know dozens of things to choose between.",
            "In this case that we're going to talk about songs, you need hundreds of people.",
            "If you want to have multiple markets, you need to have thousands of people.",
            "If you want to have different experimental conditions, you have to have 10s of thousands of people.",
            "This is more undergraduates than we can get at Columbia University, and so we need to find a new way of doing this."
        ],
        [
            "Lots of experiments and of course what we're interested in is seeing if we can do this on the web, and so this is the website.",
            "This is the experiment that Matt built was called music."
        ],
        [
            "Lab and when you come & up for Music Lab, you see a screen that looks like this where you have 48 songs by bands that you've never heard of.",
            "I guarantee that.",
            "And each one of these little grid squares corresponds to a song, as in sorry, the band is in all caps, and the song underneath is in there, and then the right hand side you see this little number, which tells you how many times that song has been downloaded."
        ],
        [
            "Why people before you?",
            "So you click on one of those grid squares and the music streams through your through your web browser and you can give it a rating from one to five stars."
        ],
        [
            "And then once you write it, we give you the option to download it, or to say no thanks.",
            "I don't want this.",
            "I want to go back to the main menu and this is the action that we pay attention."
        ],
        [
            "So what you don't know is that when you arrive at this website you are shunted into one of two conditions.",
            "So the first condition is the one that you saw.",
            "It is called social information condition.",
            "The the second condition, the independent condition looks exactly the same as what you just sorts.",
            "If there are no numbers, right?",
            "So you get to the website and you have to just decide however you want to decide there's no information given to you about the popularity of these songs within the social information condition.",
            "We also divide that up into eight different worlds.",
            "And So what that means is that you, if you arrive in world one, you only get to see the downloads of people who are ahead of you.",
            "In that world, and not any of the others.",
            "So what we effectively did was create 9 independent an identical copies of the world that all started out together, and then we let them run in parallel."
        ],
        [
            "To see what would happen so you can see here that at the micro level you do in fact see some social influence.",
            "So this is the probability of listening to a song as a function of its rank based on its existing market share.",
            "So you can see that songs that have the highest ranks that have been downloaded previously are much more likely to be listened to then songs that are just sort of in the mix down here.",
            "And if you look on the right hand side you see the same plot for the independent condition you can see as you would expect.",
            "That there is no effect of rank on market share whatsoever.",
            "So so this is clearly having the effect at the individual level that you would expect people are paying attention to this site."
        ],
        [
            "No signal, but what we're interested in, of course, is not what's going on at the individual level, but rather what's going on at the collective level, and so we have to have ways of measuring these.",
            "This inequality and unpredictability that we're interested in in the real world, and the inequality measure that we use is a very simple and standard measure of inequality called the Gini coefficient, which is really just the expected difference in market share between two randomly chosen songs.",
            "So when when the Gini coefficient is zero, everything has the same market share, and when it's one every one song has all the downloads and nobody else has anything.",
            "The other thing that we're interested in is unpredictability.",
            "Which is really just, you know, one way to think about it is if I give you the ranking from 1 to 48 in one world, how much can you tell about the ranking in another world?",
            "And so, how much are these?",
            "Are these worlds related to each other?"
        ],
        [
            "OK, so again I don't have time to go into the details.",
            "I'll just summarize them.",
            "We did four different experiments using this sort of basic setup.",
            "The first one is the one you just saw.",
            "We call out the weak condition because the songs were just randomly scattered on that 6 by 8 grid.",
            "The strong condition was where we ranked them from first to last, so everything looks the same except the songs are all just ranked in one column in a way that sort of actually more sort of familiar from the.",
            "Music websites that exist.",
            "And naturally, that increases the salience of the social signal.",
            "So people have a clear idea of what's popular and what's not.",
            "The first 2 experiments were both conducted using mostly teenagers who we recruited off this social web social networking website called bolkcom, which is no longer exists.",
            "But we were interested in.",
            "Of course, people think that you know teenagers possibly are different from the rest of us, and so we made use of the.",
            "The previous experiment, the small world experiment.",
            "We had capital email addresses the people who participated in that and we had asked them if they would be interested in participating in subsequent experiments, and some of them said yes they would and so we emailed them and said we have this new experiment.",
            "Would you like to participate in that as well?",
            "And so we got an additional 12,000 or so participants from this very different population of people who are generally older in their 30s and 40s and were professionals.",
            "And so we were able to verify.",
            "Our results with a different population and then finally that was experiment 3 and then finally an experiment.",
            "For we we.",
            "Introduced a level of deception into the experiment by taking one of these worlds that had already settled down so that all the rankings had stabilized, and then inverting it to make the most popular song seem like that with the least popular songs and at least popular songs seem like the most popular songs to see whether people could in fact figure out these intrinsic differences in quality, or whether they would be fooled.",
            "Buy the social signal and generate what's called a self fulfilling prophecy."
        ],
        [
            "OK, so putting all of those together and just summarizing results again, I can show you the be happy to share the papers with you if you would like.",
            "Individuals are absolutely influenced by what they think other people like, and the more you sort of tweak that social signal, the more they are influenced at the collective level.",
            "What we found, as we had hypothesized is that popular songs when people know what other people like popular songs get more popular and unpopular songs get less popular, so the inequality increases.",
            "As predicted, an at the same time, it becomes increasingly difficult to predict which.",
            "Songs are going to be the hit song, so the unpredictability increases along with the inequality.",
            "So there's an interesting paradox here, which is that when you give people social information when you tell them what other people like, you're actually helping them.",
            "You're doing them a service.",
            "You're providing them more information.",
            "This is why we have expert reviews and Amazon ratings.",
            "And best seller lists.",
            "These are all ways of simplifying the world for us so that we don't have to go out and do all the heavy lifting.",
            "Of, you know, going through however many 10s of thousands of books are available.",
            "We can just go to the few that have been recommended to us.",
            "And so the social the social information is a useful signal for people.",
            "The paradox is that the more information you give individuals, the less information is aggregated by the population.",
            "And the reason is that people simply follow the information that you give them, and they don't add any of their own independent information, and so you get what economists call an information cascade, which actually is sort of a strange name for it, because it really is a.",
            "Absence of information cascade.",
            "And so this is the the explanation for how we see this sort of simultaneous increase in inequality and unpredictability.",
            "Of course, when you know the music industry people heard about this result, the first thing they wanted to know is can we manipulate this?",
            "Can we use this to sell more of our stuff to create our own hits?",
            "And the answer is, well, not really.",
            "Sort of maybe.",
            "To summarize, you can fool some of the people some of the time, but you can't fool all the people all of the time.",
            "It's possible to create self fulfilling prophecies at the level of individual songs you can buy moving by manipulating their apparent popularity.",
            "Make them do better or worse than they would have done had you not manipulated them.",
            "But if you do too much of this, as we found much to our surprise, people just don't like it and they go away and we found that in the manipulated condition there were many fewer downloads than the underneath."
        ],
        [
            "I did condition.",
            "OK, so that's two experiments we're halfway through.",
            "And one of them you may note, was about networks.",
            "The second one was not really about networks, there was no network in the music Lab.",
            "Experiment was just people lining up one after the other.",
            "But there was influence in Music Lab experiment, so we were measuring some sort of behavior in the second one, and we're measuring some sort of connectivity in the first one.",
            "But of course in real life we have both things going on at once.",
            "We have people connected in these large networks and we have information spreading through them.",
            "We have people influencing their behavior and in some sense that's what we'd really like to get our hands around.",
            "And so.",
            "No, the one of the sort of.",
            "Pieces of that puzzle.",
            "But that market is in particular, but others as well have gotten so motivated by in recent years is that when you put these these ideas of diffusion and networks together, you can easily persuade yourself that that out there in these networks are these special people.",
            "These influential's or influences or connectors, as they are often called, and that these people wield disproportionate influence over others, and people use this phrase, influencer very.",
            "Loosely to mean lots of different types of people.",
            "You know, Oprah Winfrey's greatest selling books Sarah Jessica Parker was famous for wearing Manolo Blahniks on sex in the city.",
            "And suddenly they become popular.",
            "Jeff Jarvis is A is a is a widely read technology Blogger in the US and he had some beef with Dell customer service because they they wouldn't help him fix his computer and so he ranted about it on his on his blog and the next thing you know Dell has a full blown customer service crisis on its hands and so it's very sort of tempting to look at these stories and say look there are, you know, we know that there are these special people out there and if we can just find them they can do all the work for us, right?",
            "That we can.",
            "So this is, you know, sort of like the ultimate free lunch in marketing language.",
            "Find the influences and they will do all the work.",
            "But the problem with this is that all of these stories are always told after the fact.",
            "So once you see something remarkable happened, you go back and you find that Jeff Jarvis is of the world and you say, uh, that guy must be an influencer.",
            "The problem is that you really what you would like to do is identify them beforehand so that you can go out there and recruit them and get them to talk about what you want them to talk about.",
            "And there's no evidence that marketers or anyone else can do this."
        ],
        [
            "Recently so how do we think about this?",
            "How do we study this problem?",
            "Well, it sounds like we're going to be using Twitter today and I think Twitter is interesting for all sorts of reasons, but from a social scientist perspective, Twitter is sort of a very.",
            "If you had to imagine a platform created to study influences, you would probably imagine something like Twitter.",
            "This is a network that is has millions of people who have explicitly opted into listening to each other, so it's not like a sort of more generic social network like Facebook for example, where people are connected to each other for all sorts of reasons.",
            "on Twitter, you're only there because you want to hear what other people have to say.",
            "Can you tell the platform who you want to listen to by following them?",
            "On the flip side, the people who are tweeting are trying to be heard by the people who are following him, so this is a network that's ready made for studying influence.",
            "At least the restricted kind of influence that has to do with information passing around a network.",
            "We can't observe shopping behavior or or voting behavior, or many of the other kinds of influence that we would be interested in.",
            "Another advantage of Twitter is that.",
            "You know one of the conventions that people have have glommed onto is that when they they want to broadcast other kinds of web content, they use one of a number of URL shorteners in particular, bit LY is the most popular, and these have the nice advantage that they provide compact and uniquely identifiable labels for individual pieces of information.",
            "So you can actually sort of tag a piece of information and we know where it starts and we know we're.",
            "Travels to and so we can reconstruct all these diffusion events where some piece of information is introduced somewhere in the network, and then we can see where it spreads through a series of retweets.",
            "So this is work that began last summer with a time Bakshi grad student at Michigan and a couple of my colleagues at Yahoo.",
            "Jake Hoffman and Winter Mason.",
            "And we.",
            "Observed about a billion public Twitter posts in the last two months of 2009 and extracted out of these about 19 million containing Bitly URL.",
            "So we have about 1.6 million users who are active during this two month period and they're all introducing.",
            "There are no receding around diffusion events and I'll explain in a second how we how we compute that.",
            "We also crawled the whole well, not the whole follower graph, but a large chunk of the follower graph comprising about 56 million users.",
            "It's considerably larger than."
        ],
        [
            "Right now.",
            "OK, so how do we compute influence on Twitter?",
            "So an individual person, let's call a masid, initiates a URL into the system.",
            "So now we have that unique tag and then for every one of their followers who who rebroadcasts that URL either by using the retweet function or or simply by following them close in time, we allocate the original person one point and so this is sort of like an Amway pyramid scheme that everyone you recruit gives you points and everyone they recruit gives you points and everyone those people recruits give you points.",
            "So if you have multiple generations of retweets spanning out from this initial tweet.",
            "Get many many points.",
            "So we assign an influence score for every one of these cascades.",
            "Again, there's about 19 million of them.",
            "And then we average for each individual the scores that they get for all of the Cascades that they have initiated.",
            "Now this is a very conservative measure of influence.",
            "We actually, you know, it's possible that even if people don't retweet you, there's still reading what you have to say.",
            "And maybe they've been influenced by it, and we can't see that.",
            "The only thing that we can we count here is is the is the retweet."
        ],
        [
            "So this is what the Cascades look like.",
            "You can see that some of them are very shallow and broad and others are narrow and deep and some of them are very sort of large and complex like the one in the middle.",
            "There most of them.",
            "However, as you'll see."
        ],
        [
            "Tiny.",
            "And so if you look at the distribution of cascade size, it has this sort of highly skewed that are roughly Powell or shape, where the vast majority nearly 98% of them especially don't go anywhere, right?",
            "So the median size of a cascade is one that is yourself.",
            "The average size is only a tiny bit higher.",
            "One point 1 four, so most tweets don't go anywhere.",
            "Almost nothing gets retweeted.",
            "But if you do and you can see that somewhere in the right hand side there this one is over 10,000 retweets, has propagated more than eight generations deep.",
            "So if you're if you're a sort of market, are you sort of what you immediately focus on this tail and you say OK, how do I get me one of those?",
            "But I want these things they get, they get retweeted thousands of times, they want to reproduce these cascades that that, that that.",
            "Generate.",
            "Did they go from any generation?"
        ],
        [
            "Eat.",
            "But of course, what you really care about is.",
            "In this case is predicting right?",
            "So we can we can look at those.",
            "Those cascades out in the tail, and we can tell some story about you know why they succeeded after the fact.",
            "But that's sort of useless to us.",
            "Really, what we want to do is see if we can predict, identify the features in advance that will allow us to predict large cascades, and so we basically take everything that we can.",
            "Off Twitter, so we have we first of all we split the two month period into into hubs and we use this first half as the history and the second half is the future, and so we have some information from the first month about how successful people have been generating cascades, and we use that as a predictor for how successful they're going to be in the in the second month.",
            "So that's actually a lot you don't normally get that in the real world.",
            "We also don't have any followers.",
            "They have many people.",
            "They follow how many reciprocated ties they have, how frequently they tweet when they joined.",
            "We have a lot of information about them and then we use a regression tree model too.",
            "But just think linear regression is close enough to to see if we can predict the future given the path."
        ],
        [
            "Fast and this is roughly what the results look like, and you see the model is actually very well calibrated.",
            "The X axis is predicted influence in the Y axis is actual influence, so it looks initially like you have a lot of predictability and the two features that turn out to matter the most are very intuitive.",
            "How influential you've been in the past and how many followers you have.",
            "So you might say, well, it's obvious.",
            "But what's interesting is that some of the other things that also would have seemed obvious, turn out not to be very productive, so it doesn't matter how frequently you tweet is Manahan people who follow these things don't add anything.",
            "Surprisingly, content doesn't really help you much either, so you might think that the the actual content of the URL would impact its ability to spread.",
            "But we took a random sample of 1000 such URLs and we put them up on mechanical Amazons Mechanical Turk that I'll talk about next and we got people too.",
            "To classify them by what type of content they were and how interesting they were and how likely they were to to forward them to their friends.",
            "And none of these features improve the fit of the model at all, so this was very surprising to us.",
            "Actually, we really thought that would help.",
            "Now the other thing I want to note is that as well calibrated as the model is, the fit is very poor, so there's an ask where to .3 four there, so you're only explaining about 30% of the of the variance."
        ],
        [
            "In the data.",
            "So if you look at the non averaged version of this you see what's going on that the two axes here are past local influence and number of followers.",
            "The size of the circles reflects the influence of that individual and the right hand plot is just is just actually a an expansion of the top right hand corner, so they're really the same plot and you can see that.",
            "Third time.",
            "What's going on here is indeed as the main results show people with with past local influence and an high number of followers are more likely than average to generate large cascades.",
            "But there is a tremendous amount of rain."
        ],
        [
            "And scatter.",
            "And So what this reflects is, is what we might call necessary but not sufficient conditions, but.",
            "The tendency, at least in the you know in the.",
            "In the marketing world is to see something that succeeds and actually this is not true.",
            "Just marketing will.",
            "In the marketing world is also true in the in the business world.",
            "In general, if you look at these business books about successful companies or successful people, you notice that they all have the same structure, which is?",
            "They take a bunch of successful people or companies and they look at them to see what factors they have in common.",
            "What they don't do is look at all the unsuccessful companies and unsuccessful people and if they did they would find that many of those same factors show up in the unsuccessful objects as well.",
            "And so when we tend to look, we tend to analyze success where we generally find what we might call necessary conditions, or at least mostly necessary conditions.",
            "So it helps to have lots of followers, and it helps to have a past track record, but it doesn't follow that someone who has lots of followers, Anna good past track record will be successful in the future, and in fact most of the time they won't be.",
            "And this is a you know, common for a same sort of problem arises in explaining all kinds of rare events, not just success, but also plane crashes, school shootings.",
            "If you look at if you look at school shootings in America, invariably, there's some common factors that you have sort of teenage boys who who dress a lot in black and watch lots of violent TV and play violent video games and write nasty letters to their teachers.",
            "But this description also fits about 50,000 other teenage boys in the US, none of whom ever cause any problems.",
            "So across marketing and across business and across many other.",
            "Interesting social phenomena.",
            "We have this same problem where we can convince ourselves in retrospect that we can explain why things happen, but we're unable to predict using those explanations because for everything that every interesting thing that happens for every success that happens.",
            "There are many non interesting things, many non successes that.",
            "They have exactly the same features and so what's interesting about Twitter here is that we are able to see the full sample of everything that's happening, and so this problem is exposed for us.",
            "How much time go ahead?"
        ],
        [
            "I think I started late so OK alright so I'm just going to skip this."
        ],
        [
            "As I know you will want to hear about Kim Kardashian, but I'll skip that section so that the final experiment that I want to talk about.",
            "Is one that sort of tries to bring these things together that with the Twitter study did include networks and some version of influence, but it wasn't of course actually an experiment, just an observation ULL study, so there's not so much we can say in terms of causal statements really just correlations.",
            "So what we would like to do is try to run the kind of experiment that we did for Music Lab, except where we have the network and the behavior all at the same time.",
            "And indeed, Michael Kerns and his colleagues at University of Pennsylvania have been have been running experiments like this for several years now in a physical lab that's equipped with computers.",
            "I'm so in a sense what we're trying to do is do the same kind of thing on the web now.",
            "What's difficult about this is that everybody has to be present at the same time, so you have to have sort of synchronous updating of the different participants.",
            "So in Music Lab and the small world experiment, you anyone could just sort of arrive at anytime and then they could just participate and leave, so everything was completely asynchronous and this makes it very easy to scale on the web.",
            "By contrast, it's very hard to do this.",
            "When you have to get a large number of people to show up at the same time at a website and sticker."
        ],
        [
            "Down.",
            "So the question that we're going to address here is about cooperation.",
            "This is really sort of the.",
            "Maybe the original question of social science.",
            "It goes all the way back to Hobbes, which is why do people cooperated all?",
            "Why do selfish people?",
            "Help each other when in fact they should just be helping themselves and why's.",
            "Hobbs said why is there not war of all against all?",
            "So this is again a longstanding question in social science.",
            "I want to Ostrom political scientist 1 Nobel Prize in Economics in 2009 for her work on public goods games, so that's what we're going to study here.",
            "What's called a linear public goods game?",
            "Or you have a series of rounds each round, every player gets an endowment, gets a sum of money or points.",
            "Really, that's convertible to money.",
            "Each person decides independently how much of their endowment to contribute.",
            "The contributions are pooled, their multiplied by some constant factor, which is why there it's called a linear public goods game and then critically the pool gets redistributed equally to all the participants, regardless of how much they contributed.",
            "So here's the dilemma.",
            "Everybody is better off if everybody contributes the maximum amount, right?",
            "So the social welfare maximizing solution is for everyone to put in the total amount individually.",
            "However, you're better off of everyone else puts in the maximum amount, and you put in nothing.",
            "Right, so there's a tension between your own selfish interests and the interests of the group.",
            "So understanding how this."
        ],
        [
            "Plays out, as has been the subject of a lot of theory and a lot of experiments, and so, for example, earns fair and Simon Gaechter in Zurich have done a lot of these public goods games and they generally show that contributions start out high and then they decline overtime to end low.",
            "People actually get very upset when other people don't cooperate, they punish each other.",
            "They will pay money to punish punishment, help.",
            "So there's all sorts of results that people have.",
            "Discovered over the years.",
            "But Interestingly, all of these results have been done for essentially for small groups, usually groups of four people, and what we?"
        ],
        [
            "Interested in now is whether we can we can.",
            "Extend these sorts of experiments to to networks.",
            "Now how are we going to do that?",
            "We're going to take advantage of this sort of site that's been around for a few years now called Amazon's Mechanical Turk.",
            "It's obviously run by Amazon.",
            "Mechanical Turk was the original Mechanical Turk was a chess playing automaton in the early 19th century that was famous for having beaten Napoleonic chess.",
            "Of course, the Mechanical Turk was a fraud.",
            "There was actually a person.",
            "Inside the the automaton playing the moves and This is why Jeff Bizos calls Mechanical Turk at artificial artificial intelligence.",
            "It was originally designed for people to solve certain tasks, like particularly image labeling, that are very relatively easy for people but difficult for machines.",
            "But increasingly it's being used by behavioral scientists to do experiments, so this sort of the virtual equivalent of putting the flies up around campus and recruiting undergraduate students to the psych lab to participate in an experiment.",
            "And so Winter, Mason and sensory, my colleagues at Yahoo have just actually written a Handbook for running experiments on Mechanical Turk, so if any of you are interested in using Mechanical Turk to do experiments, you should.",
            "You should download this Handbook.",
            "It's incredibly.",
            "Useful.",
            "So here's how we're going to solve the synchronous problem.",
            "Is that we ran a series of small experiments with this to four players in them and we asked people if they wanted to sign up to be in a panel.",
            "So we overtime constructed a panel of about 100 players and then we would send out an email blast to them the night before.",
            "And so we're going to run experiments tomorrow at 11:00 AM one PM, 3 PM, 5:00 PM.",
            "You know, please come and participate.",
            "We remind them 5 minutes beforehand and were able to get groups of up to 24 players.",
            "Two to fill up on a waiting room in two minutes.",
            "Or roughly 2 minutes and then the game would start."
        ],
        [
            "The first thing we did so in the in the preliminary experiments, we wanted to check this.",
            "To see whether this this population is platform.",
            "This way of running games.",
            "Had any resemblance to the kind of classic studies that have been done in labs around the world, and so we compared our results to to those from Ferron gaechter back in Zurich in the late 90s.",
            "And you can see that the results are almost exactly the same.",
            "That the average contribution starts out high and then sort of trends linearly downwards over this."
        ],
        [
            "Days of 10 rounds.",
            "So then of course we wanted to understand how things work on networks.",
            "Here are the different networks that we considered, so everything from cliques to random graph.",
            "So at least spanning the full range of network topology."
        ],
        [
            "And you can see here the clustering coefficient and path length."
        ],
        [
            "Varies considerably.",
            "Now, what was surprising to us, and I think two people who maybe not the people who study public goods games, but certainly people who study networks is that all of these networks more or less generated the same contributions.",
            "So this is surprising because all the other experiments that people have done, that the Michael Kearns experiments that I mentioned earlier the Exchange Coordination Games, any coordination games, graph coloring.",
            "All of them generated very sort of significant and lodge network effects, and so it's interesting to us coming from a networks background to find something that doesn't seem to."
        ],
        [
            "Be affected by the structure of the network.",
            "And our speculation here, and we really need to do more theoretical work to understand what the general conditions are for when network should matter and when they don't is that you know our intuition, at least is that is that when is it people cooperating games like this in a conditional way that they they want to be do the right thing, but they don't want to get exploited by their neighbors, and so they basically agree to cooperate as long as other people cooperate.",
            "And the thought is.",
            "Then when people are allowed to interact preferentially that that helps sustain cooperation.",
            "If the people that you're cooperating with the cooperating with each other, and all of us can sort of collectively resist the temptation to defect, better than if we're connected randomly, the other thought is that cooperation should be contagious, that if that if I'm doing the right thing, I can raise the cooperate, the contributions of my neighbor, and then my neighbor can raise the contributions of his neighbor, and so on, and then we should expect to see these sort of cascades of cooperation throughout the network.",
            "But in fact we don't see that we do see players cooperating conditionally, but there is this overall bias towards defection.",
            "And I think you know the intuition is sort of like when you when people split the check at dinner, everybody's trying to pay their fair share.",
            "But it's very rare that people pay more than their fair share, right there.",
            "There's a sort of you're not trying to exploit your friends, but you're more concerned about not being exploited, and so everybody pays a little bit less than what they actually owe.",
            "And then of course, you have to kind of renegotiate and.",
            "And and Chip in a little bit more and what we're seeing here is our series of rounds that everyone is sort of trying to mimic the contributions of their neighbors, but they have a little biased towards under contributing.",
            "And everybody does this, and this overall tendency drives everyone down to 0.",
            "There's also no evidence of positive contagion, which is very surprising to us.",
            "We really tried."
        ],
        [
            "Very hard to find that.",
            "So finally you know what are the advantages of doing things this way?",
            "I think you know.",
            "Again, the point I'd like to emphasize is that over a period of a few months we ran 113 of these experiments with 24 players each.",
            "You know the most we can really do is about 20 a week, but this is a little remarkable.",
            "Ability to run experiments over and over again, and to really sort of speed up the hypothesis testing cycle, where we literally would sort of run a series of experiments, and then we would think, wow, you know why did that happen and then we would form a new hypothesis and then we could immediately go back to the lab and test that new hypothesis.",
            "And I think that this sort of speed up you know, as opposed to having to go off and get another NSF grant and wait another year to run a new series of experiments is going to sort of allow us to profoundly change how we do it."
        ],
        [
            "Paraments so just summing up where we come in all this time, while we're sort of chipping away at the problem, you know we're interested in networks were interested in how networks affect social behavior and collective outcomes, and we haven't really got there yet that we have done little bits and pieces.",
            "We have one study of connectivity.",
            "We have another study of influence.",
            "We have another study of diffusion and finally we're starting to get to the point where we can sort of put them all together into a lab setting.",
            "They were really only looking at relatively small network still."
        ],
        [
            "And so.",
            "Looking forward, we're really hoping that we can sort of scale this up and something that we have some ambitions for.",
            "At Yahoo Research to build very large scale virtual labs also to do field experiments where we are more sort of in the wild.",
            "With much larger numbers of people, or we randomly assign them to see receive different kinds of treatments, and my colleague David Riley at Yahoo has been doing some really interesting work here.",
            "Looking at the effects of brand advertising."
        ],
        [
            "Um?",
            "So where is this going?",
            "Well, just to go back to the original slide, is any of this going to really help us to get a better handle on the big questions of social science?",
            "And it's hard to say, you know.",
            "I mean, the sorts of problems that I've talked about are a long way from the serious problems of the world, like systemic risk in financial markets and economic development, policy, and terrorism that you know, these are the problems that motivate social scientists.",
            "And we're not there yet.",
            "Nevertheless, it's hard not to believe that something profound is going to happen if we look back through history wherever there is being a technological revolution that has allowed that has made the previously invisible visible.",
            "We've seen huge changes in science that have followed in the, you know, the telescope.",
            "Sort of the obvious example there were.",
            "Suddenly you can see the planets and the next thing you know, we have a revolution in celestial mechanics.",
            "And then Newton comes along and we have a revolution in all of physics.",
            "So it's a little grandiose to think the same thing could happen in social science, but I think it's plausible to think that something interesting is going to happen over the next generation an what's certainly true is that these problems that have historically been the province of social scientists and now also the province of computer scientists, and I think it's very exciting for someone like me.",
            "Who is she mentioned as sort of meandered back and forth through these disciplines, overtime to to sort of finally get to a stage where."
        ],
        [
            "We can, we can help each other.",
            "Well, thanks very much.",
            "Thank you very much for the wonderful talk about we're going to try to use this Twitter.",
            "As we mentioned earlier, and hopefully the degree here is more than one over the conference.",
            "So do we have there we go?",
            "Alright you on the 1st?",
            "Alright.",
            "So.",
            "I guess these are the trees currently available.",
            "How many tools do we have here?",
            "I lost money.",
            "So maybe everybody can now browse through and see what kind of questions are being asked there.",
            "Do you have time for any questions?",
            "Any question you want to choose to answer is why I can't see any questions.",
            "At least there are no nasty remarks.",
            "Thank you.",
            "So you can also ask questions the old fashioned way.",
            "If you would like.",
            "Alright, holla.",
            "You studied the.",
            "The the structure of influence.",
            "my Twitter did you only study positive influence?",
            "Also negative influence and are going through the same.",
            "So I guess we have a very limited view of influence on Twitter, which is really, you know, can you get something to diffuse right?",
            "So there's no real.",
            "Negative of that on Twitter, what would be more interesting?",
            "It would be to connect something that happens on Twitter with some sort of action that takes place off of Twitter.",
            "So for example, if you if you connect somebody to a news article or to a opinion piece that actually changes the way they behave about something, that would be far more interesting than what we were able to do.",
            "Unfortunately sort of.",
            "Technologically we're not quite there yet, but that would be the objective.",
            "Yes.",
            "So welcome back.",
            "So only in the back they have a microphone there.",
            "So many here.",
            "OK. General question you just had.",
            "Did you observe a different behavior?",
            "Was also information in diffuse?",
            "Was other positive nature as opposed to an information about the negative nature?",
            "Well, we.",
            "No, they they we form OK.",
            "So what we did was we we we.",
            "We took as I said, a sample of 1000 URLs and we put them up on Mechanical Turk and we got humans to classify them and one of the questions we ask them was you know how good does this make you feel?",
            "So I guess that would be an indicator of positiveness.",
            "And that actually had no predictive.",
            "Power so.",
            "So I think the answer is no, that at least we were not able to detect any effect of positiveness or interestingness on the on the on the model fit.",
            "So that was surprising to us.",
            "I would have.",
            "I would have thought that that things that were sort of inspiring or you know engaging would tend to spread more.",
            "But we were not able to show that.",
            "Also.",
            "Look here, yeah.",
            "So I was wondering whether you had any comments on whether people's behavior would change if they knew that result of the experiment is going to result in a real world policy change that affected society inside.",
            "You know, like for example, you know.",
            "Well, if people who were chosen to rate television shows knew that it affected the defunding of public television.",
            "With that with that influence how they played the game.",
            "It's a really good question.",
            "Probably.",
            "You know one thing that we actually, there's a paper that my colleague Winter was just reviewing for Kai where they they manipulated the framing of it was a task on Mechanical Turk.",
            "The reason we thought it was interesting was that was exactly the same idea that we had had, and so we've got completely scooped.",
            "But the idea is to to provide the same task.",
            "But I'm but showed some people that this is this kind of task.",
            "Could you know will help you know researchers from the Cancer Institute to solve, you know, to help cure cancer and the other framing is?",
            "That it's will help you know pharmaceutical companies.",
            "You know, increase their profits.",
            "Fact they did, they did find a difference that people were more motivated and did a better job when they thought they would do this task was for altruistic ends, so I think they yes that there is.",
            "You know that you could well let me say, I bet you could set up experiments that would show that effect when you go out into the into the wild into the real world.",
            "And there's lots of things happening at the same time, and whether that one turns out to be more important than everything else that's going on, I think, is an open question.",
            "But yeah, we're definitely interested in trying to understand that, so I think there is one question here on the Twitter space.",
            "So this way everybody can see it.",
            "Well, it's only because you are.",
            "So if you can't read this as if Music Lab says that people are resistant to manipulations, then shall we not worry about social spams?",
            "Well, I would say because you worry about social spams that we don't have to worry about them right?",
            "But if that's the interesting thing about people is that they.",
            "The last question was sort of a little bit like this as well.",
            "Is that they actually don't like being understood in some sense, so it's not like studying atoms and electrons where you know they just keep doing behaving exactly the same way after you understand what they're doing.",
            "There's always this sort of dialectic between scientists and their subjects or marketers, and and and audiences.",
            "Where you sort of try to exploit or understand psychological patterns and then the patterns go away because people realize that you're taking advantage of them.",
            "The other point I would say is that is that is that people were not completely resistant to these manipulations, that there were.",
            "There were individual that the songs that were unfairly promoted actually did do better than they would have done had we not promoted them.",
            "So so there really were quite significant affects.",
            "It was just that at the aggregate level, it wasn't possible to lock people into this false world and that there were some sort of push back there.",
            "So."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think everybody is with him for the highlight today.",
                    "label": 0
                },
                {
                    "sent": "So I'm not Duncan Watts yet.",
                    "label": 1
                },
                {
                    "sent": "OK, I'm going to see say a few words about House Speaker.",
                    "label": 0
                },
                {
                    "sent": "Doctor, what is a?",
                    "label": 0
                },
                {
                    "sent": "Perhaps he's a stranger to our conference here, but it's definitely not a stranger to broad fields of community, social science network, and actually his background come from very, very broad areas.",
                    "label": 0
                },
                {
                    "sent": "So let me try to introduce a little bit here.",
                    "label": 0
                },
                {
                    "sent": "He currently directs the Human Social Dynamics Group in Yahoo Research, and he is also at the same time faculty member of Santa Fe Institute, which is very prestigious and well known organization.",
                    "label": 0
                },
                {
                    "sent": "Informally, he was a colleague of me for professor of Sociology at Columbia University, and he is best known for his popular book, one of the best selling book in sociology and social Sciences, called 6 degrees.",
                    "label": 0
                },
                {
                    "sent": "Assigns of connected age.",
                    "label": 0
                },
                {
                    "sent": "Some of you probably have read it.",
                    "label": 0
                },
                {
                    "sent": "Of course I have read it and is very popular influential.",
                    "label": 0
                },
                {
                    "sent": "His background is very interesting, not from multimedia, but he got his undergraduate degree in physics.",
                    "label": 0
                },
                {
                    "sent": "From New South Wales University in Australia and he got his PhD from theoretical, an experimental applied mechanics in Cornell University, and it's very interesting now.",
                    "label": 0
                },
                {
                    "sent": "Actually at the end he became a full professor in sociology and now he is a group leader of a social science research in Yahoo.",
                    "label": 0
                },
                {
                    "sent": "So it would be wonderful to imagine you have a career like that.",
                    "label": 0
                },
                {
                    "sent": "So I think today I think his bio is very long.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to take his time here everybody.",
                    "label": 0
                },
                {
                    "sent": "Again, for the wonderful talk he has been doing a lot of social science in Yahoo in different aspects and today he's going to reduce his vision and some of the work and using the web to do social science.",
                    "label": 1
                },
                {
                    "sent": "So let's welcome Doctor Watt.",
                    "label": 0
                },
                {
                    "sent": "Thank you Sifu for that very kind introduction and thanks for having me here.",
                    "label": 0
                },
                {
                    "sent": "It's great to be here.",
                    "label": 0
                },
                {
                    "sent": "Do I do I push the button that says danger?",
                    "label": 0
                },
                {
                    "sent": "To move the slides at this point, not the dangerous one.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Great thank you.",
                    "label": 0
                },
                {
                    "sent": "Thanks for that I see.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "So I want to start out by talking a little bit about the field that I come from, at least at least in recent years.",
                    "label": 0
                },
                {
                    "sent": "Which is sociology and sociology may not be very familiar with as a discipline.",
                    "label": 0
                },
                {
                    "sent": "It's a very broad discipline.",
                    "label": 0
                },
                {
                    "sent": "It's a little hard to describe what sociology is, but from, you know, from my sort of idiosyncratic perspective.",
                    "label": 0
                },
                {
                    "sent": "What makes social science social?",
                    "label": 1
                },
                {
                    "sent": "And the the sort of core interesting analytical problem for someone like me.",
                    "label": 0
                },
                {
                    "sent": "And the reason why I've sort of become fascinated with sociology is that you take in the social world, you take a group of people and you put them together and they interact with each other.",
                    "label": 0
                },
                {
                    "sent": "And somehow they produce something other than just a group of people.",
                    "label": 0
                },
                {
                    "sent": "They produce families, they produce firms, markets, cultures, and the question of how you get from this sort of micro level of individuals to the macro level of the social world and institutions is innocence.",
                    "label": 1
                },
                {
                    "sent": "The core theoretical question of.",
                    "label": 0
                },
                {
                    "sent": "Sociology.",
                    "label": 0
                },
                {
                    "sent": "It's also, you know, the core theoretical question of most of the other social Sciences as well, like economics and political science, and all of them have essentially the same difficulty, which is that getting from the micro to the macro is extremely difficult, and so if you look at the social and behavioral Sciences, they tend to sort of divide up into these two scales.",
                    "label": 0
                },
                {
                    "sent": "So we have microeconomics and we have macroeconomics, but it's very difficult to go from.",
                    "label": 1
                },
                {
                    "sent": "The micro to macro and you have psychology as a whole field of sociology as a whole field, but it's very difficult to to bridge the two.",
                    "label": 0
                },
                {
                    "sent": "And if you sort of look back through the history of sociology, there's a lot of discussion about this.",
                    "label": 1
                },
                {
                    "sent": "They call it the micro macro problem and the thought is that you know the reason where all the different.",
                    "label": 0
                },
                {
                    "sent": "The explanation for where the difficulty comes from is that you have these between individuals.",
                    "label": 0
                },
                {
                    "sent": "You have these sort of very complex networks of interaction.",
                    "label": 1
                },
                {
                    "sent": "Through which information passes where people influencing each other and changing their behavior in this sort of ongoing dynamic process, and the result is that you get this kind of emergent behavior, so this is, you know if we mentioned the Santa Fe Institute, which is one of the places that they really sort of originative what's now called the Sciences of complexity.",
                    "label": 0
                },
                {
                    "sent": "And so outside of sociology, this phenomenon of the micro becoming the macro is something that people call emergence.",
                    "label": 0
                },
                {
                    "sent": "And so when you look at something like systemic risk in financial system, which has been a very.",
                    "label": 0
                },
                {
                    "sent": "Popular topic of conversation.",
                    "label": 0
                },
                {
                    "sent": "The last couple of years you have these sort of this.",
                    "label": 0
                },
                {
                    "sent": "These phenomena, that sort of emerge at aggregate levels that are very difficult to explain or predict in terms of things happening at micro.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bulls so.",
                    "label": 0
                },
                {
                    "sent": "You know why has sociology and the social Sciences in general had so much trouble?",
                    "label": 0
                },
                {
                    "sent": "Cracking this micro macro problem, well actually everyone's had trouble cracking it.",
                    "label": 0
                },
                {
                    "sent": "It's difficult wherever we encounter it.",
                    "label": 0
                },
                {
                    "sent": "Sociology is that there's really no getting away from it.",
                    "label": 0
                },
                {
                    "sent": "So if we if we go back sort of 100 years throughout the history of sociology, sociologists have always been sort of aware of the importance of these networks, but the problem is that we haven't been able to measure them.",
                    "label": 0
                },
                {
                    "sent": "That you have millions or of people, so have billions or trillions of edges connecting them in these networks.",
                    "label": 0
                },
                {
                    "sent": "And really, none of this is observable.",
                    "label": 0
                },
                {
                    "sent": "The other problem is that you can't really do sort of macro scale experiments you can't put.",
                    "label": 0
                },
                {
                    "sent": "An army in a lab, as it were, and try to sort of tune the knobs to see if you can.",
                    "label": 0
                },
                {
                    "sent": "If you can understand the causal.",
                    "label": 0
                },
                {
                    "sent": "Effects.",
                    "label": 0
                },
                {
                    "sent": "Of phenomenon at that sort of macro scale, so it's very hard to do science in the way that we sort of think about science from a natural science perspective when you can't really measure anything that you care about, and you can't test your theories with experiments.",
                    "label": 1
                },
                {
                    "sent": "And so I think what's exciting these days and what motivates this talk is that something very interesting is happening in this current era where we have these sort of technological revolution associated with the web.",
                    "label": 0
                },
                {
                    "sent": "And more broadly, the Internet.",
                    "label": 0
                },
                {
                    "sent": "And also electronic communications devices and platforms that are effectively sort of lighting up these social networks that are allowing us to measure interactions and behavior in real time on very very large scales at sort of unprecedented levels of resolution.",
                    "label": 1
                },
                {
                    "sent": "And also something that I want to talk about a bit today is the ability to do experiments on a very large scale.",
                    "label": 0
                },
                {
                    "sent": "And you know, I use the phrase the web sort of loosely here.",
                    "label": 1
                },
                {
                    "sent": "I really, I say, using the web to do social science.",
                    "label": 0
                },
                {
                    "sent": "I really mean all of these technologies together, so I hope you will sort of forgive me for that sloppy terminology.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what I want to do for the rest of the talk is really just sort of describe a series of four projects that I've worked on over the last 10 years.",
                    "label": 1
                },
                {
                    "sent": "Really 9 or 10 years.",
                    "label": 0
                },
                {
                    "sent": "That are sort of loosely connected by this theme of of using the web to do social science and and also sort of substantive theme of social networks and what their structure is like and how they affect other kinds of questions that sociologists are interested in, and I'll try to sort of motivate each question separately in terms of the problem that that we were interested in at the time, and what we were trying to understand and also explain what we learned about.",
                    "label": 1
                },
                {
                    "sent": "The the methodological lessons that we learned along the way and finally I'll try to wrap up with some suggestions for what we.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I do in the future.",
                    "label": 0
                },
                {
                    "sent": "So the first one is, uh, an experiment that actually goes back a long way, and many of you have probably heard of this experiment was done by the social psychologist Stanley Milgram and his graduate student Jeffrey Travis back in the 1960s and they were interested in this question, which was sort of popular in folklore and also in sociology.",
                    "label": 0
                },
                {
                    "sent": "Even back then called the small world problem, which was the idea that everyone in the world could be connected to everyone else through just a short chain of intermediaries and millgram being an experimental person decided to test this hypothesis with an experiment.",
                    "label": 0
                },
                {
                    "sent": "So we picked a friend of his, a stockbroker who lived outside of Boston in Sharon, MA and he labeled him the target of this experiment.",
                    "label": 0
                },
                {
                    "sent": "And then he picked 300 other people from Omaha, NE and also from 100 of them from Boston itself, and each one of these centers was given the task of trying to get a packet, a letter of some kind to the target person, and they were given all sorts of information about his full name, his address, his wife's maiden name, his use of military service is Aqua.",
                    "label": 0
                },
                {
                    "sent": "Creation and so on.",
                    "label": 0
                },
                {
                    "sent": "Plenty of information to identify him uniquely, but the catch was they could only send it to him if they knew him on a first name basis, and that being very unlikely what they had to do instead was sent it to someone who they did know on a first name basis who they thought was closer to the target then they were, and so these sort of 2nd generation people got the letters and they were given the same instructions to pass it onto a third generation, and so on.",
                    "label": 1
                },
                {
                    "sent": "And so these letters kind of percolated their way across the country in the form of letter chains.",
                    "label": 1
                },
                {
                    "sent": "In about 20% of them reached the target, which actually sort of remarkable completion, right?",
                    "label": 1
                },
                {
                    "sent": "Once you try to do these sorts of experiments yourself, and the Milgram found was that the average length of the change that got to the target was six.",
                    "label": 0
                },
                {
                    "sent": "And this, we presume, is where the famous phrase 6 degrees of separation comes from.",
                    "label": 0
                },
                {
                    "sent": "Although Morgan actually never used that phrase himself.",
                    "label": 0
                },
                {
                    "sent": "So this was a remarkable result of the time, and we're so used to this idea of 6 degrees now that it's, it seems obvious, but but people were very surprised back then.",
                    "label": 0
                },
                {
                    "sent": "I thought it would be, you know, hundreds of steps to get from Omaha to Boston.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So fast forwarding many years now back at Columbia.",
                    "label": 0
                },
                {
                    "sent": "When I first started teaching there, we decided to try to recreate.",
                    "label": 1
                },
                {
                    "sent": "Milgram's experiment, except you know, this was sort of when email had really just become, you know, close to universal and.",
                    "label": 1
                },
                {
                    "sent": "We thought we would try to do this using email rather than physical packets, and so the nice thing about doing this on the web is that we could do it on a much larger scale.",
                    "label": 0
                },
                {
                    "sent": "So whereas Millgram had just one target and 300 chains, we had 18 different targets around the world from 15 different countries and we got more than 24,000 people to initiate change to one of these 18 different targets, and we actually had a much lower completion rate than.",
                    "label": 1
                },
                {
                    "sent": "And now Grim did, but we had over 400 of these messages eventually reach their targets, and in the process they pass through through more than 60,000 individuals in 166 countries.",
                    "label": 0
                },
                {
                    "sent": "So I think there's 190 two countries in the United Nations, so.",
                    "label": 0
                },
                {
                    "sent": "For all its problems, this experiment was getting close to something like the scale.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whole world so this this image shows.",
                    "label": 0
                },
                {
                    "sent": "One such target, so this is my old advisor, Steve Strogatz, who's a mathematician at Cornell University in that Big Red Dot, is centered on Ithaca, NY, and he insisted on being a target for this experiment.",
                    "label": 0
                },
                {
                    "sent": "It's sort of a people really like this.",
                    "label": 0
                },
                {
                    "sent": "They like to be targets for these things, 'cause it's sort of a kind of a measure of your sort of social connectivity.",
                    "label": 0
                },
                {
                    "sent": "So here's about 7000 dots that are all the letters that the email they all of the sort of the senders who were assigned Strogatz as a target, and you can see they start out all over the world.",
                    "label": 0
                },
                {
                    "sent": "Each one of these frames, so this is desiard, agrees this is the first degree second degree to 3rd degree, so this is degree 8.",
                    "label": 0
                },
                {
                    "sent": "So you can see that everything that's going to get to him.",
                    "label": 0
                },
                {
                    "sent": "Is going to get him in in eight steps or less and you can see some interesting patterns.",
                    "label": 0
                },
                {
                    "sent": "How these these targets these these these messages kind of converge on the major cities of the US and Western Europe before finally making their way to Ithaca, mostly via New York.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do we find?",
                    "label": 0
                },
                {
                    "sent": "Well, the old result is actually sort of surprisingly accurate.",
                    "label": 1
                },
                {
                    "sent": "The median length of the changes about 7:00, and there's lots of other results as well that we published since.",
                    "label": 0
                },
                {
                    "sent": "But the point I want to emphasize here, and I just sort of make this comment broadly for all the papers that I'm going to discuss today, that I don't really have time to go into all the details, and I'll certainly be happy to give you the references at end if you're interested.",
                    "label": 0
                },
                {
                    "sent": "But the point I want to emphasize here is that we.",
                    "label": 0
                },
                {
                    "sent": "Ran this experiment very naively, I think.",
                    "label": 0
                },
                {
                    "sent": "And almost 0 cost.",
                    "label": 0
                },
                {
                    "sent": "It was just my graduate student, Robbie Mohammed.",
                    "label": 1
                },
                {
                    "sent": "Sort of learning how to to to to to set up the website and somehow we managed to get over 60,000 people to participate in this experiment, and so I think in a way that an equally important discovery was what we call the Board at Work Network.",
                    "label": 1
                },
                {
                    "sent": "So this is a network of millions of people around the world who are sitting at their desks.",
                    "label": 0
                },
                {
                    "sent": "And they're bored and they're looking for something to do other than work.",
                    "label": 0
                },
                {
                    "sent": "And they have a computer on their desk in front of them, and if you can think of something for them to do for a few minutes, that's mildly entertaining, and importantly, doesn't make any noise.",
                    "label": 1
                },
                {
                    "sent": "They will do social science for you.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you're you know if you're if you're Mark Zuckerberg, you think, well, they'll make you know make you a billionaire, but they also do social science for you.",
                    "label": 0
                },
                {
                    "sent": "So this guy is thinking what else can we do and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next project that came along was associated with my graduate student at the time, Matthew Salganik, who's now a sociology professor at Princeton, and the problem that we were interested in was this sort of stylistic observation about cultural markets markets.",
                    "label": 0
                },
                {
                    "sent": "For things like books, movies, music, art, and so on.",
                    "label": 1
                },
                {
                    "sent": "And if you look at these markets, there's a couple of striking features that they have.",
                    "label": 0
                },
                {
                    "sent": "One is that.",
                    "label": 0
                },
                {
                    "sent": "Popular things are not just more popular than average.",
                    "label": 0
                },
                {
                    "sent": "There are many, many orders of magnitude more popular than average.",
                    "label": 0
                },
                {
                    "sent": "If you look at best selling books like the Harry Potter series, if you look at blockbuster movies like Avatar or Titanic.",
                    "label": 0
                },
                {
                    "sent": "Michael Jackson's thriller.",
                    "label": 0
                },
                {
                    "sent": "You know these are objects that are are sort of, you know, 3456 orders of magnitude more successful than an average object in one of those markets.",
                    "label": 0
                },
                {
                    "sent": "And so you have this massive inequality very, very striking inequality when you look across six.",
                    "label": 0
                },
                {
                    "sent": "Look at success across markets, but you might think, well, these things are.",
                    "label": 0
                },
                {
                    "sent": "You know, if you.",
                    "label": 0
                },
                {
                    "sent": "Popular things are the successful things are so much more successful than average, they must be sort of qualitatively different.",
                    "label": 0
                },
                {
                    "sent": "They must be different in a way that is sort of obvious.",
                    "label": 0
                },
                {
                    "sent": "At the outset, and yet if you look at all these examples, many of them came as a complete surprise, right?",
                    "label": 1
                },
                {
                    "sent": "So the Harry Potter series is a good example of that.",
                    "label": 0
                },
                {
                    "sent": "It was.",
                    "label": 0
                },
                {
                    "sent": "It was JK Rowling's original manuscript was rejected by about eight children's publishing houses before it was finally picked up by Bloomsbury, which was back there in a very small, independent press.",
                    "label": 0
                },
                {
                    "sent": "Now it's a very large, independent press.",
                    "label": 0
                },
                {
                    "sent": "And those a children's publishers no doubt feel like complete idiots, but they're in good company because you and there's just so many stories of sort of blockbuster movies and an artists.",
                    "label": 0
                },
                {
                    "sent": "And so on, who who were, who were not predicted by motivated professional people who have lots of experience in those industries.",
                    "label": 0
                },
                {
                    "sent": "So so the question we were interested in is how do you reconcile these observations that successful things are much more successful than average and yet also highly unpredictable an hour.",
                    "label": 0
                },
                {
                    "sent": "What was that?",
                    "label": 0
                },
                {
                    "sent": "Again, sort of going back to this micro macro problem that you that when people individuals make decisions about these kinds of in these markets, there are influenced by what other people are doing.",
                    "label": 0
                },
                {
                    "sent": "So there's this sort of individual level process of social influence going on, and that somehow these all these little influences are piling up to generate this inequality.",
                    "label": 1
                },
                {
                    "sent": "And I'm pretty unpredictability now.",
                    "label": 1
                },
                {
                    "sent": "We had actually done some theoretical work on this in the past, and what we wanted to do now is to try to verify this work with.",
                    "label": 0
                },
                {
                    "sent": "With something like a lab experiment where we put people into control conditions that we can that we can very systematically and examine whether social influence generates this kind of effect.",
                    "label": 1
                },
                {
                    "sent": "The problem with doing this kind of experiment, however, is that you need a lot of people, so for every market that you want to.",
                    "label": 0
                },
                {
                    "sent": "To simulate in a in a lab you need you know dozens of things to choose between.",
                    "label": 0
                },
                {
                    "sent": "In this case that we're going to talk about songs, you need hundreds of people.",
                    "label": 0
                },
                {
                    "sent": "If you want to have multiple markets, you need to have thousands of people.",
                    "label": 0
                },
                {
                    "sent": "If you want to have different experimental conditions, you have to have 10s of thousands of people.",
                    "label": 0
                },
                {
                    "sent": "This is more undergraduates than we can get at Columbia University, and so we need to find a new way of doing this.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lots of experiments and of course what we're interested in is seeing if we can do this on the web, and so this is the website.",
                    "label": 0
                },
                {
                    "sent": "This is the experiment that Matt built was called music.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lab and when you come & up for Music Lab, you see a screen that looks like this where you have 48 songs by bands that you've never heard of.",
                    "label": 1
                },
                {
                    "sent": "I guarantee that.",
                    "label": 0
                },
                {
                    "sent": "And each one of these little grid squares corresponds to a song, as in sorry, the band is in all caps, and the song underneath is in there, and then the right hand side you see this little number, which tells you how many times that song has been downloaded.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why people before you?",
                    "label": 0
                },
                {
                    "sent": "So you click on one of those grid squares and the music streams through your through your web browser and you can give it a rating from one to five stars.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then once you write it, we give you the option to download it, or to say no thanks.",
                    "label": 1
                },
                {
                    "sent": "I don't want this.",
                    "label": 0
                },
                {
                    "sent": "I want to go back to the main menu and this is the action that we pay attention.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what you don't know is that when you arrive at this website you are shunted into one of two conditions.",
                    "label": 1
                },
                {
                    "sent": "So the first condition is the one that you saw.",
                    "label": 0
                },
                {
                    "sent": "It is called social information condition.",
                    "label": 0
                },
                {
                    "sent": "The the second condition, the independent condition looks exactly the same as what you just sorts.",
                    "label": 0
                },
                {
                    "sent": "If there are no numbers, right?",
                    "label": 0
                },
                {
                    "sent": "So you get to the website and you have to just decide however you want to decide there's no information given to you about the popularity of these songs within the social information condition.",
                    "label": 1
                },
                {
                    "sent": "We also divide that up into eight different worlds.",
                    "label": 0
                },
                {
                    "sent": "And So what that means is that you, if you arrive in world one, you only get to see the downloads of people who are ahead of you.",
                    "label": 1
                },
                {
                    "sent": "In that world, and not any of the others.",
                    "label": 0
                },
                {
                    "sent": "So what we effectively did was create 9 independent an identical copies of the world that all started out together, and then we let them run in parallel.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To see what would happen so you can see here that at the micro level you do in fact see some social influence.",
                    "label": 1
                },
                {
                    "sent": "So this is the probability of listening to a song as a function of its rank based on its existing market share.",
                    "label": 0
                },
                {
                    "sent": "So you can see that songs that have the highest ranks that have been downloaded previously are much more likely to be listened to then songs that are just sort of in the mix down here.",
                    "label": 0
                },
                {
                    "sent": "And if you look on the right hand side you see the same plot for the independent condition you can see as you would expect.",
                    "label": 1
                },
                {
                    "sent": "That there is no effect of rank on market share whatsoever.",
                    "label": 0
                },
                {
                    "sent": "So so this is clearly having the effect at the individual level that you would expect people are paying attention to this site.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No signal, but what we're interested in, of course, is not what's going on at the individual level, but rather what's going on at the collective level, and so we have to have ways of measuring these.",
                    "label": 0
                },
                {
                    "sent": "This inequality and unpredictability that we're interested in in the real world, and the inequality measure that we use is a very simple and standard measure of inequality called the Gini coefficient, which is really just the expected difference in market share between two randomly chosen songs.",
                    "label": 1
                },
                {
                    "sent": "So when when the Gini coefficient is zero, everything has the same market share, and when it's one every one song has all the downloads and nobody else has anything.",
                    "label": 1
                },
                {
                    "sent": "The other thing that we're interested in is unpredictability.",
                    "label": 1
                },
                {
                    "sent": "Which is really just, you know, one way to think about it is if I give you the ranking from 1 to 48 in one world, how much can you tell about the ranking in another world?",
                    "label": 0
                },
                {
                    "sent": "And so, how much are these?",
                    "label": 0
                },
                {
                    "sent": "Are these worlds related to each other?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so again I don't have time to go into the details.",
                    "label": 0
                },
                {
                    "sent": "I'll just summarize them.",
                    "label": 0
                },
                {
                    "sent": "We did four different experiments using this sort of basic setup.",
                    "label": 0
                },
                {
                    "sent": "The first one is the one you just saw.",
                    "label": 0
                },
                {
                    "sent": "We call out the weak condition because the songs were just randomly scattered on that 6 by 8 grid.",
                    "label": 0
                },
                {
                    "sent": "The strong condition was where we ranked them from first to last, so everything looks the same except the songs are all just ranked in one column in a way that sort of actually more sort of familiar from the.",
                    "label": 0
                },
                {
                    "sent": "Music websites that exist.",
                    "label": 0
                },
                {
                    "sent": "And naturally, that increases the salience of the social signal.",
                    "label": 0
                },
                {
                    "sent": "So people have a clear idea of what's popular and what's not.",
                    "label": 0
                },
                {
                    "sent": "The first 2 experiments were both conducted using mostly teenagers who we recruited off this social web social networking website called bolkcom, which is no longer exists.",
                    "label": 0
                },
                {
                    "sent": "But we were interested in.",
                    "label": 0
                },
                {
                    "sent": "Of course, people think that you know teenagers possibly are different from the rest of us, and so we made use of the.",
                    "label": 0
                },
                {
                    "sent": "The previous experiment, the small world experiment.",
                    "label": 0
                },
                {
                    "sent": "We had capital email addresses the people who participated in that and we had asked them if they would be interested in participating in subsequent experiments, and some of them said yes they would and so we emailed them and said we have this new experiment.",
                    "label": 0
                },
                {
                    "sent": "Would you like to participate in that as well?",
                    "label": 0
                },
                {
                    "sent": "And so we got an additional 12,000 or so participants from this very different population of people who are generally older in their 30s and 40s and were professionals.",
                    "label": 0
                },
                {
                    "sent": "And so we were able to verify.",
                    "label": 0
                },
                {
                    "sent": "Our results with a different population and then finally that was experiment 3 and then finally an experiment.",
                    "label": 0
                },
                {
                    "sent": "For we we.",
                    "label": 0
                },
                {
                    "sent": "Introduced a level of deception into the experiment by taking one of these worlds that had already settled down so that all the rankings had stabilized, and then inverting it to make the most popular song seem like that with the least popular songs and at least popular songs seem like the most popular songs to see whether people could in fact figure out these intrinsic differences in quality, or whether they would be fooled.",
                    "label": 0
                },
                {
                    "sent": "Buy the social signal and generate what's called a self fulfilling prophecy.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so putting all of those together and just summarizing results again, I can show you the be happy to share the papers with you if you would like.",
                    "label": 0
                },
                {
                    "sent": "Individuals are absolutely influenced by what they think other people like, and the more you sort of tweak that social signal, the more they are influenced at the collective level.",
                    "label": 1
                },
                {
                    "sent": "What we found, as we had hypothesized is that popular songs when people know what other people like popular songs get more popular and unpopular songs get less popular, so the inequality increases.",
                    "label": 0
                },
                {
                    "sent": "As predicted, an at the same time, it becomes increasingly difficult to predict which.",
                    "label": 0
                },
                {
                    "sent": "Songs are going to be the hit song, so the unpredictability increases along with the inequality.",
                    "label": 0
                },
                {
                    "sent": "So there's an interesting paradox here, which is that when you give people social information when you tell them what other people like, you're actually helping them.",
                    "label": 1
                },
                {
                    "sent": "You're doing them a service.",
                    "label": 0
                },
                {
                    "sent": "You're providing them more information.",
                    "label": 0
                },
                {
                    "sent": "This is why we have expert reviews and Amazon ratings.",
                    "label": 0
                },
                {
                    "sent": "And best seller lists.",
                    "label": 0
                },
                {
                    "sent": "These are all ways of simplifying the world for us so that we don't have to go out and do all the heavy lifting.",
                    "label": 0
                },
                {
                    "sent": "Of, you know, going through however many 10s of thousands of books are available.",
                    "label": 0
                },
                {
                    "sent": "We can just go to the few that have been recommended to us.",
                    "label": 0
                },
                {
                    "sent": "And so the social the social information is a useful signal for people.",
                    "label": 0
                },
                {
                    "sent": "The paradox is that the more information you give individuals, the less information is aggregated by the population.",
                    "label": 0
                },
                {
                    "sent": "And the reason is that people simply follow the information that you give them, and they don't add any of their own independent information, and so you get what economists call an information cascade, which actually is sort of a strange name for it, because it really is a.",
                    "label": 0
                },
                {
                    "sent": "Absence of information cascade.",
                    "label": 0
                },
                {
                    "sent": "And so this is the the explanation for how we see this sort of simultaneous increase in inequality and unpredictability.",
                    "label": 0
                },
                {
                    "sent": "Of course, when you know the music industry people heard about this result, the first thing they wanted to know is can we manipulate this?",
                    "label": 0
                },
                {
                    "sent": "Can we use this to sell more of our stuff to create our own hits?",
                    "label": 0
                },
                {
                    "sent": "And the answer is, well, not really.",
                    "label": 0
                },
                {
                    "sent": "Sort of maybe.",
                    "label": 0
                },
                {
                    "sent": "To summarize, you can fool some of the people some of the time, but you can't fool all the people all of the time.",
                    "label": 1
                },
                {
                    "sent": "It's possible to create self fulfilling prophecies at the level of individual songs you can buy moving by manipulating their apparent popularity.",
                    "label": 0
                },
                {
                    "sent": "Make them do better or worse than they would have done had you not manipulated them.",
                    "label": 0
                },
                {
                    "sent": "But if you do too much of this, as we found much to our surprise, people just don't like it and they go away and we found that in the manipulated condition there were many fewer downloads than the underneath.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I did condition.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's two experiments we're halfway through.",
                    "label": 0
                },
                {
                    "sent": "And one of them you may note, was about networks.",
                    "label": 0
                },
                {
                    "sent": "The second one was not really about networks, there was no network in the music Lab.",
                    "label": 0
                },
                {
                    "sent": "Experiment was just people lining up one after the other.",
                    "label": 0
                },
                {
                    "sent": "But there was influence in Music Lab experiment, so we were measuring some sort of behavior in the second one, and we're measuring some sort of connectivity in the first one.",
                    "label": 0
                },
                {
                    "sent": "But of course in real life we have both things going on at once.",
                    "label": 1
                },
                {
                    "sent": "We have people connected in these large networks and we have information spreading through them.",
                    "label": 0
                },
                {
                    "sent": "We have people influencing their behavior and in some sense that's what we'd really like to get our hands around.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "No, the one of the sort of.",
                    "label": 0
                },
                {
                    "sent": "Pieces of that puzzle.",
                    "label": 0
                },
                {
                    "sent": "But that market is in particular, but others as well have gotten so motivated by in recent years is that when you put these these ideas of diffusion and networks together, you can easily persuade yourself that that out there in these networks are these special people.",
                    "label": 0
                },
                {
                    "sent": "These influential's or influences or connectors, as they are often called, and that these people wield disproportionate influence over others, and people use this phrase, influencer very.",
                    "label": 1
                },
                {
                    "sent": "Loosely to mean lots of different types of people.",
                    "label": 1
                },
                {
                    "sent": "You know, Oprah Winfrey's greatest selling books Sarah Jessica Parker was famous for wearing Manolo Blahniks on sex in the city.",
                    "label": 0
                },
                {
                    "sent": "And suddenly they become popular.",
                    "label": 0
                },
                {
                    "sent": "Jeff Jarvis is A is a is a widely read technology Blogger in the US and he had some beef with Dell customer service because they they wouldn't help him fix his computer and so he ranted about it on his on his blog and the next thing you know Dell has a full blown customer service crisis on its hands and so it's very sort of tempting to look at these stories and say look there are, you know, we know that there are these special people out there and if we can just find them they can do all the work for us, right?",
                    "label": 1
                },
                {
                    "sent": "That we can.",
                    "label": 0
                },
                {
                    "sent": "So this is, you know, sort of like the ultimate free lunch in marketing language.",
                    "label": 0
                },
                {
                    "sent": "Find the influences and they will do all the work.",
                    "label": 1
                },
                {
                    "sent": "But the problem with this is that all of these stories are always told after the fact.",
                    "label": 0
                },
                {
                    "sent": "So once you see something remarkable happened, you go back and you find that Jeff Jarvis is of the world and you say, uh, that guy must be an influencer.",
                    "label": 1
                },
                {
                    "sent": "The problem is that you really what you would like to do is identify them beforehand so that you can go out there and recruit them and get them to talk about what you want them to talk about.",
                    "label": 0
                },
                {
                    "sent": "And there's no evidence that marketers or anyone else can do this.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Recently so how do we think about this?",
                    "label": 0
                },
                {
                    "sent": "How do we study this problem?",
                    "label": 0
                },
                {
                    "sent": "Well, it sounds like we're going to be using Twitter today and I think Twitter is interesting for all sorts of reasons, but from a social scientist perspective, Twitter is sort of a very.",
                    "label": 0
                },
                {
                    "sent": "If you had to imagine a platform created to study influences, you would probably imagine something like Twitter.",
                    "label": 0
                },
                {
                    "sent": "This is a network that is has millions of people who have explicitly opted into listening to each other, so it's not like a sort of more generic social network like Facebook for example, where people are connected to each other for all sorts of reasons.",
                    "label": 0
                },
                {
                    "sent": "on Twitter, you're only there because you want to hear what other people have to say.",
                    "label": 0
                },
                {
                    "sent": "Can you tell the platform who you want to listen to by following them?",
                    "label": 0
                },
                {
                    "sent": "On the flip side, the people who are tweeting are trying to be heard by the people who are following him, so this is a network that's ready made for studying influence.",
                    "label": 0
                },
                {
                    "sent": "At least the restricted kind of influence that has to do with information passing around a network.",
                    "label": 0
                },
                {
                    "sent": "We can't observe shopping behavior or or voting behavior, or many of the other kinds of influence that we would be interested in.",
                    "label": 0
                },
                {
                    "sent": "Another advantage of Twitter is that.",
                    "label": 1
                },
                {
                    "sent": "You know one of the conventions that people have have glommed onto is that when they they want to broadcast other kinds of web content, they use one of a number of URL shorteners in particular, bit LY is the most popular, and these have the nice advantage that they provide compact and uniquely identifiable labels for individual pieces of information.",
                    "label": 1
                },
                {
                    "sent": "So you can actually sort of tag a piece of information and we know where it starts and we know we're.",
                    "label": 0
                },
                {
                    "sent": "Travels to and so we can reconstruct all these diffusion events where some piece of information is introduced somewhere in the network, and then we can see where it spreads through a series of retweets.",
                    "label": 0
                },
                {
                    "sent": "So this is work that began last summer with a time Bakshi grad student at Michigan and a couple of my colleagues at Yahoo.",
                    "label": 0
                },
                {
                    "sent": "Jake Hoffman and Winter Mason.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 1
                },
                {
                    "sent": "Observed about a billion public Twitter posts in the last two months of 2009 and extracted out of these about 19 million containing Bitly URL.",
                    "label": 0
                },
                {
                    "sent": "So we have about 1.6 million users who are active during this two month period and they're all introducing.",
                    "label": 0
                },
                {
                    "sent": "There are no receding around diffusion events and I'll explain in a second how we how we compute that.",
                    "label": 0
                },
                {
                    "sent": "We also crawled the whole well, not the whole follower graph, but a large chunk of the follower graph comprising about 56 million users.",
                    "label": 0
                },
                {
                    "sent": "It's considerably larger than.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right now.",
                    "label": 0
                },
                {
                    "sent": "OK, so how do we compute influence on Twitter?",
                    "label": 1
                },
                {
                    "sent": "So an individual person, let's call a masid, initiates a URL into the system.",
                    "label": 1
                },
                {
                    "sent": "So now we have that unique tag and then for every one of their followers who who rebroadcasts that URL either by using the retweet function or or simply by following them close in time, we allocate the original person one point and so this is sort of like an Amway pyramid scheme that everyone you recruit gives you points and everyone they recruit gives you points and everyone those people recruits give you points.",
                    "label": 0
                },
                {
                    "sent": "So if you have multiple generations of retweets spanning out from this initial tweet.",
                    "label": 1
                },
                {
                    "sent": "Get many many points.",
                    "label": 1
                },
                {
                    "sent": "So we assign an influence score for every one of these cascades.",
                    "label": 0
                },
                {
                    "sent": "Again, there's about 19 million of them.",
                    "label": 1
                },
                {
                    "sent": "And then we average for each individual the scores that they get for all of the Cascades that they have initiated.",
                    "label": 0
                },
                {
                    "sent": "Now this is a very conservative measure of influence.",
                    "label": 0
                },
                {
                    "sent": "We actually, you know, it's possible that even if people don't retweet you, there's still reading what you have to say.",
                    "label": 0
                },
                {
                    "sent": "And maybe they've been influenced by it, and we can't see that.",
                    "label": 0
                },
                {
                    "sent": "The only thing that we can we count here is is the is the retweet.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what the Cascades look like.",
                    "label": 0
                },
                {
                    "sent": "You can see that some of them are very shallow and broad and others are narrow and deep and some of them are very sort of large and complex like the one in the middle.",
                    "label": 0
                },
                {
                    "sent": "There most of them.",
                    "label": 0
                },
                {
                    "sent": "However, as you'll see.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tiny.",
                    "label": 0
                },
                {
                    "sent": "And so if you look at the distribution of cascade size, it has this sort of highly skewed that are roughly Powell or shape, where the vast majority nearly 98% of them especially don't go anywhere, right?",
                    "label": 1
                },
                {
                    "sent": "So the median size of a cascade is one that is yourself.",
                    "label": 0
                },
                {
                    "sent": "The average size is only a tiny bit higher.",
                    "label": 1
                },
                {
                    "sent": "One point 1 four, so most tweets don't go anywhere.",
                    "label": 0
                },
                {
                    "sent": "Almost nothing gets retweeted.",
                    "label": 0
                },
                {
                    "sent": "But if you do and you can see that somewhere in the right hand side there this one is over 10,000 retweets, has propagated more than eight generations deep.",
                    "label": 0
                },
                {
                    "sent": "So if you're if you're a sort of market, are you sort of what you immediately focus on this tail and you say OK, how do I get me one of those?",
                    "label": 0
                },
                {
                    "sent": "But I want these things they get, they get retweeted thousands of times, they want to reproduce these cascades that that, that that.",
                    "label": 0
                },
                {
                    "sent": "Generate.",
                    "label": 0
                },
                {
                    "sent": "Did they go from any generation?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Eat.",
                    "label": 0
                },
                {
                    "sent": "But of course, what you really care about is.",
                    "label": 0
                },
                {
                    "sent": "In this case is predicting right?",
                    "label": 0
                },
                {
                    "sent": "So we can we can look at those.",
                    "label": 0
                },
                {
                    "sent": "Those cascades out in the tail, and we can tell some story about you know why they succeeded after the fact.",
                    "label": 0
                },
                {
                    "sent": "But that's sort of useless to us.",
                    "label": 0
                },
                {
                    "sent": "Really, what we want to do is see if we can predict, identify the features in advance that will allow us to predict large cascades, and so we basically take everything that we can.",
                    "label": 1
                },
                {
                    "sent": "Off Twitter, so we have we first of all we split the two month period into into hubs and we use this first half as the history and the second half is the future, and so we have some information from the first month about how successful people have been generating cascades, and we use that as a predictor for how successful they're going to be in the in the second month.",
                    "label": 0
                },
                {
                    "sent": "So that's actually a lot you don't normally get that in the real world.",
                    "label": 0
                },
                {
                    "sent": "We also don't have any followers.",
                    "label": 0
                },
                {
                    "sent": "They have many people.",
                    "label": 1
                },
                {
                    "sent": "They follow how many reciprocated ties they have, how frequently they tweet when they joined.",
                    "label": 1
                },
                {
                    "sent": "We have a lot of information about them and then we use a regression tree model too.",
                    "label": 0
                },
                {
                    "sent": "But just think linear regression is close enough to to see if we can predict the future given the path.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fast and this is roughly what the results look like, and you see the model is actually very well calibrated.",
                    "label": 1
                },
                {
                    "sent": "The X axis is predicted influence in the Y axis is actual influence, so it looks initially like you have a lot of predictability and the two features that turn out to matter the most are very intuitive.",
                    "label": 0
                },
                {
                    "sent": "How influential you've been in the past and how many followers you have.",
                    "label": 0
                },
                {
                    "sent": "So you might say, well, it's obvious.",
                    "label": 0
                },
                {
                    "sent": "But what's interesting is that some of the other things that also would have seemed obvious, turn out not to be very productive, so it doesn't matter how frequently you tweet is Manahan people who follow these things don't add anything.",
                    "label": 1
                },
                {
                    "sent": "Surprisingly, content doesn't really help you much either, so you might think that the the actual content of the URL would impact its ability to spread.",
                    "label": 0
                },
                {
                    "sent": "But we took a random sample of 1000 such URLs and we put them up on mechanical Amazons Mechanical Turk that I'll talk about next and we got people too.",
                    "label": 0
                },
                {
                    "sent": "To classify them by what type of content they were and how interesting they were and how likely they were to to forward them to their friends.",
                    "label": 0
                },
                {
                    "sent": "And none of these features improve the fit of the model at all, so this was very surprising to us.",
                    "label": 0
                },
                {
                    "sent": "Actually, we really thought that would help.",
                    "label": 0
                },
                {
                    "sent": "Now the other thing I want to note is that as well calibrated as the model is, the fit is very poor, so there's an ask where to .3 four there, so you're only explaining about 30% of the of the variance.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the data.",
                    "label": 0
                },
                {
                    "sent": "So if you look at the non averaged version of this you see what's going on that the two axes here are past local influence and number of followers.",
                    "label": 0
                },
                {
                    "sent": "The size of the circles reflects the influence of that individual and the right hand plot is just is just actually a an expansion of the top right hand corner, so they're really the same plot and you can see that.",
                    "label": 0
                },
                {
                    "sent": "Third time.",
                    "label": 0
                },
                {
                    "sent": "What's going on here is indeed as the main results show people with with past local influence and an high number of followers are more likely than average to generate large cascades.",
                    "label": 0
                },
                {
                    "sent": "But there is a tremendous amount of rain.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And scatter.",
                    "label": 0
                },
                {
                    "sent": "And So what this reflects is, is what we might call necessary but not sufficient conditions, but.",
                    "label": 1
                },
                {
                    "sent": "The tendency, at least in the you know in the.",
                    "label": 0
                },
                {
                    "sent": "In the marketing world is to see something that succeeds and actually this is not true.",
                    "label": 0
                },
                {
                    "sent": "Just marketing will.",
                    "label": 0
                },
                {
                    "sent": "In the marketing world is also true in the in the business world.",
                    "label": 0
                },
                {
                    "sent": "In general, if you look at these business books about successful companies or successful people, you notice that they all have the same structure, which is?",
                    "label": 0
                },
                {
                    "sent": "They take a bunch of successful people or companies and they look at them to see what factors they have in common.",
                    "label": 0
                },
                {
                    "sent": "What they don't do is look at all the unsuccessful companies and unsuccessful people and if they did they would find that many of those same factors show up in the unsuccessful objects as well.",
                    "label": 0
                },
                {
                    "sent": "And so when we tend to look, we tend to analyze success where we generally find what we might call necessary conditions, or at least mostly necessary conditions.",
                    "label": 0
                },
                {
                    "sent": "So it helps to have lots of followers, and it helps to have a past track record, but it doesn't follow that someone who has lots of followers, Anna good past track record will be successful in the future, and in fact most of the time they won't be.",
                    "label": 0
                },
                {
                    "sent": "And this is a you know, common for a same sort of problem arises in explaining all kinds of rare events, not just success, but also plane crashes, school shootings.",
                    "label": 1
                },
                {
                    "sent": "If you look at if you look at school shootings in America, invariably, there's some common factors that you have sort of teenage boys who who dress a lot in black and watch lots of violent TV and play violent video games and write nasty letters to their teachers.",
                    "label": 0
                },
                {
                    "sent": "But this description also fits about 50,000 other teenage boys in the US, none of whom ever cause any problems.",
                    "label": 0
                },
                {
                    "sent": "So across marketing and across business and across many other.",
                    "label": 0
                },
                {
                    "sent": "Interesting social phenomena.",
                    "label": 1
                },
                {
                    "sent": "We have this same problem where we can convince ourselves in retrospect that we can explain why things happen, but we're unable to predict using those explanations because for everything that every interesting thing that happens for every success that happens.",
                    "label": 0
                },
                {
                    "sent": "There are many non interesting things, many non successes that.",
                    "label": 0
                },
                {
                    "sent": "They have exactly the same features and so what's interesting about Twitter here is that we are able to see the full sample of everything that's happening, and so this problem is exposed for us.",
                    "label": 0
                },
                {
                    "sent": "How much time go ahead?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think I started late so OK alright so I'm just going to skip this.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As I know you will want to hear about Kim Kardashian, but I'll skip that section so that the final experiment that I want to talk about.",
                    "label": 0
                },
                {
                    "sent": "Is one that sort of tries to bring these things together that with the Twitter study did include networks and some version of influence, but it wasn't of course actually an experiment, just an observation ULL study, so there's not so much we can say in terms of causal statements really just correlations.",
                    "label": 0
                },
                {
                    "sent": "So what we would like to do is try to run the kind of experiment that we did for Music Lab, except where we have the network and the behavior all at the same time.",
                    "label": 0
                },
                {
                    "sent": "And indeed, Michael Kerns and his colleagues at University of Pennsylvania have been have been running experiments like this for several years now in a physical lab that's equipped with computers.",
                    "label": 0
                },
                {
                    "sent": "I'm so in a sense what we're trying to do is do the same kind of thing on the web now.",
                    "label": 0
                },
                {
                    "sent": "What's difficult about this is that everybody has to be present at the same time, so you have to have sort of synchronous updating of the different participants.",
                    "label": 0
                },
                {
                    "sent": "So in Music Lab and the small world experiment, you anyone could just sort of arrive at anytime and then they could just participate and leave, so everything was completely asynchronous and this makes it very easy to scale on the web.",
                    "label": 0
                },
                {
                    "sent": "By contrast, it's very hard to do this.",
                    "label": 0
                },
                {
                    "sent": "When you have to get a large number of people to show up at the same time at a website and sticker.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Down.",
                    "label": 0
                },
                {
                    "sent": "So the question that we're going to address here is about cooperation.",
                    "label": 0
                },
                {
                    "sent": "This is really sort of the.",
                    "label": 1
                },
                {
                    "sent": "Maybe the original question of social science.",
                    "label": 1
                },
                {
                    "sent": "It goes all the way back to Hobbes, which is why do people cooperated all?",
                    "label": 1
                },
                {
                    "sent": "Why do selfish people?",
                    "label": 0
                },
                {
                    "sent": "Help each other when in fact they should just be helping themselves and why's.",
                    "label": 0
                },
                {
                    "sent": "Hobbs said why is there not war of all against all?",
                    "label": 0
                },
                {
                    "sent": "So this is again a longstanding question in social science.",
                    "label": 0
                },
                {
                    "sent": "I want to Ostrom political scientist 1 Nobel Prize in Economics in 2009 for her work on public goods games, so that's what we're going to study here.",
                    "label": 0
                },
                {
                    "sent": "What's called a linear public goods game?",
                    "label": 0
                },
                {
                    "sent": "Or you have a series of rounds each round, every player gets an endowment, gets a sum of money or points.",
                    "label": 0
                },
                {
                    "sent": "Really, that's convertible to money.",
                    "label": 1
                },
                {
                    "sent": "Each person decides independently how much of their endowment to contribute.",
                    "label": 1
                },
                {
                    "sent": "The contributions are pooled, their multiplied by some constant factor, which is why there it's called a linear public goods game and then critically the pool gets redistributed equally to all the participants, regardless of how much they contributed.",
                    "label": 1
                },
                {
                    "sent": "So here's the dilemma.",
                    "label": 0
                },
                {
                    "sent": "Everybody is better off if everybody contributes the maximum amount, right?",
                    "label": 0
                },
                {
                    "sent": "So the social welfare maximizing solution is for everyone to put in the total amount individually.",
                    "label": 0
                },
                {
                    "sent": "However, you're better off of everyone else puts in the maximum amount, and you put in nothing.",
                    "label": 0
                },
                {
                    "sent": "Right, so there's a tension between your own selfish interests and the interests of the group.",
                    "label": 0
                },
                {
                    "sent": "So understanding how this.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Plays out, as has been the subject of a lot of theory and a lot of experiments, and so, for example, earns fair and Simon Gaechter in Zurich have done a lot of these public goods games and they generally show that contributions start out high and then they decline overtime to end low.",
                    "label": 1
                },
                {
                    "sent": "People actually get very upset when other people don't cooperate, they punish each other.",
                    "label": 1
                },
                {
                    "sent": "They will pay money to punish punishment, help.",
                    "label": 0
                },
                {
                    "sent": "So there's all sorts of results that people have.",
                    "label": 1
                },
                {
                    "sent": "Discovered over the years.",
                    "label": 0
                },
                {
                    "sent": "But Interestingly, all of these results have been done for essentially for small groups, usually groups of four people, and what we?",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Interested in now is whether we can we can.",
                    "label": 0
                },
                {
                    "sent": "Extend these sorts of experiments to to networks.",
                    "label": 1
                },
                {
                    "sent": "Now how are we going to do that?",
                    "label": 0
                },
                {
                    "sent": "We're going to take advantage of this sort of site that's been around for a few years now called Amazon's Mechanical Turk.",
                    "label": 0
                },
                {
                    "sent": "It's obviously run by Amazon.",
                    "label": 0
                },
                {
                    "sent": "Mechanical Turk was the original Mechanical Turk was a chess playing automaton in the early 19th century that was famous for having beaten Napoleonic chess.",
                    "label": 0
                },
                {
                    "sent": "Of course, the Mechanical Turk was a fraud.",
                    "label": 0
                },
                {
                    "sent": "There was actually a person.",
                    "label": 0
                },
                {
                    "sent": "Inside the the automaton playing the moves and This is why Jeff Bizos calls Mechanical Turk at artificial artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "It was originally designed for people to solve certain tasks, like particularly image labeling, that are very relatively easy for people but difficult for machines.",
                    "label": 0
                },
                {
                    "sent": "But increasingly it's being used by behavioral scientists to do experiments, so this sort of the virtual equivalent of putting the flies up around campus and recruiting undergraduate students to the psych lab to participate in an experiment.",
                    "label": 0
                },
                {
                    "sent": "And so Winter, Mason and sensory, my colleagues at Yahoo have just actually written a Handbook for running experiments on Mechanical Turk, so if any of you are interested in using Mechanical Turk to do experiments, you should.",
                    "label": 1
                },
                {
                    "sent": "You should download this Handbook.",
                    "label": 0
                },
                {
                    "sent": "It's incredibly.",
                    "label": 1
                },
                {
                    "sent": "Useful.",
                    "label": 1
                },
                {
                    "sent": "So here's how we're going to solve the synchronous problem.",
                    "label": 0
                },
                {
                    "sent": "Is that we ran a series of small experiments with this to four players in them and we asked people if they wanted to sign up to be in a panel.",
                    "label": 1
                },
                {
                    "sent": "So we overtime constructed a panel of about 100 players and then we would send out an email blast to them the night before.",
                    "label": 0
                },
                {
                    "sent": "And so we're going to run experiments tomorrow at 11:00 AM one PM, 3 PM, 5:00 PM.",
                    "label": 0
                },
                {
                    "sent": "You know, please come and participate.",
                    "label": 0
                },
                {
                    "sent": "We remind them 5 minutes beforehand and were able to get groups of up to 24 players.",
                    "label": 0
                },
                {
                    "sent": "Two to fill up on a waiting room in two minutes.",
                    "label": 0
                },
                {
                    "sent": "Or roughly 2 minutes and then the game would start.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first thing we did so in the in the preliminary experiments, we wanted to check this.",
                    "label": 0
                },
                {
                    "sent": "To see whether this this population is platform.",
                    "label": 0
                },
                {
                    "sent": "This way of running games.",
                    "label": 0
                },
                {
                    "sent": "Had any resemblance to the kind of classic studies that have been done in labs around the world, and so we compared our results to to those from Ferron gaechter back in Zurich in the late 90s.",
                    "label": 0
                },
                {
                    "sent": "And you can see that the results are almost exactly the same.",
                    "label": 0
                },
                {
                    "sent": "That the average contribution starts out high and then sort of trends linearly downwards over this.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Days of 10 rounds.",
                    "label": 0
                },
                {
                    "sent": "So then of course we wanted to understand how things work on networks.",
                    "label": 0
                },
                {
                    "sent": "Here are the different networks that we considered, so everything from cliques to random graph.",
                    "label": 0
                },
                {
                    "sent": "So at least spanning the full range of network topology.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can see here the clustering coefficient and path length.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Varies considerably.",
                    "label": 0
                },
                {
                    "sent": "Now, what was surprising to us, and I think two people who maybe not the people who study public goods games, but certainly people who study networks is that all of these networks more or less generated the same contributions.",
                    "label": 0
                },
                {
                    "sent": "So this is surprising because all the other experiments that people have done, that the Michael Kearns experiments that I mentioned earlier the Exchange Coordination Games, any coordination games, graph coloring.",
                    "label": 0
                },
                {
                    "sent": "All of them generated very sort of significant and lodge network effects, and so it's interesting to us coming from a networks background to find something that doesn't seem to.",
                    "label": 1
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be affected by the structure of the network.",
                    "label": 0
                },
                {
                    "sent": "And our speculation here, and we really need to do more theoretical work to understand what the general conditions are for when network should matter and when they don't is that you know our intuition, at least is that is that when is it people cooperating games like this in a conditional way that they they want to be do the right thing, but they don't want to get exploited by their neighbors, and so they basically agree to cooperate as long as other people cooperate.",
                    "label": 0
                },
                {
                    "sent": "And the thought is.",
                    "label": 0
                },
                {
                    "sent": "Then when people are allowed to interact preferentially that that helps sustain cooperation.",
                    "label": 1
                },
                {
                    "sent": "If the people that you're cooperating with the cooperating with each other, and all of us can sort of collectively resist the temptation to defect, better than if we're connected randomly, the other thought is that cooperation should be contagious, that if that if I'm doing the right thing, I can raise the cooperate, the contributions of my neighbor, and then my neighbor can raise the contributions of his neighbor, and so on, and then we should expect to see these sort of cascades of cooperation throughout the network.",
                    "label": 0
                },
                {
                    "sent": "But in fact we don't see that we do see players cooperating conditionally, but there is this overall bias towards defection.",
                    "label": 1
                },
                {
                    "sent": "And I think you know the intuition is sort of like when you when people split the check at dinner, everybody's trying to pay their fair share.",
                    "label": 0
                },
                {
                    "sent": "But it's very rare that people pay more than their fair share, right there.",
                    "label": 0
                },
                {
                    "sent": "There's a sort of you're not trying to exploit your friends, but you're more concerned about not being exploited, and so everybody pays a little bit less than what they actually owe.",
                    "label": 0
                },
                {
                    "sent": "And then of course, you have to kind of renegotiate and.",
                    "label": 0
                },
                {
                    "sent": "And and Chip in a little bit more and what we're seeing here is our series of rounds that everyone is sort of trying to mimic the contributions of their neighbors, but they have a little biased towards under contributing.",
                    "label": 0
                },
                {
                    "sent": "And everybody does this, and this overall tendency drives everyone down to 0.",
                    "label": 0
                },
                {
                    "sent": "There's also no evidence of positive contagion, which is very surprising to us.",
                    "label": 1
                },
                {
                    "sent": "We really tried.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very hard to find that.",
                    "label": 0
                },
                {
                    "sent": "So finally you know what are the advantages of doing things this way?",
                    "label": 1
                },
                {
                    "sent": "I think you know.",
                    "label": 0
                },
                {
                    "sent": "Again, the point I'd like to emphasize is that over a period of a few months we ran 113 of these experiments with 24 players each.",
                    "label": 1
                },
                {
                    "sent": "You know the most we can really do is about 20 a week, but this is a little remarkable.",
                    "label": 0
                },
                {
                    "sent": "Ability to run experiments over and over again, and to really sort of speed up the hypothesis testing cycle, where we literally would sort of run a series of experiments, and then we would think, wow, you know why did that happen and then we would form a new hypothesis and then we could immediately go back to the lab and test that new hypothesis.",
                    "label": 1
                },
                {
                    "sent": "And I think that this sort of speed up you know, as opposed to having to go off and get another NSF grant and wait another year to run a new series of experiments is going to sort of allow us to profoundly change how we do it.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Paraments so just summing up where we come in all this time, while we're sort of chipping away at the problem, you know we're interested in networks were interested in how networks affect social behavior and collective outcomes, and we haven't really got there yet that we have done little bits and pieces.",
                    "label": 0
                },
                {
                    "sent": "We have one study of connectivity.",
                    "label": 0
                },
                {
                    "sent": "We have another study of influence.",
                    "label": 0
                },
                {
                    "sent": "We have another study of diffusion and finally we're starting to get to the point where we can sort of put them all together into a lab setting.",
                    "label": 0
                },
                {
                    "sent": "They were really only looking at relatively small network still.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "Looking forward, we're really hoping that we can sort of scale this up and something that we have some ambitions for.",
                    "label": 0
                },
                {
                    "sent": "At Yahoo Research to build very large scale virtual labs also to do field experiments where we are more sort of in the wild.",
                    "label": 1
                },
                {
                    "sent": "With much larger numbers of people, or we randomly assign them to see receive different kinds of treatments, and my colleague David Riley at Yahoo has been doing some really interesting work here.",
                    "label": 1
                },
                {
                    "sent": "Looking at the effects of brand advertising.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So where is this going?",
                    "label": 0
                },
                {
                    "sent": "Well, just to go back to the original slide, is any of this going to really help us to get a better handle on the big questions of social science?",
                    "label": 1
                },
                {
                    "sent": "And it's hard to say, you know.",
                    "label": 1
                },
                {
                    "sent": "I mean, the sorts of problems that I've talked about are a long way from the serious problems of the world, like systemic risk in financial markets and economic development, policy, and terrorism that you know, these are the problems that motivate social scientists.",
                    "label": 0
                },
                {
                    "sent": "And we're not there yet.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, it's hard not to believe that something profound is going to happen if we look back through history wherever there is being a technological revolution that has allowed that has made the previously invisible visible.",
                    "label": 0
                },
                {
                    "sent": "We've seen huge changes in science that have followed in the, you know, the telescope.",
                    "label": 0
                },
                {
                    "sent": "Sort of the obvious example there were.",
                    "label": 0
                },
                {
                    "sent": "Suddenly you can see the planets and the next thing you know, we have a revolution in celestial mechanics.",
                    "label": 0
                },
                {
                    "sent": "And then Newton comes along and we have a revolution in all of physics.",
                    "label": 0
                },
                {
                    "sent": "So it's a little grandiose to think the same thing could happen in social science, but I think it's plausible to think that something interesting is going to happen over the next generation an what's certainly true is that these problems that have historically been the province of social scientists and now also the province of computer scientists, and I think it's very exciting for someone like me.",
                    "label": 0
                },
                {
                    "sent": "Who is she mentioned as sort of meandered back and forth through these disciplines, overtime to to sort of finally get to a stage where.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can, we can help each other.",
                    "label": 0
                },
                {
                    "sent": "Well, thanks very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the wonderful talk about we're going to try to use this Twitter.",
                    "label": 0
                },
                {
                    "sent": "As we mentioned earlier, and hopefully the degree here is more than one over the conference.",
                    "label": 0
                },
                {
                    "sent": "So do we have there we go?",
                    "label": 0
                },
                {
                    "sent": "Alright you on the 1st?",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I guess these are the trees currently available.",
                    "label": 0
                },
                {
                    "sent": "How many tools do we have here?",
                    "label": 0
                },
                {
                    "sent": "I lost money.",
                    "label": 0
                },
                {
                    "sent": "So maybe everybody can now browse through and see what kind of questions are being asked there.",
                    "label": 0
                },
                {
                    "sent": "Do you have time for any questions?",
                    "label": 0
                },
                {
                    "sent": "Any question you want to choose to answer is why I can't see any questions.",
                    "label": 0
                },
                {
                    "sent": "At least there are no nasty remarks.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So you can also ask questions the old fashioned way.",
                    "label": 0
                },
                {
                    "sent": "If you would like.",
                    "label": 0
                },
                {
                    "sent": "Alright, holla.",
                    "label": 0
                },
                {
                    "sent": "You studied the.",
                    "label": 0
                },
                {
                    "sent": "The the structure of influence.",
                    "label": 0
                },
                {
                    "sent": "my Twitter did you only study positive influence?",
                    "label": 0
                },
                {
                    "sent": "Also negative influence and are going through the same.",
                    "label": 0
                },
                {
                    "sent": "So I guess we have a very limited view of influence on Twitter, which is really, you know, can you get something to diffuse right?",
                    "label": 0
                },
                {
                    "sent": "So there's no real.",
                    "label": 0
                },
                {
                    "sent": "Negative of that on Twitter, what would be more interesting?",
                    "label": 0
                },
                {
                    "sent": "It would be to connect something that happens on Twitter with some sort of action that takes place off of Twitter.",
                    "label": 0
                },
                {
                    "sent": "So for example, if you if you connect somebody to a news article or to a opinion piece that actually changes the way they behave about something, that would be far more interesting than what we were able to do.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately sort of.",
                    "label": 0
                },
                {
                    "sent": "Technologically we're not quite there yet, but that would be the objective.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So welcome back.",
                    "label": 0
                },
                {
                    "sent": "So only in the back they have a microphone there.",
                    "label": 0
                },
                {
                    "sent": "So many here.",
                    "label": 0
                },
                {
                    "sent": "OK. General question you just had.",
                    "label": 0
                },
                {
                    "sent": "Did you observe a different behavior?",
                    "label": 0
                },
                {
                    "sent": "Was also information in diffuse?",
                    "label": 0
                },
                {
                    "sent": "Was other positive nature as opposed to an information about the negative nature?",
                    "label": 0
                },
                {
                    "sent": "Well, we.",
                    "label": 0
                },
                {
                    "sent": "No, they they we form OK.",
                    "label": 0
                },
                {
                    "sent": "So what we did was we we we.",
                    "label": 0
                },
                {
                    "sent": "We took as I said, a sample of 1000 URLs and we put them up on Mechanical Turk and we got humans to classify them and one of the questions we ask them was you know how good does this make you feel?",
                    "label": 0
                },
                {
                    "sent": "So I guess that would be an indicator of positiveness.",
                    "label": 0
                },
                {
                    "sent": "And that actually had no predictive.",
                    "label": 0
                },
                {
                    "sent": "Power so.",
                    "label": 0
                },
                {
                    "sent": "So I think the answer is no, that at least we were not able to detect any effect of positiveness or interestingness on the on the on the model fit.",
                    "label": 0
                },
                {
                    "sent": "So that was surprising to us.",
                    "label": 0
                },
                {
                    "sent": "I would have.",
                    "label": 0
                },
                {
                    "sent": "I would have thought that that things that were sort of inspiring or you know engaging would tend to spread more.",
                    "label": 0
                },
                {
                    "sent": "But we were not able to show that.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "Look here, yeah.",
                    "label": 0
                },
                {
                    "sent": "So I was wondering whether you had any comments on whether people's behavior would change if they knew that result of the experiment is going to result in a real world policy change that affected society inside.",
                    "label": 0
                },
                {
                    "sent": "You know, like for example, you know.",
                    "label": 0
                },
                {
                    "sent": "Well, if people who were chosen to rate television shows knew that it affected the defunding of public television.",
                    "label": 0
                },
                {
                    "sent": "With that with that influence how they played the game.",
                    "label": 0
                },
                {
                    "sent": "It's a really good question.",
                    "label": 0
                },
                {
                    "sent": "Probably.",
                    "label": 0
                },
                {
                    "sent": "You know one thing that we actually, there's a paper that my colleague Winter was just reviewing for Kai where they they manipulated the framing of it was a task on Mechanical Turk.",
                    "label": 0
                },
                {
                    "sent": "The reason we thought it was interesting was that was exactly the same idea that we had had, and so we've got completely scooped.",
                    "label": 0
                },
                {
                    "sent": "But the idea is to to provide the same task.",
                    "label": 0
                },
                {
                    "sent": "But I'm but showed some people that this is this kind of task.",
                    "label": 0
                },
                {
                    "sent": "Could you know will help you know researchers from the Cancer Institute to solve, you know, to help cure cancer and the other framing is?",
                    "label": 0
                },
                {
                    "sent": "That it's will help you know pharmaceutical companies.",
                    "label": 0
                },
                {
                    "sent": "You know, increase their profits.",
                    "label": 0
                },
                {
                    "sent": "Fact they did, they did find a difference that people were more motivated and did a better job when they thought they would do this task was for altruistic ends, so I think they yes that there is.",
                    "label": 0
                },
                {
                    "sent": "You know that you could well let me say, I bet you could set up experiments that would show that effect when you go out into the into the wild into the real world.",
                    "label": 0
                },
                {
                    "sent": "And there's lots of things happening at the same time, and whether that one turns out to be more important than everything else that's going on, I think, is an open question.",
                    "label": 0
                },
                {
                    "sent": "But yeah, we're definitely interested in trying to understand that, so I think there is one question here on the Twitter space.",
                    "label": 0
                },
                {
                    "sent": "So this way everybody can see it.",
                    "label": 0
                },
                {
                    "sent": "Well, it's only because you are.",
                    "label": 0
                },
                {
                    "sent": "So if you can't read this as if Music Lab says that people are resistant to manipulations, then shall we not worry about social spams?",
                    "label": 0
                },
                {
                    "sent": "Well, I would say because you worry about social spams that we don't have to worry about them right?",
                    "label": 0
                },
                {
                    "sent": "But if that's the interesting thing about people is that they.",
                    "label": 0
                },
                {
                    "sent": "The last question was sort of a little bit like this as well.",
                    "label": 0
                },
                {
                    "sent": "Is that they actually don't like being understood in some sense, so it's not like studying atoms and electrons where you know they just keep doing behaving exactly the same way after you understand what they're doing.",
                    "label": 0
                },
                {
                    "sent": "There's always this sort of dialectic between scientists and their subjects or marketers, and and and audiences.",
                    "label": 0
                },
                {
                    "sent": "Where you sort of try to exploit or understand psychological patterns and then the patterns go away because people realize that you're taking advantage of them.",
                    "label": 0
                },
                {
                    "sent": "The other point I would say is that is that is that people were not completely resistant to these manipulations, that there were.",
                    "label": 0
                },
                {
                    "sent": "There were individual that the songs that were unfairly promoted actually did do better than they would have done had we not promoted them.",
                    "label": 0
                },
                {
                    "sent": "So so there really were quite significant affects.",
                    "label": 0
                },
                {
                    "sent": "It was just that at the aggregate level, it wasn't possible to lock people into this false world and that there were some sort of push back there.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        }
    }
}