{
    "id": "mh46kn4vhqwbvr3ry275cy2bn777bhk2",
    "title": "iSURF – Piacenza Knitwear Business Case",
    "info": {
        "author": [
            "Alessandro Canepa, Fratelli Piacenza S.p.A."
        ],
        "published": "Sept. 24, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Business->Small and Medium Enterprises (SMEs)"
        ]
    },
    "url": "http://videolectures.net/ice09_canepa_isurf/",
    "segmentation": [
        [
            "So thank you for the occasion to present the kitchens of need to our business case in the eyes of project.",
            "So first of all.",
            "A short presentation of their I surf.",
            "The acronym of the."
        ],
        [
            "Object is an interoperability service utility for collaborative supply chain planning across multiple domains, supported by rhetoric devices.",
            "So we have two main areas of the project which are strictly connected, one with the other.",
            "First of all, obviously there is a interoperability serving service utilities.",
            "Secondly, the support of RFID technology.",
            "The projector is led by May 2, which is the Middle East Turkish University of Ankara and other partners are Intel Ireland from North 3060, obviously, and kitchens are is the industrial and user."
        ],
        [
            "So we can start from the.",
            "Overview of the possible application of RF."
        ],
        [
            "The technology and of interoperability.",
            "As you can see, we have divided the possible application starting from the production of the network and especially of the finishing I underline the finishing the cause we have now a problem of tax survival in this part of the process, and unfortunately we can.",
            "We have not found the devices surviving, especially especially to shrinking so.",
            "Now, this part is still under a research and is not specifically the research of the tags object of the ICER.",
            "But in general, in production, as you can see, the application of RFID is is possible and is very interesting regarding the logistics.",
            "And also the integration with the sub suppliers.",
            "Then we have the application of RFID technology in the logistic services, which is not object of deicer for becausw.",
            "It regards the leaders of the market in this kind of services and it is object or Roger other product projects while in the case of distribution the retail and the sale to the consumer is again under the area of research.",
            "This support in these two areas, production and distribution by RFID technology, could provide information which are object of the interoperability services of the eyes of project, so we can and we take information.",
            "And as you can see there is a stick connection of RFID technology and interoperability."
        ],
        [
            "Here there is another way to see the supply chain, and these are the possible application of RFID."
        ],
        [
            "Technology, as you can see in our case the manufacturer and the wholesaler are the same company even if we use also outside manufacturers.",
            "While all sales, in other cases general buyers who provide to the retail.",
            "Obvious."
        ],
        [
            "Deformation coming from the ref ID technology can support the ice off bus and infrastructural services whose aim is to create the support for the interoperability between the old.",
            "Subjects are working in the in the supply chain.",
            "This is the case of the textile clothing one, which is quite unusual towards some other one, but it could provide, I think, a good testbed for this kind of technology."
        ],
        [
            "Now I show you.",
            "Summer basic issues regarding the supply chain and the CP Fr process.",
            "As you as you know, the textile worker into season, which are the summer in the winter and the winter one is usually the most important.",
            "Our sector is affected by a larger.",
            "Variability in terms of styles in terms of colors and it's not easily to forecast differently from some other ones such as automotive or aerospace.",
            "So we have some problems.",
            "So considering the short life cycle of the product and very variable dim, and as you can see and we can start from the winter and in this case the production follows.",
            "The order in some cases is a contemporary while the delivery start from example from June to December.",
            "So the first case of application of CPF are required in regards the collecting season, which is from January to March.",
            "In this case, a closer collaboration between producer and retailer could provide the necessary information.",
            "For the production, there is a second part of the project of the process, where it it would be very important to have an interoperability.",
            "Services are connecting retailers and manufacturers, which is the reorder season.",
            "As we have seen also, for example in the automotive, but for us it's a it's usual in the second part of the year we have two providers talk service to the customer which could be in shortage of production.",
            "The fact is that in our sector it's very hard to forecast precisely dim and so.",
            "If we would be provided in June, July of the information coming from the first sales of the winter season, we could produce the necessary goods to satisfy that demand.",
            "In the second part of the year, coming from September to December, one of the problems which our sector have in this moment is that first of all, the retailer do not want to have stock and they are weak on the point on the financial.",
            "Fast, so they they want the the supplier to have stock for them.",
            "Secondly that you must be very quick to satisfy the demand and you lose says if you don't precisely satisfy the demand in terms of color, style and so on.",
            "So our our supply chain is still really an efficient, especially in the information.",
            "Transfer.",
            "In the prod."
        ],
        [
            "After we performed benefit analysis regarding the ref.",
            "ID application which could which should support the pilot application which we are going to to implement.",
            "So benefit the benefit analysis starts from the tangible benefits regarding efficiency and efficacy.",
            "The first one are easily to measure, especially in the terms of cost reduction and volume increase.",
            "And the second one can be measured by indirect.",
            "Measurements such as do another increase in markup increase, but must be very important to recall also there not tangible once regarding the image and information improvement and customer satisfaction, which especially in the luxury or high price market which is the European one, are the key action essential keys of the strategy.",
            "So some outcomes.",
            "Yes.",
            "You are talking about low better fulfillment.",
            "What does it mean?",
            "It means that in some cases we have to fulfill some.",
            "Some low, for example, those ones are regarding the customs and the origin, so it's necessary to provide all the information regarding the product for the customs and RFID technology can provide taxability of the product, so this is only one of the cases, but in fact I didn't notice because it's quite technical and not so important."
        ],
        [
            "Because you invoked for murder.",
            "In our case, we produce all in Italy, so we are made in Italy and unfortunately we are affected by the load that in Italy in Europe we have no declaration of origin.",
            "This is a problem for Italian manufacturers.",
            "But we are requested, for example by the.",
            "United States Customs to provide the code which is a mid code saying not only that you have the manufacturer, but if you use a sub supplier to provide precisely the location of the supplier and we have to demonstrate that the production is in Italy.",
            "Becausw is one of the most favored countries, so the duties are lower in comparison with other countries.",
            "For example, if we would produce cashmere, cashmere, knitwear in China, we would be affected by.",
            "Of the very high duties, while for the Italian production it's only 4%.",
            "So a quick overview of the benefits and we can say that the first of all RFID technology application as a wide spectrum of impactor and we didn't reduce the analysis to the cost benefit one.",
            "But also we went on a wider one, considering the not tangible advantages.",
            "Obviously, the importance of the not tangible advantages is increasing from low price to luxury, which is the field where usually European companies work and.",
            "And so should be taken in the proper consideration.",
            "Anne."
        ],
        [
            "To support our pilot implementation, we perform the survey in the European market in collaboration with the European Association of Fashion Retailers.",
            "And we divided the market into the main four channels in the text, which are the boutiques and the multi brand and multi brand companies.",
            "The private label was the Mono brand and the Department store private label example are, for example, Sarah and H&M.",
            "While mono brands could be we turn then yeah, and so on.",
            "The difference is that the private label comes from the retail and our intake integrating with the production while in the second case they come from the production.",
            "Xenia is a typical case coming from the fabric, then to the clothing, and now they have their own shops.",
            "So as you can see.",
            "Regarding the interoperability, the result of the survey is that when the value chain is integrated in the same company, there is a medium.",
            "Transfer of information inside the supply chain in the Department store.",
            "The transfer is good only in the case of sellout information towards the production while in the multi brand retailers is very low to apps or absent.",
            "So in this case we could have a good.",
            "Information improvement coming from the application of RFID technology and interoperability systems."
        ],
        [
            "Here you can see from the colors the red 1 means that the best exploitation of the benefits and regarding the tangible ones.",
            "As you can see, these benefits are.",
            "Are widely widely exploited, especially in the private label and mono brand.",
            "Once, while there could be margin of exploitation and interest anyway for the multi brand ones.",
            "But as you can see the not tangible benefits are have been considered very very important in all channels coming from the private label and mono brand ones, because in this case the service and the support it with a.",
            "Is the key the key for the strategy, and so the survey supported these?",
            "This is evidence."
        ],
        [
            "Some conclusions.",
            "First of all, the formation exchanger an Inter ability between production retailer is low.",
            "Now when they are independent as we have seen and it can be subject to great improvements when, On the contrary it has been already.",
            "Already exploited in the case of Mono brand and private label chains.",
            "As it is."
        ],
        [
            "After the application we can see that.",
            "Logistics wanser, Evan.",
            "Extended impact.",
            "In order to add channels and even in retail and in the production.",
            "Also because they are not affected by the factor of A tag survival.",
            "Salvia service application benefits have their Agassi impact.",
            "Were non tangible aspects of sales are considered of greatest importance, meaning the luxury field which is one of the strongest in Europe and finally the security benefit are extended to all retail channels.",
            "But the global benefit is higher in the case of specialized chains also because they are global players in the market and they can use RFID or could use RFID technology.",
            "And information transfer also to control.",
            "For example, parallel markets."
        ],
        [
            "Is it got the impact the end exploitation?",
            "It must be considered that RFID technology application could have a direct impact improving the quality and a range of available information in our retail channels.",
            "This is the case supporting also the interoperability and this is the reason why the project consider every Friday as a support of interoperability.",
            "Secondly, as we have seen in general the specialized change second exploit RFID technology in all its application.",
            "Regarding logistics service and.",
            "And security."
        ],
        [
            "As regards to the production, we can say that as we have seen in the scheme, the application of RFID technology is convenient anyway, even in the case the tank survival rate is not high because it can anyway cover the.",
            "Logistics internal to the company and the sub supplier.",
            "Secondly that we can say that also.",
            "Retail can have an improvement of information coming from production as we have seen in this light before, and in some cases it would be necessary to support the implementation when we work with sub supplier like in our case with the with the financial support to the sub supplier to apply this technology to them."
        ],
        [
            "Son open issues are first of all the privacy.",
            "Once considering that there is a refusal of consumer to accept the tags leaving after the sale, this is a great problem because tax could be very important considering that.",
            "If they could be used to control, for example, the parallel markets and so future researcher is required to find the solution, for example to have tags which could be read only by some.",
            "Buy some subject.",
            "For example the producer and not by everybody to save.",
            "Also the legitimate consumer privacy issues.",
            "Secondly, that the Tiger research for production application should go on to find devices which we survive to the production.",
            "Finally, a very short.",
            "A reference to the cost benefit analysis."
        ],
        [
            "Which is a reduction and we can also say that there for the technology in the in the application costs are always measure measurable.",
            "Why benefits can be not tangible and so hard to measure as we have seen.",
            "But in this case it's a better and in some cases it's necessary anyway to invest, considering that the service is very important.",
            "Secondly, costs are mainly fixed of infrastructure supporting different application, while benefits are variable.",
            "And directly linked to each application.",
            "So also in this case it's very hard to make sharp cost benefit analysis anyway in the."
        ],
        [
            "And we can say that.",
            "We can conclude saying that the cost benefit analysis.",
            "From the cost benefit analysis comes that anyway it justified the application of RFID technology.",
            "Also considering the support of the interoperability services, which is not a direct benefit but indirect.",
            "Secondly, as we have seen the evaluation of intangible benefit is are to translate into a measurable forecast about necessary.",
            "3rd, finally, in the answer pylot we are covering even the retailer and the production application and especially the logistics and cervati and security areas which are now available also as application.",
            "We will need also to support information transfer quickly to the interoperability service.",
            "So we are focusing on this part of the project.",
            "And with this I ended the overview."
        ],
        [
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you for the occasion to present the kitchens of need to our business case in the eyes of project.",
                    "label": 0
                },
                {
                    "sent": "So first of all.",
                    "label": 0
                },
                {
                    "sent": "A short presentation of their I surf.",
                    "label": 0
                },
                {
                    "sent": "The acronym of the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Object is an interoperability service utility for collaborative supply chain planning across multiple domains, supported by rhetoric devices.",
                    "label": 1
                },
                {
                    "sent": "So we have two main areas of the project which are strictly connected, one with the other.",
                    "label": 0
                },
                {
                    "sent": "First of all, obviously there is a interoperability serving service utilities.",
                    "label": 0
                },
                {
                    "sent": "Secondly, the support of RFID technology.",
                    "label": 0
                },
                {
                    "sent": "The projector is led by May 2, which is the Middle East Turkish University of Ankara and other partners are Intel Ireland from North 3060, obviously, and kitchens are is the industrial and user.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we can start from the.",
                    "label": 0
                },
                {
                    "sent": "Overview of the possible application of RF.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The technology and of interoperability.",
                    "label": 0
                },
                {
                    "sent": "As you can see, we have divided the possible application starting from the production of the network and especially of the finishing I underline the finishing the cause we have now a problem of tax survival in this part of the process, and unfortunately we can.",
                    "label": 0
                },
                {
                    "sent": "We have not found the devices surviving, especially especially to shrinking so.",
                    "label": 0
                },
                {
                    "sent": "Now, this part is still under a research and is not specifically the research of the tags object of the ICER.",
                    "label": 0
                },
                {
                    "sent": "But in general, in production, as you can see, the application of RFID is is possible and is very interesting regarding the logistics.",
                    "label": 1
                },
                {
                    "sent": "And also the integration with the sub suppliers.",
                    "label": 1
                },
                {
                    "sent": "Then we have the application of RFID technology in the logistic services, which is not object of deicer for becausw.",
                    "label": 0
                },
                {
                    "sent": "It regards the leaders of the market in this kind of services and it is object or Roger other product projects while in the case of distribution the retail and the sale to the consumer is again under the area of research.",
                    "label": 0
                },
                {
                    "sent": "This support in these two areas, production and distribution by RFID technology, could provide information which are object of the interoperability services of the eyes of project, so we can and we take information.",
                    "label": 0
                },
                {
                    "sent": "And as you can see there is a stick connection of RFID technology and interoperability.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here there is another way to see the supply chain, and these are the possible application of RFID.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology, as you can see in our case the manufacturer and the wholesaler are the same company even if we use also outside manufacturers.",
                    "label": 0
                },
                {
                    "sent": "While all sales, in other cases general buyers who provide to the retail.",
                    "label": 0
                },
                {
                    "sent": "Obvious.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Deformation coming from the ref ID technology can support the ice off bus and infrastructural services whose aim is to create the support for the interoperability between the old.",
                    "label": 1
                },
                {
                    "sent": "Subjects are working in the in the supply chain.",
                    "label": 0
                },
                {
                    "sent": "This is the case of the textile clothing one, which is quite unusual towards some other one, but it could provide, I think, a good testbed for this kind of technology.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I show you.",
                    "label": 0
                },
                {
                    "sent": "Summer basic issues regarding the supply chain and the CP Fr process.",
                    "label": 0
                },
                {
                    "sent": "As you as you know, the textile worker into season, which are the summer in the winter and the winter one is usually the most important.",
                    "label": 0
                },
                {
                    "sent": "Our sector is affected by a larger.",
                    "label": 0
                },
                {
                    "sent": "Variability in terms of styles in terms of colors and it's not easily to forecast differently from some other ones such as automotive or aerospace.",
                    "label": 0
                },
                {
                    "sent": "So we have some problems.",
                    "label": 0
                },
                {
                    "sent": "So considering the short life cycle of the product and very variable dim, and as you can see and we can start from the winter and in this case the production follows.",
                    "label": 0
                },
                {
                    "sent": "The order in some cases is a contemporary while the delivery start from example from June to December.",
                    "label": 0
                },
                {
                    "sent": "So the first case of application of CPF are required in regards the collecting season, which is from January to March.",
                    "label": 0
                },
                {
                    "sent": "In this case, a closer collaboration between producer and retailer could provide the necessary information.",
                    "label": 0
                },
                {
                    "sent": "For the production, there is a second part of the project of the process, where it it would be very important to have an interoperability.",
                    "label": 0
                },
                {
                    "sent": "Services are connecting retailers and manufacturers, which is the reorder season.",
                    "label": 0
                },
                {
                    "sent": "As we have seen also, for example in the automotive, but for us it's a it's usual in the second part of the year we have two providers talk service to the customer which could be in shortage of production.",
                    "label": 0
                },
                {
                    "sent": "The fact is that in our sector it's very hard to forecast precisely dim and so.",
                    "label": 0
                },
                {
                    "sent": "If we would be provided in June, July of the information coming from the first sales of the winter season, we could produce the necessary goods to satisfy that demand.",
                    "label": 0
                },
                {
                    "sent": "In the second part of the year, coming from September to December, one of the problems which our sector have in this moment is that first of all, the retailer do not want to have stock and they are weak on the point on the financial.",
                    "label": 0
                },
                {
                    "sent": "Fast, so they they want the the supplier to have stock for them.",
                    "label": 0
                },
                {
                    "sent": "Secondly that you must be very quick to satisfy the demand and you lose says if you don't precisely satisfy the demand in terms of color, style and so on.",
                    "label": 0
                },
                {
                    "sent": "So our our supply chain is still really an efficient, especially in the information.",
                    "label": 0
                },
                {
                    "sent": "Transfer.",
                    "label": 0
                },
                {
                    "sent": "In the prod.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After we performed benefit analysis regarding the ref.",
                    "label": 0
                },
                {
                    "sent": "ID application which could which should support the pilot application which we are going to to implement.",
                    "label": 0
                },
                {
                    "sent": "So benefit the benefit analysis starts from the tangible benefits regarding efficiency and efficacy.",
                    "label": 1
                },
                {
                    "sent": "The first one are easily to measure, especially in the terms of cost reduction and volume increase.",
                    "label": 1
                },
                {
                    "sent": "And the second one can be measured by indirect.",
                    "label": 0
                },
                {
                    "sent": "Measurements such as do another increase in markup increase, but must be very important to recall also there not tangible once regarding the image and information improvement and customer satisfaction, which especially in the luxury or high price market which is the European one, are the key action essential keys of the strategy.",
                    "label": 0
                },
                {
                    "sent": "So some outcomes.",
                    "label": 1
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "You are talking about low better fulfillment.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "It means that in some cases we have to fulfill some.",
                    "label": 0
                },
                {
                    "sent": "Some low, for example, those ones are regarding the customs and the origin, so it's necessary to provide all the information regarding the product for the customs and RFID technology can provide taxability of the product, so this is only one of the cases, but in fact I didn't notice because it's quite technical and not so important.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Because you invoked for murder.",
                    "label": 0
                },
                {
                    "sent": "In our case, we produce all in Italy, so we are made in Italy and unfortunately we are affected by the load that in Italy in Europe we have no declaration of origin.",
                    "label": 0
                },
                {
                    "sent": "This is a problem for Italian manufacturers.",
                    "label": 1
                },
                {
                    "sent": "But we are requested, for example by the.",
                    "label": 0
                },
                {
                    "sent": "United States Customs to provide the code which is a mid code saying not only that you have the manufacturer, but if you use a sub supplier to provide precisely the location of the supplier and we have to demonstrate that the production is in Italy.",
                    "label": 0
                },
                {
                    "sent": "Becausw is one of the most favored countries, so the duties are lower in comparison with other countries.",
                    "label": 0
                },
                {
                    "sent": "For example, if we would produce cashmere, cashmere, knitwear in China, we would be affected by.",
                    "label": 0
                },
                {
                    "sent": "Of the very high duties, while for the Italian production it's only 4%.",
                    "label": 0
                },
                {
                    "sent": "So a quick overview of the benefits and we can say that the first of all RFID technology application as a wide spectrum of impactor and we didn't reduce the analysis to the cost benefit one.",
                    "label": 1
                },
                {
                    "sent": "But also we went on a wider one, considering the not tangible advantages.",
                    "label": 0
                },
                {
                    "sent": "Obviously, the importance of the not tangible advantages is increasing from low price to luxury, which is the field where usually European companies work and.",
                    "label": 1
                },
                {
                    "sent": "And so should be taken in the proper consideration.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To support our pilot implementation, we perform the survey in the European market in collaboration with the European Association of Fashion Retailers.",
                    "label": 0
                },
                {
                    "sent": "And we divided the market into the main four channels in the text, which are the boutiques and the multi brand and multi brand companies.",
                    "label": 0
                },
                {
                    "sent": "The private label was the Mono brand and the Department store private label example are, for example, Sarah and H&M.",
                    "label": 0
                },
                {
                    "sent": "While mono brands could be we turn then yeah, and so on.",
                    "label": 0
                },
                {
                    "sent": "The difference is that the private label comes from the retail and our intake integrating with the production while in the second case they come from the production.",
                    "label": 1
                },
                {
                    "sent": "Xenia is a typical case coming from the fabric, then to the clothing, and now they have their own shops.",
                    "label": 0
                },
                {
                    "sent": "So as you can see.",
                    "label": 0
                },
                {
                    "sent": "Regarding the interoperability, the result of the survey is that when the value chain is integrated in the same company, there is a medium.",
                    "label": 0
                },
                {
                    "sent": "Transfer of information inside the supply chain in the Department store.",
                    "label": 0
                },
                {
                    "sent": "The transfer is good only in the case of sellout information towards the production while in the multi brand retailers is very low to apps or absent.",
                    "label": 0
                },
                {
                    "sent": "So in this case we could have a good.",
                    "label": 0
                },
                {
                    "sent": "Information improvement coming from the application of RFID technology and interoperability systems.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here you can see from the colors the red 1 means that the best exploitation of the benefits and regarding the tangible ones.",
                    "label": 0
                },
                {
                    "sent": "As you can see, these benefits are.",
                    "label": 0
                },
                {
                    "sent": "Are widely widely exploited, especially in the private label and mono brand.",
                    "label": 0
                },
                {
                    "sent": "Once, while there could be margin of exploitation and interest anyway for the multi brand ones.",
                    "label": 0
                },
                {
                    "sent": "But as you can see the not tangible benefits are have been considered very very important in all channels coming from the private label and mono brand ones, because in this case the service and the support it with a.",
                    "label": 0
                },
                {
                    "sent": "Is the key the key for the strategy, and so the survey supported these?",
                    "label": 0
                },
                {
                    "sent": "This is evidence.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some conclusions.",
                    "label": 0
                },
                {
                    "sent": "First of all, the formation exchanger an Inter ability between production retailer is low.",
                    "label": 0
                },
                {
                    "sent": "Now when they are independent as we have seen and it can be subject to great improvements when, On the contrary it has been already.",
                    "label": 1
                },
                {
                    "sent": "Already exploited in the case of Mono brand and private label chains.",
                    "label": 0
                },
                {
                    "sent": "As it is.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "After the application we can see that.",
                    "label": 0
                },
                {
                    "sent": "Logistics wanser, Evan.",
                    "label": 0
                },
                {
                    "sent": "Extended impact.",
                    "label": 0
                },
                {
                    "sent": "In order to add channels and even in retail and in the production.",
                    "label": 1
                },
                {
                    "sent": "Also because they are not affected by the factor of A tag survival.",
                    "label": 0
                },
                {
                    "sent": "Salvia service application benefits have their Agassi impact.",
                    "label": 1
                },
                {
                    "sent": "Were non tangible aspects of sales are considered of greatest importance, meaning the luxury field which is one of the strongest in Europe and finally the security benefit are extended to all retail channels.",
                    "label": 1
                },
                {
                    "sent": "But the global benefit is higher in the case of specialized chains also because they are global players in the market and they can use RFID or could use RFID technology.",
                    "label": 0
                },
                {
                    "sent": "And information transfer also to control.",
                    "label": 0
                },
                {
                    "sent": "For example, parallel markets.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is it got the impact the end exploitation?",
                    "label": 1
                },
                {
                    "sent": "It must be considered that RFID technology application could have a direct impact improving the quality and a range of available information in our retail channels.",
                    "label": 1
                },
                {
                    "sent": "This is the case supporting also the interoperability and this is the reason why the project consider every Friday as a support of interoperability.",
                    "label": 1
                },
                {
                    "sent": "Secondly, as we have seen in general the specialized change second exploit RFID technology in all its application.",
                    "label": 0
                },
                {
                    "sent": "Regarding logistics service and.",
                    "label": 0
                },
                {
                    "sent": "And security.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As regards to the production, we can say that as we have seen in the scheme, the application of RFID technology is convenient anyway, even in the case the tank survival rate is not high because it can anyway cover the.",
                    "label": 1
                },
                {
                    "sent": "Logistics internal to the company and the sub supplier.",
                    "label": 0
                },
                {
                    "sent": "Secondly that we can say that also.",
                    "label": 1
                },
                {
                    "sent": "Retail can have an improvement of information coming from production as we have seen in this light before, and in some cases it would be necessary to support the implementation when we work with sub supplier like in our case with the with the financial support to the sub supplier to apply this technology to them.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Son open issues are first of all the privacy.",
                    "label": 1
                },
                {
                    "sent": "Once considering that there is a refusal of consumer to accept the tags leaving after the sale, this is a great problem because tax could be very important considering that.",
                    "label": 1
                },
                {
                    "sent": "If they could be used to control, for example, the parallel markets and so future researcher is required to find the solution, for example to have tags which could be read only by some.",
                    "label": 0
                },
                {
                    "sent": "Buy some subject.",
                    "label": 0
                },
                {
                    "sent": "For example the producer and not by everybody to save.",
                    "label": 1
                },
                {
                    "sent": "Also the legitimate consumer privacy issues.",
                    "label": 0
                },
                {
                    "sent": "Secondly, that the Tiger research for production application should go on to find devices which we survive to the production.",
                    "label": 0
                },
                {
                    "sent": "Finally, a very short.",
                    "label": 0
                },
                {
                    "sent": "A reference to the cost benefit analysis.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is a reduction and we can also say that there for the technology in the in the application costs are always measure measurable.",
                    "label": 0
                },
                {
                    "sent": "Why benefits can be not tangible and so hard to measure as we have seen.",
                    "label": 1
                },
                {
                    "sent": "But in this case it's a better and in some cases it's necessary anyway to invest, considering that the service is very important.",
                    "label": 0
                },
                {
                    "sent": "Secondly, costs are mainly fixed of infrastructure supporting different application, while benefits are variable.",
                    "label": 1
                },
                {
                    "sent": "And directly linked to each application.",
                    "label": 0
                },
                {
                    "sent": "So also in this case it's very hard to make sharp cost benefit analysis anyway in the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we can say that.",
                    "label": 0
                },
                {
                    "sent": "We can conclude saying that the cost benefit analysis.",
                    "label": 0
                },
                {
                    "sent": "From the cost benefit analysis comes that anyway it justified the application of RFID technology.",
                    "label": 0
                },
                {
                    "sent": "Also considering the support of the interoperability services, which is not a direct benefit but indirect.",
                    "label": 1
                },
                {
                    "sent": "Secondly, as we have seen the evaluation of intangible benefit is are to translate into a measurable forecast about necessary.",
                    "label": 1
                },
                {
                    "sent": "3rd, finally, in the answer pylot we are covering even the retailer and the production application and especially the logistics and cervati and security areas which are now available also as application.",
                    "label": 1
                },
                {
                    "sent": "We will need also to support information transfer quickly to the interoperability service.",
                    "label": 0
                },
                {
                    "sent": "So we are focusing on this part of the project.",
                    "label": 0
                },
                {
                    "sent": "And with this I ended the overview.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}