{
    "id": "mhohzulo7qdselhwfj6ecgjcpc5bveic",
    "title": "Dual Structured Light 3D using a 1D Sensor",
    "info": {
        "author": [
            "Mohit Gupta, Department of Computer Sciences, University of Wisconsin-Madison"
        ],
        "published": "Oct. 24, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Computer Vision"
        ]
    },
    "url": "http://videolectures.net/eccv2016_gupta_1d_sensor/",
    "segmentation": [
        [
            "Good morning, my name is Mohit Gupta.",
            "I'm from the University of Wisconsin, Madison and I'm going to talk about how to measure 3D shape of a scene using only a 1D sensor.",
            "Now we're going to build upon this technique called structured."
        ],
        [
            "Light.",
            "Here's a typical structured light system.",
            "It consists of a camera and a projector.",
            "Now the projector projects in."
        ],
        [
            "Moon pattern on the scene and the camera captures an image.",
            "Now, because the pattern is known, we can find correspondences between camera pixel between between the camera pixel and."
        ],
        [
            "And the projector pixel.",
            "And once we have this correspondence, we can triangulate.",
            "We can triangulate the corresponding race and find the 3D locations of scene points.",
            "Now structure light is.",
            "Structure light is one of the old."
        ],
        [
            "List method income techniques in computer vision and it forms the basis of a large class of commercial 3D cameras."
        ],
        [
            "We all know the Microsoft Kinect.",
            "It's a structured like device.",
            "Many laser scanners are also based on structured light.",
            "Now these 3D cameras or RGB D cameras as they are known.",
            "Because of their low cost and small size, they have really facilitated many new research areas and now they have the."
        ],
        [
            "Initial to revolutionize many different applications, so think about."
        ],
        [
            "Think about augmented reality.",
            "Think about self driving cars, robotic surgery, industrial robotics.",
            "There's a lot of potential here.",
            "But so far these are 3D cameras, and in fact computer vision methods in general.",
            "They have largely been limited to using visible light.",
            "Now."
        ],
        [
            "No, that visible light.",
            "It forms only a small portion of the large electromagnetic spectrum, right?",
            "There's a there's a lot of other wavelengths like infrared or ultraviolet, so the natural question."
        ],
        [
            "Arises can be now develop 3D cameras and again vision techniques in general which are outside the visible spectrum right?",
            "Which which are, let's say in infrared or Altra Violet regimes.",
            "Now why would you want to do that?"
        ],
        [
            "So these unconventional wavelengths, for example shortwave, infrared, or swirl, they can really allow imaging in extreme scenarios.",
            "For example, these are two images captured by conventional visible camera.",
            "There's a lot of smoke.",
            "There's a lot of fog, and this this fog and smoke really would make it impossible for conventional vision vision vision algorithm to extract any meaningful information.",
            "Now this."
        ],
        [
            "Tim scenes.",
            "If captured in sword wavelengths look like this, so there's a significant improvement, right?",
            "So then again, the natural question is if the advantage is so obvious, why don't we use these super cameras more often?"
        ],
        [
            "Now here's a schematic of a here's a schematic of our conventional visible CMOS camera.",
            "Now it uses Silicon as the light sensitive material.",
            "Now Silicon is extremely cheap so that each pixel here it almost has a negligible cost.",
            "Now, unfortunately, Silicon is not sensitive to swirl wave links."
        ],
        [
            "For these wavelengths we need a different kind of material, which is called Indium gallium arsenide or in gas.",
            "Now, in gas is extremely expensive, much more expensive than Silicon.",
            "So SWIR sensor pixel costs about five orders of magnitude more than a visible light visible sensor pixel.",
            "So just to give you an idea, one mega."
        ],
        [
            "Still to this work, camera would cost about $100,000.",
            "Imagine putting one of these cameras on a self driving car.",
            "The sensor would be four times as expensive as the car itself, right?",
            "So not very feasible.",
            "Now, Fortunately."
        ],
        [
            "A1D Sword camera is significantly cheaper.",
            "Now this 1D camera has has has a very small number of pixels only about 1000 or so, and all these pixels are arranged in a single line or arrow, hence the name 1D cameras or line cameras.",
            "So the next question that we asked was can we?"
        ],
        [
            "Build structured light.",
            "3D imaging systems which can measure the 3D shape of a scene using these 1D sensors.",
            "Right now to answer this question, let's first try to understand the structured light system in a bit more detail."
        ],
        [
            "So here is a typical structured light system consists of a projector and a camera.",
            "In the simplest form, the projector."
        ],
        [
            "Would project a single line or a single column of pixels.",
            "The."
        ],
        [
            "Should create a light sheet.",
            "Which when."
        ],
        [
            "Intersect which, when intersecting with the scene, creates 1D stripe.",
            "It's a 1D light stripe.",
            "Now this stripe is nothing but just the intersection of the scene with this light sheet.",
            "Now the camera captures the image of this stripe.",
            "Now consider a camera pixel on the."
        ],
        [
            "Stripe image.",
            "We can shoot back a camera Ray which passes through this pixel.",
            "Right now we assume that the projector is known, the projector and the camera are calibrated so we know the equations of this light sheet and the camera Ray, which we can then intersect at the 3D location of this get the 3D location.",
            "So you get the 3D location of the scene point here.",
            "Right now this process is called triangulation, much like we do in GPS, right?",
            "Now this will give us the shape of a single stripe.",
            "Now if you want to get the shape of the entire scene, we're going to scan this, scan this line over the entire image plane.",
            "So we're going to project a seed."
        ],
        [
            "Ease of images.",
            "Something like this, which we which will lead to the light sheet being scanned over the scene.",
            "Now each camera pixel captures a sequence of light intensities.",
            "Overtime.",
            "Now whenever the light sheet passes over this pixel, we get an intensity peak and."
        ],
        [
            "Looking by determining the location of this peak overtime, we can find the corresponding corresponding corresponding projector column and once you know that we can triangulate.",
            "Now this method is called light striping and this forms the basis of most laser scanners.",
            "So if you wanted to know how laser scanners work, this is how it is.",
            "Now, this is conceptually a simple process, but unfortunately it's very slow because you really have to scan over the scene one line stripe at a time.",
            "A faster alternative is to use binary."
        ],
        [
            "Is to use binary coding where you project a sequence of binary patterns.",
            "Now each camera pixel at the bottom right observe the binary code overtime, which we can then decode to find the projector correspondence.",
            "Now this is significantly faster.",
            "It requires this method requires only a logarithmic number of images as opposed to linear with line scanning.",
            "So just to give you an idea, if the line striping approach requires 1000 images, the binary binary approach will require only about 10 images or so.",
            "So significantly faster.",
            "Now, as I said before."
        ],
        [
            "Structured light is a very old technique and there are many different kinds of patterns.",
            "But the important thing here is that a lot of these patterns have translational symmetry.",
            "Meaning.",
            "In each of these patterns, all the pixels within us, all the pixels within a vertical column have the same value.",
            "Right?",
            "Now, given that.",
            "It really means that although these patterns are represented as 2D images, they really are just."
        ],
        [
            "1D patterns which are stretched in the vertical direction right?",
            "And we can represent each of these two D patterns as just a one.",
            "Decode something like this here.",
            "Night.",
            "So given this, we can now represent our."
        ],
        [
            "Projector as having only a 1D set of pixels or a 1D image plane which is displaying this one decode.",
            "So for example, if we want to, if you want to project a single line a single column, we can do that by illuminating a single pixel on this 1D image plane now.",
            "Now we still need a way to spread out this light in the vertical direction.",
            "We're going to do that by using a cylinder."
        ],
        [
            "Length.",
            "Now a cylindrical lens is interesting."
        ],
        [
            "If you shine a light beam on a cylindrical lens here it fans it out or spreads it out along One Direction, right?",
            "So now using this cylindrical lens and the Wendy and Wendy and Wendy set of pixels, we can now create a light."
        ],
        [
            "Sheet as before, right?",
            "Once we have the light sheet again we can do triangulation as before, right?",
            "So this is an important point, so I'm going to repeat.",
            "For patterns with translational symmetry, we can model the projector as having only a 1D image plane or a 1D set of pixels.",
            "Now the 2nd."
        ],
        [
            "Observation that the second observation that we make is that the."
        ],
        [
            "Projector and the camera are really just dual devices of each other, meaning they have the same geometric mapping from the 3D World to the 2D image plane.",
            "The only difference is that the projector, projector projects images, but the camera captures images.",
            "Otherwise they're really the same.",
            "You know, we can really think of the projector as an inverse camera.",
            "So."
        ],
        [
            "Given this duality, we can flip the locations of the projector and camera.",
            "So now we have A2 projector with a 2D image plane, but the camera with only a 1D set of pixels.",
            "Right now this is an interesting design.",
            "Now here each camera pixel will collect light not from a single scene point, but from a collection of a 1D collection of scene points here, right?",
            "All these all these points here lie on this plane, which we call the camera sheet right.",
            "So this is a bit unusual, so let's before going further, let's develop a bit of an intuition for this.",
            "Here is the camera with a conventional lens."
        ],
        [
            "Instant camera, where each camera pixel collects light from a single scene point."
        ],
        [
            "No, because of that the image is completely focused, it's sharp.",
            "Now let's replace this lens."
        ],
        [
            "With conventional lens with cylindrical lens so that now each camera pixel collects light from A1D set of points along this line."
        ],
        [
            "Now it's as if this image or this scene is getting integrated along the vertical direction, right?",
            "So can you guys guess what the image would look like?",
            "Just take a few seconds to think about it.",
            "No, because we are integrating integrating this image along the vertical direction.",
            "The image will be completely blurred vertically but will retain high frequencies along the vertical direction along the horizontal direction."
        ],
        [
            "So I'm going to direction.",
            "So now we.",
            "Along the horizontal direction.",
            "So now we get back to a structured light system.",
            "We have a camera with Wendy Sensor.",
            "We now have this light sheet now because we know that we assume that the camera and the projector calibrated so we can find the intersection between the camera sheet and the projector to find the 3D location of this scene, point right.",
            "If you want to find the low."
        ],
        [
            "Addition of another scene point, we illuminate another projector pixel.",
            "Tescan"
        ],
        [
            "Intersting we repeat the process for every projector pixel repeat every projector pixel, indicate the 3D shape of the entire scene.",
            "Now this is our main idea.",
            "This is the main contribution we have shown that by exploiting the symmetry of the Wendy symmetry of the patterns and the duality of projector and camera, we can measure the 3D shape of a scene using only A1 using only a 1D sensor.",
            "Now this is a slope."
        ],
        [
            "Just so as before, we can do this faster as well.",
            "Instead of scanning the scene one point at a time, we can eliminate one, illuminate the entire projector row.",
            "We measure one, decide."
        ],
        [
            "Measurements we put we put the measurements here.",
            "Do this for another."
        ],
        [
            "Drew and I."
        ],
        [
            "Another set of capture data.",
            "We repeat this for all projector rose and."
        ],
        [
            "Collect all the captured data into a single composite 2D image.",
            "Now this is as if the scene has been captured using a 2D camera which is 2D projector pattern.",
            "Now we can do."
        ],
        [
            "This for a sequence of patterns.",
            "This capture data."
        ],
        [
            "Now for each pixel location here."
        ],
        [
            "Each pixel location."
        ],
        [
            "We can find the camera."
        ],
        [
            "Equation we can."
        ],
        [
            "And the corresponding projector row and we."
        ],
        [
            "Intersect."
        ],
        [
            "Want to show some?"
        ],
        [
            "Let's quickly.",
            "This is a hardware prototype.",
            "We have.",
            "The line sensor is cylindrical lens.",
            "We have projector."
        ],
        [
            "This is the chicken scene for which showed the raw data.",
            "This is the 3D reconstructions."
        ],
        [
            "This is another scene with a bunch of objects.",
            "Now this is still preliminary.",
            "We can see a bit of artifacts.",
            "The system is not optimized yet, but optimizing the system is really the next step."
        ],
        [
            "There's another scene with a couple of balls.",
            "Now these results are still for the visible.",
            "For visible sensor the main motivation was to do this with the sword sensor, so here."
        ],
        [
            "The 1st result of 3D scanning using a source sensor.",
            "Now their quality is not as good as before, but that's to be expected because this world sensors are still a work in progress, they're not very sensitive, but we hope that that's going to improve in future in future time to come.",
            "But we just want to emphasize that this is the first example of a high resolution 3D shape captured in sword wavelengths."
        ],
        [
            "So, just to summarize, we have developed a new technique called dual structured Light 3D which can measure 3D shape using 1D cameras and it's still early days, but we believe."
        ],
        [
            "That this can lead to a new class of extreme 3D cameras which can measure 3D shape in extreme settings like dense fog and smoke using square wave links or also measure 3D shape at extremely high speeds using dynamic vision sensors or the event cameras talked about couple of talks ago, there's a lot of possibilities.",
            "We're quite excited about that.",
            "Thank you very much for listening.",
            "I will be happy to take any questions.",
            "Thank you.",
            "Thank you speaker."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning, my name is Mohit Gupta.",
                    "label": 0
                },
                {
                    "sent": "I'm from the University of Wisconsin, Madison and I'm going to talk about how to measure 3D shape of a scene using only a 1D sensor.",
                    "label": 1
                },
                {
                    "sent": "Now we're going to build upon this technique called structured.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Light.",
                    "label": 0
                },
                {
                    "sent": "Here's a typical structured light system.",
                    "label": 1
                },
                {
                    "sent": "It consists of a camera and a projector.",
                    "label": 0
                },
                {
                    "sent": "Now the projector projects in.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Moon pattern on the scene and the camera captures an image.",
                    "label": 0
                },
                {
                    "sent": "Now, because the pattern is known, we can find correspondences between camera pixel between between the camera pixel and.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the projector pixel.",
                    "label": 0
                },
                {
                    "sent": "And once we have this correspondence, we can triangulate.",
                    "label": 0
                },
                {
                    "sent": "We can triangulate the corresponding race and find the 3D locations of scene points.",
                    "label": 0
                },
                {
                    "sent": "Now structure light is.",
                    "label": 0
                },
                {
                    "sent": "Structure light is one of the old.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "List method income techniques in computer vision and it forms the basis of a large class of commercial 3D cameras.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We all know the Microsoft Kinect.",
                    "label": 1
                },
                {
                    "sent": "It's a structured like device.",
                    "label": 0
                },
                {
                    "sent": "Many laser scanners are also based on structured light.",
                    "label": 0
                },
                {
                    "sent": "Now these 3D cameras or RGB D cameras as they are known.",
                    "label": 0
                },
                {
                    "sent": "Because of their low cost and small size, they have really facilitated many new research areas and now they have the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Initial to revolutionize many different applications, so think about.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Think about augmented reality.",
                    "label": 0
                },
                {
                    "sent": "Think about self driving cars, robotic surgery, industrial robotics.",
                    "label": 1
                },
                {
                    "sent": "There's a lot of potential here.",
                    "label": 0
                },
                {
                    "sent": "But so far these are 3D cameras, and in fact computer vision methods in general.",
                    "label": 0
                },
                {
                    "sent": "They have largely been limited to using visible light.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, that visible light.",
                    "label": 0
                },
                {
                    "sent": "It forms only a small portion of the large electromagnetic spectrum, right?",
                    "label": 0
                },
                {
                    "sent": "There's a there's a lot of other wavelengths like infrared or ultraviolet, so the natural question.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Arises can be now develop 3D cameras and again vision techniques in general which are outside the visible spectrum right?",
                    "label": 1
                },
                {
                    "sent": "Which which are, let's say in infrared or Altra Violet regimes.",
                    "label": 0
                },
                {
                    "sent": "Now why would you want to do that?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these unconventional wavelengths, for example shortwave, infrared, or swirl, they can really allow imaging in extreme scenarios.",
                    "label": 1
                },
                {
                    "sent": "For example, these are two images captured by conventional visible camera.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of smoke.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of fog, and this this fog and smoke really would make it impossible for conventional vision vision vision algorithm to extract any meaningful information.",
                    "label": 0
                },
                {
                    "sent": "Now this.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tim scenes.",
                    "label": 0
                },
                {
                    "sent": "If captured in sword wavelengths look like this, so there's a significant improvement, right?",
                    "label": 0
                },
                {
                    "sent": "So then again, the natural question is if the advantage is so obvious, why don't we use these super cameras more often?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now here's a schematic of a here's a schematic of our conventional visible CMOS camera.",
                    "label": 1
                },
                {
                    "sent": "Now it uses Silicon as the light sensitive material.",
                    "label": 0
                },
                {
                    "sent": "Now Silicon is extremely cheap so that each pixel here it almost has a negligible cost.",
                    "label": 0
                },
                {
                    "sent": "Now, unfortunately, Silicon is not sensitive to swirl wave links.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For these wavelengths we need a different kind of material, which is called Indium gallium arsenide or in gas.",
                    "label": 0
                },
                {
                    "sent": "Now, in gas is extremely expensive, much more expensive than Silicon.",
                    "label": 0
                },
                {
                    "sent": "So SWIR sensor pixel costs about five orders of magnitude more than a visible light visible sensor pixel.",
                    "label": 0
                },
                {
                    "sent": "So just to give you an idea, one mega.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Still to this work, camera would cost about $100,000.",
                    "label": 0
                },
                {
                    "sent": "Imagine putting one of these cameras on a self driving car.",
                    "label": 0
                },
                {
                    "sent": "The sensor would be four times as expensive as the car itself, right?",
                    "label": 0
                },
                {
                    "sent": "So not very feasible.",
                    "label": 0
                },
                {
                    "sent": "Now, Fortunately.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A1D Sword camera is significantly cheaper.",
                    "label": 0
                },
                {
                    "sent": "Now this 1D camera has has has a very small number of pixels only about 1000 or so, and all these pixels are arranged in a single line or arrow, hence the name 1D cameras or line cameras.",
                    "label": 0
                },
                {
                    "sent": "So the next question that we asked was can we?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Build structured light.",
                    "label": 0
                },
                {
                    "sent": "3D imaging systems which can measure the 3D shape of a scene using these 1D sensors.",
                    "label": 1
                },
                {
                    "sent": "Right now to answer this question, let's first try to understand the structured light system in a bit more detail.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is a typical structured light system consists of a projector and a camera.",
                    "label": 0
                },
                {
                    "sent": "In the simplest form, the projector.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Would project a single line or a single column of pixels.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Should create a light sheet.",
                    "label": 0
                },
                {
                    "sent": "Which when.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Intersect which, when intersecting with the scene, creates 1D stripe.",
                    "label": 0
                },
                {
                    "sent": "It's a 1D light stripe.",
                    "label": 1
                },
                {
                    "sent": "Now this stripe is nothing but just the intersection of the scene with this light sheet.",
                    "label": 0
                },
                {
                    "sent": "Now the camera captures the image of this stripe.",
                    "label": 0
                },
                {
                    "sent": "Now consider a camera pixel on the.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stripe image.",
                    "label": 0
                },
                {
                    "sent": "We can shoot back a camera Ray which passes through this pixel.",
                    "label": 0
                },
                {
                    "sent": "Right now we assume that the projector is known, the projector and the camera are calibrated so we know the equations of this light sheet and the camera Ray, which we can then intersect at the 3D location of this get the 3D location.",
                    "label": 1
                },
                {
                    "sent": "So you get the 3D location of the scene point here.",
                    "label": 0
                },
                {
                    "sent": "Right now this process is called triangulation, much like we do in GPS, right?",
                    "label": 0
                },
                {
                    "sent": "Now this will give us the shape of a single stripe.",
                    "label": 0
                },
                {
                    "sent": "Now if you want to get the shape of the entire scene, we're going to scan this, scan this line over the entire image plane.",
                    "label": 0
                },
                {
                    "sent": "So we're going to project a seed.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ease of images.",
                    "label": 0
                },
                {
                    "sent": "Something like this, which we which will lead to the light sheet being scanned over the scene.",
                    "label": 0
                },
                {
                    "sent": "Now each camera pixel captures a sequence of light intensities.",
                    "label": 0
                },
                {
                    "sent": "Overtime.",
                    "label": 0
                },
                {
                    "sent": "Now whenever the light sheet passes over this pixel, we get an intensity peak and.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Looking by determining the location of this peak overtime, we can find the corresponding corresponding corresponding projector column and once you know that we can triangulate.",
                    "label": 0
                },
                {
                    "sent": "Now this method is called light striping and this forms the basis of most laser scanners.",
                    "label": 1
                },
                {
                    "sent": "So if you wanted to know how laser scanners work, this is how it is.",
                    "label": 0
                },
                {
                    "sent": "Now, this is conceptually a simple process, but unfortunately it's very slow because you really have to scan over the scene one line stripe at a time.",
                    "label": 0
                },
                {
                    "sent": "A faster alternative is to use binary.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is to use binary coding where you project a sequence of binary patterns.",
                    "label": 0
                },
                {
                    "sent": "Now each camera pixel at the bottom right observe the binary code overtime, which we can then decode to find the projector correspondence.",
                    "label": 0
                },
                {
                    "sent": "Now this is significantly faster.",
                    "label": 0
                },
                {
                    "sent": "It requires this method requires only a logarithmic number of images as opposed to linear with line scanning.",
                    "label": 0
                },
                {
                    "sent": "So just to give you an idea, if the line striping approach requires 1000 images, the binary binary approach will require only about 10 images or so.",
                    "label": 0
                },
                {
                    "sent": "So significantly faster.",
                    "label": 0
                },
                {
                    "sent": "Now, as I said before.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Structured light is a very old technique and there are many different kinds of patterns.",
                    "label": 0
                },
                {
                    "sent": "But the important thing here is that a lot of these patterns have translational symmetry.",
                    "label": 1
                },
                {
                    "sent": "Meaning.",
                    "label": 0
                },
                {
                    "sent": "In each of these patterns, all the pixels within us, all the pixels within a vertical column have the same value.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Now, given that.",
                    "label": 0
                },
                {
                    "sent": "It really means that although these patterns are represented as 2D images, they really are just.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1D patterns which are stretched in the vertical direction right?",
                    "label": 0
                },
                {
                    "sent": "And we can represent each of these two D patterns as just a one.",
                    "label": 0
                },
                {
                    "sent": "Decode something like this here.",
                    "label": 0
                },
                {
                    "sent": "Night.",
                    "label": 0
                },
                {
                    "sent": "So given this, we can now represent our.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Projector as having only a 1D set of pixels or a 1D image plane which is displaying this one decode.",
                    "label": 1
                },
                {
                    "sent": "So for example, if we want to, if you want to project a single line a single column, we can do that by illuminating a single pixel on this 1D image plane now.",
                    "label": 0
                },
                {
                    "sent": "Now we still need a way to spread out this light in the vertical direction.",
                    "label": 0
                },
                {
                    "sent": "We're going to do that by using a cylinder.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Length.",
                    "label": 0
                },
                {
                    "sent": "Now a cylindrical lens is interesting.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you shine a light beam on a cylindrical lens here it fans it out or spreads it out along One Direction, right?",
                    "label": 0
                },
                {
                    "sent": "So now using this cylindrical lens and the Wendy and Wendy and Wendy set of pixels, we can now create a light.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sheet as before, right?",
                    "label": 0
                },
                {
                    "sent": "Once we have the light sheet again we can do triangulation as before, right?",
                    "label": 0
                },
                {
                    "sent": "So this is an important point, so I'm going to repeat.",
                    "label": 0
                },
                {
                    "sent": "For patterns with translational symmetry, we can model the projector as having only a 1D image plane or a 1D set of pixels.",
                    "label": 1
                },
                {
                    "sent": "Now the 2nd.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Observation that the second observation that we make is that the.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Projector and the camera are really just dual devices of each other, meaning they have the same geometric mapping from the 3D World to the 2D image plane.",
                    "label": 1
                },
                {
                    "sent": "The only difference is that the projector, projector projects images, but the camera captures images.",
                    "label": 0
                },
                {
                    "sent": "Otherwise they're really the same.",
                    "label": 0
                },
                {
                    "sent": "You know, we can really think of the projector as an inverse camera.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Given this duality, we can flip the locations of the projector and camera.",
                    "label": 0
                },
                {
                    "sent": "So now we have A2 projector with a 2D image plane, but the camera with only a 1D set of pixels.",
                    "label": 1
                },
                {
                    "sent": "Right now this is an interesting design.",
                    "label": 0
                },
                {
                    "sent": "Now here each camera pixel will collect light not from a single scene point, but from a collection of a 1D collection of scene points here, right?",
                    "label": 0
                },
                {
                    "sent": "All these all these points here lie on this plane, which we call the camera sheet right.",
                    "label": 0
                },
                {
                    "sent": "So this is a bit unusual, so let's before going further, let's develop a bit of an intuition for this.",
                    "label": 0
                },
                {
                    "sent": "Here is the camera with a conventional lens.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Instant camera, where each camera pixel collects light from a single scene point.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, because of that the image is completely focused, it's sharp.",
                    "label": 0
                },
                {
                    "sent": "Now let's replace this lens.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With conventional lens with cylindrical lens so that now each camera pixel collects light from A1D set of points along this line.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now it's as if this image or this scene is getting integrated along the vertical direction, right?",
                    "label": 0
                },
                {
                    "sent": "So can you guys guess what the image would look like?",
                    "label": 0
                },
                {
                    "sent": "Just take a few seconds to think about it.",
                    "label": 0
                },
                {
                    "sent": "No, because we are integrating integrating this image along the vertical direction.",
                    "label": 0
                },
                {
                    "sent": "The image will be completely blurred vertically but will retain high frequencies along the vertical direction along the horizontal direction.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to direction.",
                    "label": 0
                },
                {
                    "sent": "So now we.",
                    "label": 0
                },
                {
                    "sent": "Along the horizontal direction.",
                    "label": 0
                },
                {
                    "sent": "So now we get back to a structured light system.",
                    "label": 1
                },
                {
                    "sent": "We have a camera with Wendy Sensor.",
                    "label": 0
                },
                {
                    "sent": "We now have this light sheet now because we know that we assume that the camera and the projector calibrated so we can find the intersection between the camera sheet and the projector to find the 3D location of this scene, point right.",
                    "label": 0
                },
                {
                    "sent": "If you want to find the low.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Addition of another scene point, we illuminate another projector pixel.",
                    "label": 0
                },
                {
                    "sent": "Tescan",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Intersting we repeat the process for every projector pixel repeat every projector pixel, indicate the 3D shape of the entire scene.",
                    "label": 0
                },
                {
                    "sent": "Now this is our main idea.",
                    "label": 0
                },
                {
                    "sent": "This is the main contribution we have shown that by exploiting the symmetry of the Wendy symmetry of the patterns and the duality of projector and camera, we can measure the 3D shape of a scene using only A1 using only a 1D sensor.",
                    "label": 0
                },
                {
                    "sent": "Now this is a slope.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just so as before, we can do this faster as well.",
                    "label": 0
                },
                {
                    "sent": "Instead of scanning the scene one point at a time, we can eliminate one, illuminate the entire projector row.",
                    "label": 0
                },
                {
                    "sent": "We measure one, decide.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Measurements we put we put the measurements here.",
                    "label": 0
                },
                {
                    "sent": "Do this for another.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Drew and I.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another set of capture data.",
                    "label": 0
                },
                {
                    "sent": "We repeat this for all projector rose and.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Collect all the captured data into a single composite 2D image.",
                    "label": 1
                },
                {
                    "sent": "Now this is as if the scene has been captured using a 2D camera which is 2D projector pattern.",
                    "label": 0
                },
                {
                    "sent": "Now we can do.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This for a sequence of patterns.",
                    "label": 0
                },
                {
                    "sent": "This capture data.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now for each pixel location here.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Each pixel location.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can find the camera.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Equation we can.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the corresponding projector row and we.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Intersect.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Want to show some?",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's quickly.",
                    "label": 0
                },
                {
                    "sent": "This is a hardware prototype.",
                    "label": 1
                },
                {
                    "sent": "We have.",
                    "label": 1
                },
                {
                    "sent": "The line sensor is cylindrical lens.",
                    "label": 0
                },
                {
                    "sent": "We have projector.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the chicken scene for which showed the raw data.",
                    "label": 0
                },
                {
                    "sent": "This is the 3D reconstructions.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another scene with a bunch of objects.",
                    "label": 0
                },
                {
                    "sent": "Now this is still preliminary.",
                    "label": 0
                },
                {
                    "sent": "We can see a bit of artifacts.",
                    "label": 0
                },
                {
                    "sent": "The system is not optimized yet, but optimizing the system is really the next step.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's another scene with a couple of balls.",
                    "label": 0
                },
                {
                    "sent": "Now these results are still for the visible.",
                    "label": 0
                },
                {
                    "sent": "For visible sensor the main motivation was to do this with the sword sensor, so here.",
                    "label": 1
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The 1st result of 3D scanning using a source sensor.",
                    "label": 0
                },
                {
                    "sent": "Now their quality is not as good as before, but that's to be expected because this world sensors are still a work in progress, they're not very sensitive, but we hope that that's going to improve in future in future time to come.",
                    "label": 0
                },
                {
                    "sent": "But we just want to emphasize that this is the first example of a high resolution 3D shape captured in sword wavelengths.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, just to summarize, we have developed a new technique called dual structured Light 3D which can measure 3D shape using 1D cameras and it's still early days, but we believe.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That this can lead to a new class of extreme 3D cameras which can measure 3D shape in extreme settings like dense fog and smoke using square wave links or also measure 3D shape at extremely high speeds using dynamic vision sensors or the event cameras talked about couple of talks ago, there's a lot of possibilities.",
                    "label": 0
                },
                {
                    "sent": "We're quite excited about that.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for listening.",
                    "label": 0
                },
                {
                    "sent": "I will be happy to take any questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you speaker.",
                    "label": 0
                }
            ]
        }
    }
}