{
    "id": "mhzywygwz2ilkx75oozfywrblh47vplv",
    "title": "Hacktivism: a Theoretical and Empirical Exploration of China’s Cyber Warriors",
    "info": {
        "author": [
            "Michael Yip, School of Electronics and Computer Science, University of Southampton"
        ],
        "published": "July 19, 2011",
        "recorded": "June 2011",
        "category": [
            "Top->Computer Science->Internet, World Wide Web"
        ]
    },
    "url": "http://videolectures.net/acmwebsci2011_yip_hacktivism/",
    "segmentation": [
        [
            "So my name is Michael and I'm from the website CDC from University of Southampton and my honor to be here to present my work.",
            "So in this study I'll be presenting a theoretical framework about motivation behind Chinese activists and also the empirical evidence that we found that supports our framework."
        ],
        [
            "So it started with a light to introduction to hacktivism, so hacktivism is.",
            "Phenomenon which hacking converges with political activism?",
            "And is being highlighted by recent high profile events surrounding WikiLeaks and anonymous hackers group and is thought to like some serious consequences associated with this type of hacking.",
            "And there's a lot of rich research concentrated on the technical aspects packing, but there's been a lack of research on the why.",
            "Why did they do this, and why are they motivated?",
            "European is so this study serves to fill this research gap by countries and their mergers or freelance Chinese hacking because we call it freelance because we concentrate under volunteers who hack on top of the country and there's an open instead of found that there.",
            "They employed."
        ],
        [
            "So.",
            "So an introduction to the Chinese hacker, wrists hurt their refer to as the hungers in China, which literally means a red hackers and red represents the national color.",
            "And because forums very popular in China, they also use forms to communicate an reach audience.",
            "So forms are used for a couple of things to announce and organize attacks, cyber attacks to attract public support by publishing what they've done and.",
            "That she plans to attract volunteers to participate in attacks at the times of need and also they offer free technical training for the interested parties, so to give their loyalty and to increase member volunteers to participate in attacks."
        ],
        [
            "At one ment by then attracting public support is that this is a typical way in which they attack targets.",
            "So they had a web server.",
            "These are changed.",
            "The source to existing web pages or injecting new page which conveys a message.",
            "So for example in this one they make a demand for Japanese government to make an official apology to Chinese government over an event which I'll talk about later.",
            "So it wasn't holding is that they would then take very instant print screen of what they've done and then publish in a forum to show people of their shipment.",
            "So this sense then generates public support."
        ],
        [
            "So when.",
            "So what do they do?",
            "It so percent, Alpharetta theoretical framework which consists of four main principles, so everything deprivation and social identity theory of social psychology theories?",
            "So to explain reparation?",
            "Then I'll use my colleague source.",
            "So his talk.",
            "Yes, they generate that love.",
            "Interest is work.",
            "So if I was to expect that might also generate interest.",
            "For my work, but I fail and I compare myself to squash.",
            "Then I'll feel relatively prime in that sense as well.",
            "Social identity theory then redefine it at the theory suggests that we define ourselves according to the groups that we remember of.",
            "So since I'm a website student, there now define myself as a web scientists.",
            "And also we strive to seek positive social identity.",
            "So for example, if apologists come up to me and say apologies and is more of a science than websites that I would just stand there and accept his this version, so I would actually say no.",
            "It's different because website says this is this, so I'll I'll find something positive to save up, say about my group.",
            "And also is that this needs to maintain.",
            "A positive social identity is enough to cause conflict between groups.",
            "Then another theories resolves more.",
            "It is a long term version of resentment, which is an incurable and persistent emotion characterized by hate and despising of social groups and people experiencing this person tomorrow would have a strong desire to seek revenge, but unable to do so for various reasons.",
            "And Lastly there is Chinese nationalism in relation, so over 20 over the last 20 years there's been a surge in nationalism.",
            "In China, and this may be due to the fact that after 10 minutes where's the nineteen?",
            "1989 the Chinese rulers launched nationwide Patriotic Education campaign to reinforce support for the party and to educate.",
            "People love their country and to be passionate about the country.",
            "But the Chinese nationalism is not just about how glorious the Chinese civilization has been, so it also commemorates China's weakness as they suffered a century of national.",
            "Relation by foreign oppression.",
            "Over over last century or so.",
            "So now we will see how they all."
        ],
        [
            "Together and give rise to Chinese activism.",
            "So first of all, the education campaign reminds people of Chinese security.",
            "So just to remind Chinese people that they are right to expect that level of respect from the foreign nations.",
            "But at the national communication that Chinese people.",
            "Experience and also the fact that education campaign educates the Chinese people about from nations still trying to undermine China.",
            "This at this as a result of educating people to kill relative, relatively deprived to other nations.",
            "And also because the education campaign increased people, stands national identity.",
            "It encourages people to positively distinguishing.",
            "And because the education campaign reminds people of the suffering of the Chinese people, and also because many of those are their relatives, it also increases people's personal experience or persons more.",
            "And so it kind of encourage people to hate and despise foreign countries.",
            "And this is expected to rise when there are political events concerning China and other foreign nations.",
            "So with all this.",
            "Educate emotions.",
            "Chinese people need a way to vent out their emotions, but physical process is limited in China because most protests will subject the government to criticism and confirm restrictive.",
            "Since the tenement, square incident and coupled with the fact that the web became available during this.",
            "So This is why we think.",
            "This gives rise to Chinese activism."
        ],
        [
            "So to improve our period, then we examined the membership growth of the hacktivist forum and we concentrated on the hungers Union China, which is the most symbolic group of Chinese activists.",
            "And we use the archive pages of forms from the Internet Archive and we obtain dimension numbers and we plot the graphs and correlated.",
            "Timing of their observation patterns to the political events and our study covers 2001, 2010 and our purposes is that at times of political conflicts with China and other foreign nations.",
            "People's sense of resentment and presentable would increase, and because they need a way to vent out their emotions, they would go and join membership.",
            "Join these hackers forums and attempt to participate if.",
            "So, and also because there's a increasing membership, these forms it would lead to relative increase in the number of freelance activities as well."
        ],
        [
            "So in 2001 this.",
            "This hacktivist group was still in its infancy an in April 2, then when there was a major political incident where you aspire to imply that with a Chinese fighter jet and Chinese pilot was killed as a result and.",
            "Because of the education campaign to inject hateful and despising foreign nations, this naturally caused public outcry in China.",
            "But this is not reflected by the graph and we we believe that cause the group was not known at the time.",
            "And this is all because of this incident that they launched a fame cyber war against USA and it was and it was reported on the BBC News.",
            "And this got them to public attention.",
            "So when tension with Taiwan and search increased in June, their membership growth surged."
        ],
        [
            "So the group was temporarily disbanded between 2000 two 1003 and it was regroup from 2000 three 2004, but it was a period where trying to experience granted stable platform relations with other countries and this is reflected by relatively stable growth of author problems."
        ],
        [
            "Any 2005 he changed hands and was recruited by another person.",
            "But in April 2005, Japanese education ministry was accused of literally whitewashing an their troubles atrocities committed by the Japanese to hear Army Second World War.",
            "By changing textbook contents an because education campaign.",
            "Educate before to never forget the simulation.",
            "They said they are Chinese people suffered and also because many of the Chinese people had relatives that were victims of these atrocities.",
            "There's cause their public outcry in China, and this is again reflected by some research in membership pro."
        ],
        [
            "Then more recently, last September there was an incident where Chinese Chinese capital controller was detained by the Japanese Navy near The Dalles View Islands.",
            "And again, this caused a public outcry.",
            "Or because of the fact that they expect a certain level of respect from the Japanese, but obviously didn't accept that so, but the user was not available for the entire time, so we turned to examine web traffic.",
            "Data of two forumshunker.net and cnhungerarmy.com.",
            "Both of these claims to be hopeless union China.",
            "But if we're just examining that they reach, which is the number of people that percentage for global visitors to his website, so this does not actually reflect participation, because it's just people just visiting the website, but they could visit the first page in Council Table page.",
            "So we went on to examine the time spent on these websites.",
            "And this is great for polygraph.",
            "I've gotten like and as you can see during that.",
            "See in hunkerarmy.com experienced a high search in.",
            "The average time spent on the forum and this has several implications.",
            "So first of all is that indicates the content on cnhunkarmy.com is a lot more relevant.",
            "As for in terms of hacktivism, then hunker.net, and we found the whole number line is more about security.",
            "And 2nd is the fact that hunker down there is things here on the news, for reasons that I explained it paper.",
            "So that's why they experienced a very high level re reach, but not necessarily at the increased in the time spent on the website.",
            "And Secondly, is that this this time spent this search in times?",
            "Banks also reflects the fact there people don't just become members of the forums and feel good about it.",
            "They do actually linger on forums and try to participate if possible."
        ],
        [
            "So in conclusion, then, this is where we proposed a theoretical framework explaining the motivation behind this activism, consisting of relatively relative deprivation, social identity theory and nationalism, and responsible and.",
            "We believe that it is a lack of physical ways for the Chinese people to express this emotional response more.",
            "And coupled with the availability of the web that led to people to increasingly trying to find out the emotions or by participating in hacker attacks.",
            "And we also found their membership growth patterns of these hackers groups.",
            "Relate with political events and so it supports our framework."
        ],
        [
            "Hello.",
            "Hello I just wondered, you know, Great Falls and you've identified a lot of I think correlations like food prevents you know propaganda nationalism in order.",
            "But I just wondered whether you considered the anti government hacking.",
            "If you like, the fact is that, for example, Twitter is not allowed, you can't access trade in China.",
            "Yes, it made #23.",
            "You know there was a number 23 on the 100 most accessed websites in China, so I want to have you have whether you consider that and also a question in terms of the methodology whether you have considered interviewing those who you know freelance hackers.",
            "They are in line to wait for it, which is expand is working with forward from this and but this is a preliminary research and we just came out with framework that kind of more those motivations for these pro China had place.",
            "And So what you put in paragraph and these are areas with potential applies to those areas or maybe vary a bit.",
            "Kind of differences between the previous.",
            "Is it?",
            "Is it?",
            "Is it possible to study with these people are doing when they spend time outside, yes?",
            "Yeah, these forms ready open so anyone can join his website.",
            "You can read what they say and you can.",
            "Even if you can reach out using anything to find out where Japan is attacked so.",
            "Yeah, they're really what they do, and it also shows that government is prepared to tolerate this time activities.",
            "One more question.",
            "That last point is going to bring up.",
            "Yes, you do some reports about the Chinese connection, either supporting or at very least allowing these groups resist.",
            "Consider their messages.",
            "Could you expand that alternative framework of why this is going on and watch maybe increasing recent well made?",
            "Because of the Education education campaign, we believe that the government would prefer Chinese people that rent out their emotions online rather than physical protests, and so this is probably one of the reasons why the company is prepared to tolerate this kind of behavior.",
            "Edition on cyberspace anyway, and also because China and the Chinese government and military are active in research on cyber warfare, information warfare, and they do recruit people from.",
            "These hackers fold, so I mean these hackers offer free training for young people.",
            "In terms of these Contacts.",
            "So there's very little reason why they would not want product discount for anything.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my name is Michael and I'm from the website CDC from University of Southampton and my honor to be here to present my work.",
                    "label": 0
                },
                {
                    "sent": "So in this study I'll be presenting a theoretical framework about motivation behind Chinese activists and also the empirical evidence that we found that supports our framework.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it started with a light to introduction to hacktivism, so hacktivism is.",
                    "label": 0
                },
                {
                    "sent": "Phenomenon which hacking converges with political activism?",
                    "label": 1
                },
                {
                    "sent": "And is being highlighted by recent high profile events surrounding WikiLeaks and anonymous hackers group and is thought to like some serious consequences associated with this type of hacking.",
                    "label": 0
                },
                {
                    "sent": "And there's a lot of rich research concentrated on the technical aspects packing, but there's been a lack of research on the why.",
                    "label": 1
                },
                {
                    "sent": "Why did they do this, and why are they motivated?",
                    "label": 0
                },
                {
                    "sent": "European is so this study serves to fill this research gap by countries and their mergers or freelance Chinese hacking because we call it freelance because we concentrate under volunteers who hack on top of the country and there's an open instead of found that there.",
                    "label": 0
                },
                {
                    "sent": "They employed.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So an introduction to the Chinese hacker, wrists hurt their refer to as the hungers in China, which literally means a red hackers and red represents the national color.",
                    "label": 0
                },
                {
                    "sent": "And because forums very popular in China, they also use forms to communicate an reach audience.",
                    "label": 0
                },
                {
                    "sent": "So forms are used for a couple of things to announce and organize attacks, cyber attacks to attract public support by publishing what they've done and.",
                    "label": 1
                },
                {
                    "sent": "That she plans to attract volunteers to participate in attacks at the times of need and also they offer free technical training for the interested parties, so to give their loyalty and to increase member volunteers to participate in attacks.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At one ment by then attracting public support is that this is a typical way in which they attack targets.",
                    "label": 0
                },
                {
                    "sent": "So they had a web server.",
                    "label": 0
                },
                {
                    "sent": "These are changed.",
                    "label": 0
                },
                {
                    "sent": "The source to existing web pages or injecting new page which conveys a message.",
                    "label": 1
                },
                {
                    "sent": "So for example in this one they make a demand for Japanese government to make an official apology to Chinese government over an event which I'll talk about later.",
                    "label": 0
                },
                {
                    "sent": "So it wasn't holding is that they would then take very instant print screen of what they've done and then publish in a forum to show people of their shipment.",
                    "label": 0
                },
                {
                    "sent": "So this sense then generates public support.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when.",
                    "label": 0
                },
                {
                    "sent": "So what do they do?",
                    "label": 0
                },
                {
                    "sent": "It so percent, Alpharetta theoretical framework which consists of four main principles, so everything deprivation and social identity theory of social psychology theories?",
                    "label": 1
                },
                {
                    "sent": "So to explain reparation?",
                    "label": 0
                },
                {
                    "sent": "Then I'll use my colleague source.",
                    "label": 0
                },
                {
                    "sent": "So his talk.",
                    "label": 0
                },
                {
                    "sent": "Yes, they generate that love.",
                    "label": 0
                },
                {
                    "sent": "Interest is work.",
                    "label": 0
                },
                {
                    "sent": "So if I was to expect that might also generate interest.",
                    "label": 0
                },
                {
                    "sent": "For my work, but I fail and I compare myself to squash.",
                    "label": 0
                },
                {
                    "sent": "Then I'll feel relatively prime in that sense as well.",
                    "label": 0
                },
                {
                    "sent": "Social identity theory then redefine it at the theory suggests that we define ourselves according to the groups that we remember of.",
                    "label": 0
                },
                {
                    "sent": "So since I'm a website student, there now define myself as a web scientists.",
                    "label": 0
                },
                {
                    "sent": "And also we strive to seek positive social identity.",
                    "label": 0
                },
                {
                    "sent": "So for example, if apologists come up to me and say apologies and is more of a science than websites that I would just stand there and accept his this version, so I would actually say no.",
                    "label": 0
                },
                {
                    "sent": "It's different because website says this is this, so I'll I'll find something positive to save up, say about my group.",
                    "label": 0
                },
                {
                    "sent": "And also is that this needs to maintain.",
                    "label": 0
                },
                {
                    "sent": "A positive social identity is enough to cause conflict between groups.",
                    "label": 1
                },
                {
                    "sent": "Then another theories resolves more.",
                    "label": 0
                },
                {
                    "sent": "It is a long term version of resentment, which is an incurable and persistent emotion characterized by hate and despising of social groups and people experiencing this person tomorrow would have a strong desire to seek revenge, but unable to do so for various reasons.",
                    "label": 1
                },
                {
                    "sent": "And Lastly there is Chinese nationalism in relation, so over 20 over the last 20 years there's been a surge in nationalism.",
                    "label": 0
                },
                {
                    "sent": "In China, and this may be due to the fact that after 10 minutes where's the nineteen?",
                    "label": 0
                },
                {
                    "sent": "1989 the Chinese rulers launched nationwide Patriotic Education campaign to reinforce support for the party and to educate.",
                    "label": 0
                },
                {
                    "sent": "People love their country and to be passionate about the country.",
                    "label": 0
                },
                {
                    "sent": "But the Chinese nationalism is not just about how glorious the Chinese civilization has been, so it also commemorates China's weakness as they suffered a century of national.",
                    "label": 1
                },
                {
                    "sent": "Relation by foreign oppression.",
                    "label": 0
                },
                {
                    "sent": "Over over last century or so.",
                    "label": 0
                },
                {
                    "sent": "So now we will see how they all.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Together and give rise to Chinese activism.",
                    "label": 0
                },
                {
                    "sent": "So first of all, the education campaign reminds people of Chinese security.",
                    "label": 0
                },
                {
                    "sent": "So just to remind Chinese people that they are right to expect that level of respect from the foreign nations.",
                    "label": 0
                },
                {
                    "sent": "But at the national communication that Chinese people.",
                    "label": 0
                },
                {
                    "sent": "Experience and also the fact that education campaign educates the Chinese people about from nations still trying to undermine China.",
                    "label": 0
                },
                {
                    "sent": "This at this as a result of educating people to kill relative, relatively deprived to other nations.",
                    "label": 1
                },
                {
                    "sent": "And also because the education campaign increased people, stands national identity.",
                    "label": 0
                },
                {
                    "sent": "It encourages people to positively distinguishing.",
                    "label": 0
                },
                {
                    "sent": "And because the education campaign reminds people of the suffering of the Chinese people, and also because many of those are their relatives, it also increases people's personal experience or persons more.",
                    "label": 0
                },
                {
                    "sent": "And so it kind of encourage people to hate and despise foreign countries.",
                    "label": 0
                },
                {
                    "sent": "And this is expected to rise when there are political events concerning China and other foreign nations.",
                    "label": 0
                },
                {
                    "sent": "So with all this.",
                    "label": 0
                },
                {
                    "sent": "Educate emotions.",
                    "label": 0
                },
                {
                    "sent": "Chinese people need a way to vent out their emotions, but physical process is limited in China because most protests will subject the government to criticism and confirm restrictive.",
                    "label": 1
                },
                {
                    "sent": "Since the tenement, square incident and coupled with the fact that the web became available during this.",
                    "label": 0
                },
                {
                    "sent": "So This is why we think.",
                    "label": 0
                },
                {
                    "sent": "This gives rise to Chinese activism.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to improve our period, then we examined the membership growth of the hacktivist forum and we concentrated on the hungers Union China, which is the most symbolic group of Chinese activists.",
                    "label": 0
                },
                {
                    "sent": "And we use the archive pages of forms from the Internet Archive and we obtain dimension numbers and we plot the graphs and correlated.",
                    "label": 1
                },
                {
                    "sent": "Timing of their observation patterns to the political events and our study covers 2001, 2010 and our purposes is that at times of political conflicts with China and other foreign nations.",
                    "label": 1
                },
                {
                    "sent": "People's sense of resentment and presentable would increase, and because they need a way to vent out their emotions, they would go and join membership.",
                    "label": 0
                },
                {
                    "sent": "Join these hackers forums and attempt to participate if.",
                    "label": 1
                },
                {
                    "sent": "So, and also because there's a increasing membership, these forms it would lead to relative increase in the number of freelance activities as well.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in 2001 this.",
                    "label": 0
                },
                {
                    "sent": "This hacktivist group was still in its infancy an in April 2, then when there was a major political incident where you aspire to imply that with a Chinese fighter jet and Chinese pilot was killed as a result and.",
                    "label": 1
                },
                {
                    "sent": "Because of the education campaign to inject hateful and despising foreign nations, this naturally caused public outcry in China.",
                    "label": 0
                },
                {
                    "sent": "But this is not reflected by the graph and we we believe that cause the group was not known at the time.",
                    "label": 0
                },
                {
                    "sent": "And this is all because of this incident that they launched a fame cyber war against USA and it was and it was reported on the BBC News.",
                    "label": 0
                },
                {
                    "sent": "And this got them to public attention.",
                    "label": 0
                },
                {
                    "sent": "So when tension with Taiwan and search increased in June, their membership growth surged.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the group was temporarily disbanded between 2000 two 1003 and it was regroup from 2000 three 2004, but it was a period where trying to experience granted stable platform relations with other countries and this is reflected by relatively stable growth of author problems.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Any 2005 he changed hands and was recruited by another person.",
                    "label": 0
                },
                {
                    "sent": "But in April 2005, Japanese education ministry was accused of literally whitewashing an their troubles atrocities committed by the Japanese to hear Army Second World War.",
                    "label": 1
                },
                {
                    "sent": "By changing textbook contents an because education campaign.",
                    "label": 0
                },
                {
                    "sent": "Educate before to never forget the simulation.",
                    "label": 0
                },
                {
                    "sent": "They said they are Chinese people suffered and also because many of the Chinese people had relatives that were victims of these atrocities.",
                    "label": 0
                },
                {
                    "sent": "There's cause their public outcry in China, and this is again reflected by some research in membership pro.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then more recently, last September there was an incident where Chinese Chinese capital controller was detained by the Japanese Navy near The Dalles View Islands.",
                    "label": 0
                },
                {
                    "sent": "And again, this caused a public outcry.",
                    "label": 0
                },
                {
                    "sent": "Or because of the fact that they expect a certain level of respect from the Japanese, but obviously didn't accept that so, but the user was not available for the entire time, so we turned to examine web traffic.",
                    "label": 0
                },
                {
                    "sent": "Data of two forumshunker.net and cnhungerarmy.com.",
                    "label": 0
                },
                {
                    "sent": "Both of these claims to be hopeless union China.",
                    "label": 0
                },
                {
                    "sent": "But if we're just examining that they reach, which is the number of people that percentage for global visitors to his website, so this does not actually reflect participation, because it's just people just visiting the website, but they could visit the first page in Council Table page.",
                    "label": 0
                },
                {
                    "sent": "So we went on to examine the time spent on these websites.",
                    "label": 0
                },
                {
                    "sent": "And this is great for polygraph.",
                    "label": 0
                },
                {
                    "sent": "I've gotten like and as you can see during that.",
                    "label": 0
                },
                {
                    "sent": "See in hunkerarmy.com experienced a high search in.",
                    "label": 0
                },
                {
                    "sent": "The average time spent on the forum and this has several implications.",
                    "label": 1
                },
                {
                    "sent": "So first of all is that indicates the content on cnhunkarmy.com is a lot more relevant.",
                    "label": 0
                },
                {
                    "sent": "As for in terms of hacktivism, then hunker.net, and we found the whole number line is more about security.",
                    "label": 0
                },
                {
                    "sent": "And 2nd is the fact that hunker down there is things here on the news, for reasons that I explained it paper.",
                    "label": 0
                },
                {
                    "sent": "So that's why they experienced a very high level re reach, but not necessarily at the increased in the time spent on the website.",
                    "label": 0
                },
                {
                    "sent": "And Secondly, is that this this time spent this search in times?",
                    "label": 0
                },
                {
                    "sent": "Banks also reflects the fact there people don't just become members of the forums and feel good about it.",
                    "label": 0
                },
                {
                    "sent": "They do actually linger on forums and try to participate if possible.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in conclusion, then, this is where we proposed a theoretical framework explaining the motivation behind this activism, consisting of relatively relative deprivation, social identity theory and nationalism, and responsible and.",
                    "label": 1
                },
                {
                    "sent": "We believe that it is a lack of physical ways for the Chinese people to express this emotional response more.",
                    "label": 1
                },
                {
                    "sent": "And coupled with the availability of the web that led to people to increasingly trying to find out the emotions or by participating in hacker attacks.",
                    "label": 0
                },
                {
                    "sent": "And we also found their membership growth patterns of these hackers groups.",
                    "label": 0
                },
                {
                    "sent": "Relate with political events and so it supports our framework.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Hello I just wondered, you know, Great Falls and you've identified a lot of I think correlations like food prevents you know propaganda nationalism in order.",
                    "label": 0
                },
                {
                    "sent": "But I just wondered whether you considered the anti government hacking.",
                    "label": 0
                },
                {
                    "sent": "If you like, the fact is that, for example, Twitter is not allowed, you can't access trade in China.",
                    "label": 0
                },
                {
                    "sent": "Yes, it made #23.",
                    "label": 0
                },
                {
                    "sent": "You know there was a number 23 on the 100 most accessed websites in China, so I want to have you have whether you consider that and also a question in terms of the methodology whether you have considered interviewing those who you know freelance hackers.",
                    "label": 0
                },
                {
                    "sent": "They are in line to wait for it, which is expand is working with forward from this and but this is a preliminary research and we just came out with framework that kind of more those motivations for these pro China had place.",
                    "label": 0
                },
                {
                    "sent": "And So what you put in paragraph and these are areas with potential applies to those areas or maybe vary a bit.",
                    "label": 0
                },
                {
                    "sent": "Kind of differences between the previous.",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it?",
                    "label": 0
                },
                {
                    "sent": "Is it possible to study with these people are doing when they spend time outside, yes?",
                    "label": 0
                },
                {
                    "sent": "Yeah, these forms ready open so anyone can join his website.",
                    "label": 0
                },
                {
                    "sent": "You can read what they say and you can.",
                    "label": 0
                },
                {
                    "sent": "Even if you can reach out using anything to find out where Japan is attacked so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, they're really what they do, and it also shows that government is prepared to tolerate this time activities.",
                    "label": 0
                },
                {
                    "sent": "One more question.",
                    "label": 0
                },
                {
                    "sent": "That last point is going to bring up.",
                    "label": 0
                },
                {
                    "sent": "Yes, you do some reports about the Chinese connection, either supporting or at very least allowing these groups resist.",
                    "label": 0
                },
                {
                    "sent": "Consider their messages.",
                    "label": 0
                },
                {
                    "sent": "Could you expand that alternative framework of why this is going on and watch maybe increasing recent well made?",
                    "label": 0
                },
                {
                    "sent": "Because of the Education education campaign, we believe that the government would prefer Chinese people that rent out their emotions online rather than physical protests, and so this is probably one of the reasons why the company is prepared to tolerate this kind of behavior.",
                    "label": 0
                },
                {
                    "sent": "Edition on cyberspace anyway, and also because China and the Chinese government and military are active in research on cyber warfare, information warfare, and they do recruit people from.",
                    "label": 0
                },
                {
                    "sent": "These hackers fold, so I mean these hackers offer free training for young people.",
                    "label": 0
                },
                {
                    "sent": "In terms of these Contacts.",
                    "label": 0
                },
                {
                    "sent": "So there's very little reason why they would not want product discount for anything.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}