{
    "id": "mkr4sr2vjzjkwaiwbkyopgp5herjbdz3",
    "title": "Characterising Emergent Semantics in Twitter Lists",
    "info": {
        "author": [
            "Andrés García-Silva, Universidad Politécnica de Madrid"
        ],
        "published": "July 4, 2012",
        "recorded": "May 2012",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Databases"
        ]
    },
    "url": "http://videolectures.net/eswc2012_garcia_silva_semantics_twitter/",
    "segmentation": [
        [
            "Good morning everybody.",
            "I am undress Garcia and I will present our work about characterizing them urgency.",
            "Mantex in Twitter list.",
            "This research has been done in collaboration with the University that Polytechnical Madrid and the University of Southern California.",
            "I would like to say that in this presentation I will focus more on the results of our research.",
            "Instead of in the technical details, so I invite you to read the paper if you want some details about the models and techniques that we are using in this paper."
        ],
        [
            "So let's start.",
            "I guess we all know what is Twitter?",
            "Anybody here doesn't know what is Twitter?",
            "OK, so we can go directly through the Twitter list feature.",
            "Basically, in Twitter users can create lists so that they can organize users that they already following.",
            "At least have a name has a name and it is created, but I use it in Twitter which is known as the curator of the list.",
            "People who is classified on that list is known as members of the list.",
            "Here we have an example where we can see some of the members of our community.",
            "In additions list can be public so other users can subscribe to them so that they can also follow the twists of the people.",
            "That is in the in the list.",
            "So basically they are used by users to just organize the information that.",
            "People in the list is publishing, so let's see."
        ],
        [
            "More examples in this case this user has has created many different lists.",
            "As we can see here, some of when we were analyzing this data, we start noticing that this lists the names of their names were related among them, usually in a given domain.",
            "So here we have names such as cloud computing, open source, big data visualization and so."
        ],
        [
            "1.",
            "In the case of the members of the list, here we have another member of our community which is very active in Twitter.",
            "He has been classified classified in many different lists and also again we can see that the name of those lists were related among them.",
            "Here we have examples as a short version of Semantic Web, which is same web link data research and we also have even keywords in other languages such as web semantica which is the Spanish word for semantic web."
        ],
        [
            "Something very similar happens with the subscribers of the list.",
            "And in the case of this user, he doesn't create a list by itself, but he just subscribe to them and usually also the name of the leaves are related among them in the computer science domain.",
            "But in this case it's in the social data domain."
        ],
        [
            "So what I have shown before are just individual examples.",
            "Uses of list and also we have seen that list names are related among them according to the different user roles that are participating in this classification system.",
            "So we started to thinking to think, what if we could have the names of the least according to the different user roles?",
            "Are we able to find attack Cloud of keywords which are related among among them in a given domain?"
        ],
        [
            "So let's see.",
            "Let's see this example.",
            "We have here the list where the this user Yahoo Finance user is a member and we have group the list names according to the frequency of membership membership.",
            "This means the number of times that the Yahoo Finance user has been listed in a list.",
            "With the corresponding name, so that cloud that we generate is this one the size of the font reflects the frequency of membership, and as you can see, also most of the terms are related in the financial domain, so we had keywords such as stock investment, money, business, financial and so on.",
            "Another example is here we have the list where the NASDAQ user is a member, and in this case we have group.",
            "The list names according to the number of subscriptions of those lists.",
            "And this is the that cloud that we are generating so.",
            "Again, the terms are related among them, but some of them are more important according to this grouping that we are that we are using here in the.",
            "In the previous case, the two main types, square finance and news, and in this case our business and news.",
            "Um, yes so.",
            "Using this previous analysis analysis, we realize that I'm sorry that actually this classification system can be considered as a potential source.",
            "Of knowledge that we construct an using other applications."
        ],
        [
            "So we defined our research questions.",
            "Basically, we wanted to know if it is possible to identify related keywords from list names according to the use given by them by the different user roles.",
            "So to be more specific, we want to know if to list names were related and if they had been used by a similar set of users or if a similar set of users have subscribed to them to the corresponding list.",
            "I'm sorry.",
            "Or if the corresponded leads have have a similar set of members.",
            "In addition, we wanted to know the kind of user role, what kind of user roles will generate more related keywords and also to correct characterize the semantics of the relations that we were extracting.",
            "Are they synonyms, or is a relationships or siblings or so?"
        ],
        [
            "So to answer these research questions, research questions, we define.",
            "Our approach basically consist of.",
            "Two different processes.",
            "In the first one, we are obtaining related keywords from Twitter list and in the second one we are characterizing the semantics.",
            "So with respect to the first process, we first define some schema representations of keywords.",
            "Actually they are three based on the different user roles, creators, members and subscribers.",
            "And then we define some models to measure similarity between the keywords in each of the previously defined representations to measure similarity between.",
            "Keywords we're using the vector space model and LDI.",
            "In vector space model, keywords represented by vectors and the components of the vector are curators, subscribers or members.",
            "An then we can calculate the similarity between the vectors using the cosine of the angle that the vector forms.",
            "In LDA, a keywords are represented by a Mr mixture of topics.",
            "Which basically is a topic distribution that is also a vector, so the result of LDA.",
            "I mean the vectors I.",
            "We can compare them also with the cosine similarity.",
            "We're using LDA seeing the.",
            "The use of topics allows to group words according to the topics that are found in the document that in this case are the keyboard."
        ],
        [
            "So this analysis this process let's also identify.",
            "Betasoft related keywords, but it's one of the schema representations that we're using and also, but it's one of the models.",
            "On the other hand to characterize the semantics of those relationships.",
            "We are using some similarity measures based on word net.",
            "Basically, we're measuring the length of the path connecting to since it's in the word net.",
            "Since hierarchy, we're also using the one polymer similarity measure, which takes into account the position of the scene set in the word net hierarchy rules.",
            "So the idea is that since that are on top of the position, our margins are more general, and since there are on the bottom part are more specific.",
            "Finally, we are using the GN and contract.",
            "Similarity distance this kind of analysis help us to identify if there if the keyword for that we are obtaining from the classification systems are synonyms if they are related through is a relationship or if they are siblings.",
            "If they shared a common superclass.",
            "And also to we can say something about their specificity of their relations.",
            "On the other hand, we are also using.",
            "Knowledge bases which are published as linked data.",
            "In particular we are using the Pedia opencyc unable.",
            "And what we're doing is to pose Sparkle queries following a approach which is very similar to the refinder approach.",
            "To find a relation between the keywords.",
            "And this case, this kind of analogies help us to identify synonyms in the same of same as relationships or binary relationships.",
            "Shells has typo for broader term or object properties like occupation."
        ],
        [
            "So now I will show the experiment that we have done.",
            "We collected from Twitter almost 300,000 list which you can see there.",
            "The statistic of the different users.",
            "Participating in this classification system from those 300,000 list with static.",
            "Almost 6000 unique keywords we found 5055% of them.",
            "I don't know what it is doing.",
            "55% of them in Wordnet."
        ],
        [
            "So we create.",
            "How are the schema representations would run or similarity models?",
            "We get the pair of related keywords.",
            "But the schema upper model and we save.",
            "For this keyword.",
            "Five most similar keyword according to the models.",
            "Then we.",
            "Calculate the similarity measures and distance based on word net and get the word net similarity values so.",
            "I'm sorry I'm having problems here.",
            "So the first thing that we wanted to study was to know if the if the.",
            "If there was any correlation between the.",
            "Similarity.",
            "Beating quick sorry between the keyboard.",
            "We wanted to know if there were there were some similar, some correlation between the word net similarity values and similarity values that we were obtained using the models."
        ],
        [
            "So for doing this we calculate the Pearson's coefficient of correlation which measure if there is a linear correspondence between 2 random variables.",
            "We found that in this that basically the models both vector space model and LDA model based on Members were more correlated to.",
            "The gene and content distant anwan palmar similarity.",
            "Also, that vector space model based on the other two type of users were correlated, so we were looking for an explanation to this situation and we decided to calculate the average GNC distance and the one on average one polymer similarity.",
            "I'm sorry.",
            "So what we found was that actually the models based on member members.",
            "Have the shortest GL and content distance, which means that the keywords are more related and also the highest similarity of 1 polymer."
        ],
        [
            "In addition, we decided to categorize all the relation that we had found according to the path length of connecting the two keywords in Word net.",
            "And we found that the models based on members, especially LDA, was able to find the highest number of synonyms.",
            "And also of of his relationship.",
            "However, most of the relationship that we found half a length of the path connecting the corresponding since it's in Word net.",
            "Greater than three.",
            "So for those relationships, most of the time they were connected through an intermediate instead, which is known as a common sub summer."
        ],
        [
            "So to analyze.",
            "Also, to study this relationship with decided to use to measure the depth of the least common sub summer environment and also they measure the path length connecting the two synsets as indicators of the specificity of the relationships.",
            "So in this chart we are depicting the numbers of relations in Wordnet according to the depth of the least common sub summer in the Wordnet Synset hierarchy.",
            "Again, the comments of summer is just the the common superclass to given synsets.",
            "So what we what we found here was the vector space model based on subscriber.",
            "Was the model producing the highest number of relationships according to the the depth of the least common sense?",
            "We were talking about almost 40% of the relationship.",
            "Has the depth of this scene set between 5:00 and 6:00.",
            "So then we measured the average path length of this kind of relationships.",
            "Again, we found that the vector space model was finding the highest number of relations of relationships with the length between 10:00 and 4:00."
        ],
        [
            "So.",
            "To summarize, we have shown that similarity models based on members produce results which are correlated to similarity measures based on word, NET and also.",
            "That these models finds more synonyms and direct relations is a relation when compared to the other models.",
            "I don't know.",
            "We have found also that the majority of the relation between the keyword have a path length greater than, greater than or equal to three in the sense that hierarchy and they involve a common sub summer.",
            "And that if we use the tip of the least common sub summer, we can say that the vector space model based on subscriber produces the highest number of specific relationship according to that criteria.",
            "And finally, that similarity models based on curators produce a lower number of relationship."
        ],
        [
            "So continue continuing with our experiment.",
            "We also pose some sparkle queries to find relationship between the related keywords that we were obtaining from the classification system."
        ],
        [
            "So what we did was just first they the two related keywords and anchor them two resources in the pedia.",
            "We were able to anchor almost 64% of those keywords and then we start to search for possible relations with the sparkle queries.",
            "So in this chart, basically we are confirming the findings that we have found using warning that the models based on Members produce the highest number of synonyms and also of direct relations under the vector space model based on subscribers produce the highest number of indirect relations with the length of the path connecting the keywords of three."
        ],
        [
            "So we decided to use a knowledge base is published as linked data.",
            "Because of the limitation of Wordnet Synset hierarchy.",
            "Where we have mostly lexical relations, but in the knowledge bases we have other kind of relationships.",
            "And according to this we characterized the type of relationship that we were finding between the keywords and in the case of the vector space model based on member.",
            "Most of the relationships, that of the direct direct relationship where broader term or so class of.",
            "I hear we can see some examples such as life science is a broader term for biotech or that writers are subclasses.",
            "So class of authors.",
            "For in the other, in the case of the vector space model based on subscriber, we watched the model finding a high guess higher highest number of relationships with a pattern of three.",
            "We found that most of the.",
            "Relationships, I'm sorry.",
            "Followed two patterns.",
            "The first pattern is where the two relationships are siblings.",
            "Since they charge a common superclass for a common object.",
            "Also, when the keywords were connected connected to an individual.",
            "Because the two keyword keywords were object properties of that individual.",
            "So with respect to the first pattern, most of the relationships where Typeof and subclass of an example we have, the Nokia and Intel related.",
            "They both are companies.",
            "And with respect to the second pattern, the number of object properties which were setting up or making up the connection between the keywords was wider.",
            "If I can say that.",
            "We have properties like occupation, general, product, industry and so on.",
            "So.",
            "It's important to note that this kind of relations is not possible to find any Internet.",
            "But through the use of the instances of the knowledge basis published as Lincoln data, it is possible.",
            "For example, here we have some authors like Adam Maxwell.",
            "Without his occupation is being a writer, and the general is fiction like that.",
            "OK."
        ],
        [
            "So to finalize my presentation and I would say that we have presented different models to obtain related keywords from Twitter lists.",
            "Those models are based on the different user roles that are participating in this new classification system.",
            "Basically we used to model vector space model and LDA and that we characterize the semantic of those relationships using similarity measures based on word NET.",
            "Honest particle queries over some link data."
        ],
        [
            "It's.",
            "With respect to the findings, models based on members produce Moscow related assault to those of word net similarity measures since they have the shortest jianren contract distance and the higest one polymer similarity.",
            "That according to Wordnet.",
            "Also modeled by some members can be used to obtain the highest number of synonyms and direct is relationship.",
            "And that most of their relations have a baffling greater than or equal to three.",
            "An involve Commons of summer.",
            "And if we take into account the depth of the least common sub summary in the Wordnet Synset hierarchy, we can say that the vector space model based on subscribers find the highest number of relations.",
            "Finally, that we confirm these results using knowledge bases as.",
            "They published us link datasets.",
            "So that's all there had to say.",
            "I have a small question regarding your similarity measure.",
            "M So in your case use like word net and also remote knowledge base is like an idiot.",
            "Datasets from the linked Open data cloud.",
            "Yes, so did you ever maybe also considering uses like personal knowledge bases?",
            "Where maybe you could populate them from either crawled your crawl device, users called device or also from social accounts, or in order to find maybe better information and to relate like to get better relations because you know, like external knowledge basis sometimes can't contain your personal relations, so you cannot always find everything there, but you should take into account that we are using the knowledge bases.",
            "To.",
            "Just to study their relations that we are obtaining from the classification from the from the Twitter list.",
            "So yeah, you see another kind of knowledge basis, maybe can help us to identify another type of relationships.",
            "But basically the result.",
            "But my message is that we are using this knowledge basis to understand what can we obtain from Twitter list.",
            "OK, so yes we can use some other some other knowledge.",
            "Base is an analyze.",
            "What can we obtain if we can obtain something more from from from the classification system?",
            "Alright, so I I think I understand your approach in the sense that they actually are using what similarity obtained by Wordnet, another kind of resource as Golden standard.",
            "That which you can compare what you can get by idea is to use state of the art similarity measures to evaluate.",
            "What can you think so.",
            "So my question is more about did you try to understand why the models that we derived based on members are better compared to those based on creator or subscriber?",
            "This is just a matter of number.",
            "Numbers, for example, number of creator are fewer than a number of members and therefore probably size matter or them.",
            "We were trying to understand why we got this results for reason.",
            "In the case of curators, which are the users that provide like less related keywords.",
            "We were we realized that it was a question of scarcity because we have curators, but most of them they just have two or three lists.",
            "In our data set, so it was a problem of data connecting to the morning keynote.",
            "Do you have any ideas about how to use the your findings?",
            "Like yes.",
            "Yes, actually this this research is started.",
            "Like it is searching for for false ennemies at the beginning with full tsunami is start to appear.",
            "Everybody was like very excited.",
            "What can we do with this and everybody started to.",
            "I mean researchers start to propose like different techniques to try to obtain some knowledge from false enemy.",
            "But what happened?",
            "Those techniques were a doc.",
            "Basically everybody was proposing some structure and some similarity measure to obtain related keywords.",
            "So after two or three years.",
            "Of research sample soname.",
            "Somebody say OK we have to do.",
            "An analysis to characterize what information actually you can obtain from false ennemies.",
            "So our idea with this work is OK if somehow you want to exploit to benefit of the knowledge that is in code in this classification system, which you should know what you can expect of that information, you know you can obtain some synonyms not too much.",
            "You can obtain some direct is a relationship, but at least we're telling you what you can obtain.",
            "With these two models.",
            "Focusing on the on the term emergent in your title, do you have you thought about analyzing different snapshots of different lists overtime to see how the application of these two models changes in terms of the types of similarities and relationships that you could discover?",
            "Do we honest not.",
            "Hey.",
            "How sorry how is it an emergency?",
            "OK, the emergent they made it.",
            "Yeah of course.",
            "Now the emerging the title of emerging semantic is because of the interaction of the individual classification of user.",
            "When you are grouping them, something is emerging.",
            "A classification system.",
            "So it's like a merging conceptualizations around some user classification individual classification, and that's why the emerging thinking my so.",
            "Assuming you look at the same lists or in six months time, do you expect to find more relationships?",
            "Do you expect to find some of the relationships invalidated?",
            "What would be your intuition about how this model would evolve?",
            "I don't know.",
            "There's somebody tough questions because that depends on the user characteristics.",
            "Some people is more static, some people just goes to Twitter to get information about.",
            "I don't know professional activities, some other goals be 'cause I gotta keep updated with friends information so I don't have an answer for that.",
            "I'm sorry.",
            "Thank you.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning everybody.",
                    "label": 0
                },
                {
                    "sent": "I am undress Garcia and I will present our work about characterizing them urgency.",
                    "label": 0
                },
                {
                    "sent": "Mantex in Twitter list.",
                    "label": 0
                },
                {
                    "sent": "This research has been done in collaboration with the University that Polytechnical Madrid and the University of Southern California.",
                    "label": 1
                },
                {
                    "sent": "I would like to say that in this presentation I will focus more on the results of our research.",
                    "label": 0
                },
                {
                    "sent": "Instead of in the technical details, so I invite you to read the paper if you want some details about the models and techniques that we are using in this paper.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's start.",
                    "label": 0
                },
                {
                    "sent": "I guess we all know what is Twitter?",
                    "label": 0
                },
                {
                    "sent": "Anybody here doesn't know what is Twitter?",
                    "label": 0
                },
                {
                    "sent": "OK, so we can go directly through the Twitter list feature.",
                    "label": 0
                },
                {
                    "sent": "Basically, in Twitter users can create lists so that they can organize users that they already following.",
                    "label": 1
                },
                {
                    "sent": "At least have a name has a name and it is created, but I use it in Twitter which is known as the curator of the list.",
                    "label": 0
                },
                {
                    "sent": "People who is classified on that list is known as members of the list.",
                    "label": 0
                },
                {
                    "sent": "Here we have an example where we can see some of the members of our community.",
                    "label": 0
                },
                {
                    "sent": "In additions list can be public so other users can subscribe to them so that they can also follow the twists of the people.",
                    "label": 0
                },
                {
                    "sent": "That is in the in the list.",
                    "label": 0
                },
                {
                    "sent": "So basically they are used by users to just organize the information that.",
                    "label": 0
                },
                {
                    "sent": "People in the list is publishing, so let's see.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More examples in this case this user has has created many different lists.",
                    "label": 0
                },
                {
                    "sent": "As we can see here, some of when we were analyzing this data, we start noticing that this lists the names of their names were related among them, usually in a given domain.",
                    "label": 0
                },
                {
                    "sent": "So here we have names such as cloud computing, open source, big data visualization and so.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1.",
                    "label": 0
                },
                {
                    "sent": "In the case of the members of the list, here we have another member of our community which is very active in Twitter.",
                    "label": 1
                },
                {
                    "sent": "He has been classified classified in many different lists and also again we can see that the name of those lists were related among them.",
                    "label": 0
                },
                {
                    "sent": "Here we have examples as a short version of Semantic Web, which is same web link data research and we also have even keywords in other languages such as web semantica which is the Spanish word for semantic web.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something very similar happens with the subscribers of the list.",
                    "label": 0
                },
                {
                    "sent": "And in the case of this user, he doesn't create a list by itself, but he just subscribe to them and usually also the name of the leaves are related among them in the computer science domain.",
                    "label": 0
                },
                {
                    "sent": "But in this case it's in the social data domain.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what I have shown before are just individual examples.",
                    "label": 0
                },
                {
                    "sent": "Uses of list and also we have seen that list names are related among them according to the different user roles that are participating in this classification system.",
                    "label": 1
                },
                {
                    "sent": "So we started to thinking to think, what if we could have the names of the least according to the different user roles?",
                    "label": 0
                },
                {
                    "sent": "Are we able to find attack Cloud of keywords which are related among among them in a given domain?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let's see.",
                    "label": 0
                },
                {
                    "sent": "Let's see this example.",
                    "label": 0
                },
                {
                    "sent": "We have here the list where the this user Yahoo Finance user is a member and we have group the list names according to the frequency of membership membership.",
                    "label": 1
                },
                {
                    "sent": "This means the number of times that the Yahoo Finance user has been listed in a list.",
                    "label": 0
                },
                {
                    "sent": "With the corresponding name, so that cloud that we generate is this one the size of the font reflects the frequency of membership, and as you can see, also most of the terms are related in the financial domain, so we had keywords such as stock investment, money, business, financial and so on.",
                    "label": 1
                },
                {
                    "sent": "Another example is here we have the list where the NASDAQ user is a member, and in this case we have group.",
                    "label": 1
                },
                {
                    "sent": "The list names according to the number of subscriptions of those lists.",
                    "label": 0
                },
                {
                    "sent": "And this is the that cloud that we are generating so.",
                    "label": 0
                },
                {
                    "sent": "Again, the terms are related among them, but some of them are more important according to this grouping that we are that we are using here in the.",
                    "label": 0
                },
                {
                    "sent": "In the previous case, the two main types, square finance and news, and in this case our business and news.",
                    "label": 0
                },
                {
                    "sent": "Um, yes so.",
                    "label": 0
                },
                {
                    "sent": "Using this previous analysis analysis, we realize that I'm sorry that actually this classification system can be considered as a potential source.",
                    "label": 0
                },
                {
                    "sent": "Of knowledge that we construct an using other applications.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we defined our research questions.",
                    "label": 0
                },
                {
                    "sent": "Basically, we wanted to know if it is possible to identify related keywords from list names according to the use given by them by the different user roles.",
                    "label": 1
                },
                {
                    "sent": "So to be more specific, we want to know if to list names were related and if they had been used by a similar set of users or if a similar set of users have subscribed to them to the corresponding list.",
                    "label": 1
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Or if the corresponded leads have have a similar set of members.",
                    "label": 0
                },
                {
                    "sent": "In addition, we wanted to know the kind of user role, what kind of user roles will generate more related keywords and also to correct characterize the semantics of the relations that we were extracting.",
                    "label": 0
                },
                {
                    "sent": "Are they synonyms, or is a relationships or siblings or so?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to answer these research questions, research questions, we define.",
                    "label": 0
                },
                {
                    "sent": "Our approach basically consist of.",
                    "label": 0
                },
                {
                    "sent": "Two different processes.",
                    "label": 0
                },
                {
                    "sent": "In the first one, we are obtaining related keywords from Twitter list and in the second one we are characterizing the semantics.",
                    "label": 1
                },
                {
                    "sent": "So with respect to the first process, we first define some schema representations of keywords.",
                    "label": 0
                },
                {
                    "sent": "Actually they are three based on the different user roles, creators, members and subscribers.",
                    "label": 0
                },
                {
                    "sent": "And then we define some models to measure similarity between the keywords in each of the previously defined representations to measure similarity between.",
                    "label": 0
                },
                {
                    "sent": "Keywords we're using the vector space model and LDI.",
                    "label": 1
                },
                {
                    "sent": "In vector space model, keywords represented by vectors and the components of the vector are curators, subscribers or members.",
                    "label": 0
                },
                {
                    "sent": "An then we can calculate the similarity between the vectors using the cosine of the angle that the vector forms.",
                    "label": 0
                },
                {
                    "sent": "In LDA, a keywords are represented by a Mr mixture of topics.",
                    "label": 0
                },
                {
                    "sent": "Which basically is a topic distribution that is also a vector, so the result of LDA.",
                    "label": 0
                },
                {
                    "sent": "I mean the vectors I.",
                    "label": 0
                },
                {
                    "sent": "We can compare them also with the cosine similarity.",
                    "label": 0
                },
                {
                    "sent": "We're using LDA seeing the.",
                    "label": 0
                },
                {
                    "sent": "The use of topics allows to group words according to the topics that are found in the document that in this case are the keyboard.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this analysis this process let's also identify.",
                    "label": 0
                },
                {
                    "sent": "Betasoft related keywords, but it's one of the schema representations that we're using and also, but it's one of the models.",
                    "label": 1
                },
                {
                    "sent": "On the other hand to characterize the semantics of those relationships.",
                    "label": 1
                },
                {
                    "sent": "We are using some similarity measures based on word net.",
                    "label": 0
                },
                {
                    "sent": "Basically, we're measuring the length of the path connecting to since it's in the word net.",
                    "label": 0
                },
                {
                    "sent": "Since hierarchy, we're also using the one polymer similarity measure, which takes into account the position of the scene set in the word net hierarchy rules.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that since that are on top of the position, our margins are more general, and since there are on the bottom part are more specific.",
                    "label": 0
                },
                {
                    "sent": "Finally, we are using the GN and contract.",
                    "label": 1
                },
                {
                    "sent": "Similarity distance this kind of analysis help us to identify if there if the keyword for that we are obtaining from the classification systems are synonyms if they are related through is a relationship or if they are siblings.",
                    "label": 0
                },
                {
                    "sent": "If they shared a common superclass.",
                    "label": 0
                },
                {
                    "sent": "And also to we can say something about their specificity of their relations.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we are also using.",
                    "label": 0
                },
                {
                    "sent": "Knowledge bases which are published as linked data.",
                    "label": 1
                },
                {
                    "sent": "In particular we are using the Pedia opencyc unable.",
                    "label": 0
                },
                {
                    "sent": "And what we're doing is to pose Sparkle queries following a approach which is very similar to the refinder approach.",
                    "label": 0
                },
                {
                    "sent": "To find a relation between the keywords.",
                    "label": 0
                },
                {
                    "sent": "And this case, this kind of analogies help us to identify synonyms in the same of same as relationships or binary relationships.",
                    "label": 0
                },
                {
                    "sent": "Shells has typo for broader term or object properties like occupation.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I will show the experiment that we have done.",
                    "label": 0
                },
                {
                    "sent": "We collected from Twitter almost 300,000 list which you can see there.",
                    "label": 0
                },
                {
                    "sent": "The statistic of the different users.",
                    "label": 0
                },
                {
                    "sent": "Participating in this classification system from those 300,000 list with static.",
                    "label": 0
                },
                {
                    "sent": "Almost 6000 unique keywords we found 5055% of them.",
                    "label": 0
                },
                {
                    "sent": "I don't know what it is doing.",
                    "label": 0
                },
                {
                    "sent": "55% of them in Wordnet.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we create.",
                    "label": 0
                },
                {
                    "sent": "How are the schema representations would run or similarity models?",
                    "label": 0
                },
                {
                    "sent": "We get the pair of related keywords.",
                    "label": 1
                },
                {
                    "sent": "But the schema upper model and we save.",
                    "label": 0
                },
                {
                    "sent": "For this keyword.",
                    "label": 0
                },
                {
                    "sent": "Five most similar keyword according to the models.",
                    "label": 0
                },
                {
                    "sent": "Then we.",
                    "label": 1
                },
                {
                    "sent": "Calculate the similarity measures and distance based on word net and get the word net similarity values so.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry I'm having problems here.",
                    "label": 0
                },
                {
                    "sent": "So the first thing that we wanted to study was to know if the if the.",
                    "label": 0
                },
                {
                    "sent": "If there was any correlation between the.",
                    "label": 0
                },
                {
                    "sent": "Similarity.",
                    "label": 0
                },
                {
                    "sent": "Beating quick sorry between the keyboard.",
                    "label": 0
                },
                {
                    "sent": "We wanted to know if there were there were some similar, some correlation between the word net similarity values and similarity values that we were obtained using the models.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for doing this we calculate the Pearson's coefficient of correlation which measure if there is a linear correspondence between 2 random variables.",
                    "label": 1
                },
                {
                    "sent": "We found that in this that basically the models both vector space model and LDA model based on Members were more correlated to.",
                    "label": 0
                },
                {
                    "sent": "The gene and content distant anwan palmar similarity.",
                    "label": 0
                },
                {
                    "sent": "Also, that vector space model based on the other two type of users were correlated, so we were looking for an explanation to this situation and we decided to calculate the average GNC distance and the one on average one polymer similarity.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "So what we found was that actually the models based on member members.",
                    "label": 0
                },
                {
                    "sent": "Have the shortest GL and content distance, which means that the keywords are more related and also the highest similarity of 1 polymer.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In addition, we decided to categorize all the relation that we had found according to the path length of connecting the two keywords in Word net.",
                    "label": 0
                },
                {
                    "sent": "And we found that the models based on members, especially LDA, was able to find the highest number of synonyms.",
                    "label": 0
                },
                {
                    "sent": "And also of of his relationship.",
                    "label": 0
                },
                {
                    "sent": "However, most of the relationship that we found half a length of the path connecting the corresponding since it's in Word net.",
                    "label": 0
                },
                {
                    "sent": "Greater than three.",
                    "label": 0
                },
                {
                    "sent": "So for those relationships, most of the time they were connected through an intermediate instead, which is known as a common sub summer.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to analyze.",
                    "label": 0
                },
                {
                    "sent": "Also, to study this relationship with decided to use to measure the depth of the least common sub summer environment and also they measure the path length connecting the two synsets as indicators of the specificity of the relationships.",
                    "label": 1
                },
                {
                    "sent": "So in this chart we are depicting the numbers of relations in Wordnet according to the depth of the least common sub summer in the Wordnet Synset hierarchy.",
                    "label": 0
                },
                {
                    "sent": "Again, the comments of summer is just the the common superclass to given synsets.",
                    "label": 0
                },
                {
                    "sent": "So what we what we found here was the vector space model based on subscriber.",
                    "label": 0
                },
                {
                    "sent": "Was the model producing the highest number of relationships according to the the depth of the least common sense?",
                    "label": 0
                },
                {
                    "sent": "We were talking about almost 40% of the relationship.",
                    "label": 0
                },
                {
                    "sent": "Has the depth of this scene set between 5:00 and 6:00.",
                    "label": 0
                },
                {
                    "sent": "So then we measured the average path length of this kind of relationships.",
                    "label": 0
                },
                {
                    "sent": "Again, we found that the vector space model was finding the highest number of relations of relationships with the length between 10:00 and 4:00.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To summarize, we have shown that similarity models based on members produce results which are correlated to similarity measures based on word, NET and also.",
                    "label": 1
                },
                {
                    "sent": "That these models finds more synonyms and direct relations is a relation when compared to the other models.",
                    "label": 1
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "We have found also that the majority of the relation between the keyword have a path length greater than, greater than or equal to three in the sense that hierarchy and they involve a common sub summer.",
                    "label": 0
                },
                {
                    "sent": "And that if we use the tip of the least common sub summer, we can say that the vector space model based on subscriber produces the highest number of specific relationship according to that criteria.",
                    "label": 0
                },
                {
                    "sent": "And finally, that similarity models based on curators produce a lower number of relationship.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So continue continuing with our experiment.",
                    "label": 0
                },
                {
                    "sent": "We also pose some sparkle queries to find relationship between the related keywords that we were obtaining from the classification system.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we did was just first they the two related keywords and anchor them two resources in the pedia.",
                    "label": 0
                },
                {
                    "sent": "We were able to anchor almost 64% of those keywords and then we start to search for possible relations with the sparkle queries.",
                    "label": 0
                },
                {
                    "sent": "So in this chart, basically we are confirming the findings that we have found using warning that the models based on Members produce the highest number of synonyms and also of direct relations under the vector space model based on subscribers produce the highest number of indirect relations with the length of the path connecting the keywords of three.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we decided to use a knowledge base is published as linked data.",
                    "label": 0
                },
                {
                    "sent": "Because of the limitation of Wordnet Synset hierarchy.",
                    "label": 0
                },
                {
                    "sent": "Where we have mostly lexical relations, but in the knowledge bases we have other kind of relationships.",
                    "label": 0
                },
                {
                    "sent": "And according to this we characterized the type of relationship that we were finding between the keywords and in the case of the vector space model based on member.",
                    "label": 0
                },
                {
                    "sent": "Most of the relationships, that of the direct direct relationship where broader term or so class of.",
                    "label": 0
                },
                {
                    "sent": "I hear we can see some examples such as life science is a broader term for biotech or that writers are subclasses.",
                    "label": 0
                },
                {
                    "sent": "So class of authors.",
                    "label": 0
                },
                {
                    "sent": "For in the other, in the case of the vector space model based on subscriber, we watched the model finding a high guess higher highest number of relationships with a pattern of three.",
                    "label": 0
                },
                {
                    "sent": "We found that most of the.",
                    "label": 0
                },
                {
                    "sent": "Relationships, I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Followed two patterns.",
                    "label": 0
                },
                {
                    "sent": "The first pattern is where the two relationships are siblings.",
                    "label": 0
                },
                {
                    "sent": "Since they charge a common superclass for a common object.",
                    "label": 0
                },
                {
                    "sent": "Also, when the keywords were connected connected to an individual.",
                    "label": 0
                },
                {
                    "sent": "Because the two keyword keywords were object properties of that individual.",
                    "label": 0
                },
                {
                    "sent": "So with respect to the first pattern, most of the relationships where Typeof and subclass of an example we have, the Nokia and Intel related.",
                    "label": 0
                },
                {
                    "sent": "They both are companies.",
                    "label": 0
                },
                {
                    "sent": "And with respect to the second pattern, the number of object properties which were setting up or making up the connection between the keywords was wider.",
                    "label": 0
                },
                {
                    "sent": "If I can say that.",
                    "label": 0
                },
                {
                    "sent": "We have properties like occupation, general, product, industry and so on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's important to note that this kind of relations is not possible to find any Internet.",
                    "label": 0
                },
                {
                    "sent": "But through the use of the instances of the knowledge basis published as Lincoln data, it is possible.",
                    "label": 0
                },
                {
                    "sent": "For example, here we have some authors like Adam Maxwell.",
                    "label": 0
                },
                {
                    "sent": "Without his occupation is being a writer, and the general is fiction like that.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to finalize my presentation and I would say that we have presented different models to obtain related keywords from Twitter lists.",
                    "label": 1
                },
                {
                    "sent": "Those models are based on the different user roles that are participating in this new classification system.",
                    "label": 0
                },
                {
                    "sent": "Basically we used to model vector space model and LDA and that we characterize the semantic of those relationships using similarity measures based on word NET.",
                    "label": 0
                },
                {
                    "sent": "Honest particle queries over some link data.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "With respect to the findings, models based on members produce Moscow related assault to those of word net similarity measures since they have the shortest jianren contract distance and the higest one polymer similarity.",
                    "label": 1
                },
                {
                    "sent": "That according to Wordnet.",
                    "label": 0
                },
                {
                    "sent": "Also modeled by some members can be used to obtain the highest number of synonyms and direct is relationship.",
                    "label": 1
                },
                {
                    "sent": "And that most of their relations have a baffling greater than or equal to three.",
                    "label": 0
                },
                {
                    "sent": "An involve Commons of summer.",
                    "label": 1
                },
                {
                    "sent": "And if we take into account the depth of the least common sub summary in the Wordnet Synset hierarchy, we can say that the vector space model based on subscribers find the highest number of relations.",
                    "label": 0
                },
                {
                    "sent": "Finally, that we confirm these results using knowledge bases as.",
                    "label": 0
                },
                {
                    "sent": "They published us link datasets.",
                    "label": 0
                },
                {
                    "sent": "So that's all there had to say.",
                    "label": 0
                },
                {
                    "sent": "I have a small question regarding your similarity measure.",
                    "label": 0
                },
                {
                    "sent": "M So in your case use like word net and also remote knowledge base is like an idiot.",
                    "label": 0
                },
                {
                    "sent": "Datasets from the linked Open data cloud.",
                    "label": 0
                },
                {
                    "sent": "Yes, so did you ever maybe also considering uses like personal knowledge bases?",
                    "label": 0
                },
                {
                    "sent": "Where maybe you could populate them from either crawled your crawl device, users called device or also from social accounts, or in order to find maybe better information and to relate like to get better relations because you know, like external knowledge basis sometimes can't contain your personal relations, so you cannot always find everything there, but you should take into account that we are using the knowledge bases.",
                    "label": 0
                },
                {
                    "sent": "To.",
                    "label": 0
                },
                {
                    "sent": "Just to study their relations that we are obtaining from the classification from the from the Twitter list.",
                    "label": 0
                },
                {
                    "sent": "So yeah, you see another kind of knowledge basis, maybe can help us to identify another type of relationships.",
                    "label": 0
                },
                {
                    "sent": "But basically the result.",
                    "label": 0
                },
                {
                    "sent": "But my message is that we are using this knowledge basis to understand what can we obtain from Twitter list.",
                    "label": 0
                },
                {
                    "sent": "OK, so yes we can use some other some other knowledge.",
                    "label": 0
                },
                {
                    "sent": "Base is an analyze.",
                    "label": 0
                },
                {
                    "sent": "What can we obtain if we can obtain something more from from from the classification system?",
                    "label": 0
                },
                {
                    "sent": "Alright, so I I think I understand your approach in the sense that they actually are using what similarity obtained by Wordnet, another kind of resource as Golden standard.",
                    "label": 0
                },
                {
                    "sent": "That which you can compare what you can get by idea is to use state of the art similarity measures to evaluate.",
                    "label": 0
                },
                {
                    "sent": "What can you think so.",
                    "label": 0
                },
                {
                    "sent": "So my question is more about did you try to understand why the models that we derived based on members are better compared to those based on creator or subscriber?",
                    "label": 0
                },
                {
                    "sent": "This is just a matter of number.",
                    "label": 0
                },
                {
                    "sent": "Numbers, for example, number of creator are fewer than a number of members and therefore probably size matter or them.",
                    "label": 0
                },
                {
                    "sent": "We were trying to understand why we got this results for reason.",
                    "label": 0
                },
                {
                    "sent": "In the case of curators, which are the users that provide like less related keywords.",
                    "label": 0
                },
                {
                    "sent": "We were we realized that it was a question of scarcity because we have curators, but most of them they just have two or three lists.",
                    "label": 0
                },
                {
                    "sent": "In our data set, so it was a problem of data connecting to the morning keynote.",
                    "label": 0
                },
                {
                    "sent": "Do you have any ideas about how to use the your findings?",
                    "label": 0
                },
                {
                    "sent": "Like yes.",
                    "label": 0
                },
                {
                    "sent": "Yes, actually this this research is started.",
                    "label": 0
                },
                {
                    "sent": "Like it is searching for for false ennemies at the beginning with full tsunami is start to appear.",
                    "label": 0
                },
                {
                    "sent": "Everybody was like very excited.",
                    "label": 0
                },
                {
                    "sent": "What can we do with this and everybody started to.",
                    "label": 0
                },
                {
                    "sent": "I mean researchers start to propose like different techniques to try to obtain some knowledge from false enemy.",
                    "label": 0
                },
                {
                    "sent": "But what happened?",
                    "label": 0
                },
                {
                    "sent": "Those techniques were a doc.",
                    "label": 0
                },
                {
                    "sent": "Basically everybody was proposing some structure and some similarity measure to obtain related keywords.",
                    "label": 0
                },
                {
                    "sent": "So after two or three years.",
                    "label": 0
                },
                {
                    "sent": "Of research sample soname.",
                    "label": 0
                },
                {
                    "sent": "Somebody say OK we have to do.",
                    "label": 0
                },
                {
                    "sent": "An analysis to characterize what information actually you can obtain from false ennemies.",
                    "label": 0
                },
                {
                    "sent": "So our idea with this work is OK if somehow you want to exploit to benefit of the knowledge that is in code in this classification system, which you should know what you can expect of that information, you know you can obtain some synonyms not too much.",
                    "label": 0
                },
                {
                    "sent": "You can obtain some direct is a relationship, but at least we're telling you what you can obtain.",
                    "label": 0
                },
                {
                    "sent": "With these two models.",
                    "label": 0
                },
                {
                    "sent": "Focusing on the on the term emergent in your title, do you have you thought about analyzing different snapshots of different lists overtime to see how the application of these two models changes in terms of the types of similarities and relationships that you could discover?",
                    "label": 1
                },
                {
                    "sent": "Do we honest not.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "How sorry how is it an emergency?",
                    "label": 0
                },
                {
                    "sent": "OK, the emergent they made it.",
                    "label": 0
                },
                {
                    "sent": "Yeah of course.",
                    "label": 0
                },
                {
                    "sent": "Now the emerging the title of emerging semantic is because of the interaction of the individual classification of user.",
                    "label": 0
                },
                {
                    "sent": "When you are grouping them, something is emerging.",
                    "label": 0
                },
                {
                    "sent": "A classification system.",
                    "label": 0
                },
                {
                    "sent": "So it's like a merging conceptualizations around some user classification individual classification, and that's why the emerging thinking my so.",
                    "label": 0
                },
                {
                    "sent": "Assuming you look at the same lists or in six months time, do you expect to find more relationships?",
                    "label": 0
                },
                {
                    "sent": "Do you expect to find some of the relationships invalidated?",
                    "label": 0
                },
                {
                    "sent": "What would be your intuition about how this model would evolve?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "There's somebody tough questions because that depends on the user characteristics.",
                    "label": 0
                },
                {
                    "sent": "Some people is more static, some people just goes to Twitter to get information about.",
                    "label": 0
                },
                {
                    "sent": "I don't know professional activities, some other goals be 'cause I gotta keep updated with friends information so I don't have an answer for that.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}