{
    "id": "msojugphg6euakr2g3444pvagsxrmogx",
    "title": "Feasibility of using Deflectograph data to review drainage network in the UK",
    "info": {
        "author": [
            "Morteza Zohrabi, InterRoute"
        ],
        "published": "Dec. 4, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Business->Transportation and Logistics->Infrastructure"
        ]
    },
    "url": "http://videolectures.net/surf08_zohrabi_mosco/",
    "segmentation": [
        [
            "Good afternoon ladies and gentlemen.",
            "It's a bit unusual, subject perhaps, but it's one of those subjects that.",
            "From practitioners POV, it's quite important because it doesn't require any knew data.",
            "It uses data.",
            "Every payment management system has, and it's the deposit Ori, so we're trying to make a better sense out of the existing data to see whether there is any correlation between.",
            "What happens under the road?",
            "But through some hypothesis in terms of drainage issues and using existing paint?"
        ],
        [
            "Data.",
            "Write it the work involves Area 2 harbors.",
            "Agency area is divided into 14 areas and Area 2 as your seats in the Southwest of England.",
            "I operated sort of our five yearly commissions plus 1 + 2 year extension.",
            "That's area too.",
            "Ha.",
            "It's about two 2007."
        ],
        [
            "Glen kilometres off motorways and trunk roads.",
            "This this presentation mainly involves trunk roads.",
            "Which has been evolved sort of over the over the years or the last, let's say fifty 6070 years from single tracks to sort of a two Lane or more roads.",
            "So the the there is an inconsistent, perhaps construction across the whole carriage."
        ],
        [
            "Right while we undertaking this work, we feel that drainage is one of the key factors that can compromise the integrity of payment asset.",
            "It is very important to identify if you have any drain failures before they reach the surface.",
            "And also that once they reached the surface, sometimes the failures are catastrophic.",
            "They require long delays and traffic disruptions, but the key message that comes out of this study is to understand if if you have any drainage issues, perhaps you could plan the maintenance that the problem isn't going to go away, but allows you to plan the maintenance over your forward program.",
            "Let's say 510 year.",
            "And so from this study, if successful, allows you to develop a drainage network review process that could be audited.",
            "Right, the hypothesis is works on the fact that."
        ],
        [
            "Most of you trunk roads you drainage system you drains or subsurface carry drains are located on the you're near side wheel track or off the carriage way, but if there is a problem from the.",
            "Trains or failures.",
            "Normally that problem would affect your near side will track more than your offsite we'll track.",
            "There are some exceptions, is not always the case that you have drains under the new side wheel track, but the hypothesis works on the idea that if the drains are on EU new side wheel track.",
            "Deflect graph on the other hand, the current deflector graphs allow you to measure deflections on 2 profiles, one on their side, one offsite.",
            "We'll track so the idea is whether there's any correlation between failures, or could be failures in your drains or any associated.",
            "Perhaps your technical problems landslips, and like that if there's a problem, you should really see higher deflections and your near sight will track.",
            "Unless the problem is being caused by something totally different anyway, that's the hypothesis.",
            "From the variation in deflections, we're hoping to identify whether there's any linkage between that variation and drainage issues.",
            "Right advantage is one of the targets we have nationally in the UK CCT."
        ],
        [
            "Surveys are quite expensive.",
            "Normally within Hybris Agency network, the target for all the managing agents is to duty Stevie survey over 10% of the network.",
            "Now if we can identify from this process any burning issues or any areas that are.",
            "Problematic.",
            "At least you could target your system for surveys to those areas.",
            "In the short term, you may need more funding to address it, but at least in long term it has advantages.",
            "And as I said earlier, it allows you better planning or future maintenance.",
            "Put a philosophical question.",
            "Therefore, philosophers do you want to know if you have problems before the problems appear on the surface, but you could answer that by perhaps better understanding of your future maintenance.",
            "Right to put this hypothesis to test, I've chosen 3 case studies.",
            "It is just a start."
        ],
        [
            "Of the study.",
            "We've looked at three case studies or fully flexible pavements that we know we have drainage schemes.",
            "In those payment areas as well as we've confirmed from the GPR surveys that they are possible moisture, proper ingress is on the foundation, so we've looked at the deflection profiles and then identify any certain trends or variations, and then we follow.",
            "The idea is to for for these three case studies.",
            "We've also looked at payment investigation data because they are.",
            "Payment renewal schemes.",
            "We were able to look at other factors, including surface surface measurements, from tracks as well as scoring or dynamic conference prompter and follow it effect on testing."
        ],
        [
            "Right this particular first case study it's a single carriageway normally carries.",
            "It's not very heavy traffic, it's about 1520 thousand vehicles a day, sort of a 10% heavy traffic.",
            "It's a two way Chunk wrote, some links have got positive drains and some roads haven't.",
            "Normally this sort with water you've got a stream here.",
            "Water flows through the stream, it gets flooded, runs onto the pavement, and then goes across the payment and then drops down to stream down below.",
            "And this is streamed the way the stream has been set up the the local farmer he is allowed allowed the water to come right on the foundation and then jeopardize the foundation.",
            "So this is one of the classical cases that you do have.",
            "Some drainage problems.",
            "Now if you look at this as a sort of a schematics of the defects, these lines, I mean this particular area you have."
        ],
        [
            "Near side wheel track cracking offside will track cracking or sort of a alligator cracking.",
            "You've got often joins.",
            "You've got transverse cracking so.",
            "It takes all day long term.",
            "This is this is over a long section, but Luckily when you look at the deflection profiles you could pick up some certain trends in any of these areas.",
            "Now the reason I've chosen this particular site.",
            "The fact that water enters allegedly enters the payment foundation through these nice hot wheel tracks.",
            "So if there is, if there's a drainage here.",
            "The payment responds ideally should be near side deflection should be higher.",
            "On the other hand, if you get an open joint depending on whether the water flows, display the camber of the road is towards the westbound carriageway then this could also affect your offside wheel track."
        ],
        [
            "This is the.",
            "Deflection profile we've averaged to remove the sort of a lot of oscillations we've averaged over 5 moving data every 510 meters, so it's over 25.",
            "You could say meters.",
            "We have put the data together.",
            "This particular case, for example, from change 600 to 780.",
            "And from 1002 nearly 1200, we have no drains.",
            "We have no drains at the same time.",
            "You find a very high deflection on the new side wheel tracks, so the water is able to get to the verge and then enter the foundation.",
            "You have a marked increase in the near side wheel track."
        ],
        [
            "So you have to bear with me or you'll see a lot of these graphs, but I'll try to run through them.",
            "It's just to put the hypothesis to test on the eastbound casual again from 2000, two 1300 to 2700 in this area.",
            "Please have no drains an from 3200 to 3500.",
            "We have no drains clearly.",
            "In both cases you have sort of a higher deflections on the near side.",
            "We'll track then offsite.",
            "We'll track.",
            "From 3300 from there also, not only you don't have drains, but you also have centerline cracking.",
            "One thing that you find the thought deflections are quite high, but the water has affected perhaps the nice side will track more than the upside will track.",
            "We haven't put too much effort into going into detail of these deflections.",
            "After all, this is just to put the general hypothesis."
        ],
        [
            "Test.",
            "On the westbound carriageway you have, we have got central line as I said earlier, the 33 to 3800, we have centerline cracking as you see you have the centerline cracking.",
            "Consider the level of deflection here all of a sudden both nearsighted and offside we'll track is showing high deflections.",
            "But you find here that the offside will check all of a sudden is showing higher deflections perhaps.",
            "Could be because of the centerline joint cracking, so obviously there is certain linkage or you would understand this is.",
            "Common sense, perhaps that if you have problem with the pavement and if the foundation is being compromised, then you should see a weakness in the foundation, hence higher deflection deflection."
        ],
        [
            "That was the first case.",
            "Studies second case study.",
            "This is also another case that you've got.",
            "Uh.",
            "Lunch doodle cracking.",
            "Alligator cracking along the side wheel track.",
            "You got poor drainage water ponds on the road for sort of prolonged period.",
            "Do you rain heavy rain?",
            "This is a better case."
        ],
        [
            "Study because you've got there one long from changes.",
            "500 to use it all the way to 1212 hundred.",
            "You've got nice side alligator cracking all day along the pavement.",
            "We've got also open joint.",
            "Old way along an in such areas.",
            "Not only were open join, we also got alligator cracking on the off side wheel track.",
            "Bye bye mean.",
            "That's eastbound, that's westbound, so we all wish we traveling the opposite side of the road in the UK.",
            "So you have to."
        ],
        [
            "Keep that in mind.",
            "On the.",
            "Because of the, if you look at the, the quieter distinct trend in the uniside, we'll track cracking.",
            "You see a distinct pattern there by the new side.",
            "Will we track?",
            "Deflection is constantly higher than the outside wheel track, so in this particular case.",
            "You'll find that the knee side we'll track as I offside we'll track has has got a sort of a uniform deflections long.",
            "The longer several 100 meters of the road.",
            "For example, from 9 in this particular area.",
            "We have no the only.",
            "Steven, chilling the only drainage we have is in this this particular area, of which out of the 550 four 100 meters already failed and need replacement, so obviously.",
            "Because of the lack lack of drains or perhaps failure of the drains all of a sudden you offside wheel track is also showing higher deflections, so not having drains perhaps is less.",
            "Yeah.",
            "Dangerous than perhaps having drains that have failed means that they directly, well they direct the floor to the pavement.",
            "On the westbound carriageway we've got this, there's a certain."
        ],
        [
            "Different pattern here on the westbound carriageway.",
            "OK, westbound couch way you're offside.",
            "Wheel Track is a lot weaker.",
            "Don't forget that in this particular area we had, we had open joint all the way along.",
            "You know Siri joint cracking from 1000 to 1200.",
            "Perhaps the offside will track has been weakened by the water entering the entering the foundation through the center line join.",
            "Who knows, perhaps."
        ],
        [
            "A third case study, as you see, roads gets flooded.",
            "I mean, this is that this is a trunk wrote in Gloucestershire.",
            "It's got extensive surface disintegration.",
            "We've got substantial, sort of a localized new site cracking, and obviously this is a particular drainage issue.",
            "We have a known drainage scheme within in the middle of this payment renewal scheme, but flooding and heavy rain require a lot of emergency call outs."
        ],
        [
            "This is this is obviously this is, by the way, the vision sort of a on carriage way walked survey that you get from the Highways Agency pavement management system.",
            "In this particular case you find lot of carriage way cracking.",
            "In certain areas.",
            "That the defect has reached the payment foundation and you get mud pumping as well in particular areas.",
            "So we get their stuff, patches, patches have failed.",
            "And this catchweight surface defective is your.",
            "Natural or general fretting and traveling."
        ],
        [
            "But again, here on the eastbound carriage way you have near side will check tracking some patches on Patch failures and recent patches there, and the same on the westbound carriageway."
        ],
        [
            "Now on the westbound carriageway first it said one thing that you see that the offside wheel track.",
            "Generally shows a constant response.",
            "Could it mean that the offside will track is still dry with all that water that collects on the surface, but all of a sudden you find that nearside wheel track there's nearly five more than five times.",
            "The upside will track deflections that in half mutual half a millimeter of deflection is quite quite high in the visual item.",
            "That means that that has negative residual life craft.",
            "I.",
            "We have a schema change in this particular area box push.",
            "The door gets flooded constantly, so offside wheel track is also being weakened.",
            "There's a sort of a lot of things going on in that particular area."
        ],
        [
            "On the eastbound carriage way.",
            "The behavior is very volatile.",
            "Obviously in this particular area we have some drainage, some with drain, some without drains.",
            "But the effect of all that water, prolonged and prolonged rain that collects in the pavement obviously affects the payment in the foundation.",
            "Different way what is obvious is that you have high deflections on the near side effect compared to your offside will track."
        ],
        [
            "At the this is sort of a 6 kilometer long scheme in this particular area.",
            "Offside will track deflections are high.",
            "Compared to the rest of the area, and in this particular.",
            "From changes, let's say the just after 3702 or 5000.",
            "We haven't had any maintenance scheme in the past, so the road is as it was constructed.",
            "Sort of a 30 years ago.",
            "Perhaps some of these deflections?",
            "High deflections are due to old age payment involved Rd who knows, so it's still being looked at."
        ],
        [
            "Right, what have we learned from all of this?",
            "We we think that.",
            "There there is a.",
            "There is a certain.",
            "There is a certain correlation between what we find from the from the deflections and perhaps drainage issues on the pavement.",
            "Now we're trying to use historic data.",
            "One thing that about Deflective results.",
            "People who use deflector results for maintenance schemes.",
            "Normally the data is as good as you collected within the year after year.",
            "You probably get another survey done.",
            "But for the purpose of purposes of this particular study, it doesn't matter.",
            "Have all the data is we intend to use the data for the last 10 years because you're always comparing one wheel track against another wheel track.",
            "In effect, if there is a certain pattern we're trying to identify this pattern, and how best this hypothesis could be used to develop a an auditable process for identifying locations that.",
            "Have general drainage issues.",
            "So the idea is to download all your deflection data into a single spreadsheet.",
            "Choose for a for a given route, and then put some averages so you don't deal with too much data at once.",
            "One quick one thing that's quite important when you deal with deflection results considering the.",
            "State of our trunk Rd network is to also look at geometry data.",
            "Becausw if you.",
            "If this is the sort of downloaded data, what we've done."
        ],
        [
            "We've looked at deflections that on the knee side, we've had more than twice the upside.",
            "We have highlighted area as a arbitrary area that you find deflections are high, but in this.",
            "Second column.",
            "Areas that are perhaps less than 3.2, three point 3 meters.",
            "Lane Width VR discounting because if you consider that you deflector graph is about 2.4 meters wide and you've got a 3 meter wide carriage way, it could be that the load deflections you read on the knee side wheel track is in because of the problems you have with the pavement.",
            "But because the road is so narrow that the near side will have deflections are being picked up from the verge rather than payment itself, so there's an impact from that's coming from the verge, so.",
            "For this particular study.",
            "We're trying to remove the data and only consider data from the sort of a wide carriage base to see whether it would work so.",
            "Dictator that there is a sort of a degree of."
        ],
        [
            "Data within the within this study.",
            "Now the challenge is to identify and separate those in terms of the.",
            "At your technical issues, we have a few technical management system that through GIS visualization you could identify where you got your technical issues.",
            "You could discount those from the study if you got a narrowed you can discount that from the study and you could also play with averaging to remove the volatility due to perhaps localized issues like dollies.",
            "From the review."
        ],
        [
            "And then if you imagine you've identified in a large spreadsheet for different sections, where you find that all these hotspots that possibly have drainage issues, the idea is that from a simple drive through you may be able to rule out some of the bogus sites, and then the size that you think that you might have genuine drainage issues that there's a possibility too.",
            "Then do further detailed investigations, but there is one important fact that allows you to identify where you should do.",
            "You see Steve surveys.",
            "Currently the agents in the UK?",
            "They start from one end of network.",
            "They do 10%, see Stevie, and then it takes 10 years to get full inventory.",
            "This way it allows you to target your drainage susceptible areas and then that way you could plan your maintenance.",
            "On a forward program basis.",
            "One of the.",
            "In conclusion, we feel that there is a."
        ],
        [
            "Link between what happens in your payment foundation, which may or may not be related to drainage and the results response you get from deflections on deflector off surveys.",
            "That obviously there are some anomalies due to perhaps.",
            "If you the assumptions you make on very logical drains are if you drain all of a sudden runs on the center of the center of your carriage way, and you have a problem which may be a problem, then you might have narrowed.",
            "You might have sort of weakness of the near side wheel track.",
            "You might have failures in the drained running through the centre.",
            "Obviously there there there there are special cases in this whole review, but nonetheless it is a process that.",
            "Agents could use in order to identify at least some areas that they could target their drainage schemes before they even commented surface.",
            "It is it is a hit rate.",
            "May not be very high.",
            "We still putting that in the desktop study looking at all the results of different schemes.",
            "But from the more detailed review.",
            "Maybe a simple drive through in the rain to identify the areas that you may or may not have drainage problems of water ponding.",
            "You could rule out some of these sites.",
            "That allows you to target these bit more cleverly.",
            "I.",
            "We are considering some other also options, for example using."
        ],
        [
            "In the large internal profile variance data field at 10 meter or 30 meter or different.",
            "Averaging values may be linked to local localized your technical issues.",
            "You could rule rule those out because the same data you choose on the sections in terms of deflector half.",
            "You could also watch for download your tracks data from that all your LPV data could be run in parallel.",
            "From that you could rule out if there are any areas that might have other adjoining problems.",
            "I.",
            "We feel that a one off server, one off review like this is necessary on the network before your before they.",
            "Sort of the heavies of the world come and do the traffic speed, deflect ometer traffic speed deflector graph.",
            "They flipped ometer testing on the whole network wide basis.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good afternoon ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "It's a bit unusual, subject perhaps, but it's one of those subjects that.",
                    "label": 0
                },
                {
                    "sent": "From practitioners POV, it's quite important because it doesn't require any knew data.",
                    "label": 0
                },
                {
                    "sent": "It uses data.",
                    "label": 0
                },
                {
                    "sent": "Every payment management system has, and it's the deposit Ori, so we're trying to make a better sense out of the existing data to see whether there is any correlation between.",
                    "label": 0
                },
                {
                    "sent": "What happens under the road?",
                    "label": 0
                },
                {
                    "sent": "But through some hypothesis in terms of drainage issues and using existing paint?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data.",
                    "label": 0
                },
                {
                    "sent": "Write it the work involves Area 2 harbors.",
                    "label": 0
                },
                {
                    "sent": "Agency area is divided into 14 areas and Area 2 as your seats in the Southwest of England.",
                    "label": 1
                },
                {
                    "sent": "I operated sort of our five yearly commissions plus 1 + 2 year extension.",
                    "label": 1
                },
                {
                    "sent": "That's area too.",
                    "label": 0
                },
                {
                    "sent": "Ha.",
                    "label": 0
                },
                {
                    "sent": "It's about two 2007.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Glen kilometres off motorways and trunk roads.",
                    "label": 0
                },
                {
                    "sent": "This this presentation mainly involves trunk roads.",
                    "label": 0
                },
                {
                    "sent": "Which has been evolved sort of over the over the years or the last, let's say fifty 6070 years from single tracks to sort of a two Lane or more roads.",
                    "label": 0
                },
                {
                    "sent": "So the the there is an inconsistent, perhaps construction across the whole carriage.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right while we undertaking this work, we feel that drainage is one of the key factors that can compromise the integrity of payment asset.",
                    "label": 1
                },
                {
                    "sent": "It is very important to identify if you have any drain failures before they reach the surface.",
                    "label": 0
                },
                {
                    "sent": "And also that once they reached the surface, sometimes the failures are catastrophic.",
                    "label": 1
                },
                {
                    "sent": "They require long delays and traffic disruptions, but the key message that comes out of this study is to understand if if you have any drainage issues, perhaps you could plan the maintenance that the problem isn't going to go away, but allows you to plan the maintenance over your forward program.",
                    "label": 0
                },
                {
                    "sent": "Let's say 510 year.",
                    "label": 1
                },
                {
                    "sent": "And so from this study, if successful, allows you to develop a drainage network review process that could be audited.",
                    "label": 0
                },
                {
                    "sent": "Right, the hypothesis is works on the fact that.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Most of you trunk roads you drainage system you drains or subsurface carry drains are located on the you're near side wheel track or off the carriage way, but if there is a problem from the.",
                    "label": 0
                },
                {
                    "sent": "Trains or failures.",
                    "label": 0
                },
                {
                    "sent": "Normally that problem would affect your near side will track more than your offsite we'll track.",
                    "label": 0
                },
                {
                    "sent": "There are some exceptions, is not always the case that you have drains under the new side wheel track, but the hypothesis works on the idea that if the drains are on EU new side wheel track.",
                    "label": 0
                },
                {
                    "sent": "Deflect graph on the other hand, the current deflector graphs allow you to measure deflections on 2 profiles, one on their side, one offsite.",
                    "label": 1
                },
                {
                    "sent": "We'll track so the idea is whether there's any correlation between failures, or could be failures in your drains or any associated.",
                    "label": 1
                },
                {
                    "sent": "Perhaps your technical problems landslips, and like that if there's a problem, you should really see higher deflections and your near sight will track.",
                    "label": 1
                },
                {
                    "sent": "Unless the problem is being caused by something totally different anyway, that's the hypothesis.",
                    "label": 0
                },
                {
                    "sent": "From the variation in deflections, we're hoping to identify whether there's any linkage between that variation and drainage issues.",
                    "label": 0
                },
                {
                    "sent": "Right advantage is one of the targets we have nationally in the UK CCT.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Surveys are quite expensive.",
                    "label": 0
                },
                {
                    "sent": "Normally within Hybris Agency network, the target for all the managing agents is to duty Stevie survey over 10% of the network.",
                    "label": 0
                },
                {
                    "sent": "Now if we can identify from this process any burning issues or any areas that are.",
                    "label": 0
                },
                {
                    "sent": "Problematic.",
                    "label": 0
                },
                {
                    "sent": "At least you could target your system for surveys to those areas.",
                    "label": 0
                },
                {
                    "sent": "In the short term, you may need more funding to address it, but at least in long term it has advantages.",
                    "label": 1
                },
                {
                    "sent": "And as I said earlier, it allows you better planning or future maintenance.",
                    "label": 0
                },
                {
                    "sent": "Put a philosophical question.",
                    "label": 0
                },
                {
                    "sent": "Therefore, philosophers do you want to know if you have problems before the problems appear on the surface, but you could answer that by perhaps better understanding of your future maintenance.",
                    "label": 0
                },
                {
                    "sent": "Right to put this hypothesis to test, I've chosen 3 case studies.",
                    "label": 0
                },
                {
                    "sent": "It is just a start.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the study.",
                    "label": 0
                },
                {
                    "sent": "We've looked at three case studies or fully flexible pavements that we know we have drainage schemes.",
                    "label": 1
                },
                {
                    "sent": "In those payment areas as well as we've confirmed from the GPR surveys that they are possible moisture, proper ingress is on the foundation, so we've looked at the deflection profiles and then identify any certain trends or variations, and then we follow.",
                    "label": 1
                },
                {
                    "sent": "The idea is to for for these three case studies.",
                    "label": 0
                },
                {
                    "sent": "We've also looked at payment investigation data because they are.",
                    "label": 0
                },
                {
                    "sent": "Payment renewal schemes.",
                    "label": 0
                },
                {
                    "sent": "We were able to look at other factors, including surface surface measurements, from tracks as well as scoring or dynamic conference prompter and follow it effect on testing.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right this particular first case study it's a single carriageway normally carries.",
                    "label": 0
                },
                {
                    "sent": "It's not very heavy traffic, it's about 1520 thousand vehicles a day, sort of a 10% heavy traffic.",
                    "label": 0
                },
                {
                    "sent": "It's a two way Chunk wrote, some links have got positive drains and some roads haven't.",
                    "label": 0
                },
                {
                    "sent": "Normally this sort with water you've got a stream here.",
                    "label": 0
                },
                {
                    "sent": "Water flows through the stream, it gets flooded, runs onto the pavement, and then goes across the payment and then drops down to stream down below.",
                    "label": 0
                },
                {
                    "sent": "And this is streamed the way the stream has been set up the the local farmer he is allowed allowed the water to come right on the foundation and then jeopardize the foundation.",
                    "label": 0
                },
                {
                    "sent": "So this is one of the classical cases that you do have.",
                    "label": 0
                },
                {
                    "sent": "Some drainage problems.",
                    "label": 0
                },
                {
                    "sent": "Now if you look at this as a sort of a schematics of the defects, these lines, I mean this particular area you have.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Near side wheel track cracking offside will track cracking or sort of a alligator cracking.",
                    "label": 0
                },
                {
                    "sent": "You've got often joins.",
                    "label": 0
                },
                {
                    "sent": "You've got transverse cracking so.",
                    "label": 0
                },
                {
                    "sent": "It takes all day long term.",
                    "label": 0
                },
                {
                    "sent": "This is this is over a long section, but Luckily when you look at the deflection profiles you could pick up some certain trends in any of these areas.",
                    "label": 0
                },
                {
                    "sent": "Now the reason I've chosen this particular site.",
                    "label": 0
                },
                {
                    "sent": "The fact that water enters allegedly enters the payment foundation through these nice hot wheel tracks.",
                    "label": 0
                },
                {
                    "sent": "So if there is, if there's a drainage here.",
                    "label": 0
                },
                {
                    "sent": "The payment responds ideally should be near side deflection should be higher.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if you get an open joint depending on whether the water flows, display the camber of the road is towards the westbound carriageway then this could also affect your offside wheel track.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the.",
                    "label": 0
                },
                {
                    "sent": "Deflection profile we've averaged to remove the sort of a lot of oscillations we've averaged over 5 moving data every 510 meters, so it's over 25.",
                    "label": 0
                },
                {
                    "sent": "You could say meters.",
                    "label": 0
                },
                {
                    "sent": "We have put the data together.",
                    "label": 0
                },
                {
                    "sent": "This particular case, for example, from change 600 to 780.",
                    "label": 1
                },
                {
                    "sent": "And from 1002 nearly 1200, we have no drains.",
                    "label": 1
                },
                {
                    "sent": "We have no drains at the same time.",
                    "label": 1
                },
                {
                    "sent": "You find a very high deflection on the new side wheel tracks, so the water is able to get to the verge and then enter the foundation.",
                    "label": 0
                },
                {
                    "sent": "You have a marked increase in the near side wheel track.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you have to bear with me or you'll see a lot of these graphs, but I'll try to run through them.",
                    "label": 0
                },
                {
                    "sent": "It's just to put the hypothesis to test on the eastbound casual again from 2000, two 1300 to 2700 in this area.",
                    "label": 0
                },
                {
                    "sent": "Please have no drains an from 3200 to 3500.",
                    "label": 1
                },
                {
                    "sent": "We have no drains clearly.",
                    "label": 1
                },
                {
                    "sent": "In both cases you have sort of a higher deflections on the near side.",
                    "label": 0
                },
                {
                    "sent": "We'll track then offsite.",
                    "label": 0
                },
                {
                    "sent": "We'll track.",
                    "label": 0
                },
                {
                    "sent": "From 3300 from there also, not only you don't have drains, but you also have centerline cracking.",
                    "label": 0
                },
                {
                    "sent": "One thing that you find the thought deflections are quite high, but the water has affected perhaps the nice side will track more than the upside will track.",
                    "label": 0
                },
                {
                    "sent": "We haven't put too much effort into going into detail of these deflections.",
                    "label": 0
                },
                {
                    "sent": "After all, this is just to put the general hypothesis.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Test.",
                    "label": 0
                },
                {
                    "sent": "On the westbound carriageway you have, we have got central line as I said earlier, the 33 to 3800, we have centerline cracking as you see you have the centerline cracking.",
                    "label": 1
                },
                {
                    "sent": "Consider the level of deflection here all of a sudden both nearsighted and offside we'll track is showing high deflections.",
                    "label": 1
                },
                {
                    "sent": "But you find here that the offside will check all of a sudden is showing higher deflections perhaps.",
                    "label": 0
                },
                {
                    "sent": "Could be because of the centerline joint cracking, so obviously there is certain linkage or you would understand this is.",
                    "label": 0
                },
                {
                    "sent": "Common sense, perhaps that if you have problem with the pavement and if the foundation is being compromised, then you should see a weakness in the foundation, hence higher deflection deflection.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That was the first case.",
                    "label": 0
                },
                {
                    "sent": "Studies second case study.",
                    "label": 0
                },
                {
                    "sent": "This is also another case that you've got.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Lunch doodle cracking.",
                    "label": 0
                },
                {
                    "sent": "Alligator cracking along the side wheel track.",
                    "label": 1
                },
                {
                    "sent": "You got poor drainage water ponds on the road for sort of prolonged period.",
                    "label": 1
                },
                {
                    "sent": "Do you rain heavy rain?",
                    "label": 0
                },
                {
                    "sent": "This is a better case.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Study because you've got there one long from changes.",
                    "label": 0
                },
                {
                    "sent": "500 to use it all the way to 1212 hundred.",
                    "label": 0
                },
                {
                    "sent": "You've got nice side alligator cracking all day along the pavement.",
                    "label": 0
                },
                {
                    "sent": "We've got also open joint.",
                    "label": 0
                },
                {
                    "sent": "Old way along an in such areas.",
                    "label": 0
                },
                {
                    "sent": "Not only were open join, we also got alligator cracking on the off side wheel track.",
                    "label": 0
                },
                {
                    "sent": "Bye bye mean.",
                    "label": 0
                },
                {
                    "sent": "That's eastbound, that's westbound, so we all wish we traveling the opposite side of the road in the UK.",
                    "label": 0
                },
                {
                    "sent": "So you have to.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Keep that in mind.",
                    "label": 0
                },
                {
                    "sent": "On the.",
                    "label": 0
                },
                {
                    "sent": "Because of the, if you look at the, the quieter distinct trend in the uniside, we'll track cracking.",
                    "label": 0
                },
                {
                    "sent": "You see a distinct pattern there by the new side.",
                    "label": 0
                },
                {
                    "sent": "Will we track?",
                    "label": 0
                },
                {
                    "sent": "Deflection is constantly higher than the outside wheel track, so in this particular case.",
                    "label": 1
                },
                {
                    "sent": "You'll find that the knee side we'll track as I offside we'll track has has got a sort of a uniform deflections long.",
                    "label": 0
                },
                {
                    "sent": "The longer several 100 meters of the road.",
                    "label": 0
                },
                {
                    "sent": "For example, from 9 in this particular area.",
                    "label": 0
                },
                {
                    "sent": "We have no the only.",
                    "label": 0
                },
                {
                    "sent": "Steven, chilling the only drainage we have is in this this particular area, of which out of the 550 four 100 meters already failed and need replacement, so obviously.",
                    "label": 1
                },
                {
                    "sent": "Because of the lack lack of drains or perhaps failure of the drains all of a sudden you offside wheel track is also showing higher deflections, so not having drains perhaps is less.",
                    "label": 1
                },
                {
                    "sent": "Yeah.",
                    "label": 1
                },
                {
                    "sent": "Dangerous than perhaps having drains that have failed means that they directly, well they direct the floor to the pavement.",
                    "label": 0
                },
                {
                    "sent": "On the westbound carriageway we've got this, there's a certain.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Different pattern here on the westbound carriageway.",
                    "label": 1
                },
                {
                    "sent": "OK, westbound couch way you're offside.",
                    "label": 0
                },
                {
                    "sent": "Wheel Track is a lot weaker.",
                    "label": 0
                },
                {
                    "sent": "Don't forget that in this particular area we had, we had open joint all the way along.",
                    "label": 0
                },
                {
                    "sent": "You know Siri joint cracking from 1000 to 1200.",
                    "label": 1
                },
                {
                    "sent": "Perhaps the offside will track has been weakened by the water entering the entering the foundation through the center line join.",
                    "label": 0
                },
                {
                    "sent": "Who knows, perhaps.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A third case study, as you see, roads gets flooded.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is that this is a trunk wrote in Gloucestershire.",
                    "label": 0
                },
                {
                    "sent": "It's got extensive surface disintegration.",
                    "label": 1
                },
                {
                    "sent": "We've got substantial, sort of a localized new site cracking, and obviously this is a particular drainage issue.",
                    "label": 1
                },
                {
                    "sent": "We have a known drainage scheme within in the middle of this payment renewal scheme, but flooding and heavy rain require a lot of emergency call outs.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this is obviously this is, by the way, the vision sort of a on carriage way walked survey that you get from the Highways Agency pavement management system.",
                    "label": 0
                },
                {
                    "sent": "In this particular case you find lot of carriage way cracking.",
                    "label": 0
                },
                {
                    "sent": "In certain areas.",
                    "label": 0
                },
                {
                    "sent": "That the defect has reached the payment foundation and you get mud pumping as well in particular areas.",
                    "label": 0
                },
                {
                    "sent": "So we get their stuff, patches, patches have failed.",
                    "label": 0
                },
                {
                    "sent": "And this catchweight surface defective is your.",
                    "label": 0
                },
                {
                    "sent": "Natural or general fretting and traveling.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But again, here on the eastbound carriage way you have near side will check tracking some patches on Patch failures and recent patches there, and the same on the westbound carriageway.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now on the westbound carriageway first it said one thing that you see that the offside wheel track.",
                    "label": 0
                },
                {
                    "sent": "Generally shows a constant response.",
                    "label": 0
                },
                {
                    "sent": "Could it mean that the offside will track is still dry with all that water that collects on the surface, but all of a sudden you find that nearside wheel track there's nearly five more than five times.",
                    "label": 0
                },
                {
                    "sent": "The upside will track deflections that in half mutual half a millimeter of deflection is quite quite high in the visual item.",
                    "label": 1
                },
                {
                    "sent": "That means that that has negative residual life craft.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "We have a schema change in this particular area box push.",
                    "label": 0
                },
                {
                    "sent": "The door gets flooded constantly, so offside wheel track is also being weakened.",
                    "label": 0
                },
                {
                    "sent": "There's a sort of a lot of things going on in that particular area.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the eastbound carriage way.",
                    "label": 0
                },
                {
                    "sent": "The behavior is very volatile.",
                    "label": 1
                },
                {
                    "sent": "Obviously in this particular area we have some drainage, some with drain, some without drains.",
                    "label": 0
                },
                {
                    "sent": "But the effect of all that water, prolonged and prolonged rain that collects in the pavement obviously affects the payment in the foundation.",
                    "label": 0
                },
                {
                    "sent": "Different way what is obvious is that you have high deflections on the near side effect compared to your offside will track.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the this is sort of a 6 kilometer long scheme in this particular area.",
                    "label": 0
                },
                {
                    "sent": "Offside will track deflections are high.",
                    "label": 0
                },
                {
                    "sent": "Compared to the rest of the area, and in this particular.",
                    "label": 1
                },
                {
                    "sent": "From changes, let's say the just after 3702 or 5000.",
                    "label": 0
                },
                {
                    "sent": "We haven't had any maintenance scheme in the past, so the road is as it was constructed.",
                    "label": 0
                },
                {
                    "sent": "Sort of a 30 years ago.",
                    "label": 0
                },
                {
                    "sent": "Perhaps some of these deflections?",
                    "label": 0
                },
                {
                    "sent": "High deflections are due to old age payment involved Rd who knows, so it's still being looked at.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, what have we learned from all of this?",
                    "label": 0
                },
                {
                    "sent": "We we think that.",
                    "label": 0
                },
                {
                    "sent": "There there is a.",
                    "label": 0
                },
                {
                    "sent": "There is a certain.",
                    "label": 0
                },
                {
                    "sent": "There is a certain correlation between what we find from the from the deflections and perhaps drainage issues on the pavement.",
                    "label": 0
                },
                {
                    "sent": "Now we're trying to use historic data.",
                    "label": 0
                },
                {
                    "sent": "One thing that about Deflective results.",
                    "label": 0
                },
                {
                    "sent": "People who use deflector results for maintenance schemes.",
                    "label": 1
                },
                {
                    "sent": "Normally the data is as good as you collected within the year after year.",
                    "label": 0
                },
                {
                    "sent": "You probably get another survey done.",
                    "label": 0
                },
                {
                    "sent": "But for the purpose of purposes of this particular study, it doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "Have all the data is we intend to use the data for the last 10 years because you're always comparing one wheel track against another wheel track.",
                    "label": 0
                },
                {
                    "sent": "In effect, if there is a certain pattern we're trying to identify this pattern, and how best this hypothesis could be used to develop a an auditable process for identifying locations that.",
                    "label": 0
                },
                {
                    "sent": "Have general drainage issues.",
                    "label": 0
                },
                {
                    "sent": "So the idea is to download all your deflection data into a single spreadsheet.",
                    "label": 1
                },
                {
                    "sent": "Choose for a for a given route, and then put some averages so you don't deal with too much data at once.",
                    "label": 0
                },
                {
                    "sent": "One quick one thing that's quite important when you deal with deflection results considering the.",
                    "label": 0
                },
                {
                    "sent": "State of our trunk Rd network is to also look at geometry data.",
                    "label": 0
                },
                {
                    "sent": "Becausw if you.",
                    "label": 0
                },
                {
                    "sent": "If this is the sort of downloaded data, what we've done.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We've looked at deflections that on the knee side, we've had more than twice the upside.",
                    "label": 1
                },
                {
                    "sent": "We have highlighted area as a arbitrary area that you find deflections are high, but in this.",
                    "label": 0
                },
                {
                    "sent": "Second column.",
                    "label": 0
                },
                {
                    "sent": "Areas that are perhaps less than 3.2, three point 3 meters.",
                    "label": 0
                },
                {
                    "sent": "Lane Width VR discounting because if you consider that you deflector graph is about 2.4 meters wide and you've got a 3 meter wide carriage way, it could be that the load deflections you read on the knee side wheel track is in because of the problems you have with the pavement.",
                    "label": 0
                },
                {
                    "sent": "But because the road is so narrow that the near side will have deflections are being picked up from the verge rather than payment itself, so there's an impact from that's coming from the verge, so.",
                    "label": 0
                },
                {
                    "sent": "For this particular study.",
                    "label": 0
                },
                {
                    "sent": "We're trying to remove the data and only consider data from the sort of a wide carriage base to see whether it would work so.",
                    "label": 0
                },
                {
                    "sent": "Dictator that there is a sort of a degree of.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data within the within this study.",
                    "label": 0
                },
                {
                    "sent": "Now the challenge is to identify and separate those in terms of the.",
                    "label": 0
                },
                {
                    "sent": "At your technical issues, we have a few technical management system that through GIS visualization you could identify where you got your technical issues.",
                    "label": 0
                },
                {
                    "sent": "You could discount those from the study if you got a narrowed you can discount that from the study and you could also play with averaging to remove the volatility due to perhaps localized issues like dollies.",
                    "label": 0
                },
                {
                    "sent": "From the review.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then if you imagine you've identified in a large spreadsheet for different sections, where you find that all these hotspots that possibly have drainage issues, the idea is that from a simple drive through you may be able to rule out some of the bogus sites, and then the size that you think that you might have genuine drainage issues that there's a possibility too.",
                    "label": 1
                },
                {
                    "sent": "Then do further detailed investigations, but there is one important fact that allows you to identify where you should do.",
                    "label": 0
                },
                {
                    "sent": "You see Steve surveys.",
                    "label": 0
                },
                {
                    "sent": "Currently the agents in the UK?",
                    "label": 0
                },
                {
                    "sent": "They start from one end of network.",
                    "label": 0
                },
                {
                    "sent": "They do 10%, see Stevie, and then it takes 10 years to get full inventory.",
                    "label": 0
                },
                {
                    "sent": "This way it allows you to target your drainage susceptible areas and then that way you could plan your maintenance.",
                    "label": 0
                },
                {
                    "sent": "On a forward program basis.",
                    "label": 0
                },
                {
                    "sent": "One of the.",
                    "label": 0
                },
                {
                    "sent": "In conclusion, we feel that there is a.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Link between what happens in your payment foundation, which may or may not be related to drainage and the results response you get from deflections on deflector off surveys.",
                    "label": 1
                },
                {
                    "sent": "That obviously there are some anomalies due to perhaps.",
                    "label": 0
                },
                {
                    "sent": "If you the assumptions you make on very logical drains are if you drain all of a sudden runs on the center of the center of your carriage way, and you have a problem which may be a problem, then you might have narrowed.",
                    "label": 1
                },
                {
                    "sent": "You might have sort of weakness of the near side wheel track.",
                    "label": 0
                },
                {
                    "sent": "You might have failures in the drained running through the centre.",
                    "label": 0
                },
                {
                    "sent": "Obviously there there there there are special cases in this whole review, but nonetheless it is a process that.",
                    "label": 1
                },
                {
                    "sent": "Agents could use in order to identify at least some areas that they could target their drainage schemes before they even commented surface.",
                    "label": 1
                },
                {
                    "sent": "It is it is a hit rate.",
                    "label": 1
                },
                {
                    "sent": "May not be very high.",
                    "label": 0
                },
                {
                    "sent": "We still putting that in the desktop study looking at all the results of different schemes.",
                    "label": 0
                },
                {
                    "sent": "But from the more detailed review.",
                    "label": 0
                },
                {
                    "sent": "Maybe a simple drive through in the rain to identify the areas that you may or may not have drainage problems of water ponding.",
                    "label": 0
                },
                {
                    "sent": "You could rule out some of these sites.",
                    "label": 0
                },
                {
                    "sent": "That allows you to target these bit more cleverly.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "We are considering some other also options, for example using.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the large internal profile variance data field at 10 meter or 30 meter or different.",
                    "label": 1
                },
                {
                    "sent": "Averaging values may be linked to local localized your technical issues.",
                    "label": 0
                },
                {
                    "sent": "You could rule rule those out because the same data you choose on the sections in terms of deflector half.",
                    "label": 1
                },
                {
                    "sent": "You could also watch for download your tracks data from that all your LPV data could be run in parallel.",
                    "label": 1
                },
                {
                    "sent": "From that you could rule out if there are any areas that might have other adjoining problems.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 1
                },
                {
                    "sent": "We feel that a one off server, one off review like this is necessary on the network before your before they.",
                    "label": 1
                },
                {
                    "sent": "Sort of the heavies of the world come and do the traffic speed, deflect ometer traffic speed deflector graph.",
                    "label": 1
                },
                {
                    "sent": "They flipped ometer testing on the whole network wide basis.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}