{
    "id": "mzyex4nzg2mf6iuqi52amgmgpv3hxfte",
    "title": "Practical Experience with Regional Climate Change related Capacity Building in CEE and SEE",
    "info": {
        "author": [
            "Zsuzsanna Ivanyi, Regional Environmental Center for Central and Eastern Europe"
        ],
        "published": "June 21, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Environment->Climate Change"
        ]
    },
    "url": "http://videolectures.net/ccandun2010_ivanyi_perc/",
    "segmentation": [
        [
            "Our next speaker comes from Hungary, Mrs. Susana Ivane and say OK and she will present practical experience with regional climate change and related capacity.",
            "Building is region, so Madame Chair, ladies and gentlemen, it's my pleasure to be here.",
            "Thank you very much for the organizers to have invited us and to give you a brief introduction what we are doing in Hungary in the original.",
            "Environmental Center when we."
        ],
        [
            "Talking about climate change in the morning, we heard several times that the objectives of climate protection is very much in line.",
            "Can I little bit move on, I change.",
            "It's OK now.",
            "So when we're talking about climate change, it's very much related to the objectives of sustainability and the issue of sustainable development is very much in focus recently, everywhere in the world, or so in the Central European region.",
            "The issue of the system development is closely related.",
            "The capacity of our globe simply, if we produce the same amount, we continue the same consumption patterns and we don't change our behavior and lifestyle.",
            "It can be easily forecasted that by 2050 we would need two planets to have a normal life in the Earth, which of course cannot be accepted.",
            "What?"
        ],
        [
            "Maybe that's why you should definitely not this one.",
            "What you can see on this picture."
        ],
        [
            "I would rather propose to be proactive, taking urgent actions both on policy level and an indie individual level.",
            "The politicians responsibility to mitigate climate change and to grafter measures policies to make the adaptation possible.",
            "But we individuals also had a lot of things to do and first of all we should change your consumption patterns and for this it's.",
            "Really important requisite to enhance education and awareness raising on climate change and sustainable development.",
            "It's also very important to develop further this so called bottom up approach that we individuals on the citizens level, the civil society and I didn't put here, but I would also mention the role of science.",
            "We should have really strong push on the decision makers.",
            "In the last cope I heard several times that the decision makers that negotiators were not happy with the science.",
            "Basically, there is a gap between the cyantific communication and the political editions, so this is one thing what I would like to mention that in the future much more emphasis on the is to be put on not only educating scientists, but to teach them how to communicate the results for the decision makers.",
            "This is really existing gap, not only in the region but everywhere in the world, because if science."
        ],
        [
            "Just a tad truth.",
            "The reality.",
            "Maybe it's a little bit are not so easily digestible for the politicians, so we have to find the right way how to communicate the scientific results.",
            "Some words about my organization, the original Environmental Center is an international non for profit non advocacy organization which was established in 1990 by the initiative of the senior US President.",
            "Send your Bush US President in 1990, and by the initiative of the European Commission on the map, you can see or beneficiary countries.",
            "So we have country offices in 17 countries starting from the Baltic countries, so Central Europe, Southeast Europe and also Turkey is part of 1."
        ],
        [
            "At work.",
            "What we are doing.",
            "We are trying to make bridges not only on cross border cooperation but within different stakeholders.",
            "Direct is acting as a bridge between the governments, NGOs, the local governments which are very important stakeholder parts, the businesses and."
        ],
        [
            "Citizens as well.",
            "So what we do?",
            "The mission of the Regional Environmental Center was from the very beginning to promote the access to free exchange of information to promote the access for information for the individuals, for the citizens and also to enhance the dialogue between different stakeholders and also to help people.",
            "Public participation to take active role in the decision making process."
        ],
        [
            "The Regional Environmental Center has different topic areas.",
            "One of them is the climate change and I try to list here the main directions of the climate change activities.",
            "We have three main directions.",
            "One is for question, got mitigation mostly on policy level.",
            "What kind of policies would be needed and also we made some studies in Stanton Eastern Europe that what are the potential for mitigation on most cost effective way.",
            "The other main area is the adaptation which covers usually all of the sectors and I would mention that according to the IPCC Force Assessment Report, this region is one of the most vulnerable from the point of view of adaptations as far as this question.",
            "But I understand the response that's from other areas.",
            "Maybe it's not so vulnerable than 4 foot climate change, but we hope that at least Albania will have some benefits from this junior fellowship programs and the sort of activity is why I'm here is Article six of the United Nations Fairburn conventional climate change, which is related to education training at awareness raising, and about 1/3 of our activities is really focusing on these type of things."
        ],
        [
            "Article six of the convention stipulates the promotion of education, training and awareness raising, and it also identified the main priority areas, which includes educational programs at primary and secondary levels.",
            "It also includes public awareness campaigns, public access to relevant information, enhance public participation in environmental decision-making process, is training of experts and also strengthening the international and subregional cooperation.",
            "The Regional Environmental Center is recognized regional focal point of Article 6 and utilizing this Monday we prepared an action plan for.",
            "Central Eastern Europe.",
            "What we seeing that very important for the region?",
            "We identified the main elements has broad areas."
        ],
        [
            "We plan and we also we ordered contribute to different educational programs.",
            "We also have the plan to enhance the governmental knowledge in the field of climate change because usually stuff for ministry of environments are already quite knowledgeable because they have longer experience than tradition dealing with climate change.",
            "But climate change is very complicated and many signed issue which needs not only Ministry of environmental people but different ministries cooperation and.",
            "In collaboration, so for this reason, with seeing that it's also an important element.",
            "I also think that the regional aspects of all these activities should be strengths and good and best practices have to be shared and transferred.",
            "Also as a mandate of the rack we try to support the access to climate related information and we also have public awareness raising campaigns and also we find it very important to promote scientific results in the region.",
            "And finally to assure a broader.",
            "Public participation in the climate related."
        ],
        [
            "No sources.",
            "We think that education and awareness raising is extremely important of the climate problem because direct strategies to combat climate change mitigation, which is mostly focusing on the energy sector as the most powerful sector through energy efficiency measures and renewable energies expansion.",
            "But this is only the peak of the eyes and Nine 1 ninth of the.",
            "Or no 9/10 of the volume is under the water, so this is attitude and behavior which we find extremely crucial.",
            "And this is asking for the responsibility for all of us here to try to change many things in this area."
        ],
        [
            "And some examples about activities.",
            "We start with very young ages.",
            "This is 1 project which was just launched in April and this is a cartoon series for very young children from the age of four to seven and it's a nice cartoon which is focusing on energy conservation, renewable energy and sustainable and hopefully the cartoon will soon be available and accessible in many television channels in Europe.",
            "So I hope that you have chance to see and if you have kids or grandkids you might introduce this movie for them."
        ],
        [
            "Another in essential project what we had it already completed in title with Kyoto in the home.",
            "So cute or reverse of quoted the Kyoto Protocol, the mitigation targets, and the project was focusing on families, children that what can be done on individual level.",
            "Because the project's main concept is that adult can be very well educated through their children.",
            "So if the kids got some information from the school, they go home.",
            "Enter to the parents what's to be done so it's really a very nice and successful project and there was one elements which I particularly liked that there was a competition between examiner school students.",
            "How to design an eco city.",
            "It was a computer game and several schools from different parts of Central Europe took part and finally the best one was awarded was invited to.",
            "Chesterfield and they could produce what they've done and it was really nice.",
            "Nice event."
        ],
        [
            "The third example, what I would like to tell you, is the so called green pack.",
            "It's an educational toolkit developed by more organization which is for school children from the age of 8 and 12, and it's an interactive tool which provides with different type of information including system development, climate change, energy efficiency.",
            "It has so many interesting areas and at the moment.",
            "It was already completed in several languages.",
            "The first version was of course in English, and now we introduced several countries.",
            "14 countries already in the region, and we covered about 20,000 teachers and about 2 million students.",
            "Of course in each country and national language version was prepared and somehow the text was also modified depending on the country's character."
        ],
        [
            "Sticks.",
            "Another example is the cause for sustainable development.",
            "It's all I would say kind of regular program started about four or five years ago due to the fact that I mentioned that not only manisty up environmental government officials, but other ministries should be trained.",
            "So this program is specifically focusing on other ministerial officials.",
            "The Ministry of Environment and it has different components focusing on energy and climate change issues.",
            "So I would say it's also kind of interesting program which we already introduced in Southeast Europe sentence.",
            "You're pushing the black region and also in Kazakhstan, which is beyond our reach."
        ],
        [
            "And the last example, but I would like to mention you is the climate project which is going to happen most likely in the second half of 2010.",
            "The client's project is the initiative of Al Gore.",
            "We just saw some minutes ago him on the movie when receiving the more price the blonde lady who is shaking hands with Al Gore is or executive director and they already had an agreement that Al Gore will come to a region.",
            "Probably at the second half of this year, and we direct will assist him to organize this program so this is a plan.",
            "I hope that it will be fulfilled."
        ],
        [
            "So that was all from my side and I hope that we will act all before it's too late and the whole globe will not have the same bad fortune as the poor fog which is heated slowly, slowly and will not jump out because things that still has time.",
            "And finally it will be bored.",
            "I hope that we will avoid this kind of situation.",
            "Thank you very much.",
            "Thank you very much for the presentation.",
            "Any questions, comments?",
            "Actually I have a question how what is official language?",
            "Without this publication?",
            "You do it in English.",
            "Or do you try to focus on national languages because you are talking about small children?",
            "I don't presume that English is usually prepared.",
            "The first things in English because the official language of the organization is English, but I forgot to mention that we have country offices in 17 countries with local stuff and of course natural language is used.",
            "And whenever we prepare something for the specific country.",
            "It's on the national language, of course, otherwise it will not.",
            "But then this computer games you were talking about, this is most already done in all languages, the the competition.",
            "Yeah, yeah it was in English because it was the same for for all the schools and only those students participated could participate who could speak English because I know this is a dilemma we are facing all the time in the small countries in value way.",
            "It's more universal to have in English, but to really reach for the.",
            "Primary schools and kindergartens.",
            "I don't think that English is the best weight forward, but then you have 14 languages or whatever it is.",
            "But this is something that even with the IPCC when we always just follow the UN languages.",
            "Sometimes it's this national efforts may be nice to have it, you know, unless we try to mix it with the Organizer, Con contest among different countries.",
            "Of course we have to use a common language.",
            "But whenever prepare something specifically for a country, then we use the national language.",
            "So we try to combine OK.",
            "Thank you very much.",
            "Any other questions?",
            "Yes, please.",
            "Do you have information about how many countries have actually included sustainable development in their official education programs?",
            "In the region who I don't have information, unfortunately, no.",
            "I don't know any idea.",
            "Oh, I think the new Member States are developing quite rapidly, so I'm sure that the new Member States already have some.",
            "Maybe not a specific course, but somehow system development is included and I think also Serbia has very good educational programs.",
            "I am not sure about Turkey or some some other countries now we don't have information more since you have so much experience.",
            "How would you compare teaching sustainable development through official?",
            "Educational program with what you are doing as a.",
            "Organization which is outside let's say not into into the official educational system.",
            "We are not dealing with official education, so we don't have anything on on University or graduate level we work for for lower levels, for for schools or or grammar schools, and we try to educate already graduated people.",
            "So for us the University years are missing.",
            "So whenever we organizer training for four adult people, we already got the information that what is missing.",
            "We usually contact the climate, change focal points within the ministry and we received that advice.",
            "What is needed.",
            "So we are really searching what the country's needs are.",
            "Yes yes please.",
            "Midland has, but just this most suggesting referring to this issue of language using the language and teaching climate change in kindergartens.",
            "Perhaps you could combine another teaching climate change with teaching English step by step, and then you know you're in thank you very much.",
            "We will consider it.",
            "Thank you.",
            "It's excellent idea.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our next speaker comes from Hungary, Mrs. Susana Ivane and say OK and she will present practical experience with regional climate change and related capacity.",
                    "label": 1
                },
                {
                    "sent": "Building is region, so Madame Chair, ladies and gentlemen, it's my pleasure to be here.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the organizers to have invited us and to give you a brief introduction what we are doing in Hungary in the original.",
                    "label": 0
                },
                {
                    "sent": "Environmental Center when we.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talking about climate change in the morning, we heard several times that the objectives of climate protection is very much in line.",
                    "label": 0
                },
                {
                    "sent": "Can I little bit move on, I change.",
                    "label": 0
                },
                {
                    "sent": "It's OK now.",
                    "label": 0
                },
                {
                    "sent": "So when we're talking about climate change, it's very much related to the objectives of sustainability and the issue of sustainable development is very much in focus recently, everywhere in the world, or so in the Central European region.",
                    "label": 0
                },
                {
                    "sent": "The issue of the system development is closely related.",
                    "label": 1
                },
                {
                    "sent": "The capacity of our globe simply, if we produce the same amount, we continue the same consumption patterns and we don't change our behavior and lifestyle.",
                    "label": 1
                },
                {
                    "sent": "It can be easily forecasted that by 2050 we would need two planets to have a normal life in the Earth, which of course cannot be accepted.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe that's why you should definitely not this one.",
                    "label": 0
                },
                {
                    "sent": "What you can see on this picture.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would rather propose to be proactive, taking urgent actions both on policy level and an indie individual level.",
                    "label": 1
                },
                {
                    "sent": "The politicians responsibility to mitigate climate change and to grafter measures policies to make the adaptation possible.",
                    "label": 0
                },
                {
                    "sent": "But we individuals also had a lot of things to do and first of all we should change your consumption patterns and for this it's.",
                    "label": 0
                },
                {
                    "sent": "Really important requisite to enhance education and awareness raising on climate change and sustainable development.",
                    "label": 1
                },
                {
                    "sent": "It's also very important to develop further this so called bottom up approach that we individuals on the citizens level, the civil society and I didn't put here, but I would also mention the role of science.",
                    "label": 0
                },
                {
                    "sent": "We should have really strong push on the decision makers.",
                    "label": 0
                },
                {
                    "sent": "In the last cope I heard several times that the decision makers that negotiators were not happy with the science.",
                    "label": 0
                },
                {
                    "sent": "Basically, there is a gap between the cyantific communication and the political editions, so this is one thing what I would like to mention that in the future much more emphasis on the is to be put on not only educating scientists, but to teach them how to communicate the results for the decision makers.",
                    "label": 0
                },
                {
                    "sent": "This is really existing gap, not only in the region but everywhere in the world, because if science.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just a tad truth.",
                    "label": 0
                },
                {
                    "sent": "The reality.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's a little bit are not so easily digestible for the politicians, so we have to find the right way how to communicate the scientific results.",
                    "label": 0
                },
                {
                    "sent": "Some words about my organization, the original Environmental Center is an international non for profit non advocacy organization which was established in 1990 by the initiative of the senior US President.",
                    "label": 1
                },
                {
                    "sent": "Send your Bush US President in 1990, and by the initiative of the European Commission on the map, you can see or beneficiary countries.",
                    "label": 0
                },
                {
                    "sent": "So we have country offices in 17 countries starting from the Baltic countries, so Central Europe, Southeast Europe and also Turkey is part of 1.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At work.",
                    "label": 0
                },
                {
                    "sent": "What we are doing.",
                    "label": 0
                },
                {
                    "sent": "We are trying to make bridges not only on cross border cooperation but within different stakeholders.",
                    "label": 0
                },
                {
                    "sent": "Direct is acting as a bridge between the governments, NGOs, the local governments which are very important stakeholder parts, the businesses and.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Citizens as well.",
                    "label": 0
                },
                {
                    "sent": "So what we do?",
                    "label": 0
                },
                {
                    "sent": "The mission of the Regional Environmental Center was from the very beginning to promote the access to free exchange of information to promote the access for information for the individuals, for the citizens and also to enhance the dialogue between different stakeholders and also to help people.",
                    "label": 0
                },
                {
                    "sent": "Public participation to take active role in the decision making process.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Regional Environmental Center has different topic areas.",
                    "label": 0
                },
                {
                    "sent": "One of them is the climate change and I try to list here the main directions of the climate change activities.",
                    "label": 0
                },
                {
                    "sent": "We have three main directions.",
                    "label": 0
                },
                {
                    "sent": "One is for question, got mitigation mostly on policy level.",
                    "label": 1
                },
                {
                    "sent": "What kind of policies would be needed and also we made some studies in Stanton Eastern Europe that what are the potential for mitigation on most cost effective way.",
                    "label": 0
                },
                {
                    "sent": "The other main area is the adaptation which covers usually all of the sectors and I would mention that according to the IPCC Force Assessment Report, this region is one of the most vulnerable from the point of view of adaptations as far as this question.",
                    "label": 0
                },
                {
                    "sent": "But I understand the response that's from other areas.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's not so vulnerable than 4 foot climate change, but we hope that at least Albania will have some benefits from this junior fellowship programs and the sort of activity is why I'm here is Article six of the United Nations Fairburn conventional climate change, which is related to education training at awareness raising, and about 1/3 of our activities is really focusing on these type of things.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Article six of the convention stipulates the promotion of education, training and awareness raising, and it also identified the main priority areas, which includes educational programs at primary and secondary levels.",
                    "label": 1
                },
                {
                    "sent": "It also includes public awareness campaigns, public access to relevant information, enhance public participation in environmental decision-making process, is training of experts and also strengthening the international and subregional cooperation.",
                    "label": 0
                },
                {
                    "sent": "The Regional Environmental Center is recognized regional focal point of Article 6 and utilizing this Monday we prepared an action plan for.",
                    "label": 0
                },
                {
                    "sent": "Central Eastern Europe.",
                    "label": 0
                },
                {
                    "sent": "What we seeing that very important for the region?",
                    "label": 0
                },
                {
                    "sent": "We identified the main elements has broad areas.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We plan and we also we ordered contribute to different educational programs.",
                    "label": 0
                },
                {
                    "sent": "We also have the plan to enhance the governmental knowledge in the field of climate change because usually stuff for ministry of environments are already quite knowledgeable because they have longer experience than tradition dealing with climate change.",
                    "label": 0
                },
                {
                    "sent": "But climate change is very complicated and many signed issue which needs not only Ministry of environmental people but different ministries cooperation and.",
                    "label": 0
                },
                {
                    "sent": "In collaboration, so for this reason, with seeing that it's also an important element.",
                    "label": 0
                },
                {
                    "sent": "I also think that the regional aspects of all these activities should be strengths and good and best practices have to be shared and transferred.",
                    "label": 0
                },
                {
                    "sent": "Also as a mandate of the rack we try to support the access to climate related information and we also have public awareness raising campaigns and also we find it very important to promote scientific results in the region.",
                    "label": 1
                },
                {
                    "sent": "And finally to assure a broader.",
                    "label": 1
                },
                {
                    "sent": "Public participation in the climate related.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No sources.",
                    "label": 0
                },
                {
                    "sent": "We think that education and awareness raising is extremely important of the climate problem because direct strategies to combat climate change mitigation, which is mostly focusing on the energy sector as the most powerful sector through energy efficiency measures and renewable energies expansion.",
                    "label": 0
                },
                {
                    "sent": "But this is only the peak of the eyes and Nine 1 ninth of the.",
                    "label": 0
                },
                {
                    "sent": "Or no 9/10 of the volume is under the water, so this is attitude and behavior which we find extremely crucial.",
                    "label": 0
                },
                {
                    "sent": "And this is asking for the responsibility for all of us here to try to change many things in this area.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And some examples about activities.",
                    "label": 0
                },
                {
                    "sent": "We start with very young ages.",
                    "label": 0
                },
                {
                    "sent": "This is 1 project which was just launched in April and this is a cartoon series for very young children from the age of four to seven and it's a nice cartoon which is focusing on energy conservation, renewable energy and sustainable and hopefully the cartoon will soon be available and accessible in many television channels in Europe.",
                    "label": 1
                },
                {
                    "sent": "So I hope that you have chance to see and if you have kids or grandkids you might introduce this movie for them.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another in essential project what we had it already completed in title with Kyoto in the home.",
                    "label": 1
                },
                {
                    "sent": "So cute or reverse of quoted the Kyoto Protocol, the mitigation targets, and the project was focusing on families, children that what can be done on individual level.",
                    "label": 0
                },
                {
                    "sent": "Because the project's main concept is that adult can be very well educated through their children.",
                    "label": 0
                },
                {
                    "sent": "So if the kids got some information from the school, they go home.",
                    "label": 0
                },
                {
                    "sent": "Enter to the parents what's to be done so it's really a very nice and successful project and there was one elements which I particularly liked that there was a competition between examiner school students.",
                    "label": 0
                },
                {
                    "sent": "How to design an eco city.",
                    "label": 0
                },
                {
                    "sent": "It was a computer game and several schools from different parts of Central Europe took part and finally the best one was awarded was invited to.",
                    "label": 0
                },
                {
                    "sent": "Chesterfield and they could produce what they've done and it was really nice.",
                    "label": 0
                },
                {
                    "sent": "Nice event.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The third example, what I would like to tell you, is the so called green pack.",
                    "label": 1
                },
                {
                    "sent": "It's an educational toolkit developed by more organization which is for school children from the age of 8 and 12, and it's an interactive tool which provides with different type of information including system development, climate change, energy efficiency.",
                    "label": 0
                },
                {
                    "sent": "It has so many interesting areas and at the moment.",
                    "label": 0
                },
                {
                    "sent": "It was already completed in several languages.",
                    "label": 1
                },
                {
                    "sent": "The first version was of course in English, and now we introduced several countries.",
                    "label": 0
                },
                {
                    "sent": "14 countries already in the region, and we covered about 20,000 teachers and about 2 million students.",
                    "label": 1
                },
                {
                    "sent": "Of course in each country and national language version was prepared and somehow the text was also modified depending on the country's character.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sticks.",
                    "label": 0
                },
                {
                    "sent": "Another example is the cause for sustainable development.",
                    "label": 1
                },
                {
                    "sent": "It's all I would say kind of regular program started about four or five years ago due to the fact that I mentioned that not only manisty up environmental government officials, but other ministries should be trained.",
                    "label": 0
                },
                {
                    "sent": "So this program is specifically focusing on other ministerial officials.",
                    "label": 0
                },
                {
                    "sent": "The Ministry of Environment and it has different components focusing on energy and climate change issues.",
                    "label": 0
                },
                {
                    "sent": "So I would say it's also kind of interesting program which we already introduced in Southeast Europe sentence.",
                    "label": 0
                },
                {
                    "sent": "You're pushing the black region and also in Kazakhstan, which is beyond our reach.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the last example, but I would like to mention you is the climate project which is going to happen most likely in the second half of 2010.",
                    "label": 1
                },
                {
                    "sent": "The client's project is the initiative of Al Gore.",
                    "label": 0
                },
                {
                    "sent": "We just saw some minutes ago him on the movie when receiving the more price the blonde lady who is shaking hands with Al Gore is or executive director and they already had an agreement that Al Gore will come to a region.",
                    "label": 0
                },
                {
                    "sent": "Probably at the second half of this year, and we direct will assist him to organize this program so this is a plan.",
                    "label": 0
                },
                {
                    "sent": "I hope that it will be fulfilled.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that was all from my side and I hope that we will act all before it's too late and the whole globe will not have the same bad fortune as the poor fog which is heated slowly, slowly and will not jump out because things that still has time.",
                    "label": 0
                },
                {
                    "sent": "And finally it will be bored.",
                    "label": 0
                },
                {
                    "sent": "I hope that we will avoid this kind of situation.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the presentation.",
                    "label": 1
                },
                {
                    "sent": "Any questions, comments?",
                    "label": 0
                },
                {
                    "sent": "Actually I have a question how what is official language?",
                    "label": 0
                },
                {
                    "sent": "Without this publication?",
                    "label": 0
                },
                {
                    "sent": "You do it in English.",
                    "label": 0
                },
                {
                    "sent": "Or do you try to focus on national languages because you are talking about small children?",
                    "label": 0
                },
                {
                    "sent": "I don't presume that English is usually prepared.",
                    "label": 0
                },
                {
                    "sent": "The first things in English because the official language of the organization is English, but I forgot to mention that we have country offices in 17 countries with local stuff and of course natural language is used.",
                    "label": 0
                },
                {
                    "sent": "And whenever we prepare something for the specific country.",
                    "label": 0
                },
                {
                    "sent": "It's on the national language, of course, otherwise it will not.",
                    "label": 0
                },
                {
                    "sent": "But then this computer games you were talking about, this is most already done in all languages, the the competition.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah it was in English because it was the same for for all the schools and only those students participated could participate who could speak English because I know this is a dilemma we are facing all the time in the small countries in value way.",
                    "label": 0
                },
                {
                    "sent": "It's more universal to have in English, but to really reach for the.",
                    "label": 0
                },
                {
                    "sent": "Primary schools and kindergartens.",
                    "label": 0
                },
                {
                    "sent": "I don't think that English is the best weight forward, but then you have 14 languages or whatever it is.",
                    "label": 0
                },
                {
                    "sent": "But this is something that even with the IPCC when we always just follow the UN languages.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it's this national efforts may be nice to have it, you know, unless we try to mix it with the Organizer, Con contest among different countries.",
                    "label": 0
                },
                {
                    "sent": "Of course we have to use a common language.",
                    "label": 0
                },
                {
                    "sent": "But whenever prepare something specifically for a country, then we use the national language.",
                    "label": 0
                },
                {
                    "sent": "So we try to combine OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "Yes, please.",
                    "label": 0
                },
                {
                    "sent": "Do you have information about how many countries have actually included sustainable development in their official education programs?",
                    "label": 0
                },
                {
                    "sent": "In the region who I don't have information, unfortunately, no.",
                    "label": 0
                },
                {
                    "sent": "I don't know any idea.",
                    "label": 0
                },
                {
                    "sent": "Oh, I think the new Member States are developing quite rapidly, so I'm sure that the new Member States already have some.",
                    "label": 0
                },
                {
                    "sent": "Maybe not a specific course, but somehow system development is included and I think also Serbia has very good educational programs.",
                    "label": 0
                },
                {
                    "sent": "I am not sure about Turkey or some some other countries now we don't have information more since you have so much experience.",
                    "label": 0
                },
                {
                    "sent": "How would you compare teaching sustainable development through official?",
                    "label": 0
                },
                {
                    "sent": "Educational program with what you are doing as a.",
                    "label": 0
                },
                {
                    "sent": "Organization which is outside let's say not into into the official educational system.",
                    "label": 0
                },
                {
                    "sent": "We are not dealing with official education, so we don't have anything on on University or graduate level we work for for lower levels, for for schools or or grammar schools, and we try to educate already graduated people.",
                    "label": 0
                },
                {
                    "sent": "So for us the University years are missing.",
                    "label": 0
                },
                {
                    "sent": "So whenever we organizer training for four adult people, we already got the information that what is missing.",
                    "label": 0
                },
                {
                    "sent": "We usually contact the climate, change focal points within the ministry and we received that advice.",
                    "label": 0
                },
                {
                    "sent": "What is needed.",
                    "label": 0
                },
                {
                    "sent": "So we are really searching what the country's needs are.",
                    "label": 0
                },
                {
                    "sent": "Yes yes please.",
                    "label": 0
                },
                {
                    "sent": "Midland has, but just this most suggesting referring to this issue of language using the language and teaching climate change in kindergartens.",
                    "label": 0
                },
                {
                    "sent": "Perhaps you could combine another teaching climate change with teaching English step by step, and then you know you're in thank you very much.",
                    "label": 0
                },
                {
                    "sent": "We will consider it.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "It's excellent idea.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}