{
    "id": "n6gufzew7ftqhwdhrfgzwdrqtfhgwqcs",
    "title": "Representing Text – from characters to logic",
    "info": {
        "author": [
            "Dunja Mladenić, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "Sept. 12, 2011",
        "recorded": "August 2011",
        "category": [
            "Top->Computer Science->Natural Language Processing"
        ]
    },
    "url": "http://videolectures.net/esslli2011_mladenic_characters/",
    "segmentation": [
        [
            "I'm very grateful to the organizers for inviting me.",
            "It's really pleasure to be here, so I will try to give you more like an overview and motivate you to start thinking about different ways, how we can represent text and why, and how can that be connected to logic, and it's some.",
            "I'll show some demos, which is work of performed in our group, but also.",
            "I'll at the end give a hint on our current research direction, where I can't yet show much results, but just to give you an idea."
        ],
        [
            "So first I'll motivate.",
            "Like trying to convince you that representation is important, then we look at different levels of text representation and I'll show demos and then just do."
        ],
        [
            "Include so for motivation.",
            "When modeling the data.",
            "When we use machine learning, there are two major steps.",
            "One is how do we represent the data.",
            "So we have to do this site.",
            "What are the features?",
            "How do we describe our examples in the data and the other step is modeling itself where there is a combination of statistics and optimization.",
            "So typically people when they use machine learning methods, they do modeling well.",
            "They choose some algorithm and do it, but what really matters is good representation because it was shown that when we use good representation of the data, which means there need to be some understanding at least of the domain.",
            "And even if the algorithm is not the best one, we usually obtain better results than using state of the art.",
            "Great algorithm, but poor representation.",
            "And you could imagine why, because in representation actually capture properties of the data and then algorithm sees the data only through the representation we give it.",
            "You can imagine it as a glasses if your glasses are dirty.",
            "You can't see much out of them, right?"
        ],
        [
            "So to motivate, let me just briefly remind you on document categorization.",
            "What is it?",
            "So imagine we have a collection of documents and they're labeled.",
            "It can be labeled in user proper link that can be labeled as interesting documents for the user, and not interesting in document categorization by topic.",
            "It can be labeled by content like easy to document about language.",
            "Is it a document about?",
            "Economix is document about sports and so on, so we have this collection of documents.",
            "They are labeled and then we use machine learning methods to generate a model, A model then then is capable of classifying knew documents which are not labeled and assigning them a label.",
            "And of course before giving these documents to machine learning or in the process there is some preprocessing to be performed and there is also some representation of the documents of the text to happen.",
            "Which is really what matters.",
            "Then how we do that?"
        ],
        [
            "So let me show you a short demo.",
            "Just to argue for importance.",
            "Of the document representation and representation on text in general, so this is.",
            "One of the well known algorithms for classification called support vector machines, and it has a property that you can use different so called kernels, which is basically how the algorithm then sees your data.",
            "So you can imagine this is a kind of representation issue.",
            "How we change the representation.",
            "So let me just imagine we have some data points, so these are of one class label.",
            "Maybe these are not interesting for our user and here are some other data points interesting for the user.",
            "And for the purpose of demo, this all happens in two dimensions, so we have kind of two feature values.",
            "So this point has this value for one feature and this value for another feature.",
            "And this feature point has the other value.",
            "So if I use linear kernel, I can pretty well separate these two sets of documents if these are documents interesting and uninteresting for the user, because you know all the previously you could see they are nicely separated.",
            "There is nice distance and we can see.",
            "That is fairly simple problem.",
            "Well, I can have a little bit different problem.",
            "Where the points are not so nicely separated so they are a little bit spread around.",
            "And I can try using linear.",
            "Colonel, and it does some job."
        ],
        [
            "But if I use polynomial kernel, the job is much better.",
            "So depending how difficult is the problem, I should adjust what I'm using.",
            "Which data representation?",
            "And if we look into a more complicated problem.",
            "Where the data is actually placed as a X or problem that some of you might know.",
            "Then using just linear separation.",
            "Wouldn't do much."
        ],
        [
            "You can see the separate.",
            "The separation is not really great because it's saying this is one class on this side.",
            "This is another class on this side which is really not true."
        ],
        [
            "If I use more complicated representation using Gaussian kernel then I get in this case a great model.",
            "So I hope this motivates a little bit this argument which I'm trying to sell you.",
            "That representation really matters.",
            "And when we face and your problem, it's important to think about what do I want to say."
        ],
        [
            "And what am I doing?"
        ],
        [
            "So if we think about key parody comes when we do data analysis, we can say that there are the three key.",
            "Views one is model driven which is so called top down approach.",
            "Which means there is a model which is provided by human and then we try to somehow fit the data to that model.",
            "Another approach is data driven, which is used bottom up approach which is used in example which I was just showing in machine learning where there is a data and we have some vague class of models and then we try to build a model based on the data based on the evidence we have.",
            "And then there is collaborative approach which is getting more and more popular, which is can be said to be socially driven where we have a large amount of people, each contributing a small amount of information.",
            "But then all put together.",
            "We get actually a good result."
        ],
        [
            "So in this view, let's just briefly remember a metaphor of blind people trying to describe how what is 1 elephant.",
            "And if we imagine they're touching it from different parts, different sites, and each of them has different explanation, what is an elephant?",
            "Assuming they don't move so the one touching the tail is just touching details like oh it's a rope, right?",
            "And the one touching body says it's a big wall."
        ],
        [
            "And with this we can think about this as a text processing which really needs if you want to do the job well.",
            "I believe it needs research, different research areas to contribute their methods, so it needs some computational linguistics to cover language, some Community contribution, some semantic web for interoperability, text mining to get scale and analytics.",
            "Machine learning to cover statistics information retrieval to cover search.",
            "Some mappings covered by machine translation and probably also some other, but basically my main message here is if you want to do good job with text processing, don't be narrowminded, think about what can help me to solve the job.",
            "How can I represent the problem and then use whatever you need?",
            "You don't need to use your favorite algorithm and tried to convince everyone that's the best solution."
        ],
        [
            "Just, you know, be open minded as usual in Life OK so going to a more specific explanation on text representation.",
            "This is 1 possible, not the only one and you know the best one division of different kind of text representation that I used around in research so some of them are more kind of lexical, summer, more syntactic and some are more semantic.",
            "But there is of course overlap so it's not so strict as I'm showing here.",
            "So it goes from character level when you really think about engrams of characters like 234 letters.",
            "Word level representation and then about we can use phrases which can be either consecutive words or awards which have some proximity features, have some holes in between them when they occur in sentences.",
            "We can have part of speech tags we can use also some taxonomies to zaurus.",
            "Like word net.",
            "Vector space model.",
            "I'll tell a little bit more about some of them.",
            "Not all later language models parsing cross modality, collaborative tagging link data using templates or frames and using ontologies or first."
        ],
        [
            "So their logic and each of the representation was used or is used because there are some problems which can be solved by using that representation.",
            "So character representation was shown to be useful for language identification, copying, detection.",
            "Part of speech tagging, of course, is useful for name entity extraction.",
            "Vector space model is a very typical representation used for document categorization, document clustering, summarization, visualization.",
            "Language models have been shown to be you very useful in machine translation, also in spam filtering with emails.",
            "Cross modality is useful if we have data which has for instance images and then associated text with images or video and then associated text or some other data.",
            "Or in multilingual search when we have data text in different languages.",
            "If you want to get semantics of the data together, we can use collaborative tagging for data integration.",
            "Linked data is used ontologies.",
            "Further 1st order theories if you want to reason on the data or we want to perform semantic search.",
            "So I hope this gives you just a flavor of a whole range of problems we can solve using some kind of modeling the data and how they need or use."
        ],
        [
            "It's different representations.",
            "And of course it's not exclusive.",
            "I mentioned document classification with vector Space model, but I know that some colleagues have been successfully doing it.",
            "Also using character level representation with characters maybe of land four and then they kind of lose some information, but they gain some other problems, which for instance in highly inflected languages need to be handled by lemmatization or stemming."
        ],
        [
            "So for character level, I want to show you a public available demo which basically trains four different languages, frequency table, model and the frequency table.",
            "If we would make it just for this sentence, it would be just counting.",
            "You know all the possible sequences of two letters.",
            "So this is the HD.",
            "Answer One and counting how many times it occurs in the text I have.",
            "And the the model of course should be trained for the language you want to recognize.",
            "So let's see how it works and it's publicly available.",
            "So there was.",
            "I'm showing most of them are public.",
            "So I would encourage you to try it yourself if you have computer here and can connect to the Internet, just feel free to try while I'm doing it.",
            "Your contribution, so I was thinking.",
            "This is a website of our laboratory artificial intelligence laboratories.",
            "Everything I can just copy the text from here.",
            "It's in English.",
            "Um?",
            "And give it to this demo which is publicly available.",
            "And we just asked for language and notification and it was good.",
            "It identified English.",
            "But then I was saying, OK, so let's try different languages and I took that the same text and translated it to Romanian language.",
            "So let's see.",
            "And then we'll try some other languages.",
            "We'll see how it works.",
            "So I copy that text.",
            "I don't speak language, but I know some of the people from audience do so.",
            "Maybe it's you know good, maybe it's not so good translation, but nevertheless this system is capable of identifying the language.",
            "And then maybe we can try some other languages.",
            "So do you have any suggestion?",
            "I don't know German might work, I would expect.",
            "Yep, it works.",
            "So.",
            "Translate English Slovenian.",
            "OK, let's see.",
            "And of course with the system systems are tradeable, so I imagine if some language is not perfect, it knows about Slovenian.",
            "Driving direction OK. You can train the system.",
            "There's the idea.",
            "Which Russian I didn't.",
            "Bella Lucia, this one haha.",
            "Well, let's see.",
            "How is it politically very correct?",
            "I don't know.",
            "I don't know if the languages are similar at all, but that's what it thinks.",
            "Which one?",
            "Train.",
            "It wasn't trained, so yeah, it can be seen here.",
            "They have different languages they have trained for and short demos like a sentence for each.",
            "But it can be trained.",
            "I have been using some other systems and they gave it.",
            "You know 2 pages long idocument in creation and trained it and it was working well.",
            "Then I gave it a document from Bosnian web pages and it was confused.",
            "So you know it wasn't really working so well.",
            "So it was like confusing Croatian, Bosnian, Serbian and so on.",
            "How 'bout?",
            "I don't think it's going to work with Japanese, but let's see I wonder how the page looks in Japanese.",
            "And I know some people here should understand at least a little bit.",
            "So let's see.",
            "Mandarin.",
            "The closest match on the sequences of letters, basically.",
            "Um?",
            "OK.",
            "So let's see."
        ],
        [
            "The next representation."
        ],
        [
            "I wanted to talk a little bit more about this vector space model because basically that's what is most commonly used and it's also used in some of the demos.",
            "I'll show you a little bit later, So what we do here is we represent text of the document as a sparse numeric vector, so a document is a vector of some numbers, and then we deal with it with just usual methods of linear algebra operation.",
            "Whatever of modeling you want because.",
            "You have vectors, and by this we forget things about linguistic structure.",
            "Basically it's also called bag of words representation because what we do is we pretend that the whole document is 1 bag and we cut it.",
            "Cut the text into words and then just put everything in one bag and count.",
            "And this is how it works right?",
            "So imagine."
        ],
        [
            "This is a text.",
            "What I do is I go word by word and say OK learning in this document I have a document corpus so I get a union of all the words that occur in all the documents I want to deal with at the moment.",
            "So in this particular document, learning didn't occur.",
            "Journal occurs three times.",
            "Intelligence occur twice, text didn't occur, and so on.",
            "So instead of having this textual document, I have just this vector of numbers.",
            "And of course I have somewhere written that at the first position is learning and when I have another document it's also learning at the first position and Journal at the 2nd, and so on, right?",
            "So I hope."
        ],
        [
            "It's clear.",
            "And boss, I have this vectors.",
            "Then I can also measure similarity between documents.",
            "And basically how it is done also in information retrieval in document clustering is using so-called cosine similarity, which is basically dot product between the two vectors and what it does intuitively it just gets the overlap of the words between two documents.",
            "So it's not exactly that, and this is not exactly what happens.",
            "I just told you all we represent a document as a vector of integer numbers, which is not really true.",
            "There is some waiting happening, but it doesn't matter for this talk today and also here you can imagine what it is doing.",
            "It's counting how many words do documents have in common.",
            "And to get it a little bit less naive, this document representation bag of words.",
            "People sometimes also use phrases.",
            "So instead of just saying machine as one word and learning as another, we would also include phrase which is machine learning and count how many times machine learning is a phrase occurs and then use that in Rep."
        ],
        [
            "Sentation so for document clustering you can imagine is similar.",
            "We just measure similarity between documents and those who are similar, meaning whose cosine similarity is good.",
            "We put together and say they talk about similar things, and of course it's not perfect.",
            "And of course if I don't use phrases for instance and if I have document talking about machine learning and the document talking about some other learning or a document talking about some machinery machines, they can all seem similar.",
            "Unless the at the rest of the vocabulary in these documents really differs and matters, or I do some other transformation, use phrases or something else."
        ],
        [
            "OK so the 1st.",
            "Demo, which is basically using this representation and it's using clustering in one part of it and it's using classification in another part is what we called context sensitive search."
        ],
        [
            "It's search point here is a little bit of motivation.",
            "We often do a search on Internet.",
            "This is a common task that we do, but how smart is what we currently are using today?",
            "I don't think it's."
        ],
        [
            "Very smart.",
            "We're not very happy with that.",
            "For instance, I was trying earlier Dolphin.",
            "Went on Google search for Dolphin.",
            "I have bunch of results.",
            "I got, you know, over 130 million different hits.",
            "How does computer know what really interests me?",
            "Of course, if I'm an average person, if I'm looking for the most frequently click things and so on, it's great.",
            "If I'm not, then I'm in a trouble and I I'm I am not going to list through.",
            "I don't know how many pages to find.",
            "What I'm looking for.",
            "So this is a motivation for this."
        ],
        [
            "System search point.",
            "With search point we call it context sensitive.",
            "Because what it does is it gives you a little bit more.",
            "It's also query.",
            "It's not really a search engine, it's just a post processing of the results of search engine.",
            "So it goes to Google or Yahoo or to whichever search engine.",
            "And then provides results, but enables me also classifieds the results based on a predefined ontology of possible categories.",
            "And I'll show you a live demo which I think is going to help.",
            "Just to explain what's happening, let me see.",
            "OK, so that was my previous search for for Dolphin I should probably explain.",
            "Let me search again with topics.",
            "What happens here is the system goes to Google gets the first, I think 200 results and clusters them.",
            "Which means measure similarity between.",
            "What is returned and for the purpose for being scalable, it unit uses snippets.",
            "It doesn't go and cluster a whole document.",
            "It uses snippet and these are the categories which are obtained after that classification after that clustering.",
            "And this is a point which I can move.",
            "That's the whole point, because maybe when I wrote in Dolphin what I had in mind was games.",
            "And now suddenly it just three ranks the result.",
            "So it's fairly simple idea, but it can be very useful, especially if I'm looking for something which is not going to be at the top.",
            "So what is at the top now?",
            "Never mind if it's Dolphin slider games.",
            "And it was previously on 152nd place, so there is no way I would go through all the search results and dig out 250 second place, right?",
            "This was on 13 and so on.",
            "So this is a four demo in purse purpose.",
            "We're keeping this number just to be able to see what is the change.",
            "What is the influence of the system?",
            "Or I can I don't know Dolphin can be dolphin design.",
            "Or hotel and think about if you have any suggestions, we can search for something else.",
            "For some other word, I mean I I choose Dolphin because it has more.",
            "Meanings, So what I did here is I choose the second tab, which is basically classifying all the hits, not clustering them as previously, but classifying them into an existing ontology.",
            "In this case it is demos ontology of web pages, content on this topic ontology.",
            "But you can also.",
            "The method is such that you can also use some other ontology.",
            "You just need to have it so called populate it with the documents each category needs to have some examples so you can.",
            "Using machine learning, train the classifier.",
            "So here Dolphin also goes into science.",
            "Luckily it's not just overtaken, so Wikipedia is in the 1st place, but then there are other hits.",
            "It goes into travel.",
            "Caribbean so all the different kind which is mentioned in that ontology.",
            "So doing this classification you can imagine what we call putting on semantic glasses right?",
            "So I put on the semantic glasses of this ontology, which is demos an through that glasses.",
            "I look into the heat which the search engine has returned.",
            "Any suggestions for some search?",
            "Yep.",
            "I can try, yeah.",
            "Buck better.",
            "Back back design bug lab.",
            "Back control.",
            "Let's see what he knows about bugs in demos.",
            "Bed bug.",
            "Haha here.",
            "In science, OK, there are some bugs.",
            "Hopefully at the box.",
            "Cats and dogs.",
            "Regional.",
            "Registry.",
            "OK, so I hope you got the idea.",
            "What is behind?",
            "Is this vector space representation of text and then we do one or the other thing with that.",
            "Is there any questions for that or do you?",
            "Point another point, how are they arranged it?",
            "Continuous.",
            "Yes, in both of them.",
            "So this one the connections are taken from the ontology.",
            "So in Demos Ontology there under top there is shopping and there is kitten teens and under this there is science, in the other one they are not really placed for anything else than just to show difference.",
            "But I can move continuously because there is a formula which is calculated so I can put something which is bad and love.",
            "Bucks, right?",
            "But the color and placement really?",
            "I mean, placement is based on similarity, but the color doesn't tell you much.",
            "Yes.",
            "I'm also surprised they're not so popular.",
            "I don't know.",
            "I can't tell you why.",
            "Freebox?",
            "Yes, there was something else.",
            "One more question, and then we continue how you generate.",
            "It's automatically generated.",
            "It's the most representative keywords from the cluster, which is you can you can understand as a most frequent.",
            "For the purpose of.",
            "The talk here, so it's automatically identified while here when using ontology.",
            "It's a name of a topic.",
            "From the ontology.",
            "OK."
        ],
        [
            "OK."
        ],
        [
            "So as the main advantage is what we think is that one thing is clusters are generated.",
            "So if you have different data and you don't have ontology which really covers this content, then you can still get the things identified as clusters.",
            "And user also what I mentioned previously can through a search through a whole space.",
            "It's not just the discrete space, this or that, but it's also in between because documents also talk about more things."
        ],
        [
            "At the same time."
        ],
        [
            "OK, another demo which is on using this vector space representation for visualization.",
            "And here it's news visualization and I would like to and basically it's a collection of Reuters news.",
            "We search through, get a subset of all the news and then we do something with this subset.",
            "We visualize it in different ways.",
            "So let me show you alive.",
            "OK.",
            "So it's Reuters.",
            "9697 newsarticles and this is a subset with mentioned mentions Clinton.",
            "So I can click on one of the articles and I get.",
            "Text here so I can also read through.",
            "This is a visual representation of all these subset mentioning Clinton and the yellow crosses are documents news.",
            "And if they are closer to each other, it means they're more similar, of course.",
            "And the shading just shows how many of them are here right here.",
            "It's lighter shade.",
            "So because there are more and then there are also keyboards which are the most frequent in that part of the drawing.",
            "In that collection of documents, I can also click here, export trade and get idocument your US dollar mostly higher and so on so you can see.",
            "Different topics that were discussed in connection to Clinton like government, finances, merchandise, trade, Israel and so on.",
            "Another view on the same collection."
        ],
        [
            "Is a view on name entities.",
            "So here what we're focusing on is what are the name entities that occur and you can see here is like Congress and Clinton, White House, China.",
            "Here is more Europe here is Israel Yasser Arafat, Middle East and so on.",
            "And another view."
        ],
        [
            "Is on topics.",
            "Which is.",
            "Showing it's basically it's for playing, but what I'm showing here is.",
            "Dividing documents into five clusters and then measuring frequency overtime on the of each of them.",
            "So here is 1996 August, September, October, and so on.",
            "And these are the different frequencies.",
            "Of the so this is about Dole and Republican, which was very intensive discussion.",
            "But then at the point of elections, it wasn't so intensive after that anymore.",
            "But the discussion on the budget became more intensive after that.",
            "While there are constant discussions, this bottom one is Israel Palestina.",
            "The middle one is the green one is trade and taxes.",
            "This is annatto and Yeltsin, Russia and so on.",
            "So different views on the same data and the possibility to search through.",
            "A kind of.",
            "Browsing for people.",
            "OK, so I've shown you this part."
        ],
        [
            "Budget and elections.",
            "So here is a few more slides which are from the same demo but on different datasets which I don't have on my computer, so I can't show you life and it is New York Times are hive.",
            "You probably know that your times made available there are high for their articles.",
            "And here is a part of that archive.",
            "The archive is, I think, from 1851.",
            "So fairly late old articles.",
            "This is a subset about the Second World War, and you can see again here the same kind of clustering into five clusters over years.",
            "Seeing how this intensity of different topics of clusters change.",
            "So this is about Navy.",
            "So if we look at the query was Pearl Harbor, so I took a subset which is on the news which only that mentioned Pearl Harbor.",
            "So you can see how intensity of different topics changed so Japanese and island was more intensive here, while here there was an avian shipping and naval, and here is a war which became very intensive.",
            "And it wasn't here at all.",
            "And then it became very intensively there."
        ],
        [
            "Back and so on.",
            "Or another example is quirion Belgrade on New York Times archive.",
            "When there was a lot of discussion of Italy and Germans here and there was discussion on Crowd Premier administer and the Green Wall is Balkin and War Europe, the blue is Soviet Romanian.",
            "The bottom one is Bulgaria Balkan, so there was obviously it was very hot and then the attack happened to Bell on Belgrade and then there was so much going on elsewhere in the world that it wasn't.",
            "So frequently mentioned Balkin anymore.",
            "Right, but someone now of course it's easy now to be to understand everything after we knew what happened, but someone maybe at that time observing the news and frequency maybe would spot that there is, you know there is something hot going on and it's."
        ],
        [
            "Lot of mention of Balkan and so on and there was a similar situation attack on Normandy.",
            "There was a sale which was a very the bottom one was a very hot topic before the attack and then it was like France and forces and war and so on.",
            "So really."
        ],
        [
            "Out of the news you can see very interesting things.",
            "OK, are there representation which is more?",
            "I would say more complex."
        ],
        [
            "You can use parsing natural language processing.",
            "Get the parsing get the structure out of the sentences, get the parse tree and then be able to solve some problems which really."
        ],
        [
            "A benefit from that and here is a one such system which uses parsing.",
            "And of course you have to be.",
            "You have to be prepared to sacrifice.",
            "Scalability in this case, or, you know, depends on the representation, but you know what?"
        ],
        [
            "Why you are doing that?",
            "So the idea of answer our system is that it answers questions, but in the back what happens is there is a collection of documents on which it's going to answer the questions.",
            "This is parsed, triplets are extracted to get subject predicate object.",
            "This triplets are semantically enhanced, which means word, net and some domain ontology.",
            "As far Medline we tried few.",
            "He's used also common sense knowledge from psych ontology.",
            "To Samantha to add semantics to this triplets and then our questions are answered on this enhanced collection of triplets."
        ],
        [
            "Tracked it from the documents, so here is an example, but let me go on the Internet and show.",
            "Then also, as I said, you're welcome to try yourself.",
            "So.",
            "It's answer art.net the address.",
            "And here there are also some.",
            "The most you can look at, I think I looked at was that.",
            "Who got?",
            "Who got injection?",
            "Using Medline, it's medical ontology.",
            "And let's see what is written.",
            "So with this kind of situations you should be aware of that there is a limited collection of documents on which the system search, right?",
            "So let's see what is written there."
        ],
        [
            "In Medline database about.",
            "And what is written is that.",
            "Read through civics, injections, patients receiving injections and so on, and the system provides also supporting documents.",
            "So these are articles on which the system based this conclusions.",
            "So if we look at one of them."
        ],
        [
            "There was some study, so there was a study and you can read the article and see.",
            "And there's also a possibility to visually visually represent it, because there is this parsing and extraction of triplet."
        ],
        [
            "And what is shown here is a graph which is built on the top of the triplets subject, predicate, object triplets and here are based on that some fact.",
            "Extracted rates received injection.",
            "You can see it here or.",
            "Reduction persisted.",
            "Some age.",
            "Age correlated in fact size and so on, so there are different ways how to represent answers and show what it was there.",
            "Let me show you one more."
        ],
        [
            "Example, which I think is on the side.",
            "Uh, which is as far as far, is another ontology which is agriculture fishery.",
            "So here is a."
        ],
        [
            "What do sharks have?",
            "And there are different things that the system finds in the documents about sharks.",
            "So sharks have undergone decline.",
            "So here is a article which talks about it.",
            "You can read sharks, have tail sharks, have skins.",
            "Sharks have specialization.",
            "I don't know steady swimming are muscles, dynamics and so on.",
            "So I hope you got an idea.",
            "So there is a system is intended to be demo intended to be useful, but on the other side there is also some machinery and research behind.",
            "Which was needed in order to do it.",
            "So here is."
        ],
        [
            "Just safety slides in case Internet doesn't work.",
            "And then I want to show, and that's almost the end of my presentation.",
            "It's a natural language, enrichment with text and you can see this this work of I mean also in the previous slide of many people from."
        ],
        [
            "Our group.",
            "What it does is it's publicly available again, so I encourage you to try and use it.",
            "It's a demo, so hopefully it works.",
            "Sometimes it doesn't work, but it is supposed to be scalable and it can be used as HTML to give HTML output, which I'll show you now, but also as a web service."
        ],
        [
            "And what it does again behind, there are several methods and components.",
            "It does entity extraction, people, location, organization dates and so on.",
            "Entity Resolution, coreference resolution, anaphora solution, entity linkage using linked open data.",
            "What sense disambiguation also assertion extraction subject predicate object using the same methodology which was in the previous demo and also categorization into ontology?",
            "In this case, it was it's open directory and also Wikipedia category schema and it's using again the same component for dymos categorization as used in search point.",
            "So you can see there are these like building blocks which use machine learning text representation in this or the other way and then you can put them together at something and have.",
            "Some problem solved or some functionality."
        ],
        [
            "Performed."
        ],
        [
            "OK, I think entity resolution.",
            "Then there is the system has different components.",
            "As I said in the back."
        ],
        [
            "Which I think I understood.",
            "So let me show you a demo itself.",
            "And Richard.",
            "OK, so this is.",
            "The system I was.",
            "Again, thinking about, let me see.",
            "Copying some text in it."
        ],
        [
            "So I took my CV which is on the web.",
            "Because I want to have some damn entities, I want to have some, you know, some some meat in there for the system to play with.",
            "Um?",
            "So this is the but you can copy whatever you wanted.",
            "Here are some examples you can click on and it copies in there."
        ],
        [
            "The text, So what I'm getting here is some interesting statements from my CV, which is the time endless expert group.",
            "Member interest applied web documents semantic technology techniques application, which is fairly reasonable.",
            "Then there is the text and there are identified terms or named entities which I'm here and then extracted those entities I put put in here some keywords and categories.",
            "So.",
            "Different entities occur in my CV.",
            "I know for Ljubljana I can click on each of them and see to which data sources to which ontologies.",
            "System managed to connect them to do entity resolution.",
            "So here it says is the same as.",
            "Resource Ljubljana in DB pedia.",
            "So let's see what is there.",
            "In DB pedia.",
            "It is also resolved in Opencyc Geonames.",
            "It's connected to the website describing Ljubljana and so on.",
            "It also is connected to a type is capitals in Europe.",
            "Now we're waiting for this to open.",
            "Just let you know what's happening.",
            "Takes a while, but I think I have exactly that here so I can show you while we're waiting.",
            "Yeah.",
            "So this is what should open like from DB pedia.",
            "Description of Ljubljana is the capital of Slovenia and so on.",
            "So let's see.",
            "No, it's still working.",
            "Let's try with psych, maybe Cycas.",
            "Yeah, and in psych there is also Ljubljana mentioned in there it's City of Ljubljana, Slovenia, Ljubljana, Ljubljana, Slovenia.",
            "Capital city of Slovenia and so on.",
            "OK. And then also there are categories.",
            "This is also categorization of the text.",
            "And my CV is obviously connected to artificial intelligence machine learning, it's mention."
        ],
        [
            "In there and I can click on that and jump on the most category, which has more documents on the topic and so on.",
            "OK."
        ],
        [
            "And the lasting representation of text and ontology level.",
            "Ontologies as the most general formalism for describing data objects so that things are systemized there and we have some agreed formalization of a knowledge and ontologies can be of various complexity.",
            "They can be.",
            "Fairly simple, lightweight ontologies very complex.",
            "Also depends what domain or do we need, and so on."
        ],
        [
            "Psych knowledge base or psych ontology, I hope most of you heard about it, is an ontology mainly common sense.",
            "Knowledge is encoded in there an has been under development for over 20 years, mainly manual.",
            "But for the last years also semi automatic it has over 300,000 concepts and concepts covered different from the most general.",
            "What is like think including living things, human beings, human activities, and so undescribed.",
            "Systemized in a way so that computers can also understand.",
            "And then use different properties and knowledge one very.",
            "Outstanding thing with psych is that it has over 15,000 predicates just for a comparison.",
            "If you use word net as a kind of ontology, I think it has 27 different relations, like hypernym, hyponym event, so on synonyms.",
            "So here there are 15,000 different and there are of course many assertions in there.",
            "So at the bottom of ontology there are specific data and facts and observations and then there is a general knowledge about that and then is."
        ],
        [
            "Very general things and the whole psych as ontology is used by knowledge authors, so it has a knowledge entry tools where ontology engineers, people who who entered the new data enter into psych.",
            "There is a user interface which has natural language dialogue where everyone can use it, so you're welcome to go open.",
            "Psych is available for everyone and try and play with it.",
            "It's non trivial, but it's fun.",
            "There is also interface to external data sources.",
            "They then cycle can use like text sources, web pages and so on, and there's also API for the other applications to use it."
        ],
        [
            "And since it's a. Ontology and the company and the project developed in the states mostly.",
            "There is also a Slovenian branch here, but it's mostly in the state.",
            "It was funded by large proportion by US DARPA agencies agency.",
            "So there is a lot of knowledge about terrorism.",
            "So here's a slide which I borrowed from a colleague from Psych, just to show you what does.",
            "It mean that it contains knowledge about that.",
            "So in this general knowledge about terrorism level.",
            "It's a one of the things is terrorist groups are capable of directing assassination and it's written in a logical form, which is if something is a terrorist group then this group has behavior capable of assassinating someone.",
            "Did someone is direct."
        ],
        [
            "Agent or there is a very specific facts which is written like Al Qaeda is based in Afghanistan.",
            "So just to give you a taste of difference, one thing is fixed which I've written and the other one was previously which are rules."
        ],
        [
            "All the things can occur or behave.",
            "And this is 1 example of automatic translation of text into logic.",
            "So we talked about representing text here.",
            "It's representing text in logic, and it's not readily available.",
            "It's not off.",
            "The shelf is research.",
            "And the idea is to translate.",
            "To learn the rules, how to translate text to logic, which means also to learn it for different languages.",
            "One example is a source would say Galileo Galilei was an Italian physicist and astronomer.",
            "In logic, this is how it looks.",
            "We have Galileo.",
            "Galei is a Italian person.",
            "And Galileo Galilei is a physicist and Galileo Galilei is astronomer or Albert Einstein.",
            "And then if out of that logic we would generate text, interpret the fact Galileo was Italian physicist and astronomer?",
            "So of course something is lost.",
            "It's not exactly the same sentence we didn't expect, but hopefully in this case that's true.",
            "It captures the meaning.",
            "It captures knowledge which is in the text.",
            "Albert Einstein was born in 1879 in Old Germany.",
            "So in logic, that's how it's written and then what is written there is basically was born in 19, eighteen, 79.",
            "So the key here is really how to do this transformation.",
            "And of course you can do it manually, but you know we would like to use some machine learning techniques and make it more automatic based on learning on the data which were men."
        ],
        [
            "Newly prepared by human.",
            "And that's that.",
            "Then the idea having documents in different languages, you map them into logic and then you have a knowledge in there.",
            "In logic you can play with that.",
            "You can do reasoning on the top answer, questions you can search and then you can in dependently on the language and then you can go back and look and read through the document itself.",
            "If you want to see the source from where it comes and you know you can imagine on this project I'm mentioning here, it's a European project which is about to start.",
            "And there are, you know, news is a big case study.",
            "For that you can imagine using different languages where you want to get knowledge and you want to see who talks about what and in which way."
        ],
        [
            "So one."
        ],
        [
            "And just for references, there is a number of books on text mining.",
            "Natural language processing.",
            "I'm sure you have seen some of the."
        ],
        [
            "House.",
            "Also possibly relevant some books on semantic technologies."
        ],
        [
            "Um?",
            "Also, references to some main conferences, information retrieval, machine learning, data mining, computational linguistics, semantic web.",
            "You may want to look through some of them.",
            "See what are the topics in there, especially if you are looking for some interesting and hot research topics, or if you're working on your thesis and want to see."
        ],
        [
            "See what is available there in, maybe not exactly my research area, but some other and this is my last slide.",
            "I just want to tell you that this talk and also some other talks of the summer school were recorded by videolectures.net and I would like to encourage you to go yourself not for the talks which were here because, you know, hopefully you attended those you're interested in, but for many other interesting talks, and if you are interested also more into what I just touched on today, there are tutorials.",
            "Available on that website.",
            "Summer schools in machine learning in semantic web in different topics so you can go there.",
            "There is over 11,000 lectures on the site.",
            "And I think I will conclude with that and leave few minutes for questions.",
            "OK, thank you questions.",
            "So currently it's available as a web service.",
            "And it's partially also because.",
            "We don't have time, it's research demo, but of course also the software component.",
            "Some of the components are publicly available because they were also included in some European projects.",
            "In some other applications, and so on, so it's for sure for research purpose it's available.",
            "Um?",
            "I mean we are open for collaboration, is just that you know we're a little bit afraid if we put something just available there.",
            "We won't be able to handle questions and give support, and it is.",
            "Don't forget this is research demos so it's research.",
            "Alright.",
            "But we're happy to get any feedback, and we're trying to make some of the things more scalable for, for instance, and richer some of the colleagues from other universities in Europe are kind of using it as web service, giving it documents, and then crashes.",
            "And then we have to figure out what was exactly in the document that caused the system to crash and catch the catch the bug, and so on.",
            "And the question is also scalability, but I think it's at least as a demo.",
            "It's useful and it can be maybe inspiration for someone if they want to build the.",
            "Commercial systems to see what is the in research.",
            "What is possible?",
            "Might.",
            "That that's excellent observation, and I can't give you answer because it's really difficult.",
            "So what we do nevertheless we do evaluate components which are behind, so we do evaluate how good this clustering, how good is for enrichment.",
            "For instance, there was there is name, entity resolution.",
            "So there is manually labeled data.",
            "We do research which is then trying different methods, seeing if using context of a document.",
            "For instance, I didn't go through example.",
            "There was example.",
            "If there is a Microsoft mentioned in the document and the system resource it to Microsoft in ontology to computer company Microsoft and then there is Apple mention in the same document.",
            "When I try to resolve Apple and figure out to ontology, shall I connect it to a computer company or shall I connect it to fruits?",
            "I can use context to help me disambiguate disambiguation and say, oh, because Microsoft was there, it's computer company.",
            "So it's more probable computer company as well.",
            "So these things we can evaluate and that's what we do.",
            "But then one it's put together.",
            "It's basically difficult to evaluate it as a whole.",
            "It's possible, of course you can make user studies.",
            "But we didn't do it so far.",
            "We didn't do it so far.",
            "We did some user studies for the visualization part.",
            "I showed you so this map and so on, but mainly at the end it showed like that people have maybe different preference for different color, you know, so it's.",
            "It's very difficult.",
            "But yeah, so also this visualization, not the demo news, which I showed, but the system which does the visualization is called Document Atlas and it's publicly available.",
            "You can download the system and play yourself and visualize documents.",
            "So also someone comes with some idea how to evaluate.",
            "We're happy to collaborate or you know to get feedback and some people did for another system we have for ontology development which also includes visualization.",
            "The system is called on to Jenn.",
            "Some people took it and then did evaluation and compared to some other systems and they use it for organizing knowledge.",
            "In E learning environment, so the professors use the system in order to organize different knowledge units they have in E. Learning to organize it into kind of a taxonomy, and they use several systems and made comparison and made research on that.",
            "So it is possible, but it's not.",
            "I would say it's not, you know, a main line of our research, so that's why we didn't do it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm very grateful to the organizers for inviting me.",
                    "label": 0
                },
                {
                    "sent": "It's really pleasure to be here, so I will try to give you more like an overview and motivate you to start thinking about different ways, how we can represent text and why, and how can that be connected to logic, and it's some.",
                    "label": 0
                },
                {
                    "sent": "I'll show some demos, which is work of performed in our group, but also.",
                    "label": 0
                },
                {
                    "sent": "I'll at the end give a hint on our current research direction, where I can't yet show much results, but just to give you an idea.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first I'll motivate.",
                    "label": 0
                },
                {
                    "sent": "Like trying to convince you that representation is important, then we look at different levels of text representation and I'll show demos and then just do.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Include so for motivation.",
                    "label": 0
                },
                {
                    "sent": "When modeling the data.",
                    "label": 0
                },
                {
                    "sent": "When we use machine learning, there are two major steps.",
                    "label": 1
                },
                {
                    "sent": "One is how do we represent the data.",
                    "label": 0
                },
                {
                    "sent": "So we have to do this site.",
                    "label": 0
                },
                {
                    "sent": "What are the features?",
                    "label": 0
                },
                {
                    "sent": "How do we describe our examples in the data and the other step is modeling itself where there is a combination of statistics and optimization.",
                    "label": 0
                },
                {
                    "sent": "So typically people when they use machine learning methods, they do modeling well.",
                    "label": 1
                },
                {
                    "sent": "They choose some algorithm and do it, but what really matters is good representation because it was shown that when we use good representation of the data, which means there need to be some understanding at least of the domain.",
                    "label": 0
                },
                {
                    "sent": "And even if the algorithm is not the best one, we usually obtain better results than using state of the art.",
                    "label": 0
                },
                {
                    "sent": "Great algorithm, but poor representation.",
                    "label": 0
                },
                {
                    "sent": "And you could imagine why, because in representation actually capture properties of the data and then algorithm sees the data only through the representation we give it.",
                    "label": 0
                },
                {
                    "sent": "You can imagine it as a glasses if your glasses are dirty.",
                    "label": 0
                },
                {
                    "sent": "You can't see much out of them, right?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to motivate, let me just briefly remind you on document categorization.",
                    "label": 1
                },
                {
                    "sent": "What is it?",
                    "label": 0
                },
                {
                    "sent": "So imagine we have a collection of documents and they're labeled.",
                    "label": 0
                },
                {
                    "sent": "It can be labeled in user proper link that can be labeled as interesting documents for the user, and not interesting in document categorization by topic.",
                    "label": 0
                },
                {
                    "sent": "It can be labeled by content like easy to document about language.",
                    "label": 0
                },
                {
                    "sent": "Is it a document about?",
                    "label": 0
                },
                {
                    "sent": "Economix is document about sports and so on, so we have this collection of documents.",
                    "label": 0
                },
                {
                    "sent": "They are labeled and then we use machine learning methods to generate a model, A model then then is capable of classifying knew documents which are not labeled and assigning them a label.",
                    "label": 0
                },
                {
                    "sent": "And of course before giving these documents to machine learning or in the process there is some preprocessing to be performed and there is also some representation of the documents of the text to happen.",
                    "label": 0
                },
                {
                    "sent": "Which is really what matters.",
                    "label": 0
                },
                {
                    "sent": "Then how we do that?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me show you a short demo.",
                    "label": 0
                },
                {
                    "sent": "Just to argue for importance.",
                    "label": 0
                },
                {
                    "sent": "Of the document representation and representation on text in general, so this is.",
                    "label": 0
                },
                {
                    "sent": "One of the well known algorithms for classification called support vector machines, and it has a property that you can use different so called kernels, which is basically how the algorithm then sees your data.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine this is a kind of representation issue.",
                    "label": 0
                },
                {
                    "sent": "How we change the representation.",
                    "label": 0
                },
                {
                    "sent": "So let me just imagine we have some data points, so these are of one class label.",
                    "label": 0
                },
                {
                    "sent": "Maybe these are not interesting for our user and here are some other data points interesting for the user.",
                    "label": 0
                },
                {
                    "sent": "And for the purpose of demo, this all happens in two dimensions, so we have kind of two feature values.",
                    "label": 0
                },
                {
                    "sent": "So this point has this value for one feature and this value for another feature.",
                    "label": 0
                },
                {
                    "sent": "And this feature point has the other value.",
                    "label": 0
                },
                {
                    "sent": "So if I use linear kernel, I can pretty well separate these two sets of documents if these are documents interesting and uninteresting for the user, because you know all the previously you could see they are nicely separated.",
                    "label": 0
                },
                {
                    "sent": "There is nice distance and we can see.",
                    "label": 0
                },
                {
                    "sent": "That is fairly simple problem.",
                    "label": 0
                },
                {
                    "sent": "Well, I can have a little bit different problem.",
                    "label": 0
                },
                {
                    "sent": "Where the points are not so nicely separated so they are a little bit spread around.",
                    "label": 0
                },
                {
                    "sent": "And I can try using linear.",
                    "label": 0
                },
                {
                    "sent": "Colonel, and it does some job.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But if I use polynomial kernel, the job is much better.",
                    "label": 0
                },
                {
                    "sent": "So depending how difficult is the problem, I should adjust what I'm using.",
                    "label": 0
                },
                {
                    "sent": "Which data representation?",
                    "label": 0
                },
                {
                    "sent": "And if we look into a more complicated problem.",
                    "label": 0
                },
                {
                    "sent": "Where the data is actually placed as a X or problem that some of you might know.",
                    "label": 0
                },
                {
                    "sent": "Then using just linear separation.",
                    "label": 0
                },
                {
                    "sent": "Wouldn't do much.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can see the separate.",
                    "label": 0
                },
                {
                    "sent": "The separation is not really great because it's saying this is one class on this side.",
                    "label": 0
                },
                {
                    "sent": "This is another class on this side which is really not true.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I use more complicated representation using Gaussian kernel then I get in this case a great model.",
                    "label": 1
                },
                {
                    "sent": "So I hope this motivates a little bit this argument which I'm trying to sell you.",
                    "label": 0
                },
                {
                    "sent": "That representation really matters.",
                    "label": 0
                },
                {
                    "sent": "And when we face and your problem, it's important to think about what do I want to say.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what am I doing?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if we think about key parody comes when we do data analysis, we can say that there are the three key.",
                    "label": 1
                },
                {
                    "sent": "Views one is model driven which is so called top down approach.",
                    "label": 1
                },
                {
                    "sent": "Which means there is a model which is provided by human and then we try to somehow fit the data to that model.",
                    "label": 0
                },
                {
                    "sent": "Another approach is data driven, which is used bottom up approach which is used in example which I was just showing in machine learning where there is a data and we have some vague class of models and then we try to build a model based on the data based on the evidence we have.",
                    "label": 1
                },
                {
                    "sent": "And then there is collaborative approach which is getting more and more popular, which is can be said to be socially driven where we have a large amount of people, each contributing a small amount of information.",
                    "label": 0
                },
                {
                    "sent": "But then all put together.",
                    "label": 0
                },
                {
                    "sent": "We get actually a good result.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this view, let's just briefly remember a metaphor of blind people trying to describe how what is 1 elephant.",
                    "label": 0
                },
                {
                    "sent": "And if we imagine they're touching it from different parts, different sites, and each of them has different explanation, what is an elephant?",
                    "label": 0
                },
                {
                    "sent": "Assuming they don't move so the one touching the tail is just touching details like oh it's a rope, right?",
                    "label": 0
                },
                {
                    "sent": "And the one touching body says it's a big wall.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And with this we can think about this as a text processing which really needs if you want to do the job well.",
                    "label": 0
                },
                {
                    "sent": "I believe it needs research, different research areas to contribute their methods, so it needs some computational linguistics to cover language, some Community contribution, some semantic web for interoperability, text mining to get scale and analytics.",
                    "label": 1
                },
                {
                    "sent": "Machine learning to cover statistics information retrieval to cover search.",
                    "label": 0
                },
                {
                    "sent": "Some mappings covered by machine translation and probably also some other, but basically my main message here is if you want to do good job with text processing, don't be narrowminded, think about what can help me to solve the job.",
                    "label": 0
                },
                {
                    "sent": "How can I represent the problem and then use whatever you need?",
                    "label": 0
                },
                {
                    "sent": "You don't need to use your favorite algorithm and tried to convince everyone that's the best solution.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just, you know, be open minded as usual in Life OK so going to a more specific explanation on text representation.",
                    "label": 0
                },
                {
                    "sent": "This is 1 possible, not the only one and you know the best one division of different kind of text representation that I used around in research so some of them are more kind of lexical, summer, more syntactic and some are more semantic.",
                    "label": 0
                },
                {
                    "sent": "But there is of course overlap so it's not so strict as I'm showing here.",
                    "label": 0
                },
                {
                    "sent": "So it goes from character level when you really think about engrams of characters like 234 letters.",
                    "label": 0
                },
                {
                    "sent": "Word level representation and then about we can use phrases which can be either consecutive words or awards which have some proximity features, have some holes in between them when they occur in sentences.",
                    "label": 0
                },
                {
                    "sent": "We can have part of speech tags we can use also some taxonomies to zaurus.",
                    "label": 0
                },
                {
                    "sent": "Like word net.",
                    "label": 0
                },
                {
                    "sent": "Vector space model.",
                    "label": 0
                },
                {
                    "sent": "I'll tell a little bit more about some of them.",
                    "label": 0
                },
                {
                    "sent": "Not all later language models parsing cross modality, collaborative tagging link data using templates or frames and using ontologies or first.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So their logic and each of the representation was used or is used because there are some problems which can be solved by using that representation.",
                    "label": 0
                },
                {
                    "sent": "So character representation was shown to be useful for language identification, copying, detection.",
                    "label": 0
                },
                {
                    "sent": "Part of speech tagging, of course, is useful for name entity extraction.",
                    "label": 0
                },
                {
                    "sent": "Vector space model is a very typical representation used for document categorization, document clustering, summarization, visualization.",
                    "label": 0
                },
                {
                    "sent": "Language models have been shown to be you very useful in machine translation, also in spam filtering with emails.",
                    "label": 1
                },
                {
                    "sent": "Cross modality is useful if we have data which has for instance images and then associated text with images or video and then associated text or some other data.",
                    "label": 0
                },
                {
                    "sent": "Or in multilingual search when we have data text in different languages.",
                    "label": 0
                },
                {
                    "sent": "If you want to get semantics of the data together, we can use collaborative tagging for data integration.",
                    "label": 1
                },
                {
                    "sent": "Linked data is used ontologies.",
                    "label": 0
                },
                {
                    "sent": "Further 1st order theories if you want to reason on the data or we want to perform semantic search.",
                    "label": 0
                },
                {
                    "sent": "So I hope this gives you just a flavor of a whole range of problems we can solve using some kind of modeling the data and how they need or use.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's different representations.",
                    "label": 0
                },
                {
                    "sent": "And of course it's not exclusive.",
                    "label": 0
                },
                {
                    "sent": "I mentioned document classification with vector Space model, but I know that some colleagues have been successfully doing it.",
                    "label": 0
                },
                {
                    "sent": "Also using character level representation with characters maybe of land four and then they kind of lose some information, but they gain some other problems, which for instance in highly inflected languages need to be handled by lemmatization or stemming.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for character level, I want to show you a public available demo which basically trains four different languages, frequency table, model and the frequency table.",
                    "label": 0
                },
                {
                    "sent": "If we would make it just for this sentence, it would be just counting.",
                    "label": 0
                },
                {
                    "sent": "You know all the possible sequences of two letters.",
                    "label": 0
                },
                {
                    "sent": "So this is the HD.",
                    "label": 0
                },
                {
                    "sent": "Answer One and counting how many times it occurs in the text I have.",
                    "label": 1
                },
                {
                    "sent": "And the the model of course should be trained for the language you want to recognize.",
                    "label": 0
                },
                {
                    "sent": "So let's see how it works and it's publicly available.",
                    "label": 0
                },
                {
                    "sent": "So there was.",
                    "label": 0
                },
                {
                    "sent": "I'm showing most of them are public.",
                    "label": 0
                },
                {
                    "sent": "So I would encourage you to try it yourself if you have computer here and can connect to the Internet, just feel free to try while I'm doing it.",
                    "label": 0
                },
                {
                    "sent": "Your contribution, so I was thinking.",
                    "label": 0
                },
                {
                    "sent": "This is a website of our laboratory artificial intelligence laboratories.",
                    "label": 0
                },
                {
                    "sent": "Everything I can just copy the text from here.",
                    "label": 0
                },
                {
                    "sent": "It's in English.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And give it to this demo which is publicly available.",
                    "label": 0
                },
                {
                    "sent": "And we just asked for language and notification and it was good.",
                    "label": 0
                },
                {
                    "sent": "It identified English.",
                    "label": 0
                },
                {
                    "sent": "But then I was saying, OK, so let's try different languages and I took that the same text and translated it to Romanian language.",
                    "label": 0
                },
                {
                    "sent": "So let's see.",
                    "label": 0
                },
                {
                    "sent": "And then we'll try some other languages.",
                    "label": 0
                },
                {
                    "sent": "We'll see how it works.",
                    "label": 0
                },
                {
                    "sent": "So I copy that text.",
                    "label": 1
                },
                {
                    "sent": "I don't speak language, but I know some of the people from audience do so.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's you know good, maybe it's not so good translation, but nevertheless this system is capable of identifying the language.",
                    "label": 0
                },
                {
                    "sent": "And then maybe we can try some other languages.",
                    "label": 0
                },
                {
                    "sent": "So do you have any suggestion?",
                    "label": 0
                },
                {
                    "sent": "I don't know German might work, I would expect.",
                    "label": 0
                },
                {
                    "sent": "Yep, it works.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Translate English Slovenian.",
                    "label": 0
                },
                {
                    "sent": "OK, let's see.",
                    "label": 0
                },
                {
                    "sent": "And of course with the system systems are tradeable, so I imagine if some language is not perfect, it knows about Slovenian.",
                    "label": 0
                },
                {
                    "sent": "Driving direction OK. You can train the system.",
                    "label": 0
                },
                {
                    "sent": "There's the idea.",
                    "label": 0
                },
                {
                    "sent": "Which Russian I didn't.",
                    "label": 0
                },
                {
                    "sent": "Bella Lucia, this one haha.",
                    "label": 0
                },
                {
                    "sent": "Well, let's see.",
                    "label": 0
                },
                {
                    "sent": "How is it politically very correct?",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I don't know if the languages are similar at all, but that's what it thinks.",
                    "label": 0
                },
                {
                    "sent": "Which one?",
                    "label": 0
                },
                {
                    "sent": "Train.",
                    "label": 0
                },
                {
                    "sent": "It wasn't trained, so yeah, it can be seen here.",
                    "label": 0
                },
                {
                    "sent": "They have different languages they have trained for and short demos like a sentence for each.",
                    "label": 0
                },
                {
                    "sent": "But it can be trained.",
                    "label": 0
                },
                {
                    "sent": "I have been using some other systems and they gave it.",
                    "label": 0
                },
                {
                    "sent": "You know 2 pages long idocument in creation and trained it and it was working well.",
                    "label": 1
                },
                {
                    "sent": "Then I gave it a document from Bosnian web pages and it was confused.",
                    "label": 0
                },
                {
                    "sent": "So you know it wasn't really working so well.",
                    "label": 0
                },
                {
                    "sent": "So it was like confusing Croatian, Bosnian, Serbian and so on.",
                    "label": 0
                },
                {
                    "sent": "How 'bout?",
                    "label": 0
                },
                {
                    "sent": "I don't think it's going to work with Japanese, but let's see I wonder how the page looks in Japanese.",
                    "label": 0
                },
                {
                    "sent": "And I know some people here should understand at least a little bit.",
                    "label": 0
                },
                {
                    "sent": "So let's see.",
                    "label": 0
                },
                {
                    "sent": "Mandarin.",
                    "label": 0
                },
                {
                    "sent": "The closest match on the sequences of letters, basically.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So let's see.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The next representation.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wanted to talk a little bit more about this vector space model because basically that's what is most commonly used and it's also used in some of the demos.",
                    "label": 0
                },
                {
                    "sent": "I'll show you a little bit later, So what we do here is we represent text of the document as a sparse numeric vector, so a document is a vector of some numbers, and then we deal with it with just usual methods of linear algebra operation.",
                    "label": 0
                },
                {
                    "sent": "Whatever of modeling you want because.",
                    "label": 0
                },
                {
                    "sent": "You have vectors, and by this we forget things about linguistic structure.",
                    "label": 1
                },
                {
                    "sent": "Basically it's also called bag of words representation because what we do is we pretend that the whole document is 1 bag and we cut it.",
                    "label": 1
                },
                {
                    "sent": "Cut the text into words and then just put everything in one bag and count.",
                    "label": 0
                },
                {
                    "sent": "And this is how it works right?",
                    "label": 0
                },
                {
                    "sent": "So imagine.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a text.",
                    "label": 0
                },
                {
                    "sent": "What I do is I go word by word and say OK learning in this document I have a document corpus so I get a union of all the words that occur in all the documents I want to deal with at the moment.",
                    "label": 0
                },
                {
                    "sent": "So in this particular document, learning didn't occur.",
                    "label": 0
                },
                {
                    "sent": "Journal occurs three times.",
                    "label": 0
                },
                {
                    "sent": "Intelligence occur twice, text didn't occur, and so on.",
                    "label": 0
                },
                {
                    "sent": "So instead of having this textual document, I have just this vector of numbers.",
                    "label": 0
                },
                {
                    "sent": "And of course I have somewhere written that at the first position is learning and when I have another document it's also learning at the first position and Journal at the 2nd, and so on, right?",
                    "label": 0
                },
                {
                    "sent": "So I hope.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's clear.",
                    "label": 0
                },
                {
                    "sent": "And boss, I have this vectors.",
                    "label": 0
                },
                {
                    "sent": "Then I can also measure similarity between documents.",
                    "label": 1
                },
                {
                    "sent": "And basically how it is done also in information retrieval in document clustering is using so-called cosine similarity, which is basically dot product between the two vectors and what it does intuitively it just gets the overlap of the words between two documents.",
                    "label": 1
                },
                {
                    "sent": "So it's not exactly that, and this is not exactly what happens.",
                    "label": 1
                },
                {
                    "sent": "I just told you all we represent a document as a vector of integer numbers, which is not really true.",
                    "label": 0
                },
                {
                    "sent": "There is some waiting happening, but it doesn't matter for this talk today and also here you can imagine what it is doing.",
                    "label": 0
                },
                {
                    "sent": "It's counting how many words do documents have in common.",
                    "label": 0
                },
                {
                    "sent": "And to get it a little bit less naive, this document representation bag of words.",
                    "label": 0
                },
                {
                    "sent": "People sometimes also use phrases.",
                    "label": 0
                },
                {
                    "sent": "So instead of just saying machine as one word and learning as another, we would also include phrase which is machine learning and count how many times machine learning is a phrase occurs and then use that in Rep.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sentation so for document clustering you can imagine is similar.",
                    "label": 1
                },
                {
                    "sent": "We just measure similarity between documents and those who are similar, meaning whose cosine similarity is good.",
                    "label": 1
                },
                {
                    "sent": "We put together and say they talk about similar things, and of course it's not perfect.",
                    "label": 0
                },
                {
                    "sent": "And of course if I don't use phrases for instance and if I have document talking about machine learning and the document talking about some other learning or a document talking about some machinery machines, they can all seem similar.",
                    "label": 0
                },
                {
                    "sent": "Unless the at the rest of the vocabulary in these documents really differs and matters, or I do some other transformation, use phrases or something else.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so the 1st.",
                    "label": 0
                },
                {
                    "sent": "Demo, which is basically using this representation and it's using clustering in one part of it and it's using classification in another part is what we called context sensitive search.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's search point here is a little bit of motivation.",
                    "label": 0
                },
                {
                    "sent": "We often do a search on Internet.",
                    "label": 0
                },
                {
                    "sent": "This is a common task that we do, but how smart is what we currently are using today?",
                    "label": 1
                },
                {
                    "sent": "I don't think it's.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very smart.",
                    "label": 0
                },
                {
                    "sent": "We're not very happy with that.",
                    "label": 0
                },
                {
                    "sent": "For instance, I was trying earlier Dolphin.",
                    "label": 0
                },
                {
                    "sent": "Went on Google search for Dolphin.",
                    "label": 0
                },
                {
                    "sent": "I have bunch of results.",
                    "label": 0
                },
                {
                    "sent": "I got, you know, over 130 million different hits.",
                    "label": 0
                },
                {
                    "sent": "How does computer know what really interests me?",
                    "label": 0
                },
                {
                    "sent": "Of course, if I'm an average person, if I'm looking for the most frequently click things and so on, it's great.",
                    "label": 0
                },
                {
                    "sent": "If I'm not, then I'm in a trouble and I I'm I am not going to list through.",
                    "label": 0
                },
                {
                    "sent": "I don't know how many pages to find.",
                    "label": 0
                },
                {
                    "sent": "What I'm looking for.",
                    "label": 0
                },
                {
                    "sent": "So this is a motivation for this.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "System search point.",
                    "label": 0
                },
                {
                    "sent": "With search point we call it context sensitive.",
                    "label": 1
                },
                {
                    "sent": "Because what it does is it gives you a little bit more.",
                    "label": 0
                },
                {
                    "sent": "It's also query.",
                    "label": 0
                },
                {
                    "sent": "It's not really a search engine, it's just a post processing of the results of search engine.",
                    "label": 0
                },
                {
                    "sent": "So it goes to Google or Yahoo or to whichever search engine.",
                    "label": 0
                },
                {
                    "sent": "And then provides results, but enables me also classifieds the results based on a predefined ontology of possible categories.",
                    "label": 0
                },
                {
                    "sent": "And I'll show you a live demo which I think is going to help.",
                    "label": 0
                },
                {
                    "sent": "Just to explain what's happening, let me see.",
                    "label": 0
                },
                {
                    "sent": "OK, so that was my previous search for for Dolphin I should probably explain.",
                    "label": 0
                },
                {
                    "sent": "Let me search again with topics.",
                    "label": 0
                },
                {
                    "sent": "What happens here is the system goes to Google gets the first, I think 200 results and clusters them.",
                    "label": 0
                },
                {
                    "sent": "Which means measure similarity between.",
                    "label": 0
                },
                {
                    "sent": "What is returned and for the purpose for being scalable, it unit uses snippets.",
                    "label": 0
                },
                {
                    "sent": "It doesn't go and cluster a whole document.",
                    "label": 0
                },
                {
                    "sent": "It uses snippet and these are the categories which are obtained after that classification after that clustering.",
                    "label": 0
                },
                {
                    "sent": "And this is a point which I can move.",
                    "label": 0
                },
                {
                    "sent": "That's the whole point, because maybe when I wrote in Dolphin what I had in mind was games.",
                    "label": 0
                },
                {
                    "sent": "And now suddenly it just three ranks the result.",
                    "label": 0
                },
                {
                    "sent": "So it's fairly simple idea, but it can be very useful, especially if I'm looking for something which is not going to be at the top.",
                    "label": 0
                },
                {
                    "sent": "So what is at the top now?",
                    "label": 0
                },
                {
                    "sent": "Never mind if it's Dolphin slider games.",
                    "label": 0
                },
                {
                    "sent": "And it was previously on 152nd place, so there is no way I would go through all the search results and dig out 250 second place, right?",
                    "label": 0
                },
                {
                    "sent": "This was on 13 and so on.",
                    "label": 0
                },
                {
                    "sent": "So this is a four demo in purse purpose.",
                    "label": 0
                },
                {
                    "sent": "We're keeping this number just to be able to see what is the change.",
                    "label": 0
                },
                {
                    "sent": "What is the influence of the system?",
                    "label": 0
                },
                {
                    "sent": "Or I can I don't know Dolphin can be dolphin design.",
                    "label": 0
                },
                {
                    "sent": "Or hotel and think about if you have any suggestions, we can search for something else.",
                    "label": 0
                },
                {
                    "sent": "For some other word, I mean I I choose Dolphin because it has more.",
                    "label": 0
                },
                {
                    "sent": "Meanings, So what I did here is I choose the second tab, which is basically classifying all the hits, not clustering them as previously, but classifying them into an existing ontology.",
                    "label": 0
                },
                {
                    "sent": "In this case it is demos ontology of web pages, content on this topic ontology.",
                    "label": 0
                },
                {
                    "sent": "But you can also.",
                    "label": 0
                },
                {
                    "sent": "The method is such that you can also use some other ontology.",
                    "label": 0
                },
                {
                    "sent": "You just need to have it so called populate it with the documents each category needs to have some examples so you can.",
                    "label": 0
                },
                {
                    "sent": "Using machine learning, train the classifier.",
                    "label": 0
                },
                {
                    "sent": "So here Dolphin also goes into science.",
                    "label": 0
                },
                {
                    "sent": "Luckily it's not just overtaken, so Wikipedia is in the 1st place, but then there are other hits.",
                    "label": 0
                },
                {
                    "sent": "It goes into travel.",
                    "label": 0
                },
                {
                    "sent": "Caribbean so all the different kind which is mentioned in that ontology.",
                    "label": 0
                },
                {
                    "sent": "So doing this classification you can imagine what we call putting on semantic glasses right?",
                    "label": 0
                },
                {
                    "sent": "So I put on the semantic glasses of this ontology, which is demos an through that glasses.",
                    "label": 1
                },
                {
                    "sent": "I look into the heat which the search engine has returned.",
                    "label": 0
                },
                {
                    "sent": "Any suggestions for some search?",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "I can try, yeah.",
                    "label": 0
                },
                {
                    "sent": "Buck better.",
                    "label": 0
                },
                {
                    "sent": "Back back design bug lab.",
                    "label": 0
                },
                {
                    "sent": "Back control.",
                    "label": 0
                },
                {
                    "sent": "Let's see what he knows about bugs in demos.",
                    "label": 0
                },
                {
                    "sent": "Bed bug.",
                    "label": 0
                },
                {
                    "sent": "Haha here.",
                    "label": 0
                },
                {
                    "sent": "In science, OK, there are some bugs.",
                    "label": 0
                },
                {
                    "sent": "Hopefully at the box.",
                    "label": 0
                },
                {
                    "sent": "Cats and dogs.",
                    "label": 0
                },
                {
                    "sent": "Regional.",
                    "label": 0
                },
                {
                    "sent": "Registry.",
                    "label": 0
                },
                {
                    "sent": "OK, so I hope you got the idea.",
                    "label": 0
                },
                {
                    "sent": "What is behind?",
                    "label": 0
                },
                {
                    "sent": "Is this vector space representation of text and then we do one or the other thing with that.",
                    "label": 0
                },
                {
                    "sent": "Is there any questions for that or do you?",
                    "label": 0
                },
                {
                    "sent": "Point another point, how are they arranged it?",
                    "label": 0
                },
                {
                    "sent": "Continuous.",
                    "label": 0
                },
                {
                    "sent": "Yes, in both of them.",
                    "label": 0
                },
                {
                    "sent": "So this one the connections are taken from the ontology.",
                    "label": 0
                },
                {
                    "sent": "So in Demos Ontology there under top there is shopping and there is kitten teens and under this there is science, in the other one they are not really placed for anything else than just to show difference.",
                    "label": 0
                },
                {
                    "sent": "But I can move continuously because there is a formula which is calculated so I can put something which is bad and love.",
                    "label": 0
                },
                {
                    "sent": "Bucks, right?",
                    "label": 0
                },
                {
                    "sent": "But the color and placement really?",
                    "label": 0
                },
                {
                    "sent": "I mean, placement is based on similarity, but the color doesn't tell you much.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "I'm also surprised they're not so popular.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I can't tell you why.",
                    "label": 0
                },
                {
                    "sent": "Freebox?",
                    "label": 0
                },
                {
                    "sent": "Yes, there was something else.",
                    "label": 0
                },
                {
                    "sent": "One more question, and then we continue how you generate.",
                    "label": 0
                },
                {
                    "sent": "It's automatically generated.",
                    "label": 0
                },
                {
                    "sent": "It's the most representative keywords from the cluster, which is you can you can understand as a most frequent.",
                    "label": 0
                },
                {
                    "sent": "For the purpose of.",
                    "label": 0
                },
                {
                    "sent": "The talk here, so it's automatically identified while here when using ontology.",
                    "label": 0
                },
                {
                    "sent": "It's a name of a topic.",
                    "label": 0
                },
                {
                    "sent": "From the ontology.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as the main advantage is what we think is that one thing is clusters are generated.",
                    "label": 0
                },
                {
                    "sent": "So if you have different data and you don't have ontology which really covers this content, then you can still get the things identified as clusters.",
                    "label": 0
                },
                {
                    "sent": "And user also what I mentioned previously can through a search through a whole space.",
                    "label": 0
                },
                {
                    "sent": "It's not just the discrete space, this or that, but it's also in between because documents also talk about more things.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the same time.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, another demo which is on using this vector space representation for visualization.",
                    "label": 0
                },
                {
                    "sent": "And here it's news visualization and I would like to and basically it's a collection of Reuters news.",
                    "label": 1
                },
                {
                    "sent": "We search through, get a subset of all the news and then we do something with this subset.",
                    "label": 0
                },
                {
                    "sent": "We visualize it in different ways.",
                    "label": 0
                },
                {
                    "sent": "So let me show you alive.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So it's Reuters.",
                    "label": 0
                },
                {
                    "sent": "9697 newsarticles and this is a subset with mentioned mentions Clinton.",
                    "label": 0
                },
                {
                    "sent": "So I can click on one of the articles and I get.",
                    "label": 1
                },
                {
                    "sent": "Text here so I can also read through.",
                    "label": 0
                },
                {
                    "sent": "This is a visual representation of all these subset mentioning Clinton and the yellow crosses are documents news.",
                    "label": 0
                },
                {
                    "sent": "And if they are closer to each other, it means they're more similar, of course.",
                    "label": 0
                },
                {
                    "sent": "And the shading just shows how many of them are here right here.",
                    "label": 0
                },
                {
                    "sent": "It's lighter shade.",
                    "label": 0
                },
                {
                    "sent": "So because there are more and then there are also keyboards which are the most frequent in that part of the drawing.",
                    "label": 0
                },
                {
                    "sent": "In that collection of documents, I can also click here, export trade and get idocument your US dollar mostly higher and so on so you can see.",
                    "label": 0
                },
                {
                    "sent": "Different topics that were discussed in connection to Clinton like government, finances, merchandise, trade, Israel and so on.",
                    "label": 0
                },
                {
                    "sent": "Another view on the same collection.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is a view on name entities.",
                    "label": 0
                },
                {
                    "sent": "So here what we're focusing on is what are the name entities that occur and you can see here is like Congress and Clinton, White House, China.",
                    "label": 0
                },
                {
                    "sent": "Here is more Europe here is Israel Yasser Arafat, Middle East and so on.",
                    "label": 0
                },
                {
                    "sent": "And another view.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is on topics.",
                    "label": 0
                },
                {
                    "sent": "Which is.",
                    "label": 0
                },
                {
                    "sent": "Showing it's basically it's for playing, but what I'm showing here is.",
                    "label": 0
                },
                {
                    "sent": "Dividing documents into five clusters and then measuring frequency overtime on the of each of them.",
                    "label": 0
                },
                {
                    "sent": "So here is 1996 August, September, October, and so on.",
                    "label": 0
                },
                {
                    "sent": "And these are the different frequencies.",
                    "label": 0
                },
                {
                    "sent": "Of the so this is about Dole and Republican, which was very intensive discussion.",
                    "label": 1
                },
                {
                    "sent": "But then at the point of elections, it wasn't so intensive after that anymore.",
                    "label": 0
                },
                {
                    "sent": "But the discussion on the budget became more intensive after that.",
                    "label": 0
                },
                {
                    "sent": "While there are constant discussions, this bottom one is Israel Palestina.",
                    "label": 0
                },
                {
                    "sent": "The middle one is the green one is trade and taxes.",
                    "label": 0
                },
                {
                    "sent": "This is annatto and Yeltsin, Russia and so on.",
                    "label": 0
                },
                {
                    "sent": "So different views on the same data and the possibility to search through.",
                    "label": 0
                },
                {
                    "sent": "A kind of.",
                    "label": 0
                },
                {
                    "sent": "Browsing for people.",
                    "label": 0
                },
                {
                    "sent": "OK, so I've shown you this part.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Budget and elections.",
                    "label": 0
                },
                {
                    "sent": "So here is a few more slides which are from the same demo but on different datasets which I don't have on my computer, so I can't show you life and it is New York Times are hive.",
                    "label": 0
                },
                {
                    "sent": "You probably know that your times made available there are high for their articles.",
                    "label": 0
                },
                {
                    "sent": "And here is a part of that archive.",
                    "label": 0
                },
                {
                    "sent": "The archive is, I think, from 1851.",
                    "label": 0
                },
                {
                    "sent": "So fairly late old articles.",
                    "label": 0
                },
                {
                    "sent": "This is a subset about the Second World War, and you can see again here the same kind of clustering into five clusters over years.",
                    "label": 0
                },
                {
                    "sent": "Seeing how this intensity of different topics of clusters change.",
                    "label": 0
                },
                {
                    "sent": "So this is about Navy.",
                    "label": 0
                },
                {
                    "sent": "So if we look at the query was Pearl Harbor, so I took a subset which is on the news which only that mentioned Pearl Harbor.",
                    "label": 1
                },
                {
                    "sent": "So you can see how intensity of different topics changed so Japanese and island was more intensive here, while here there was an avian shipping and naval, and here is a war which became very intensive.",
                    "label": 0
                },
                {
                    "sent": "And it wasn't here at all.",
                    "label": 0
                },
                {
                    "sent": "And then it became very intensively there.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Back and so on.",
                    "label": 0
                },
                {
                    "sent": "Or another example is quirion Belgrade on New York Times archive.",
                    "label": 0
                },
                {
                    "sent": "When there was a lot of discussion of Italy and Germans here and there was discussion on Crowd Premier administer and the Green Wall is Balkin and War Europe, the blue is Soviet Romanian.",
                    "label": 0
                },
                {
                    "sent": "The bottom one is Bulgaria Balkan, so there was obviously it was very hot and then the attack happened to Bell on Belgrade and then there was so much going on elsewhere in the world that it wasn't.",
                    "label": 0
                },
                {
                    "sent": "So frequently mentioned Balkin anymore.",
                    "label": 0
                },
                {
                    "sent": "Right, but someone now of course it's easy now to be to understand everything after we knew what happened, but someone maybe at that time observing the news and frequency maybe would spot that there is, you know there is something hot going on and it's.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lot of mention of Balkan and so on and there was a similar situation attack on Normandy.",
                    "label": 0
                },
                {
                    "sent": "There was a sale which was a very the bottom one was a very hot topic before the attack and then it was like France and forces and war and so on.",
                    "label": 0
                },
                {
                    "sent": "So really.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Out of the news you can see very interesting things.",
                    "label": 0
                },
                {
                    "sent": "OK, are there representation which is more?",
                    "label": 0
                },
                {
                    "sent": "I would say more complex.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can use parsing natural language processing.",
                    "label": 0
                },
                {
                    "sent": "Get the parsing get the structure out of the sentences, get the parse tree and then be able to solve some problems which really.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A benefit from that and here is a one such system which uses parsing.",
                    "label": 0
                },
                {
                    "sent": "And of course you have to be.",
                    "label": 0
                },
                {
                    "sent": "You have to be prepared to sacrifice.",
                    "label": 0
                },
                {
                    "sent": "Scalability in this case, or, you know, depends on the representation, but you know what?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why you are doing that?",
                    "label": 0
                },
                {
                    "sent": "So the idea of answer our system is that it answers questions, but in the back what happens is there is a collection of documents on which it's going to answer the questions.",
                    "label": 0
                },
                {
                    "sent": "This is parsed, triplets are extracted to get subject predicate object.",
                    "label": 0
                },
                {
                    "sent": "This triplets are semantically enhanced, which means word, net and some domain ontology.",
                    "label": 1
                },
                {
                    "sent": "As far Medline we tried few.",
                    "label": 0
                },
                {
                    "sent": "He's used also common sense knowledge from psych ontology.",
                    "label": 1
                },
                {
                    "sent": "To Samantha to add semantics to this triplets and then our questions are answered on this enhanced collection of triplets.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tracked it from the documents, so here is an example, but let me go on the Internet and show.",
                    "label": 0
                },
                {
                    "sent": "Then also, as I said, you're welcome to try yourself.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's answer art.net the address.",
                    "label": 0
                },
                {
                    "sent": "And here there are also some.",
                    "label": 0
                },
                {
                    "sent": "The most you can look at, I think I looked at was that.",
                    "label": 0
                },
                {
                    "sent": "Who got?",
                    "label": 0
                },
                {
                    "sent": "Who got injection?",
                    "label": 0
                },
                {
                    "sent": "Using Medline, it's medical ontology.",
                    "label": 0
                },
                {
                    "sent": "And let's see what is written.",
                    "label": 0
                },
                {
                    "sent": "So with this kind of situations you should be aware of that there is a limited collection of documents on which the system search, right?",
                    "label": 0
                },
                {
                    "sent": "So let's see what is written there.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Medline database about.",
                    "label": 0
                },
                {
                    "sent": "And what is written is that.",
                    "label": 0
                },
                {
                    "sent": "Read through civics, injections, patients receiving injections and so on, and the system provides also supporting documents.",
                    "label": 0
                },
                {
                    "sent": "So these are articles on which the system based this conclusions.",
                    "label": 0
                },
                {
                    "sent": "So if we look at one of them.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There was some study, so there was a study and you can read the article and see.",
                    "label": 0
                },
                {
                    "sent": "And there's also a possibility to visually visually represent it, because there is this parsing and extraction of triplet.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what is shown here is a graph which is built on the top of the triplets subject, predicate, object triplets and here are based on that some fact.",
                    "label": 0
                },
                {
                    "sent": "Extracted rates received injection.",
                    "label": 0
                },
                {
                    "sent": "You can see it here or.",
                    "label": 0
                },
                {
                    "sent": "Reduction persisted.",
                    "label": 0
                },
                {
                    "sent": "Some age.",
                    "label": 0
                },
                {
                    "sent": "Age correlated in fact size and so on, so there are different ways how to represent answers and show what it was there.",
                    "label": 0
                },
                {
                    "sent": "Let me show you one more.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Example, which I think is on the side.",
                    "label": 0
                },
                {
                    "sent": "Uh, which is as far as far, is another ontology which is agriculture fishery.",
                    "label": 0
                },
                {
                    "sent": "So here is a.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What do sharks have?",
                    "label": 0
                },
                {
                    "sent": "And there are different things that the system finds in the documents about sharks.",
                    "label": 0
                },
                {
                    "sent": "So sharks have undergone decline.",
                    "label": 0
                },
                {
                    "sent": "So here is a article which talks about it.",
                    "label": 0
                },
                {
                    "sent": "You can read sharks, have tail sharks, have skins.",
                    "label": 0
                },
                {
                    "sent": "Sharks have specialization.",
                    "label": 0
                },
                {
                    "sent": "I don't know steady swimming are muscles, dynamics and so on.",
                    "label": 0
                },
                {
                    "sent": "So I hope you got an idea.",
                    "label": 0
                },
                {
                    "sent": "So there is a system is intended to be demo intended to be useful, but on the other side there is also some machinery and research behind.",
                    "label": 0
                },
                {
                    "sent": "Which was needed in order to do it.",
                    "label": 0
                },
                {
                    "sent": "So here is.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just safety slides in case Internet doesn't work.",
                    "label": 0
                },
                {
                    "sent": "And then I want to show, and that's almost the end of my presentation.",
                    "label": 0
                },
                {
                    "sent": "It's a natural language, enrichment with text and you can see this this work of I mean also in the previous slide of many people from.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our group.",
                    "label": 0
                },
                {
                    "sent": "What it does is it's publicly available again, so I encourage you to try and use it.",
                    "label": 0
                },
                {
                    "sent": "It's a demo, so hopefully it works.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it doesn't work, but it is supposed to be scalable and it can be used as HTML to give HTML output, which I'll show you now, but also as a web service.",
                    "label": 1
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what it does again behind, there are several methods and components.",
                    "label": 0
                },
                {
                    "sent": "It does entity extraction, people, location, organization dates and so on.",
                    "label": 0
                },
                {
                    "sent": "Entity Resolution, coreference resolution, anaphora solution, entity linkage using linked open data.",
                    "label": 1
                },
                {
                    "sent": "What sense disambiguation also assertion extraction subject predicate object using the same methodology which was in the previous demo and also categorization into ontology?",
                    "label": 0
                },
                {
                    "sent": "In this case, it was it's open directory and also Wikipedia category schema and it's using again the same component for dymos categorization as used in search point.",
                    "label": 0
                },
                {
                    "sent": "So you can see there are these like building blocks which use machine learning text representation in this or the other way and then you can put them together at something and have.",
                    "label": 0
                },
                {
                    "sent": "Some problem solved or some functionality.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Performed.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I think entity resolution.",
                    "label": 0
                },
                {
                    "sent": "Then there is the system has different components.",
                    "label": 0
                },
                {
                    "sent": "As I said in the back.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which I think I understood.",
                    "label": 0
                },
                {
                    "sent": "So let me show you a demo itself.",
                    "label": 0
                },
                {
                    "sent": "And Richard.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "The system I was.",
                    "label": 0
                },
                {
                    "sent": "Again, thinking about, let me see.",
                    "label": 0
                },
                {
                    "sent": "Copying some text in it.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I took my CV which is on the web.",
                    "label": 0
                },
                {
                    "sent": "Because I want to have some damn entities, I want to have some, you know, some some meat in there for the system to play with.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So this is the but you can copy whatever you wanted.",
                    "label": 0
                },
                {
                    "sent": "Here are some examples you can click on and it copies in there.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The text, So what I'm getting here is some interesting statements from my CV, which is the time endless expert group.",
                    "label": 0
                },
                {
                    "sent": "Member interest applied web documents semantic technology techniques application, which is fairly reasonable.",
                    "label": 0
                },
                {
                    "sent": "Then there is the text and there are identified terms or named entities which I'm here and then extracted those entities I put put in here some keywords and categories.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Different entities occur in my CV.",
                    "label": 0
                },
                {
                    "sent": "I know for Ljubljana I can click on each of them and see to which data sources to which ontologies.",
                    "label": 0
                },
                {
                    "sent": "System managed to connect them to do entity resolution.",
                    "label": 0
                },
                {
                    "sent": "So here it says is the same as.",
                    "label": 0
                },
                {
                    "sent": "Resource Ljubljana in DB pedia.",
                    "label": 0
                },
                {
                    "sent": "So let's see what is there.",
                    "label": 0
                },
                {
                    "sent": "In DB pedia.",
                    "label": 0
                },
                {
                    "sent": "It is also resolved in Opencyc Geonames.",
                    "label": 0
                },
                {
                    "sent": "It's connected to the website describing Ljubljana and so on.",
                    "label": 0
                },
                {
                    "sent": "It also is connected to a type is capitals in Europe.",
                    "label": 0
                },
                {
                    "sent": "Now we're waiting for this to open.",
                    "label": 0
                },
                {
                    "sent": "Just let you know what's happening.",
                    "label": 0
                },
                {
                    "sent": "Takes a while, but I think I have exactly that here so I can show you while we're waiting.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So this is what should open like from DB pedia.",
                    "label": 0
                },
                {
                    "sent": "Description of Ljubljana is the capital of Slovenia and so on.",
                    "label": 0
                },
                {
                    "sent": "So let's see.",
                    "label": 0
                },
                {
                    "sent": "No, it's still working.",
                    "label": 0
                },
                {
                    "sent": "Let's try with psych, maybe Cycas.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and in psych there is also Ljubljana mentioned in there it's City of Ljubljana, Slovenia, Ljubljana, Ljubljana, Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Capital city of Slovenia and so on.",
                    "label": 0
                },
                {
                    "sent": "OK. And then also there are categories.",
                    "label": 0
                },
                {
                    "sent": "This is also categorization of the text.",
                    "label": 0
                },
                {
                    "sent": "And my CV is obviously connected to artificial intelligence machine learning, it's mention.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In there and I can click on that and jump on the most category, which has more documents on the topic and so on.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the lasting representation of text and ontology level.",
                    "label": 0
                },
                {
                    "sent": "Ontologies as the most general formalism for describing data objects so that things are systemized there and we have some agreed formalization of a knowledge and ontologies can be of various complexity.",
                    "label": 1
                },
                {
                    "sent": "They can be.",
                    "label": 0
                },
                {
                    "sent": "Fairly simple, lightweight ontologies very complex.",
                    "label": 0
                },
                {
                    "sent": "Also depends what domain or do we need, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Psych knowledge base or psych ontology, I hope most of you heard about it, is an ontology mainly common sense.",
                    "label": 0
                },
                {
                    "sent": "Knowledge is encoded in there an has been under development for over 20 years, mainly manual.",
                    "label": 0
                },
                {
                    "sent": "But for the last years also semi automatic it has over 300,000 concepts and concepts covered different from the most general.",
                    "label": 0
                },
                {
                    "sent": "What is like think including living things, human beings, human activities, and so undescribed.",
                    "label": 1
                },
                {
                    "sent": "Systemized in a way so that computers can also understand.",
                    "label": 0
                },
                {
                    "sent": "And then use different properties and knowledge one very.",
                    "label": 0
                },
                {
                    "sent": "Outstanding thing with psych is that it has over 15,000 predicates just for a comparison.",
                    "label": 0
                },
                {
                    "sent": "If you use word net as a kind of ontology, I think it has 27 different relations, like hypernym, hyponym event, so on synonyms.",
                    "label": 0
                },
                {
                    "sent": "So here there are 15,000 different and there are of course many assertions in there.",
                    "label": 0
                },
                {
                    "sent": "So at the bottom of ontology there are specific data and facts and observations and then there is a general knowledge about that and then is.",
                    "label": 1
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Very general things and the whole psych as ontology is used by knowledge authors, so it has a knowledge entry tools where ontology engineers, people who who entered the new data enter into psych.",
                    "label": 0
                },
                {
                    "sent": "There is a user interface which has natural language dialogue where everyone can use it, so you're welcome to go open.",
                    "label": 1
                },
                {
                    "sent": "Psych is available for everyone and try and play with it.",
                    "label": 0
                },
                {
                    "sent": "It's non trivial, but it's fun.",
                    "label": 0
                },
                {
                    "sent": "There is also interface to external data sources.",
                    "label": 1
                },
                {
                    "sent": "They then cycle can use like text sources, web pages and so on, and there's also API for the other applications to use it.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And since it's a. Ontology and the company and the project developed in the states mostly.",
                    "label": 0
                },
                {
                    "sent": "There is also a Slovenian branch here, but it's mostly in the state.",
                    "label": 0
                },
                {
                    "sent": "It was funded by large proportion by US DARPA agencies agency.",
                    "label": 0
                },
                {
                    "sent": "So there is a lot of knowledge about terrorism.",
                    "label": 1
                },
                {
                    "sent": "So here's a slide which I borrowed from a colleague from Psych, just to show you what does.",
                    "label": 0
                },
                {
                    "sent": "It mean that it contains knowledge about that.",
                    "label": 0
                },
                {
                    "sent": "So in this general knowledge about terrorism level.",
                    "label": 1
                },
                {
                    "sent": "It's a one of the things is terrorist groups are capable of directing assassination and it's written in a logical form, which is if something is a terrorist group then this group has behavior capable of assassinating someone.",
                    "label": 1
                },
                {
                    "sent": "Did someone is direct.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Agent or there is a very specific facts which is written like Al Qaeda is based in Afghanistan.",
                    "label": 0
                },
                {
                    "sent": "So just to give you a taste of difference, one thing is fixed which I've written and the other one was previously which are rules.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All the things can occur or behave.",
                    "label": 0
                },
                {
                    "sent": "And this is 1 example of automatic translation of text into logic.",
                    "label": 1
                },
                {
                    "sent": "So we talked about representing text here.",
                    "label": 0
                },
                {
                    "sent": "It's representing text in logic, and it's not readily available.",
                    "label": 0
                },
                {
                    "sent": "It's not off.",
                    "label": 0
                },
                {
                    "sent": "The shelf is research.",
                    "label": 0
                },
                {
                    "sent": "And the idea is to translate.",
                    "label": 0
                },
                {
                    "sent": "To learn the rules, how to translate text to logic, which means also to learn it for different languages.",
                    "label": 0
                },
                {
                    "sent": "One example is a source would say Galileo Galilei was an Italian physicist and astronomer.",
                    "label": 1
                },
                {
                    "sent": "In logic, this is how it looks.",
                    "label": 0
                },
                {
                    "sent": "We have Galileo.",
                    "label": 1
                },
                {
                    "sent": "Galei is a Italian person.",
                    "label": 1
                },
                {
                    "sent": "And Galileo Galilei is a physicist and Galileo Galilei is astronomer or Albert Einstein.",
                    "label": 0
                },
                {
                    "sent": "And then if out of that logic we would generate text, interpret the fact Galileo was Italian physicist and astronomer?",
                    "label": 0
                },
                {
                    "sent": "So of course something is lost.",
                    "label": 0
                },
                {
                    "sent": "It's not exactly the same sentence we didn't expect, but hopefully in this case that's true.",
                    "label": 0
                },
                {
                    "sent": "It captures the meaning.",
                    "label": 0
                },
                {
                    "sent": "It captures knowledge which is in the text.",
                    "label": 1
                },
                {
                    "sent": "Albert Einstein was born in 1879 in Old Germany.",
                    "label": 0
                },
                {
                    "sent": "So in logic, that's how it's written and then what is written there is basically was born in 19, eighteen, 79.",
                    "label": 0
                },
                {
                    "sent": "So the key here is really how to do this transformation.",
                    "label": 0
                },
                {
                    "sent": "And of course you can do it manually, but you know we would like to use some machine learning techniques and make it more automatic based on learning on the data which were men.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Newly prepared by human.",
                    "label": 0
                },
                {
                    "sent": "And that's that.",
                    "label": 0
                },
                {
                    "sent": "Then the idea having documents in different languages, you map them into logic and then you have a knowledge in there.",
                    "label": 0
                },
                {
                    "sent": "In logic you can play with that.",
                    "label": 1
                },
                {
                    "sent": "You can do reasoning on the top answer, questions you can search and then you can in dependently on the language and then you can go back and look and read through the document itself.",
                    "label": 0
                },
                {
                    "sent": "If you want to see the source from where it comes and you know you can imagine on this project I'm mentioning here, it's a European project which is about to start.",
                    "label": 0
                },
                {
                    "sent": "And there are, you know, news is a big case study.",
                    "label": 0
                },
                {
                    "sent": "For that you can imagine using different languages where you want to get knowledge and you want to see who talks about what and in which way.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just for references, there is a number of books on text mining.",
                    "label": 0
                },
                {
                    "sent": "Natural language processing.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you have seen some of the.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "House.",
                    "label": 0
                },
                {
                    "sent": "Also possibly relevant some books on semantic technologies.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Also, references to some main conferences, information retrieval, machine learning, data mining, computational linguistics, semantic web.",
                    "label": 1
                },
                {
                    "sent": "You may want to look through some of them.",
                    "label": 0
                },
                {
                    "sent": "See what are the topics in there, especially if you are looking for some interesting and hot research topics, or if you're working on your thesis and want to see.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See what is available there in, maybe not exactly my research area, but some other and this is my last slide.",
                    "label": 0
                },
                {
                    "sent": "I just want to tell you that this talk and also some other talks of the summer school were recorded by videolectures.net and I would like to encourage you to go yourself not for the talks which were here because, you know, hopefully you attended those you're interested in, but for many other interesting talks, and if you are interested also more into what I just touched on today, there are tutorials.",
                    "label": 0
                },
                {
                    "sent": "Available on that website.",
                    "label": 0
                },
                {
                    "sent": "Summer schools in machine learning in semantic web in different topics so you can go there.",
                    "label": 0
                },
                {
                    "sent": "There is over 11,000 lectures on the site.",
                    "label": 0
                },
                {
                    "sent": "And I think I will conclude with that and leave few minutes for questions.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you questions.",
                    "label": 0
                },
                {
                    "sent": "So currently it's available as a web service.",
                    "label": 0
                },
                {
                    "sent": "And it's partially also because.",
                    "label": 0
                },
                {
                    "sent": "We don't have time, it's research demo, but of course also the software component.",
                    "label": 0
                },
                {
                    "sent": "Some of the components are publicly available because they were also included in some European projects.",
                    "label": 0
                },
                {
                    "sent": "In some other applications, and so on, so it's for sure for research purpose it's available.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I mean we are open for collaboration, is just that you know we're a little bit afraid if we put something just available there.",
                    "label": 0
                },
                {
                    "sent": "We won't be able to handle questions and give support, and it is.",
                    "label": 0
                },
                {
                    "sent": "Don't forget this is research demos so it's research.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "But we're happy to get any feedback, and we're trying to make some of the things more scalable for, for instance, and richer some of the colleagues from other universities in Europe are kind of using it as web service, giving it documents, and then crashes.",
                    "label": 0
                },
                {
                    "sent": "And then we have to figure out what was exactly in the document that caused the system to crash and catch the catch the bug, and so on.",
                    "label": 0
                },
                {
                    "sent": "And the question is also scalability, but I think it's at least as a demo.",
                    "label": 0
                },
                {
                    "sent": "It's useful and it can be maybe inspiration for someone if they want to build the.",
                    "label": 0
                },
                {
                    "sent": "Commercial systems to see what is the in research.",
                    "label": 0
                },
                {
                    "sent": "What is possible?",
                    "label": 0
                },
                {
                    "sent": "Might.",
                    "label": 0
                },
                {
                    "sent": "That that's excellent observation, and I can't give you answer because it's really difficult.",
                    "label": 0
                },
                {
                    "sent": "So what we do nevertheless we do evaluate components which are behind, so we do evaluate how good this clustering, how good is for enrichment.",
                    "label": 0
                },
                {
                    "sent": "For instance, there was there is name, entity resolution.",
                    "label": 0
                },
                {
                    "sent": "So there is manually labeled data.",
                    "label": 0
                },
                {
                    "sent": "We do research which is then trying different methods, seeing if using context of a document.",
                    "label": 0
                },
                {
                    "sent": "For instance, I didn't go through example.",
                    "label": 0
                },
                {
                    "sent": "There was example.",
                    "label": 0
                },
                {
                    "sent": "If there is a Microsoft mentioned in the document and the system resource it to Microsoft in ontology to computer company Microsoft and then there is Apple mention in the same document.",
                    "label": 0
                },
                {
                    "sent": "When I try to resolve Apple and figure out to ontology, shall I connect it to a computer company or shall I connect it to fruits?",
                    "label": 0
                },
                {
                    "sent": "I can use context to help me disambiguate disambiguation and say, oh, because Microsoft was there, it's computer company.",
                    "label": 0
                },
                {
                    "sent": "So it's more probable computer company as well.",
                    "label": 0
                },
                {
                    "sent": "So these things we can evaluate and that's what we do.",
                    "label": 0
                },
                {
                    "sent": "But then one it's put together.",
                    "label": 0
                },
                {
                    "sent": "It's basically difficult to evaluate it as a whole.",
                    "label": 0
                },
                {
                    "sent": "It's possible, of course you can make user studies.",
                    "label": 0
                },
                {
                    "sent": "But we didn't do it so far.",
                    "label": 0
                },
                {
                    "sent": "We didn't do it so far.",
                    "label": 0
                },
                {
                    "sent": "We did some user studies for the visualization part.",
                    "label": 0
                },
                {
                    "sent": "I showed you so this map and so on, but mainly at the end it showed like that people have maybe different preference for different color, you know, so it's.",
                    "label": 0
                },
                {
                    "sent": "It's very difficult.",
                    "label": 0
                },
                {
                    "sent": "But yeah, so also this visualization, not the demo news, which I showed, but the system which does the visualization is called Document Atlas and it's publicly available.",
                    "label": 0
                },
                {
                    "sent": "You can download the system and play yourself and visualize documents.",
                    "label": 0
                },
                {
                    "sent": "So also someone comes with some idea how to evaluate.",
                    "label": 0
                },
                {
                    "sent": "We're happy to collaborate or you know to get feedback and some people did for another system we have for ontology development which also includes visualization.",
                    "label": 0
                },
                {
                    "sent": "The system is called on to Jenn.",
                    "label": 0
                },
                {
                    "sent": "Some people took it and then did evaluation and compared to some other systems and they use it for organizing knowledge.",
                    "label": 0
                },
                {
                    "sent": "In E learning environment, so the professors use the system in order to organize different knowledge units they have in E. Learning to organize it into kind of a taxonomy, and they use several systems and made comparison and made research on that.",
                    "label": 0
                },
                {
                    "sent": "So it is possible, but it's not.",
                    "label": 0
                },
                {
                    "sent": "I would say it's not, you know, a main line of our research, so that's why we didn't do it.",
                    "label": 0
                }
            ]
        }
    }
}