{
    "id": "n7cw5n435fjfy2zsgdyymqykfjnqolbr",
    "title": "Exception-enriched Rule Learning from Knowledge Graphs",
    "info": {
        "author": [
            "Mohamed Gad-Elrab, Max Planck Institute for Informatics, Max Planck Institute"
        ],
        "published": "Nov. 10, 2016",
        "recorded": "October 2016",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2016_gad_elrab_knowledge_graphs/",
    "segmentation": [
        [
            "Welcome everyone I'm Hamid.",
            "Gather up PhD student in Max Planck Institute, Germany.",
            "This work is.",
            "I'm here to present exception reached through learning from knowledge graphs.",
            "This joint work with Daria Stepanova, an Albanian Gerhard Weikum."
        ],
        [
            "Now all of us knows what is knowledge graphs.",
            "I want just to deliver to message about knowledge Graph here that the contains only positive facts under the open world assumption.",
            "So whatever is missing from a knowledge graph, we cannot assume it is false.",
            "It is just either false or unknown.",
            "Also, despite the huge size of opinions of facts in the knowledge graph, they are still either incomplete or on some at sometimes inaccurate."
        ],
        [
            "One way.",
            "Of enhancing the quality of knowledge graph, and.",
            "Predicting new facts in the Knowledge Graph is mining rules or mining predicted route?",
            "So given this?",
            "This snapshot of a graph which contains that is married relationship is my relation and the living location.",
            "Here.",
            "We can learn some patterns from the graph, such as if two people are married, they live in the same place like in here 2 instances and we include it in form of horn rules, which says that if X is married to Y&Y lives with with that.",
            "Why lives in that that implies that X lives in the same place?",
            "However."
        ],
        [
            "This is not.",
            "Always valid, there is some exceptional cases.",
            "Which, namely.",
            "That's for the body of the rule, but not the head.",
            "So for example Bob is married to Alice.",
            "And.",
            "Hope lives in Pearland, so according to our rule, we expect that Alice also lives in Berlin.",
            "But this is not the case here.",
            "Alice lives in Amsterdam.",
            "In the second case, we know that Dave is married to Clara.",
            "Enclara lived in Chicago, but there is no information about the living place of death.",
            "Usually data mining people neglect these exceptions."
        ],
        [
            "In this work.",
            "We are aiming at.",
            "Learning the reason behind these exceptions.",
            "Why these are exceptional cases?",
            "Why are they do not follow that rule?",
            "And we want to revise our positive rules by adding this this attribute.",
            "So to the rule here."
        ],
        [
            "Converting it to what we call non monotonic.",
            "What is called number.",
            "So for example here.",
            "Now we know that from the graph that Alice and Dave are both researchers, which is.",
            "This is the common attribute or common reason for this being an exceptional cases.",
            "OK."
        ],
        [
            "Let's put our problem in a formal way, so.",
            "With Skype, our problem as a quality based theory revision problem where we are given a knowledge graph.",
            "A set of horn rules.",
            "And we want to provide this set of rules and.",
            "Nonmonotonic revision.",
            "Which predicts.",
            "Correct facts and only correct facts.",
            "Let's say if we have this ideal graph.",
            "Which contains all.",
            "True facts in the world.",
            "We mean and this is our original graph or input graph.",
            "We need to increase this prediction as much as possible to cover the ideal graph without increasing this red area or with minimizing this.",
            "Read area, which is false predictions.",
            "However.",
            "To measure our progress, idea graph is not.",
            "Is not known, therefore."
        ],
        [
            "We we are proposing two other criteria to measure this.",
            "First, maximizing the confidence of the rules.",
            "And minimizing the conflicts.",
            "Let me."
        ],
        [
            "Describe what we mean by conflicting, conflicting predictions between the rules.",
            "So.",
            "We introduced negations.",
            "Do the rules or not more tenacity.",
            "This will imply that there is some kind of implicit.",
            "Contradiction between the rules.",
            "So if we have this, let me explain that with an example.",
            "So if we have rules that says if X is a game and X is based on a Japanese enemy, this means that its first released in Japan.",
            "The second rule says if.",
            "If X has a Japanese composer that implies it is released in Japan unless.",
            "The publisher.",
            "Is located in USA."
        ],
        [
            "OK here for in this instance is a Pokémon Go, a famous one which we have is a game based businessman in Japanese.",
            "Enemy has a Japanese composer but the publisher in USA according to the first rule we will predict that is released in Japan.",
            "But according to the second rule, it says something like, OK, you should not predict that.",
            "It may not be.",
            "May release in Japan.",
            "Now we need to minimize this kind of conflict.",
            "Therefore we need to measure it.",
            "We need to measure how to measure this kind of conflict, which is hard because we cannot measure absence thing.",
            "An absolute."
        ],
        [
            "K Therefore we introduce auxiliary rules.",
            "XR rules is rewriting for the revised rule, and.",
            "In such format that we introduce a new head which is.",
            "Which is not released in Japan this is.",
            "A placeholder that this fact is might be unknown or might be false.",
            "And we realized that the rule such that if it has about US publisher and Japanese composers, so it should not be released in Japan.",
            "Now we can count by reducing this we can count for release in Japan and not religion Japan as a conflict."
        ],
        [
            "OK. How we construct the division here is starting, but mining home rules, extracting exception with set and constructing candidate revision and selecting the best revision.",
            "Let"
        ],
        [
            "Go step by step in this, so mining holds it worth mentioning here that we in this work we only focus on unary predicates where we have.",
            "Only in their biggest like types and also in to increase our data to make our data dense.",
            "We flatten the graph which is binary predicate into winery using some techniques described in the paper.",
            "Now we can look at the data in form of unity, which we have the entities at the transactions in data mining and.",
            "Features or attributes as are items.",
            "So given such rule like someone born in US implies that he lives in US.",
            "We can see that.",
            "The set of these are the set of rules which follow the.",
            "Transactions that follows the rule where the body and head satisfy and this set is abnormal cases where the body is satisfied but the head is not.",
            "OK. Now we need to figure out the exception candidates what is?",
            "Mix the abnormal cases or those who do not follow the rule.",
            "Actually an exception.",
            "Therefore, we captured these attributes that exist with the abnormal cases, but not with the normal cases.",
            "For example, here immigrant appears in the abnormal, but not in the normal.",
            "So this is we add this to our exception witness seconded exceptional set, which contains a candidate of possible exceptions."
        ],
        [
            "From this set and the whole rule.",
            "We create all possible revisions.",
            "The revision contains only one exception for the rule.",
            "For each rule we add one exception, which creates the revision."
        ],
        [
            "Now we need to select the best revision.",
            "Since we have a set of rule, not just one we can, we need to sell to the optimum cases to select a global best revision, which is which is in this case is really expensive since we have a very huge set of provisions.",
            "Therefore we need a greedy or approximate solution.",
            "So we will solve.",
            "We solve that on local level.",
            "So for each rule we choose the best revision.",
            "Therefore we have introduced several ranking method for their vision, first one if then if we're just we are aiming at maximizing the confidence.",
            "And this is has one problem that solves the rule in isolation from the others, which means.",
            "That it is proven to incompleteness in the data.",
            "So we introduce a partial maturation ranking rancor.",
            "Burcham attrition rancor is.",
            "Comes from the fact that knowledge base bases are incomplete.",
            "Therefore we need to make to make like to compensate this incompleteness.",
            "So whenever we are.",
            "Processing one or finding the revisions.",
            "For one rule, we materialize or we use other rules to predict.",
            "Missing information for prediction.",
            "Let me show an example for that."
        ],
        [
            "So.",
            "If we have this, our recording our data snapshot of the data and let's say that we are searching for the best revision for this rule.",
            "Now we will use other rules in their own ruleset.",
            "We."
        ],
        [
            "We haven't as an input to fill some gaps in the debt.",
            "When we fill these gaps, we can now have some kind of an expectation for how the other rule behavior, and we can rank the exception accordingly."
        ],
        [
            "We did two other variation from this which.",
            "Order partial materialization.",
            "The intuition is we only we only use the predictions of better quality rules, not all of them, and order and weighted, which intuitively say that OK, the prediction of the original fact in the graph.",
            "Should are better than those who are predicted, so we give them one weight of 1 and whatever is predicted inherits the weights from the rules predicted them."
        ],
        [
            "OK, so for the experiments.",
            "We need to.",
            "We need to expand our to evaluate our methods on data real data sets.",
            "So we did that on Jago and IMDb Jago is 10,000,000 facts.",
            "And so we got 10,000 rules while IMDb have 2 million facts and we got 25,000 rules.",
            "The first thing is to evaluate the our criteria.",
            "Our current area contains the 1st first part of our curriculum, rules, ruleset, quality, the quality of the ruleset where.",
            "We measure it using the average confidence of the average confidence over the set.",
            "Here we can see in the Gray the whole rules.",
            "And in Orange, the naive approach, which is just greedy, tries to pick the highest confidence and in green comes the ordered and waited version materialization.",
            "And we do that for top 25th, 40 and 60% of the rules.",
            "We can see that.",
            "Always in all cases the partial as the revisions achieved.",
            "Higher, average confident than their own rules.",
            "This also for IMDb.",
            "Now it's also worth mentioning that, OK, the naive approach and or despite this OK approach achieved higher.",
            "Higher average confidence but order personalization.",
            "They didn't lose a lot.",
            "But when we come to the."
        ],
        [
            "Consistency of predictions.",
            "How the prediction are in harmony?",
            "Or are they conflicting each other?",
            "We can find that.",
            "If we measure the number of conflicts.",
            "So.",
            "What should a partial materialization achieve better results?",
            "So here the lower the results, the better the consistency or the rule set.",
            "So we can say see that the rules.",
            "Asians here are much are better than the naive approach.",
            "In sense of that, consistent with prediction."
        ],
        [
            "Now let me show you example of the rules.",
            "So if we have a something exist in stereo and also in Italy.",
            "So this implies that this amount, and unless it is ever this is a real rules, comes from our knowledge graphs.",
            "And also here.",
            "So if someone is a government and born in US, that means he's a politician of US.",
            "Unless he is a politician of Puerto Rico.",
            "Also another one comes from IMDb which says created someone created a movie and acted in movie so common his Hollywood.",
            "So he is from USA unless he won a Filmfare which in Hindi Hindi language price."
        ],
        [
            "Let me summarize with our contribution.",
            "Here we introduce a quality based theory revision under the open world assumption.",
            "Partial materialization for ranking revisions and we compared our different ranking function or real life knowledge graphs.",
            "Our outlook.",
            "OK, so normally the normal question is OK. What about pointer relation with the graph is binary yur what about binary?",
            "Now we already started working the binary and we achieved a lot of progress in that and it is just published an ILB 2016.",
            "Also we are aiming at extracting evidence from text corpora to enhance the exception choosing and finally exploit partial materialization information.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Welcome everyone I'm Hamid.",
                    "label": 0
                },
                {
                    "sent": "Gather up PhD student in Max Planck Institute, Germany.",
                    "label": 0
                },
                {
                    "sent": "This work is.",
                    "label": 0
                },
                {
                    "sent": "I'm here to present exception reached through learning from knowledge graphs.",
                    "label": 1
                },
                {
                    "sent": "This joint work with Daria Stepanova, an Albanian Gerhard Weikum.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now all of us knows what is knowledge graphs.",
                    "label": 1
                },
                {
                    "sent": "I want just to deliver to message about knowledge Graph here that the contains only positive facts under the open world assumption.",
                    "label": 1
                },
                {
                    "sent": "So whatever is missing from a knowledge graph, we cannot assume it is false.",
                    "label": 0
                },
                {
                    "sent": "It is just either false or unknown.",
                    "label": 0
                },
                {
                    "sent": "Also, despite the huge size of opinions of facts in the knowledge graph, they are still either incomplete or on some at sometimes inaccurate.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One way.",
                    "label": 0
                },
                {
                    "sent": "Of enhancing the quality of knowledge graph, and.",
                    "label": 0
                },
                {
                    "sent": "Predicting new facts in the Knowledge Graph is mining rules or mining predicted route?",
                    "label": 1
                },
                {
                    "sent": "So given this?",
                    "label": 0
                },
                {
                    "sent": "This snapshot of a graph which contains that is married relationship is my relation and the living location.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "We can learn some patterns from the graph, such as if two people are married, they live in the same place like in here 2 instances and we include it in form of horn rules, which says that if X is married to Y&Y lives with with that.",
                    "label": 0
                },
                {
                    "sent": "Why lives in that that implies that X lives in the same place?",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "Always valid, there is some exceptional cases.",
                    "label": 0
                },
                {
                    "sent": "Which, namely.",
                    "label": 0
                },
                {
                    "sent": "That's for the body of the rule, but not the head.",
                    "label": 0
                },
                {
                    "sent": "So for example Bob is married to Alice.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Hope lives in Pearland, so according to our rule, we expect that Alice also lives in Berlin.",
                    "label": 0
                },
                {
                    "sent": "But this is not the case here.",
                    "label": 0
                },
                {
                    "sent": "Alice lives in Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "In the second case, we know that Dave is married to Clara.",
                    "label": 0
                },
                {
                    "sent": "Enclara lived in Chicago, but there is no information about the living place of death.",
                    "label": 0
                },
                {
                    "sent": "Usually data mining people neglect these exceptions.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this work.",
                    "label": 0
                },
                {
                    "sent": "We are aiming at.",
                    "label": 0
                },
                {
                    "sent": "Learning the reason behind these exceptions.",
                    "label": 0
                },
                {
                    "sent": "Why these are exceptional cases?",
                    "label": 0
                },
                {
                    "sent": "Why are they do not follow that rule?",
                    "label": 0
                },
                {
                    "sent": "And we want to revise our positive rules by adding this this attribute.",
                    "label": 0
                },
                {
                    "sent": "So to the rule here.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Converting it to what we call non monotonic.",
                    "label": 0
                },
                {
                    "sent": "What is called number.",
                    "label": 0
                },
                {
                    "sent": "So for example here.",
                    "label": 0
                },
                {
                    "sent": "Now we know that from the graph that Alice and Dave are both researchers, which is.",
                    "label": 0
                },
                {
                    "sent": "This is the common attribute or common reason for this being an exceptional cases.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's put our problem in a formal way, so.",
                    "label": 0
                },
                {
                    "sent": "With Skype, our problem as a quality based theory revision problem where we are given a knowledge graph.",
                    "label": 1
                },
                {
                    "sent": "A set of horn rules.",
                    "label": 1
                },
                {
                    "sent": "And we want to provide this set of rules and.",
                    "label": 0
                },
                {
                    "sent": "Nonmonotonic revision.",
                    "label": 0
                },
                {
                    "sent": "Which predicts.",
                    "label": 0
                },
                {
                    "sent": "Correct facts and only correct facts.",
                    "label": 0
                },
                {
                    "sent": "Let's say if we have this ideal graph.",
                    "label": 0
                },
                {
                    "sent": "Which contains all.",
                    "label": 0
                },
                {
                    "sent": "True facts in the world.",
                    "label": 0
                },
                {
                    "sent": "We mean and this is our original graph or input graph.",
                    "label": 0
                },
                {
                    "sent": "We need to increase this prediction as much as possible to cover the ideal graph without increasing this red area or with minimizing this.",
                    "label": 0
                },
                {
                    "sent": "Read area, which is false predictions.",
                    "label": 0
                },
                {
                    "sent": "However.",
                    "label": 0
                },
                {
                    "sent": "To measure our progress, idea graph is not.",
                    "label": 0
                },
                {
                    "sent": "Is not known, therefore.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We we are proposing two other criteria to measure this.",
                    "label": 0
                },
                {
                    "sent": "First, maximizing the confidence of the rules.",
                    "label": 0
                },
                {
                    "sent": "And minimizing the conflicts.",
                    "label": 0
                },
                {
                    "sent": "Let me.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Describe what we mean by conflicting, conflicting predictions between the rules.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We introduced negations.",
                    "label": 0
                },
                {
                    "sent": "Do the rules or not more tenacity.",
                    "label": 0
                },
                {
                    "sent": "This will imply that there is some kind of implicit.",
                    "label": 0
                },
                {
                    "sent": "Contradiction between the rules.",
                    "label": 0
                },
                {
                    "sent": "So if we have this, let me explain that with an example.",
                    "label": 0
                },
                {
                    "sent": "So if we have rules that says if X is a game and X is based on a Japanese enemy, this means that its first released in Japan.",
                    "label": 0
                },
                {
                    "sent": "The second rule says if.",
                    "label": 0
                },
                {
                    "sent": "If X has a Japanese composer that implies it is released in Japan unless.",
                    "label": 0
                },
                {
                    "sent": "The publisher.",
                    "label": 0
                },
                {
                    "sent": "Is located in USA.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK here for in this instance is a Pokémon Go, a famous one which we have is a game based businessman in Japanese.",
                    "label": 0
                },
                {
                    "sent": "Enemy has a Japanese composer but the publisher in USA according to the first rule we will predict that is released in Japan.",
                    "label": 0
                },
                {
                    "sent": "But according to the second rule, it says something like, OK, you should not predict that.",
                    "label": 0
                },
                {
                    "sent": "It may not be.",
                    "label": 0
                },
                {
                    "sent": "May release in Japan.",
                    "label": 0
                },
                {
                    "sent": "Now we need to minimize this kind of conflict.",
                    "label": 0
                },
                {
                    "sent": "Therefore we need to measure it.",
                    "label": 0
                },
                {
                    "sent": "We need to measure how to measure this kind of conflict, which is hard because we cannot measure absence thing.",
                    "label": 0
                },
                {
                    "sent": "An absolute.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "K Therefore we introduce auxiliary rules.",
                    "label": 0
                },
                {
                    "sent": "XR rules is rewriting for the revised rule, and.",
                    "label": 0
                },
                {
                    "sent": "In such format that we introduce a new head which is.",
                    "label": 0
                },
                {
                    "sent": "Which is not released in Japan this is.",
                    "label": 0
                },
                {
                    "sent": "A placeholder that this fact is might be unknown or might be false.",
                    "label": 0
                },
                {
                    "sent": "And we realized that the rule such that if it has about US publisher and Japanese composers, so it should not be released in Japan.",
                    "label": 0
                },
                {
                    "sent": "Now we can count by reducing this we can count for release in Japan and not religion Japan as a conflict.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. How we construct the division here is starting, but mining home rules, extracting exception with set and constructing candidate revision and selecting the best revision.",
                    "label": 0
                },
                {
                    "sent": "Let",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go step by step in this, so mining holds it worth mentioning here that we in this work we only focus on unary predicates where we have.",
                    "label": 0
                },
                {
                    "sent": "Only in their biggest like types and also in to increase our data to make our data dense.",
                    "label": 0
                },
                {
                    "sent": "We flatten the graph which is binary predicate into winery using some techniques described in the paper.",
                    "label": 0
                },
                {
                    "sent": "Now we can look at the data in form of unity, which we have the entities at the transactions in data mining and.",
                    "label": 0
                },
                {
                    "sent": "Features or attributes as are items.",
                    "label": 0
                },
                {
                    "sent": "So given such rule like someone born in US implies that he lives in US.",
                    "label": 0
                },
                {
                    "sent": "We can see that.",
                    "label": 0
                },
                {
                    "sent": "The set of these are the set of rules which follow the.",
                    "label": 0
                },
                {
                    "sent": "Transactions that follows the rule where the body and head satisfy and this set is abnormal cases where the body is satisfied but the head is not.",
                    "label": 0
                },
                {
                    "sent": "OK. Now we need to figure out the exception candidates what is?",
                    "label": 0
                },
                {
                    "sent": "Mix the abnormal cases or those who do not follow the rule.",
                    "label": 0
                },
                {
                    "sent": "Actually an exception.",
                    "label": 0
                },
                {
                    "sent": "Therefore, we captured these attributes that exist with the abnormal cases, but not with the normal cases.",
                    "label": 0
                },
                {
                    "sent": "For example, here immigrant appears in the abnormal, but not in the normal.",
                    "label": 0
                },
                {
                    "sent": "So this is we add this to our exception witness seconded exceptional set, which contains a candidate of possible exceptions.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From this set and the whole rule.",
                    "label": 0
                },
                {
                    "sent": "We create all possible revisions.",
                    "label": 0
                },
                {
                    "sent": "The revision contains only one exception for the rule.",
                    "label": 0
                },
                {
                    "sent": "For each rule we add one exception, which creates the revision.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we need to select the best revision.",
                    "label": 0
                },
                {
                    "sent": "Since we have a set of rule, not just one we can, we need to sell to the optimum cases to select a global best revision, which is which is in this case is really expensive since we have a very huge set of provisions.",
                    "label": 0
                },
                {
                    "sent": "Therefore we need a greedy or approximate solution.",
                    "label": 0
                },
                {
                    "sent": "So we will solve.",
                    "label": 0
                },
                {
                    "sent": "We solve that on local level.",
                    "label": 0
                },
                {
                    "sent": "So for each rule we choose the best revision.",
                    "label": 0
                },
                {
                    "sent": "Therefore we have introduced several ranking method for their vision, first one if then if we're just we are aiming at maximizing the confidence.",
                    "label": 0
                },
                {
                    "sent": "And this is has one problem that solves the rule in isolation from the others, which means.",
                    "label": 0
                },
                {
                    "sent": "That it is proven to incompleteness in the data.",
                    "label": 0
                },
                {
                    "sent": "So we introduce a partial maturation ranking rancor.",
                    "label": 0
                },
                {
                    "sent": "Burcham attrition rancor is.",
                    "label": 0
                },
                {
                    "sent": "Comes from the fact that knowledge base bases are incomplete.",
                    "label": 0
                },
                {
                    "sent": "Therefore we need to make to make like to compensate this incompleteness.",
                    "label": 0
                },
                {
                    "sent": "So whenever we are.",
                    "label": 0
                },
                {
                    "sent": "Processing one or finding the revisions.",
                    "label": 0
                },
                {
                    "sent": "For one rule, we materialize or we use other rules to predict.",
                    "label": 0
                },
                {
                    "sent": "Missing information for prediction.",
                    "label": 0
                },
                {
                    "sent": "Let me show an example for that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If we have this, our recording our data snapshot of the data and let's say that we are searching for the best revision for this rule.",
                    "label": 1
                },
                {
                    "sent": "Now we will use other rules in their own ruleset.",
                    "label": 0
                },
                {
                    "sent": "We.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We haven't as an input to fill some gaps in the debt.",
                    "label": 0
                },
                {
                    "sent": "When we fill these gaps, we can now have some kind of an expectation for how the other rule behavior, and we can rank the exception accordingly.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We did two other variation from this which.",
                    "label": 0
                },
                {
                    "sent": "Order partial materialization.",
                    "label": 0
                },
                {
                    "sent": "The intuition is we only we only use the predictions of better quality rules, not all of them, and order and weighted, which intuitively say that OK, the prediction of the original fact in the graph.",
                    "label": 0
                },
                {
                    "sent": "Should are better than those who are predicted, so we give them one weight of 1 and whatever is predicted inherits the weights from the rules predicted them.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so for the experiments.",
                    "label": 0
                },
                {
                    "sent": "We need to.",
                    "label": 0
                },
                {
                    "sent": "We need to expand our to evaluate our methods on data real data sets.",
                    "label": 0
                },
                {
                    "sent": "So we did that on Jago and IMDb Jago is 10,000,000 facts.",
                    "label": 0
                },
                {
                    "sent": "And so we got 10,000 rules while IMDb have 2 million facts and we got 25,000 rules.",
                    "label": 0
                },
                {
                    "sent": "The first thing is to evaluate the our criteria.",
                    "label": 0
                },
                {
                    "sent": "Our current area contains the 1st first part of our curriculum, rules, ruleset, quality, the quality of the ruleset where.",
                    "label": 0
                },
                {
                    "sent": "We measure it using the average confidence of the average confidence over the set.",
                    "label": 0
                },
                {
                    "sent": "Here we can see in the Gray the whole rules.",
                    "label": 0
                },
                {
                    "sent": "And in Orange, the naive approach, which is just greedy, tries to pick the highest confidence and in green comes the ordered and waited version materialization.",
                    "label": 0
                },
                {
                    "sent": "And we do that for top 25th, 40 and 60% of the rules.",
                    "label": 0
                },
                {
                    "sent": "We can see that.",
                    "label": 0
                },
                {
                    "sent": "Always in all cases the partial as the revisions achieved.",
                    "label": 0
                },
                {
                    "sent": "Higher, average confident than their own rules.",
                    "label": 0
                },
                {
                    "sent": "This also for IMDb.",
                    "label": 0
                },
                {
                    "sent": "Now it's also worth mentioning that, OK, the naive approach and or despite this OK approach achieved higher.",
                    "label": 0
                },
                {
                    "sent": "Higher average confidence but order personalization.",
                    "label": 0
                },
                {
                    "sent": "They didn't lose a lot.",
                    "label": 0
                },
                {
                    "sent": "But when we come to the.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Consistency of predictions.",
                    "label": 0
                },
                {
                    "sent": "How the prediction are in harmony?",
                    "label": 0
                },
                {
                    "sent": "Or are they conflicting each other?",
                    "label": 0
                },
                {
                    "sent": "We can find that.",
                    "label": 0
                },
                {
                    "sent": "If we measure the number of conflicts.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What should a partial materialization achieve better results?",
                    "label": 0
                },
                {
                    "sent": "So here the lower the results, the better the consistency or the rule set.",
                    "label": 0
                },
                {
                    "sent": "So we can say see that the rules.",
                    "label": 0
                },
                {
                    "sent": "Asians here are much are better than the naive approach.",
                    "label": 0
                },
                {
                    "sent": "In sense of that, consistent with prediction.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let me show you example of the rules.",
                    "label": 0
                },
                {
                    "sent": "So if we have a something exist in stereo and also in Italy.",
                    "label": 0
                },
                {
                    "sent": "So this implies that this amount, and unless it is ever this is a real rules, comes from our knowledge graphs.",
                    "label": 0
                },
                {
                    "sent": "And also here.",
                    "label": 0
                },
                {
                    "sent": "So if someone is a government and born in US, that means he's a politician of US.",
                    "label": 0
                },
                {
                    "sent": "Unless he is a politician of Puerto Rico.",
                    "label": 0
                },
                {
                    "sent": "Also another one comes from IMDb which says created someone created a movie and acted in movie so common his Hollywood.",
                    "label": 0
                },
                {
                    "sent": "So he is from USA unless he won a Filmfare which in Hindi Hindi language price.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me summarize with our contribution.",
                    "label": 0
                },
                {
                    "sent": "Here we introduce a quality based theory revision under the open world assumption.",
                    "label": 0
                },
                {
                    "sent": "Partial materialization for ranking revisions and we compared our different ranking function or real life knowledge graphs.",
                    "label": 0
                },
                {
                    "sent": "Our outlook.",
                    "label": 0
                },
                {
                    "sent": "OK, so normally the normal question is OK. What about pointer relation with the graph is binary yur what about binary?",
                    "label": 0
                },
                {
                    "sent": "Now we already started working the binary and we achieved a lot of progress in that and it is just published an ILB 2016.",
                    "label": 0
                },
                {
                    "sent": "Also we are aiming at extracting evidence from text corpora to enhance the exception choosing and finally exploit partial materialization information.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}