{
    "id": "nc665juucz7llhch2gxafa5bwaswfobt",
    "title": "Contextual Synchronization on Social Collaboration",
    "info": {
        "author": [
            "Jason J. Jung, Computer Engineering Department, Yeungnam University"
        ],
        "published": "Nov. 20, 2013",
        "recorded": "June 2013",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/wims2013_jung_social_collaboration/",
    "segmentation": [
        [
            "Thank you very much for the kind introduction.",
            "Yeah, it's David.",
            "Say I'm from Korea an actually the build number versus my origonal affiliation but bring myself till I'm staying in Vietnam which makes it here.",
            "And we have a really good relationship now, so it's supposed.",
            "I mean, they're asking me to have a murder.",
            "Extension right so?",
            "But then we risk assessment.",
            "Haha, doing 10 University and also I have all the appreciation from Malaysia quality.",
            "Improve yourself maliah so it took the lights.",
            "3 appreciation holy power locally so."
        ],
        [
            "So."
        ],
        [
            "I well since they allow me to be here, I have to say.",
            "Information about my operations.",
            "So my original population name University is located in Mount Airy, who not?",
            "So it's.",
            "It takes 2 hours by train from Seoul to my city.",
            "It's just the center of the South Korea.",
            "Spell population is almost 3 million people, but we got city."
        ],
        [
            "And second affiliation.",
            "Map can University in Virginia City don't use very.",
            "Are you sleepy?",
            "If you have a chance to visit you had come there really big city around eight 8 million population people.",
            "People first like I'm at work now."
        ],
        [
            "Also, I have another position in Malaysia.",
            "The universe in my life is very.",
            "The universe case of very long history more than 100 years old.",
            "The population is almost 3 million.",
            "1.5 million people in horrible, very corrupt people.",
            "Very large number of people coming through so.",
            "Well, actually the reason I am talking about these two additional regulation is that.",
            "The developing country like Malaysia and you definitely have a lot of opportunity for you to to research too.",
            "Yes, some job.",
            "Some position in there.",
            "So very international lies.",
            "But please matrices, so yeah.",
            "I mean I already have a little question Jason, do you have any?",
            "Colleagues who want to join their University so.",
            "Yeah so."
        ],
        [
            "This while introducing some information.",
            "So today what I want to explain and what I want to share with you is.",
            "It's about this contextual synchronization and social collaboration.",
            "Um, possibility I'm interested in virtual enterprises, virtual organizations.",
            "They've been trying to.",
            "Collaborate with other enterprises because the the problem is very complex and they just want to share their knowledge and information with other organizations.",
            "So it's very difficult, so there are so many works about the network enterprises, so using the police or using some web service platform, then if they try to share the information may be correct design the new framework for the enterprises.",
            "Both especially I'm interested in the people actually Bill yesterday, the professor on the ship was talking about the not only the.",
            "Collaboration between the.",
            "Machines does this.",
            "Let me talk a bit to the systems.",
            "Will also.",
            "His empathy was emphasizing that down.",
            "The human experience was a human experience is really important to to have some.",
            "Selma decimate intelligence.",
            "Great, so we have to understand the context of people and we have to support people to have a really good service, intelligence, services and so on.",
            "So he mentioned that on the enterprises want to share the information with others and people in the enterprises.",
            "They may get a large number of information knowledge.",
            "They had understand and they they gave me to collaborate with other people in other enterprises.",
            "This is really big problem, complex problem and the main goal of this work is to support people to collaborate without peoples in other domain in other enterprises in other organisations.",
            "OK, so."
        ],
        [
            "Um?",
            "Of course there are so many systems tools believing well, I just saw my information from the web.",
            "These tools are open source so you can get some source.",
            "Then you can apply this tool into into your home and edges.",
            "And if you continue your company to share the information with people between duties.",
            "So, um.",
            "So there are so many so many systems already.",
            "But here basically there using the Globes and weakest.",
            "Well, this is generally quite similar.",
            "They are using the weekly for example.",
            "They put a lot of informations and the web and they quoted eating certain information and resource.",
            "In their organizers, I saw one paper about the.",
            "Distributed semantical wiki.",
            "So the one particular key was having the elearning system so so we University professors are building the week system different disability and the students are participating in certain wiki.",
            "They have some collaborations in the week so it was quest.",
            "Quite similar in general."
        ],
        [
            "But in our work we are targeting 2 main issues.",
            "One is the social contextualization and 2nd is social media communications before.",
            "William to the main issue I had to define why so contextual synchronization so."
        ],
        [
            "OK."
        ],
        [
            "So what is this context shows?",
            "Apologies, of course you know you are much better than I am about this."
        ],
        [
            "Pronunciation is very general definition from the dictionary, so happening or existing arising at recycling at the same time at the same time or certain events.",
            "Occur happened in different spaces, places and or crying or operating exactly same.",
            "So if you see stuff from the dictionary."
        ],
        [
            "Like it like this synchronized swimming, the pupils are acting the same way.",
            "And also the the other picture is the.",
            "Fireflies so nature.",
            "You have a little synchronized the.",
            "People may not.",
            "Um, well, ipx already.",
            "One paper about Ant colony so swarm intelligence, they do some synchronized action.",
            "You take up a lot of interesting informations on that."
        ],
        [
            "So in in our perspective computer science, the data synchronization records to the idea of keeping multiple copies blah blah blah blah blah, so may not be here is multiple copy.",
            "No, multiple systems in distributed environment and also they have to maintain the data integrity right?",
            "So the data from the distributive multiple sources the data should be.",
            "Tax consequences right?",
            "Well, this is just general office."
        ],
        [
            "Concept on synchronizations, so there is many systems distributed environments and they send the information.",
            "They acknowledge the information and send OK technology.",
            "This is served very general idea about the superannuation they sent information.",
            "They had the information technology with each other and so on."
        ],
        [
            "So why is the hunting show SQL injections?",
            "It's very simple definition, so we have to we have to.",
            "We have to be aware of the text with other systems, right?",
            "So we have to understand what it mean in other systems or in other.",
            "Users for example.",
            "So we have two people aware of the context.",
            "Open multiple users and maintain that effectively so fine by considering the context so.",
            "So for example, if you OK, so this is the basic definition of the word is the contextual synchronization."
        ],
        [
            "And, um.",
            "We can see all Eric Synchronization.",
            "I mean the contextual synchronization in the online social network.",
            "For example, if you see the information propagation diffusion, there's a new information on prior for example, but you information is propagated to other peoples, network, retweet and so on."
        ],
        [
            "And just like a flu, so you have a flu and is experiencing epidemic.",
            "So the flu is contagious to other peoples."
        ],
        [
            "So also we have some interesting idea about behavioral remixing, so our brain with some particular parts are made in the same way without conditions.",
            "So if you have some gestural like this and peoples are doing in the same way unconsciously without your conscious, the your body's moving in the same way.",
            "So this is very interesting idea."
        ],
        [
            "Something like this?"
        ],
        [
            "So also we know and I know there is a protest in Spain now.",
            "Um?",
            "Well, also knowing when Wall Street there more protest about the economic crisis, right?",
            "So peoples are doing in the same way they may have some problem and the problem is synchronized with other peoples and they're doing in the same way.",
            "I mean, pick down demonstration in this society."
        ],
        [
            "Also, there are countries that have the.",
            "Then Democratic, not right.",
            "And peoples are doing the same way.",
            "The information is synchronized and they had.",
            "Somehow they agree with the problem.",
            "I mean, they're feeding the problem somehow.",
            "They get doing the same thing, so."
        ],
        [
            "So one of the system we try to Patch or the context with imagining install ciety, which is called table we are using."
        ],
        [
            "The."
        ],
        [
            "We just want to capture key.",
            "How you Commission is propagated, how how quickly and."
        ],
        [
            "How widely on social?"
        ],
        [
            "Apple."
        ],
        [
            "So we tried to beat us with your pulse."
        ],
        [
            "And."
        ],
        [
            "From the enemy we."
        ],
        [
            "Extended into the temporal tsunami."
        ],
        [
            "So we have a demo, but then I just capture."
        ],
        [
            "Or someone else access here so we are using the.",
            "Flickr, the whole sharing system in which mental?",
            "We can get the time or the.",
            "All that ending or the time of the.",
            "So we can capture the time information when the picture has been loaded in the Flickr.",
            "Then we aggregated and we bills on."
        ],
        [
            "Some times is data something like this or the red one?"
        ],
        [
            "Grade one is Libya and the woman is Egypt.",
            "So we try to picture the time information and we try to build a lot of the times three data.",
            "So here you can see the how many picture has been uploaded into Flickr.",
            "The Egypt and Libya is the keyword.",
            "OK, we search.",
            "We've got the information on the number of photos which are tagged by.",
            "Egypt and Libya."
        ],
        [
            "If you see though there was, he is showing the revolution at the Belgian television at that time."
        ],
        [
            "And then there is articulation phenomena between the country from Egypt to Livia.",
            "So we realize that we can see there's a time shift from the blue line to the red line, right?"
        ],
        [
            "It's also not only the secret with us, we are targeting the Twitter so we can get the.",
            "Twitters tweets from Twitter.",
            "And we try to build some systems which can capture the relationship between the keyword, like the Libyan shipped and so on.",
            "So I saw a lot of papers about Twitter yesterday and it was quite interesting for me also.",
            "So just like the three plus we can draw the line signals like these so.",
            "This data is coming from was coming from the Korean election presidential election last year.",
            "last December we had a presidential election in Korea, so we got some information from Twitter.",
            "How many peoples are talking about certain candidates?",
            "Then we try to compare how many I mean.",
            "Who was the more influential person in clear environment?",
            "So so we somehow we tried.",
            "Understand the contextual synchronization between the candidates to the certain objective.",
            "Many Facebook right?",
            "So they I mean some fantastic.",
            "I'll try to do this.",
            "Can we try to make it?",
            "Because it makes a significant influence to the capital now so so we try to understand the relationship between the candidate to the certain.",
            "Look up, but I joined up right?"
        ],
        [
            "The second was also, well, basically, the constituency contextual synchronization is to understand.",
            "Holder information is propagated to other peoples and how how the information is sent or received.",
            "In the end, by considering the context, will personal or the context of communities or context of bills of sight, and so on.",
            "So next one is social contextualization."
        ],
        [
            "So there are so many Contacts or resistance, for example, location right?",
            "So as I already said on.",
            "We have to consider context to users, so we want to send the information to a target user, but we have to understand the context.",
            "We have to be aware of in text where it is, when it is now OK.",
            "So now I'm in the Madrid.",
            "Uh, the location and also I'm in the now.",
            "It's morning right?",
            "So for example, I will give more detail later on, But for example telecommunication company, they want to send a certain information to me, but I'm doing a talk right?",
            "So if I guess some information.",
            "Right now, then the information is trash.",
            "It's not useful anymore, so I will delete.",
            "So you have to understand my context, location and what's happening with him and so on, right?",
            "Well, so far I saw many papers and they they only consider the location in time.",
            "But here the social contextualization.",
            "I mean we have to consider the social context right?"
        ],
        [
            "The function there's a movie, pimps movie, social network is about the Facebook."
        ],
        [
            "So the market report he has allowed social networks, social relationship with other peoples like these."
        ],
        [
            "And somehow so there is a relationship on Facebook."
        ],
        [
            "And also every so relationship Twitter."
        ],
        [
            "There is also a relationship in public risk.",
            "It means mark.",
            "Here he has a lot of social network.",
            "But the problem is that the social relationship is distributed not in the same social network services.",
            "They put some social network is in Facebook social network in two year and so on.",
            "OK so."
        ],
        [
            "One of my world is to integrate.",
            "Although social network are distributed in different systems, need to work OK."
        ],
        [
            "So we try to build eco centric social network.",
            "So once we have the angle centric social network then we can have better service to them, OK?"
        ],
        [
            "So for example, is just basic, very simple."
        ],
        [
            "An example, so this is.",
            "Oh from Flickr.",
            "So we had some measure application, so Google Megan Sleeper we search a certain information.",
            "OK, this is just like getting old.",
            "Horse in this area.",
            "OK, this is first idea, but I just want to know.",
            "The Cold War, which are related to my friend OK?"
        ],
        [
            "Not everyone so."
        ],
        [
            "So we can reduce the number of results probably occur, and I just want to get the pool to only the photo of all known it by my friend.",
            "OK, by considering the social networks.",
            "OK, so here I'm considering social network as a social context magically location, but also we have to consider the social context."
        ],
        [
            "So we had people out of context Fusion.",
            "'cause I'm talking about.",
            "We have other contexts like not only location time, but also we have the social context.",
            "So how we can choose all available context?",
            "This is the issue, OK?",
            "Yeah, so the.",
            "So we have."
        ],
        [
            "Consider how to integrate all available context and we have to contextualize it, OK?"
        ],
        [
            "So scenario for the context version is very simple and very interesting.",
            "Examples are my colleagues like this one.",
            "So it is my birthday which is my wife's birthday tomorrow and now I'm in the fair today.",
            "So I'm passing through the space for under the recently I have the technical meeting near and sold."
        ],
        [
            "Then we consider all possible to fix ladies.",
            "So for example, in from my smartphone.",
            "At least I can detect the location right where I am right?",
            "So now I am near sold and that's why college ample we have the.",
            "The feature on the Skype we can detect who is I mean.",
            "Who has the birthday right?",
            "So for example today or tomorrow, it will be your friend's birthday on tonight then.",
            "And also Facebook and Sidewalk is the Korean Social Network Service and link is on so we can get more context.",
            "For example, my wife's favorite movies in Facebook, the preprints, or interest from the other social network.",
            "And Foursquare this is what the famous location with social network service.",
            "So we can check in and also we can get some reputation about the location.",
            "So if there are any famous restaurant near so something like that quickly.",
            "OK. And then from figure we can get some information about the other information about the from the companies to projectile, various Department store called LK in in class.",
            "Except.",
            "So there is no other contextual information from the Twitter.",
            "So for example, OK is Department store or promoting some products or service.",
            "Then somehow the recommendation system.",
            "The company they can collect all possible the contextual information they make, use it and they desire OK, Jason will get the misinformation.",
            "Then he will use it.",
            "Unlikely so this is this scenario can be applied in various.",
            "We do small deals.",
            "You said probably telling the company they are very.",
            "No interested in this kind of scenarios because they just want to get the money.",
            "I mean not only those.",
            "Oh subscription fee, but also they want to provide some service then they want to get the money from the customers."
        ],
        [
            "So we keep some collaboration with a pedicure telecommunication company Korea.",
            "So the one of the major companies in Korea is that is the Korean Telecom Katie.",
            "So we need some projects.",
            "So basically in the previous slide, the."
        ],
        [
            "The social network project my wife.",
            "Who is my wife is from the.",
            "Looks like we can get it.",
            "The explicit social network promo certain social network service, but the problem."
        ],
        [
            "Yes.",
            "We want to get more social network.",
            "OK so telecommunications company that Kiki 12 discover.",
            "Who is Jason's friend?",
            "Who is the days with family members?",
            "Who is the student of Jason?",
            "Who is the one thing like that?",
            "OK, so the telecom Engineer telecommunication company.",
            "No.",
            "Big Dick little over information about the telephone, the quality patents.",
            "OK. For example, you can't make a phone call to the big data.",
            "Can't decide.",
            "OK these two people.",
            "Have some social relationship OK?",
            "So in this project we have some data mining tools.",
            "And we try to understand we could trade, discover the vehicle patterns, I mean social networks by analyzing the quality, pattern public data.",
            "So how open?",
            "These two peoples are making a phone call or how?",
            "Hello OK, along with something like this so the telephone company has now running up Cody pattern but also they can track the location.",
            "OK there is a station and if I'm near those patient located in sold maybe cycle cases looking so for something like that.",
            "So especially in this project we discover a lot of interesting patterns.",
            "For example at nights.",
            "If I have if I'm looking in the same place with other people then they decide OK they are in the same family both day living in the same place, same house, right there.",
            "Assuming the same place to decide between these two people, sign in the same family.",
            "And also, though we have the Social Security number and we can analyze the.",
            "I.",
            "Move more precise competitors, more precise social networks.",
            "OK, by analyzing the Social Security number.",
            "I don't know in Spain or USA, but we can discover the gender or the birthday birthplace and birthday, of course, and so on.",
            "So somehow we can discover we can decide the social, social network Twitter peoples very easily very efficiently.",
            "Um and also we pass better.",
            "I mean, in the first day we discovered that the simple social network that we took the semantic informations to expand the social network.",
            "So not only the family we want to discover for peace or Father who is the mother which the Bluetooth Internet.",
            "OK.",
            "Put the finally built this projector screen.",
            "Well, I was failed because the we have a lot of problem on privacy issues because we have a lot of data from chemical company.",
            "Then we try to analyze it but we have no answers.",
            "We have no way to evaluate because we cannot ask the customers.",
            "OK you have this relationship.",
            "Is it correct or not?",
            "So there's no way to begin with?",
            "And now they're using the existing in the Post Office marketing, so they try to understand more efficiently about the customers for the CRM customer relationship management.",
            "And also there's another problem, because we have a three major companies in Korea or color communication.",
            "But here we are cooperating with only one company.",
            "So if I had my phone call with other people who are using different companies, the Metro PCs, we cannot discover the divisions between other peoples.",
            "This is another problem.",
            "Um?",
            "And also the honest problem is.",
            "If you get really.",
            "Personal personalized service without any agreement.",
            "Well, I can imagine will happen because if I have really good.",
            "Personalized highly personalized service from the telecommunications company and I will be very frustrated because how do you know my context?",
            "How do you know my social network copy no.",
            "Yeah, information personal information.",
            "So I'm very afraid of this kind of service.",
            "But now they're using only the.",
            "Marketing purposely tried to use the system only for the analyzed data statistically."
        ],
        [
            "So busy spell so, so social contextualization.",
            "So not only location or time but also we have to consider the social.",
            "That relationship is difficult and so on.",
            "So this is a social contextualization.",
            "And another thing on the issue is the social media communication.",
            "So this is the.",
            "Oh oh, this.",
            "Actually this was work with other people in our business MISD management information system, people.",
            "So we have paper in.",
            "International Journal Information Management.",
            "So it was about the media richness theory, so we now we have a lot of communication media.",
            "For example like this.",
            "This is also kind of communication between you and me face to face, meeting right offline, right?",
            "And also we can make communication with other peoples with a number of medium.",
            "For example, cell phone video conferencing for example.",
            "Email folks Twitter.",
            "And so OK, but here we."
        ],
        [
            "So we'll detail is here so you can go this paper or you can find out more details, email, telephone, SMS, video conferencing and so on.",
            "So we have all our media to collaborate with other people's right."
        ],
        [
            "The question is how people choose their own social communication technology, social media.",
            "Sleeping, what is your?",
            "Favorite Down publication media.",
            "I connect.",
            "Open Facebook please.",
            "At last, this parts guy louder.",
            "Maybe you want because that's all the generation gap.",
            "Initial guy person to my father.",
            "For example, maybe the dumbest people.",
            "But maybe you have to consider the other context.",
            "OK, what is a context?",
            "And also what is your context of your?",
            "Patent football publication OK. For example OK?"
        ],
        [
            "So here we have two.",
            "We're letting made a lot of leased deck.",
            "We have to consider, for example, the social ability.",
            "Oh well, this is a really interesting story post.",
            "In Asian countries?",
            "Who's in Korean as a Korean?",
            "It is really difficult to ask a question with my goals by cell phone or I cannot applica work directly.",
            "Somehow I have to make appointments or.",
            "I don't know, maybe I have to send an email first.",
            "Is it OK?",
            "I can go to your office at 5:00 PM and so on.",
            "But here in Europe.",
            "I don't know.",
            "Very horizontal, right?",
            "So everybody can like a friend, OK, baby.",
            "Close relationship but Asian country.",
            "I mean especially Korea.",
            "The social structure.",
            "Very hierarchical.",
            "So so we have to understand what is the context with my goals, where he is, whether these easy or not.",
            "Something like this, OK?",
            "Um?",
            "Yeah there is.",
            "So there are cultural differences between the country between the organization between the.",
            "Movie 15 PM persons so it depends on all our situation.",
            "OK so we have to consider the social media social context for the communication."
        ],
        [
            "And also get to consider the task characteristics for example.",
            "Urgency if it's really urgent.",
            "You had to choose last fight.",
            "We have to choose cell phone.",
            "You have the direct calling your boss.",
            "This is emergent.",
            "You have to give your answer and so on OK. And also the complexity.",
            "So if you want to explain your problem or your knowledge, your information to your friend or your post.",
            "This is really difficult, for example.",
            "We will notify won't explain what is the capital of Spain.",
            "It's very easy.",
            "This.",
            "It's very simple past Madrid.",
            "So I can send an email like, oh, I don't know.",
            "Like dogs being smiling so.",
            "But here.",
            "The company still contextual segmentation.",
            "This is really long story, very difficult to explain at once.",
            "So what is your?",
            "What what what you gonna choose the.",
            "The social media.",
            "For explaining very difficult knowledge, very high level information may be hard to choose.",
            "Some knowledge based system like blogs and so on.",
            "Yeah, something like this.",
            "Yeah NASA because it takes a lot of time to explain.",
            "Maybe you have to go to your post office like a face face or video conferencing.",
            "So it depends only around a lot of characteristic of the past.",
            "Is it origin?",
            "Is it the context and also the multiplicity?",
            "So if you have some problem then.",
            "Is it OK with the one to one communication or is it is it should be a 110 communication like this 110 or sometimes if you have a communication between two teams it makes communication on end to end right?",
            "So there are situations like this."
        ],
        [
            "And so that's why we have to choose some idea from video, which is theory.",
            "So we need to measure but wait.",
            "All the social media.",
            "OK, for example, is the latest Portugal wiki or blow superi highlight very good comedian for explain very complex information and knowledge is OK with cell phone or SMS or Twitter for example.",
            "All the way to the Twitter is truly very low, right?",
            "There is simple because there is very limited number of the.",
            "Her first so Twitter.",
            "Is.",
            "Lighter than email function OK."
        ],
        [
            "So I will keep the one interesting example.",
            "Seriously, this is one of my favorite TV drama though.",
            "The crime scene investigation, right?",
            "But there are."
        ],
        [
            "Number of vehicles now.",
            "Get recently most seidlin Nick Stokes and so on.",
            "So they had the.",
            "Video the social community that they have or rank OK. For example, given recent piece supervisory signals of this team and they have to manage everything.",
            "And for example, Greg Sanders diesel level 2 at the other reason there by three and so on.",
            "So and also they have expertise.",
            "For example the are warnings.",
            "He is the Doctor medical doctor.",
            "So if you have some problem.",
            "Yeah.",
            "And I see then they they have asked him OK, and also the.",
            "Any color in this drama in this case?",
            "A lot of forensic information can be collected from the crime scene, then they have to decide who is the murderer who is a criminal and so on, OK?",
            "So somehow they have to collaborate with each other by sharing the information and so on.",
            "And imagine so there is a crime scene and this is very origin.",
            "We have to detect we have to collect all possible information very quickly and we decide that we see coming.",
            "We had we had to make the decision adversely.",
            "OK precisely OK so otherwise we have to make a lot of problem problem."
        ],
        [
            "So if you see the."
        ],
        [
            "So."
        ],
        [
            "Um this rap?"
        ],
        [
            "With respect to the expertise, we can make us weak groups and also with respect to the social structure social right ranking.",
            "We can help this kind of hierarchy, OK?"
        ],
        [
            "And also."
        ],
        [
            "Somehow we can build some horizontal social structure like this.",
            "Wow."
        ],
        [
            "OK, so the problem is they want to collect all possible forensic evidence informations and they had the Sheriff and they had to decide who is cover.",
            "Critical for example, and here they pull their weight and so on, and they share informations but.",
            "But it wasn't the pirate certain moments.",
            "They had to decide which social media.",
            "Will be the best OK. We will sell for the third one is not.",
            "Always the best communication medium.",
            "'cause if you want to explain very difficult.",
            "Very, uh, I don't know what explained it.",
            "Very difficult information then you have to go directly to the office.",
            "Then you have to have some face to face meeting and so on.",
            "Something like this."
        ],
        [
            "OK so I will keep a worthy.",
            "Oh the eventual.",
            "I mean, the ultimate goal of this work, and then I will give the convolutional closed.",
            "Like to hear the if you see the pool, they provide very easy, very simple interface and we can just put the query like Madrid, Spain and so on.",
            "Very easy and you can get the results of the information."
        ],
        [
            "So we just want to provide some cross media communication systems people.",
            "Um?",
            "So for example."
        ],
        [
            "The the same ask Gillan Woman who is the motor work is something like that and the system can detect all possible contexts where he is.",
            "What is his expertise?",
            "What is the?",
            "So, so the system can collect all possible context and they choose a integrate the context information and they decide which media, which social group there will be the best for this communication.",
            "OK, so this is the basic idea of this system.",
            "OK, so we don't need to consider any compare cell phone repair Store 3 two millimeter best.",
            "I don't know.",
            "I don't care, I just put on my safety in this step.",
            "The system can detect decide which video will be the best OK. And also.",
            "The information can be distributed to other peoples with multiple.",
            "If we need a multiple of informations from other people."
        ],
        [
            "So in this code I just give a simple and basic idea about contextual synchronization and why we need the.",
            "Why we need to consider the social context and also we have to consider about social media which is weather.",
            "Whether we have whether we are choosing the optimal social media or communication with that beautiful.",
            "So paper research question was how to support users too.",
            "Chapter collaborate with each other and I didn't explain anything about the.",
            "Told you so link data, but if you want the paper, you can find out how we are using apologies anthrone.",
            "And also there's some other issues like how to manage the context and how to integrate the context and so on, but I just want to skip this one.",
            "Yeah, I think this is stand on my talk so I have grown the 8 minutes for questions for next.",
            "I will be happy to answer."
        ],
        [
            "Special thanks to the National Research Foundation in Korea and Korea.",
            "Telecom and so folks for the project and publication so."
        ],
        [
            "Yeah, the final announcement, so we have some special issue without David.",
            "Between with doing some special issue on social pick data on.",
            "I think it's yeah.",
            "Information Fusion Journal, so if you are interested in this kind of publications will have some results and please limit.",
            "And also we have some international conferences in Korea next year in full scale.",
            "And also we have that we really have the conference on collective intelligence.",
            "So if you're interested you can rule this conference at.",
            "We don't have it website yet, but.",
            "Yeah, very soon we will find out more information on the web.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for the kind introduction.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's David.",
                    "label": 0
                },
                {
                    "sent": "Say I'm from Korea an actually the build number versus my origonal affiliation but bring myself till I'm staying in Vietnam which makes it here.",
                    "label": 0
                },
                {
                    "sent": "And we have a really good relationship now, so it's supposed.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're asking me to have a murder.",
                    "label": 0
                },
                {
                    "sent": "Extension right so?",
                    "label": 0
                },
                {
                    "sent": "But then we risk assessment.",
                    "label": 0
                },
                {
                    "sent": "Haha, doing 10 University and also I have all the appreciation from Malaysia quality.",
                    "label": 0
                },
                {
                    "sent": "Improve yourself maliah so it took the lights.",
                    "label": 0
                },
                {
                    "sent": "3 appreciation holy power locally so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I well since they allow me to be here, I have to say.",
                    "label": 0
                },
                {
                    "sent": "Information about my operations.",
                    "label": 0
                },
                {
                    "sent": "So my original population name University is located in Mount Airy, who not?",
                    "label": 0
                },
                {
                    "sent": "So it's.",
                    "label": 0
                },
                {
                    "sent": "It takes 2 hours by train from Seoul to my city.",
                    "label": 0
                },
                {
                    "sent": "It's just the center of the South Korea.",
                    "label": 0
                },
                {
                    "sent": "Spell population is almost 3 million people, but we got city.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And second affiliation.",
                    "label": 0
                },
                {
                    "sent": "Map can University in Virginia City don't use very.",
                    "label": 0
                },
                {
                    "sent": "Are you sleepy?",
                    "label": 0
                },
                {
                    "sent": "If you have a chance to visit you had come there really big city around eight 8 million population people.",
                    "label": 0
                },
                {
                    "sent": "People first like I'm at work now.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, I have another position in Malaysia.",
                    "label": 0
                },
                {
                    "sent": "The universe in my life is very.",
                    "label": 0
                },
                {
                    "sent": "The universe case of very long history more than 100 years old.",
                    "label": 0
                },
                {
                    "sent": "The population is almost 3 million.",
                    "label": 0
                },
                {
                    "sent": "1.5 million people in horrible, very corrupt people.",
                    "label": 0
                },
                {
                    "sent": "Very large number of people coming through so.",
                    "label": 0
                },
                {
                    "sent": "Well, actually the reason I am talking about these two additional regulation is that.",
                    "label": 0
                },
                {
                    "sent": "The developing country like Malaysia and you definitely have a lot of opportunity for you to to research too.",
                    "label": 0
                },
                {
                    "sent": "Yes, some job.",
                    "label": 0
                },
                {
                    "sent": "Some position in there.",
                    "label": 0
                },
                {
                    "sent": "So very international lies.",
                    "label": 0
                },
                {
                    "sent": "But please matrices, so yeah.",
                    "label": 0
                },
                {
                    "sent": "I mean I already have a little question Jason, do you have any?",
                    "label": 0
                },
                {
                    "sent": "Colleagues who want to join their University so.",
                    "label": 0
                },
                {
                    "sent": "Yeah so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This while introducing some information.",
                    "label": 0
                },
                {
                    "sent": "So today what I want to explain and what I want to share with you is.",
                    "label": 0
                },
                {
                    "sent": "It's about this contextual synchronization and social collaboration.",
                    "label": 0
                },
                {
                    "sent": "Um, possibility I'm interested in virtual enterprises, virtual organizations.",
                    "label": 0
                },
                {
                    "sent": "They've been trying to.",
                    "label": 0
                },
                {
                    "sent": "Collaborate with other enterprises because the the problem is very complex and they just want to share their knowledge and information with other organizations.",
                    "label": 0
                },
                {
                    "sent": "So it's very difficult, so there are so many works about the network enterprises, so using the police or using some web service platform, then if they try to share the information may be correct design the new framework for the enterprises.",
                    "label": 0
                },
                {
                    "sent": "Both especially I'm interested in the people actually Bill yesterday, the professor on the ship was talking about the not only the.",
                    "label": 0
                },
                {
                    "sent": "Collaboration between the.",
                    "label": 0
                },
                {
                    "sent": "Machines does this.",
                    "label": 0
                },
                {
                    "sent": "Let me talk a bit to the systems.",
                    "label": 0
                },
                {
                    "sent": "Will also.",
                    "label": 0
                },
                {
                    "sent": "His empathy was emphasizing that down.",
                    "label": 0
                },
                {
                    "sent": "The human experience was a human experience is really important to to have some.",
                    "label": 0
                },
                {
                    "sent": "Selma decimate intelligence.",
                    "label": 0
                },
                {
                    "sent": "Great, so we have to understand the context of people and we have to support people to have a really good service, intelligence, services and so on.",
                    "label": 0
                },
                {
                    "sent": "So he mentioned that on the enterprises want to share the information with others and people in the enterprises.",
                    "label": 0
                },
                {
                    "sent": "They may get a large number of information knowledge.",
                    "label": 1
                },
                {
                    "sent": "They had understand and they they gave me to collaborate with other people in other enterprises.",
                    "label": 0
                },
                {
                    "sent": "This is really big problem, complex problem and the main goal of this work is to support people to collaborate without peoples in other domain in other enterprises in other organisations.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Of course there are so many systems tools believing well, I just saw my information from the web.",
                    "label": 0
                },
                {
                    "sent": "These tools are open source so you can get some source.",
                    "label": 0
                },
                {
                    "sent": "Then you can apply this tool into into your home and edges.",
                    "label": 0
                },
                {
                    "sent": "And if you continue your company to share the information with people between duties.",
                    "label": 0
                },
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "So there are so many so many systems already.",
                    "label": 0
                },
                {
                    "sent": "But here basically there using the Globes and weakest.",
                    "label": 0
                },
                {
                    "sent": "Well, this is generally quite similar.",
                    "label": 0
                },
                {
                    "sent": "They are using the weekly for example.",
                    "label": 0
                },
                {
                    "sent": "They put a lot of informations and the web and they quoted eating certain information and resource.",
                    "label": 0
                },
                {
                    "sent": "In their organizers, I saw one paper about the.",
                    "label": 0
                },
                {
                    "sent": "Distributed semantical wiki.",
                    "label": 0
                },
                {
                    "sent": "So the one particular key was having the elearning system so so we University professors are building the week system different disability and the students are participating in certain wiki.",
                    "label": 0
                },
                {
                    "sent": "They have some collaborations in the week so it was quest.",
                    "label": 0
                },
                {
                    "sent": "Quite similar in general.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But in our work we are targeting 2 main issues.",
                    "label": 0
                },
                {
                    "sent": "One is the social contextualization and 2nd is social media communications before.",
                    "label": 1
                },
                {
                    "sent": "William to the main issue I had to define why so contextual synchronization so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is this context shows?",
                    "label": 0
                },
                {
                    "sent": "Apologies, of course you know you are much better than I am about this.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pronunciation is very general definition from the dictionary, so happening or existing arising at recycling at the same time at the same time or certain events.",
                    "label": 1
                },
                {
                    "sent": "Occur happened in different spaces, places and or crying or operating exactly same.",
                    "label": 0
                },
                {
                    "sent": "So if you see stuff from the dictionary.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like it like this synchronized swimming, the pupils are acting the same way.",
                    "label": 0
                },
                {
                    "sent": "And also the the other picture is the.",
                    "label": 0
                },
                {
                    "sent": "Fireflies so nature.",
                    "label": 0
                },
                {
                    "sent": "You have a little synchronized the.",
                    "label": 0
                },
                {
                    "sent": "People may not.",
                    "label": 0
                },
                {
                    "sent": "Um, well, ipx already.",
                    "label": 0
                },
                {
                    "sent": "One paper about Ant colony so swarm intelligence, they do some synchronized action.",
                    "label": 0
                },
                {
                    "sent": "You take up a lot of interesting informations on that.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in in our perspective computer science, the data synchronization records to the idea of keeping multiple copies blah blah blah blah blah, so may not be here is multiple copy.",
                    "label": 1
                },
                {
                    "sent": "No, multiple systems in distributed environment and also they have to maintain the data integrity right?",
                    "label": 0
                },
                {
                    "sent": "So the data from the distributive multiple sources the data should be.",
                    "label": 0
                },
                {
                    "sent": "Tax consequences right?",
                    "label": 0
                },
                {
                    "sent": "Well, this is just general office.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Concept on synchronizations, so there is many systems distributed environments and they send the information.",
                    "label": 0
                },
                {
                    "sent": "They acknowledge the information and send OK technology.",
                    "label": 0
                },
                {
                    "sent": "This is served very general idea about the superannuation they sent information.",
                    "label": 0
                },
                {
                    "sent": "They had the information technology with each other and so on.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why is the hunting show SQL injections?",
                    "label": 0
                },
                {
                    "sent": "It's very simple definition, so we have to we have to.",
                    "label": 0
                },
                {
                    "sent": "We have to be aware of the text with other systems, right?",
                    "label": 0
                },
                {
                    "sent": "So we have to understand what it mean in other systems or in other.",
                    "label": 0
                },
                {
                    "sent": "Users for example.",
                    "label": 0
                },
                {
                    "sent": "So we have two people aware of the context.",
                    "label": 0
                },
                {
                    "sent": "Open multiple users and maintain that effectively so fine by considering the context so.",
                    "label": 1
                },
                {
                    "sent": "So for example, if you OK, so this is the basic definition of the word is the contextual synchronization.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "We can see all Eric Synchronization.",
                    "label": 0
                },
                {
                    "sent": "I mean the contextual synchronization in the online social network.",
                    "label": 0
                },
                {
                    "sent": "For example, if you see the information propagation diffusion, there's a new information on prior for example, but you information is propagated to other peoples, network, retweet and so on.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just like a flu, so you have a flu and is experiencing epidemic.",
                    "label": 0
                },
                {
                    "sent": "So the flu is contagious to other peoples.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So also we have some interesting idea about behavioral remixing, so our brain with some particular parts are made in the same way without conditions.",
                    "label": 0
                },
                {
                    "sent": "So if you have some gestural like this and peoples are doing in the same way unconsciously without your conscious, the your body's moving in the same way.",
                    "label": 0
                },
                {
                    "sent": "So this is very interesting idea.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something like this?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So also we know and I know there is a protest in Spain now.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Well, also knowing when Wall Street there more protest about the economic crisis, right?",
                    "label": 0
                },
                {
                    "sent": "So peoples are doing in the same way they may have some problem and the problem is synchronized with other peoples and they're doing in the same way.",
                    "label": 0
                },
                {
                    "sent": "I mean, pick down demonstration in this society.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, there are countries that have the.",
                    "label": 0
                },
                {
                    "sent": "Then Democratic, not right.",
                    "label": 0
                },
                {
                    "sent": "And peoples are doing the same way.",
                    "label": 0
                },
                {
                    "sent": "The information is synchronized and they had.",
                    "label": 0
                },
                {
                    "sent": "Somehow they agree with the problem.",
                    "label": 0
                },
                {
                    "sent": "I mean, they're feeding the problem somehow.",
                    "label": 0
                },
                {
                    "sent": "They get doing the same thing, so.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one of the system we try to Patch or the context with imagining install ciety, which is called table we are using.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We just want to capture key.",
                    "label": 0
                },
                {
                    "sent": "How you Commission is propagated, how how quickly and.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How widely on social?",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Apple.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we tried to beat us with your pulse.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the enemy we.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Extended into the temporal tsunami.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have a demo, but then I just capture.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or someone else access here so we are using the.",
                    "label": 0
                },
                {
                    "sent": "Flickr, the whole sharing system in which mental?",
                    "label": 0
                },
                {
                    "sent": "We can get the time or the.",
                    "label": 0
                },
                {
                    "sent": "All that ending or the time of the.",
                    "label": 0
                },
                {
                    "sent": "So we can capture the time information when the picture has been loaded in the Flickr.",
                    "label": 0
                },
                {
                    "sent": "Then we aggregated and we bills on.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some times is data something like this or the red one?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Grade one is Libya and the woman is Egypt.",
                    "label": 0
                },
                {
                    "sent": "So we try to picture the time information and we try to build a lot of the times three data.",
                    "label": 0
                },
                {
                    "sent": "So here you can see the how many picture has been uploaded into Flickr.",
                    "label": 0
                },
                {
                    "sent": "The Egypt and Libya is the keyword.",
                    "label": 0
                },
                {
                    "sent": "OK, we search.",
                    "label": 0
                },
                {
                    "sent": "We've got the information on the number of photos which are tagged by.",
                    "label": 0
                },
                {
                    "sent": "Egypt and Libya.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you see though there was, he is showing the revolution at the Belgian television at that time.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there is articulation phenomena between the country from Egypt to Livia.",
                    "label": 0
                },
                {
                    "sent": "So we realize that we can see there's a time shift from the blue line to the red line, right?",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's also not only the secret with us, we are targeting the Twitter so we can get the.",
                    "label": 0
                },
                {
                    "sent": "Twitters tweets from Twitter.",
                    "label": 0
                },
                {
                    "sent": "And we try to build some systems which can capture the relationship between the keyword, like the Libyan shipped and so on.",
                    "label": 0
                },
                {
                    "sent": "So I saw a lot of papers about Twitter yesterday and it was quite interesting for me also.",
                    "label": 0
                },
                {
                    "sent": "So just like the three plus we can draw the line signals like these so.",
                    "label": 0
                },
                {
                    "sent": "This data is coming from was coming from the Korean election presidential election last year.",
                    "label": 0
                },
                {
                    "sent": "last December we had a presidential election in Korea, so we got some information from Twitter.",
                    "label": 0
                },
                {
                    "sent": "How many peoples are talking about certain candidates?",
                    "label": 0
                },
                {
                    "sent": "Then we try to compare how many I mean.",
                    "label": 0
                },
                {
                    "sent": "Who was the more influential person in clear environment?",
                    "label": 0
                },
                {
                    "sent": "So so we somehow we tried.",
                    "label": 0
                },
                {
                    "sent": "Understand the contextual synchronization between the candidates to the certain objective.",
                    "label": 0
                },
                {
                    "sent": "Many Facebook right?",
                    "label": 0
                },
                {
                    "sent": "So they I mean some fantastic.",
                    "label": 0
                },
                {
                    "sent": "I'll try to do this.",
                    "label": 0
                },
                {
                    "sent": "Can we try to make it?",
                    "label": 0
                },
                {
                    "sent": "Because it makes a significant influence to the capital now so so we try to understand the relationship between the candidate to the certain.",
                    "label": 0
                },
                {
                    "sent": "Look up, but I joined up right?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second was also, well, basically, the constituency contextual synchronization is to understand.",
                    "label": 1
                },
                {
                    "sent": "Holder information is propagated to other peoples and how how the information is sent or received.",
                    "label": 0
                },
                {
                    "sent": "In the end, by considering the context, will personal or the context of communities or context of bills of sight, and so on.",
                    "label": 0
                },
                {
                    "sent": "So next one is social contextualization.",
                    "label": 1
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So there are so many Contacts or resistance, for example, location right?",
                    "label": 0
                },
                {
                    "sent": "So as I already said on.",
                    "label": 0
                },
                {
                    "sent": "We have to consider context to users, so we want to send the information to a target user, but we have to understand the context.",
                    "label": 0
                },
                {
                    "sent": "We have to be aware of in text where it is, when it is now OK.",
                    "label": 0
                },
                {
                    "sent": "So now I'm in the Madrid.",
                    "label": 0
                },
                {
                    "sent": "Uh, the location and also I'm in the now.",
                    "label": 0
                },
                {
                    "sent": "It's morning right?",
                    "label": 0
                },
                {
                    "sent": "So for example, I will give more detail later on, But for example telecommunication company, they want to send a certain information to me, but I'm doing a talk right?",
                    "label": 0
                },
                {
                    "sent": "So if I guess some information.",
                    "label": 0
                },
                {
                    "sent": "Right now, then the information is trash.",
                    "label": 0
                },
                {
                    "sent": "It's not useful anymore, so I will delete.",
                    "label": 0
                },
                {
                    "sent": "So you have to understand my context, location and what's happening with him and so on, right?",
                    "label": 0
                },
                {
                    "sent": "Well, so far I saw many papers and they they only consider the location in time.",
                    "label": 0
                },
                {
                    "sent": "But here the social contextualization.",
                    "label": 0
                },
                {
                    "sent": "I mean we have to consider the social context right?",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The function there's a movie, pimps movie, social network is about the Facebook.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the market report he has allowed social networks, social relationship with other peoples like these.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And somehow so there is a relationship on Facebook.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also every so relationship Twitter.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is also a relationship in public risk.",
                    "label": 0
                },
                {
                    "sent": "It means mark.",
                    "label": 0
                },
                {
                    "sent": "Here he has a lot of social network.",
                    "label": 0
                },
                {
                    "sent": "But the problem is that the social relationship is distributed not in the same social network services.",
                    "label": 0
                },
                {
                    "sent": "They put some social network is in Facebook social network in two year and so on.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of my world is to integrate.",
                    "label": 0
                },
                {
                    "sent": "Although social network are distributed in different systems, need to work OK.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we try to build eco centric social network.",
                    "label": 0
                },
                {
                    "sent": "So once we have the angle centric social network then we can have better service to them, OK?",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, is just basic, very simple.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An example, so this is.",
                    "label": 0
                },
                {
                    "sent": "Oh from Flickr.",
                    "label": 0
                },
                {
                    "sent": "So we had some measure application, so Google Megan Sleeper we search a certain information.",
                    "label": 0
                },
                {
                    "sent": "OK, this is just like getting old.",
                    "label": 0
                },
                {
                    "sent": "Horse in this area.",
                    "label": 0
                },
                {
                    "sent": "OK, this is first idea, but I just want to know.",
                    "label": 0
                },
                {
                    "sent": "The Cold War, which are related to my friend OK?",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not everyone so.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we can reduce the number of results probably occur, and I just want to get the pool to only the photo of all known it by my friend.",
                    "label": 0
                },
                {
                    "sent": "OK, by considering the social networks.",
                    "label": 0
                },
                {
                    "sent": "OK, so here I'm considering social network as a social context magically location, but also we have to consider the social context.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we had people out of context Fusion.",
                    "label": 1
                },
                {
                    "sent": "'cause I'm talking about.",
                    "label": 0
                },
                {
                    "sent": "We have other contexts like not only location time, but also we have the social context.",
                    "label": 0
                },
                {
                    "sent": "So how we can choose all available context?",
                    "label": 0
                },
                {
                    "sent": "This is the issue, OK?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so the.",
                    "label": 0
                },
                {
                    "sent": "So we have.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Consider how to integrate all available context and we have to contextualize it, OK?",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So scenario for the context version is very simple and very interesting.",
                    "label": 0
                },
                {
                    "sent": "Examples are my colleagues like this one.",
                    "label": 0
                },
                {
                    "sent": "So it is my birthday which is my wife's birthday tomorrow and now I'm in the fair today.",
                    "label": 1
                },
                {
                    "sent": "So I'm passing through the space for under the recently I have the technical meeting near and sold.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we consider all possible to fix ladies.",
                    "label": 0
                },
                {
                    "sent": "So for example, in from my smartphone.",
                    "label": 0
                },
                {
                    "sent": "At least I can detect the location right where I am right?",
                    "label": 0
                },
                {
                    "sent": "So now I am near sold and that's why college ample we have the.",
                    "label": 0
                },
                {
                    "sent": "The feature on the Skype we can detect who is I mean.",
                    "label": 0
                },
                {
                    "sent": "Who has the birthday right?",
                    "label": 0
                },
                {
                    "sent": "So for example today or tomorrow, it will be your friend's birthday on tonight then.",
                    "label": 0
                },
                {
                    "sent": "And also Facebook and Sidewalk is the Korean Social Network Service and link is on so we can get more context.",
                    "label": 0
                },
                {
                    "sent": "For example, my wife's favorite movies in Facebook, the preprints, or interest from the other social network.",
                    "label": 1
                },
                {
                    "sent": "And Foursquare this is what the famous location with social network service.",
                    "label": 0
                },
                {
                    "sent": "So we can check in and also we can get some reputation about the location.",
                    "label": 0
                },
                {
                    "sent": "So if there are any famous restaurant near so something like that quickly.",
                    "label": 0
                },
                {
                    "sent": "OK. And then from figure we can get some information about the other information about the from the companies to projectile, various Department store called LK in in class.",
                    "label": 0
                },
                {
                    "sent": "Except.",
                    "label": 0
                },
                {
                    "sent": "So there is no other contextual information from the Twitter.",
                    "label": 0
                },
                {
                    "sent": "So for example, OK is Department store or promoting some products or service.",
                    "label": 0
                },
                {
                    "sent": "Then somehow the recommendation system.",
                    "label": 0
                },
                {
                    "sent": "The company they can collect all possible the contextual information they make, use it and they desire OK, Jason will get the misinformation.",
                    "label": 0
                },
                {
                    "sent": "Then he will use it.",
                    "label": 0
                },
                {
                    "sent": "Unlikely so this is this scenario can be applied in various.",
                    "label": 0
                },
                {
                    "sent": "We do small deals.",
                    "label": 0
                },
                {
                    "sent": "You said probably telling the company they are very.",
                    "label": 0
                },
                {
                    "sent": "No interested in this kind of scenarios because they just want to get the money.",
                    "label": 0
                },
                {
                    "sent": "I mean not only those.",
                    "label": 0
                },
                {
                    "sent": "Oh subscription fee, but also they want to provide some service then they want to get the money from the customers.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we keep some collaboration with a pedicure telecommunication company Korea.",
                    "label": 0
                },
                {
                    "sent": "So the one of the major companies in Korea is that is the Korean Telecom Katie.",
                    "label": 0
                },
                {
                    "sent": "So we need some projects.",
                    "label": 0
                },
                {
                    "sent": "So basically in the previous slide, the.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The social network project my wife.",
                    "label": 0
                },
                {
                    "sent": "Who is my wife is from the.",
                    "label": 0
                },
                {
                    "sent": "Looks like we can get it.",
                    "label": 0
                },
                {
                    "sent": "The explicit social network promo certain social network service, but the problem.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "We want to get more social network.",
                    "label": 1
                },
                {
                    "sent": "OK so telecommunications company that Kiki 12 discover.",
                    "label": 0
                },
                {
                    "sent": "Who is Jason's friend?",
                    "label": 0
                },
                {
                    "sent": "Who is the days with family members?",
                    "label": 0
                },
                {
                    "sent": "Who is the student of Jason?",
                    "label": 1
                },
                {
                    "sent": "Who is the one thing like that?",
                    "label": 0
                },
                {
                    "sent": "OK, so the telecom Engineer telecommunication company.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Big Dick little over information about the telephone, the quality patents.",
                    "label": 0
                },
                {
                    "sent": "OK. For example, you can't make a phone call to the big data.",
                    "label": 0
                },
                {
                    "sent": "Can't decide.",
                    "label": 0
                },
                {
                    "sent": "OK these two people.",
                    "label": 0
                },
                {
                    "sent": "Have some social relationship OK?",
                    "label": 0
                },
                {
                    "sent": "So in this project we have some data mining tools.",
                    "label": 0
                },
                {
                    "sent": "And we try to understand we could trade, discover the vehicle patterns, I mean social networks by analyzing the quality, pattern public data.",
                    "label": 1
                },
                {
                    "sent": "So how open?",
                    "label": 0
                },
                {
                    "sent": "These two peoples are making a phone call or how?",
                    "label": 0
                },
                {
                    "sent": "Hello OK, along with something like this so the telephone company has now running up Cody pattern but also they can track the location.",
                    "label": 0
                },
                {
                    "sent": "OK there is a station and if I'm near those patient located in sold maybe cycle cases looking so for something like that.",
                    "label": 0
                },
                {
                    "sent": "So especially in this project we discover a lot of interesting patterns.",
                    "label": 0
                },
                {
                    "sent": "For example at nights.",
                    "label": 0
                },
                {
                    "sent": "If I have if I'm looking in the same place with other people then they decide OK they are in the same family both day living in the same place, same house, right there.",
                    "label": 0
                },
                {
                    "sent": "Assuming the same place to decide between these two people, sign in the same family.",
                    "label": 0
                },
                {
                    "sent": "And also, though we have the Social Security number and we can analyze the.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "Move more precise competitors, more precise social networks.",
                    "label": 0
                },
                {
                    "sent": "OK, by analyzing the Social Security number.",
                    "label": 0
                },
                {
                    "sent": "I don't know in Spain or USA, but we can discover the gender or the birthday birthplace and birthday, of course, and so on.",
                    "label": 0
                },
                {
                    "sent": "So somehow we can discover we can decide the social, social network Twitter peoples very easily very efficiently.",
                    "label": 0
                },
                {
                    "sent": "Um and also we pass better.",
                    "label": 0
                },
                {
                    "sent": "I mean, in the first day we discovered that the simple social network that we took the semantic informations to expand the social network.",
                    "label": 0
                },
                {
                    "sent": "So not only the family we want to discover for peace or Father who is the mother which the Bluetooth Internet.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Put the finally built this projector screen.",
                    "label": 0
                },
                {
                    "sent": "Well, I was failed because the we have a lot of problem on privacy issues because we have a lot of data from chemical company.",
                    "label": 0
                },
                {
                    "sent": "Then we try to analyze it but we have no answers.",
                    "label": 0
                },
                {
                    "sent": "We have no way to evaluate because we cannot ask the customers.",
                    "label": 0
                },
                {
                    "sent": "OK you have this relationship.",
                    "label": 0
                },
                {
                    "sent": "Is it correct or not?",
                    "label": 0
                },
                {
                    "sent": "So there's no way to begin with?",
                    "label": 0
                },
                {
                    "sent": "And now they're using the existing in the Post Office marketing, so they try to understand more efficiently about the customers for the CRM customer relationship management.",
                    "label": 0
                },
                {
                    "sent": "And also there's another problem, because we have a three major companies in Korea or color communication.",
                    "label": 0
                },
                {
                    "sent": "But here we are cooperating with only one company.",
                    "label": 0
                },
                {
                    "sent": "So if I had my phone call with other people who are using different companies, the Metro PCs, we cannot discover the divisions between other peoples.",
                    "label": 0
                },
                {
                    "sent": "This is another problem.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And also the honest problem is.",
                    "label": 0
                },
                {
                    "sent": "If you get really.",
                    "label": 0
                },
                {
                    "sent": "Personal personalized service without any agreement.",
                    "label": 0
                },
                {
                    "sent": "Well, I can imagine will happen because if I have really good.",
                    "label": 0
                },
                {
                    "sent": "Personalized highly personalized service from the telecommunications company and I will be very frustrated because how do you know my context?",
                    "label": 0
                },
                {
                    "sent": "How do you know my social network copy no.",
                    "label": 0
                },
                {
                    "sent": "Yeah, information personal information.",
                    "label": 0
                },
                {
                    "sent": "So I'm very afraid of this kind of service.",
                    "label": 0
                },
                {
                    "sent": "But now they're using only the.",
                    "label": 0
                },
                {
                    "sent": "Marketing purposely tried to use the system only for the analyzed data statistically.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So busy spell so, so social contextualization.",
                    "label": 0
                },
                {
                    "sent": "So not only location or time but also we have to consider the social.",
                    "label": 0
                },
                {
                    "sent": "That relationship is difficult and so on.",
                    "label": 0
                },
                {
                    "sent": "So this is a social contextualization.",
                    "label": 1
                },
                {
                    "sent": "And another thing on the issue is the social media communication.",
                    "label": 1
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                },
                {
                    "sent": "Oh oh, this.",
                    "label": 0
                },
                {
                    "sent": "Actually this was work with other people in our business MISD management information system, people.",
                    "label": 0
                },
                {
                    "sent": "So we have paper in.",
                    "label": 0
                },
                {
                    "sent": "International Journal Information Management.",
                    "label": 0
                },
                {
                    "sent": "So it was about the media richness theory, so we now we have a lot of communication media.",
                    "label": 0
                },
                {
                    "sent": "For example like this.",
                    "label": 0
                },
                {
                    "sent": "This is also kind of communication between you and me face to face, meeting right offline, right?",
                    "label": 0
                },
                {
                    "sent": "And also we can make communication with other peoples with a number of medium.",
                    "label": 0
                },
                {
                    "sent": "For example, cell phone video conferencing for example.",
                    "label": 0
                },
                {
                    "sent": "Email folks Twitter.",
                    "label": 0
                },
                {
                    "sent": "And so OK, but here we.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we'll detail is here so you can go this paper or you can find out more details, email, telephone, SMS, video conferencing and so on.",
                    "label": 0
                },
                {
                    "sent": "So we have all our media to collaborate with other people's right.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The question is how people choose their own social communication technology, social media.",
                    "label": 1
                },
                {
                    "sent": "Sleeping, what is your?",
                    "label": 0
                },
                {
                    "sent": "Favorite Down publication media.",
                    "label": 0
                },
                {
                    "sent": "I connect.",
                    "label": 0
                },
                {
                    "sent": "Open Facebook please.",
                    "label": 0
                },
                {
                    "sent": "At last, this parts guy louder.",
                    "label": 0
                },
                {
                    "sent": "Maybe you want because that's all the generation gap.",
                    "label": 0
                },
                {
                    "sent": "Initial guy person to my father.",
                    "label": 0
                },
                {
                    "sent": "For example, maybe the dumbest people.",
                    "label": 0
                },
                {
                    "sent": "But maybe you have to consider the other context.",
                    "label": 0
                },
                {
                    "sent": "OK, what is a context?",
                    "label": 0
                },
                {
                    "sent": "And also what is your context of your?",
                    "label": 0
                },
                {
                    "sent": "Patent football publication OK. For example OK?",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we have two.",
                    "label": 0
                },
                {
                    "sent": "We're letting made a lot of leased deck.",
                    "label": 0
                },
                {
                    "sent": "We have to consider, for example, the social ability.",
                    "label": 0
                },
                {
                    "sent": "Oh well, this is a really interesting story post.",
                    "label": 0
                },
                {
                    "sent": "In Asian countries?",
                    "label": 0
                },
                {
                    "sent": "Who's in Korean as a Korean?",
                    "label": 0
                },
                {
                    "sent": "It is really difficult to ask a question with my goals by cell phone or I cannot applica work directly.",
                    "label": 0
                },
                {
                    "sent": "Somehow I have to make appointments or.",
                    "label": 0
                },
                {
                    "sent": "I don't know, maybe I have to send an email first.",
                    "label": 0
                },
                {
                    "sent": "Is it OK?",
                    "label": 0
                },
                {
                    "sent": "I can go to your office at 5:00 PM and so on.",
                    "label": 0
                },
                {
                    "sent": "But here in Europe.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "Very horizontal, right?",
                    "label": 0
                },
                {
                    "sent": "So everybody can like a friend, OK, baby.",
                    "label": 0
                },
                {
                    "sent": "Close relationship but Asian country.",
                    "label": 0
                },
                {
                    "sent": "I mean especially Korea.",
                    "label": 0
                },
                {
                    "sent": "The social structure.",
                    "label": 0
                },
                {
                    "sent": "Very hierarchical.",
                    "label": 0
                },
                {
                    "sent": "So so we have to understand what is the context with my goals, where he is, whether these easy or not.",
                    "label": 0
                },
                {
                    "sent": "Something like this, OK?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah there is.",
                    "label": 0
                },
                {
                    "sent": "So there are cultural differences between the country between the organization between the.",
                    "label": 1
                },
                {
                    "sent": "Movie 15 PM persons so it depends on all our situation.",
                    "label": 0
                },
                {
                    "sent": "OK so we have to consider the social media social context for the communication.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And also get to consider the task characteristics for example.",
                    "label": 0
                },
                {
                    "sent": "Urgency if it's really urgent.",
                    "label": 0
                },
                {
                    "sent": "You had to choose last fight.",
                    "label": 0
                },
                {
                    "sent": "We have to choose cell phone.",
                    "label": 0
                },
                {
                    "sent": "You have the direct calling your boss.",
                    "label": 0
                },
                {
                    "sent": "This is emergent.",
                    "label": 0
                },
                {
                    "sent": "You have to give your answer and so on OK. And also the complexity.",
                    "label": 0
                },
                {
                    "sent": "So if you want to explain your problem or your knowledge, your information to your friend or your post.",
                    "label": 0
                },
                {
                    "sent": "This is really difficult, for example.",
                    "label": 0
                },
                {
                    "sent": "We will notify won't explain what is the capital of Spain.",
                    "label": 1
                },
                {
                    "sent": "It's very easy.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "It's very simple past Madrid.",
                    "label": 0
                },
                {
                    "sent": "So I can send an email like, oh, I don't know.",
                    "label": 0
                },
                {
                    "sent": "Like dogs being smiling so.",
                    "label": 0
                },
                {
                    "sent": "But here.",
                    "label": 0
                },
                {
                    "sent": "The company still contextual segmentation.",
                    "label": 0
                },
                {
                    "sent": "This is really long story, very difficult to explain at once.",
                    "label": 0
                },
                {
                    "sent": "So what is your?",
                    "label": 0
                },
                {
                    "sent": "What what what you gonna choose the.",
                    "label": 0
                },
                {
                    "sent": "The social media.",
                    "label": 0
                },
                {
                    "sent": "For explaining very difficult knowledge, very high level information may be hard to choose.",
                    "label": 0
                },
                {
                    "sent": "Some knowledge based system like blogs and so on.",
                    "label": 0
                },
                {
                    "sent": "Yeah, something like this.",
                    "label": 0
                },
                {
                    "sent": "Yeah NASA because it takes a lot of time to explain.",
                    "label": 0
                },
                {
                    "sent": "Maybe you have to go to your post office like a face face or video conferencing.",
                    "label": 0
                },
                {
                    "sent": "So it depends only around a lot of characteristic of the past.",
                    "label": 0
                },
                {
                    "sent": "Is it origin?",
                    "label": 0
                },
                {
                    "sent": "Is it the context and also the multiplicity?",
                    "label": 0
                },
                {
                    "sent": "So if you have some problem then.",
                    "label": 0
                },
                {
                    "sent": "Is it OK with the one to one communication or is it is it should be a 110 communication like this 110 or sometimes if you have a communication between two teams it makes communication on end to end right?",
                    "label": 0
                },
                {
                    "sent": "So there are situations like this.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so that's why we have to choose some idea from video, which is theory.",
                    "label": 0
                },
                {
                    "sent": "So we need to measure but wait.",
                    "label": 1
                },
                {
                    "sent": "All the social media.",
                    "label": 0
                },
                {
                    "sent": "OK, for example, is the latest Portugal wiki or blow superi highlight very good comedian for explain very complex information and knowledge is OK with cell phone or SMS or Twitter for example.",
                    "label": 0
                },
                {
                    "sent": "All the way to the Twitter is truly very low, right?",
                    "label": 0
                },
                {
                    "sent": "There is simple because there is very limited number of the.",
                    "label": 0
                },
                {
                    "sent": "Her first so Twitter.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Lighter than email function OK.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I will keep the one interesting example.",
                    "label": 0
                },
                {
                    "sent": "Seriously, this is one of my favorite TV drama though.",
                    "label": 0
                },
                {
                    "sent": "The crime scene investigation, right?",
                    "label": 0
                },
                {
                    "sent": "But there are.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Number of vehicles now.",
                    "label": 0
                },
                {
                    "sent": "Get recently most seidlin Nick Stokes and so on.",
                    "label": 0
                },
                {
                    "sent": "So they had the.",
                    "label": 0
                },
                {
                    "sent": "Video the social community that they have or rank OK. For example, given recent piece supervisory signals of this team and they have to manage everything.",
                    "label": 0
                },
                {
                    "sent": "And for example, Greg Sanders diesel level 2 at the other reason there by three and so on.",
                    "label": 1
                },
                {
                    "sent": "So and also they have expertise.",
                    "label": 0
                },
                {
                    "sent": "For example the are warnings.",
                    "label": 0
                },
                {
                    "sent": "He is the Doctor medical doctor.",
                    "label": 0
                },
                {
                    "sent": "So if you have some problem.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And I see then they they have asked him OK, and also the.",
                    "label": 0
                },
                {
                    "sent": "Any color in this drama in this case?",
                    "label": 0
                },
                {
                    "sent": "A lot of forensic information can be collected from the crime scene, then they have to decide who is the murderer who is a criminal and so on, OK?",
                    "label": 0
                },
                {
                    "sent": "So somehow they have to collaborate with each other by sharing the information and so on.",
                    "label": 0
                },
                {
                    "sent": "And imagine so there is a crime scene and this is very origin.",
                    "label": 0
                },
                {
                    "sent": "We have to detect we have to collect all possible information very quickly and we decide that we see coming.",
                    "label": 0
                },
                {
                    "sent": "We had we had to make the decision adversely.",
                    "label": 0
                },
                {
                    "sent": "OK precisely OK so otherwise we have to make a lot of problem problem.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you see the.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um this rap?",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With respect to the expertise, we can make us weak groups and also with respect to the social structure social right ranking.",
                    "label": 0
                },
                {
                    "sent": "We can help this kind of hierarchy, OK?",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Somehow we can build some horizontal social structure like this.",
                    "label": 0
                },
                {
                    "sent": "Wow.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so the problem is they want to collect all possible forensic evidence informations and they had the Sheriff and they had to decide who is cover.",
                    "label": 0
                },
                {
                    "sent": "Critical for example, and here they pull their weight and so on, and they share informations but.",
                    "label": 0
                },
                {
                    "sent": "But it wasn't the pirate certain moments.",
                    "label": 0
                },
                {
                    "sent": "They had to decide which social media.",
                    "label": 0
                },
                {
                    "sent": "Will be the best OK. We will sell for the third one is not.",
                    "label": 0
                },
                {
                    "sent": "Always the best communication medium.",
                    "label": 0
                },
                {
                    "sent": "'cause if you want to explain very difficult.",
                    "label": 0
                },
                {
                    "sent": "Very, uh, I don't know what explained it.",
                    "label": 0
                },
                {
                    "sent": "Very difficult information then you have to go directly to the office.",
                    "label": 0
                },
                {
                    "sent": "Then you have to have some face to face meeting and so on.",
                    "label": 0
                },
                {
                    "sent": "Something like this.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK so I will keep a worthy.",
                    "label": 0
                },
                {
                    "sent": "Oh the eventual.",
                    "label": 0
                },
                {
                    "sent": "I mean, the ultimate goal of this work, and then I will give the convolutional closed.",
                    "label": 0
                },
                {
                    "sent": "Like to hear the if you see the pool, they provide very easy, very simple interface and we can just put the query like Madrid, Spain and so on.",
                    "label": 0
                },
                {
                    "sent": "Very easy and you can get the results of the information.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we just want to provide some cross media communication systems people.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The the same ask Gillan Woman who is the motor work is something like that and the system can detect all possible contexts where he is.",
                    "label": 0
                },
                {
                    "sent": "What is his expertise?",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "So, so the system can collect all possible context and they choose a integrate the context information and they decide which media, which social group there will be the best for this communication.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the basic idea of this system.",
                    "label": 0
                },
                {
                    "sent": "OK, so we don't need to consider any compare cell phone repair Store 3 two millimeter best.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I don't care, I just put on my safety in this step.",
                    "label": 0
                },
                {
                    "sent": "The system can detect decide which video will be the best OK. And also.",
                    "label": 0
                },
                {
                    "sent": "The information can be distributed to other peoples with multiple.",
                    "label": 0
                },
                {
                    "sent": "If we need a multiple of informations from other people.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this code I just give a simple and basic idea about contextual synchronization and why we need the.",
                    "label": 0
                },
                {
                    "sent": "Why we need to consider the social context and also we have to consider about social media which is weather.",
                    "label": 0
                },
                {
                    "sent": "Whether we have whether we are choosing the optimal social media or communication with that beautiful.",
                    "label": 0
                },
                {
                    "sent": "So paper research question was how to support users too.",
                    "label": 0
                },
                {
                    "sent": "Chapter collaborate with each other and I didn't explain anything about the.",
                    "label": 0
                },
                {
                    "sent": "Told you so link data, but if you want the paper, you can find out how we are using apologies anthrone.",
                    "label": 0
                },
                {
                    "sent": "And also there's some other issues like how to manage the context and how to integrate the context and so on, but I just want to skip this one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think this is stand on my talk so I have grown the 8 minutes for questions for next.",
                    "label": 0
                },
                {
                    "sent": "I will be happy to answer.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Special thanks to the National Research Foundation in Korea and Korea.",
                    "label": 0
                },
                {
                    "sent": "Telecom and so folks for the project and publication so.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, the final announcement, so we have some special issue without David.",
                    "label": 0
                },
                {
                    "sent": "Between with doing some special issue on social pick data on.",
                    "label": 0
                },
                {
                    "sent": "I think it's yeah.",
                    "label": 0
                },
                {
                    "sent": "Information Fusion Journal, so if you are interested in this kind of publications will have some results and please limit.",
                    "label": 0
                },
                {
                    "sent": "And also we have some international conferences in Korea next year in full scale.",
                    "label": 1
                },
                {
                    "sent": "And also we have that we really have the conference on collective intelligence.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested you can rule this conference at.",
                    "label": 0
                },
                {
                    "sent": "We don't have it website yet, but.",
                    "label": 0
                },
                {
                    "sent": "Yeah, very soon we will find out more information on the web.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}