{
    "id": "nj5qtz6ka4pkwliwdlwvomnwkxohloo4",
    "title": "Wordnik: Notes from an Online Dictionary Project",
    "info": {
        "author": [
            "Erin McKean, Wordnik"
        ],
        "published": "Dec. 2, 2011",
        "recorded": "November 2011",
        "category": [
            "Top->Humanities->Linguistics->Lexicography"
        ]
    },
    "url": "http://videolectures.net/elex2011_mckean_notes/",
    "segmentation": [
        [
            "Thank you very much and thank you for inviting me here.",
            "I've really enjoyed myself today.",
            "So wordnik."
        ],
        [
            "This is what we say word Nick is on the website itself.",
            "You can see that we don't actually use the word dictionary.",
            "We're talking about what word that contains.",
            "The site itself has been live in and it started as an open beta in June of 2009 we started the project itself on Leap Day in 2008.",
            "Don't ever start a company on Leap Day because the lawyers get annoyed about it forever.",
            "After they say February 29th.",
            "That's not possible.",
            "So don't you, that's my first piece of advice.",
            "So were Nick is primarily a functional lexicography project, we."
        ],
        [
            "We thought about what we wanted to do and who we wanted to do it for before we thought about how we wanted to do it, and so when we were thinking about the sorts of folks who would come to dictionary site or a site like Wordnik in general, we thought OK, Well who are they and what do they want to do?"
        ],
        [
            "And we thought, well, they are going to be primarily native speakers of English, and this is what they want to do.",
            "They want to read.",
            "They want to find out information about words that they might not be familiar with.",
            "They want to write that they want to impart, be able to produce relatively good.",
            "English themselves and they want to make and we had make a separate from right because we thought one of the things that you find out after being a dictionary editor for some time is that when you're at a cocktail party or just talking to random people and they find out that you're a dictionary editor, they want to give you some kind of metalinguistic information about words that they particularly like or don't like.",
            "I think this is true in English, will have to tell me if it's true for lexicographers of other language, but.",
            "If you like this kind of information, you're happy to hear this from people I like.",
            "I love learning that people love a particular word or hate a particular word, or that their grandmother's used a particular word.",
            "I have some colleagues who are not as happy to hear this information and they especially don't like to hear about more syntactic things that people don't like.",
            "So there's a I like to call these folks language enthusiasts and people like to call them peevers, as in I have a peeve and I'm going to tell it to you, but that's the kind of thing that we thought people come into word Nick would want to do that they would want to make their explicit knowledge about words in terms of the language available, and this was the thing that we really, really thought about that we."
        ],
        [
            "As the driving force behind the project and.",
            "Dictionary cycles can be very slow.",
            "There were always when I was working on print dictionaries, people would often ask me why a particular word was not yet in a print edition and I would have to say, well, it's on the list.",
            "It's coming and they would say how long, and I would say oh, 18 months and that that's not Internet time and people are much more.",
            "They had their expectations are greater.",
            "They think if I can find this using a search engine, why can't you show me what you have about it now?",
            "And in fact, when you think about people who want to read who are looking for defining or definitional information about words, this is often the situation."
        ],
        [
            "You find in a print dictionary, so the blue line represents the normal users desire to know about a word, and the red line represents the chance that it's in a print dictionary.",
            "This is for entertainment purposes only, so if you think about it, native English speakers are often looking for words that are very rare, either because they are technical terms or their dialect terms, or they're very old, or they're very knew, and those are exactly the kind of terms that are often left out of standard dictionaries.",
            "For monolingual native English speakers.",
            "And in fact I was."
        ],
        [
            "So happy last year, how many people saw the paper in science that came out last December?",
            "Called the quantitative analysis of culture using millions of digitized books.",
            "So they took about 4% of the books available through the Google Books Search.",
            "This was about 361 million words of English and they took random samples from all the different tokens.",
            "Types they took all the samples of types and then they looked them up.",
            "They look them up in the ODI.",
            "They looked him up in Merriam Webster's third and they found that 52% of the words that they checked by hand were not documented in dictionaries of English.",
            "Even the ID, and so they found that a lot of these terms were of course inflected forms.",
            "Derived forms that are not normally treated by print dictionaries, but they're also included words like this.",
            "A ratification clent them and deletable, and of course the first thing I did when I saw this paper is I went and looked at these words upon were deck, and we had two out of three, and then two days later we had sent them because we were processing news articles every day in this paper made a big splash in the news, and in fact, within hours we had people tweeting about the words lent them, and we showed the tweets on the page.",
            "So I've this statistic may be sad for English because I think all of English should be documented.",
            "In dictionaries, but happy in that I thought, oh OK, well this is a known problem.",
            "Somebody else other than me thinks this is a problem and they got published in science and we're solving it.",
            "So of course, how can you make a site that can give people information about words on the fly?"
        ],
        [
            "So basically, this is how we're thinking about it.",
            "This is the obligatory Vic and Stein reference, and so we really, truly believe it were Nick that the meaning of a word is in fact it's use in the language.",
            "So we want to show people how words are used in English, and that is what we want to show them primarily."
        ],
        [
            "And this of course is the not so obligatory.",
            "Although usually when I use this slide, I'm not talking to lexicographers who they have no idea who deep trenches and.",
            "But this is in fact what they thought about when they first started working on the Oxford English Dictionary.",
            "Let's take these quotations and let's make them yield as much information as they can be made to yield.",
            "To illustrate the word, not necessarily tell us about the thing and then.",
            "In the do and happy selection of these so is it possible to combine both objects and then he goes on and says the lexicographer can display eminent skill.",
            "So I think you know the lexicographer can still display eminent skill in the selection of examples, but we can turn ourselves into lexicographical cyborgs and let computers help us in the select."
        ],
        [
            "And of these examples, which is what we do with wording, so we have about 15,000,000 billion words of running text.",
            "This word is quite unusual in English.",
            "It's fairly new.",
            "A blend of the word bro.",
            "As in brother, an rodeo.",
            "Um, it's slightly derogatory, I think from the examples I did not know this word until day before yesterday.",
            "Obviously, I'm not invited to a lot of rodeos.",
            "So you can see, for example, I don't know if you read the floor was a rowdy, sweaty brodeo with an XY to XX ratio.",
            "Know better than three to one.",
            "Lots of guys there.",
            "And then.",
            "I also notice that the place is filled with mostly guys, a veritable bromantic brodeo.",
            "So Bromantic is another bro word.",
            "It's a romantic relationship is a platonic, but very close emotional relationship between two men.",
            "I think romantic actually made it into the last OBD update or the one before this one.",
            "So we thought, OK, we have no other data.",
            "About brodeo at all.",
            "We really, I think in a traditional dictionary, a traditional prediction would not have enough data to write what would be considered to be a Canonical definition.",
            "But if you are a native speaker of English, this is how you learn most of the words that you run across.",
            "You don't look them up and read their definitions, you encounter them usually in journalistic writing or in books, and you internalize a bunch of these sentences, especially if you're reading, say, the Washington Post article is about a concert at a famous nightclub in DC.",
            "Then the other one is from a blog, so if this is the kind of texture reading you see enough references to brodeo, we believe that you'll figure it out."
        ],
        [
            "This is another kind of entry date, or MA.",
            "I guess my French is terrible, so.",
            "What we're trying to do with the word like brodeo is we didn't have very much data, so we would just show you whatever we've got.",
            "If we got two.",
            "Sentence is if we've got three sentence is depending on how long the examples are.",
            "We fill them to a level on the page.",
            "Here we have algorithmically determined this sentence looks explanatory, so this is not so much trenches.",
            "How the word is used, but what is this thing?",
            "And so this sentence is the concept of Tacoma Award.",
            "The situation is coined to describe the recycling of artistic elements in a new context to express a different meaning than the original artist.",
            "Will that subtly different from Goddard's approach to pastiche as genre, oh, mosh, so I don't know if this would really tell you anything.",
            "But that may be the domain's problem and not necessarily the sentences problem, but we're looking for sentences like this where we don't have a traditional definition so that we can give the lay reader what lexicographers may be looking at a lot of.",
            "What we have also in the kind of."
        ],
        [
            "The dearth of information category this word actually shows up in a traditional dictionary we digitized.",
            "Oh, it's hard to see this is from the Century Dictionary Encyclopedia which we digitized because it's out of Copyright.",
            "An it's also awesome.",
            "If you're not familiar with the century dictionary, I highly recommend it was one of the first.",
            "It was one of the first dictionaries to seriously treat Americanisms.",
            "It was one of the first dictionaries to seriously treat terms from science and technology.",
            "It's amazing how much technological vocabulary is still in the century and is still applicable.",
            "It's also a lovely history of science document when you read a bunch of stuff about, say, eugenics and things that were very interesting to scientists at the time.",
            "And now we look pretty much askance at.",
            "But people do look up this kind of word onboard Nic as well, because most people who come to Wordnik find us because they've done a search in a large commercial search engine and they're looking for a word that is not in any of the other dictionary sources that are indexed by these search engines.",
            "So in fact, the way I found out that someone had looked up this word is that I checked our Google Analytics index.",
            "Yesterday and thought, OK, well what in the top 10 words is odd and this was it.",
            "So this was looked up quite a bit yesterday.",
            "Often this happens because because a word will make it into mass media.",
            "Bill O'Reilly, kind of right wing American political pundit.",
            "He often uses very old, archaic and unusual words as his word of the day, and we can tell when he's done this because we see a surge of traffic to words that we think nobody's ever paid attention to.",
            "In less you know twenty 3040 years."
        ],
        [
            "The other kinds of data that we assemble our traditional thesaurus type data.",
            "So this is what we call the related words for tapioca.",
            "So we use a lot of this data from Word NET.",
            "We also have a reverse dictionary search where we tell you entries where the word tapioca appears.",
            "The tags are entirely user generated, so somebody was motivated enough to log into word net.",
            "Create an account, an tag this word as food.",
            "In the same context is what we have determined syntactically?",
            "So we've parsed a bunch of.",
            "Sentence is an we look for words that are in similar syntactic relationships as the word tapioca.",
            "This works really nicely with tapioca because you can see, oh, cornstarch.",
            "Icing glasses are all thickeners.",
            "These are other things that you cook with.",
            "Tapioca, macaroni, tapioca and lard.",
            "That's problem.",
            "Sue it, those are a little more off, but error root.",
            "All of these are really nice because there's a lot of data for tapioca.",
            "Sometimes it gets weird, so here's the one for Bice."
        ],
        [
            "And lots of tags on bison.",
            "For some reason, somebody thinks that there's a color called bison.",
            "Who are we to argue?",
            "The reverse dictionary bison shows up in those entries, but in the same context I don't know if you could see it.",
            "Where is it?",
            "About 1/3 of the way down the word Tabuk?",
            "Does anybody know what a book is?",
            "Tabl UK.",
            "So a topic is a fictional animal in the Gore science fiction novels, which we happen to have all love in our corpus and so.",
            "It evidently behaves quite a lot like real world bison.",
            "Do you can drive them?",
            "You can yoke them, you can hunt them and so this is the kind of thing that shows up in the automatic processing of the data.",
            "I don't think a conventional print lexicographer would let this fictional animal show up in a regular thesaurus, but we didn't think it was doing any harm because of course it's clickable and you can go straight to the entry for topic where it's completely evident because all the sentences, all the examples are from the Gore science fiction novels.",
            "So this is the kind of.",
            "Derived data that we think gives users interesting information that would not be accessible.",
            "That's a little serendipitous, often funny, and when we're weighing whether to allow certain kinds of data through the automatic processing, there are couple of things that we take into consideration.",
            "One is, how difficult would it be to stop?",
            "Would it take a lot of editors to keep this stuff out when we have to get rid of all the Gor novels in order to keep the top book out of this list?",
            "Would it have to require editorial intervention afterwards and the other one is how much harm does it do?",
            "For instance, we expect that a lot of our users are monolingual native English speakers.",
            "If you were not a monolingual native English speaker and you are looking for a synonym for bison and we give you to book how much trouble are you going to get in if you use it in the context of bison, we thought you might get into some trouble, but.",
            "We hope that it wouldn't be a trouble of a different degree or severity that you would get into if you just use a normal thesaurus badly anchos another synonym without actually checking which is what happens all the time when people use the sources, they choose a synonym based on how it looks or how they think it sounds, and they don't actually check the meaning.",
            "And then that's when they get into."
        ],
        [
            "Trouble?",
            "So this is another kind of derived information that we think is very important for users of the site because it gives feedback on.",
            "Especially for words that we don't have a lot of data on.",
            "So if we don't have a definition for a word or we don't have very many example sentences, knowing that the words been looked up quite a bit or not very much, knowing that enough people have looked at the word to decide that it might be a favorite if it's been on a lot of lists.",
            "If it's been commented on and whether it's an official Scrabble word or not, these are all pieces of information that people use to make their own decisions about the acceptability of a particular word for the purpose.",
            "That they're looking the word up for.",
            "So we found that when we ask people casually, what do the stats mean to you?",
            "They put the most reliance on the Scrabble score.",
            "And after that they tend to think about oh OK, well is it in on a lot of lists?",
            "Because that takes effort.",
            "People had to do something to put it on the list and do people consider it a favorite."
        ],
        [
            "We allow logged in users of the site to both favorite words.",
            "These are favourites from yesterday and also to record pronunciations.",
            "We also record pronunciations ourselves, although very few.",
            "The last the top five recorded pronunciations are words that are words of the day for word neck this week, and in fact you're getting a sneak preview because I both phobia is our word of the day for Friday.",
            "So if you want to know what are the upcoming words of the downward go, check the recent pronunciations because we record the pronunciations in advance.",
            "List."
        ],
        [
            "Lists are a very important part of the site that we didn't expect to be as important as they are.",
            "We have more than 30,000 almost 40,000 entirely user created lists on the site right now.",
            "In 2010 we merged with another site called Wordy Org.",
            "Up until that point, Wordnik had pretty much just derived data from our corpus, and wordy had in only user created data from their users.",
            "So with that, oh, this is a really nice match.",
            "The word orgasm one man show run by a great guy named John McGrath and so he joined us, started working on the front end of the website and we merge the two sites together and so this is on the word Google and you can see the kinds of lists that people add.",
            "The kinds of words like Google too.",
            "So there's a whole list about words that this user thought were 19th century.",
            "There's a list that is just interesting words from the novel Clarissa.",
            "There's a list of.",
            "Sounds that are about water or ripples, or that kind of thing and then.",
            "Dis cordial is a list of unpleasant sounds so you can see that the ripples list is fairly pleasant, and the Discord list is mostly unpleasant and you get a characterization of the word from the overlapping of the list.",
            "So.",
            "There's a lot of data on wording, and we expect a lot from our users in that we think that users will bring to bear the same technique or lack of technique that they have in discriminating sources of information to this site.",
            "And this may be a unusual hope on our part, but we think especially what's now called digital natives.",
            "We think they're spending more time and learning more critical thinking skills as they try and navigate this information morass, and we think that if long as we present information transparently, all the example sentence is linked to their source.",
            "All the lists linked to their their creators, as long as we present this information transparently, then the users will be able to make the decision.",
            "About the suitability of whatever, there were whatever the word that they're looking up is for whatever purpose they're looking it up for.",
            "Some of our lists are extr."
        ],
        [
            "Mainly popular, this has been our number one search result for weeks now.",
            "This list goes on quite awhile so there are 239 words that you were supposed to try and use in colloquial speech without sounding like a pretentious ass.",
            "This list has been twitted probably 200 times over the last month.",
            "It gets tweeted several times.",
            "Inode dies down for a little bit, then gets treated over and over again.",
            "It's really had a ripple effect and this is not a particularly active user on the site.",
            "He's only made 19 lists.",
            "He's listed a lot of words, but nearly 1/3 of them are in this list.",
            "He's only written about 50 three comments, which is pretty low for a user who comments at all, and he's got 16 favorite words, probably none of which are on this list.",
            "This is the kind of proscriptive information that we try and provide on the site, but we don't try to provide it.",
            "So the word Nicks that are official word next that work at wordnik, we do very little of this.",
            "What we try to do is make it easy for speakers of English to communicate this information to each other which they also do in."
        ],
        [
            "Comments, so this is a terrible word.",
            "The first comment that was left is a definition.",
            "A surgical sponge accidentally left inside a patient's body.",
            "The next comment is a joke.",
            "Maybe that's why I'm always thirsty.",
            "Some, then the first commenter comes back again, just stopping by to admire the specific specificity of this word and then.",
            "Another user comes by and says, well, I think that this word is used to provide cover for the doctors, so use this word in the patients file so that if somebody reads the patients file they won't actually know that you made a medical error because nobody knows what this word is.",
            "And then somebody else comes back and adds more corroborating data.",
            "He says, well, the Unreferenced Wikipedia page for this word, and then he gives an Atom aladji says, it combines the Latin gossipy am cotton and the Swahili boamah place of concealment.",
            "And that's a bizarre hybrid.",
            "I don't know very many Latin Swahili blends.",
            "And then you know a completely different user comes and says that.",
            "Yes, he's commenting on the etymology and then someone else noticed Velma.",
            "Basically, there's a lot of discussion going on about this word, and are these people experts?",
            "Probably not.",
            "They've gone and done a little bit of research and they brought it all here.",
            "And you can see there's one tweet about it, and the tweet is basically what is this thing?",
            "And I don't know if it's meant to be like a bar, quiz, pub, quiz question, or what, but that's just what are there.",
            "What's there?"
        ],
        [
            "On the same lines of the how not to be a pretentious ass list.",
            "This is another list where people are making their proscriptive opinions known.",
            "These are words that people think are hateful business words.",
            "I can't really disagree with any of these.",
            "I think they are probably overused and oddly enough, if you look up hate on wordnik, we have an option to see all the search results for a particular word and that will bring you to all the lists that mention a particular word in their title.",
            "The number of lists of where people keep lists of words that they hate is quite significant an it's interesting to me.",
            "How much effort that takes to go and make a list of words that you particularly hate.",
            "Here you can see this search."
        ],
        [
            "Interface so you can say OK, well here are the search results for Ulysses.",
            "Those are the words tagged Ulysses, so those are words used in Ulysses that someone has noticed and tagged with the word Ulysses.",
            "There are several lists.",
            "Actually, there are more than that of words from Ulysses that people have made their own personal lists for, and then it also shows up in a list of all one word book titles.",
            "So it's not just lexical information but also encyclopedic information that people are putting together on the site.",
            "We also add."
        ],
        [
            "Your gate information.",
            "That's none text, so this is a Flickr set.",
            "We use the Flickr API and we pull images that are Creative Commons licensed.",
            "Does anybody want to guess what word this is for?",
            "It's for the word Honor, which we don't necessarily this the word honor would never be illustrated in a traditional print dictionary because it's an abstract noun.",
            "I mean, how would you give a picture of honor, but a lot of people have tagged pictures on Flickr with the word Honor, and this is what it looks like to them.",
            "I think that because it's so close to veteran's day, that's why there are all these military images.",
            "When I've looked at this before, they're usually more images of pretty women named honor, which is a fairly common name in English for a woman.",
            "So, and the one outlier here is the piece of I guess Renaissance era art, and I clicked through to say, why is this here?",
            "I thought maybe this womans was named honor.",
            "But no, it's a piece of art that is held at the Legion of Honor Museum in San Francisco.",
            "So that was pretty interesting and we pull Flickr images for every single word.",
            "So if there are images on Flickr that are Creative Commons licensed and that are tagged with the word that you just looked up, you will see the images for them."
        ],
        [
            "We also pull tweets for every word this.",
            "These are the tweets that showed up the last few days for the word swag tics, which is a blend of swagger and tactics.",
            "So if you want to have swagger which is now defined as style.",
            "These are the tactics you need to employ to achieve swagger and what I think is very interesting about this.",
            "That also kind of falls under the category of meta information.",
            "Is that all these tweets are from the same person, so this person is desperately trying to make this word happen.",
            "This is, I don't.",
            "We don't see any other tweets from anyone else using this hashtag or using this word at all.",
            "So the single source, the single point source of this information is information that we think our users use to decide on whether something is in general use or not.",
            "If all the examples come from the same place.",
            "It's quite likely to be a word that's very restricted."
        ],
        [
            "So as we've been putting together this site, we've learned quite quite a bit, and so I've kind of given the overview of what we aggregate to put work together, and this is what we've learned in the process of."
        ],
        [
            "Aggregating and the first thing we learned.",
            "Oh kids it so this is a piece of graffiti on a bridge overpass that says normal people never look up.",
            "And then there's a piquero and we have found that in fact.",
            "Quite a lot of folks who don't want to use a print dictionary who come up to people like me and say oh, so, have you had this happen to you as lexicographers where you say, oh, I work on making dictionaries and then somebody apologizes for never using a dictionary?",
            "Like oh, I never use dictionaries, I'm so sorry.",
            "I I don't know if dentists get like I never go to the dentist or you know, hairdressers get oh I cut my own hair you know the.",
            "When people have come up to me and say, oh, I never use a dictionary, I often ask them why and they say, well, it's inconvenient.",
            "It's boring.",
            "I always mean to go back later and look things up.",
            "I don't have time.",
            "I usually pick it up from the context.",
            "These are all the uses that I've had and I feel like for the majority of monolingual native English speakers, they don't actually use dictionaries very often.",
            "They think of dictionaries as things for learners, either children or second language learners, and.",
            "The reaction that we've gotten from so-called normal people who never look things up is when they are introduced to wordnik, they think of it less like a dictionary and more like a game.",
            "We also have quite a lot of what we consider drive through users who come to us via search engine pantua."
        ],
        [
            "Page for ten 1530 seconds.",
            "Evidently get what they want or not, and take off never to be seen again and this is what we think of as the normal users who never look things up with me or driven to it by desperation.",
            "Then they want to get the experience over with as quickly as they can.",
            "An at the other end are the P."
        ],
        [
            "Who come and stay on the site all the time and they create elaborate in jokes.",
            "So this is a proposed conference of Word Enix.",
            "So people who used to be on the site word organe word next have blended together to make a kind of joint nationality of Word Enix.",
            "They want.",
            "I don't know if this is going to happen or not.",
            "They haven't asked us about it.",
            "We wouldn't say yes or no in either case.",
            "At the Indiana University in Bloomington, they're going to have an old time fiddle and banjo performance.",
            "Uh, and so all of these things that are on these lists.",
            "Word word dies in tsunami related pages.",
            "The joy of umbrage.",
            "There's a running joke among the heavy commenters on the site about taking umbrage, so they say who's got the umbrage?",
            "It's my turn to have the umbrage.",
            "You've taken the umbrage away, and now I can't find it.",
            "So they're taking this metaphor in English and making it extremely literal.",
            "And so they often yell at each other in a kind of kidding way about it.",
            "Who's got the umbrage?",
            "And please give it back to me.",
            "Anytime somebody criticizes something that someone else does on the site, for instance, somebody makes a warning is completely case sensitive, so if somebody makes a list where all the words start with capital letters and somebody leaves a comment to gently remind someone over next case sensitive, do you really want all these words?",
            "Start with capital letters.",
            "Almost invariably, somebody will come by and add the comment.",
            "Why do you hate freedom?",
            "It doesn't seem to get in the way of the drive by users, but it makes the experience a lot more fun for the people who like to hang out on word.",
            "It quite a bit.",
            "I don't understand the dangers of epileptic Lego morph driving.",
            "I think that probably you shouldn't let rabbits drive in any case.",
            "But it's a meme that appears over and over again.",
            "This site.",
            "I think it's one of the truths of the Internet that if you create a site an let people contribute, they're going to do whatever the heck they want.",
            "And you might as well, as long as it's not incredibly offensive or harmful to people, you just have to get out of their way that policing a site takes all the fun out of it.",
            "For people who are usually having pretty harmless fun an in less you're running, say 4 Chan, you're pretty safe in letting people who are signed in users behave like grownups.",
            "Buffalo nology there's some kind of thing called pufflings, and when there are open lists that everybody can contribute to, not just the list creator, oftentimes people will come by and add that word to the list as a in Group.",
            "Funny marker."
        ],
        [
            "There's a lot of theologizing on Wordnik, and again, we let this happen because it doesn't get in the way, because if somebody creates a new word and leaves a comment on wordnik, the chances that someone else who could possibly be confused about the status of this words acceptability in standard English will run across this is very slight, because, unlike a print dictionary, it's not very browsable.",
            "So this is slight Geist which is a hidden plan to change the status quo, subtly or otherwise without informing or consulting with the constituents.",
            "An actually this user has very kindly linked this to the word made."
        ],
        [
            "Pickle made a pickle is a word Nick in term, but that the word is in Word next use whenever they make something up.",
            "They refer to the word is made a pickle.",
            "Fairly straightforward, it's also been looked at 2300 times, so from a typical word it's fairly real.",
            "At this point it's on 39 different lists an it's been commented on 70 times, but of course our friends at Scrabble are not yet."
        ],
        [
            "One over and possibly the biggest example of a made up pickle where that has hit wordnik is this word malaman to which happened last May.",
            "This is the Internet comic strip, ex KCD it is required reading for nerds so it's very popular among software engineers and so the author of this comic drew this comic last May about and.",
            "He used this to poke fun at Wikipedia, so he said, OK, well there's here's his Wikipedia entry from Allaman, to which is a neologism for a portmanteau created by incorrectly combining a malapropism with a neologism.",
            "Which is I'm not even sure is technically possible.",
            "So this turned into a thing on the Internet where people who read this comic went right away to create this Wikipedia page, because why wouldn't you right?",
            "And so?"
        ],
        [
            "Within a couple of hours we had an entry for it that consisted mainly of these comics, so somebody said, oh OK, well I discovered this word here and I'm looking up now.",
            "I'm going to create this other word Mallow man, to which is a portmanteau that involves marshmallows, an.",
            "We got example sentences from across the Internet and then it got looked up.",
            "I thought it was 3500 times, mostly from people who were searching for it and they all came to us and a lot of people called it a favorite.",
            "They put on list.",
            "Still not valid in Scrabble.",
            "So this."
        ],
        [
            "Whenever folks say oh, OK, well, we're Nicholas a lot of words that are made a pickle or not real were like, OK, well what's real to a native English speaker.",
            "It's a lexical item or assumed to be lexicalized item that they are interested in an.",
            "Should we tell them to go away and stop bothering us until the word is fixed in the language?",
            "Or should we try and give them as much information as possible, as fast as we possibly can, so we have kind of gone the as fast as we possibly can route, and I just wanted to compare these two words so Momento.",
            "Looked up almost 3500 times, Aglae, which occurs in the poetry of Robert Burns.",
            "The best laid plans of mice and men gang aft agley is something that almost all schoolchildren encounter English speaking school children will encounter that at some point in their schooling careers that never gets looked up comparatively.",
            "600 times.",
            "It's never been favorited.",
            "Nobody likes burns anymore.",
            "I suppose it's mostly listed on lists of words from Scottish and.",
            "So, but it's officially Scrabble worthy.",
            "So as we've collected all this information both from users from the corpus that we've gathered and from the dictionary text that we have digitized in the dictionary text that we have licensed, what we found that we thought is very interesting is that."
        ],
        [
            "Far, far fewer people are concerned about what we thought would be the big concerns about Copyright than they are, so we have entered into official relationships with a lot of publishers to allow us to use their data for our corpus, and we also use blog text, but the only instances where people have sent us takedown notices are people for whom.",
            "People who have gotten in trouble with the law and had that trouble with the law reported in their hometown newspaper and then done a search on their own names and had their name come up on Wordnik, in a sentence that defined the crime.",
            "These people are very unhappy to have these sentences on word deck and we take them down as a matter of course, because they have really very little lexical value.",
            "Unless these people have committed a brand new crime for which they needed a new term.",
            "We have not yet had that happen.",
            "Most the crimes tend to be embarrassing and terrible like DUI, but not innovative.",
            "So we really had no problems at all, mostly because we use such short snippets of text, a sentence or less, most of the time, and we link and on the Internet.",
            "Linking is considered currency, so even though the number of people who click through is relatively small, the folks who are linked to think, oh, it's cool and there seems to be some kind of residual authority even in a dictionary shaped object like word Nick from being in a dictionary.",
            "So we often see tweets from people who are like oh hey guys, check it out.",
            "My sentence is on wordnik from their tweets from something they've written on a blog post.",
            "There is a very entertaining word called mansplaining.",
            "Has anybody heard of mansplaining?",
            "This is a phenomenon that I think most women are aware of where.",
            "You are talking about a topic of which you possibly know a great deal, an someone with.",
            "XY chromosome comes up to you and proceeds to explain to you in detail the topic that you already know about.",
            "The most famous example of this was a New York writer who was out on the West Coast and she just written a book about the guy who did the photographs of early horses with the Stop Motion photography that really showed for the first time how horses actually ran and she was in this conversation and this guy came up and she's like, Oh well, you know, I, you know, that's very interesting.",
            "It turns out he did do this, that and the other thing and he stopped her and he preceded to explain that he had just read this fascinating book on the topic and.",
            "You know, set up.",
            "She could possibly know she was talking about 'cause he had.",
            "Just read the book and of course it was the book she had written.",
            "That's a very extreme example of mansplaining.",
            "But the woman who coined the word mansplaining, who writes a feminist blog, was extremely happy to see the sentence for mansplaining onboard.",
            "Nic.",
            "I think that surprised us greatly, given how happy people have been to see."
        ],
        [
            "For example, sentences on where Nick is, how very few people want to write definitions at all.",
            "People like to add comments and sometimes the comments are vaguely definition, but the number of people have asked to write definitions is a rounding error in the traffic of the site and most people.",
            "If they really, really want to write definitions, we encourage them to go to Wiktionary.",
            "We parse Wiktionary, it's freely available, and then we add it to the site, and Wiktionary has the apparatus for creating definitions to help people who really want to do it.",
            "But most people, when they're in the make phase, they want to add meta linguistic information.",
            "They want to add that the word is their favorite.",
            "They want to add it to a list and put it in a category they want to add A tag for awhile we had a place where you could suggest a related word, like a synonym or antonym, and very few people did that so.",
            "We took it off.",
            "We looked at the data, it was only me that was adding related terms.",
            "I added quite a few of them, but the number of other people who added related terms at all was.",
            "We thought it was mostly accidental people typing in the wrong box.",
            "People in general just don't seem to want to add definitions, and I don't find this surprising because I think writing definitions is very, very difficult, and I think that.",
            "Even with training, lots of lexicographers get it wrong on multiple occasions so."
        ],
        [
            "And then what we've really thought about is all of the things that.",
            "Have been difficulties we consider to be opportunities so when we find that, for example, our suggester isn't very good, we've been thinking about ways to improve it and the paper earlier today was very helpful."
        ],
        [
            "On that, and this is actually one of the problems that that we had.",
            "I can make this come up now, so this is the homepage of wordnik, and this is actually a really big problem.",
            "Takes a long time to load.",
            "And then.",
            "Didn't these words drop?",
            "From the top of the screen and they tell you a little bit about them, I think this was unfortunately it's hard to read on the screen, but it tells you of this word was recently favorited.",
            "This word was recently given a pronunciation.",
            "This word was added to a list.",
            "There's a terrible, terrible difficulty with this and that people watch it for very long periods of time and don't click on anything.",
            "So as a homepage it is admirable failure as a piece of art.",
            "We have been asked to make it into a screensaver.",
            "Users have called this the rain bars.",
            "We didn't have a term for it, but that's what the you know the very first day that this launched we started getting comments like oh, I love the rain bars.",
            "Then we actually looked at the conversions of people coming to the home page and then clicking and then was terrible.",
            "Just really really bad.",
            "So."
        ],
        [
            "What we've found out is that gave us the idea.",
            "We shouldn't waste pretty if we make something pretty and it doesn't do what we wanted to do.",
            "If it doesn't encourage people to look things up if it doesn't encourage people to make data.",
            "If it doesn't encourage people to enjoy using the site, then pretty is useless."
        ],
        [
            "And in fact, we need to get out of the way.",
            "We need to become invisible.",
            "There's a lot of things that we would like to do, especially with colocation with word sense disambiguation with multi word expressions, but we can't figure out how to get out of the way.",
            "We don't want to."
        ],
        [
            "Much technical aparatus to the site.",
            "Sorry, I think this has started to play by itself.",
            "One of the problems we've had is that you can't automatically mine for definite for etymologies because people get it wrong.",
            "This is an analogy for swag.",
            "It appeared in the New York Times and Swag is not a backronym.",
            "It does not come from the phrase stuff we all get this past.",
            "the New York Times it past their copy editors it past their fact.",
            "Checkers swag is a very old word.",
            "It comes from Scandinavian.",
            "But that means that when we're looking for good example sentences, we can't rely on data mining techniques to find out etymology.",
            "Etymology is too difficult and it needs real people.",
            "We also have to worry about dealing with user error in a print dictionary if there's user error, the lexicographer never finds out about it, or hardly ever finds out about it."
        ],
        [
            "Get an angry letter once or twice.",
            "You might have tests of peoples comprehension or production skills and they they don't do very well and you think Oh well, maybe it's a dictionary fault, but we got this email the other day to our feedback address.",
            "Why don't we recognize glasnost?",
            "We do, we think we have an entry.",
            "We have a lot of data, but for some reason this person could not find it and that was a problem and we're not sure how to solve it.",
            "We replied very nicely, sent back a link.",
            "Resisted the urge to sign it gorbachov but.",
            "This is the kind of thing that happens and by and large the people who take the time to write to us.",
            "So at first extremely indignant and then very happy because they're very used to writing to websites are not getting any response at all on there.",
            "Certainly not used to getting responses from traditional dictionaries.",
            "And when I was working on printing strings it was a real struggle to get the letters answered in a timely fashion.",
            "But with email it's very simple so."
        ],
        [
            "What's next?",
            "So obviously we want to see all these numbers go up.",
            "Uh, especially the lists and the number of word mix and the comments because we think that helps people.",
            "The more data that we can add to any particular lexical item we think if it's constructive data, it's really helpful for folks.",
            "Unfortunately, a lot of the things that we want to do are cheap but not easy."
        ],
        [
            "So getting better example sentences that more reliably reflect the syntagmatic patterns in the language, so better data on collocations, especially better getting better at separating out what we call the free range definitions where somebody usually in a newspaper defines something for their readers.",
            "From the example sentences that are more.",
            "Dealing with register or dealing with a factual information like oh, this word sounds slimy to me.",
            "I wouldn't use it.",
            "We'd like to reflect all these different kinds of information.",
            "We like to show prototypical use free range definitions, an kind of commentary or usage note use where people actually comment on the word.",
            "And.",
            "What we I think at this point I should make an admission 'cause I called this notes from an online dictionary."
        ],
        [
            "Project, but we're not really doing lexicography.",
            "We're doing kind of date or maore assemblage because nobody's writing any definitions at work think we're assembling data and we're creating processes to push as much quality lexical data at people as possible.",
            "But we're not writing definitions.",
            "We're not doing very much that would be considered traditional lexicography.",
            "What we are is kind of a vertical search engine.",
            "So in the same way that Yelp helps you find places and YouTube helps you find videos and IMDb helps you find information about movies we were trying to make, help you find already existing information about words and very little of it.",
            "Are we creating ourselves?",
            "We may make a list here.",
            "There we may add tags here there, but we're not match more privileged than the average wordnik user.",
            "There's only two things that I can do that the average wordnik user can't do.",
            "I can correct typos in the license dictionary, TXT, which happens from time to time.",
            "An I can create spelling suggestions so if we have a misspelling I can go and make a link in our system that will do a recommender.",
            "Anything else in terms of lists and terms of tags?",
            "Any word nicusor can do so?"
        ],
        [
            "I wanted to leave plenty of time for questions and get people to drinks early, but if you have any questions for me, this is how you can reach me on Twitter as well.",
            "And also I wanted to give a Creative Commons shadow.",
            "This talk is being licensed under the Creative Commons and all of the images from Flickr I'm using under a Creative Commons license, many of which are share alike licenses.",
            "So if you would like a copy of these slides to give presentation with yourselves I, I've always wanted somebody to take my slides and give a completely different presentation using all the same slides in the same order.",
            "So under the creative comments, of course, that is entirely possible, so I'm happy to answer questions.",
            "Thank you for your kind attention.",
            "Thanks, it's a really interesting talk.",
            "I've got one comment and one question and the comment is maybe the guy who couldn't find Glasnost, got his IP, a keyboard switched on and he got a two byte G which will guarantee to give you absolutely nothing if you search for it anywhere.",
            "So interesting question.",
            "We try and Unicode normalize like whatever you search for, try and reduce it, but maybe it wasn't there, but that's a good I just have to know if we have a.",
            "Did you mean for spaghetti?",
            "No, OK, I can add 1.",
            "And my question is, how do you make money?",
            "That's an excellent question.",
            "So yes, you can see there are no ads on the site and we can make this a bit smaller than no ads on the site and we really feel that it's very.",
            "Does anybody disagree that it's very difficult to make money with dictionaries?",
            "In less, I think that there are still markets for especially for bilingual and for learners dictionaries where there are engaged consumers who really want your product.",
            "But for modeling native English speakers, the alternative is always the search engine's, and for quite a lot of people that's a good enough answer.",
            "We want to make a product that is better than a good enough answer.",
            "That's an engaging, delightful answer, but again, it's not something that folks will pay for, but we've got so much language data now an it's all related to each other.",
            "We have a lot of data on what people do with words.",
            "We have a lot of data about how words relate to each other that we've essentially made what amounts to a map of English, so it's like Google Maps.",
            "We've had our little cars driving around everybody's neighborhood with cameras for awhile, and now we know where lots of things are.",
            "Once you have a map where nick.com is like the map of English, that tells you, oh here's little red dot.",
            "Here's where you are at this particular word.",
            "That's what's here, but the most interesting thing that you could do with a map is to give people directions.",
            "So say you're in a piece of text.",
            "What's the equivalent of directions to another piece of text?",
            "And this is a problem that is actually.",
            "Something that people will pay for.",
            "Which is that?",
            "Given a reader inside a piece of text, what is the next piece of text that you can show them that that will engage them an for the owner of the content?",
            "For the publisher that helps them monetize in terms of being able to show more advertising, being able to convert people from casual readers to paid subscription readers an?",
            "It's also something that's fairly entertaining to do, not necessarily is entertaining his dictionary work, but.",
            "It's certainly worthwhile, and it's nice to see this map of English being used for a purpose, for which oftentimes people are using social signals, so it's nice to know what your friends on Facebook read, but does anybody really click through to things that their friends on Facebook have read?",
            "I find that either I've already read them because.",
            "We are friends and we read the same kinds of things or they are so divergent from what I want to read that I don't click on them very much, especially during sports seasons.",
            "Um?",
            "During NCAA basketball season in the United States, almost every single article in my newsfeed is something that I have 0 interest in.",
            "But matching text to text has problems with keyword analysis and so forth.",
            "But anyway, we've built a map.",
            "And that's what will make money.",
            "Any other questions?",
            "What do you give people?",
            "Piece of text and who you sell it to, right?",
            "I probably shouldn't give any details about that.",
            "'cause we haven't launched it yet and it's still in early pilot phases with our partners, so it has a really cool name which I can't even tell you.",
            "'cause we haven't launched the name yet.",
            "But it's it's.",
            "It makes a lovely virtuous.",
            "It makes a nice circle because the more lexical data and relationship graph data that we can gather from the website, we make a better wernick.",
            "Com for those users.",
            "And we also build up the resolution on our map.",
            "And it's been a little bit of a truism in NLP that dictionaries don't help like people doing NLP.",
            "They you know they think.",
            "Sometimes they use dictionaries, but not very often and I just think they're using the wrong kind of Dictionary of course, if you have a dictionary that has 100,000 headwords, that's not going to help.",
            "It's just it's just too small to get reasonable data results out of.",
            "So that's my that's our assumption, and that's what we're working off of, and it seems to have panned out pretty well so far.",
            "So other questions.",
            "Say a page like this spaghetti spelt wrong is that generated on the fly when someone searches for it, and so I'm trying to get the resolution better based on Internet search or.",
            "Are you sort of going behind the scenes and picking up words and creating entry pages for them so the whole site is API driven so there's an underlying data store?",
            "It's in Mongo so it's a non giant non relational database and when word is typed into word Nick a lot of API calls are made.",
            "This one to the Flickr API, another one to the examples API checking for all the user generated content and assembling it.",
            "So the page is never static.",
            "The data underneath may be more or less static.",
            "So that, for instance, the license dictionary text is pretty much always static because it changes so very rarely.",
            "The Flickr images change everyday.",
            "The tweets change every 10 seconds and they refresh.",
            "So the page is generated, but some of the data is not generated.",
            "Does that make sense?",
            "I think so.",
            "So you can type anything into word Nick and we will show you whatever we've got, so there's a lot.",
            "Occasionally you can do, like cat walked across the keyboard type stuff.",
            "And it will, oh, it will sometimes break.",
            "Oh, I had too many weird characters in there, so let's try one.",
            "It's a little less.",
            "It's the semi colons that mess it up.",
            "That's something we've got fixed in the next edition.",
            "Yep, so.",
            "Those are on my list here, but look people tweet this.",
            "I don't know what that means, it looks like.",
            "Buy a Justin Bieber fan.",
            "At any point, I think you can't go more than two entries on Wordnik without seeing a Bieber related tweet.",
            "But yeah, so I have no idea what this means, but it's got some kind of meaning in a different language an I'm the first person to look this up on wordnik and unfortunately this is not a valid Scrabble word.",
            "Actually, people have made a game of this.",
            "If you're the first person to look something up on where did they call it?",
            "Scoring a word, neck and people keep lists of their word Nicks, which is one of the goals we had when starting the site is that we wanted to get verbed as quickly as possible.",
            "'cause we think that's a sign of success in a trade name.",
            "I'd just going back to the spaghetti entries.",
            "Oh yes.",
            "Are you then relying on users to say this is the wrong spelling?",
            "We do have people who tag things with misspelling.",
            "We also look at the search logs and we run some processes over the search logs to say, oh, you know, this looks suspiciously close.",
            "English speakers are so incredibly inventive and how they can misspell things.",
            "That we look at this to make sure that we can add did you means.",
            "And let's see if I can find 1.",
            "We will show the wrong data.",
            "Because we have a very, very tiny use case of people who want to see errors, often teachers, they want to see what common errors look like, and it's hard to get it all in one place.",
            "And also it's very interesting to see the kinds of sources that have these errors.",
            "Like people who write about politics are often terrible spellers.",
            "And and it's very rare to see these kinds of misspellings in mainstream media.",
            "So this is what we have is kind of sources and also you can see that you're not the only person.",
            "Who are look this up?",
            "Where the stats there we go.",
            "685 times people have looked up separate spelled wrongly.",
            "So we want to show data for everything, even if it's an error, but we try to make it as clear as possible that it is an error.",
            "An Wiktionary helps us a lot here.",
            "In fact, in that they have many, many entries for common misspellings.",
            "On to drinks or any other questions.",
            "Thank you guys so much and I'm happy to show more of wordnik caring."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much and thank you for inviting me here.",
                    "label": 0
                },
                {
                    "sent": "I've really enjoyed myself today.",
                    "label": 0
                },
                {
                    "sent": "So wordnik.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is what we say word Nick is on the website itself.",
                    "label": 0
                },
                {
                    "sent": "You can see that we don't actually use the word dictionary.",
                    "label": 0
                },
                {
                    "sent": "We're talking about what word that contains.",
                    "label": 0
                },
                {
                    "sent": "The site itself has been live in and it started as an open beta in June of 2009 we started the project itself on Leap Day in 2008.",
                    "label": 0
                },
                {
                    "sent": "Don't ever start a company on Leap Day because the lawyers get annoyed about it forever.",
                    "label": 0
                },
                {
                    "sent": "After they say February 29th.",
                    "label": 0
                },
                {
                    "sent": "That's not possible.",
                    "label": 0
                },
                {
                    "sent": "So don't you, that's my first piece of advice.",
                    "label": 0
                },
                {
                    "sent": "So were Nick is primarily a functional lexicography project, we.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We thought about what we wanted to do and who we wanted to do it for before we thought about how we wanted to do it, and so when we were thinking about the sorts of folks who would come to dictionary site or a site like Wordnik in general, we thought OK, Well who are they and what do they want to do?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we thought, well, they are going to be primarily native speakers of English, and this is what they want to do.",
                    "label": 0
                },
                {
                    "sent": "They want to read.",
                    "label": 0
                },
                {
                    "sent": "They want to find out information about words that they might not be familiar with.",
                    "label": 0
                },
                {
                    "sent": "They want to write that they want to impart, be able to produce relatively good.",
                    "label": 0
                },
                {
                    "sent": "English themselves and they want to make and we had make a separate from right because we thought one of the things that you find out after being a dictionary editor for some time is that when you're at a cocktail party or just talking to random people and they find out that you're a dictionary editor, they want to give you some kind of metalinguistic information about words that they particularly like or don't like.",
                    "label": 0
                },
                {
                    "sent": "I think this is true in English, will have to tell me if it's true for lexicographers of other language, but.",
                    "label": 0
                },
                {
                    "sent": "If you like this kind of information, you're happy to hear this from people I like.",
                    "label": 0
                },
                {
                    "sent": "I love learning that people love a particular word or hate a particular word, or that their grandmother's used a particular word.",
                    "label": 0
                },
                {
                    "sent": "I have some colleagues who are not as happy to hear this information and they especially don't like to hear about more syntactic things that people don't like.",
                    "label": 0
                },
                {
                    "sent": "So there's a I like to call these folks language enthusiasts and people like to call them peevers, as in I have a peeve and I'm going to tell it to you, but that's the kind of thing that we thought people come into word Nick would want to do that they would want to make their explicit knowledge about words in terms of the language available, and this was the thing that we really, really thought about that we.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As the driving force behind the project and.",
                    "label": 0
                },
                {
                    "sent": "Dictionary cycles can be very slow.",
                    "label": 0
                },
                {
                    "sent": "There were always when I was working on print dictionaries, people would often ask me why a particular word was not yet in a print edition and I would have to say, well, it's on the list.",
                    "label": 0
                },
                {
                    "sent": "It's coming and they would say how long, and I would say oh, 18 months and that that's not Internet time and people are much more.",
                    "label": 0
                },
                {
                    "sent": "They had their expectations are greater.",
                    "label": 0
                },
                {
                    "sent": "They think if I can find this using a search engine, why can't you show me what you have about it now?",
                    "label": 0
                },
                {
                    "sent": "And in fact, when you think about people who want to read who are looking for defining or definitional information about words, this is often the situation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You find in a print dictionary, so the blue line represents the normal users desire to know about a word, and the red line represents the chance that it's in a print dictionary.",
                    "label": 0
                },
                {
                    "sent": "This is for entertainment purposes only, so if you think about it, native English speakers are often looking for words that are very rare, either because they are technical terms or their dialect terms, or they're very old, or they're very knew, and those are exactly the kind of terms that are often left out of standard dictionaries.",
                    "label": 0
                },
                {
                    "sent": "For monolingual native English speakers.",
                    "label": 0
                },
                {
                    "sent": "And in fact I was.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So happy last year, how many people saw the paper in science that came out last December?",
                    "label": 0
                },
                {
                    "sent": "Called the quantitative analysis of culture using millions of digitized books.",
                    "label": 1
                },
                {
                    "sent": "So they took about 4% of the books available through the Google Books Search.",
                    "label": 0
                },
                {
                    "sent": "This was about 361 million words of English and they took random samples from all the different tokens.",
                    "label": 0
                },
                {
                    "sent": "Types they took all the samples of types and then they looked them up.",
                    "label": 0
                },
                {
                    "sent": "They look them up in the ODI.",
                    "label": 0
                },
                {
                    "sent": "They looked him up in Merriam Webster's third and they found that 52% of the words that they checked by hand were not documented in dictionaries of English.",
                    "label": 0
                },
                {
                    "sent": "Even the ID, and so they found that a lot of these terms were of course inflected forms.",
                    "label": 0
                },
                {
                    "sent": "Derived forms that are not normally treated by print dictionaries, but they're also included words like this.",
                    "label": 0
                },
                {
                    "sent": "A ratification clent them and deletable, and of course the first thing I did when I saw this paper is I went and looked at these words upon were deck, and we had two out of three, and then two days later we had sent them because we were processing news articles every day in this paper made a big splash in the news, and in fact, within hours we had people tweeting about the words lent them, and we showed the tweets on the page.",
                    "label": 0
                },
                {
                    "sent": "So I've this statistic may be sad for English because I think all of English should be documented.",
                    "label": 0
                },
                {
                    "sent": "In dictionaries, but happy in that I thought, oh OK, well this is a known problem.",
                    "label": 0
                },
                {
                    "sent": "Somebody else other than me thinks this is a problem and they got published in science and we're solving it.",
                    "label": 0
                },
                {
                    "sent": "So of course, how can you make a site that can give people information about words on the fly?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically, this is how we're thinking about it.",
                    "label": 0
                },
                {
                    "sent": "This is the obligatory Vic and Stein reference, and so we really, truly believe it were Nick that the meaning of a word is in fact it's use in the language.",
                    "label": 1
                },
                {
                    "sent": "So we want to show people how words are used in English, and that is what we want to show them primarily.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this of course is the not so obligatory.",
                    "label": 0
                },
                {
                    "sent": "Although usually when I use this slide, I'm not talking to lexicographers who they have no idea who deep trenches and.",
                    "label": 0
                },
                {
                    "sent": "But this is in fact what they thought about when they first started working on the Oxford English Dictionary.",
                    "label": 0
                },
                {
                    "sent": "Let's take these quotations and let's make them yield as much information as they can be made to yield.",
                    "label": 1
                },
                {
                    "sent": "To illustrate the word, not necessarily tell us about the thing and then.",
                    "label": 0
                },
                {
                    "sent": "In the do and happy selection of these so is it possible to combine both objects and then he goes on and says the lexicographer can display eminent skill.",
                    "label": 1
                },
                {
                    "sent": "So I think you know the lexicographer can still display eminent skill in the selection of examples, but we can turn ourselves into lexicographical cyborgs and let computers help us in the select.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of these examples, which is what we do with wording, so we have about 15,000,000 billion words of running text.",
                    "label": 0
                },
                {
                    "sent": "This word is quite unusual in English.",
                    "label": 0
                },
                {
                    "sent": "It's fairly new.",
                    "label": 0
                },
                {
                    "sent": "A blend of the word bro.",
                    "label": 0
                },
                {
                    "sent": "As in brother, an rodeo.",
                    "label": 0
                },
                {
                    "sent": "Um, it's slightly derogatory, I think from the examples I did not know this word until day before yesterday.",
                    "label": 0
                },
                {
                    "sent": "Obviously, I'm not invited to a lot of rodeos.",
                    "label": 0
                },
                {
                    "sent": "So you can see, for example, I don't know if you read the floor was a rowdy, sweaty brodeo with an XY to XX ratio.",
                    "label": 0
                },
                {
                    "sent": "Know better than three to one.",
                    "label": 0
                },
                {
                    "sent": "Lots of guys there.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "I also notice that the place is filled with mostly guys, a veritable bromantic brodeo.",
                    "label": 0
                },
                {
                    "sent": "So Bromantic is another bro word.",
                    "label": 0
                },
                {
                    "sent": "It's a romantic relationship is a platonic, but very close emotional relationship between two men.",
                    "label": 0
                },
                {
                    "sent": "I think romantic actually made it into the last OBD update or the one before this one.",
                    "label": 0
                },
                {
                    "sent": "So we thought, OK, we have no other data.",
                    "label": 0
                },
                {
                    "sent": "About brodeo at all.",
                    "label": 0
                },
                {
                    "sent": "We really, I think in a traditional dictionary, a traditional prediction would not have enough data to write what would be considered to be a Canonical definition.",
                    "label": 0
                },
                {
                    "sent": "But if you are a native speaker of English, this is how you learn most of the words that you run across.",
                    "label": 0
                },
                {
                    "sent": "You don't look them up and read their definitions, you encounter them usually in journalistic writing or in books, and you internalize a bunch of these sentences, especially if you're reading, say, the Washington Post article is about a concert at a famous nightclub in DC.",
                    "label": 0
                },
                {
                    "sent": "Then the other one is from a blog, so if this is the kind of texture reading you see enough references to brodeo, we believe that you'll figure it out.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another kind of entry date, or MA.",
                    "label": 0
                },
                {
                    "sent": "I guess my French is terrible, so.",
                    "label": 0
                },
                {
                    "sent": "What we're trying to do with the word like brodeo is we didn't have very much data, so we would just show you whatever we've got.",
                    "label": 0
                },
                {
                    "sent": "If we got two.",
                    "label": 0
                },
                {
                    "sent": "Sentence is if we've got three sentence is depending on how long the examples are.",
                    "label": 0
                },
                {
                    "sent": "We fill them to a level on the page.",
                    "label": 0
                },
                {
                    "sent": "Here we have algorithmically determined this sentence looks explanatory, so this is not so much trenches.",
                    "label": 0
                },
                {
                    "sent": "How the word is used, but what is this thing?",
                    "label": 0
                },
                {
                    "sent": "And so this sentence is the concept of Tacoma Award.",
                    "label": 0
                },
                {
                    "sent": "The situation is coined to describe the recycling of artistic elements in a new context to express a different meaning than the original artist.",
                    "label": 0
                },
                {
                    "sent": "Will that subtly different from Goddard's approach to pastiche as genre, oh, mosh, so I don't know if this would really tell you anything.",
                    "label": 0
                },
                {
                    "sent": "But that may be the domain's problem and not necessarily the sentences problem, but we're looking for sentences like this where we don't have a traditional definition so that we can give the lay reader what lexicographers may be looking at a lot of.",
                    "label": 0
                },
                {
                    "sent": "What we have also in the kind of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The dearth of information category this word actually shows up in a traditional dictionary we digitized.",
                    "label": 0
                },
                {
                    "sent": "Oh, it's hard to see this is from the Century Dictionary Encyclopedia which we digitized because it's out of Copyright.",
                    "label": 0
                },
                {
                    "sent": "An it's also awesome.",
                    "label": 0
                },
                {
                    "sent": "If you're not familiar with the century dictionary, I highly recommend it was one of the first.",
                    "label": 0
                },
                {
                    "sent": "It was one of the first dictionaries to seriously treat Americanisms.",
                    "label": 0
                },
                {
                    "sent": "It was one of the first dictionaries to seriously treat terms from science and technology.",
                    "label": 0
                },
                {
                    "sent": "It's amazing how much technological vocabulary is still in the century and is still applicable.",
                    "label": 0
                },
                {
                    "sent": "It's also a lovely history of science document when you read a bunch of stuff about, say, eugenics and things that were very interesting to scientists at the time.",
                    "label": 0
                },
                {
                    "sent": "And now we look pretty much askance at.",
                    "label": 0
                },
                {
                    "sent": "But people do look up this kind of word onboard Nic as well, because most people who come to Wordnik find us because they've done a search in a large commercial search engine and they're looking for a word that is not in any of the other dictionary sources that are indexed by these search engines.",
                    "label": 0
                },
                {
                    "sent": "So in fact, the way I found out that someone had looked up this word is that I checked our Google Analytics index.",
                    "label": 0
                },
                {
                    "sent": "Yesterday and thought, OK, well what in the top 10 words is odd and this was it.",
                    "label": 0
                },
                {
                    "sent": "So this was looked up quite a bit yesterday.",
                    "label": 0
                },
                {
                    "sent": "Often this happens because because a word will make it into mass media.",
                    "label": 0
                },
                {
                    "sent": "Bill O'Reilly, kind of right wing American political pundit.",
                    "label": 0
                },
                {
                    "sent": "He often uses very old, archaic and unusual words as his word of the day, and we can tell when he's done this because we see a surge of traffic to words that we think nobody's ever paid attention to.",
                    "label": 0
                },
                {
                    "sent": "In less you know twenty 3040 years.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other kinds of data that we assemble our traditional thesaurus type data.",
                    "label": 0
                },
                {
                    "sent": "So this is what we call the related words for tapioca.",
                    "label": 0
                },
                {
                    "sent": "So we use a lot of this data from Word NET.",
                    "label": 0
                },
                {
                    "sent": "We also have a reverse dictionary search where we tell you entries where the word tapioca appears.",
                    "label": 0
                },
                {
                    "sent": "The tags are entirely user generated, so somebody was motivated enough to log into word net.",
                    "label": 0
                },
                {
                    "sent": "Create an account, an tag this word as food.",
                    "label": 0
                },
                {
                    "sent": "In the same context is what we have determined syntactically?",
                    "label": 0
                },
                {
                    "sent": "So we've parsed a bunch of.",
                    "label": 0
                },
                {
                    "sent": "Sentence is an we look for words that are in similar syntactic relationships as the word tapioca.",
                    "label": 0
                },
                {
                    "sent": "This works really nicely with tapioca because you can see, oh, cornstarch.",
                    "label": 0
                },
                {
                    "sent": "Icing glasses are all thickeners.",
                    "label": 0
                },
                {
                    "sent": "These are other things that you cook with.",
                    "label": 0
                },
                {
                    "sent": "Tapioca, macaroni, tapioca and lard.",
                    "label": 0
                },
                {
                    "sent": "That's problem.",
                    "label": 0
                },
                {
                    "sent": "Sue it, those are a little more off, but error root.",
                    "label": 0
                },
                {
                    "sent": "All of these are really nice because there's a lot of data for tapioca.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it gets weird, so here's the one for Bice.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And lots of tags on bison.",
                    "label": 0
                },
                {
                    "sent": "For some reason, somebody thinks that there's a color called bison.",
                    "label": 0
                },
                {
                    "sent": "Who are we to argue?",
                    "label": 0
                },
                {
                    "sent": "The reverse dictionary bison shows up in those entries, but in the same context I don't know if you could see it.",
                    "label": 0
                },
                {
                    "sent": "Where is it?",
                    "label": 0
                },
                {
                    "sent": "About 1/3 of the way down the word Tabuk?",
                    "label": 0
                },
                {
                    "sent": "Does anybody know what a book is?",
                    "label": 0
                },
                {
                    "sent": "Tabl UK.",
                    "label": 0
                },
                {
                    "sent": "So a topic is a fictional animal in the Gore science fiction novels, which we happen to have all love in our corpus and so.",
                    "label": 0
                },
                {
                    "sent": "It evidently behaves quite a lot like real world bison.",
                    "label": 0
                },
                {
                    "sent": "Do you can drive them?",
                    "label": 0
                },
                {
                    "sent": "You can yoke them, you can hunt them and so this is the kind of thing that shows up in the automatic processing of the data.",
                    "label": 0
                },
                {
                    "sent": "I don't think a conventional print lexicographer would let this fictional animal show up in a regular thesaurus, but we didn't think it was doing any harm because of course it's clickable and you can go straight to the entry for topic where it's completely evident because all the sentences, all the examples are from the Gore science fiction novels.",
                    "label": 0
                },
                {
                    "sent": "So this is the kind of.",
                    "label": 0
                },
                {
                    "sent": "Derived data that we think gives users interesting information that would not be accessible.",
                    "label": 0
                },
                {
                    "sent": "That's a little serendipitous, often funny, and when we're weighing whether to allow certain kinds of data through the automatic processing, there are couple of things that we take into consideration.",
                    "label": 0
                },
                {
                    "sent": "One is, how difficult would it be to stop?",
                    "label": 0
                },
                {
                    "sent": "Would it take a lot of editors to keep this stuff out when we have to get rid of all the Gor novels in order to keep the top book out of this list?",
                    "label": 0
                },
                {
                    "sent": "Would it have to require editorial intervention afterwards and the other one is how much harm does it do?",
                    "label": 0
                },
                {
                    "sent": "For instance, we expect that a lot of our users are monolingual native English speakers.",
                    "label": 0
                },
                {
                    "sent": "If you were not a monolingual native English speaker and you are looking for a synonym for bison and we give you to book how much trouble are you going to get in if you use it in the context of bison, we thought you might get into some trouble, but.",
                    "label": 0
                },
                {
                    "sent": "We hope that it wouldn't be a trouble of a different degree or severity that you would get into if you just use a normal thesaurus badly anchos another synonym without actually checking which is what happens all the time when people use the sources, they choose a synonym based on how it looks or how they think it sounds, and they don't actually check the meaning.",
                    "label": 0
                },
                {
                    "sent": "And then that's when they get into.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Trouble?",
                    "label": 0
                },
                {
                    "sent": "So this is another kind of derived information that we think is very important for users of the site because it gives feedback on.",
                    "label": 0
                },
                {
                    "sent": "Especially for words that we don't have a lot of data on.",
                    "label": 0
                },
                {
                    "sent": "So if we don't have a definition for a word or we don't have very many example sentences, knowing that the words been looked up quite a bit or not very much, knowing that enough people have looked at the word to decide that it might be a favorite if it's been on a lot of lists.",
                    "label": 0
                },
                {
                    "sent": "If it's been commented on and whether it's an official Scrabble word or not, these are all pieces of information that people use to make their own decisions about the acceptability of a particular word for the purpose.",
                    "label": 0
                },
                {
                    "sent": "That they're looking the word up for.",
                    "label": 0
                },
                {
                    "sent": "So we found that when we ask people casually, what do the stats mean to you?",
                    "label": 0
                },
                {
                    "sent": "They put the most reliance on the Scrabble score.",
                    "label": 0
                },
                {
                    "sent": "And after that they tend to think about oh OK, well is it in on a lot of lists?",
                    "label": 0
                },
                {
                    "sent": "Because that takes effort.",
                    "label": 0
                },
                {
                    "sent": "People had to do something to put it on the list and do people consider it a favorite.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We allow logged in users of the site to both favorite words.",
                    "label": 0
                },
                {
                    "sent": "These are favourites from yesterday and also to record pronunciations.",
                    "label": 0
                },
                {
                    "sent": "We also record pronunciations ourselves, although very few.",
                    "label": 0
                },
                {
                    "sent": "The last the top five recorded pronunciations are words that are words of the day for word neck this week, and in fact you're getting a sneak preview because I both phobia is our word of the day for Friday.",
                    "label": 0
                },
                {
                    "sent": "So if you want to know what are the upcoming words of the downward go, check the recent pronunciations because we record the pronunciations in advance.",
                    "label": 0
                },
                {
                    "sent": "List.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lists are a very important part of the site that we didn't expect to be as important as they are.",
                    "label": 0
                },
                {
                    "sent": "We have more than 30,000 almost 40,000 entirely user created lists on the site right now.",
                    "label": 0
                },
                {
                    "sent": "In 2010 we merged with another site called Wordy Org.",
                    "label": 0
                },
                {
                    "sent": "Up until that point, Wordnik had pretty much just derived data from our corpus, and wordy had in only user created data from their users.",
                    "label": 0
                },
                {
                    "sent": "So with that, oh, this is a really nice match.",
                    "label": 0
                },
                {
                    "sent": "The word orgasm one man show run by a great guy named John McGrath and so he joined us, started working on the front end of the website and we merge the two sites together and so this is on the word Google and you can see the kinds of lists that people add.",
                    "label": 0
                },
                {
                    "sent": "The kinds of words like Google too.",
                    "label": 0
                },
                {
                    "sent": "So there's a whole list about words that this user thought were 19th century.",
                    "label": 0
                },
                {
                    "sent": "There's a list that is just interesting words from the novel Clarissa.",
                    "label": 0
                },
                {
                    "sent": "There's a list of.",
                    "label": 0
                },
                {
                    "sent": "Sounds that are about water or ripples, or that kind of thing and then.",
                    "label": 0
                },
                {
                    "sent": "Dis cordial is a list of unpleasant sounds so you can see that the ripples list is fairly pleasant, and the Discord list is mostly unpleasant and you get a characterization of the word from the overlapping of the list.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of data on wording, and we expect a lot from our users in that we think that users will bring to bear the same technique or lack of technique that they have in discriminating sources of information to this site.",
                    "label": 0
                },
                {
                    "sent": "And this may be a unusual hope on our part, but we think especially what's now called digital natives.",
                    "label": 0
                },
                {
                    "sent": "We think they're spending more time and learning more critical thinking skills as they try and navigate this information morass, and we think that if long as we present information transparently, all the example sentence is linked to their source.",
                    "label": 0
                },
                {
                    "sent": "All the lists linked to their their creators, as long as we present this information transparently, then the users will be able to make the decision.",
                    "label": 0
                },
                {
                    "sent": "About the suitability of whatever, there were whatever the word that they're looking up is for whatever purpose they're looking it up for.",
                    "label": 0
                },
                {
                    "sent": "Some of our lists are extr.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mainly popular, this has been our number one search result for weeks now.",
                    "label": 0
                },
                {
                    "sent": "This list goes on quite awhile so there are 239 words that you were supposed to try and use in colloquial speech without sounding like a pretentious ass.",
                    "label": 0
                },
                {
                    "sent": "This list has been twitted probably 200 times over the last month.",
                    "label": 0
                },
                {
                    "sent": "It gets tweeted several times.",
                    "label": 0
                },
                {
                    "sent": "Inode dies down for a little bit, then gets treated over and over again.",
                    "label": 0
                },
                {
                    "sent": "It's really had a ripple effect and this is not a particularly active user on the site.",
                    "label": 0
                },
                {
                    "sent": "He's only made 19 lists.",
                    "label": 0
                },
                {
                    "sent": "He's listed a lot of words, but nearly 1/3 of them are in this list.",
                    "label": 0
                },
                {
                    "sent": "He's only written about 50 three comments, which is pretty low for a user who comments at all, and he's got 16 favorite words, probably none of which are on this list.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of proscriptive information that we try and provide on the site, but we don't try to provide it.",
                    "label": 0
                },
                {
                    "sent": "So the word Nicks that are official word next that work at wordnik, we do very little of this.",
                    "label": 0
                },
                {
                    "sent": "What we try to do is make it easy for speakers of English to communicate this information to each other which they also do in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Comments, so this is a terrible word.",
                    "label": 0
                },
                {
                    "sent": "The first comment that was left is a definition.",
                    "label": 0
                },
                {
                    "sent": "A surgical sponge accidentally left inside a patient's body.",
                    "label": 0
                },
                {
                    "sent": "The next comment is a joke.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's why I'm always thirsty.",
                    "label": 0
                },
                {
                    "sent": "Some, then the first commenter comes back again, just stopping by to admire the specific specificity of this word and then.",
                    "label": 0
                },
                {
                    "sent": "Another user comes by and says, well, I think that this word is used to provide cover for the doctors, so use this word in the patients file so that if somebody reads the patients file they won't actually know that you made a medical error because nobody knows what this word is.",
                    "label": 0
                },
                {
                    "sent": "And then somebody else comes back and adds more corroborating data.",
                    "label": 0
                },
                {
                    "sent": "He says, well, the Unreferenced Wikipedia page for this word, and then he gives an Atom aladji says, it combines the Latin gossipy am cotton and the Swahili boamah place of concealment.",
                    "label": 0
                },
                {
                    "sent": "And that's a bizarre hybrid.",
                    "label": 0
                },
                {
                    "sent": "I don't know very many Latin Swahili blends.",
                    "label": 0
                },
                {
                    "sent": "And then you know a completely different user comes and says that.",
                    "label": 0
                },
                {
                    "sent": "Yes, he's commenting on the etymology and then someone else noticed Velma.",
                    "label": 0
                },
                {
                    "sent": "Basically, there's a lot of discussion going on about this word, and are these people experts?",
                    "label": 0
                },
                {
                    "sent": "Probably not.",
                    "label": 0
                },
                {
                    "sent": "They've gone and done a little bit of research and they brought it all here.",
                    "label": 0
                },
                {
                    "sent": "And you can see there's one tweet about it, and the tweet is basically what is this thing?",
                    "label": 0
                },
                {
                    "sent": "And I don't know if it's meant to be like a bar, quiz, pub, quiz question, or what, but that's just what are there.",
                    "label": 0
                },
                {
                    "sent": "What's there?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the same lines of the how not to be a pretentious ass list.",
                    "label": 0
                },
                {
                    "sent": "This is another list where people are making their proscriptive opinions known.",
                    "label": 0
                },
                {
                    "sent": "These are words that people think are hateful business words.",
                    "label": 0
                },
                {
                    "sent": "I can't really disagree with any of these.",
                    "label": 0
                },
                {
                    "sent": "I think they are probably overused and oddly enough, if you look up hate on wordnik, we have an option to see all the search results for a particular word and that will bring you to all the lists that mention a particular word in their title.",
                    "label": 0
                },
                {
                    "sent": "The number of lists of where people keep lists of words that they hate is quite significant an it's interesting to me.",
                    "label": 0
                },
                {
                    "sent": "How much effort that takes to go and make a list of words that you particularly hate.",
                    "label": 0
                },
                {
                    "sent": "Here you can see this search.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interface so you can say OK, well here are the search results for Ulysses.",
                    "label": 0
                },
                {
                    "sent": "Those are the words tagged Ulysses, so those are words used in Ulysses that someone has noticed and tagged with the word Ulysses.",
                    "label": 0
                },
                {
                    "sent": "There are several lists.",
                    "label": 0
                },
                {
                    "sent": "Actually, there are more than that of words from Ulysses that people have made their own personal lists for, and then it also shows up in a list of all one word book titles.",
                    "label": 0
                },
                {
                    "sent": "So it's not just lexical information but also encyclopedic information that people are putting together on the site.",
                    "label": 0
                },
                {
                    "sent": "We also add.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your gate information.",
                    "label": 0
                },
                {
                    "sent": "That's none text, so this is a Flickr set.",
                    "label": 0
                },
                {
                    "sent": "We use the Flickr API and we pull images that are Creative Commons licensed.",
                    "label": 0
                },
                {
                    "sent": "Does anybody want to guess what word this is for?",
                    "label": 0
                },
                {
                    "sent": "It's for the word Honor, which we don't necessarily this the word honor would never be illustrated in a traditional print dictionary because it's an abstract noun.",
                    "label": 0
                },
                {
                    "sent": "I mean, how would you give a picture of honor, but a lot of people have tagged pictures on Flickr with the word Honor, and this is what it looks like to them.",
                    "label": 0
                },
                {
                    "sent": "I think that because it's so close to veteran's day, that's why there are all these military images.",
                    "label": 0
                },
                {
                    "sent": "When I've looked at this before, they're usually more images of pretty women named honor, which is a fairly common name in English for a woman.",
                    "label": 0
                },
                {
                    "sent": "So, and the one outlier here is the piece of I guess Renaissance era art, and I clicked through to say, why is this here?",
                    "label": 0
                },
                {
                    "sent": "I thought maybe this womans was named honor.",
                    "label": 0
                },
                {
                    "sent": "But no, it's a piece of art that is held at the Legion of Honor Museum in San Francisco.",
                    "label": 0
                },
                {
                    "sent": "So that was pretty interesting and we pull Flickr images for every single word.",
                    "label": 0
                },
                {
                    "sent": "So if there are images on Flickr that are Creative Commons licensed and that are tagged with the word that you just looked up, you will see the images for them.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also pull tweets for every word this.",
                    "label": 0
                },
                {
                    "sent": "These are the tweets that showed up the last few days for the word swag tics, which is a blend of swagger and tactics.",
                    "label": 0
                },
                {
                    "sent": "So if you want to have swagger which is now defined as style.",
                    "label": 0
                },
                {
                    "sent": "These are the tactics you need to employ to achieve swagger and what I think is very interesting about this.",
                    "label": 0
                },
                {
                    "sent": "That also kind of falls under the category of meta information.",
                    "label": 0
                },
                {
                    "sent": "Is that all these tweets are from the same person, so this person is desperately trying to make this word happen.",
                    "label": 0
                },
                {
                    "sent": "This is, I don't.",
                    "label": 0
                },
                {
                    "sent": "We don't see any other tweets from anyone else using this hashtag or using this word at all.",
                    "label": 0
                },
                {
                    "sent": "So the single source, the single point source of this information is information that we think our users use to decide on whether something is in general use or not.",
                    "label": 0
                },
                {
                    "sent": "If all the examples come from the same place.",
                    "label": 0
                },
                {
                    "sent": "It's quite likely to be a word that's very restricted.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as we've been putting together this site, we've learned quite quite a bit, and so I've kind of given the overview of what we aggregate to put work together, and this is what we've learned in the process of.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aggregating and the first thing we learned.",
                    "label": 0
                },
                {
                    "sent": "Oh kids it so this is a piece of graffiti on a bridge overpass that says normal people never look up.",
                    "label": 0
                },
                {
                    "sent": "And then there's a piquero and we have found that in fact.",
                    "label": 0
                },
                {
                    "sent": "Quite a lot of folks who don't want to use a print dictionary who come up to people like me and say oh, so, have you had this happen to you as lexicographers where you say, oh, I work on making dictionaries and then somebody apologizes for never using a dictionary?",
                    "label": 0
                },
                {
                    "sent": "Like oh, I never use dictionaries, I'm so sorry.",
                    "label": 0
                },
                {
                    "sent": "I I don't know if dentists get like I never go to the dentist or you know, hairdressers get oh I cut my own hair you know the.",
                    "label": 0
                },
                {
                    "sent": "When people have come up to me and say, oh, I never use a dictionary, I often ask them why and they say, well, it's inconvenient.",
                    "label": 0
                },
                {
                    "sent": "It's boring.",
                    "label": 0
                },
                {
                    "sent": "I always mean to go back later and look things up.",
                    "label": 0
                },
                {
                    "sent": "I don't have time.",
                    "label": 0
                },
                {
                    "sent": "I usually pick it up from the context.",
                    "label": 0
                },
                {
                    "sent": "These are all the uses that I've had and I feel like for the majority of monolingual native English speakers, they don't actually use dictionaries very often.",
                    "label": 0
                },
                {
                    "sent": "They think of dictionaries as things for learners, either children or second language learners, and.",
                    "label": 0
                },
                {
                    "sent": "The reaction that we've gotten from so-called normal people who never look things up is when they are introduced to wordnik, they think of it less like a dictionary and more like a game.",
                    "label": 0
                },
                {
                    "sent": "We also have quite a lot of what we consider drive through users who come to us via search engine pantua.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Page for ten 1530 seconds.",
                    "label": 0
                },
                {
                    "sent": "Evidently get what they want or not, and take off never to be seen again and this is what we think of as the normal users who never look things up with me or driven to it by desperation.",
                    "label": 0
                },
                {
                    "sent": "Then they want to get the experience over with as quickly as they can.",
                    "label": 0
                },
                {
                    "sent": "An at the other end are the P.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Who come and stay on the site all the time and they create elaborate in jokes.",
                    "label": 0
                },
                {
                    "sent": "So this is a proposed conference of Word Enix.",
                    "label": 0
                },
                {
                    "sent": "So people who used to be on the site word organe word next have blended together to make a kind of joint nationality of Word Enix.",
                    "label": 0
                },
                {
                    "sent": "They want.",
                    "label": 0
                },
                {
                    "sent": "I don't know if this is going to happen or not.",
                    "label": 0
                },
                {
                    "sent": "They haven't asked us about it.",
                    "label": 0
                },
                {
                    "sent": "We wouldn't say yes or no in either case.",
                    "label": 0
                },
                {
                    "sent": "At the Indiana University in Bloomington, they're going to have an old time fiddle and banjo performance.",
                    "label": 0
                },
                {
                    "sent": "Uh, and so all of these things that are on these lists.",
                    "label": 0
                },
                {
                    "sent": "Word word dies in tsunami related pages.",
                    "label": 0
                },
                {
                    "sent": "The joy of umbrage.",
                    "label": 0
                },
                {
                    "sent": "There's a running joke among the heavy commenters on the site about taking umbrage, so they say who's got the umbrage?",
                    "label": 0
                },
                {
                    "sent": "It's my turn to have the umbrage.",
                    "label": 0
                },
                {
                    "sent": "You've taken the umbrage away, and now I can't find it.",
                    "label": 0
                },
                {
                    "sent": "So they're taking this metaphor in English and making it extremely literal.",
                    "label": 0
                },
                {
                    "sent": "And so they often yell at each other in a kind of kidding way about it.",
                    "label": 0
                },
                {
                    "sent": "Who's got the umbrage?",
                    "label": 0
                },
                {
                    "sent": "And please give it back to me.",
                    "label": 0
                },
                {
                    "sent": "Anytime somebody criticizes something that someone else does on the site, for instance, somebody makes a warning is completely case sensitive, so if somebody makes a list where all the words start with capital letters and somebody leaves a comment to gently remind someone over next case sensitive, do you really want all these words?",
                    "label": 0
                },
                {
                    "sent": "Start with capital letters.",
                    "label": 0
                },
                {
                    "sent": "Almost invariably, somebody will come by and add the comment.",
                    "label": 0
                },
                {
                    "sent": "Why do you hate freedom?",
                    "label": 0
                },
                {
                    "sent": "It doesn't seem to get in the way of the drive by users, but it makes the experience a lot more fun for the people who like to hang out on word.",
                    "label": 0
                },
                {
                    "sent": "It quite a bit.",
                    "label": 0
                },
                {
                    "sent": "I don't understand the dangers of epileptic Lego morph driving.",
                    "label": 0
                },
                {
                    "sent": "I think that probably you shouldn't let rabbits drive in any case.",
                    "label": 0
                },
                {
                    "sent": "But it's a meme that appears over and over again.",
                    "label": 0
                },
                {
                    "sent": "This site.",
                    "label": 0
                },
                {
                    "sent": "I think it's one of the truths of the Internet that if you create a site an let people contribute, they're going to do whatever the heck they want.",
                    "label": 0
                },
                {
                    "sent": "And you might as well, as long as it's not incredibly offensive or harmful to people, you just have to get out of their way that policing a site takes all the fun out of it.",
                    "label": 0
                },
                {
                    "sent": "For people who are usually having pretty harmless fun an in less you're running, say 4 Chan, you're pretty safe in letting people who are signed in users behave like grownups.",
                    "label": 0
                },
                {
                    "sent": "Buffalo nology there's some kind of thing called pufflings, and when there are open lists that everybody can contribute to, not just the list creator, oftentimes people will come by and add that word to the list as a in Group.",
                    "label": 0
                },
                {
                    "sent": "Funny marker.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a lot of theologizing on Wordnik, and again, we let this happen because it doesn't get in the way, because if somebody creates a new word and leaves a comment on wordnik, the chances that someone else who could possibly be confused about the status of this words acceptability in standard English will run across this is very slight, because, unlike a print dictionary, it's not very browsable.",
                    "label": 0
                },
                {
                    "sent": "So this is slight Geist which is a hidden plan to change the status quo, subtly or otherwise without informing or consulting with the constituents.",
                    "label": 0
                },
                {
                    "sent": "An actually this user has very kindly linked this to the word made.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pickle made a pickle is a word Nick in term, but that the word is in Word next use whenever they make something up.",
                    "label": 0
                },
                {
                    "sent": "They refer to the word is made a pickle.",
                    "label": 0
                },
                {
                    "sent": "Fairly straightforward, it's also been looked at 2300 times, so from a typical word it's fairly real.",
                    "label": 0
                },
                {
                    "sent": "At this point it's on 39 different lists an it's been commented on 70 times, but of course our friends at Scrabble are not yet.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One over and possibly the biggest example of a made up pickle where that has hit wordnik is this word malaman to which happened last May.",
                    "label": 0
                },
                {
                    "sent": "This is the Internet comic strip, ex KCD it is required reading for nerds so it's very popular among software engineers and so the author of this comic drew this comic last May about and.",
                    "label": 0
                },
                {
                    "sent": "He used this to poke fun at Wikipedia, so he said, OK, well there's here's his Wikipedia entry from Allaman, to which is a neologism for a portmanteau created by incorrectly combining a malapropism with a neologism.",
                    "label": 0
                },
                {
                    "sent": "Which is I'm not even sure is technically possible.",
                    "label": 0
                },
                {
                    "sent": "So this turned into a thing on the Internet where people who read this comic went right away to create this Wikipedia page, because why wouldn't you right?",
                    "label": 0
                },
                {
                    "sent": "And so?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Within a couple of hours we had an entry for it that consisted mainly of these comics, so somebody said, oh OK, well I discovered this word here and I'm looking up now.",
                    "label": 0
                },
                {
                    "sent": "I'm going to create this other word Mallow man, to which is a portmanteau that involves marshmallows, an.",
                    "label": 0
                },
                {
                    "sent": "We got example sentences from across the Internet and then it got looked up.",
                    "label": 0
                },
                {
                    "sent": "I thought it was 3500 times, mostly from people who were searching for it and they all came to us and a lot of people called it a favorite.",
                    "label": 0
                },
                {
                    "sent": "They put on list.",
                    "label": 0
                },
                {
                    "sent": "Still not valid in Scrabble.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whenever folks say oh, OK, well, we're Nicholas a lot of words that are made a pickle or not real were like, OK, well what's real to a native English speaker.",
                    "label": 0
                },
                {
                    "sent": "It's a lexical item or assumed to be lexicalized item that they are interested in an.",
                    "label": 0
                },
                {
                    "sent": "Should we tell them to go away and stop bothering us until the word is fixed in the language?",
                    "label": 0
                },
                {
                    "sent": "Or should we try and give them as much information as possible, as fast as we possibly can, so we have kind of gone the as fast as we possibly can route, and I just wanted to compare these two words so Momento.",
                    "label": 0
                },
                {
                    "sent": "Looked up almost 3500 times, Aglae, which occurs in the poetry of Robert Burns.",
                    "label": 0
                },
                {
                    "sent": "The best laid plans of mice and men gang aft agley is something that almost all schoolchildren encounter English speaking school children will encounter that at some point in their schooling careers that never gets looked up comparatively.",
                    "label": 0
                },
                {
                    "sent": "600 times.",
                    "label": 0
                },
                {
                    "sent": "It's never been favorited.",
                    "label": 0
                },
                {
                    "sent": "Nobody likes burns anymore.",
                    "label": 0
                },
                {
                    "sent": "I suppose it's mostly listed on lists of words from Scottish and.",
                    "label": 0
                },
                {
                    "sent": "So, but it's officially Scrabble worthy.",
                    "label": 0
                },
                {
                    "sent": "So as we've collected all this information both from users from the corpus that we've gathered and from the dictionary text that we have digitized in the dictionary text that we have licensed, what we found that we thought is very interesting is that.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Far, far fewer people are concerned about what we thought would be the big concerns about Copyright than they are, so we have entered into official relationships with a lot of publishers to allow us to use their data for our corpus, and we also use blog text, but the only instances where people have sent us takedown notices are people for whom.",
                    "label": 0
                },
                {
                    "sent": "People who have gotten in trouble with the law and had that trouble with the law reported in their hometown newspaper and then done a search on their own names and had their name come up on Wordnik, in a sentence that defined the crime.",
                    "label": 0
                },
                {
                    "sent": "These people are very unhappy to have these sentences on word deck and we take them down as a matter of course, because they have really very little lexical value.",
                    "label": 0
                },
                {
                    "sent": "Unless these people have committed a brand new crime for which they needed a new term.",
                    "label": 0
                },
                {
                    "sent": "We have not yet had that happen.",
                    "label": 0
                },
                {
                    "sent": "Most the crimes tend to be embarrassing and terrible like DUI, but not innovative.",
                    "label": 0
                },
                {
                    "sent": "So we really had no problems at all, mostly because we use such short snippets of text, a sentence or less, most of the time, and we link and on the Internet.",
                    "label": 0
                },
                {
                    "sent": "Linking is considered currency, so even though the number of people who click through is relatively small, the folks who are linked to think, oh, it's cool and there seems to be some kind of residual authority even in a dictionary shaped object like word Nick from being in a dictionary.",
                    "label": 0
                },
                {
                    "sent": "So we often see tweets from people who are like oh hey guys, check it out.",
                    "label": 0
                },
                {
                    "sent": "My sentence is on wordnik from their tweets from something they've written on a blog post.",
                    "label": 0
                },
                {
                    "sent": "There is a very entertaining word called mansplaining.",
                    "label": 0
                },
                {
                    "sent": "Has anybody heard of mansplaining?",
                    "label": 0
                },
                {
                    "sent": "This is a phenomenon that I think most women are aware of where.",
                    "label": 0
                },
                {
                    "sent": "You are talking about a topic of which you possibly know a great deal, an someone with.",
                    "label": 0
                },
                {
                    "sent": "XY chromosome comes up to you and proceeds to explain to you in detail the topic that you already know about.",
                    "label": 0
                },
                {
                    "sent": "The most famous example of this was a New York writer who was out on the West Coast and she just written a book about the guy who did the photographs of early horses with the Stop Motion photography that really showed for the first time how horses actually ran and she was in this conversation and this guy came up and she's like, Oh well, you know, I, you know, that's very interesting.",
                    "label": 0
                },
                {
                    "sent": "It turns out he did do this, that and the other thing and he stopped her and he preceded to explain that he had just read this fascinating book on the topic and.",
                    "label": 0
                },
                {
                    "sent": "You know, set up.",
                    "label": 0
                },
                {
                    "sent": "She could possibly know she was talking about 'cause he had.",
                    "label": 0
                },
                {
                    "sent": "Just read the book and of course it was the book she had written.",
                    "label": 0
                },
                {
                    "sent": "That's a very extreme example of mansplaining.",
                    "label": 0
                },
                {
                    "sent": "But the woman who coined the word mansplaining, who writes a feminist blog, was extremely happy to see the sentence for mansplaining onboard.",
                    "label": 0
                },
                {
                    "sent": "Nic.",
                    "label": 0
                },
                {
                    "sent": "I think that surprised us greatly, given how happy people have been to see.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, sentences on where Nick is, how very few people want to write definitions at all.",
                    "label": 0
                },
                {
                    "sent": "People like to add comments and sometimes the comments are vaguely definition, but the number of people have asked to write definitions is a rounding error in the traffic of the site and most people.",
                    "label": 0
                },
                {
                    "sent": "If they really, really want to write definitions, we encourage them to go to Wiktionary.",
                    "label": 0
                },
                {
                    "sent": "We parse Wiktionary, it's freely available, and then we add it to the site, and Wiktionary has the apparatus for creating definitions to help people who really want to do it.",
                    "label": 0
                },
                {
                    "sent": "But most people, when they're in the make phase, they want to add meta linguistic information.",
                    "label": 0
                },
                {
                    "sent": "They want to add that the word is their favorite.",
                    "label": 0
                },
                {
                    "sent": "They want to add it to a list and put it in a category they want to add A tag for awhile we had a place where you could suggest a related word, like a synonym or antonym, and very few people did that so.",
                    "label": 0
                },
                {
                    "sent": "We took it off.",
                    "label": 0
                },
                {
                    "sent": "We looked at the data, it was only me that was adding related terms.",
                    "label": 0
                },
                {
                    "sent": "I added quite a few of them, but the number of other people who added related terms at all was.",
                    "label": 0
                },
                {
                    "sent": "We thought it was mostly accidental people typing in the wrong box.",
                    "label": 0
                },
                {
                    "sent": "People in general just don't seem to want to add definitions, and I don't find this surprising because I think writing definitions is very, very difficult, and I think that.",
                    "label": 0
                },
                {
                    "sent": "Even with training, lots of lexicographers get it wrong on multiple occasions so.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then what we've really thought about is all of the things that.",
                    "label": 0
                },
                {
                    "sent": "Have been difficulties we consider to be opportunities so when we find that, for example, our suggester isn't very good, we've been thinking about ways to improve it and the paper earlier today was very helpful.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On that, and this is actually one of the problems that that we had.",
                    "label": 0
                },
                {
                    "sent": "I can make this come up now, so this is the homepage of wordnik, and this is actually a really big problem.",
                    "label": 0
                },
                {
                    "sent": "Takes a long time to load.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "Didn't these words drop?",
                    "label": 0
                },
                {
                    "sent": "From the top of the screen and they tell you a little bit about them, I think this was unfortunately it's hard to read on the screen, but it tells you of this word was recently favorited.",
                    "label": 0
                },
                {
                    "sent": "This word was recently given a pronunciation.",
                    "label": 0
                },
                {
                    "sent": "This word was added to a list.",
                    "label": 0
                },
                {
                    "sent": "There's a terrible, terrible difficulty with this and that people watch it for very long periods of time and don't click on anything.",
                    "label": 0
                },
                {
                    "sent": "So as a homepage it is admirable failure as a piece of art.",
                    "label": 0
                },
                {
                    "sent": "We have been asked to make it into a screensaver.",
                    "label": 0
                },
                {
                    "sent": "Users have called this the rain bars.",
                    "label": 0
                },
                {
                    "sent": "We didn't have a term for it, but that's what the you know the very first day that this launched we started getting comments like oh, I love the rain bars.",
                    "label": 0
                },
                {
                    "sent": "Then we actually looked at the conversions of people coming to the home page and then clicking and then was terrible.",
                    "label": 0
                },
                {
                    "sent": "Just really really bad.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What we've found out is that gave us the idea.",
                    "label": 0
                },
                {
                    "sent": "We shouldn't waste pretty if we make something pretty and it doesn't do what we wanted to do.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't encourage people to look things up if it doesn't encourage people to make data.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't encourage people to enjoy using the site, then pretty is useless.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in fact, we need to get out of the way.",
                    "label": 0
                },
                {
                    "sent": "We need to become invisible.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of things that we would like to do, especially with colocation with word sense disambiguation with multi word expressions, but we can't figure out how to get out of the way.",
                    "label": 0
                },
                {
                    "sent": "We don't want to.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much technical aparatus to the site.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I think this has started to play by itself.",
                    "label": 0
                },
                {
                    "sent": "One of the problems we've had is that you can't automatically mine for definite for etymologies because people get it wrong.",
                    "label": 0
                },
                {
                    "sent": "This is an analogy for swag.",
                    "label": 0
                },
                {
                    "sent": "It appeared in the New York Times and Swag is not a backronym.",
                    "label": 0
                },
                {
                    "sent": "It does not come from the phrase stuff we all get this past.",
                    "label": 0
                },
                {
                    "sent": "the New York Times it past their copy editors it past their fact.",
                    "label": 0
                },
                {
                    "sent": "Checkers swag is a very old word.",
                    "label": 0
                },
                {
                    "sent": "It comes from Scandinavian.",
                    "label": 0
                },
                {
                    "sent": "But that means that when we're looking for good example sentences, we can't rely on data mining techniques to find out etymology.",
                    "label": 0
                },
                {
                    "sent": "Etymology is too difficult and it needs real people.",
                    "label": 0
                },
                {
                    "sent": "We also have to worry about dealing with user error in a print dictionary if there's user error, the lexicographer never finds out about it, or hardly ever finds out about it.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get an angry letter once or twice.",
                    "label": 0
                },
                {
                    "sent": "You might have tests of peoples comprehension or production skills and they they don't do very well and you think Oh well, maybe it's a dictionary fault, but we got this email the other day to our feedback address.",
                    "label": 0
                },
                {
                    "sent": "Why don't we recognize glasnost?",
                    "label": 0
                },
                {
                    "sent": "We do, we think we have an entry.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of data, but for some reason this person could not find it and that was a problem and we're not sure how to solve it.",
                    "label": 0
                },
                {
                    "sent": "We replied very nicely, sent back a link.",
                    "label": 0
                },
                {
                    "sent": "Resisted the urge to sign it gorbachov but.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of thing that happens and by and large the people who take the time to write to us.",
                    "label": 0
                },
                {
                    "sent": "So at first extremely indignant and then very happy because they're very used to writing to websites are not getting any response at all on there.",
                    "label": 0
                },
                {
                    "sent": "Certainly not used to getting responses from traditional dictionaries.",
                    "label": 0
                },
                {
                    "sent": "And when I was working on printing strings it was a real struggle to get the letters answered in a timely fashion.",
                    "label": 0
                },
                {
                    "sent": "But with email it's very simple so.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's next?",
                    "label": 0
                },
                {
                    "sent": "So obviously we want to see all these numbers go up.",
                    "label": 0
                },
                {
                    "sent": "Uh, especially the lists and the number of word mix and the comments because we think that helps people.",
                    "label": 0
                },
                {
                    "sent": "The more data that we can add to any particular lexical item we think if it's constructive data, it's really helpful for folks.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, a lot of the things that we want to do are cheap but not easy.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So getting better example sentences that more reliably reflect the syntagmatic patterns in the language, so better data on collocations, especially better getting better at separating out what we call the free range definitions where somebody usually in a newspaper defines something for their readers.",
                    "label": 0
                },
                {
                    "sent": "From the example sentences that are more.",
                    "label": 0
                },
                {
                    "sent": "Dealing with register or dealing with a factual information like oh, this word sounds slimy to me.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't use it.",
                    "label": 0
                },
                {
                    "sent": "We'd like to reflect all these different kinds of information.",
                    "label": 0
                },
                {
                    "sent": "We like to show prototypical use free range definitions, an kind of commentary or usage note use where people actually comment on the word.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What we I think at this point I should make an admission 'cause I called this notes from an online dictionary.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Project, but we're not really doing lexicography.",
                    "label": 0
                },
                {
                    "sent": "We're doing kind of date or maore assemblage because nobody's writing any definitions at work think we're assembling data and we're creating processes to push as much quality lexical data at people as possible.",
                    "label": 0
                },
                {
                    "sent": "But we're not writing definitions.",
                    "label": 0
                },
                {
                    "sent": "We're not doing very much that would be considered traditional lexicography.",
                    "label": 0
                },
                {
                    "sent": "What we are is kind of a vertical search engine.",
                    "label": 0
                },
                {
                    "sent": "So in the same way that Yelp helps you find places and YouTube helps you find videos and IMDb helps you find information about movies we were trying to make, help you find already existing information about words and very little of it.",
                    "label": 0
                },
                {
                    "sent": "Are we creating ourselves?",
                    "label": 0
                },
                {
                    "sent": "We may make a list here.",
                    "label": 0
                },
                {
                    "sent": "There we may add tags here there, but we're not match more privileged than the average wordnik user.",
                    "label": 0
                },
                {
                    "sent": "There's only two things that I can do that the average wordnik user can't do.",
                    "label": 0
                },
                {
                    "sent": "I can correct typos in the license dictionary, TXT, which happens from time to time.",
                    "label": 0
                },
                {
                    "sent": "An I can create spelling suggestions so if we have a misspelling I can go and make a link in our system that will do a recommender.",
                    "label": 0
                },
                {
                    "sent": "Anything else in terms of lists and terms of tags?",
                    "label": 0
                },
                {
                    "sent": "Any word nicusor can do so?",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I wanted to leave plenty of time for questions and get people to drinks early, but if you have any questions for me, this is how you can reach me on Twitter as well.",
                    "label": 0
                },
                {
                    "sent": "And also I wanted to give a Creative Commons shadow.",
                    "label": 0
                },
                {
                    "sent": "This talk is being licensed under the Creative Commons and all of the images from Flickr I'm using under a Creative Commons license, many of which are share alike licenses.",
                    "label": 0
                },
                {
                    "sent": "So if you would like a copy of these slides to give presentation with yourselves I, I've always wanted somebody to take my slides and give a completely different presentation using all the same slides in the same order.",
                    "label": 0
                },
                {
                    "sent": "So under the creative comments, of course, that is entirely possible, so I'm happy to answer questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your kind attention.",
                    "label": 0
                },
                {
                    "sent": "Thanks, it's a really interesting talk.",
                    "label": 0
                },
                {
                    "sent": "I've got one comment and one question and the comment is maybe the guy who couldn't find Glasnost, got his IP, a keyboard switched on and he got a two byte G which will guarantee to give you absolutely nothing if you search for it anywhere.",
                    "label": 0
                },
                {
                    "sent": "So interesting question.",
                    "label": 0
                },
                {
                    "sent": "We try and Unicode normalize like whatever you search for, try and reduce it, but maybe it wasn't there, but that's a good I just have to know if we have a.",
                    "label": 0
                },
                {
                    "sent": "Did you mean for spaghetti?",
                    "label": 0
                },
                {
                    "sent": "No, OK, I can add 1.",
                    "label": 0
                },
                {
                    "sent": "And my question is, how do you make money?",
                    "label": 0
                },
                {
                    "sent": "That's an excellent question.",
                    "label": 0
                },
                {
                    "sent": "So yes, you can see there are no ads on the site and we can make this a bit smaller than no ads on the site and we really feel that it's very.",
                    "label": 0
                },
                {
                    "sent": "Does anybody disagree that it's very difficult to make money with dictionaries?",
                    "label": 0
                },
                {
                    "sent": "In less, I think that there are still markets for especially for bilingual and for learners dictionaries where there are engaged consumers who really want your product.",
                    "label": 0
                },
                {
                    "sent": "But for modeling native English speakers, the alternative is always the search engine's, and for quite a lot of people that's a good enough answer.",
                    "label": 0
                },
                {
                    "sent": "We want to make a product that is better than a good enough answer.",
                    "label": 0
                },
                {
                    "sent": "That's an engaging, delightful answer, but again, it's not something that folks will pay for, but we've got so much language data now an it's all related to each other.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of data on what people do with words.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of data about how words relate to each other that we've essentially made what amounts to a map of English, so it's like Google Maps.",
                    "label": 0
                },
                {
                    "sent": "We've had our little cars driving around everybody's neighborhood with cameras for awhile, and now we know where lots of things are.",
                    "label": 0
                },
                {
                    "sent": "Once you have a map where nick.com is like the map of English, that tells you, oh here's little red dot.",
                    "label": 0
                },
                {
                    "sent": "Here's where you are at this particular word.",
                    "label": 0
                },
                {
                    "sent": "That's what's here, but the most interesting thing that you could do with a map is to give people directions.",
                    "label": 0
                },
                {
                    "sent": "So say you're in a piece of text.",
                    "label": 0
                },
                {
                    "sent": "What's the equivalent of directions to another piece of text?",
                    "label": 0
                },
                {
                    "sent": "And this is a problem that is actually.",
                    "label": 0
                },
                {
                    "sent": "Something that people will pay for.",
                    "label": 0
                },
                {
                    "sent": "Which is that?",
                    "label": 0
                },
                {
                    "sent": "Given a reader inside a piece of text, what is the next piece of text that you can show them that that will engage them an for the owner of the content?",
                    "label": 0
                },
                {
                    "sent": "For the publisher that helps them monetize in terms of being able to show more advertising, being able to convert people from casual readers to paid subscription readers an?",
                    "label": 0
                },
                {
                    "sent": "It's also something that's fairly entertaining to do, not necessarily is entertaining his dictionary work, but.",
                    "label": 0
                },
                {
                    "sent": "It's certainly worthwhile, and it's nice to see this map of English being used for a purpose, for which oftentimes people are using social signals, so it's nice to know what your friends on Facebook read, but does anybody really click through to things that their friends on Facebook have read?",
                    "label": 0
                },
                {
                    "sent": "I find that either I've already read them because.",
                    "label": 0
                },
                {
                    "sent": "We are friends and we read the same kinds of things or they are so divergent from what I want to read that I don't click on them very much, especially during sports seasons.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "During NCAA basketball season in the United States, almost every single article in my newsfeed is something that I have 0 interest in.",
                    "label": 0
                },
                {
                    "sent": "But matching text to text has problems with keyword analysis and so forth.",
                    "label": 0
                },
                {
                    "sent": "But anyway, we've built a map.",
                    "label": 0
                },
                {
                    "sent": "And that's what will make money.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "What do you give people?",
                    "label": 0
                },
                {
                    "sent": "Piece of text and who you sell it to, right?",
                    "label": 0
                },
                {
                    "sent": "I probably shouldn't give any details about that.",
                    "label": 0
                },
                {
                    "sent": "'cause we haven't launched it yet and it's still in early pilot phases with our partners, so it has a really cool name which I can't even tell you.",
                    "label": 0
                },
                {
                    "sent": "'cause we haven't launched the name yet.",
                    "label": 0
                },
                {
                    "sent": "But it's it's.",
                    "label": 0
                },
                {
                    "sent": "It makes a lovely virtuous.",
                    "label": 0
                },
                {
                    "sent": "It makes a nice circle because the more lexical data and relationship graph data that we can gather from the website, we make a better wernick.",
                    "label": 0
                },
                {
                    "sent": "Com for those users.",
                    "label": 0
                },
                {
                    "sent": "And we also build up the resolution on our map.",
                    "label": 0
                },
                {
                    "sent": "And it's been a little bit of a truism in NLP that dictionaries don't help like people doing NLP.",
                    "label": 0
                },
                {
                    "sent": "They you know they think.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they use dictionaries, but not very often and I just think they're using the wrong kind of Dictionary of course, if you have a dictionary that has 100,000 headwords, that's not going to help.",
                    "label": 0
                },
                {
                    "sent": "It's just it's just too small to get reasonable data results out of.",
                    "label": 0
                },
                {
                    "sent": "So that's my that's our assumption, and that's what we're working off of, and it seems to have panned out pretty well so far.",
                    "label": 0
                },
                {
                    "sent": "So other questions.",
                    "label": 0
                },
                {
                    "sent": "Say a page like this spaghetti spelt wrong is that generated on the fly when someone searches for it, and so I'm trying to get the resolution better based on Internet search or.",
                    "label": 0
                },
                {
                    "sent": "Are you sort of going behind the scenes and picking up words and creating entry pages for them so the whole site is API driven so there's an underlying data store?",
                    "label": 0
                },
                {
                    "sent": "It's in Mongo so it's a non giant non relational database and when word is typed into word Nick a lot of API calls are made.",
                    "label": 0
                },
                {
                    "sent": "This one to the Flickr API, another one to the examples API checking for all the user generated content and assembling it.",
                    "label": 0
                },
                {
                    "sent": "So the page is never static.",
                    "label": 0
                },
                {
                    "sent": "The data underneath may be more or less static.",
                    "label": 0
                },
                {
                    "sent": "So that, for instance, the license dictionary text is pretty much always static because it changes so very rarely.",
                    "label": 0
                },
                {
                    "sent": "The Flickr images change everyday.",
                    "label": 0
                },
                {
                    "sent": "The tweets change every 10 seconds and they refresh.",
                    "label": 0
                },
                {
                    "sent": "So the page is generated, but some of the data is not generated.",
                    "label": 0
                },
                {
                    "sent": "Does that make sense?",
                    "label": 0
                },
                {
                    "sent": "I think so.",
                    "label": 0
                },
                {
                    "sent": "So you can type anything into word Nick and we will show you whatever we've got, so there's a lot.",
                    "label": 0
                },
                {
                    "sent": "Occasionally you can do, like cat walked across the keyboard type stuff.",
                    "label": 0
                },
                {
                    "sent": "And it will, oh, it will sometimes break.",
                    "label": 0
                },
                {
                    "sent": "Oh, I had too many weird characters in there, so let's try one.",
                    "label": 0
                },
                {
                    "sent": "It's a little less.",
                    "label": 0
                },
                {
                    "sent": "It's the semi colons that mess it up.",
                    "label": 0
                },
                {
                    "sent": "That's something we've got fixed in the next edition.",
                    "label": 0
                },
                {
                    "sent": "Yep, so.",
                    "label": 0
                },
                {
                    "sent": "Those are on my list here, but look people tweet this.",
                    "label": 0
                },
                {
                    "sent": "I don't know what that means, it looks like.",
                    "label": 0
                },
                {
                    "sent": "Buy a Justin Bieber fan.",
                    "label": 0
                },
                {
                    "sent": "At any point, I think you can't go more than two entries on Wordnik without seeing a Bieber related tweet.",
                    "label": 0
                },
                {
                    "sent": "But yeah, so I have no idea what this means, but it's got some kind of meaning in a different language an I'm the first person to look this up on wordnik and unfortunately this is not a valid Scrabble word.",
                    "label": 0
                },
                {
                    "sent": "Actually, people have made a game of this.",
                    "label": 0
                },
                {
                    "sent": "If you're the first person to look something up on where did they call it?",
                    "label": 0
                },
                {
                    "sent": "Scoring a word, neck and people keep lists of their word Nicks, which is one of the goals we had when starting the site is that we wanted to get verbed as quickly as possible.",
                    "label": 0
                },
                {
                    "sent": "'cause we think that's a sign of success in a trade name.",
                    "label": 0
                },
                {
                    "sent": "I'd just going back to the spaghetti entries.",
                    "label": 0
                },
                {
                    "sent": "Oh yes.",
                    "label": 0
                },
                {
                    "sent": "Are you then relying on users to say this is the wrong spelling?",
                    "label": 0
                },
                {
                    "sent": "We do have people who tag things with misspelling.",
                    "label": 0
                },
                {
                    "sent": "We also look at the search logs and we run some processes over the search logs to say, oh, you know, this looks suspiciously close.",
                    "label": 0
                },
                {
                    "sent": "English speakers are so incredibly inventive and how they can misspell things.",
                    "label": 0
                },
                {
                    "sent": "That we look at this to make sure that we can add did you means.",
                    "label": 0
                },
                {
                    "sent": "And let's see if I can find 1.",
                    "label": 0
                },
                {
                    "sent": "We will show the wrong data.",
                    "label": 0
                },
                {
                    "sent": "Because we have a very, very tiny use case of people who want to see errors, often teachers, they want to see what common errors look like, and it's hard to get it all in one place.",
                    "label": 0
                },
                {
                    "sent": "And also it's very interesting to see the kinds of sources that have these errors.",
                    "label": 0
                },
                {
                    "sent": "Like people who write about politics are often terrible spellers.",
                    "label": 0
                },
                {
                    "sent": "And and it's very rare to see these kinds of misspellings in mainstream media.",
                    "label": 0
                },
                {
                    "sent": "So this is what we have is kind of sources and also you can see that you're not the only person.",
                    "label": 0
                },
                {
                    "sent": "Who are look this up?",
                    "label": 0
                },
                {
                    "sent": "Where the stats there we go.",
                    "label": 0
                },
                {
                    "sent": "685 times people have looked up separate spelled wrongly.",
                    "label": 0
                },
                {
                    "sent": "So we want to show data for everything, even if it's an error, but we try to make it as clear as possible that it is an error.",
                    "label": 0
                },
                {
                    "sent": "An Wiktionary helps us a lot here.",
                    "label": 0
                },
                {
                    "sent": "In fact, in that they have many, many entries for common misspellings.",
                    "label": 0
                },
                {
                    "sent": "On to drinks or any other questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you guys so much and I'm happy to show more of wordnik caring.",
                    "label": 0
                }
            ]
        }
    }
}