{
    "id": "nowfm6yvplsltby2243hzg6bjnxd2fce",
    "title": "POWERSET - Natural Language and the Semantic Web",
    "info": {
        "author": [
            "Barney Pell, Powerset, Inc."
        ],
        "published": "Nov. 15, 2007",
        "recorded": "November 2007",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Natural Language Processing"
        ]
    },
    "url": "http://videolectures.net/iswc07_pell_nlpsw/",
    "segmentation": [
        [
            "OK, great so I'm talking about natural language and the semantic web and really an overview of Powerset and what we're doing in these areas.",
            "The."
        ],
        [
            "Outline here is talk about natural language, how it can help the semantic web and then to dive into power sets.",
            "Approach and natural language search go through.",
            "I'm going to try to spend a lot of the time here going through actual demos of our system and close with the vision of how this might enable the ecosystem.",
            "An ecosystem might accelerate the semantic web having solved some of these chicken and egg."
        ],
        [
            "Homes.",
            "So I think everyone here is familiar with the chicken and egg problem in the semantic web.",
            "Semantic markup and resources are costly to create and people are only really going to work these at large scale when there are valuable applications that need them.",
            "On the other hand, you know applications are potentially important to write, but they're not really going to be viable without the semantic markup of the content down the required resources.",
            "So despite an incredible great potential and recognizes semantic, web is potentially slow to realize it for these problems."
        ],
        [
            "Natural language has a chance to actually address the chicken and the egg of this problem, so natural language can reduce the semantic development effort in a few ways.",
            "One is has the possibility to create annotations directly from unstructured text.",
            "So instead of requiring people to go and buy hand markup and annotate large sets of resources, potentially natural language can automate or at least semi automated large portion of that.",
            "Also, there's a lot of work as we all know in generating ontologies and also in mapping and linking ontologies so naturally."
        ],
        [
            "Which can potentially help accelerate this process by generating ontologies directly from text and again possibly semiautomated with human support.",
            "On the other side, natural language search is really a great application for semantic web technologies and content and services.",
            "Natural language search engines consume semantic web information and use that to make their system is much better and they also able to expose semantic web services in response to natural language queries.",
            "So you know in the future vision when more of search starts becoming natural language search then that really has a chance to pull along all of the semantic web technologies and efforts and really make these things you know reaching much larger audiences very quickly.",
            "So that's the high level vision.",
            "Now I'll jump in more quickly to what is natural language search and what are we doing at Powerset.",
            "Our goal is to enable people to interact with information and services as naturally and effectively as possible.",
            "Today, a search is driven by keyword search.",
            "The systems don't actually understand what's really inside the content that you're trying to access, so users have to figure out in the traditional information retrieval style.",
            "What are the right keywords that are going to be in the documents that I want it?",
            "There's also a set of advanced features in search ways to say complex expressions that you might want to want to get access to, but most people don't actually know those even expert searchers like.",
            "We find in this crowd probably don't use mostly advanced features that are there.",
            "This is actually pretty ironic because it's not that we don't know how to express our intents richly and deeply, right?",
            "The problem is that we people we have a built in language for expressing our intent.",
            "It's called natural language.",
            "And that's the way we normally communicate to other people.",
            "And it's the way that we think.",
            "And then we have to go and do a search and translate the rich intention in our minds into a couple of keywords that will hopefully work in the search engine.",
            "Result is, I mean, it's often very good, but it's greatly limited.",
            "I make an analogy to search today being like talking to a 2 year old.",
            "It's really happy that you can have this conversation with it, that it can do anything at all, but at the same time you can't wait for it to grow up and get older so you can have a richer conversation.",
            "So that's our goal is to really bring natural language search out and we can make that a main capability within large scale search engines, both on the user side, parsing the queries and on the document side understanding the documents are company combines deep natural language and scalable search technology.",
            "We bring these things together in very close way so interprets the web.",
            "Index is it and then interprets the query searches and then matches.",
            "Our system really creates and uses semantic web information multiple ways that I'll go over."
        ],
        [
            "Just a little bit more background on sort of trends in search historically and really, the goal of search is a matching query, intense with document, intense and historically the changes to the document model what's actually represented in the index out of these documents has driven the largest innovations in search, so proximity was a search from a shift from where a document is, a bag of keywords to where a document is, the vector of keywords, and now you can basically link the concepts in your query together.",
            "More closely in the document by taking that richer notion anchor text similarly added off page text to the documents and open up a whole new level of power in the documents.",
            "Similarly, when you take into account titles and fonts, those kinds of information all really opened up new possibilities for richer and better search.",
            "So what unexploited aspect of the doc."
        ],
        [
            "Minutes next.",
            "Well, you know it's actually the linguistic structure of the document.",
            "The irony here is that most the document is actually made of linguistic structure, and currently it's mostly discarded an ignore it.",
            "This is largely unaddressed.",
            "The document side do historically to computational cost and complexity, and most previous work in the natural language community trying to apply natural language search has really focused on the query only, and their user enters a query and then the system tries to understand the query and translate that into.",
            "A keyword advanced or keyword query throughout the search engines that can go some of the way, but ultimately it's just.",
            "There are things you would like to try to do that are impossible.",
            "It's fundamentally limited, because then your system, while it's translating your queries, it's still faced with an old keyword ease style interface into the documents themselves, so this structure really has immense value, and it's where the documents intent is actually coded."
        ],
        [
            "So Powerset semantic index are indexer cracks.",
            "Linguistic structure of these documents to extract out meaning it applies deep natural language.",
            "The entire corpus to build a rich representation.",
            "This actually becomes a new kind of index and creates a platform for innovation that allows for greatly expanding capabilities.",
            "We think we're really just at the start of this and that together as a community.",
            "We're all going to be discovering the possibilities that."
        ],
        [
            "This enables.",
            "Natural language for consumersearch, especially at the processing of the content on the indexing side, was really not possible at this kind of scale that we're looking even five years ago, several things happened in terms of economics, the cost came down.",
            "Moore's law has just driven to make many orders of magnitude more computing available.",
            "Then when people were earlier trying to do natural language processing.",
            "Even now we're benefiting from 4 core and eight core processors among other things, and the costs are just going down really fast.",
            "In addition, the the technology is natural language technologies have sped up in recent times.",
            "On the other side of the economics revenue came up so quite awhile ago and people were looking at search.",
            "There was almost no money to be made, it was something where you might get some users, but no one.",
            "No one knew how to make money off it.",
            "That's all changed.",
            "Now the advertising revenue from search.",
            "Is massive and you can actually afford with this kind of economics to do a lot of computing on the back end.",
            "It's also the case that the user experience can be transformed even with the current NL capabilities.",
            "You know, natural language has come a long way, but it's not perfect, but the good news about search is that keyword search is not perfect either.",
            "So perfection is not required here, but we now have the existence of robust broad coverage integrated systems.",
            "In addition, there is a challenge to work across multiple languages, and several of these systems, including the one that powers it, is using.",
            "Are based on a multilingual core platform and you can then plug in essentially plug in new languages to make the system work.",
            "You know there's an issue here about changing user behavior 'cause users used to entering in keywords.",
            "I think in this research community we all look towards the future in any case and this is the kind of change that should be a change to something easier because you don't need to.",
            "It's we're used to keyword search now, but it still is something artificial.",
            "There's a gap between what we really think of in our head and what we have to do.",
            "So kind of like when you're shifting from going from driving a car with a manual transmission into an automatic transmission.",
            "You have to change the behavior, but it's a change to something that's easier, at least for some of us.",
            "These kind of things are actually already happening.",
            "We're now having more voice interfaces in mobile context.",
            "We want to use language and get more precise results, and already, as you see with Korea, zone neighbor and Yahoo.",
            "Answers, an increasing trend towards giving users shortcuts and instant answers directly on on web search, there's more and more opportunities to be using language to get a better result in search.",
            "And even just using keywords, these kinds of systems by having more information coming out of the documents that can actually give better results without any new change of user behavioral."
        ],
        [
            "So the language technology has really evolved a lot.",
            "There are now large scale grammars that can be practically applied.",
            "There's also an increasing amount of lexical and ontological knowledge resources.",
            "Things like word net, verbnet, frame, net, sumo things that many people here work on.",
            "In addition, there's been a lot of improvement in data driven acquisition methods to acquire new ontological natural resources and to bridge different kinds of ontologies.",
            "So the work of this community is really directly feeding into these, you know, enabling these kinds of applications already discussed Moores law.",
            "Another big trend is open source software.",
            "These are big barriers for most smaller efforts, including startups and research organizations to create things at large scale, but the open source community is actually now working to essentially commoditize a lot of the stack for operating large scale distributed systems.",
            "Things for managing clusters, the kind of techniques that Google has pioneered and published like Map Reduce and Big Table are now being heavily developed in the open source community.",
            "A kind of small interesting anecdote for me was that I was we were approached by people at NHN who make neighbor.",
            "They are large Korean search engine and it turned out that we were already.",
            "We're approached because we were already collaborating.",
            "Powerset has made a version of.",
            "Big table our own open source version that we've given out in our sharing the open source community for enabling very large scale distributed storage and manipulation of tables and those folks at neighbor and HN were already working with us, so without even anything at the business level, our engineers and developers already working together.",
            "And by the way, there also applying this in conjunction with the University to deal with RDF storage on top of big table at the top of our H base at very large scales.",
            "Another major trend is commodity computing.",
            "You no longer have to have all your own computers.",
            "There are now increasing sets of players providing services where you can essentially pay for the computing resources as you go.",
            "Amazon has been a pioneer here with their elastic computing cloud and their simple storage system and tuple stores, so you can basically get large scale access to computing resources without it being."
        ],
        [
            "Call yourself.",
            "OK, now now into some examples of Powerset and how it's actually working.",
            "So Powerset reads each sentence one at a time.",
            "So for example, Sir Edward Heath died from pneumonia.",
            "Powerset parses the sentence on the page.",
            "So in this case there's a verb to die.",
            "Sir Edward Heath is a noun, an pneumonia is a noun.",
            "Extracts then entities and semantic relationships.",
            "Sir Edward Heath is not just a noun.",
            "It's a name and pneumonia.",
            "OK, the relationships here are Sir Edward Heath is the subject of the dying, and pneumonia is the from or the cause of the dying.",
            "And then using some level of inference powers, identifies and expands these things to similar entities, relationships and abstractions.",
            "So Sir Edward Heath is both of you is also a UK Prime Minister.",
            "Ann is a politician.",
            "Pneumonia is also a disease and to die from something is also to be killed by it.",
            "So for each sentence, these kind of information extracted and then multiple facts are indexed so that our our index actually already then derives and benefits from the results of these kinds of inferences."
        ],
        [
            "Thereafter, multiple queries can retrieve the same facts.",
            "So what killed Sir Edward Heath matches the sentence about Edward Heath died from pneumonia.",
            "And so does which Prime Minister died from pneumonia.",
            "And from what did Sir Edward Heath die, and so on.",
            "Ultimately, something like which politician died from pneumonia.",
            "Or politicians who died from disease.",
            "These are all capable of matching the same.",
            "The sentence is and at that point there need be no connection between the actual words in the sentence and the words in the query.",
            "But at a conceptual level the relationships are alright.",
            "OK, I'm going to go in and show a few more like really live screenshots in a moment.",
            "But in addition to extracting information from the tax and doing a text search, powerset also integrates diverse resources so you can see."
        ],
        [
            "See that here.",
            "Right in the middle of this page, the query is.",
            "What did Steve Jobs say about the iPod and mill?",
            "This page or a bunch of search results highlighting things like Steve Jobs states that everyone listens to music and the iPod is for everybody.",
            "And Steve Jobs has argued that the iPod Nano is unnecessary risk and so on.",
            "So those are web search results lips.",
            "Those are web search results, but in addition the powerset can go out and access other resources and pulling together to create a composed view.",
            "So from a resource like Freebase and I'll talk a little about Freebase.",
            "Shortly Powerset gets a bio and information.",
            "A photo of Steve Jobs, and then from a video search engine light blinks.",
            "Powerset is able to formulate queries out and then pull back the information from the video search and this unlike normal keyword search which which only pulls back information for the keywords you entered when you actually have a natural language system, you can pull back information for the answers or other significant concepts that are derived from the query that you've entered.",
            "As related to from the text and other sources."
        ],
        [
            "OK, and in addition you can do real time queries to databases.",
            "So in this example who won an Academy Award in 2001?",
            "You know one of the answers is Halle Berry and this this is converted into a database query thrown at a database.",
            "In this case that Freebase and then this system comes back with this kind of result and also creates a presentation page drawing and other information from the structured database."
        ],
        [
            "OK.",
            "I think I'll actually jump in to jump into some of the demos right now.",
            "OK can you all?",
            "I'm hoping you can all see that this this resolution.",
            "OK, in the back there.",
            "So so.",
            "Alright, well I'll try and talk through it.",
            "So here's the query.",
            "Politicians who were killed by disease.",
            "And.",
            "You know one of the results that comes up here is Dan Xiaoping, died on February 19th, 1997 at age 92 from a lung infection, and Parkinson's is in disease, but his influence continued another result lower down.",
            "Is Edward Heath, Sir Edward Heath died from pneumonia at 1930, on the evening of 17 July 2005, at the age of 89, so those were two results and a note that this Edward Heath one is one of the examples I was using before.",
            "There's no word in common with the query and the text that's returned.",
            "So now let's go and look a little deeper at how this is actually happening.",
            "OK, here's a view of the parsing process for that sentence, Denzel Ping died on February 19th, 1997, age 92, from a lung infection and Parkinson's disease, but his influence continued.",
            "So here we see that there is a dying event.",
            "It's of dying as a verb.",
            "Den Shopping is a noun.",
            "It's the subject of dying the when of the dying is February 19th, 1997.",
            "The dying happened at an age of 92 and the dying was from an infection.",
            "And the lung is related to the infection.",
            "It doesn't actually know what did the infection because that wasn't stated in the text.",
            "But that's the kind of depth that our system is going to hear.",
            "And then we see that the, separately the influence of him is continuing.",
            "Now over here.",
            "Is representation the facts that are extracted?",
            "All the way down here.",
            "All the way down to the individual word facts that the system knows for diseases, an influence and so on.",
            "Similarly, here is the analysis of Sir Edward Heath, died from pneumonia at 1930 on the evening of 17 July 2005, at the age of 89.",
            "So we see that there is a dying event and the winner or out of the event is 89.",
            "The subject is Heath.",
            "Here's when when when that happened, the from is pneumonia and it happened in the evening of July.",
            "Now, um.",
            "If we look down here lower down where we see these, the word facts of the system is using in the index, we see that pneumonia.",
            "Is known to be a respiratory disease characterized by inflammation of the lung.",
            "It's also a disease affecting the respiratory system in a more general level of abstraction, it's a disease.",
            "It's an illness.",
            "It's a form of ill health or health problem and and so on.",
            "It's also it's a pathological state now.",
            "Where is that coming from?",
            "That is partly coming from from Wordnet.",
            "So here's wordnet.",
            "If we look up pneumonia.",
            "And we're looking up the the.",
            "I think we're looking here at the inherited hypernyms of an ammonia.",
            "We see that pneumonia is a respiratory disease is a disease.",
            "It's an illness, so this is showing how we're taking an open community resource ontology, namely Wordnet and the system is actually using that in its interpretation of text, both the users query and the passages to enrich its knowledge and then using that to do a whole new level of matching.",
            "Now, what about the jungle ping?",
            "We asked for a politician and we got back down shopping.",
            "Well, that's actually coming from another resource.",
            "In this case that's coming from coming from Freebase.",
            "Freebase is a website put out by a company called Meta Web.",
            "And it is very related to other open structured data projects like DB pedia that people in this community may be more familiar with users.",
            "So users are able to come into this resource and basically add the fields for all different types of entities and objects an express relationships.",
            "So it's again, it's like like the motivations behind Wikipedia, but in this case we're editing structured semantic content.",
            "So in this case you see Denzel Ping is a person whose disease person he has professional politician.",
            "People have filled in his cause of death and his spouse, along with a description here and you can just go and edit these things and you know on a community basis these kind of resources grow.",
            "Freebase is also, as its name implies, is free.",
            "So anyone is able to go and use it and Powerset takes advantage of this in two ways.",
            "One is we download all the data in a similar way to other resources like Word, net, an.",
            "We use that offline in creating our index.",
            "In addition we're able to throw queries to this in real time via their API and I'll show you an example of that in a moment.",
            "But that's how the pieces are put together from multiple semantic resources and composed together in a natural language search system.",
            "And from this it's pretty clear that the more that the system is able to derive broad value, even with very limited knowledge, but the more knowledge that it has, the better it can be in the deeper can go.",
            "So when you look at these kind of Community resources, the more every time somebody goes and edit something in Word, net, or every time somebody creates some new information in Freebase that's automatically able to help make the power sets kind of natural language search better and better.",
            "Give another example because this is fun who said something about WMD's?",
            "WMD is abbreviation for weapons of mass destruction.",
            "Now think for a moment about how you would express that kind of a query in keyword search.",
            "Any ideas?",
            "Right, it's it's really hard.",
            "You know you want the concept of someone saying something and that can happen in all kinds of ways, and you also want it to be about.",
            "WMD's, the number it's I. I can't even think about how you would express this in keyword search or any form of advanced keyword search.",
            "You really need that to basically be hitting a very rich semantic index.",
            "Essentially this is a kind of complex query over an RDF type of structure, so the results because Powerset has done that, the results are things like this.",
            "It's the these anonymous officials said that in their judgment, the CIA's work on WMD's has been set back 10 years.",
            "OK, so that is actually capturing the notion where you know WMD itself is the object of a saying.",
            "Did Rove say that she worked at the agency on WMD once again?",
            "Now here we have the attack was to occur to us to occur in July 2006 and involved a 21 year old Lebanese man identified only as Yousef Mohammed.",
            "Prosecutors said Yousef and another man left suitcases stuffed with crude propane gas bombs on the trains so that is a saying event and we're now getting crude.",
            "Propane gas bombs is matching.",
            "There's no mention all in the text about WMD's.",
            "And the results go on.",
            "We have pepper spray.",
            "We have a China stealing.",
            "The report also says that China still design information about the neutron bomb and so on.",
            "And once again, how is that happening?",
            "Well, I won't go through how all the processing for someone saying something about something happens, but it's pretty clear it's a result of a syntactic semantic analysis, but.",
            "I have to say I was actually surprised when this query worked because I had no idea that our system knew anything at all about WMD's.",
            "And it turns out that word net has a fairly rich amount of information about weapons of mass destruction.",
            "Here we see bioweapons, chemical weapons.",
            "You know there's the poison gas, and so on.",
            "So it's really interesting that you take these kind of Community resources, compose them with a rich, general purpose natural language system, and wind up being able to do incredibly rich and powerful queries that would just not be possible otherwise.",
            "Now let's look a little bit at.",
            "At power sets, summer power sets semantic database that's automatically created our test bed right now is Wikipedia.",
            "Wikipedia is about 2 million articles.",
            "It's a great open community resource growing all the time, and covers many of the broad topics that people care about.",
            "It's a good match as well in a people in this community semantic web community have clearly locked onto that, and I think there's probably like maybe 10 papers at this conference on using Wikipedia in various ways.",
            "So this shows a kind of browser view into our database.",
            "This is the subject relation.",
            "An object triples.",
            "Those are actually only a small set of the relations that are in our actually that are in our semantic representation, and this is just a browser that lets people navigate just those three so you can fill in any 1, two or three of those and essentially get back all of the results of our database, or at least a potentially limited subset.",
            "If we're restricting the computation here.",
            "So here I've asked the query about.",
            "I want Hulk Hogan as a subject and I want to know basically everything that he does and you know to whom he does it.",
            "Do you guys know who Hulk Hogan is?",
            "OK, so Hulk Hogan Hulk Hogan's one of the most famous wrestlers in the World Wrestling Federation.",
            "So because we've only asked for whole Cogan, now we're getting all of the all of the relationships that he put that he participates in where he's the subject and so those are connections in this interface and then all the things that are the objects in any of those relationships.",
            "The tag cloud view here means that in larger font and in bold.",
            "Are the kinds of things that he tends to do more often in the text, so we have more examples of that.",
            "So we see that whole Cogan abandons things.",
            "He announces, things he, you know he, what he does the most of his defeats, things OK. And then we see the kinds of things that he does things to two championships to Andre, the giant, Bobby Heenan, King Kong Bundy.",
            "So if we now go and expand on defeat.",
            "Now we have a list organized of everything that Hulk Hogans defeats as stated in Wikipedia.",
            "And.",
            "With all of the supporting text.",
            "So here we see Hulk Hogan defeated Bobby Heenan.",
            "And in one sentence that supports it as Hulk Hogan defeated Hercules Hernandez with Bobby Heenan to retain the worldwide Federation championship.",
            "So there's four different facts and you can look at them and see that they in fact are the right kind of relationship and you know the in green we're seeing the actual entities.",
            "Bobby Heenan, Randy Savage, Ric Flair, Roddy Piper.",
            "And again, we can actually look at oops.",
            "Oh, guess that actually worked OK.",
            "So here's just an organized list of basically just the answers.",
            "So everybody that whole commented presented as actually a table directly come with semantic database.",
            "So the interesting thing to note here is that this is all done fully automatically, directly from the raw text.",
            "There is no knowledge in our system about Hulk Hogan nor about what it means to defeat, nor about any of these other people.",
            "As wrestlers.",
            "This system is working on really the unstructured text.",
            "Ann is largely driven by the syntactic analysis.",
            "You know how language actually works.",
            "And these are the kind of facts that come out adding in these other research.",
            "This is actually mostly raw.",
            "Adding in the other resources from word, NET or from other ontological resources only amplifies these kinds of things.",
            "OK, as another example, the exact same system we can now ask what did the FDA approve?",
            "The FDA is the Federal Drug Agency in America, and so here we basically have a list generated automatically of all of the things that the FDA has approved in Wikipedia again, bolded or highlighted based on what things are most common.",
            "So you see many drugs, many of the names of drugs, many instance where something is a drug that's being improved.",
            "You see medications and treatments.",
            "All the way down there and again this is.",
            "Well, let's let's, let's look the question.",
            "Is someone noted in the audience that that marijuana seems to have been approved by the FDA, or at least mentioned in approval context.",
            "Let's go take a look.",
            "OK, this says the Food and Drug Administration or comparable public authorities in Western Europe, including the Netherlands, however, has not approved smoking marijuana for any condition or disease.",
            "OK, so it is about marijuana being approved and in this interface that's what we're showing.",
            "Our system does actually tag the context, so it is actually tagged in a gated context in our database.",
            "Yeah, so so you can see that this is not only a this is fun for a lot of reasons.",
            "It's an interesting thing.",
            "Navigated database like this in its own right.",
            "This is the kind of rich deep information is actually in the system, and it also can serve as a basis for creating and extracting out facts in.",
            "There can views in managing new kinds of ontologies as well.",
            "That leads to another example.",
            "We can ask the system what is it that where a Dinosaur is the subject and the relation is inclusion.",
            "So dinosaurs, including some things and give us back all of those different kinds of objects with a query like that, the system is able to automatically generate a list of basically all of the kinds of dinosaurs.",
            "There are certainly some errors in this, but it's quite a large list, including Allosaurus.",
            "Answering this Antarctic Antarctic Sorace and, and so on.",
            "OK, if we then go and say look to see what is it, how does the system know the Dinosaur includes jingfeng optics?",
            "There are three articles in Wikipedia and one is on the origin of birds.",
            "One is on feathered dinosaurs and one is on dinosaurs.",
            "And here you see the feathered dinosaurs discovered so far include and then there's a list of all these kinds of dinosaurs.",
            "Subsequent dinosaurs found with this pennaceous feathers included in these things, so this is just the normal linguistic construct.",
            "No special work is done here.",
            "An actually captures those kinds of relationships, so you can pretty much put in anything, including something else and generate the whole set of things that are described as that.",
            "There are certainly other kinds of patterns, and this can be contrasted with work in text mining, which would make a very specific kind of structural regular expression and look for those kinds of things in the text.",
            "And try to learn around the context.",
            "This is actually the result of having just processed in linguistically every single sentence and captured out all the relations.",
            "So you get a lot of these things just for free, and they can also serve as a basis for then a whole different level of mining on top, where now you're not having just this arbitrary hard to understand textual patterns.",
            "But now you have linguistic patterns that you can mine.",
            "OK, but it's not only useful in this case for mining or or discovering sort of is type of relationships.",
            "Here we've asked what is it that dinosaurs are the subject and the relation is have.",
            "So what is the dinosaurs have?",
            "And the results come back that dinosaurs have feathers and fingers and fenestrae and plates, adaptations, gizzards and so on.",
            "So we've actually got out of this quite a lot of interesting ontological information just directly from the text from having read and processed it.",
            "And if we were to look at this dinosaurs having a gizzard.",
            "We see the dinosaurs respective gizzards, because gizzard stones found near their fossils include, so this is actually would give you if you look at this little deeper would actually give you the list of the dinosaurs that actually have gizzards.",
            "OK, one last years I'll show this is, um, we've shown where you can put in the subject.",
            "You can put in the object.",
            "In this case, we're putting in the subject and the object, and we're basically asking get back all the relationships between them in the text.",
            "So here we've asked what it connects, what is it, where children of the subject?",
            "An book is?",
            "The is the object.",
            "And so we see that children.",
            "Access Books, author books await books, buy books, peruse books, read books and write books, and we can see that actually reading and writing and authoring are the most common type of relationships.",
            "If we look at.",
            "So in in many cases here we have actually some confusion in the system.",
            "We've got books here targeted at children, and sometimes these ones are hard to figure out who the actual who, the actual doer of these things was.",
            "But here we see children.",
            "Reading a book, a child is shown reading a Spillane book in an April 2000 AD.",
            "Children read the book at their own pace.",
            "First child read selected book or passage aloud.",
            "So children who may read this book for dedicating it to a grown up.",
            "So that's just one more view of how our semantic database is constructed and can be accessed.",
            "Now.",
            "OK, here's an example of in a very different way, using live calls to a semantic API.",
            "In this case, we're calling Freebase following the result of a natural language query interpretation.",
            "So here we've said what did Tom Cruise Star in?",
            "And what comes back is all the movies that Tom Cruise starred in with the cover art for those movies.",
            "Now, this is actually the result of translating the query into a database call into Freebase database in real time.",
            "And having got back a list of movies, it's then a subsequent call to go and take all those movies and call the API to get back the cover art and other kinds of things like that.",
            "So here we see in Freebase.",
            "The article about Tom Cruise.",
            "And down here we have all of his film performances.",
            "OK, another example who said you can be my wing man, that's actually a quote for the movie Top Gun and it was actually by the character played by Val Kilmer in that movie.",
            "So this is an example of parsing it, parsing the query, going out, and finding the quote in a list of quotes in the movies, finding the character, then going back and basically composing many different unstructured and semantic services to create that kind of answer.",
            "OK, that's some.",
            "That's it for the demos."
        ],
        [
            "Now to just go a little bit more into some of the background in the technology language knowledge that we're using are the result of originally result of commercializing the work done at Xerox Parc Now Park who have been working on natural images standing for 30 years.",
            "At the heart of it is a multi lingual platform that expresses how language works at a syntactic level and the mechanisms language that are expressed in a way independent of any specific language.",
            "So rather than kind of theory, is like when you learn English or you learn Chinese.",
            "You're not learning how language works, you're learning how language is an instance, how Chinese is an instance of a language works.",
            "Park has actually been working with the international linguistics community for 15 years.",
            "On testing the theory that there could be.",
            "A Universal language platform that people could write the grammars and knowledge for the different languages.",
            "The diverse languages the world on top of.",
            "And twice a year these folks would come together and take tackle on different kinds of projects and ways of expressing things.",
            "And at this point there are actually grammars in English, French, Japanese, German, Chinese, Norwegian and many other languages.",
            "Very diverse kind of languages, and this appears to be working pretty well.",
            "There's many aspects of algorithms and syntactic theories in representing the system, and then the ability to draw on Community knowledge resources.",
            "As we've shown, and this technology can be applied to many different kinds of applications, and the one we've been emphasizing here, it's consumersearch."
        ],
        [
            "This is a little look at the kind of functional structure of the language that's extracted.",
            "The text is.",
            "We parse the web and this is showing your functional structure where you see the medications and the subjects and the objects even down to you know that it's an active, not passive type of clause."
        ],
        [
            "This is the basic search architecture for natural language search, so we begin with the open content, parse it using the lexical functional grammar and the xle, which is the Park core technology.",
            "Combine that with the knowledge resources that are either manually or.",
            "Acquired through common machine learning to create a semantic map, that content is all indexed.",
            "The semantics looks like I was showing you in that on the on the actual screen display, so the contents and index in a very large scale semantic index.",
            "Our semantic index draws on both the large scale indexing techniques used in information retrieval and the large scale search engines, but it's actually also combines the semantic type of information representations.",
            "So stored in one of the same index, our words as vectors and of where they occur and semantic concepts in thematic roles and in the different relationships.",
            "And we put a lot of work into being able to essentially formulate these complex queries at large scale and return results in real time.",
            "So then when the user asks a query that query is parsed and create converted semantic map using the same processing as done for the text to ultimately get the semantics of the query, which is then translated into a query execution plan thrown at the large scale index and retrieved, and then we employ a set of ranking techniques.",
            "Ranking is certainly one of the major areas in search and our ranking takes advantage of the kinds of ranking that are used in search engines today.",
            "And also takes advantage of all these new features and information that's coming out of the semantics.",
            "Finally, the system then presents the results of the top ranked objects or clusters them.",
            "As you've seen, with some of that other demos I was showing, and because you have a whole new level of semantics Ann, you have aligned elements of the query with elements of the corresponding semantic graphs.",
            "There's a whole new opportunities for presentation."
        ],
        [
            "So also required at this large data large scale is really a lot of scalability.",
            "Coordinating computing on thousands of machines, a lot of work on system integration, different kinds of data resources, a lot of knowledge, resources being pulled together.",
            "And many acquisition strategies for those knowledge resources.",
            "Finally, a fair amount of work and user experience to set users expectations right?",
            "Because these systems are going to be useful but not perfect.",
            "May require some change behavior to get the most."
        ],
        [
            "Are you out of the system?",
            "OK, now I'm really reaching the end here and I want to point to where I think that this all can lead.",
            "We started the talk by talking about the chicken and egg problem in the semantic web, and now I think with these kinds of natural language search engines, once it becomes commonplace and you have large scale, commercially successful natural language search engines that do not require to be to be commercially deployed, the semantic resources in the 1st place, then you can really let the wisdom of crowds accelerate the development and deployment semantic web.",
            "So some examples here of how wisdom of crowds works.",
            "So one way from the crowd work today on search engines is through anchor text.",
            "So every every person who writes a web page and links to another page puts in some text, and that text is actually then used by the search engine's to know that that's something more about that page.",
            "This is how a lot of the problem of navigation queries was solved in search.",
            "The IBM homepage may not even say international business machines anymore.",
            "But because other people wrote International Inc. International business machines pointing to IBM, then the search engine knows that that content is actually essentially on or about that page.",
            "So in a similar way, now, publishers who put a lot of work into optimizing their pages to be linked and indexed by search engine so they can get traffic will be able to upload ontologies to get more traffic.",
            "So you can imagine being a publisher of say, a sports website, and you already know all the different players and teams and owners and the roles and what they all do.",
            "Well if you upload that to this kind of a natural language search engine, then whenever a user is typing in more specific words and vocabulary concepts.",
            "Did you know you could describe a player by the center field or something like that?",
            "Even though the word may not have appeared on your pages, those in those queries can actually come matching your site, giving a deeper experience for the user and more traffic for the publisher.",
            "So we've seen a lot of work by publishers doing whatever they can to get themselves more traffic.",
            "So when you have these kind of natural language search systems driving traffic publishers will be very interested in doing whatever they can.",
            "Other interesting twist here is that the systems could give publishers feedback on improving their content, so you could say instead of having to optimize your pages for packing in a bunch of keywords to game the search engine that the publishers could be told.",
            "Actually this is this concept on your page is not clearly expressed.",
            "You might build express it more clearly and then do a better job of matching users.",
            "Another asked the ecosystem, of course, is users.",
            "There's a fair amount of work on getting users to play games and to create and improve resources.",
            "Several papers here in this conference or on that topic.",
            "In addition, these things as they become useful tools for the users, the users can provide feedback to get a better search.",
            "Powerset is already experimenting with ideas where users can give results, thumbs up or thumbs down, and then if it's a thumbs down, dive in and actually express which of the ontological resources may or may or may not have been the right ones or or other kinds of things like that.",
            "In addition, as some users might want to create ontologies lightweight little simple ontologies.",
            "To make their own search experience better.",
            "They could potentially refer to their family members by their roles and then use that kind of the word for the role to match any other family members.",
            "These kinds of things similarly, a group of people could do the same kind of thing.",
            "A third element of this community would be developers.",
            "There's been a lot of work lately in vertical search, which is people making very specialized search engines.",
            "By putting a lot of their own knowledge into the system, I think it's possible that you can move this kind of level of abstraction up so that the vertical search specialists can really just package their knowledge by means of a vertically oriented ontology and make that ontology available or use it in the context of these general search engines.",
            "So I guess there's a fourth part of the community that I didn't talk about.",
            "Which are advertisers, so advertisers could create and upload ontologies to express all the kinds of things that should match their offering.",
            "That can help make a much better job of matching.",
            "So the interesting thing about all of these is that once you start with a broad platform, when that actually gets deployed at larger scale then there are self interests in all different aspects of this ecosystem that now becomes worth them adding more knowledge the system because it will make their lives better.",
            "And so I think once we get these kind of systems out there then it's possible that the semantic web can take off faster than anyone realizes that we can go from broadly applicable systems too.",
            "Deeply specialized, vertically oriented experts, you know, in a pretty fast order."
        ],
        [
            "So to conclude, on power sets, very active is and is planning to be very active with the research communities we're looking to develop an open platform where people could use our API's and also let people access technology to build mashup and the kinds of applications were also contributing datasets, annotations, an open source software back.",
            "We are excited and interested in partnerships, collaborations and you can now go to try out Power Labs, which is our early user community.",
            "If you go to www.powerset.com, you can sign up and we're now letting in people pretty quickly into the service.",
            "So with."
        ],
        [
            "I'd like to thank you all for your attention.",
            "OK too, I think to summarize the question I did have trouble hearing you, so if I miss it then you can clarify.",
            "There's some kind of echo going on here in the room.",
            "Summarize the question.",
            "The results look very exciting and the kind of things people have been talking about doing for very long time.",
            "It looks like Powerset is using technology that seems to have been around for a long time, namely the LFG technology from Xerox Parc.",
            "So why is it suddenly now that this stuff is actually possible?",
            "Is that capture the question correctly?",
            "OK, so the the first thing is that it's not that the work is just was done 20 years ago and has been sitting around and so now something's changed to sort of suddenly make it make it workable.",
            "In fact the park groups was founded in 1972 and the interesting story here is that every five years the group would go and address the more key problems and then come back to their management and say, well, we've really made some major accomplishments.",
            "But the technology is not ready to be applied yet, and this actually continued for 30 years, so you know, people might remember back in the 80s there was a period where towards the end of the 80s there was a semantic winter, right?",
            "People just stopped working on semantics, largely in the community.",
            "And there was a lot in computational linguistics, so it makes a lot of excitement about, you know empirical methods and machine learning of natural language resources, but it was all syntactic and I'll just on the grammars.",
            "And there was no end and semantic systems.",
            "It was kind of almost a decade where they were hardly doing anything there, but actually the folks at Park and their colleagues in the community didn't stop working on these.",
            "They actually kept going, so it was one of the only places that kept working on the entire gate stack of natural language.",
            "They just kept tackling one problem after another, so they made some major improvements with respect to ambiguity management.",
            "Which was really.",
            "It took a long time to work it through the problem of ambiguity is, you know, plagues, natural language systems, and normally what happens is people make their best systems, have a long pipeline, and they make the best guess at each step along the way.",
            "Well, if you make a wrong guess early on, then you're guaranteed your interpretation is going wrong, and if you make each guest kind of independently, you know if you're 90% accurate, each step of the way, you're basically guaranteed to be wrong by the time you're done.",
            "So one of the park's real accomplishments was finding a way to pack all the ambiguity together and avoid resolving it until you have more information later in the pipeline.",
            "That took a very long time to actually work, not just through the sort of shallow levels of syntax, but all the way through the semantic processing and pipelines that was really big accomplishment.",
            "Another big accomplishment was only done kind of in the last seven years, which was integrating statistics into the whole system.",
            "So before that there was no knowledge to prefer one parcel interpretation of the others.",
            "And then there was a fair amount of work done integrating this cool methods with the with sort of the pure linguistic methods.",
            "So that's one side of things.",
            "The other set was really around Moore's law.",
            "OK, that the computing resources didn't just did not exist.",
            "So when when Powerset came to start working with Park, they were very excited because they had this sort of 700 sentences that they would process OK, and those things could take a long time, and now it's a map.",
            "Really do before, so I like to say that in terms of computing resources five years ago, if you're thinking about parsing the whole web and we're not pressing the whole web yet, we're starting with millions of documents, getting our algorithms down and then scaling.",
            "But five years from five years ago, no amount of computing on the whole planet could do this, and five years from now, it's going to look relatively cheap, and right now is this interesting time where things are converging.",
            "So I guess the short answer is that.",
            "The technology actually kind of got to a point where the team themselves thought it can be commercially viable, which was not the case for 30 years.",
            "The availability of community resources like word, net availability, web scale data.",
            "So you could do statistics on it and larger amount of computing resources have all kind of converged to make these things possible.",
            "To extend that we're doing now, that would not have been possible earlier.",
            "And I think the question was are there advantages to asking structured queries as opposed to natural language queries?",
            "So yes, if you could just let people access structured queries, they of course it's actually much better from the systems perspective 'cause it doesn't have to risk getting wrong interpretation of the users query, so we actually have a system.",
            "Maybe I'll even show it here.",
            "OK, so here's here's our much deeper system that we have for our own development which generates this query execution language like that.",
            "And then goes down and takes the graphical structures and ultimately has scoring and everything like that in it.",
            "When we play with this.",
            "We're able to do really great things by working directly in that kind of query language and so so yes, you could do really great things.",
            "The challenge there is will users actually will end consumers actually do it.",
            "That's the open question, but certainly you can do really great things by doing structured queries in the system.",
            "OK, so let's see the first question was about evaluation and do we have statistics on how well our system performs at various of the other task?",
            "So the basic answer is yes, we do.",
            "Internally we measure accuracy at the semantic role level.",
            "Accuracy of sort of named entity extraction or recognition.",
            "So at each step of the pipeline we do measure our accuracy and then the higher level we measure overall search relevance.",
            "So given a query, take all the results to come back and we have human people actually go and evaluate the result quality so we can compute metrics and compare ourselves to other kinds of search techniques and so on.",
            "At the overall system level, there are interesting things which is which.",
            "Are that the improvement in a given component may or may not actually make an improvement at the overall level of perceived relevance by users.",
            "And other than that I mean there are so many components and these things are work in progress.",
            "I don't have a specific thing to say about the exact specific accuracy.",
            "The second question was about our business model.",
            "Our business model is really two parts.",
            "One is direct to consumer.",
            "So like other search engines have a search engine that users can come and use and make money off of advertising so users can.",
            "You know users can use it.",
            "Advertisers can say the kind of users they'd like to reach, an basically connect them, then we're also interested in licensing our technology to other people who have large sets of content to make their own search better.",
            "Or to the large search engines to help them, you know, make some of the queries better with natural language.",
            "As you saw this with these kinds of examples with the.",
            "You know, with with Power Mouse being able to go and group up these kinds of entities well then you can go and say, OK, well we already if we know that dinosaurs that and Allosaurus is a Dinosaur and we know it Allosaurus have and we know that you know what thing will property dinosaurs have and what properties you know reptiles have, then you could really make some very interesting much cleaner ontologies could use by their systems.",
            "Really we haven't done working that yet and we're very excited too and certainly will be interested to collaborate with people and we will be.",
            "Planning to put out an API so that other people can go and take these things and you know, dump out the raw data and then go and use it more.",
            "OK, so the question is with respect to our interaction with Freebase.",
            "How exactly a little bit more detail about how that works?",
            "Because clearly Freemason has its own terminology, and then there's Wordnet and how do those things actually go together and work and then how will that apply as you sort of adding more different things?",
            "I think the first thing is that as we all know, these kind of problems are hard, so you know a lot.",
            "I don't, I don't know that Powerset has better answers on that then a lot of people here in the community, and in fact we looked to this work to help make these kind of ontology mapping integration better.",
            "One specific interesting challenge that came out in Freebase.",
            "Well, I think I can show it.",
            "Show it here where to go?",
            "So, so the interesting thing in this example is this is the Den job paying entry in Freebase and his types.",
            "The type of entity that he is.",
            "He sees a person and also a deceased person separately.",
            "His profession is politician.",
            "Now, if you want to connect this to the rest of word, net for the ontology to know that politicians are kind of sort of a national role or something like this, do other kinds of things with it.",
            "Then you can't just do the mapping at the level of the type you have to then do level at other fields.",
            "Similarly there will be entries where the gender of someone.",
            "You know this gender of someone.",
            "We can double click and add it here.",
            "You know, and we can say, yeah, he's male.",
            "OK, by the way I just updated Freebase in real time, so the gender is male, but if you want to connect to what men did something well that whole concept of men is, you know is and is a hierarchy and here you know Mail is an attribute of this of this thing.",
            "So what we've done is basically make a kind of cross mapping set across mapping knowledge that Maps from the either from the types or from the attributes of different roles.",
            "Into the corresponding word net category and some of that is manual.",
            "Manually done knowledge and some of that is semi automatically because you can take some guesses based on this thing and other kinds of clues.",
            "So we've done that kind of work and some of that's quite interesting and more generally as you start doing more and more kinds of integration of resources, I think these are really interesting, challenging problems that will be figuring out how to do them better.",
            "Sure, first of all, hi Marco, it's good to see you, yeah.",
            "So the question is about we're doing fact extraction and it looks like we might be extracting triples.",
            "How far beyond triples can we go?",
            "And actually we're really extracting far more than triples right now in some of these things that I was showing you here.",
            "Let's see if it's a good one.",
            "Yeah, so you've actually got.",
            "You've got the subjects and you've got the relations.",
            "You've got objects, you've got the win of something, you've got the where you actually will have reasons for it.",
            "You will actually have about if something is about an embedded embedded context.",
            "We also extract out polarity some other kinds of sentiment features, and in general we have this huge set of information that's extracted out into our semantics and.",
            "One of the interesting questions is how much of that makes it actually into our index for efficient retrieval at large scales.",
            "But there's already an awful lot of information in these systems more than just a small triple.",
            "OK, so the question is how do we deal with knowledge?",
            "On the one hand and trust on the other hand?",
            "So the context and trust.",
            "So for context, there's multiple ways that context plays in.",
            "One simple way is with things like word sense disambiguation.",
            "Uh, if you have some ambiguity in a word sense it, one word could be multiple concepts.",
            "Which ones?",
            "The right concept that we want to be able to use, or how we're going to prioritize them.",
            "We are employing worse in simulation algorithm that can take advantage of the love of context around these kinds of things.",
            "Similarly, we have to do anaphora resolution.",
            "So if it says he knowing that it's actually doing jumping, how do you do that?",
            "There could be multiple choices.",
            "Again, there are contextual approaches that work on there.",
            "And there's also a specialized notion of context here, which is certain facts may only be true within certain contexts, so only in one ambiguous reading, there's a certain fact true, whereas some of those things are true in all contexts, or something.",
            "Maybe in the context of a believed thing or a stated thing or negated context.",
            "So there's many uses of context, and we take we take advantage of them here on the theme of trust in the current model, we're not addressing trust yet, so all those facts that I showed you are extracted.",
            "You know IT systems equally trusting of everything, but it actually is able to use some statistics when sorting and organized.",
            "The results to say, well, you know how often is this kind of a factor repeated.",
            "Now there are some really nice work on using trust and confidence from the level of documents an being combined.",
            "I just recently read a paper about Nago which is using this kind of trust, trust, metrics and things like that so.",
            "There's a lot to be done there.",
            "An would be more using it, but it's not an active part of our work right now.",
            "Yeah, so the question was about about place and it didn't.",
            "I didn't show any examples of using using place, so actually with when we look at entities we do actually map them into their places.",
            "OK, we are not at the moment mapping them into the geographical containment.",
            "You know type of hierarchies, but it's absolutely the kind of thing.",
            "So we do know where something happened, but we actually do have some resources.",
            "We have an integrated, yet we're basically.",
            "Dealing with a lot of these kind of geographic hierarchies, and so we want to be able to support queries like saying.",
            "You know who arrived in?",
            "You know who gave a talk in Korea, and you know that would match me.",
            "Giving a talk in Seoul OK?",
            "Because soul is in Korea on this kind of thing.",
            "So that's absolutely square in the kinds of things that we look at doing.",
            "You know, it's sort of on the road map.",
            "So I can't exactly hear you, but I think you're saying that there's a lot of other resources that are available and we want to do mapping as well.",
            "Because of the echo and having trouble hearing the word, it sounds like you're saying as you add more things you get into.",
            "More the mapping problem.",
            "OK, in terms of mapping the different concepts across to each other, I'm sure we're going to hit it and we have because we haven't done the places yet.",
            "We're not there yet, so maybe you can help us as we get there.",
            "OK, so the question is about the role of how much inference Powerset is making use of.",
            "I think that's your question, how much inferences Powerset making use of in the current system.",
            "OK, so if Powerset does inference and how hard is it?",
            "So there's many forms of inference.",
            "And part of our design constraint has been to do something that can be very scalable at very large scale with with real time.",
            "So the inference we also do, we try to stay as close to the language knowledge of languages we can an actually try to avoid putting in too much knowledge of the world into inference.",
            "In general you can get very as you start doing that.",
            "Then you become very domain specific, very fast and we're trying to build something where the work that we do is broadly applicable as possible, least initially so.",
            "Tom, the kinds of inference the system does do are things like local textual entailments.",
            "So if John sells a book to Mary.",
            "Then Mary has bought a book from John.",
            "OK, that's an example of basically an inferential equivalence of relationships and those kind of things are in our system all the time, so you can ask the query like you know who bought a book and it'll match.",
            "John Murray sold.",
            "Sortable to John, or something like that, so that's an example.",
            "There's also a whole set of things that are very interesting work about this kind of local textual entailment by the folks at Park.",
            "Another other examples are deverbal constructions like the destruction of Rome by the Barbarians is actually known as equivalent to the Barbarians, destroyed Rome, even those expressed in very different ways, and another set of examples are things like if if I managed to, if I managed to go from San Francisco to Seoul, then I did go from San Francisco to Seoul and I wound up.",
            "You know, in Solon, I started my trip in San Francisco.",
            "So these are all kinds of entailments that are afforded from the knowledge of how the language works, so that's where the center of our action has been, and the other kinds of inference that we do are really the sort of local taxonomic inference going from word concepts to their hypernyms, and so on that there hasn't been much in the way of other work there aside from some of the translations into the database system that I was showing you as we would access the API's around around Freebase, so there's.",
            "A whole lot of interesting inference that can be done that we haven't really plugged in yet.",
            "There's another system I can refer you to.",
            "Tom called true knowledge and that is a startup company that my friend found it and it's just come out of stealth.",
            "Is based in Cambridge and you can do queries into true knowledge like saying.",
            "You know, is Britney Spears married and it can reason about the fact that there is an entry where Britney Spears did get married and there's no entry later on tonight to conclude that yeah, you know she is still married.",
            "Or you can ask a question like who is the president of the United States when Hawaii became a state and it can actually do that kind of inference?",
            "So those are all kinds of paths that we can see Powerset using more of.",
            "But right now we're still in much more local forms of inference closer to the textual knowledge.",
            "OK, great, so the questions about different languages and you know what's the strategies for going to different languages.",
            "What are the kind of constraints and what kinds of resources do we need to use for different languages?",
            "So yeah, I was saying earlier.",
            "OK, at the heart this is a language independent system and then you plug in tableware or link where on top of different modules so one of the modules is the syntax actually from the syntax and then lexical resources like a word net in the different languages.",
            "Then all the rest of the machinery basically crunches along.",
            "There's actually been a lot of work in applying these things in different languages and.",
            "German and Japanese are probably the two other languages that are most advanced.",
            "And in fact, there's been work.",
            "Interesting work in Japanese where they were able to take the Japanese Japanese version of Word, NET and Japanese grammar developed on top of this technology and then run through and actually do all the kinds of matching an inference that we were already doing, supported by the core machinery.",
            "So in terms of getting out to a new language, it's probably a relatively small team.",
            "Could be sort of three or four people working for about a year to come from.",
            "0 to a grammar built, you know, uh, grammar built for new language and then the other issues is basically making sure you have lexical resources.",
            "That and that's a sliding scale because the more resources you have, the better results can be.",
            "But you can get a lot of value out even if you don't know what the words are.",
            "In particular, like I was showing here, you also need morphology component and we already have morphology for pretty much all the world's languages for our system.",
            "I guess are the main things that you need to do, but it's absolutely it's very doable for different languages, so you do need some specific work, but the barriers are actually pretty small.",
            "K thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, great so I'm talking about natural language and the semantic web and really an overview of Powerset and what we're doing in these areas.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Outline here is talk about natural language, how it can help the semantic web and then to dive into power sets.",
                    "label": 1
                },
                {
                    "sent": "Approach and natural language search go through.",
                    "label": 1
                },
                {
                    "sent": "I'm going to try to spend a lot of the time here going through actual demos of our system and close with the vision of how this might enable the ecosystem.",
                    "label": 0
                },
                {
                    "sent": "An ecosystem might accelerate the semantic web having solved some of these chicken and egg.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Homes.",
                    "label": 0
                },
                {
                    "sent": "So I think everyone here is familiar with the chicken and egg problem in the semantic web.",
                    "label": 1
                },
                {
                    "sent": "Semantic markup and resources are costly to create and people are only really going to work these at large scale when there are valuable applications that need them.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, you know applications are potentially important to write, but they're not really going to be viable without the semantic markup of the content down the required resources.",
                    "label": 1
                },
                {
                    "sent": "So despite an incredible great potential and recognizes semantic, web is potentially slow to realize it for these problems.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Natural language has a chance to actually address the chicken and the egg of this problem, so natural language can reduce the semantic development effort in a few ways.",
                    "label": 1
                },
                {
                    "sent": "One is has the possibility to create annotations directly from unstructured text.",
                    "label": 0
                },
                {
                    "sent": "So instead of requiring people to go and buy hand markup and annotate large sets of resources, potentially natural language can automate or at least semi automated large portion of that.",
                    "label": 0
                },
                {
                    "sent": "Also, there's a lot of work as we all know in generating ontologies and also in mapping and linking ontologies so naturally.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which can potentially help accelerate this process by generating ontologies directly from text and again possibly semiautomated with human support.",
                    "label": 0
                },
                {
                    "sent": "On the other side, natural language search is really a great application for semantic web technologies and content and services.",
                    "label": 0
                },
                {
                    "sent": "Natural language search engines consume semantic web information and use that to make their system is much better and they also able to expose semantic web services in response to natural language queries.",
                    "label": 0
                },
                {
                    "sent": "So you know in the future vision when more of search starts becoming natural language search then that really has a chance to pull along all of the semantic web technologies and efforts and really make these things you know reaching much larger audiences very quickly.",
                    "label": 0
                },
                {
                    "sent": "So that's the high level vision.",
                    "label": 0
                },
                {
                    "sent": "Now I'll jump in more quickly to what is natural language search and what are we doing at Powerset.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to enable people to interact with information and services as naturally and effectively as possible.",
                    "label": 1
                },
                {
                    "sent": "Today, a search is driven by keyword search.",
                    "label": 0
                },
                {
                    "sent": "The systems don't actually understand what's really inside the content that you're trying to access, so users have to figure out in the traditional information retrieval style.",
                    "label": 0
                },
                {
                    "sent": "What are the right keywords that are going to be in the documents that I want it?",
                    "label": 0
                },
                {
                    "sent": "There's also a set of advanced features in search ways to say complex expressions that you might want to want to get access to, but most people don't actually know those even expert searchers like.",
                    "label": 0
                },
                {
                    "sent": "We find in this crowd probably don't use mostly advanced features that are there.",
                    "label": 0
                },
                {
                    "sent": "This is actually pretty ironic because it's not that we don't know how to express our intents richly and deeply, right?",
                    "label": 0
                },
                {
                    "sent": "The problem is that we people we have a built in language for expressing our intent.",
                    "label": 0
                },
                {
                    "sent": "It's called natural language.",
                    "label": 0
                },
                {
                    "sent": "And that's the way we normally communicate to other people.",
                    "label": 0
                },
                {
                    "sent": "And it's the way that we think.",
                    "label": 0
                },
                {
                    "sent": "And then we have to go and do a search and translate the rich intention in our minds into a couple of keywords that will hopefully work in the search engine.",
                    "label": 0
                },
                {
                    "sent": "Result is, I mean, it's often very good, but it's greatly limited.",
                    "label": 0
                },
                {
                    "sent": "I make an analogy to search today being like talking to a 2 year old.",
                    "label": 0
                },
                {
                    "sent": "It's really happy that you can have this conversation with it, that it can do anything at all, but at the same time you can't wait for it to grow up and get older so you can have a richer conversation.",
                    "label": 0
                },
                {
                    "sent": "So that's our goal is to really bring natural language search out and we can make that a main capability within large scale search engines, both on the user side, parsing the queries and on the document side understanding the documents are company combines deep natural language and scalable search technology.",
                    "label": 0
                },
                {
                    "sent": "We bring these things together in very close way so interprets the web.",
                    "label": 0
                },
                {
                    "sent": "Index is it and then interprets the query searches and then matches.",
                    "label": 1
                },
                {
                    "sent": "Our system really creates and uses semantic web information multiple ways that I'll go over.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just a little bit more background on sort of trends in search historically and really, the goal of search is a matching query, intense with document, intense and historically the changes to the document model what's actually represented in the index out of these documents has driven the largest innovations in search, so proximity was a search from a shift from where a document is, a bag of keywords to where a document is, the vector of keywords, and now you can basically link the concepts in your query together.",
                    "label": 1
                },
                {
                    "sent": "More closely in the document by taking that richer notion anchor text similarly added off page text to the documents and open up a whole new level of power in the documents.",
                    "label": 0
                },
                {
                    "sent": "Similarly, when you take into account titles and fonts, those kinds of information all really opened up new possibilities for richer and better search.",
                    "label": 0
                },
                {
                    "sent": "So what unexploited aspect of the doc.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Minutes next.",
                    "label": 0
                },
                {
                    "sent": "Well, you know it's actually the linguistic structure of the document.",
                    "label": 1
                },
                {
                    "sent": "The irony here is that most the document is actually made of linguistic structure, and currently it's mostly discarded an ignore it.",
                    "label": 0
                },
                {
                    "sent": "This is largely unaddressed.",
                    "label": 0
                },
                {
                    "sent": "The document side do historically to computational cost and complexity, and most previous work in the natural language community trying to apply natural language search has really focused on the query only, and their user enters a query and then the system tries to understand the query and translate that into.",
                    "label": 1
                },
                {
                    "sent": "A keyword advanced or keyword query throughout the search engines that can go some of the way, but ultimately it's just.",
                    "label": 0
                },
                {
                    "sent": "There are things you would like to try to do that are impossible.",
                    "label": 1
                },
                {
                    "sent": "It's fundamentally limited, because then your system, while it's translating your queries, it's still faced with an old keyword ease style interface into the documents themselves, so this structure really has immense value, and it's where the documents intent is actually coded.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Powerset semantic index are indexer cracks.",
                    "label": 0
                },
                {
                    "sent": "Linguistic structure of these documents to extract out meaning it applies deep natural language.",
                    "label": 0
                },
                {
                    "sent": "The entire corpus to build a rich representation.",
                    "label": 1
                },
                {
                    "sent": "This actually becomes a new kind of index and creates a platform for innovation that allows for greatly expanding capabilities.",
                    "label": 1
                },
                {
                    "sent": "We think we're really just at the start of this and that together as a community.",
                    "label": 0
                },
                {
                    "sent": "We're all going to be discovering the possibilities that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This enables.",
                    "label": 0
                },
                {
                    "sent": "Natural language for consumersearch, especially at the processing of the content on the indexing side, was really not possible at this kind of scale that we're looking even five years ago, several things happened in terms of economics, the cost came down.",
                    "label": 0
                },
                {
                    "sent": "Moore's law has just driven to make many orders of magnitude more computing available.",
                    "label": 0
                },
                {
                    "sent": "Then when people were earlier trying to do natural language processing.",
                    "label": 0
                },
                {
                    "sent": "Even now we're benefiting from 4 core and eight core processors among other things, and the costs are just going down really fast.",
                    "label": 0
                },
                {
                    "sent": "In addition, the the technology is natural language technologies have sped up in recent times.",
                    "label": 0
                },
                {
                    "sent": "On the other side of the economics revenue came up so quite awhile ago and people were looking at search.",
                    "label": 0
                },
                {
                    "sent": "There was almost no money to be made, it was something where you might get some users, but no one.",
                    "label": 0
                },
                {
                    "sent": "No one knew how to make money off it.",
                    "label": 0
                },
                {
                    "sent": "That's all changed.",
                    "label": 0
                },
                {
                    "sent": "Now the advertising revenue from search.",
                    "label": 0
                },
                {
                    "sent": "Is massive and you can actually afford with this kind of economics to do a lot of computing on the back end.",
                    "label": 0
                },
                {
                    "sent": "It's also the case that the user experience can be transformed even with the current NL capabilities.",
                    "label": 1
                },
                {
                    "sent": "You know, natural language has come a long way, but it's not perfect, but the good news about search is that keyword search is not perfect either.",
                    "label": 0
                },
                {
                    "sent": "So perfection is not required here, but we now have the existence of robust broad coverage integrated systems.",
                    "label": 0
                },
                {
                    "sent": "In addition, there is a challenge to work across multiple languages, and several of these systems, including the one that powers it, is using.",
                    "label": 0
                },
                {
                    "sent": "Are based on a multilingual core platform and you can then plug in essentially plug in new languages to make the system work.",
                    "label": 0
                },
                {
                    "sent": "You know there's an issue here about changing user behavior 'cause users used to entering in keywords.",
                    "label": 0
                },
                {
                    "sent": "I think in this research community we all look towards the future in any case and this is the kind of change that should be a change to something easier because you don't need to.",
                    "label": 0
                },
                {
                    "sent": "It's we're used to keyword search now, but it still is something artificial.",
                    "label": 0
                },
                {
                    "sent": "There's a gap between what we really think of in our head and what we have to do.",
                    "label": 0
                },
                {
                    "sent": "So kind of like when you're shifting from going from driving a car with a manual transmission into an automatic transmission.",
                    "label": 0
                },
                {
                    "sent": "You have to change the behavior, but it's a change to something that's easier, at least for some of us.",
                    "label": 0
                },
                {
                    "sent": "These kind of things are actually already happening.",
                    "label": 0
                },
                {
                    "sent": "We're now having more voice interfaces in mobile context.",
                    "label": 0
                },
                {
                    "sent": "We want to use language and get more precise results, and already, as you see with Korea, zone neighbor and Yahoo.",
                    "label": 0
                },
                {
                    "sent": "Answers, an increasing trend towards giving users shortcuts and instant answers directly on on web search, there's more and more opportunities to be using language to get a better result in search.",
                    "label": 0
                },
                {
                    "sent": "And even just using keywords, these kinds of systems by having more information coming out of the documents that can actually give better results without any new change of user behavioral.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the language technology has really evolved a lot.",
                    "label": 1
                },
                {
                    "sent": "There are now large scale grammars that can be practically applied.",
                    "label": 1
                },
                {
                    "sent": "There's also an increasing amount of lexical and ontological knowledge resources.",
                    "label": 1
                },
                {
                    "sent": "Things like word net, verbnet, frame, net, sumo things that many people here work on.",
                    "label": 0
                },
                {
                    "sent": "In addition, there's been a lot of improvement in data driven acquisition methods to acquire new ontological natural resources and to bridge different kinds of ontologies.",
                    "label": 0
                },
                {
                    "sent": "So the work of this community is really directly feeding into these, you know, enabling these kinds of applications already discussed Moores law.",
                    "label": 1
                },
                {
                    "sent": "Another big trend is open source software.",
                    "label": 0
                },
                {
                    "sent": "These are big barriers for most smaller efforts, including startups and research organizations to create things at large scale, but the open source community is actually now working to essentially commoditize a lot of the stack for operating large scale distributed systems.",
                    "label": 0
                },
                {
                    "sent": "Things for managing clusters, the kind of techniques that Google has pioneered and published like Map Reduce and Big Table are now being heavily developed in the open source community.",
                    "label": 0
                },
                {
                    "sent": "A kind of small interesting anecdote for me was that I was we were approached by people at NHN who make neighbor.",
                    "label": 0
                },
                {
                    "sent": "They are large Korean search engine and it turned out that we were already.",
                    "label": 0
                },
                {
                    "sent": "We're approached because we were already collaborating.",
                    "label": 0
                },
                {
                    "sent": "Powerset has made a version of.",
                    "label": 1
                },
                {
                    "sent": "Big table our own open source version that we've given out in our sharing the open source community for enabling very large scale distributed storage and manipulation of tables and those folks at neighbor and HN were already working with us, so without even anything at the business level, our engineers and developers already working together.",
                    "label": 0
                },
                {
                    "sent": "And by the way, there also applying this in conjunction with the University to deal with RDF storage on top of big table at the top of our H base at very large scales.",
                    "label": 0
                },
                {
                    "sent": "Another major trend is commodity computing.",
                    "label": 0
                },
                {
                    "sent": "You no longer have to have all your own computers.",
                    "label": 0
                },
                {
                    "sent": "There are now increasing sets of players providing services where you can essentially pay for the computing resources as you go.",
                    "label": 0
                },
                {
                    "sent": "Amazon has been a pioneer here with their elastic computing cloud and their simple storage system and tuple stores, so you can basically get large scale access to computing resources without it being.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Call yourself.",
                    "label": 0
                },
                {
                    "sent": "OK, now now into some examples of Powerset and how it's actually working.",
                    "label": 0
                },
                {
                    "sent": "So Powerset reads each sentence one at a time.",
                    "label": 0
                },
                {
                    "sent": "So for example, Sir Edward Heath died from pneumonia.",
                    "label": 1
                },
                {
                    "sent": "Powerset parses the sentence on the page.",
                    "label": 0
                },
                {
                    "sent": "So in this case there's a verb to die.",
                    "label": 0
                },
                {
                    "sent": "Sir Edward Heath is a noun, an pneumonia is a noun.",
                    "label": 0
                },
                {
                    "sent": "Extracts then entities and semantic relationships.",
                    "label": 0
                },
                {
                    "sent": "Sir Edward Heath is not just a noun.",
                    "label": 0
                },
                {
                    "sent": "It's a name and pneumonia.",
                    "label": 0
                },
                {
                    "sent": "OK, the relationships here are Sir Edward Heath is the subject of the dying, and pneumonia is the from or the cause of the dying.",
                    "label": 1
                },
                {
                    "sent": "And then using some level of inference powers, identifies and expands these things to similar entities, relationships and abstractions.",
                    "label": 0
                },
                {
                    "sent": "So Sir Edward Heath is both of you is also a UK Prime Minister.",
                    "label": 0
                },
                {
                    "sent": "Ann is a politician.",
                    "label": 0
                },
                {
                    "sent": "Pneumonia is also a disease and to die from something is also to be killed by it.",
                    "label": 0
                },
                {
                    "sent": "So for each sentence, these kind of information extracted and then multiple facts are indexed so that our our index actually already then derives and benefits from the results of these kinds of inferences.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thereafter, multiple queries can retrieve the same facts.",
                    "label": 1
                },
                {
                    "sent": "So what killed Sir Edward Heath matches the sentence about Edward Heath died from pneumonia.",
                    "label": 0
                },
                {
                    "sent": "And so does which Prime Minister died from pneumonia.",
                    "label": 0
                },
                {
                    "sent": "And from what did Sir Edward Heath die, and so on.",
                    "label": 0
                },
                {
                    "sent": "Ultimately, something like which politician died from pneumonia.",
                    "label": 0
                },
                {
                    "sent": "Or politicians who died from disease.",
                    "label": 0
                },
                {
                    "sent": "These are all capable of matching the same.",
                    "label": 0
                },
                {
                    "sent": "The sentence is and at that point there need be no connection between the actual words in the sentence and the words in the query.",
                    "label": 0
                },
                {
                    "sent": "But at a conceptual level the relationships are alright.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm going to go in and show a few more like really live screenshots in a moment.",
                    "label": 0
                },
                {
                    "sent": "But in addition to extracting information from the tax and doing a text search, powerset also integrates diverse resources so you can see.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "See that here.",
                    "label": 0
                },
                {
                    "sent": "Right in the middle of this page, the query is.",
                    "label": 1
                },
                {
                    "sent": "What did Steve Jobs say about the iPod and mill?",
                    "label": 0
                },
                {
                    "sent": "This page or a bunch of search results highlighting things like Steve Jobs states that everyone listens to music and the iPod is for everybody.",
                    "label": 0
                },
                {
                    "sent": "And Steve Jobs has argued that the iPod Nano is unnecessary risk and so on.",
                    "label": 0
                },
                {
                    "sent": "So those are web search results lips.",
                    "label": 1
                },
                {
                    "sent": "Those are web search results, but in addition the powerset can go out and access other resources and pulling together to create a composed view.",
                    "label": 0
                },
                {
                    "sent": "So from a resource like Freebase and I'll talk a little about Freebase.",
                    "label": 0
                },
                {
                    "sent": "Shortly Powerset gets a bio and information.",
                    "label": 0
                },
                {
                    "sent": "A photo of Steve Jobs, and then from a video search engine light blinks.",
                    "label": 0
                },
                {
                    "sent": "Powerset is able to formulate queries out and then pull back the information from the video search and this unlike normal keyword search which which only pulls back information for the keywords you entered when you actually have a natural language system, you can pull back information for the answers or other significant concepts that are derived from the query that you've entered.",
                    "label": 0
                },
                {
                    "sent": "As related to from the text and other sources.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and in addition you can do real time queries to databases.",
                    "label": 0
                },
                {
                    "sent": "So in this example who won an Academy Award in 2001?",
                    "label": 0
                },
                {
                    "sent": "You know one of the answers is Halle Berry and this this is converted into a database query thrown at a database.",
                    "label": 1
                },
                {
                    "sent": "In this case that Freebase and then this system comes back with this kind of result and also creates a presentation page drawing and other information from the structured database.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I think I'll actually jump in to jump into some of the demos right now.",
                    "label": 0
                },
                {
                    "sent": "OK can you all?",
                    "label": 0
                },
                {
                    "sent": "I'm hoping you can all see that this this resolution.",
                    "label": 0
                },
                {
                    "sent": "OK, in the back there.",
                    "label": 0
                },
                {
                    "sent": "So so.",
                    "label": 0
                },
                {
                    "sent": "Alright, well I'll try and talk through it.",
                    "label": 0
                },
                {
                    "sent": "So here's the query.",
                    "label": 0
                },
                {
                    "sent": "Politicians who were killed by disease.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You know one of the results that comes up here is Dan Xiaoping, died on February 19th, 1997 at age 92 from a lung infection, and Parkinson's is in disease, but his influence continued another result lower down.",
                    "label": 0
                },
                {
                    "sent": "Is Edward Heath, Sir Edward Heath died from pneumonia at 1930, on the evening of 17 July 2005, at the age of 89, so those were two results and a note that this Edward Heath one is one of the examples I was using before.",
                    "label": 0
                },
                {
                    "sent": "There's no word in common with the query and the text that's returned.",
                    "label": 0
                },
                {
                    "sent": "So now let's go and look a little deeper at how this is actually happening.",
                    "label": 0
                },
                {
                    "sent": "OK, here's a view of the parsing process for that sentence, Denzel Ping died on February 19th, 1997, age 92, from a lung infection and Parkinson's disease, but his influence continued.",
                    "label": 0
                },
                {
                    "sent": "So here we see that there is a dying event.",
                    "label": 0
                },
                {
                    "sent": "It's of dying as a verb.",
                    "label": 0
                },
                {
                    "sent": "Den Shopping is a noun.",
                    "label": 0
                },
                {
                    "sent": "It's the subject of dying the when of the dying is February 19th, 1997.",
                    "label": 0
                },
                {
                    "sent": "The dying happened at an age of 92 and the dying was from an infection.",
                    "label": 0
                },
                {
                    "sent": "And the lung is related to the infection.",
                    "label": 0
                },
                {
                    "sent": "It doesn't actually know what did the infection because that wasn't stated in the text.",
                    "label": 0
                },
                {
                    "sent": "But that's the kind of depth that our system is going to hear.",
                    "label": 0
                },
                {
                    "sent": "And then we see that the, separately the influence of him is continuing.",
                    "label": 0
                },
                {
                    "sent": "Now over here.",
                    "label": 0
                },
                {
                    "sent": "Is representation the facts that are extracted?",
                    "label": 0
                },
                {
                    "sent": "All the way down here.",
                    "label": 0
                },
                {
                    "sent": "All the way down to the individual word facts that the system knows for diseases, an influence and so on.",
                    "label": 0
                },
                {
                    "sent": "Similarly, here is the analysis of Sir Edward Heath, died from pneumonia at 1930 on the evening of 17 July 2005, at the age of 89.",
                    "label": 0
                },
                {
                    "sent": "So we see that there is a dying event and the winner or out of the event is 89.",
                    "label": 0
                },
                {
                    "sent": "The subject is Heath.",
                    "label": 0
                },
                {
                    "sent": "Here's when when when that happened, the from is pneumonia and it happened in the evening of July.",
                    "label": 0
                },
                {
                    "sent": "Now, um.",
                    "label": 0
                },
                {
                    "sent": "If we look down here lower down where we see these, the word facts of the system is using in the index, we see that pneumonia.",
                    "label": 0
                },
                {
                    "sent": "Is known to be a respiratory disease characterized by inflammation of the lung.",
                    "label": 0
                },
                {
                    "sent": "It's also a disease affecting the respiratory system in a more general level of abstraction, it's a disease.",
                    "label": 0
                },
                {
                    "sent": "It's an illness.",
                    "label": 0
                },
                {
                    "sent": "It's a form of ill health or health problem and and so on.",
                    "label": 0
                },
                {
                    "sent": "It's also it's a pathological state now.",
                    "label": 0
                },
                {
                    "sent": "Where is that coming from?",
                    "label": 0
                },
                {
                    "sent": "That is partly coming from from Wordnet.",
                    "label": 0
                },
                {
                    "sent": "So here's wordnet.",
                    "label": 0
                },
                {
                    "sent": "If we look up pneumonia.",
                    "label": 0
                },
                {
                    "sent": "And we're looking up the the.",
                    "label": 0
                },
                {
                    "sent": "I think we're looking here at the inherited hypernyms of an ammonia.",
                    "label": 0
                },
                {
                    "sent": "We see that pneumonia is a respiratory disease is a disease.",
                    "label": 0
                },
                {
                    "sent": "It's an illness, so this is showing how we're taking an open community resource ontology, namely Wordnet and the system is actually using that in its interpretation of text, both the users query and the passages to enrich its knowledge and then using that to do a whole new level of matching.",
                    "label": 0
                },
                {
                    "sent": "Now, what about the jungle ping?",
                    "label": 0
                },
                {
                    "sent": "We asked for a politician and we got back down shopping.",
                    "label": 0
                },
                {
                    "sent": "Well, that's actually coming from another resource.",
                    "label": 0
                },
                {
                    "sent": "In this case that's coming from coming from Freebase.",
                    "label": 0
                },
                {
                    "sent": "Freebase is a website put out by a company called Meta Web.",
                    "label": 0
                },
                {
                    "sent": "And it is very related to other open structured data projects like DB pedia that people in this community may be more familiar with users.",
                    "label": 0
                },
                {
                    "sent": "So users are able to come into this resource and basically add the fields for all different types of entities and objects an express relationships.",
                    "label": 0
                },
                {
                    "sent": "So it's again, it's like like the motivations behind Wikipedia, but in this case we're editing structured semantic content.",
                    "label": 0
                },
                {
                    "sent": "So in this case you see Denzel Ping is a person whose disease person he has professional politician.",
                    "label": 0
                },
                {
                    "sent": "People have filled in his cause of death and his spouse, along with a description here and you can just go and edit these things and you know on a community basis these kind of resources grow.",
                    "label": 0
                },
                {
                    "sent": "Freebase is also, as its name implies, is free.",
                    "label": 0
                },
                {
                    "sent": "So anyone is able to go and use it and Powerset takes advantage of this in two ways.",
                    "label": 0
                },
                {
                    "sent": "One is we download all the data in a similar way to other resources like Word, net, an.",
                    "label": 0
                },
                {
                    "sent": "We use that offline in creating our index.",
                    "label": 0
                },
                {
                    "sent": "In addition we're able to throw queries to this in real time via their API and I'll show you an example of that in a moment.",
                    "label": 0
                },
                {
                    "sent": "But that's how the pieces are put together from multiple semantic resources and composed together in a natural language search system.",
                    "label": 0
                },
                {
                    "sent": "And from this it's pretty clear that the more that the system is able to derive broad value, even with very limited knowledge, but the more knowledge that it has, the better it can be in the deeper can go.",
                    "label": 0
                },
                {
                    "sent": "So when you look at these kind of Community resources, the more every time somebody goes and edit something in Word, net, or every time somebody creates some new information in Freebase that's automatically able to help make the power sets kind of natural language search better and better.",
                    "label": 0
                },
                {
                    "sent": "Give another example because this is fun who said something about WMD's?",
                    "label": 0
                },
                {
                    "sent": "WMD is abbreviation for weapons of mass destruction.",
                    "label": 0
                },
                {
                    "sent": "Now think for a moment about how you would express that kind of a query in keyword search.",
                    "label": 0
                },
                {
                    "sent": "Any ideas?",
                    "label": 0
                },
                {
                    "sent": "Right, it's it's really hard.",
                    "label": 0
                },
                {
                    "sent": "You know you want the concept of someone saying something and that can happen in all kinds of ways, and you also want it to be about.",
                    "label": 0
                },
                {
                    "sent": "WMD's, the number it's I. I can't even think about how you would express this in keyword search or any form of advanced keyword search.",
                    "label": 0
                },
                {
                    "sent": "You really need that to basically be hitting a very rich semantic index.",
                    "label": 0
                },
                {
                    "sent": "Essentially this is a kind of complex query over an RDF type of structure, so the results because Powerset has done that, the results are things like this.",
                    "label": 0
                },
                {
                    "sent": "It's the these anonymous officials said that in their judgment, the CIA's work on WMD's has been set back 10 years.",
                    "label": 0
                },
                {
                    "sent": "OK, so that is actually capturing the notion where you know WMD itself is the object of a saying.",
                    "label": 0
                },
                {
                    "sent": "Did Rove say that she worked at the agency on WMD once again?",
                    "label": 0
                },
                {
                    "sent": "Now here we have the attack was to occur to us to occur in July 2006 and involved a 21 year old Lebanese man identified only as Yousef Mohammed.",
                    "label": 0
                },
                {
                    "sent": "Prosecutors said Yousef and another man left suitcases stuffed with crude propane gas bombs on the trains so that is a saying event and we're now getting crude.",
                    "label": 0
                },
                {
                    "sent": "Propane gas bombs is matching.",
                    "label": 0
                },
                {
                    "sent": "There's no mention all in the text about WMD's.",
                    "label": 0
                },
                {
                    "sent": "And the results go on.",
                    "label": 0
                },
                {
                    "sent": "We have pepper spray.",
                    "label": 0
                },
                {
                    "sent": "We have a China stealing.",
                    "label": 0
                },
                {
                    "sent": "The report also says that China still design information about the neutron bomb and so on.",
                    "label": 0
                },
                {
                    "sent": "And once again, how is that happening?",
                    "label": 0
                },
                {
                    "sent": "Well, I won't go through how all the processing for someone saying something about something happens, but it's pretty clear it's a result of a syntactic semantic analysis, but.",
                    "label": 0
                },
                {
                    "sent": "I have to say I was actually surprised when this query worked because I had no idea that our system knew anything at all about WMD's.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that word net has a fairly rich amount of information about weapons of mass destruction.",
                    "label": 0
                },
                {
                    "sent": "Here we see bioweapons, chemical weapons.",
                    "label": 0
                },
                {
                    "sent": "You know there's the poison gas, and so on.",
                    "label": 0
                },
                {
                    "sent": "So it's really interesting that you take these kind of Community resources, compose them with a rich, general purpose natural language system, and wind up being able to do incredibly rich and powerful queries that would just not be possible otherwise.",
                    "label": 0
                },
                {
                    "sent": "Now let's look a little bit at.",
                    "label": 0
                },
                {
                    "sent": "At power sets, summer power sets semantic database that's automatically created our test bed right now is Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia is about 2 million articles.",
                    "label": 0
                },
                {
                    "sent": "It's a great open community resource growing all the time, and covers many of the broad topics that people care about.",
                    "label": 0
                },
                {
                    "sent": "It's a good match as well in a people in this community semantic web community have clearly locked onto that, and I think there's probably like maybe 10 papers at this conference on using Wikipedia in various ways.",
                    "label": 0
                },
                {
                    "sent": "So this shows a kind of browser view into our database.",
                    "label": 0
                },
                {
                    "sent": "This is the subject relation.",
                    "label": 0
                },
                {
                    "sent": "An object triples.",
                    "label": 0
                },
                {
                    "sent": "Those are actually only a small set of the relations that are in our actually that are in our semantic representation, and this is just a browser that lets people navigate just those three so you can fill in any 1, two or three of those and essentially get back all of the results of our database, or at least a potentially limited subset.",
                    "label": 0
                },
                {
                    "sent": "If we're restricting the computation here.",
                    "label": 0
                },
                {
                    "sent": "So here I've asked the query about.",
                    "label": 0
                },
                {
                    "sent": "I want Hulk Hogan as a subject and I want to know basically everything that he does and you know to whom he does it.",
                    "label": 0
                },
                {
                    "sent": "Do you guys know who Hulk Hogan is?",
                    "label": 0
                },
                {
                    "sent": "OK, so Hulk Hogan Hulk Hogan's one of the most famous wrestlers in the World Wrestling Federation.",
                    "label": 0
                },
                {
                    "sent": "So because we've only asked for whole Cogan, now we're getting all of the all of the relationships that he put that he participates in where he's the subject and so those are connections in this interface and then all the things that are the objects in any of those relationships.",
                    "label": 0
                },
                {
                    "sent": "The tag cloud view here means that in larger font and in bold.",
                    "label": 0
                },
                {
                    "sent": "Are the kinds of things that he tends to do more often in the text, so we have more examples of that.",
                    "label": 0
                },
                {
                    "sent": "So we see that whole Cogan abandons things.",
                    "label": 0
                },
                {
                    "sent": "He announces, things he, you know he, what he does the most of his defeats, things OK. And then we see the kinds of things that he does things to two championships to Andre, the giant, Bobby Heenan, King Kong Bundy.",
                    "label": 0
                },
                {
                    "sent": "So if we now go and expand on defeat.",
                    "label": 0
                },
                {
                    "sent": "Now we have a list organized of everything that Hulk Hogans defeats as stated in Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "With all of the supporting text.",
                    "label": 0
                },
                {
                    "sent": "So here we see Hulk Hogan defeated Bobby Heenan.",
                    "label": 0
                },
                {
                    "sent": "And in one sentence that supports it as Hulk Hogan defeated Hercules Hernandez with Bobby Heenan to retain the worldwide Federation championship.",
                    "label": 0
                },
                {
                    "sent": "So there's four different facts and you can look at them and see that they in fact are the right kind of relationship and you know the in green we're seeing the actual entities.",
                    "label": 0
                },
                {
                    "sent": "Bobby Heenan, Randy Savage, Ric Flair, Roddy Piper.",
                    "label": 0
                },
                {
                    "sent": "And again, we can actually look at oops.",
                    "label": 0
                },
                {
                    "sent": "Oh, guess that actually worked OK.",
                    "label": 0
                },
                {
                    "sent": "So here's just an organized list of basically just the answers.",
                    "label": 0
                },
                {
                    "sent": "So everybody that whole commented presented as actually a table directly come with semantic database.",
                    "label": 0
                },
                {
                    "sent": "So the interesting thing to note here is that this is all done fully automatically, directly from the raw text.",
                    "label": 0
                },
                {
                    "sent": "There is no knowledge in our system about Hulk Hogan nor about what it means to defeat, nor about any of these other people.",
                    "label": 0
                },
                {
                    "sent": "As wrestlers.",
                    "label": 0
                },
                {
                    "sent": "This system is working on really the unstructured text.",
                    "label": 0
                },
                {
                    "sent": "Ann is largely driven by the syntactic analysis.",
                    "label": 0
                },
                {
                    "sent": "You know how language actually works.",
                    "label": 0
                },
                {
                    "sent": "And these are the kind of facts that come out adding in these other research.",
                    "label": 0
                },
                {
                    "sent": "This is actually mostly raw.",
                    "label": 0
                },
                {
                    "sent": "Adding in the other resources from word, NET or from other ontological resources only amplifies these kinds of things.",
                    "label": 0
                },
                {
                    "sent": "OK, as another example, the exact same system we can now ask what did the FDA approve?",
                    "label": 0
                },
                {
                    "sent": "The FDA is the Federal Drug Agency in America, and so here we basically have a list generated automatically of all of the things that the FDA has approved in Wikipedia again, bolded or highlighted based on what things are most common.",
                    "label": 0
                },
                {
                    "sent": "So you see many drugs, many of the names of drugs, many instance where something is a drug that's being improved.",
                    "label": 0
                },
                {
                    "sent": "You see medications and treatments.",
                    "label": 0
                },
                {
                    "sent": "All the way down there and again this is.",
                    "label": 0
                },
                {
                    "sent": "Well, let's let's, let's look the question.",
                    "label": 0
                },
                {
                    "sent": "Is someone noted in the audience that that marijuana seems to have been approved by the FDA, or at least mentioned in approval context.",
                    "label": 0
                },
                {
                    "sent": "Let's go take a look.",
                    "label": 0
                },
                {
                    "sent": "OK, this says the Food and Drug Administration or comparable public authorities in Western Europe, including the Netherlands, however, has not approved smoking marijuana for any condition or disease.",
                    "label": 0
                },
                {
                    "sent": "OK, so it is about marijuana being approved and in this interface that's what we're showing.",
                    "label": 0
                },
                {
                    "sent": "Our system does actually tag the context, so it is actually tagged in a gated context in our database.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so so you can see that this is not only a this is fun for a lot of reasons.",
                    "label": 0
                },
                {
                    "sent": "It's an interesting thing.",
                    "label": 0
                },
                {
                    "sent": "Navigated database like this in its own right.",
                    "label": 0
                },
                {
                    "sent": "This is the kind of rich deep information is actually in the system, and it also can serve as a basis for creating and extracting out facts in.",
                    "label": 0
                },
                {
                    "sent": "There can views in managing new kinds of ontologies as well.",
                    "label": 0
                },
                {
                    "sent": "That leads to another example.",
                    "label": 0
                },
                {
                    "sent": "We can ask the system what is it that where a Dinosaur is the subject and the relation is inclusion.",
                    "label": 0
                },
                {
                    "sent": "So dinosaurs, including some things and give us back all of those different kinds of objects with a query like that, the system is able to automatically generate a list of basically all of the kinds of dinosaurs.",
                    "label": 0
                },
                {
                    "sent": "There are certainly some errors in this, but it's quite a large list, including Allosaurus.",
                    "label": 0
                },
                {
                    "sent": "Answering this Antarctic Antarctic Sorace and, and so on.",
                    "label": 0
                },
                {
                    "sent": "OK, if we then go and say look to see what is it, how does the system know the Dinosaur includes jingfeng optics?",
                    "label": 0
                },
                {
                    "sent": "There are three articles in Wikipedia and one is on the origin of birds.",
                    "label": 0
                },
                {
                    "sent": "One is on feathered dinosaurs and one is on dinosaurs.",
                    "label": 0
                },
                {
                    "sent": "And here you see the feathered dinosaurs discovered so far include and then there's a list of all these kinds of dinosaurs.",
                    "label": 0
                },
                {
                    "sent": "Subsequent dinosaurs found with this pennaceous feathers included in these things, so this is just the normal linguistic construct.",
                    "label": 0
                },
                {
                    "sent": "No special work is done here.",
                    "label": 0
                },
                {
                    "sent": "An actually captures those kinds of relationships, so you can pretty much put in anything, including something else and generate the whole set of things that are described as that.",
                    "label": 0
                },
                {
                    "sent": "There are certainly other kinds of patterns, and this can be contrasted with work in text mining, which would make a very specific kind of structural regular expression and look for those kinds of things in the text.",
                    "label": 0
                },
                {
                    "sent": "And try to learn around the context.",
                    "label": 0
                },
                {
                    "sent": "This is actually the result of having just processed in linguistically every single sentence and captured out all the relations.",
                    "label": 0
                },
                {
                    "sent": "So you get a lot of these things just for free, and they can also serve as a basis for then a whole different level of mining on top, where now you're not having just this arbitrary hard to understand textual patterns.",
                    "label": 0
                },
                {
                    "sent": "But now you have linguistic patterns that you can mine.",
                    "label": 0
                },
                {
                    "sent": "OK, but it's not only useful in this case for mining or or discovering sort of is type of relationships.",
                    "label": 0
                },
                {
                    "sent": "Here we've asked what is it that dinosaurs are the subject and the relation is have.",
                    "label": 0
                },
                {
                    "sent": "So what is the dinosaurs have?",
                    "label": 0
                },
                {
                    "sent": "And the results come back that dinosaurs have feathers and fingers and fenestrae and plates, adaptations, gizzards and so on.",
                    "label": 0
                },
                {
                    "sent": "So we've actually got out of this quite a lot of interesting ontological information just directly from the text from having read and processed it.",
                    "label": 0
                },
                {
                    "sent": "And if we were to look at this dinosaurs having a gizzard.",
                    "label": 0
                },
                {
                    "sent": "We see the dinosaurs respective gizzards, because gizzard stones found near their fossils include, so this is actually would give you if you look at this little deeper would actually give you the list of the dinosaurs that actually have gizzards.",
                    "label": 0
                },
                {
                    "sent": "OK, one last years I'll show this is, um, we've shown where you can put in the subject.",
                    "label": 0
                },
                {
                    "sent": "You can put in the object.",
                    "label": 0
                },
                {
                    "sent": "In this case, we're putting in the subject and the object, and we're basically asking get back all the relationships between them in the text.",
                    "label": 0
                },
                {
                    "sent": "So here we've asked what it connects, what is it, where children of the subject?",
                    "label": 0
                },
                {
                    "sent": "An book is?",
                    "label": 0
                },
                {
                    "sent": "The is the object.",
                    "label": 0
                },
                {
                    "sent": "And so we see that children.",
                    "label": 0
                },
                {
                    "sent": "Access Books, author books await books, buy books, peruse books, read books and write books, and we can see that actually reading and writing and authoring are the most common type of relationships.",
                    "label": 0
                },
                {
                    "sent": "If we look at.",
                    "label": 0
                },
                {
                    "sent": "So in in many cases here we have actually some confusion in the system.",
                    "label": 0
                },
                {
                    "sent": "We've got books here targeted at children, and sometimes these ones are hard to figure out who the actual who, the actual doer of these things was.",
                    "label": 0
                },
                {
                    "sent": "But here we see children.",
                    "label": 0
                },
                {
                    "sent": "Reading a book, a child is shown reading a Spillane book in an April 2000 AD.",
                    "label": 0
                },
                {
                    "sent": "Children read the book at their own pace.",
                    "label": 0
                },
                {
                    "sent": "First child read selected book or passage aloud.",
                    "label": 0
                },
                {
                    "sent": "So children who may read this book for dedicating it to a grown up.",
                    "label": 0
                },
                {
                    "sent": "So that's just one more view of how our semantic database is constructed and can be accessed.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "OK, here's an example of in a very different way, using live calls to a semantic API.",
                    "label": 0
                },
                {
                    "sent": "In this case, we're calling Freebase following the result of a natural language query interpretation.",
                    "label": 0
                },
                {
                    "sent": "So here we've said what did Tom Cruise Star in?",
                    "label": 0
                },
                {
                    "sent": "And what comes back is all the movies that Tom Cruise starred in with the cover art for those movies.",
                    "label": 0
                },
                {
                    "sent": "Now, this is actually the result of translating the query into a database call into Freebase database in real time.",
                    "label": 0
                },
                {
                    "sent": "And having got back a list of movies, it's then a subsequent call to go and take all those movies and call the API to get back the cover art and other kinds of things like that.",
                    "label": 0
                },
                {
                    "sent": "So here we see in Freebase.",
                    "label": 0
                },
                {
                    "sent": "The article about Tom Cruise.",
                    "label": 0
                },
                {
                    "sent": "And down here we have all of his film performances.",
                    "label": 0
                },
                {
                    "sent": "OK, another example who said you can be my wing man, that's actually a quote for the movie Top Gun and it was actually by the character played by Val Kilmer in that movie.",
                    "label": 0
                },
                {
                    "sent": "So this is an example of parsing it, parsing the query, going out, and finding the quote in a list of quotes in the movies, finding the character, then going back and basically composing many different unstructured and semantic services to create that kind of answer.",
                    "label": 0
                },
                {
                    "sent": "OK, that's some.",
                    "label": 0
                },
                {
                    "sent": "That's it for the demos.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now to just go a little bit more into some of the background in the technology language knowledge that we're using are the result of originally result of commercializing the work done at Xerox Parc Now Park who have been working on natural images standing for 30 years.",
                    "label": 0
                },
                {
                    "sent": "At the heart of it is a multi lingual platform that expresses how language works at a syntactic level and the mechanisms language that are expressed in a way independent of any specific language.",
                    "label": 0
                },
                {
                    "sent": "So rather than kind of theory, is like when you learn English or you learn Chinese.",
                    "label": 0
                },
                {
                    "sent": "You're not learning how language works, you're learning how language is an instance, how Chinese is an instance of a language works.",
                    "label": 0
                },
                {
                    "sent": "Park has actually been working with the international linguistics community for 15 years.",
                    "label": 0
                },
                {
                    "sent": "On testing the theory that there could be.",
                    "label": 0
                },
                {
                    "sent": "A Universal language platform that people could write the grammars and knowledge for the different languages.",
                    "label": 0
                },
                {
                    "sent": "The diverse languages the world on top of.",
                    "label": 0
                },
                {
                    "sent": "And twice a year these folks would come together and take tackle on different kinds of projects and ways of expressing things.",
                    "label": 0
                },
                {
                    "sent": "And at this point there are actually grammars in English, French, Japanese, German, Chinese, Norwegian and many other languages.",
                    "label": 1
                },
                {
                    "sent": "Very diverse kind of languages, and this appears to be working pretty well.",
                    "label": 0
                },
                {
                    "sent": "There's many aspects of algorithms and syntactic theories in representing the system, and then the ability to draw on Community knowledge resources.",
                    "label": 0
                },
                {
                    "sent": "As we've shown, and this technology can be applied to many different kinds of applications, and the one we've been emphasizing here, it's consumersearch.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is a little look at the kind of functional structure of the language that's extracted.",
                    "label": 0
                },
                {
                    "sent": "The text is.",
                    "label": 0
                },
                {
                    "sent": "We parse the web and this is showing your functional structure where you see the medications and the subjects and the objects even down to you know that it's an active, not passive type of clause.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the basic search architecture for natural language search, so we begin with the open content, parse it using the lexical functional grammar and the xle, which is the Park core technology.",
                    "label": 1
                },
                {
                    "sent": "Combine that with the knowledge resources that are either manually or.",
                    "label": 0
                },
                {
                    "sent": "Acquired through common machine learning to create a semantic map, that content is all indexed.",
                    "label": 0
                },
                {
                    "sent": "The semantics looks like I was showing you in that on the on the actual screen display, so the contents and index in a very large scale semantic index.",
                    "label": 0
                },
                {
                    "sent": "Our semantic index draws on both the large scale indexing techniques used in information retrieval and the large scale search engines, but it's actually also combines the semantic type of information representations.",
                    "label": 0
                },
                {
                    "sent": "So stored in one of the same index, our words as vectors and of where they occur and semantic concepts in thematic roles and in the different relationships.",
                    "label": 0
                },
                {
                    "sent": "And we put a lot of work into being able to essentially formulate these complex queries at large scale and return results in real time.",
                    "label": 0
                },
                {
                    "sent": "So then when the user asks a query that query is parsed and create converted semantic map using the same processing as done for the text to ultimately get the semantics of the query, which is then translated into a query execution plan thrown at the large scale index and retrieved, and then we employ a set of ranking techniques.",
                    "label": 0
                },
                {
                    "sent": "Ranking is certainly one of the major areas in search and our ranking takes advantage of the kinds of ranking that are used in search engines today.",
                    "label": 0
                },
                {
                    "sent": "And also takes advantage of all these new features and information that's coming out of the semantics.",
                    "label": 0
                },
                {
                    "sent": "Finally, the system then presents the results of the top ranked objects or clusters them.",
                    "label": 0
                },
                {
                    "sent": "As you've seen, with some of that other demos I was showing, and because you have a whole new level of semantics Ann, you have aligned elements of the query with elements of the corresponding semantic graphs.",
                    "label": 0
                },
                {
                    "sent": "There's a whole new opportunities for presentation.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So also required at this large data large scale is really a lot of scalability.",
                    "label": 0
                },
                {
                    "sent": "Coordinating computing on thousands of machines, a lot of work on system integration, different kinds of data resources, a lot of knowledge, resources being pulled together.",
                    "label": 1
                },
                {
                    "sent": "And many acquisition strategies for those knowledge resources.",
                    "label": 0
                },
                {
                    "sent": "Finally, a fair amount of work and user experience to set users expectations right?",
                    "label": 1
                },
                {
                    "sent": "Because these systems are going to be useful but not perfect.",
                    "label": 0
                },
                {
                    "sent": "May require some change behavior to get the most.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are you out of the system?",
                    "label": 0
                },
                {
                    "sent": "OK, now I'm really reaching the end here and I want to point to where I think that this all can lead.",
                    "label": 0
                },
                {
                    "sent": "We started the talk by talking about the chicken and egg problem in the semantic web, and now I think with these kinds of natural language search engines, once it becomes commonplace and you have large scale, commercially successful natural language search engines that do not require to be to be commercially deployed, the semantic resources in the 1st place, then you can really let the wisdom of crowds accelerate the development and deployment semantic web.",
                    "label": 0
                },
                {
                    "sent": "So some examples here of how wisdom of crowds works.",
                    "label": 1
                },
                {
                    "sent": "So one way from the crowd work today on search engines is through anchor text.",
                    "label": 0
                },
                {
                    "sent": "So every every person who writes a web page and links to another page puts in some text, and that text is actually then used by the search engine's to know that that's something more about that page.",
                    "label": 0
                },
                {
                    "sent": "This is how a lot of the problem of navigation queries was solved in search.",
                    "label": 0
                },
                {
                    "sent": "The IBM homepage may not even say international business machines anymore.",
                    "label": 0
                },
                {
                    "sent": "But because other people wrote International Inc. International business machines pointing to IBM, then the search engine knows that that content is actually essentially on or about that page.",
                    "label": 0
                },
                {
                    "sent": "So in a similar way, now, publishers who put a lot of work into optimizing their pages to be linked and indexed by search engine so they can get traffic will be able to upload ontologies to get more traffic.",
                    "label": 0
                },
                {
                    "sent": "So you can imagine being a publisher of say, a sports website, and you already know all the different players and teams and owners and the roles and what they all do.",
                    "label": 0
                },
                {
                    "sent": "Well if you upload that to this kind of a natural language search engine, then whenever a user is typing in more specific words and vocabulary concepts.",
                    "label": 0
                },
                {
                    "sent": "Did you know you could describe a player by the center field or something like that?",
                    "label": 0
                },
                {
                    "sent": "Even though the word may not have appeared on your pages, those in those queries can actually come matching your site, giving a deeper experience for the user and more traffic for the publisher.",
                    "label": 1
                },
                {
                    "sent": "So we've seen a lot of work by publishers doing whatever they can to get themselves more traffic.",
                    "label": 0
                },
                {
                    "sent": "So when you have these kind of natural language search systems driving traffic publishers will be very interested in doing whatever they can.",
                    "label": 0
                },
                {
                    "sent": "Other interesting twist here is that the systems could give publishers feedback on improving their content, so you could say instead of having to optimize your pages for packing in a bunch of keywords to game the search engine that the publishers could be told.",
                    "label": 0
                },
                {
                    "sent": "Actually this is this concept on your page is not clearly expressed.",
                    "label": 0
                },
                {
                    "sent": "You might build express it more clearly and then do a better job of matching users.",
                    "label": 0
                },
                {
                    "sent": "Another asked the ecosystem, of course, is users.",
                    "label": 0
                },
                {
                    "sent": "There's a fair amount of work on getting users to play games and to create and improve resources.",
                    "label": 1
                },
                {
                    "sent": "Several papers here in this conference or on that topic.",
                    "label": 1
                },
                {
                    "sent": "In addition, these things as they become useful tools for the users, the users can provide feedback to get a better search.",
                    "label": 0
                },
                {
                    "sent": "Powerset is already experimenting with ideas where users can give results, thumbs up or thumbs down, and then if it's a thumbs down, dive in and actually express which of the ontological resources may or may or may not have been the right ones or or other kinds of things like that.",
                    "label": 0
                },
                {
                    "sent": "In addition, as some users might want to create ontologies lightweight little simple ontologies.",
                    "label": 0
                },
                {
                    "sent": "To make their own search experience better.",
                    "label": 0
                },
                {
                    "sent": "They could potentially refer to their family members by their roles and then use that kind of the word for the role to match any other family members.",
                    "label": 0
                },
                {
                    "sent": "These kinds of things similarly, a group of people could do the same kind of thing.",
                    "label": 0
                },
                {
                    "sent": "A third element of this community would be developers.",
                    "label": 0
                },
                {
                    "sent": "There's been a lot of work lately in vertical search, which is people making very specialized search engines.",
                    "label": 0
                },
                {
                    "sent": "By putting a lot of their own knowledge into the system, I think it's possible that you can move this kind of level of abstraction up so that the vertical search specialists can really just package their knowledge by means of a vertically oriented ontology and make that ontology available or use it in the context of these general search engines.",
                    "label": 0
                },
                {
                    "sent": "So I guess there's a fourth part of the community that I didn't talk about.",
                    "label": 0
                },
                {
                    "sent": "Which are advertisers, so advertisers could create and upload ontologies to express all the kinds of things that should match their offering.",
                    "label": 0
                },
                {
                    "sent": "That can help make a much better job of matching.",
                    "label": 0
                },
                {
                    "sent": "So the interesting thing about all of these is that once you start with a broad platform, when that actually gets deployed at larger scale then there are self interests in all different aspects of this ecosystem that now becomes worth them adding more knowledge the system because it will make their lives better.",
                    "label": 0
                },
                {
                    "sent": "And so I think once we get these kind of systems out there then it's possible that the semantic web can take off faster than anyone realizes that we can go from broadly applicable systems too.",
                    "label": 0
                },
                {
                    "sent": "Deeply specialized, vertically oriented experts, you know, in a pretty fast order.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, on power sets, very active is and is planning to be very active with the research communities we're looking to develop an open platform where people could use our API's and also let people access technology to build mashup and the kinds of applications were also contributing datasets, annotations, an open source software back.",
                    "label": 1
                },
                {
                    "sent": "We are excited and interested in partnerships, collaborations and you can now go to try out Power Labs, which is our early user community.",
                    "label": 0
                },
                {
                    "sent": "If you go to www.powerset.com, you can sign up and we're now letting in people pretty quickly into the service.",
                    "label": 0
                },
                {
                    "sent": "So with.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'd like to thank you all for your attention.",
                    "label": 1
                },
                {
                    "sent": "OK too, I think to summarize the question I did have trouble hearing you, so if I miss it then you can clarify.",
                    "label": 0
                },
                {
                    "sent": "There's some kind of echo going on here in the room.",
                    "label": 0
                },
                {
                    "sent": "Summarize the question.",
                    "label": 0
                },
                {
                    "sent": "The results look very exciting and the kind of things people have been talking about doing for very long time.",
                    "label": 0
                },
                {
                    "sent": "It looks like Powerset is using technology that seems to have been around for a long time, namely the LFG technology from Xerox Parc.",
                    "label": 0
                },
                {
                    "sent": "So why is it suddenly now that this stuff is actually possible?",
                    "label": 0
                },
                {
                    "sent": "Is that capture the question correctly?",
                    "label": 0
                },
                {
                    "sent": "OK, so the the first thing is that it's not that the work is just was done 20 years ago and has been sitting around and so now something's changed to sort of suddenly make it make it workable.",
                    "label": 0
                },
                {
                    "sent": "In fact the park groups was founded in 1972 and the interesting story here is that every five years the group would go and address the more key problems and then come back to their management and say, well, we've really made some major accomplishments.",
                    "label": 0
                },
                {
                    "sent": "But the technology is not ready to be applied yet, and this actually continued for 30 years, so you know, people might remember back in the 80s there was a period where towards the end of the 80s there was a semantic winter, right?",
                    "label": 0
                },
                {
                    "sent": "People just stopped working on semantics, largely in the community.",
                    "label": 0
                },
                {
                    "sent": "And there was a lot in computational linguistics, so it makes a lot of excitement about, you know empirical methods and machine learning of natural language resources, but it was all syntactic and I'll just on the grammars.",
                    "label": 0
                },
                {
                    "sent": "And there was no end and semantic systems.",
                    "label": 0
                },
                {
                    "sent": "It was kind of almost a decade where they were hardly doing anything there, but actually the folks at Park and their colleagues in the community didn't stop working on these.",
                    "label": 0
                },
                {
                    "sent": "They actually kept going, so it was one of the only places that kept working on the entire gate stack of natural language.",
                    "label": 0
                },
                {
                    "sent": "They just kept tackling one problem after another, so they made some major improvements with respect to ambiguity management.",
                    "label": 0
                },
                {
                    "sent": "Which was really.",
                    "label": 0
                },
                {
                    "sent": "It took a long time to work it through the problem of ambiguity is, you know, plagues, natural language systems, and normally what happens is people make their best systems, have a long pipeline, and they make the best guess at each step along the way.",
                    "label": 0
                },
                {
                    "sent": "Well, if you make a wrong guess early on, then you're guaranteed your interpretation is going wrong, and if you make each guest kind of independently, you know if you're 90% accurate, each step of the way, you're basically guaranteed to be wrong by the time you're done.",
                    "label": 0
                },
                {
                    "sent": "So one of the park's real accomplishments was finding a way to pack all the ambiguity together and avoid resolving it until you have more information later in the pipeline.",
                    "label": 0
                },
                {
                    "sent": "That took a very long time to actually work, not just through the sort of shallow levels of syntax, but all the way through the semantic processing and pipelines that was really big accomplishment.",
                    "label": 0
                },
                {
                    "sent": "Another big accomplishment was only done kind of in the last seven years, which was integrating statistics into the whole system.",
                    "label": 0
                },
                {
                    "sent": "So before that there was no knowledge to prefer one parcel interpretation of the others.",
                    "label": 0
                },
                {
                    "sent": "And then there was a fair amount of work done integrating this cool methods with the with sort of the pure linguistic methods.",
                    "label": 0
                },
                {
                    "sent": "So that's one side of things.",
                    "label": 0
                },
                {
                    "sent": "The other set was really around Moore's law.",
                    "label": 0
                },
                {
                    "sent": "OK, that the computing resources didn't just did not exist.",
                    "label": 0
                },
                {
                    "sent": "So when when Powerset came to start working with Park, they were very excited because they had this sort of 700 sentences that they would process OK, and those things could take a long time, and now it's a map.",
                    "label": 0
                },
                {
                    "sent": "Really do before, so I like to say that in terms of computing resources five years ago, if you're thinking about parsing the whole web and we're not pressing the whole web yet, we're starting with millions of documents, getting our algorithms down and then scaling.",
                    "label": 0
                },
                {
                    "sent": "But five years from five years ago, no amount of computing on the whole planet could do this, and five years from now, it's going to look relatively cheap, and right now is this interesting time where things are converging.",
                    "label": 0
                },
                {
                    "sent": "So I guess the short answer is that.",
                    "label": 0
                },
                {
                    "sent": "The technology actually kind of got to a point where the team themselves thought it can be commercially viable, which was not the case for 30 years.",
                    "label": 0
                },
                {
                    "sent": "The availability of community resources like word, net availability, web scale data.",
                    "label": 0
                },
                {
                    "sent": "So you could do statistics on it and larger amount of computing resources have all kind of converged to make these things possible.",
                    "label": 0
                },
                {
                    "sent": "To extend that we're doing now, that would not have been possible earlier.",
                    "label": 0
                },
                {
                    "sent": "And I think the question was are there advantages to asking structured queries as opposed to natural language queries?",
                    "label": 0
                },
                {
                    "sent": "So yes, if you could just let people access structured queries, they of course it's actually much better from the systems perspective 'cause it doesn't have to risk getting wrong interpretation of the users query, so we actually have a system.",
                    "label": 0
                },
                {
                    "sent": "Maybe I'll even show it here.",
                    "label": 0
                },
                {
                    "sent": "OK, so here's here's our much deeper system that we have for our own development which generates this query execution language like that.",
                    "label": 0
                },
                {
                    "sent": "And then goes down and takes the graphical structures and ultimately has scoring and everything like that in it.",
                    "label": 0
                },
                {
                    "sent": "When we play with this.",
                    "label": 0
                },
                {
                    "sent": "We're able to do really great things by working directly in that kind of query language and so so yes, you could do really great things.",
                    "label": 0
                },
                {
                    "sent": "The challenge there is will users actually will end consumers actually do it.",
                    "label": 0
                },
                {
                    "sent": "That's the open question, but certainly you can do really great things by doing structured queries in the system.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's see the first question was about evaluation and do we have statistics on how well our system performs at various of the other task?",
                    "label": 0
                },
                {
                    "sent": "So the basic answer is yes, we do.",
                    "label": 0
                },
                {
                    "sent": "Internally we measure accuracy at the semantic role level.",
                    "label": 0
                },
                {
                    "sent": "Accuracy of sort of named entity extraction or recognition.",
                    "label": 0
                },
                {
                    "sent": "So at each step of the pipeline we do measure our accuracy and then the higher level we measure overall search relevance.",
                    "label": 0
                },
                {
                    "sent": "So given a query, take all the results to come back and we have human people actually go and evaluate the result quality so we can compute metrics and compare ourselves to other kinds of search techniques and so on.",
                    "label": 0
                },
                {
                    "sent": "At the overall system level, there are interesting things which is which.",
                    "label": 0
                },
                {
                    "sent": "Are that the improvement in a given component may or may not actually make an improvement at the overall level of perceived relevance by users.",
                    "label": 0
                },
                {
                    "sent": "And other than that I mean there are so many components and these things are work in progress.",
                    "label": 0
                },
                {
                    "sent": "I don't have a specific thing to say about the exact specific accuracy.",
                    "label": 0
                },
                {
                    "sent": "The second question was about our business model.",
                    "label": 0
                },
                {
                    "sent": "Our business model is really two parts.",
                    "label": 0
                },
                {
                    "sent": "One is direct to consumer.",
                    "label": 0
                },
                {
                    "sent": "So like other search engines have a search engine that users can come and use and make money off of advertising so users can.",
                    "label": 0
                },
                {
                    "sent": "You know users can use it.",
                    "label": 0
                },
                {
                    "sent": "Advertisers can say the kind of users they'd like to reach, an basically connect them, then we're also interested in licensing our technology to other people who have large sets of content to make their own search better.",
                    "label": 0
                },
                {
                    "sent": "Or to the large search engines to help them, you know, make some of the queries better with natural language.",
                    "label": 0
                },
                {
                    "sent": "As you saw this with these kinds of examples with the.",
                    "label": 0
                },
                {
                    "sent": "You know, with with Power Mouse being able to go and group up these kinds of entities well then you can go and say, OK, well we already if we know that dinosaurs that and Allosaurus is a Dinosaur and we know it Allosaurus have and we know that you know what thing will property dinosaurs have and what properties you know reptiles have, then you could really make some very interesting much cleaner ontologies could use by their systems.",
                    "label": 0
                },
                {
                    "sent": "Really we haven't done working that yet and we're very excited too and certainly will be interested to collaborate with people and we will be.",
                    "label": 0
                },
                {
                    "sent": "Planning to put out an API so that other people can go and take these things and you know, dump out the raw data and then go and use it more.",
                    "label": 0
                },
                {
                    "sent": "OK, so the question is with respect to our interaction with Freebase.",
                    "label": 0
                },
                {
                    "sent": "How exactly a little bit more detail about how that works?",
                    "label": 0
                },
                {
                    "sent": "Because clearly Freemason has its own terminology, and then there's Wordnet and how do those things actually go together and work and then how will that apply as you sort of adding more different things?",
                    "label": 0
                },
                {
                    "sent": "I think the first thing is that as we all know, these kind of problems are hard, so you know a lot.",
                    "label": 0
                },
                {
                    "sent": "I don't, I don't know that Powerset has better answers on that then a lot of people here in the community, and in fact we looked to this work to help make these kind of ontology mapping integration better.",
                    "label": 0
                },
                {
                    "sent": "One specific interesting challenge that came out in Freebase.",
                    "label": 0
                },
                {
                    "sent": "Well, I think I can show it.",
                    "label": 0
                },
                {
                    "sent": "Show it here where to go?",
                    "label": 0
                },
                {
                    "sent": "So, so the interesting thing in this example is this is the Den job paying entry in Freebase and his types.",
                    "label": 0
                },
                {
                    "sent": "The type of entity that he is.",
                    "label": 0
                },
                {
                    "sent": "He sees a person and also a deceased person separately.",
                    "label": 0
                },
                {
                    "sent": "His profession is politician.",
                    "label": 0
                },
                {
                    "sent": "Now, if you want to connect this to the rest of word, net for the ontology to know that politicians are kind of sort of a national role or something like this, do other kinds of things with it.",
                    "label": 0
                },
                {
                    "sent": "Then you can't just do the mapping at the level of the type you have to then do level at other fields.",
                    "label": 0
                },
                {
                    "sent": "Similarly there will be entries where the gender of someone.",
                    "label": 0
                },
                {
                    "sent": "You know this gender of someone.",
                    "label": 0
                },
                {
                    "sent": "We can double click and add it here.",
                    "label": 0
                },
                {
                    "sent": "You know, and we can say, yeah, he's male.",
                    "label": 0
                },
                {
                    "sent": "OK, by the way I just updated Freebase in real time, so the gender is male, but if you want to connect to what men did something well that whole concept of men is, you know is and is a hierarchy and here you know Mail is an attribute of this of this thing.",
                    "label": 0
                },
                {
                    "sent": "So what we've done is basically make a kind of cross mapping set across mapping knowledge that Maps from the either from the types or from the attributes of different roles.",
                    "label": 0
                },
                {
                    "sent": "Into the corresponding word net category and some of that is manual.",
                    "label": 0
                },
                {
                    "sent": "Manually done knowledge and some of that is semi automatically because you can take some guesses based on this thing and other kinds of clues.",
                    "label": 0
                },
                {
                    "sent": "So we've done that kind of work and some of that's quite interesting and more generally as you start doing more and more kinds of integration of resources, I think these are really interesting, challenging problems that will be figuring out how to do them better.",
                    "label": 0
                },
                {
                    "sent": "Sure, first of all, hi Marco, it's good to see you, yeah.",
                    "label": 0
                },
                {
                    "sent": "So the question is about we're doing fact extraction and it looks like we might be extracting triples.",
                    "label": 0
                },
                {
                    "sent": "How far beyond triples can we go?",
                    "label": 0
                },
                {
                    "sent": "And actually we're really extracting far more than triples right now in some of these things that I was showing you here.",
                    "label": 0
                },
                {
                    "sent": "Let's see if it's a good one.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so you've actually got.",
                    "label": 0
                },
                {
                    "sent": "You've got the subjects and you've got the relations.",
                    "label": 0
                },
                {
                    "sent": "You've got objects, you've got the win of something, you've got the where you actually will have reasons for it.",
                    "label": 0
                },
                {
                    "sent": "You will actually have about if something is about an embedded embedded context.",
                    "label": 0
                },
                {
                    "sent": "We also extract out polarity some other kinds of sentiment features, and in general we have this huge set of information that's extracted out into our semantics and.",
                    "label": 0
                },
                {
                    "sent": "One of the interesting questions is how much of that makes it actually into our index for efficient retrieval at large scales.",
                    "label": 0
                },
                {
                    "sent": "But there's already an awful lot of information in these systems more than just a small triple.",
                    "label": 0
                },
                {
                    "sent": "OK, so the question is how do we deal with knowledge?",
                    "label": 0
                },
                {
                    "sent": "On the one hand and trust on the other hand?",
                    "label": 0
                },
                {
                    "sent": "So the context and trust.",
                    "label": 0
                },
                {
                    "sent": "So for context, there's multiple ways that context plays in.",
                    "label": 0
                },
                {
                    "sent": "One simple way is with things like word sense disambiguation.",
                    "label": 0
                },
                {
                    "sent": "Uh, if you have some ambiguity in a word sense it, one word could be multiple concepts.",
                    "label": 0
                },
                {
                    "sent": "Which ones?",
                    "label": 0
                },
                {
                    "sent": "The right concept that we want to be able to use, or how we're going to prioritize them.",
                    "label": 0
                },
                {
                    "sent": "We are employing worse in simulation algorithm that can take advantage of the love of context around these kinds of things.",
                    "label": 0
                },
                {
                    "sent": "Similarly, we have to do anaphora resolution.",
                    "label": 0
                },
                {
                    "sent": "So if it says he knowing that it's actually doing jumping, how do you do that?",
                    "label": 0
                },
                {
                    "sent": "There could be multiple choices.",
                    "label": 0
                },
                {
                    "sent": "Again, there are contextual approaches that work on there.",
                    "label": 0
                },
                {
                    "sent": "And there's also a specialized notion of context here, which is certain facts may only be true within certain contexts, so only in one ambiguous reading, there's a certain fact true, whereas some of those things are true in all contexts, or something.",
                    "label": 0
                },
                {
                    "sent": "Maybe in the context of a believed thing or a stated thing or negated context.",
                    "label": 0
                },
                {
                    "sent": "So there's many uses of context, and we take we take advantage of them here on the theme of trust in the current model, we're not addressing trust yet, so all those facts that I showed you are extracted.",
                    "label": 0
                },
                {
                    "sent": "You know IT systems equally trusting of everything, but it actually is able to use some statistics when sorting and organized.",
                    "label": 0
                },
                {
                    "sent": "The results to say, well, you know how often is this kind of a factor repeated.",
                    "label": 0
                },
                {
                    "sent": "Now there are some really nice work on using trust and confidence from the level of documents an being combined.",
                    "label": 0
                },
                {
                    "sent": "I just recently read a paper about Nago which is using this kind of trust, trust, metrics and things like that so.",
                    "label": 0
                },
                {
                    "sent": "There's a lot to be done there.",
                    "label": 0
                },
                {
                    "sent": "An would be more using it, but it's not an active part of our work right now.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so the question was about about place and it didn't.",
                    "label": 0
                },
                {
                    "sent": "I didn't show any examples of using using place, so actually with when we look at entities we do actually map them into their places.",
                    "label": 0
                },
                {
                    "sent": "OK, we are not at the moment mapping them into the geographical containment.",
                    "label": 0
                },
                {
                    "sent": "You know type of hierarchies, but it's absolutely the kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So we do know where something happened, but we actually do have some resources.",
                    "label": 0
                },
                {
                    "sent": "We have an integrated, yet we're basically.",
                    "label": 0
                },
                {
                    "sent": "Dealing with a lot of these kind of geographic hierarchies, and so we want to be able to support queries like saying.",
                    "label": 0
                },
                {
                    "sent": "You know who arrived in?",
                    "label": 0
                },
                {
                    "sent": "You know who gave a talk in Korea, and you know that would match me.",
                    "label": 0
                },
                {
                    "sent": "Giving a talk in Seoul OK?",
                    "label": 0
                },
                {
                    "sent": "Because soul is in Korea on this kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So that's absolutely square in the kinds of things that we look at doing.",
                    "label": 0
                },
                {
                    "sent": "You know, it's sort of on the road map.",
                    "label": 0
                },
                {
                    "sent": "So I can't exactly hear you, but I think you're saying that there's a lot of other resources that are available and we want to do mapping as well.",
                    "label": 0
                },
                {
                    "sent": "Because of the echo and having trouble hearing the word, it sounds like you're saying as you add more things you get into.",
                    "label": 0
                },
                {
                    "sent": "More the mapping problem.",
                    "label": 0
                },
                {
                    "sent": "OK, in terms of mapping the different concepts across to each other, I'm sure we're going to hit it and we have because we haven't done the places yet.",
                    "label": 0
                },
                {
                    "sent": "We're not there yet, so maybe you can help us as we get there.",
                    "label": 0
                },
                {
                    "sent": "OK, so the question is about the role of how much inference Powerset is making use of.",
                    "label": 0
                },
                {
                    "sent": "I think that's your question, how much inferences Powerset making use of in the current system.",
                    "label": 0
                },
                {
                    "sent": "OK, so if Powerset does inference and how hard is it?",
                    "label": 0
                },
                {
                    "sent": "So there's many forms of inference.",
                    "label": 0
                },
                {
                    "sent": "And part of our design constraint has been to do something that can be very scalable at very large scale with with real time.",
                    "label": 0
                },
                {
                    "sent": "So the inference we also do, we try to stay as close to the language knowledge of languages we can an actually try to avoid putting in too much knowledge of the world into inference.",
                    "label": 0
                },
                {
                    "sent": "In general you can get very as you start doing that.",
                    "label": 0
                },
                {
                    "sent": "Then you become very domain specific, very fast and we're trying to build something where the work that we do is broadly applicable as possible, least initially so.",
                    "label": 0
                },
                {
                    "sent": "Tom, the kinds of inference the system does do are things like local textual entailments.",
                    "label": 0
                },
                {
                    "sent": "So if John sells a book to Mary.",
                    "label": 0
                },
                {
                    "sent": "Then Mary has bought a book from John.",
                    "label": 0
                },
                {
                    "sent": "OK, that's an example of basically an inferential equivalence of relationships and those kind of things are in our system all the time, so you can ask the query like you know who bought a book and it'll match.",
                    "label": 0
                },
                {
                    "sent": "John Murray sold.",
                    "label": 0
                },
                {
                    "sent": "Sortable to John, or something like that, so that's an example.",
                    "label": 0
                },
                {
                    "sent": "There's also a whole set of things that are very interesting work about this kind of local textual entailment by the folks at Park.",
                    "label": 0
                },
                {
                    "sent": "Another other examples are deverbal constructions like the destruction of Rome by the Barbarians is actually known as equivalent to the Barbarians, destroyed Rome, even those expressed in very different ways, and another set of examples are things like if if I managed to, if I managed to go from San Francisco to Seoul, then I did go from San Francisco to Seoul and I wound up.",
                    "label": 0
                },
                {
                    "sent": "You know, in Solon, I started my trip in San Francisco.",
                    "label": 0
                },
                {
                    "sent": "So these are all kinds of entailments that are afforded from the knowledge of how the language works, so that's where the center of our action has been, and the other kinds of inference that we do are really the sort of local taxonomic inference going from word concepts to their hypernyms, and so on that there hasn't been much in the way of other work there aside from some of the translations into the database system that I was showing you as we would access the API's around around Freebase, so there's.",
                    "label": 0
                },
                {
                    "sent": "A whole lot of interesting inference that can be done that we haven't really plugged in yet.",
                    "label": 0
                },
                {
                    "sent": "There's another system I can refer you to.",
                    "label": 0
                },
                {
                    "sent": "Tom called true knowledge and that is a startup company that my friend found it and it's just come out of stealth.",
                    "label": 0
                },
                {
                    "sent": "Is based in Cambridge and you can do queries into true knowledge like saying.",
                    "label": 0
                },
                {
                    "sent": "You know, is Britney Spears married and it can reason about the fact that there is an entry where Britney Spears did get married and there's no entry later on tonight to conclude that yeah, you know she is still married.",
                    "label": 0
                },
                {
                    "sent": "Or you can ask a question like who is the president of the United States when Hawaii became a state and it can actually do that kind of inference?",
                    "label": 0
                },
                {
                    "sent": "So those are all kinds of paths that we can see Powerset using more of.",
                    "label": 0
                },
                {
                    "sent": "But right now we're still in much more local forms of inference closer to the textual knowledge.",
                    "label": 0
                },
                {
                    "sent": "OK, great, so the questions about different languages and you know what's the strategies for going to different languages.",
                    "label": 0
                },
                {
                    "sent": "What are the kind of constraints and what kinds of resources do we need to use for different languages?",
                    "label": 0
                },
                {
                    "sent": "So yeah, I was saying earlier.",
                    "label": 0
                },
                {
                    "sent": "OK, at the heart this is a language independent system and then you plug in tableware or link where on top of different modules so one of the modules is the syntax actually from the syntax and then lexical resources like a word net in the different languages.",
                    "label": 0
                },
                {
                    "sent": "Then all the rest of the machinery basically crunches along.",
                    "label": 0
                },
                {
                    "sent": "There's actually been a lot of work in applying these things in different languages and.",
                    "label": 0
                },
                {
                    "sent": "German and Japanese are probably the two other languages that are most advanced.",
                    "label": 0
                },
                {
                    "sent": "And in fact, there's been work.",
                    "label": 0
                },
                {
                    "sent": "Interesting work in Japanese where they were able to take the Japanese Japanese version of Word, NET and Japanese grammar developed on top of this technology and then run through and actually do all the kinds of matching an inference that we were already doing, supported by the core machinery.",
                    "label": 0
                },
                {
                    "sent": "So in terms of getting out to a new language, it's probably a relatively small team.",
                    "label": 0
                },
                {
                    "sent": "Could be sort of three or four people working for about a year to come from.",
                    "label": 0
                },
                {
                    "sent": "0 to a grammar built, you know, uh, grammar built for new language and then the other issues is basically making sure you have lexical resources.",
                    "label": 0
                },
                {
                    "sent": "That and that's a sliding scale because the more resources you have, the better results can be.",
                    "label": 0
                },
                {
                    "sent": "But you can get a lot of value out even if you don't know what the words are.",
                    "label": 0
                },
                {
                    "sent": "In particular, like I was showing here, you also need morphology component and we already have morphology for pretty much all the world's languages for our system.",
                    "label": 0
                },
                {
                    "sent": "I guess are the main things that you need to do, but it's absolutely it's very doable for different languages, so you do need some specific work, but the barriers are actually pretty small.",
                    "label": 0
                },
                {
                    "sent": "K thank you.",
                    "label": 0
                }
            ]
        }
    }
}