{
    "id": "nu2rel47p6rmnuw4x5ivrqhsya5pgbga",
    "title": "Toward Transparent Telepresence",
    "info": {
        "author": [
            "Henry Fuchs, Department of Computer Science, University of North Carolina at Chapel Hill"
        ],
        "recorded by": [
            "IEEE ICME"
        ],
        "published": "Sept. 18, 2012",
        "recorded": "July 2012",
        "category": [
            "Top->Computer Science->Human Computer Interaction",
            "Top->Computers->Telecommunications",
            "Top->Computer Science->Computer Vision"
        ]
    },
    "url": "http://videolectures.net/icme2012_fuchs_telepresence/",
    "segmentation": [
        [
            "Is a lovely to see all of you here, especially old friends and colleagues who come from far.",
            "I want to talk to you this morning about Telepresence in about the the long term quest for making it transparent.",
            "By transparent I mean that we like to make the technology disappear in while we're far from that now, but I'm hoping to convince you that there is hope for that.",
            "Certainly in our lifetime."
        ],
        [
            "So let's start with what do people think about Telepresence, who are on the street when you mentioned it to your family and friends?",
            "I think what they're going to say is yes.",
            "I've seen telepresence.",
            "I have seen how presidents in movies I've seen it on TV, and I have seen it in presentations.",
            "You know, at various conferences or presentations by things CEO.",
            "So I want to go over a few of these in order to set the stage for the balance of the dream of telepresence and the reality that we have today.",
            "By the way, I should mention since I'm a teacher of long standing.",
            "There's anything that's unclear.",
            "Feel free to raise your hand and we'll take it right now.",
            "OK, that's different than the discussions activities will hold discussions afterwards, but if there's something that's clear, major hand will try to answer it, OK?"
        ],
        [
            "So here is one of the owners.",
            "We gotta figure out what you are afraid.",
            "Where you come from?",
            "Passing through Joker.",
            "Years ago you served my father in the Clone Wars.",
            "Now he begs you to help him in his struggle against the empire.",
            "My father's request in person with my ship is falling under attack and I'm afraid my mission to bring you to Alderaan space.",
            "I've placed information vital to the survival of the rebellion into the memory systems of desire to unit.",
            "My father will have retreated.",
            "You must see this Droid safely delivered tomorrow.",
            "So most desperate hour happy Obi Wan Kenobi.",
            "So telepresence, right?",
            "That's just what we dream up.",
            "We could be any place right in the middle of the room."
        ],
        [
            "More recently.",
            "This got a lot of press, at least in USI.",
            "Don't know how much press it got over here, but this is CNN, which is one of the most popular networks an an election, not presidential election in 2008.",
            "This is, but they had see.",
            "Jessica Yellin, via whole grain from Chicago.",
            "Pretty clear, right?",
            "And you gotta trust them because they are a trustworthy news source.",
            "So is he seeing her?",
            "Of course.",
            "Indiana knows there in shared space.",
            "Actually, how this late deciders broke a very clear sense, and how many people were already on board with them going in today.",
            "They don't know is that people have made up their mind yesterday today.",
            "If there's a high number of late deciders breaking back in these red states will all over everything.",
            "Proxy surfing different points of view.",
            "Thanks very much.",
            "You're in terrific hologram.",
            "So I."
        ],
        [
            "To find out how this works, and in a cursory search on the web here is I could tell they talked about it sometime later and they said how we did this.",
            "So here's what they did find.",
            "They have about 40 fix video cameras about a semicircle impacted area, and then they have a green screen behind it.",
            "Notice is not full circle, it's a semi.",
            "Circle, they give you some ideas, so from each camera you could be sure that the back on the screen and then as far as I can tell what they do, although they don't talk about this, they take the segmented imagery of the person from the closest cameras.",
            "Do composite an overlay onto a track video camera.",
            "Does anybody have more information about it and how they did this?",
            "Now what's really interesting in looking at this is that they say this is how they did this and they end the.",
            "Person interviewing said it's really magnificent how well it works.",
            "So did they give you any idea whether these people see each other?",
            "Why not?",
            "Well, he guess yourself.",
            "As to why they don't say but.",
            "Still, Jessica.",
            "Just go."
        ],
        [
            "For sure.",
            "This is the one that's closer to my heart because I have relationship with Cisco and.",
            "As you may have seen in the bottom of my acknowledgments, they've been supporting some of our work, so this is the CEO of system.",
            "This is an opportunity for the future.",
            "The handmaids is simple off a single PC screen or you TV's at home for the telepresence units like we've showed you with Professor Kalam and people around the world or think about it virtually with majority of communications will not be voice majority of communications.",
            "Everybody, English inability is though you're physically in the same location.",
            "So at this time I would like to be MA Barnaby and trucks to key back from San Jose Martin.",
            "I'm beating you up now with my special controls.",
            "How are you doing?",
            "I'm doing great thank you John.",
            "Hey guys, you know yesterday morning you look a little bit bigger than me.",
            "I hope today we're going to play this in sizes and will kind of.",
            "And how we can make variations on that?",
            "I will use a job for you.",
            "It's been a long day here in California.",
            "You know we were up here at 3:00 AM.",
            "Our time.",
            "We're still wearing the same shirt and we had a 5.6 magnitude earthquake about an hour ago, so I'm going to tell you, though, that everything's fine.",
            "We've had no major damage here in San Jose, and, you know, as a global company with the teams operate, we know it's amazing.",
            "You can see each other is that we were playing poker.",
            "I can see you sweat a little bit.",
            "Update since last time I saw you, but we don't have a sense of smell yet, but it is a good thing.",
            "So tell me what you have planned for us today and and what is of interest to you.",
            "Just like I did yesterday.",
            "I will interject and asking questions and we do this almost like a review in terms of what's on your mind.",
            "Let me periodically disrupt Martin.",
            "If you would kind of bring us up to speed you in shock in terms of what's on your mind.",
            "What's been the acceptance?",
            "Give us some numbers or something so."
        ],
        [
            "We actually talked about in telepresence system.",
            "They have a successful system called Telepresence, so you may have tried it.",
            "It is not this thing at all.",
            "It is several high Resolution HD screens with HD camera is very nice.",
            "You know how this works?",
            "So I'll tell you, because there's patents on it.",
            "The package is by giant thing will be boss is commercialized by Islander.",
            "It's used in state production, follow in fact it came to in a state production of.",
            "Shakespeare's The Tempest in our University and.",
            "It looks great, so here's the way it works.",
            "This is actually from the first page of the path you take a.",
            "Angle, half silvered mirror.",
            "In this case the thing that is special about them is that they don't think they standard fixed mirror.",
            "They stretch a silver eyes Mylar screen that stretches all the way from the bottom to the top of the stage and to the left and right so you don't see any part of the frame.",
            "And it is tilted 45 degrees, so that if you, whenever you have is image down here or in fact an object down here, the people in the audience will see it.",
            "Of course, back here the same distance from here as there.",
            "So now you have the live performer walking around back here anyway, they want and the virtual people appear if you scale them properly right here on the stage, minus.",
            "Is out there.",
            "So how old is this idea?",
            "Most of you or some of you at least who have studied this as Peppers Ghost Effect circa 1862 in London, just gotten popularized it, but according to Wikipedia, the first known source, at least of them, is a book in 1558.",
            "1558 and it's an opportunity for the future, and here is what?"
        ],
        [
            "It says.",
            "This is from the English translation in 1658 and I want to quote this because I think it's so cool.",
            "OK, so let's say we get changed or the flight comes in a only one and then 140 polished that they may be looking glass on both sides.",
            "Then the spectator must look into it so look into it like this.",
            "OK and the rest do nothing.",
            "Let the pictures be set over against this window so he sees this.",
            "And mobile statue and such for what is without will seem to be within.",
            "That is what is outside will look to be on the inside.",
            "OK, and what is behind the spectators bag with the viewers here.",
            "You know this could be above and behind the viewer.",
            "He will think will be in the middle of the House, you know, looking into the house as far from the blast inward as they stand from the outward.",
            "That is the distance of the objects behind the user.",
            "Two is the same as from the window to the inside.",
            "So certainly he will think he's nothing but truth.",
            "K 1558.",
            "Is this great enough?",
            "This should be used in all kinds of systems affect the way you get.",
            "The superposed effect is that you control the lighting here so that you have in fact a a virtual place here.",
            "That's the same size as the wheel that they look through an if you turn off the light here on the side place, then of course you just see through whatever is on stage and when you turn off the lights then.",
            "You'll see a portion reflection of this ghost life object in the main stage, because of course you'll see right through it.",
            "It doesn't have occlusion, so therefore those defects and those computer and move around and can disappear at will is that cleared.",
            "It's a great magic trick."
        ],
        [
            "So here are just really examples.",
            "In none of these do the participants each other in their own 3D space.",
            "OK, so we can argue back course they're not holograms, but it's worse than that.",
            "They don't in fact see each other in their own physicals mix.",
            "OK, so.",
            "What I think is that a lot of people accept these because they see so much of it and they, I think have one of two or a combination of two attitudes.",
            "They say.",
            "Of course it's been done.",
            "I've seen it in various places.",
            "Or and or, yes, there's some special effect triplets.",
            "Hey so.",
            "But I think away from this is is that in comfort around us as professionals in the area in some ways, like debunking magic mix.",
            "Hey, this is a serious thing that we're trying to do because it is important for communication does nonverbal, but it's not going to be in my view achieved by these kinds of special effects.",
            "So let me then spend the rest of the hour talking to you about various things that we and others have done in this quest for the last 20 years or so.",
            "So we can start."
        ],
        [
            "Lot of different places.",
            "Let me start with around 20 years ago in 1993 over human eye.",
            "Really bad.",
            "CR.",
            "On my slide, this actually has all kinds of space.",
            "Here all the human I upvoted vision of telepresence for medical consultation or verifications, we thought that you couldn't just start with an application like just we're talking like a telephone needs to start with an application that has high value for each hour that you're going to use.",
            "And so we thought that remote surgical consultation with either and here we this is Andres copies.",
            "Join any of.",
            "You will recognize his drawings, one of our colleagues, and the ones that are ghosts because sort of see them.",
            "These two are those are the remote consultants and we thought if you miss the local one and they are each wearing head worn displays so that they can each get a custom view of where they are above the local space and the remote.",
            "And what we said was that we have a bunch of cameras.",
            "Indeed, policy or cameras all around the place that could then reconstruct each one of the three places and send it to the other.",
            "So this."
        ],
        [
            "1990 Three 1994 problem was, as you got another family member and we gotta remember, we couldn't really do real time reconstruction with multiple cameras, so we thought we could start with something that already had 3D and the thing that we already had 3D was some kind of medical surgical sensors like real time ultrasound.",
            "So here is our first experiment with doing augmented reality with head mounted.",
            "Display seeing the data inside.",
            "The patient, so this is the leader.",
            "This is adopted as a leader of a breast imaging and this is one of her patients and she is going to do a biopsy of some part of this suspicious lesion and this is the image that she sees in her head match.",
            "So notice she plays a stereo.",
            "Cameras.",
            "This is the standard commercial ultrasound machine.",
            "And you could see here is.",
            "The image that comes and this is life size.",
            "Being put back into the patient.",
            "You could see the illusion that we want here is that if there is like in any empty, or if it's in the patient, sort of like an empty swimming pool.",
            "So we could put the data back in the patient where it belongs and she could determine that here.",
            "In fact is where she wants to insert needle and so this is already in the procedure.",
            "Can see she's not wearing gloves yet, so she just wants to get an idea of where she wants to make her entrance knew and so right here she's going to 1st inject the patient with local.",
            "Setting.",
            "Hey, we can see how you could combine the real and virtual with this in three dimensions."
        ],
        [
            "So what are the lessons learned from this?",
            "The settings, by the way, on the projector are different than the West.",
            "So we should all learn this.",
            "It was not over some interesting.",
            "Somebody is here.",
            "Yeah, somebody's here.",
            "Somebody take out the older scan for this.",
            "OK, this is this is overscanning.",
            "It was not sit down.",
            "If not, we'll just have to.",
            "Trying to extrapolate here, so here are the lessons learned from that experiment almost 20 years ago.",
            "Video see through at math is more useful in office.",
            "Augmentation a ghost.",
            "They were certain augmentation.",
            "For instance, the physician wants to see every bit of that data innovation and if we made that augmentation be both, she wouldn't be able to see it very well because you will see the patient skin coming right through.",
            "Is that weird?",
            "So we develop video, see through head mouse?",
            "It turns out that they need to be because these are very close manipulations.",
            "They need to be at the same focal point as the eye.",
            "That means you need to have complicated folded optics so that what she sees with her eye through the camera is in the same point of view as we make it up there.",
            "Turns out wide field of view is really difficult to achieve and So what we did is we only augmented a very narrow field of view that the surgical site and left everything to be open so she would see the rest of the world around that and she will see her hand.",
            "She will see her nurse assistant should see everything else except in the central field of view where the fridge for science courses she looked up.",
            "She will see anybody with the video came through.",
            "And we did the proper composition of Z base.",
            "As the base closure, I contacted Video Seafood.",
            "Turns out with really him 'cause we're going to happen is if we look at her she could look at us.",
            "So we looked at her.",
            "We apparently saw her eyes, but were in fact we saw with a tiny cameras.",
            "It does the camera coffee in the same location as her off.",
            "So it was Erie together.",
            "Allusion that we're looking at her, but we don't really see her eyes is that there seems to be.",
            "That's one of the things that.",
            "A really serious problem 'cause I contact.",
            "We know from experience that.",
            "Informal and also from user studies that I contact is really important and really difficult to achieve."
        ],
        [
            "So 3D.",
            "It was so frustrating by about 2000 that we thought we do is.",
            "Bing far or build a scanning system that was optimized for rooms and one of the researchers large Nile and built one of these out of time of flight laser and some mirrors camera and that was good enough so that small company third check has been commercializing it.",
            "You can get it if you like and these are the kind of reconstructions that could be done with several scans in the room and then some manual manipulation combined.",
            "Free skins, but you get a very nice cat and this was sort of ghost and that we had in search for 2000."
        ],
        [
            "So here is what we're able to do.",
            "We're able to give you the illusion.",
            "Here is a scan of an office, and then we only had to reconstruct live.",
            "The person who was sitting there.",
            "Exactly so.",
            "What we did is we went away from him out of this place because we couldn't figure out how to build one that would give you eye contact in my field of view, we went to conventional stereo projectors and headtracking and.",
            "What we did for reconstruction is this hybrid of scanning the room before the session, and then just reconstructing live with something like 9 cameras.",
            "The person who's doing interaction and this is done.",
            "As part of the National Television Initiative funded by advanced networking Services, Brown University, UNC and University, Pennsylvania.",
            "In fact, much of the credit goes to Pennsylvania for doing all this reconstruction.",
            "So.",
            "Laser scanner told you about that.",
            "Guys get back.",
            "Auto check I just want to show you a little bit of this to give you a feeling that we now have a continuation of your office here in the other office next and when I first tried it on the person who was not part of our project but head of video teleconferencing and color fashions in the University.",
            "He described it in a way that was normal.",
            "He said it looked like somebody took a chainsaw, incur hole in wall and we're looking at the other side of the other office.",
            "And that was just what we're trying to do.",
            "That is that this person, even though she was 1000 kilometers away, that we had the feeling that we were in adjacent offices in just she was on the other side of the desk.",
            "So that is the major thing that was popular and learning that.",
            "Thanks.",
            "The hole in the wall was very appealing.",
            "Everybody that the displays were expensive to scale up for multiple users.",
            "This was the standard.",
            "Twin projectors with passive passive glasses.",
            "But as you all know, getting that to go through more than a single person is really difficult and.",
            "Specially that time and the acquisition needs to be much better in the calibration.",
            "More compute power desperately needed.",
            "Hey."
        ],
        [
            "So.",
            "He said if this is so hard to do 3D, maybe what you could do is do something better for multiple people with large scale 2D and get maybe 80% of the way so.",
            "What we have been doing and I'll tell you about this for some time is.",
            "Trying to see how we could improve the current best so called telepresence systems.",
            "So here are the limitations, so I should remind you again that I'm hopeless device with that.",
            "When working with people system, I think that they're really great, but here's what I think and most people agree is a limitation of these and most other current commercial systems in really have poor eye contact.",
            "That is, this system is the same.",
            "Is the one on the other side, that is, it has three screens and each one has room for two people, so these two are once made.",
            "These two are knows maybe structures that there and then there are three cameras in this cluster here, 1 going to each one of the two people and those three cameras go to three displays that are in the other room.",
            "Now think about what happens with eye contact.",
            "If a person, say, say, that person is looking at this person here.",
            "The people over here see that he's looking over to our left.",
            "This person sees are looking at are left, but 'cause everybody is looking at the same image.",
            "Of course in 2D display this person also the person he's looking at.",
            "Perhaps the most important person with high contact thinks he's not looking at it.",
            "He thinks he's with the office is left in this empty chair.",
            "So really, uncanny.",
            "Affect and So what?",
            "People have been trained to do so my colleagues and industry say, especially salespeople, is when they're talking to customers.",
            "It cold don't look at the people.",
            "Look at the camera.",
            "Don't look at the people.",
            "Look at the camera 'cause then it looks like you're looking straight ahead into all these people and you get the Mona Lisa affective.",
            "Everybody thinks you're looking at.",
            "So if you want to make a sales pitch, what you do is a normal people just look at the camera.",
            "All right now, but we you know we really wanted to fix that.",
            "The other thing that's unfortunate is is very low spot made.",
            "That is, you can't.",
            "Oh sorry, you can move around.",
            "OK, you can't move around because quote.",
            "Hold on.",
            "OK, I'm gonna just try to use the laser pointer carefully, OK?",
            "So here's why.",
            "It's not very spontaneous.",
            "You see how these things fit just about the seating position here.",
            "That's to optimize the pixel in the area.",
            "If you want to, for example, go to the board right here and write something what happens.",
            "They don't see here now.",
            "Will say oh we'll give you a special software you could write on some laptop and then we'll show it below here on the screen.",
            "Just like your slides.",
            "But you know, you gotta use special software.",
            "You can't just scribble on board right?",
            "In fact, you can't even just come in the room and sit down where you want.",
            "It.",
            "Turns out that if you will sit down anywhere you want, you might accidentally.",
            "Inadvertently sit, say right there.",
            "But you don't see it right here, but if you sit between these two people, but you move your chair to it, but you will be seeing on the other side is right in the gap as they will not see.",
            "How they solve this problem?",
            "They put a layer of the desk right there in the gap so you will not be able to sit there unless you are willing to be uncomfortable.",
            "But if there are seven people and not six came on, it is no seven seats.",
            "Instead.",
            "So how do you overcome this?"
        ],
        [
            "So here's what we'd like to do.",
            "Would like to do the best possible view multiple people in each room with a 2D display wall.",
            "That is what can we do with current Rudy displays?",
            "We can't wait for the best photographic displays.",
            "And can we get some sort of casual awareness that is in addition to just meetings?",
            "If this thing works off?",
            "24/7 it might be used for some casual encounters and many groups around the world over the last 30 years.",
            "Have you video walls for these casual accounts?",
            "What can you do with that if you support it?",
            "Life size if you get eye contact among all these people.",
            "The short answer is you can't do everything, but you can do something."
        ],
        [
            "And here's what we'd like to do.",
            "We'd like to get the illusion just like we had before, that there is a big hole in the wall.",
            "So here is a Panorama of the other room, and we took this in a very wide field of view so that you could see how big is this is actually.",
            "15 or 16 feet so you can get some idea you know this is life size and we put a cluster of cameras in the middle of each rooms display.",
            "So what you have is a room 1 here room through there just like you had in the individual desk.",
            "But now you scale it up to say size of a small meet their size of a room in which people might take their coffee or tea break and just have casual encounters.",
            "So then what you have is a row of displays here.",
            "An cluster of cameras and A roll of this place here in Custer cameras, and of course, the red cameras here in the Red room.",
            "Each go to one of the blue displays in the zoom room and four blue cameras, each one of them goes to one of the red displacing written down there.",
            "That seems like that would be something you could do in a weekend.",
            "Turns out there is one or two problems with it."
        ],
        [
            "1st is.",
            "That we like to show people life size.",
            "So we found the way we want to model this is that.",
            "When you're talking to somebody.",
            "If in addition to casually encountering them, you are just walking up to the screen when you get to a distance that you're comfortable with that we'd love to have it so that when you go through that comfortable region, which is a 1 to 1 1/2 meters that you'll see the person life size and LCU life size.",
            "So the way we want to model this is not that the two rooms are next to each other, but in fact that they overlap by the comfort distance.",
            "So that at the at the comfort distance here, when there's a blue camera, it will take a picture of this blue person, send it to the red display and the red person will see in the red room the blue person life socks, and similarly the blue person will see the red person.",
            "Life sucks.",
            "So that was great.",
            "Here is the part that doesn't work."
        ],
        [
            "Facebook again.",
            "I gave is off.",
            "Hey, it's especially severe when the panels are not are going to bed once and is caused by the fact that the cameras are in this cluster.",
            "That is why I have a nice Panorama.",
            "But that means that they are aimed at the person not spayed on, but in an empty like 25 degrees.",
            "So again you have this affect life in the commercial systems that the person that you want to talk to.",
            "Most things that you're looking away from it.",
            "OK, so here's the way we propose to fix that."
        ],
        [
            "What we do is.",
            "Will add a second account.",
            "Now I know we don't want to pay for more family court cameras and cheap and now what we'll do is we'll put the second set of cameras going straight forward in there, just in the right place for casual conversation.",
            "OK, and then what we need to do.",
            "So here is for example.",
            "The one the camera do we get of this person when they're just standing there to see it from the side and.",
            "For the so called personal account that look straight ahead, we get very nice straight ahead of you.",
            "So if there's somebody talking from here, they will get very nice.",
            "I can't.",
            "OK, so the only problem that remains is.",
            "What do we substitute?",
            "The first thing you say is, well, what we do is we will substitute these nice personal cameras when somebody is looking from here and not use the panoramic.",
            "The problem with that is that this camera view of course goes out as of course they will do and that means that as you get to objects and people that are farther away, you'll get them duplicated from your personal camera.",
            "Here the panoramic camera that mean so here is.",
            "You know the next panoramic camera that is displaying on this red screen and if you have somebody or something over here then you will get the duplication of the personal camera here and in the red display.",
            "And the panoramic camera in the next displayed here is out there and that was really bad.",
            "Somebody is walking across and you see them duplicated.",
            "You is a very disturbing attract, so here's what we."
        ],
        [
            "We said so.",
            "We say all we want to do is take this person's image there pixels out of the camera that we really want to see them from, but the rest of the background or whatever is there.",
            "We want to use the nice Panorama.",
            "So what it takes is basically the same in both of them and then taking them out of the one from the Panorama.",
            "Taking and removing only them from the personal one and then putting it.",
            "Back on top.",
            "Jarvis.",
            "Good Sunday night."
        ],
        [
            "Hey, is the little problem with that.",
            "It turns out, of course, that there are different pixels that the person covers in each of these cameras, and so they'll be pixels.",
            "For example, right here that were of this person in the nice foster Panorama.",
            "But they're not in this person for whatever reason in the personal camera.",
            "So you gotta do is fill them in with something and we fill them in with some 3D points that we extract and fill them in with whatever was in those pixels before the session starts.",
            "OK, so let me show you what this looks like in action."
        ],
        [
            "So here is.",
            "What happens when you see before the Panorama view?",
            "And here is what it looks like?",
            "The same with just cutting out the person from the secondary camera and pay statement OK?"
        ],
        [
            "Simply put.",
            "You don't need to.",
            "So."
        ],
        [
            "Where are we right now?",
            "I had another.",
            "15 minutes, right?",
            "At least I can tell you about a few more things.",
            "Where are we in 2012, twenty years after we started?",
            "Here is where I think we are.",
            "We have acquisition using multiple DEF cameras and we have displays using better multi viewer auto stereos.",
            "So I want to tell you about those things."
        ],
        [
            "So.",
            "Auto stereo display choices.",
            "Of course.",
            "Everybody says, why don't you just use a hologram?",
            "And the answer is we can't get one that's the size of a wall and we can get one that we could update in real time so.",
            "When you guys get money for us will use it, but so far we can't get it and So what choice do we have this left?",
            "They are derived from bio metric displays, usually based on spinning or vibrating things and they tend to be of a small volume which is nice for a head or something like that, but not for a whole room full of people.",
            "Then there are various various business.",
            "Please pack my favorite ones that, by Doug Landman at MIT.",
            "And there are various lenticular lens that displays.",
            "Basically, here's the problem that you have.",
            "In a 2D display.",
            "No matter where you're looking at it, you get the same color for every angle, right?",
            "So This is why everybody looking at the image of that person is going to see the exact same thing and what you need, fundamentally is for the different angles to have different colors so that people looking from here they see the red.",
            "Patrick, that's back here and people looking at that same pixel from you on the right.",
            "See the Queen optic test.",
            "Actually, that's fundamentally what you need.",
            "There's no getting around the fact that you need to have different colors, different angles in the same location.",
            "OK.",
            "So."
        ],
        [
            "Here is a simple idea that we've been working on.",
            "The way that both ball commercial system do this now is by a barrier, and that's again one of these ideas has been around for many, many years.",
            "You take a conventional display of any kind.",
            "In fact, it could be some of the imprint.",
            "If you don't want to change it and you put a barrier in front of it with some openings at a small fraction of the area, right 110%.",
            "OK, and you could vary the spacing.",
            "You can vary the size, you can vary the distance, but to give you some idea, this might be something say like half a centimeter in.",
            "This might be the size of 1 from pixels and so why don't you pixel gap?",
            "And then you'll have say seven or eight pixels black and you could just take one of these as a photographic print that you make on your leg or something else is out there.",
            "So those who have done this you could do it at home.",
            "OK, now.",
            "This works well for entertainment because what you can do is you can calculate if these things are saying uniform.",
            "Say that one is a one in 10 is that you say, and this particular location.",
            "I'm going to see 110th of the pixels, say pixel one Pixel, 11 Pixel, 21 Pixel, 3 lines for 41 sold out there, and then if I move over a little bit more then I'll see pixel two Pixel, 12 pixel, whatever 22.",
            "So 3240 right?",
            "And so you if you move over and you know you could, depending on the geometry that you could have this be something like, say, 2 centimeters.",
            "So every 2 centimeters you see a different set of fixes.",
            "The problem is that once you get 10 spaces over, you start seeing the same pixels.",
            "And that might be OK for payment if you're just in a supermarket and you're seeing an advertisement for Coca Cola and you see these Coca Cola bottles dancing around, it's perfectly OK that you see the same ones if you move over $0.20, right?",
            "But if you're trying to get Telepresence, it's not good, because then if you go over 20 centimeters, you see the same person when you see him twisted once more, the next person sitting next to you says sees the same 8 or 10 images, right?",
            "So?",
            "This doesn't work exactly.",
            "Log in the back, so here is a simple partial solution in fact.",
            "So take this same exact setup, just vary the holes random.",
            "OK, so instead of having it be 1 pixel opening and then 10 and then another pixel opening an intent, just say OK, I'll have one here and then 13 here instead.",
            "And then two and then 17 where so the same percentage of holes that same one in 10 but you just do it better.",
            "Now.",
            "What does that mean?",
            "What that means is that any of you will see the same will see the same percentage of pixels but entirely different substance.",
            "Delsea random subset and person over here will see another random subset and in different places they'll see different substance.",
            "Now of course there will be some overlaps.",
            "They'll be my say official right here that through this gap.",
            "Your one will see it in through another gap.",
            "Google tools.",
            "OK, but you have the following kind of behavior.",
            "If you plot say you have one viewer in the center and you have another viewer that moves back and forth.",
            "And if you flock here.",
            "Vertically, how many pixels you get collisions.",
            "What will happen is that you get collisions in about 110th of 1 tenant.",
            "You'll get a couple of percentage of the pixels that they'll be collisions.",
            "And then of course, if you are running behind the person, you'll get total collisions.",
            "Visual seats after the same ones.",
            "If you exactly the same place, but most of the time you will get the same amount of collisions, whereas if you do the same plot for the conventional ones, that is if you say I'm going to have the viewer one.",
            "Or say we were to say right now, if you are one who's bad 4th what will happen is that every once in awhile, like every 10 spaces, you'll get terrible versions because you'll see the same pixels an in between.",
            "You get help versions so you get these trucks which is great and that these piece, which apparently they will see just about the same pixels on time rather than having the same low percentage of collisions all the time.",
            "OK, so let me show you how that works."
        ],
        [
            "Tabletop stereoscopic display for multiple users and techniques for real time rendering on it.",
            "Previous autostereo displays typically supported visual motion in only a single axis.",
            "Our technology allows the viewer to move anywhere with respect to the display.",
            "The viewers eyes must be tracked, but no special glasses are needed for stereoscopic viewing.",
            "The display support multiple simultaneous users.",
            "To demonstrate this capability, we can fill our display with two traffic cameras and chill both views at the same time.",
            "Do you understand the significance of that?",
            "So this was recorded at the same exact time with two counters, so we were seeing is at the same instant.",
            "One camera sees this from, you know this point of view and another camera sees that from this point.",
            "Few more seconds of this one.",
            "It didn't get.",
            "Alright, I'm not gonna show you anymore."
        ],
        [
            "OK, so let me show you some more things.",
            "So with that shows I believe is that it is possible to get and this is a standard off the shelf LCD with just a random set of holes in it on the barrier.",
            "So it is possible to get two or three different views like this guy.",
            "Say it louder.",
            "How do you print out available?",
            "So how do you have related?",
            "It's just a standard for some distribution.",
            "You know you say one of you know 4 by 4.",
            "You picked one pixel and then you go to the next one and pick another study.",
            "It's very simple algorithm.",
            "People use all the time.",
            "How do you print it out?",
            "You go to a company that make mask.",
            "At least that's what we did.",
            "Company that makes masks for printed circuit boards and they used to making friends circuit boards that are couple of feet on the side for.",
            "$70.00 or so, they'll make really beautiful masks.",
            "So we try unrelated printer.",
            "You don't get some good glass or should clear.",
            "So.",
            "Now model generation.",
            "You probably all know that the best thing since sliced bread or these cheap depth cameras by Consense and Microsoft Local Connect, is there anybody who hasn't bought 1 yet?",
            "We should go out, spend $150 and you will not regret it.",
            "They are the best thing since sliced bread and I have no financial interest in them.",
            "But it is amazing.",
            "For $150 you get a reasonable color and you get depth.",
            "You get depth down to you know, but after centimeters 30 frames a second and no outliers, it's really beautiful.",
            "OK, So what they have in the IS?",
            "Just for the few of you, they don't have them yet.",
            "They had two cameras.",
            "The standard CMOS RGB camera, an infrared camera, and this is the secret.",
            "Truth is they have a laser projector laser diode projector that projects a series of dots.",
            "Patterns have been carefully calibrated and then the system inside looks at the IR image 3 times per second.",
            "And then calculate suit correlation and other techniques.",
            "What the likely depth is adapted for pixel and then puts it into the space of the color camera.",
            "So you get out is death for each color pixel.",
            "OK, now.",
            "Here."
        ],
        [
            "Great thing about that so you get it.",
            "You plug it in, it works.",
            "There are a couple of problems.",
            "The major problem is if you want to use multiple of them simultaneously, like you want to capture a few people because you got a small room.",
            "They don't work very well and the reason is they weren't made to work.",
            "They were made to work as a gaming accessory for single person.",
            "The reason technically they don't work is that the projected IR pattern is of course the same in every one of the cameras and so if you have two of them that happened to hit the same surface then that surface is not going to get very good results because.",
            "The cross correlation techniques you know get confused that there so then, but you needed to capture the entire room little time, so it's not like we have mentioned the choice.",
            "Anne.",
            "This is one of those things how many have seen the really beautiful results from Microsoft Cambridge on Connect Fusion.",
            "I hope.",
            "OK, those that haven't seen it look up connect Fusion in Google.",
            "It is the best thing from connect.",
            "I mean is best thing ever done for they could just take a scan, a single connect and they'll just slowly scan whatever it is and they will put it into a nice volume based on acrylics and avoid 1996 paper and.",
            "It looks really lovely and you would think.",
            "Why can't we just use one of those?",
            "We could just impact there.",
            "Now open source our versions of the code and the reason we can't use it is that the IR pattern you know from each connect OK will confuse the deposition system and it's worse.",
            "Pay the surface of course observed by few connection scans.",
            "So this is a different thing.",
            "I want to explain to you when you have fixed you want to do a whole room, you need to have like a dozen connect you know carefully set now versus one of them.",
            "If you have just one of them, you moving it around for that particular surface, you're going to get lots of different angles that you get that particular detail, so you could combine.",
            "Those 510 fifteen 2050 frames because you're there for a second.",
            "It is that clear now if you are having a whole room, you're scanning in real time.",
            "You have fixed connects and any particular surface may only be hit by two or three or four connects and those are fixed.",
            "They won't get any angles in between, and so it doesn't get as much good data.",
            "K. Is once you get about 10, what you're getting is a lot of video footage, because each one has a color in a death screen coming at him, so you got like 20 streams coming at you and even the best PC's have difficulty with 20 streams, and so you say, why don't we divide it into like four or five PC's, but the problem there is that if you want to do that then you have difficulty that the distributed gather this scatter and gather.",
            "Problems tend to be really difficult in real time 'cause what you've got to do is do a lot of GPU intensive computation and then you've got to combine them all at the end and the way that they are combined is not necessarily to get just the single result in combining and so all these reasons make it much more difficult to do a whole room then to do a single one.",
            "The same room offline is that there, so would that have yet let me show you?",
            "Can I show you this, yes.",
            "Alright, this is our president.",
            "So here this is tracked.",
            "This is a conventional 2D display, not even stereo.",
            "Well, I hope you get this illusion that in fact that room that entire rooms being skin in real time and combined.",
            "How is that paper coming that I'm working on?",
            "This is the paper for iPad that's beautiful.",
            "OK.",
            "So this is not just a single connect.",
            "This is like 10 connects, all being combined simultaneously."
        ],
        [
            "Hey now.",
            "The other problem then just show you this would be.",
            "I think that's the last thing I'm telling you is, as I told you, as you add more and more connects some of the problems that you see there because we did drop out that as you get more and more places where there are multiple connects hitting and the each connect cannot decide what the pattern is and so cannot give you a debit an so answer, my money that's hard came up with a really brilliant simple idea.",
            "I think phrasing.",
            "As I had nothing to do with it, I mean I was sitting around, you know.",
            "Yes, this looks great idea.",
            "It turns out a few months later, independently.",
            "People at Microsoft in Cambridge developed the same thing and they came out with it.",
            "So our paper came out last March, and IEEE VR and this came out in sikhi couple months later.",
            "So here's the idea.",
            "If you take multiple connect, say two of them and you just vibrate both of them just with a cheap blue motor with a weight on one side.",
            "What is that is a vibration of approach, the whole unit.",
            "And that means that the cause your projector and camera vibrating together.",
            "It won't change very much.",
            "It's as if the whole room is vibrating, but the other patterns will of course be blurred.",
            "And so this is the idealized simulation.",
            "But this is from the actual system.",
            "Could sort of see that here you have some that are more blurred and some data Leslie.",
            "So let me show you the little simple result that we got here.",
            "So here is just before here is 1 unit, just one operating in.",
            "Here's what happens is you turn on multiple other.",
            "How many families drop out again.",
            "Projectors and cameras are rigidly attached.",
            "Applying motion allows computer to see its projected pattern, sharply blurring the pattern, all other units.",
            "Blurring of the high spatial frequency patterns of the connect results in a significant contrast loss.",
            "Long devices to discontinuing their own parents and those of others to produce the motion.",
            "We use a small motor with an eccentric mass attached to induce vibrations in each command.",
            "To test our method we used in array of four vibrating connects to capture the scene shown here.",
            "Is shown when motion is applied, the amount of missing data and noise is greatly different and similar experience.",
            "We found that our technique reduce missing data by approximately 90%.",
            "Reduce the measurement error introduced by interference by over 80%.",
            "So you understand that."
        ],
        [
            "All you're doing is vibrating all of them and.",
            "You don't say anything to the software.",
            "You don't say anything to the connect.",
            "You get fewer dropouts now.",
            "In fact, you get slight lowering of the spatial resolution 'cause you're effect vibrating.",
            "The world vibrated like a couple of pixels in ratings, so it's still we think the network.",
            "So let me end with a blatant advertising for a telepresence center, because we're always looking for new people and new collaborators, and some of them are right here by config, and so this is.",
            "We just started last year a collaboration between NTU Singapore, any exertion, UNC Chapel Hill.",
            "This is one of the places impacted income will see.",
            "It's really beautiful here.",
            "It makes it a challenge for us to, uh, do some experiments because it is so beautiful.",
            "It's so much class, but it's about eighteen $20,000,000 or 4 five years supported by Singapore's interactive Visual Media program.",
            "Three universities probably know some of the leaders, not to Tom and Mark Strauss.",
            "Myself."
        ],
        [
            "Bunch of projects.",
            "This is the last advertisement opportunity you know about this.",
            "I told you about baseball presence.",
            "If they ha is doing a rolling display that I think is really cool.",
            "Imagine Aruba with a life size autostereoscopic display.",
            "This transparent and then you show only the person even more outrageous.",
            "My friend Greg Wells leading a project an animatronic avatars and you have an avatar in which you project.",
            "Your own live video and it moves the way you made and we're working hard with our colleagues in NTU.",
            "So now there's movement around and you could drive these anywhere you want.",
            "You don't have to be meeting rooms.",
            "Finally, Nottamun who's been working on synthetic humans for many, many years is leading the project on Thomas virtual humans.",
            "That is even saying one of these systems, that person right there with that person, right?",
            "There is not really there, but as an avatar of them you may know because it looks slightly more mechanical.",
            "But it might be more useful to have the person there in the meeting did not have anybody.",
            "Because that might say 10 bringing to the same time you know, being crippled book, and so his avatar can do something to record some things.",
            "You could answer some questions, and if there's some question that needs his immediate attention, then the Avatar could ring back to the person says I need your attention right now.",
            "You could be in this meeting for the next few minutes, so that's the end."
        ],
        [
            "The advertising let me end with one slide inclusions and I think we should have some discussion, right?",
            "We have 950.",
            "This is what you want.",
            "OK, so one of the clues.",
            "My sense is this is amazing.",
            "I still think it's a great idea, but I think we've got a long ways to go and for inspiration.",
            "I think it would be useful for those of you who are young and go back to something like 1965.",
            "When I first featuring graphics item.",
            "So when gave this famous talk about the ultimate display?",
            "Many of you may have studied and this is at a time when people were making line drawings who were in the best place.",
            "Is the people who are not in best places were making drawings out of printer paper with little X's and O's OK?",
            "And what he said was.",
            "That we should not think of the graphic display as making pictures.",
            "I think about it as a window into a world created by the.",
            "And that has largely been realized in terms of image generation.",
            "That is the kind of video games that we see right now on our standard PC's are so realistic that they do look like a picture.",
            "A window into a Wonderland created by, so it's, I think, encouraging to think that we might have telepresence in another generation of that level.",
            "I think that for the short run you should all go out and buy RGB cameras that are cheap, because I think that they're going to change the face of what we do.",
            "You know, a lot of different things, and I think that in terms of displays, I think that there are two possibilities.",
            "One is these multilayer displays for this example here, because I don't want to steal the Thunder of other researchers, but go look at double and work at MIT Media Lab.",
            "He uses multiple layers and dynamic barriers and not.",
            "It's barriers and just really beautiful results.",
            "And he admits that there's still some ways to go, so you could still contribute to it.",
            "And I still think that in the longer term.",
            "Head worn displays are going to be answering.",
            "I'm most encouraged by Google Glass product.",
            "How many have I assume most of you have seen this picture right?",
            "So within a year Google is going to give these out or sell them to develop an.",
            "I believe that that's going to fuel a renaissance in head worn displays and so there are some small companies actively like Louis that have wide field of view.",
            "Headworn displays like this.",
            "They're not that why there?",
            "40 degrees, but that's a lot wider than Google Glass, and so I think within the next 5 or 10 years will see really nice displays in our eyeglasses that would work for a long time and I think Google Glass is just the beginning.",
            "Yeah."
        ],
        [
            "Thank you.",
            "OK, thank you very much.",
            "Again we have time for questions and if you could please go to the microphones to ask you questions.",
            "Let me begin with the first question for the system where you had the panoramic camera views and the hidden camera views.",
            "When you do for angles that were not either aligned with the panoramic view or handle, but where is the slight angle that was different.",
            "For example, if people were spending but not each other, but it's slightly off.",
            "So the answer is nothing.",
            "What we do is.",
            "We process what every part of you may be in each one of those images.",
            "If you're within close distance and you happen to walk between we segment using connects and using color, whatever happens to be connected component within a certain range like less than two meters.",
            "So what you will see on there if you're walking between it, is that you'll see put together some part of 1 camera image in another part of 1 camera image and we take advantage of the fact that each camera.",
            "Is going to 1 display and there's the gap in between that.",
            "We don't have to match the price alone.",
            "Off in Angleton, exactly that maybe often angle exactly.",
            "Foot by having additional cameras with different angle at each point, exactly what we have said to people.",
            "Think of the cameras as being the kind that are in your laptop and so you might have like a Pearl string of pearls across.",
            "And then we could select an do compositing for multiple accounts.",
            "Basically, if you have to do with each each point along the path.",
            "Yes, it's not clear that panoramic around, but the closer that we have more cameras that we have for, the closer we get to iTunes and we've done by 10 or 11 in a row as well as many people here.",
            "And those are nice for being introduced.",
            "Next question.",
            "Future please go to the microphone.",
            "The great great heart.",
            "I liked all these pictures and like I've been through some of your situations to my question is with you.",
            "I don't work heading for this connect and everybody is every family get one.",
            "I have no fiber.",
            "My question is related to the.",
            "Transmission power story for every family.",
            "Got those under Florida law, the heavy presence, whatever you ask the telecommunication company provide oh I see so we just thinking is that the Internet will just be congested because we have so many telepresence system I don't know.",
            "What is the language that that is the problem that we have?",
            "Do you know he's sending yes?",
            "Yes, I could answer you more seriously.",
            "We have done some experiments.",
            "In fact, use passed with one of the supercomputer centers in the US center and they were interested in.",
            "Exploring some real time applications with a massive amount of data massive.",
            "This was seven years ago maybe.",
            "Something like that and we managed to get something like 27 video screens with our friends from Pennsylvania and managed to get it from one part of the country to the other using Internet two and very little amount of compression and managed to get the cross correlation done, 2000 processors something and then combine and send the data points back another 1000 miles.",
            "A couple frames per second.",
            "But we were using all the bandwidth that was available then.",
            "Devastation it was something like a one Gigabit.",
            "Our path from the Superview conference in Baltimore to a few places and we use 90% of them already.",
            "So yes, you can certainly use up bandwidth.",
            "Say I think we should be so lucky that this would be a problem, but I find it somewhere.",
            "Yes, our friends, that system and other companies are working on that.",
            "Thank you very much for a very interesting talk I have.",
            "I have a question but I also have a little bit of promotional placement.",
            "You're talking very interesting.",
            "It would be nice to consider you as a very member of The Time Machine session, or which will be held tomorrow.",
            "An Anna purposes.",
            "Looking forward by looking back to past technologies and I think with citing work from 1558.",
            "Basically you have really sold out their phone anytime soon.",
            "I just found my Wikipedia.",
            "I I nothing happened to my scholarships.",
            "I noted the website web page.",
            "So thank you, thank you for that.",
            "Great glad to know view on the topic.",
            "My question has to do with the presence part of Telepresence.",
            "So I notice that your talk was was very centered on on visual presence and actually having visual depiction of participants in the room.",
            "And I was wondering if you could come down some of the elements of a presence that are that are non visual in nature.",
            "I'd love to, but I'm I'm totally experience from the non visual after telling that I cheered so I would just had interaction an email with some friends at the Media Lab.",
            "Each sheet you know who many of you know has been working for decades on haptic.",
            "You know physical interfaces has some really nice things on haptic interfaces as an augmentation to the visual which I think is terrific.",
            "And if I had more hours.",
            "Today I would love to work on that.",
            "I think that even a small amount of touch would do so much.",
            "I I know I could, I had money, I would invest in.",
            "I think that you know, I think if we had the same visuals we have now and just had a.",
            "Mention touch, I think that it's done well.",
            "It could enhance tremendously sensitive presence.",
            "I wish I could design better.",
            "Easy is the best one I know.",
            "Thank you.",
            "We have time for one more question.",
            "Really, really enjoyed very quick question around.",
            "Everyone is saying everyone is really using tablets and mobile phones.",
            "Future of buying this stuff and the role of tablets and mobile phones to create more anonymity telepresence.",
            "That's a really good question.",
            "I think it's in some ways too early to tell.",
            "I mean, I like everybody else uses my tablet and get visuals on it and I I so much like they have it because it is bigger than my smartphone and so I get images of my loved ones that are, you know, closer to life size.",
            "And I also find it that I'm moving my tablet around, you know, giving them tour of wherever I am, but you know, I don't have any greater insight than most of you have here about how it is going to go.",
            "I think it's too early to tell my senses.",
            "Where was tablets, the way PCs were when people in the first couple of years, personal computers?",
            "You know?",
            "We had some idea it was going to be.",
            "Remember it was.",
            "This account that you could do spreadsheets and that you could do like desktop publishing company.",
            "But you know, we can get to the notion of having our laptop around with us all the time, even though it was around.",
            "See what I mean.",
            "So we just looked at the first new things and I think that's what's happening with tablets that we're looking at the first obvious applications from the previous technologies.",
            "Like you know, using Skype.",
            "But I think another 10 years and will have a different mixture of things that we're doing.",
            "I think that the more we used to think faster, we'll get some new areas.",
            "Thank you very much, very."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is a lovely to see all of you here, especially old friends and colleagues who come from far.",
                    "label": 0
                },
                {
                    "sent": "I want to talk to you this morning about Telepresence in about the the long term quest for making it transparent.",
                    "label": 0
                },
                {
                    "sent": "By transparent I mean that we like to make the technology disappear in while we're far from that now, but I'm hoping to convince you that there is hope for that.",
                    "label": 0
                },
                {
                    "sent": "Certainly in our lifetime.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's start with what do people think about Telepresence, who are on the street when you mentioned it to your family and friends?",
                    "label": 0
                },
                {
                    "sent": "I think what they're going to say is yes.",
                    "label": 0
                },
                {
                    "sent": "I've seen telepresence.",
                    "label": 0
                },
                {
                    "sent": "I have seen how presidents in movies I've seen it on TV, and I have seen it in presentations.",
                    "label": 0
                },
                {
                    "sent": "You know, at various conferences or presentations by things CEO.",
                    "label": 0
                },
                {
                    "sent": "So I want to go over a few of these in order to set the stage for the balance of the dream of telepresence and the reality that we have today.",
                    "label": 0
                },
                {
                    "sent": "By the way, I should mention since I'm a teacher of long standing.",
                    "label": 0
                },
                {
                    "sent": "There's anything that's unclear.",
                    "label": 0
                },
                {
                    "sent": "Feel free to raise your hand and we'll take it right now.",
                    "label": 0
                },
                {
                    "sent": "OK, that's different than the discussions activities will hold discussions afterwards, but if there's something that's clear, major hand will try to answer it, OK?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is one of the owners.",
                    "label": 0
                },
                {
                    "sent": "We gotta figure out what you are afraid.",
                    "label": 0
                },
                {
                    "sent": "Where you come from?",
                    "label": 0
                },
                {
                    "sent": "Passing through Joker.",
                    "label": 0
                },
                {
                    "sent": "Years ago you served my father in the Clone Wars.",
                    "label": 0
                },
                {
                    "sent": "Now he begs you to help him in his struggle against the empire.",
                    "label": 0
                },
                {
                    "sent": "My father's request in person with my ship is falling under attack and I'm afraid my mission to bring you to Alderaan space.",
                    "label": 0
                },
                {
                    "sent": "I've placed information vital to the survival of the rebellion into the memory systems of desire to unit.",
                    "label": 0
                },
                {
                    "sent": "My father will have retreated.",
                    "label": 0
                },
                {
                    "sent": "You must see this Droid safely delivered tomorrow.",
                    "label": 0
                },
                {
                    "sent": "So most desperate hour happy Obi Wan Kenobi.",
                    "label": 0
                },
                {
                    "sent": "So telepresence, right?",
                    "label": 0
                },
                {
                    "sent": "That's just what we dream up.",
                    "label": 0
                },
                {
                    "sent": "We could be any place right in the middle of the room.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More recently.",
                    "label": 0
                },
                {
                    "sent": "This got a lot of press, at least in USI.",
                    "label": 0
                },
                {
                    "sent": "Don't know how much press it got over here, but this is CNN, which is one of the most popular networks an an election, not presidential election in 2008.",
                    "label": 0
                },
                {
                    "sent": "This is, but they had see.",
                    "label": 0
                },
                {
                    "sent": "Jessica Yellin, via whole grain from Chicago.",
                    "label": 0
                },
                {
                    "sent": "Pretty clear, right?",
                    "label": 0
                },
                {
                    "sent": "And you gotta trust them because they are a trustworthy news source.",
                    "label": 0
                },
                {
                    "sent": "So is he seeing her?",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Indiana knows there in shared space.",
                    "label": 0
                },
                {
                    "sent": "Actually, how this late deciders broke a very clear sense, and how many people were already on board with them going in today.",
                    "label": 0
                },
                {
                    "sent": "They don't know is that people have made up their mind yesterday today.",
                    "label": 0
                },
                {
                    "sent": "If there's a high number of late deciders breaking back in these red states will all over everything.",
                    "label": 0
                },
                {
                    "sent": "Proxy surfing different points of view.",
                    "label": 0
                },
                {
                    "sent": "Thanks very much.",
                    "label": 0
                },
                {
                    "sent": "You're in terrific hologram.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To find out how this works, and in a cursory search on the web here is I could tell they talked about it sometime later and they said how we did this.",
                    "label": 0
                },
                {
                    "sent": "So here's what they did find.",
                    "label": 0
                },
                {
                    "sent": "They have about 40 fix video cameras about a semicircle impacted area, and then they have a green screen behind it.",
                    "label": 1
                },
                {
                    "sent": "Notice is not full circle, it's a semi.",
                    "label": 0
                },
                {
                    "sent": "Circle, they give you some ideas, so from each camera you could be sure that the back on the screen and then as far as I can tell what they do, although they don't talk about this, they take the segmented imagery of the person from the closest cameras.",
                    "label": 0
                },
                {
                    "sent": "Do composite an overlay onto a track video camera.",
                    "label": 1
                },
                {
                    "sent": "Does anybody have more information about it and how they did this?",
                    "label": 0
                },
                {
                    "sent": "Now what's really interesting in looking at this is that they say this is how they did this and they end the.",
                    "label": 0
                },
                {
                    "sent": "Person interviewing said it's really magnificent how well it works.",
                    "label": 0
                },
                {
                    "sent": "So did they give you any idea whether these people see each other?",
                    "label": 0
                },
                {
                    "sent": "Why not?",
                    "label": 0
                },
                {
                    "sent": "Well, he guess yourself.",
                    "label": 0
                },
                {
                    "sent": "As to why they don't say but.",
                    "label": 0
                },
                {
                    "sent": "Still, Jessica.",
                    "label": 0
                },
                {
                    "sent": "Just go.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For sure.",
                    "label": 0
                },
                {
                    "sent": "This is the one that's closer to my heart because I have relationship with Cisco and.",
                    "label": 0
                },
                {
                    "sent": "As you may have seen in the bottom of my acknowledgments, they've been supporting some of our work, so this is the CEO of system.",
                    "label": 0
                },
                {
                    "sent": "This is an opportunity for the future.",
                    "label": 0
                },
                {
                    "sent": "The handmaids is simple off a single PC screen or you TV's at home for the telepresence units like we've showed you with Professor Kalam and people around the world or think about it virtually with majority of communications will not be voice majority of communications.",
                    "label": 0
                },
                {
                    "sent": "Everybody, English inability is though you're physically in the same location.",
                    "label": 0
                },
                {
                    "sent": "So at this time I would like to be MA Barnaby and trucks to key back from San Jose Martin.",
                    "label": 0
                },
                {
                    "sent": "I'm beating you up now with my special controls.",
                    "label": 0
                },
                {
                    "sent": "How are you doing?",
                    "label": 0
                },
                {
                    "sent": "I'm doing great thank you John.",
                    "label": 0
                },
                {
                    "sent": "Hey guys, you know yesterday morning you look a little bit bigger than me.",
                    "label": 0
                },
                {
                    "sent": "I hope today we're going to play this in sizes and will kind of.",
                    "label": 0
                },
                {
                    "sent": "And how we can make variations on that?",
                    "label": 0
                },
                {
                    "sent": "I will use a job for you.",
                    "label": 0
                },
                {
                    "sent": "It's been a long day here in California.",
                    "label": 0
                },
                {
                    "sent": "You know we were up here at 3:00 AM.",
                    "label": 0
                },
                {
                    "sent": "Our time.",
                    "label": 0
                },
                {
                    "sent": "We're still wearing the same shirt and we had a 5.6 magnitude earthquake about an hour ago, so I'm going to tell you, though, that everything's fine.",
                    "label": 0
                },
                {
                    "sent": "We've had no major damage here in San Jose, and, you know, as a global company with the teams operate, we know it's amazing.",
                    "label": 0
                },
                {
                    "sent": "You can see each other is that we were playing poker.",
                    "label": 0
                },
                {
                    "sent": "I can see you sweat a little bit.",
                    "label": 0
                },
                {
                    "sent": "Update since last time I saw you, but we don't have a sense of smell yet, but it is a good thing.",
                    "label": 0
                },
                {
                    "sent": "So tell me what you have planned for us today and and what is of interest to you.",
                    "label": 0
                },
                {
                    "sent": "Just like I did yesterday.",
                    "label": 0
                },
                {
                    "sent": "I will interject and asking questions and we do this almost like a review in terms of what's on your mind.",
                    "label": 0
                },
                {
                    "sent": "Let me periodically disrupt Martin.",
                    "label": 0
                },
                {
                    "sent": "If you would kind of bring us up to speed you in shock in terms of what's on your mind.",
                    "label": 0
                },
                {
                    "sent": "What's been the acceptance?",
                    "label": 0
                },
                {
                    "sent": "Give us some numbers or something so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We actually talked about in telepresence system.",
                    "label": 0
                },
                {
                    "sent": "They have a successful system called Telepresence, so you may have tried it.",
                    "label": 0
                },
                {
                    "sent": "It is not this thing at all.",
                    "label": 0
                },
                {
                    "sent": "It is several high Resolution HD screens with HD camera is very nice.",
                    "label": 0
                },
                {
                    "sent": "You know how this works?",
                    "label": 0
                },
                {
                    "sent": "So I'll tell you, because there's patents on it.",
                    "label": 0
                },
                {
                    "sent": "The package is by giant thing will be boss is commercialized by Islander.",
                    "label": 0
                },
                {
                    "sent": "It's used in state production, follow in fact it came to in a state production of.",
                    "label": 0
                },
                {
                    "sent": "Shakespeare's The Tempest in our University and.",
                    "label": 0
                },
                {
                    "sent": "It looks great, so here's the way it works.",
                    "label": 0
                },
                {
                    "sent": "This is actually from the first page of the path you take a.",
                    "label": 0
                },
                {
                    "sent": "Angle, half silvered mirror.",
                    "label": 0
                },
                {
                    "sent": "In this case the thing that is special about them is that they don't think they standard fixed mirror.",
                    "label": 0
                },
                {
                    "sent": "They stretch a silver eyes Mylar screen that stretches all the way from the bottom to the top of the stage and to the left and right so you don't see any part of the frame.",
                    "label": 0
                },
                {
                    "sent": "And it is tilted 45 degrees, so that if you, whenever you have is image down here or in fact an object down here, the people in the audience will see it.",
                    "label": 0
                },
                {
                    "sent": "Of course, back here the same distance from here as there.",
                    "label": 0
                },
                {
                    "sent": "So now you have the live performer walking around back here anyway, they want and the virtual people appear if you scale them properly right here on the stage, minus.",
                    "label": 0
                },
                {
                    "sent": "Is out there.",
                    "label": 0
                },
                {
                    "sent": "So how old is this idea?",
                    "label": 0
                },
                {
                    "sent": "Most of you or some of you at least who have studied this as Peppers Ghost Effect circa 1862 in London, just gotten popularized it, but according to Wikipedia, the first known source, at least of them, is a book in 1558.",
                    "label": 0
                },
                {
                    "sent": "1558 and it's an opportunity for the future, and here is what?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It says.",
                    "label": 0
                },
                {
                    "sent": "This is from the English translation in 1658 and I want to quote this because I think it's so cool.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's say we get changed or the flight comes in a only one and then 140 polished that they may be looking glass on both sides.",
                    "label": 0
                },
                {
                    "sent": "Then the spectator must look into it so look into it like this.",
                    "label": 1
                },
                {
                    "sent": "OK and the rest do nothing.",
                    "label": 1
                },
                {
                    "sent": "Let the pictures be set over against this window so he sees this.",
                    "label": 1
                },
                {
                    "sent": "And mobile statue and such for what is without will seem to be within.",
                    "label": 1
                },
                {
                    "sent": "That is what is outside will look to be on the inside.",
                    "label": 0
                },
                {
                    "sent": "OK, and what is behind the spectators bag with the viewers here.",
                    "label": 0
                },
                {
                    "sent": "You know this could be above and behind the viewer.",
                    "label": 1
                },
                {
                    "sent": "He will think will be in the middle of the House, you know, looking into the house as far from the blast inward as they stand from the outward.",
                    "label": 1
                },
                {
                    "sent": "That is the distance of the objects behind the user.",
                    "label": 0
                },
                {
                    "sent": "Two is the same as from the window to the inside.",
                    "label": 0
                },
                {
                    "sent": "So certainly he will think he's nothing but truth.",
                    "label": 0
                },
                {
                    "sent": "K 1558.",
                    "label": 0
                },
                {
                    "sent": "Is this great enough?",
                    "label": 0
                },
                {
                    "sent": "This should be used in all kinds of systems affect the way you get.",
                    "label": 0
                },
                {
                    "sent": "The superposed effect is that you control the lighting here so that you have in fact a a virtual place here.",
                    "label": 0
                },
                {
                    "sent": "That's the same size as the wheel that they look through an if you turn off the light here on the side place, then of course you just see through whatever is on stage and when you turn off the lights then.",
                    "label": 0
                },
                {
                    "sent": "You'll see a portion reflection of this ghost life object in the main stage, because of course you'll see right through it.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have occlusion, so therefore those defects and those computer and move around and can disappear at will is that cleared.",
                    "label": 0
                },
                {
                    "sent": "It's a great magic trick.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here are just really examples.",
                    "label": 0
                },
                {
                    "sent": "In none of these do the participants each other in their own 3D space.",
                    "label": 1
                },
                {
                    "sent": "OK, so we can argue back course they're not holograms, but it's worse than that.",
                    "label": 0
                },
                {
                    "sent": "They don't in fact see each other in their own physicals mix.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "What I think is that a lot of people accept these because they see so much of it and they, I think have one of two or a combination of two attitudes.",
                    "label": 0
                },
                {
                    "sent": "They say.",
                    "label": 0
                },
                {
                    "sent": "Of course it's been done.",
                    "label": 0
                },
                {
                    "sent": "I've seen it in various places.",
                    "label": 0
                },
                {
                    "sent": "Or and or, yes, there's some special effect triplets.",
                    "label": 0
                },
                {
                    "sent": "Hey so.",
                    "label": 0
                },
                {
                    "sent": "But I think away from this is is that in comfort around us as professionals in the area in some ways, like debunking magic mix.",
                    "label": 0
                },
                {
                    "sent": "Hey, this is a serious thing that we're trying to do because it is important for communication does nonverbal, but it's not going to be in my view achieved by these kinds of special effects.",
                    "label": 0
                },
                {
                    "sent": "So let me then spend the rest of the hour talking to you about various things that we and others have done in this quest for the last 20 years or so.",
                    "label": 0
                },
                {
                    "sent": "So we can start.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Lot of different places.",
                    "label": 0
                },
                {
                    "sent": "Let me start with around 20 years ago in 1993 over human eye.",
                    "label": 0
                },
                {
                    "sent": "Really bad.",
                    "label": 0
                },
                {
                    "sent": "CR.",
                    "label": 0
                },
                {
                    "sent": "On my slide, this actually has all kinds of space.",
                    "label": 0
                },
                {
                    "sent": "Here all the human I upvoted vision of telepresence for medical consultation or verifications, we thought that you couldn't just start with an application like just we're talking like a telephone needs to start with an application that has high value for each hour that you're going to use.",
                    "label": 1
                },
                {
                    "sent": "And so we thought that remote surgical consultation with either and here we this is Andres copies.",
                    "label": 0
                },
                {
                    "sent": "Join any of.",
                    "label": 0
                },
                {
                    "sent": "You will recognize his drawings, one of our colleagues, and the ones that are ghosts because sort of see them.",
                    "label": 0
                },
                {
                    "sent": "These two are those are the remote consultants and we thought if you miss the local one and they are each wearing head worn displays so that they can each get a custom view of where they are above the local space and the remote.",
                    "label": 1
                },
                {
                    "sent": "And what we said was that we have a bunch of cameras.",
                    "label": 0
                },
                {
                    "sent": "Indeed, policy or cameras all around the place that could then reconstruct each one of the three places and send it to the other.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1990 Three 1994 problem was, as you got another family member and we gotta remember, we couldn't really do real time reconstruction with multiple cameras, so we thought we could start with something that already had 3D and the thing that we already had 3D was some kind of medical surgical sensors like real time ultrasound.",
                    "label": 0
                },
                {
                    "sent": "So here is our first experiment with doing augmented reality with head mounted.",
                    "label": 0
                },
                {
                    "sent": "Display seeing the data inside.",
                    "label": 0
                },
                {
                    "sent": "The patient, so this is the leader.",
                    "label": 0
                },
                {
                    "sent": "This is adopted as a leader of a breast imaging and this is one of her patients and she is going to do a biopsy of some part of this suspicious lesion and this is the image that she sees in her head match.",
                    "label": 0
                },
                {
                    "sent": "So notice she plays a stereo.",
                    "label": 0
                },
                {
                    "sent": "Cameras.",
                    "label": 0
                },
                {
                    "sent": "This is the standard commercial ultrasound machine.",
                    "label": 0
                },
                {
                    "sent": "And you could see here is.",
                    "label": 0
                },
                {
                    "sent": "The image that comes and this is life size.",
                    "label": 0
                },
                {
                    "sent": "Being put back into the patient.",
                    "label": 0
                },
                {
                    "sent": "You could see the illusion that we want here is that if there is like in any empty, or if it's in the patient, sort of like an empty swimming pool.",
                    "label": 0
                },
                {
                    "sent": "So we could put the data back in the patient where it belongs and she could determine that here.",
                    "label": 0
                },
                {
                    "sent": "In fact is where she wants to insert needle and so this is already in the procedure.",
                    "label": 0
                },
                {
                    "sent": "Can see she's not wearing gloves yet, so she just wants to get an idea of where she wants to make her entrance knew and so right here she's going to 1st inject the patient with local.",
                    "label": 0
                },
                {
                    "sent": "Setting.",
                    "label": 0
                },
                {
                    "sent": "Hey, we can see how you could combine the real and virtual with this in three dimensions.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are the lessons learned from this?",
                    "label": 1
                },
                {
                    "sent": "The settings, by the way, on the projector are different than the West.",
                    "label": 0
                },
                {
                    "sent": "So we should all learn this.",
                    "label": 0
                },
                {
                    "sent": "It was not over some interesting.",
                    "label": 0
                },
                {
                    "sent": "Somebody is here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, somebody's here.",
                    "label": 0
                },
                {
                    "sent": "Somebody take out the older scan for this.",
                    "label": 0
                },
                {
                    "sent": "OK, this is this is overscanning.",
                    "label": 0
                },
                {
                    "sent": "It was not sit down.",
                    "label": 0
                },
                {
                    "sent": "If not, we'll just have to.",
                    "label": 0
                },
                {
                    "sent": "Trying to extrapolate here, so here are the lessons learned from that experiment almost 20 years ago.",
                    "label": 0
                },
                {
                    "sent": "Video see through at math is more useful in office.",
                    "label": 0
                },
                {
                    "sent": "Augmentation a ghost.",
                    "label": 0
                },
                {
                    "sent": "They were certain augmentation.",
                    "label": 0
                },
                {
                    "sent": "For instance, the physician wants to see every bit of that data innovation and if we made that augmentation be both, she wouldn't be able to see it very well because you will see the patient skin coming right through.",
                    "label": 0
                },
                {
                    "sent": "Is that weird?",
                    "label": 0
                },
                {
                    "sent": "So we develop video, see through head mouse?",
                    "label": 0
                },
                {
                    "sent": "It turns out that they need to be because these are very close manipulations.",
                    "label": 0
                },
                {
                    "sent": "They need to be at the same focal point as the eye.",
                    "label": 0
                },
                {
                    "sent": "That means you need to have complicated folded optics so that what she sees with her eye through the camera is in the same point of view as we make it up there.",
                    "label": 1
                },
                {
                    "sent": "Turns out wide field of view is really difficult to achieve and So what we did is we only augmented a very narrow field of view that the surgical site and left everything to be open so she would see the rest of the world around that and she will see her hand.",
                    "label": 1
                },
                {
                    "sent": "She will see her nurse assistant should see everything else except in the central field of view where the fridge for science courses she looked up.",
                    "label": 1
                },
                {
                    "sent": "She will see anybody with the video came through.",
                    "label": 0
                },
                {
                    "sent": "And we did the proper composition of Z base.",
                    "label": 0
                },
                {
                    "sent": "As the base closure, I contacted Video Seafood.",
                    "label": 0
                },
                {
                    "sent": "Turns out with really him 'cause we're going to happen is if we look at her she could look at us.",
                    "label": 0
                },
                {
                    "sent": "So we looked at her.",
                    "label": 0
                },
                {
                    "sent": "We apparently saw her eyes, but were in fact we saw with a tiny cameras.",
                    "label": 0
                },
                {
                    "sent": "It does the camera coffee in the same location as her off.",
                    "label": 0
                },
                {
                    "sent": "So it was Erie together.",
                    "label": 0
                },
                {
                    "sent": "Allusion that we're looking at her, but we don't really see her eyes is that there seems to be.",
                    "label": 0
                },
                {
                    "sent": "That's one of the things that.",
                    "label": 0
                },
                {
                    "sent": "A really serious problem 'cause I contact.",
                    "label": 0
                },
                {
                    "sent": "We know from experience that.",
                    "label": 0
                },
                {
                    "sent": "Informal and also from user studies that I contact is really important and really difficult to achieve.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So 3D.",
                    "label": 0
                },
                {
                    "sent": "It was so frustrating by about 2000 that we thought we do is.",
                    "label": 0
                },
                {
                    "sent": "Bing far or build a scanning system that was optimized for rooms and one of the researchers large Nile and built one of these out of time of flight laser and some mirrors camera and that was good enough so that small company third check has been commercializing it.",
                    "label": 0
                },
                {
                    "sent": "You can get it if you like and these are the kind of reconstructions that could be done with several scans in the room and then some manual manipulation combined.",
                    "label": 0
                },
                {
                    "sent": "Free skins, but you get a very nice cat and this was sort of ghost and that we had in search for 2000.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is what we're able to do.",
                    "label": 0
                },
                {
                    "sent": "We're able to give you the illusion.",
                    "label": 0
                },
                {
                    "sent": "Here is a scan of an office, and then we only had to reconstruct live.",
                    "label": 0
                },
                {
                    "sent": "The person who was sitting there.",
                    "label": 0
                },
                {
                    "sent": "Exactly so.",
                    "label": 0
                },
                {
                    "sent": "What we did is we went away from him out of this place because we couldn't figure out how to build one that would give you eye contact in my field of view, we went to conventional stereo projectors and headtracking and.",
                    "label": 0
                },
                {
                    "sent": "What we did for reconstruction is this hybrid of scanning the room before the session, and then just reconstructing live with something like 9 cameras.",
                    "label": 0
                },
                {
                    "sent": "The person who's doing interaction and this is done.",
                    "label": 0
                },
                {
                    "sent": "As part of the National Television Initiative funded by advanced networking Services, Brown University, UNC and University, Pennsylvania.",
                    "label": 0
                },
                {
                    "sent": "In fact, much of the credit goes to Pennsylvania for doing all this reconstruction.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Laser scanner told you about that.",
                    "label": 0
                },
                {
                    "sent": "Guys get back.",
                    "label": 0
                },
                {
                    "sent": "Auto check I just want to show you a little bit of this to give you a feeling that we now have a continuation of your office here in the other office next and when I first tried it on the person who was not part of our project but head of video teleconferencing and color fashions in the University.",
                    "label": 0
                },
                {
                    "sent": "He described it in a way that was normal.",
                    "label": 0
                },
                {
                    "sent": "He said it looked like somebody took a chainsaw, incur hole in wall and we're looking at the other side of the other office.",
                    "label": 0
                },
                {
                    "sent": "And that was just what we're trying to do.",
                    "label": 0
                },
                {
                    "sent": "That is that this person, even though she was 1000 kilometers away, that we had the feeling that we were in adjacent offices in just she was on the other side of the desk.",
                    "label": 0
                },
                {
                    "sent": "So that is the major thing that was popular and learning that.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "The hole in the wall was very appealing.",
                    "label": 1
                },
                {
                    "sent": "Everybody that the displays were expensive to scale up for multiple users.",
                    "label": 0
                },
                {
                    "sent": "This was the standard.",
                    "label": 0
                },
                {
                    "sent": "Twin projectors with passive passive glasses.",
                    "label": 0
                },
                {
                    "sent": "But as you all know, getting that to go through more than a single person is really difficult and.",
                    "label": 1
                },
                {
                    "sent": "Specially that time and the acquisition needs to be much better in the calibration.",
                    "label": 0
                },
                {
                    "sent": "More compute power desperately needed.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "He said if this is so hard to do 3D, maybe what you could do is do something better for multiple people with large scale 2D and get maybe 80% of the way so.",
                    "label": 0
                },
                {
                    "sent": "What we have been doing and I'll tell you about this for some time is.",
                    "label": 0
                },
                {
                    "sent": "Trying to see how we could improve the current best so called telepresence systems.",
                    "label": 0
                },
                {
                    "sent": "So here are the limitations, so I should remind you again that I'm hopeless device with that.",
                    "label": 0
                },
                {
                    "sent": "When working with people system, I think that they're really great, but here's what I think and most people agree is a limitation of these and most other current commercial systems in really have poor eye contact.",
                    "label": 1
                },
                {
                    "sent": "That is, this system is the same.",
                    "label": 0
                },
                {
                    "sent": "Is the one on the other side, that is, it has three screens and each one has room for two people, so these two are once made.",
                    "label": 0
                },
                {
                    "sent": "These two are knows maybe structures that there and then there are three cameras in this cluster here, 1 going to each one of the two people and those three cameras go to three displays that are in the other room.",
                    "label": 1
                },
                {
                    "sent": "Now think about what happens with eye contact.",
                    "label": 0
                },
                {
                    "sent": "If a person, say, say, that person is looking at this person here.",
                    "label": 1
                },
                {
                    "sent": "The people over here see that he's looking over to our left.",
                    "label": 0
                },
                {
                    "sent": "This person sees are looking at are left, but 'cause everybody is looking at the same image.",
                    "label": 0
                },
                {
                    "sent": "Of course in 2D display this person also the person he's looking at.",
                    "label": 0
                },
                {
                    "sent": "Perhaps the most important person with high contact thinks he's not looking at it.",
                    "label": 0
                },
                {
                    "sent": "He thinks he's with the office is left in this empty chair.",
                    "label": 0
                },
                {
                    "sent": "So really, uncanny.",
                    "label": 0
                },
                {
                    "sent": "Affect and So what?",
                    "label": 0
                },
                {
                    "sent": "People have been trained to do so my colleagues and industry say, especially salespeople, is when they're talking to customers.",
                    "label": 0
                },
                {
                    "sent": "It cold don't look at the people.",
                    "label": 0
                },
                {
                    "sent": "Look at the camera.",
                    "label": 0
                },
                {
                    "sent": "Don't look at the people.",
                    "label": 0
                },
                {
                    "sent": "Look at the camera 'cause then it looks like you're looking straight ahead into all these people and you get the Mona Lisa affective.",
                    "label": 0
                },
                {
                    "sent": "Everybody thinks you're looking at.",
                    "label": 0
                },
                {
                    "sent": "So if you want to make a sales pitch, what you do is a normal people just look at the camera.",
                    "label": 0
                },
                {
                    "sent": "All right now, but we you know we really wanted to fix that.",
                    "label": 0
                },
                {
                    "sent": "The other thing that's unfortunate is is very low spot made.",
                    "label": 0
                },
                {
                    "sent": "That is, you can't.",
                    "label": 1
                },
                {
                    "sent": "Oh sorry, you can move around.",
                    "label": 0
                },
                {
                    "sent": "OK, you can't move around because quote.",
                    "label": 0
                },
                {
                    "sent": "Hold on.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm gonna just try to use the laser pointer carefully, OK?",
                    "label": 0
                },
                {
                    "sent": "So here's why.",
                    "label": 0
                },
                {
                    "sent": "It's not very spontaneous.",
                    "label": 0
                },
                {
                    "sent": "You see how these things fit just about the seating position here.",
                    "label": 0
                },
                {
                    "sent": "That's to optimize the pixel in the area.",
                    "label": 0
                },
                {
                    "sent": "If you want to, for example, go to the board right here and write something what happens.",
                    "label": 0
                },
                {
                    "sent": "They don't see here now.",
                    "label": 0
                },
                {
                    "sent": "Will say oh we'll give you a special software you could write on some laptop and then we'll show it below here on the screen.",
                    "label": 0
                },
                {
                    "sent": "Just like your slides.",
                    "label": 0
                },
                {
                    "sent": "But you know, you gotta use special software.",
                    "label": 0
                },
                {
                    "sent": "You can't just scribble on board right?",
                    "label": 0
                },
                {
                    "sent": "In fact, you can't even just come in the room and sit down where you want.",
                    "label": 0
                },
                {
                    "sent": "It.",
                    "label": 0
                },
                {
                    "sent": "Turns out that if you will sit down anywhere you want, you might accidentally.",
                    "label": 0
                },
                {
                    "sent": "Inadvertently sit, say right there.",
                    "label": 0
                },
                {
                    "sent": "But you don't see it right here, but if you sit between these two people, but you move your chair to it, but you will be seeing on the other side is right in the gap as they will not see.",
                    "label": 0
                },
                {
                    "sent": "How they solve this problem?",
                    "label": 0
                },
                {
                    "sent": "They put a layer of the desk right there in the gap so you will not be able to sit there unless you are willing to be uncomfortable.",
                    "label": 0
                },
                {
                    "sent": "But if there are seven people and not six came on, it is no seven seats.",
                    "label": 0
                },
                {
                    "sent": "Instead.",
                    "label": 0
                },
                {
                    "sent": "So how do you overcome this?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's what we'd like to do.",
                    "label": 0
                },
                {
                    "sent": "Would like to do the best possible view multiple people in each room with a 2D display wall.",
                    "label": 1
                },
                {
                    "sent": "That is what can we do with current Rudy displays?",
                    "label": 0
                },
                {
                    "sent": "We can't wait for the best photographic displays.",
                    "label": 0
                },
                {
                    "sent": "And can we get some sort of casual awareness that is in addition to just meetings?",
                    "label": 0
                },
                {
                    "sent": "If this thing works off?",
                    "label": 0
                },
                {
                    "sent": "24/7 it might be used for some casual encounters and many groups around the world over the last 30 years.",
                    "label": 0
                },
                {
                    "sent": "Have you video walls for these casual accounts?",
                    "label": 0
                },
                {
                    "sent": "What can you do with that if you support it?",
                    "label": 0
                },
                {
                    "sent": "Life size if you get eye contact among all these people.",
                    "label": 0
                },
                {
                    "sent": "The short answer is you can't do everything, but you can do something.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's what we'd like to do.",
                    "label": 0
                },
                {
                    "sent": "We'd like to get the illusion just like we had before, that there is a big hole in the wall.",
                    "label": 0
                },
                {
                    "sent": "So here is a Panorama of the other room, and we took this in a very wide field of view so that you could see how big is this is actually.",
                    "label": 1
                },
                {
                    "sent": "15 or 16 feet so you can get some idea you know this is life size and we put a cluster of cameras in the middle of each rooms display.",
                    "label": 1
                },
                {
                    "sent": "So what you have is a room 1 here room through there just like you had in the individual desk.",
                    "label": 0
                },
                {
                    "sent": "But now you scale it up to say size of a small meet their size of a room in which people might take their coffee or tea break and just have casual encounters.",
                    "label": 0
                },
                {
                    "sent": "So then what you have is a row of displays here.",
                    "label": 0
                },
                {
                    "sent": "An cluster of cameras and A roll of this place here in Custer cameras, and of course, the red cameras here in the Red room.",
                    "label": 0
                },
                {
                    "sent": "Each go to one of the blue displays in the zoom room and four blue cameras, each one of them goes to one of the red displacing written down there.",
                    "label": 0
                },
                {
                    "sent": "That seems like that would be something you could do in a weekend.",
                    "label": 0
                },
                {
                    "sent": "Turns out there is one or two problems with it.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st is.",
                    "label": 0
                },
                {
                    "sent": "That we like to show people life size.",
                    "label": 1
                },
                {
                    "sent": "So we found the way we want to model this is that.",
                    "label": 0
                },
                {
                    "sent": "When you're talking to somebody.",
                    "label": 0
                },
                {
                    "sent": "If in addition to casually encountering them, you are just walking up to the screen when you get to a distance that you're comfortable with that we'd love to have it so that when you go through that comfortable region, which is a 1 to 1 1/2 meters that you'll see the person life size and LCU life size.",
                    "label": 0
                },
                {
                    "sent": "So the way we want to model this is not that the two rooms are next to each other, but in fact that they overlap by the comfort distance.",
                    "label": 0
                },
                {
                    "sent": "So that at the at the comfort distance here, when there's a blue camera, it will take a picture of this blue person, send it to the red display and the red person will see in the red room the blue person life socks, and similarly the blue person will see the red person.",
                    "label": 0
                },
                {
                    "sent": "Life sucks.",
                    "label": 0
                },
                {
                    "sent": "So that was great.",
                    "label": 0
                },
                {
                    "sent": "Here is the part that doesn't work.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Facebook again.",
                    "label": 0
                },
                {
                    "sent": "I gave is off.",
                    "label": 0
                },
                {
                    "sent": "Hey, it's especially severe when the panels are not are going to bed once and is caused by the fact that the cameras are in this cluster.",
                    "label": 1
                },
                {
                    "sent": "That is why I have a nice Panorama.",
                    "label": 1
                },
                {
                    "sent": "But that means that they are aimed at the person not spayed on, but in an empty like 25 degrees.",
                    "label": 1
                },
                {
                    "sent": "So again you have this affect life in the commercial systems that the person that you want to talk to.",
                    "label": 0
                },
                {
                    "sent": "Most things that you're looking away from it.",
                    "label": 0
                },
                {
                    "sent": "OK, so here's the way we propose to fix that.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we do is.",
                    "label": 0
                },
                {
                    "sent": "Will add a second account.",
                    "label": 1
                },
                {
                    "sent": "Now I know we don't want to pay for more family court cameras and cheap and now what we'll do is we'll put the second set of cameras going straight forward in there, just in the right place for casual conversation.",
                    "label": 1
                },
                {
                    "sent": "OK, and then what we need to do.",
                    "label": 0
                },
                {
                    "sent": "So here is for example.",
                    "label": 0
                },
                {
                    "sent": "The one the camera do we get of this person when they're just standing there to see it from the side and.",
                    "label": 0
                },
                {
                    "sent": "For the so called personal account that look straight ahead, we get very nice straight ahead of you.",
                    "label": 0
                },
                {
                    "sent": "So if there's somebody talking from here, they will get very nice.",
                    "label": 0
                },
                {
                    "sent": "I can't.",
                    "label": 0
                },
                {
                    "sent": "OK, so the only problem that remains is.",
                    "label": 0
                },
                {
                    "sent": "What do we substitute?",
                    "label": 1
                },
                {
                    "sent": "The first thing you say is, well, what we do is we will substitute these nice personal cameras when somebody is looking from here and not use the panoramic.",
                    "label": 0
                },
                {
                    "sent": "The problem with that is that this camera view of course goes out as of course they will do and that means that as you get to objects and people that are farther away, you'll get them duplicated from your personal camera.",
                    "label": 0
                },
                {
                    "sent": "Here the panoramic camera that mean so here is.",
                    "label": 0
                },
                {
                    "sent": "You know the next panoramic camera that is displaying on this red screen and if you have somebody or something over here then you will get the duplication of the personal camera here and in the red display.",
                    "label": 0
                },
                {
                    "sent": "And the panoramic camera in the next displayed here is out there and that was really bad.",
                    "label": 0
                },
                {
                    "sent": "Somebody is walking across and you see them duplicated.",
                    "label": 0
                },
                {
                    "sent": "You is a very disturbing attract, so here's what we.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We said so.",
                    "label": 0
                },
                {
                    "sent": "We say all we want to do is take this person's image there pixels out of the camera that we really want to see them from, but the rest of the background or whatever is there.",
                    "label": 0
                },
                {
                    "sent": "We want to use the nice Panorama.",
                    "label": 0
                },
                {
                    "sent": "So what it takes is basically the same in both of them and then taking them out of the one from the Panorama.",
                    "label": 0
                },
                {
                    "sent": "Taking and removing only them from the personal one and then putting it.",
                    "label": 0
                },
                {
                    "sent": "Back on top.",
                    "label": 0
                },
                {
                    "sent": "Jarvis.",
                    "label": 0
                },
                {
                    "sent": "Good Sunday night.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey, is the little problem with that.",
                    "label": 0
                },
                {
                    "sent": "It turns out, of course, that there are different pixels that the person covers in each of these cameras, and so they'll be pixels.",
                    "label": 0
                },
                {
                    "sent": "For example, right here that were of this person in the nice foster Panorama.",
                    "label": 0
                },
                {
                    "sent": "But they're not in this person for whatever reason in the personal camera.",
                    "label": 0
                },
                {
                    "sent": "So you gotta do is fill them in with something and we fill them in with some 3D points that we extract and fill them in with whatever was in those pixels before the session starts.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me show you what this looks like in action.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is.",
                    "label": 0
                },
                {
                    "sent": "What happens when you see before the Panorama view?",
                    "label": 1
                },
                {
                    "sent": "And here is what it looks like?",
                    "label": 0
                },
                {
                    "sent": "The same with just cutting out the person from the secondary camera and pay statement OK?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simply put.",
                    "label": 0
                },
                {
                    "sent": "You don't need to.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where are we right now?",
                    "label": 0
                },
                {
                    "sent": "I had another.",
                    "label": 0
                },
                {
                    "sent": "15 minutes, right?",
                    "label": 0
                },
                {
                    "sent": "At least I can tell you about a few more things.",
                    "label": 0
                },
                {
                    "sent": "Where are we in 2012, twenty years after we started?",
                    "label": 0
                },
                {
                    "sent": "Here is where I think we are.",
                    "label": 0
                },
                {
                    "sent": "We have acquisition using multiple DEF cameras and we have displays using better multi viewer auto stereos.",
                    "label": 0
                },
                {
                    "sent": "So I want to tell you about those things.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Auto stereo display choices.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "Everybody says, why don't you just use a hologram?",
                    "label": 0
                },
                {
                    "sent": "And the answer is we can't get one that's the size of a wall and we can get one that we could update in real time so.",
                    "label": 0
                },
                {
                    "sent": "When you guys get money for us will use it, but so far we can't get it and So what choice do we have this left?",
                    "label": 0
                },
                {
                    "sent": "They are derived from bio metric displays, usually based on spinning or vibrating things and they tend to be of a small volume which is nice for a head or something like that, but not for a whole room full of people.",
                    "label": 0
                },
                {
                    "sent": "Then there are various various business.",
                    "label": 0
                },
                {
                    "sent": "Please pack my favorite ones that, by Doug Landman at MIT.",
                    "label": 0
                },
                {
                    "sent": "And there are various lenticular lens that displays.",
                    "label": 0
                },
                {
                    "sent": "Basically, here's the problem that you have.",
                    "label": 0
                },
                {
                    "sent": "In a 2D display.",
                    "label": 0
                },
                {
                    "sent": "No matter where you're looking at it, you get the same color for every angle, right?",
                    "label": 0
                },
                {
                    "sent": "So This is why everybody looking at the image of that person is going to see the exact same thing and what you need, fundamentally is for the different angles to have different colors so that people looking from here they see the red.",
                    "label": 0
                },
                {
                    "sent": "Patrick, that's back here and people looking at that same pixel from you on the right.",
                    "label": 0
                },
                {
                    "sent": "See the Queen optic test.",
                    "label": 0
                },
                {
                    "sent": "Actually, that's fundamentally what you need.",
                    "label": 0
                },
                {
                    "sent": "There's no getting around the fact that you need to have different colors, different angles in the same location.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is a simple idea that we've been working on.",
                    "label": 0
                },
                {
                    "sent": "The way that both ball commercial system do this now is by a barrier, and that's again one of these ideas has been around for many, many years.",
                    "label": 0
                },
                {
                    "sent": "You take a conventional display of any kind.",
                    "label": 0
                },
                {
                    "sent": "In fact, it could be some of the imprint.",
                    "label": 0
                },
                {
                    "sent": "If you don't want to change it and you put a barrier in front of it with some openings at a small fraction of the area, right 110%.",
                    "label": 0
                },
                {
                    "sent": "OK, and you could vary the spacing.",
                    "label": 0
                },
                {
                    "sent": "You can vary the size, you can vary the distance, but to give you some idea, this might be something say like half a centimeter in.",
                    "label": 0
                },
                {
                    "sent": "This might be the size of 1 from pixels and so why don't you pixel gap?",
                    "label": 0
                },
                {
                    "sent": "And then you'll have say seven or eight pixels black and you could just take one of these as a photographic print that you make on your leg or something else is out there.",
                    "label": 0
                },
                {
                    "sent": "So those who have done this you could do it at home.",
                    "label": 0
                },
                {
                    "sent": "OK, now.",
                    "label": 0
                },
                {
                    "sent": "This works well for entertainment because what you can do is you can calculate if these things are saying uniform.",
                    "label": 0
                },
                {
                    "sent": "Say that one is a one in 10 is that you say, and this particular location.",
                    "label": 0
                },
                {
                    "sent": "I'm going to see 110th of the pixels, say pixel one Pixel, 11 Pixel, 21 Pixel, 3 lines for 41 sold out there, and then if I move over a little bit more then I'll see pixel two Pixel, 12 pixel, whatever 22.",
                    "label": 0
                },
                {
                    "sent": "So 3240 right?",
                    "label": 0
                },
                {
                    "sent": "And so you if you move over and you know you could, depending on the geometry that you could have this be something like, say, 2 centimeters.",
                    "label": 0
                },
                {
                    "sent": "So every 2 centimeters you see a different set of fixes.",
                    "label": 0
                },
                {
                    "sent": "The problem is that once you get 10 spaces over, you start seeing the same pixels.",
                    "label": 0
                },
                {
                    "sent": "And that might be OK for payment if you're just in a supermarket and you're seeing an advertisement for Coca Cola and you see these Coca Cola bottles dancing around, it's perfectly OK that you see the same ones if you move over $0.20, right?",
                    "label": 0
                },
                {
                    "sent": "But if you're trying to get Telepresence, it's not good, because then if you go over 20 centimeters, you see the same person when you see him twisted once more, the next person sitting next to you says sees the same 8 or 10 images, right?",
                    "label": 0
                },
                {
                    "sent": "So?",
                    "label": 0
                },
                {
                    "sent": "This doesn't work exactly.",
                    "label": 0
                },
                {
                    "sent": "Log in the back, so here is a simple partial solution in fact.",
                    "label": 0
                },
                {
                    "sent": "So take this same exact setup, just vary the holes random.",
                    "label": 0
                },
                {
                    "sent": "OK, so instead of having it be 1 pixel opening and then 10 and then another pixel opening an intent, just say OK, I'll have one here and then 13 here instead.",
                    "label": 0
                },
                {
                    "sent": "And then two and then 17 where so the same percentage of holes that same one in 10 but you just do it better.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "What that means is that any of you will see the same will see the same percentage of pixels but entirely different substance.",
                    "label": 0
                },
                {
                    "sent": "Delsea random subset and person over here will see another random subset and in different places they'll see different substance.",
                    "label": 0
                },
                {
                    "sent": "Now of course there will be some overlaps.",
                    "label": 0
                },
                {
                    "sent": "They'll be my say official right here that through this gap.",
                    "label": 0
                },
                {
                    "sent": "Your one will see it in through another gap.",
                    "label": 0
                },
                {
                    "sent": "Google tools.",
                    "label": 0
                },
                {
                    "sent": "OK, but you have the following kind of behavior.",
                    "label": 0
                },
                {
                    "sent": "If you plot say you have one viewer in the center and you have another viewer that moves back and forth.",
                    "label": 0
                },
                {
                    "sent": "And if you flock here.",
                    "label": 0
                },
                {
                    "sent": "Vertically, how many pixels you get collisions.",
                    "label": 0
                },
                {
                    "sent": "What will happen is that you get collisions in about 110th of 1 tenant.",
                    "label": 0
                },
                {
                    "sent": "You'll get a couple of percentage of the pixels that they'll be collisions.",
                    "label": 0
                },
                {
                    "sent": "And then of course, if you are running behind the person, you'll get total collisions.",
                    "label": 0
                },
                {
                    "sent": "Visual seats after the same ones.",
                    "label": 0
                },
                {
                    "sent": "If you exactly the same place, but most of the time you will get the same amount of collisions, whereas if you do the same plot for the conventional ones, that is if you say I'm going to have the viewer one.",
                    "label": 0
                },
                {
                    "sent": "Or say we were to say right now, if you are one who's bad 4th what will happen is that every once in awhile, like every 10 spaces, you'll get terrible versions because you'll see the same pixels an in between.",
                    "label": 0
                },
                {
                    "sent": "You get help versions so you get these trucks which is great and that these piece, which apparently they will see just about the same pixels on time rather than having the same low percentage of collisions all the time.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me show you how that works.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tabletop stereoscopic display for multiple users and techniques for real time rendering on it.",
                    "label": 0
                },
                {
                    "sent": "Previous autostereo displays typically supported visual motion in only a single axis.",
                    "label": 0
                },
                {
                    "sent": "Our technology allows the viewer to move anywhere with respect to the display.",
                    "label": 0
                },
                {
                    "sent": "The viewers eyes must be tracked, but no special glasses are needed for stereoscopic viewing.",
                    "label": 0
                },
                {
                    "sent": "The display support multiple simultaneous users.",
                    "label": 0
                },
                {
                    "sent": "To demonstrate this capability, we can fill our display with two traffic cameras and chill both views at the same time.",
                    "label": 0
                },
                {
                    "sent": "Do you understand the significance of that?",
                    "label": 0
                },
                {
                    "sent": "So this was recorded at the same exact time with two counters, so we were seeing is at the same instant.",
                    "label": 0
                },
                {
                    "sent": "One camera sees this from, you know this point of view and another camera sees that from this point.",
                    "label": 0
                },
                {
                    "sent": "Few more seconds of this one.",
                    "label": 0
                },
                {
                    "sent": "It didn't get.",
                    "label": 0
                },
                {
                    "sent": "Alright, I'm not gonna show you anymore.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so let me show you some more things.",
                    "label": 0
                },
                {
                    "sent": "So with that shows I believe is that it is possible to get and this is a standard off the shelf LCD with just a random set of holes in it on the barrier.",
                    "label": 0
                },
                {
                    "sent": "So it is possible to get two or three different views like this guy.",
                    "label": 0
                },
                {
                    "sent": "Say it louder.",
                    "label": 0
                },
                {
                    "sent": "How do you print out available?",
                    "label": 0
                },
                {
                    "sent": "So how do you have related?",
                    "label": 0
                },
                {
                    "sent": "It's just a standard for some distribution.",
                    "label": 0
                },
                {
                    "sent": "You know you say one of you know 4 by 4.",
                    "label": 0
                },
                {
                    "sent": "You picked one pixel and then you go to the next one and pick another study.",
                    "label": 0
                },
                {
                    "sent": "It's very simple algorithm.",
                    "label": 0
                },
                {
                    "sent": "People use all the time.",
                    "label": 0
                },
                {
                    "sent": "How do you print it out?",
                    "label": 0
                },
                {
                    "sent": "You go to a company that make mask.",
                    "label": 0
                },
                {
                    "sent": "At least that's what we did.",
                    "label": 0
                },
                {
                    "sent": "Company that makes masks for printed circuit boards and they used to making friends circuit boards that are couple of feet on the side for.",
                    "label": 0
                },
                {
                    "sent": "$70.00 or so, they'll make really beautiful masks.",
                    "label": 0
                },
                {
                    "sent": "So we try unrelated printer.",
                    "label": 0
                },
                {
                    "sent": "You don't get some good glass or should clear.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now model generation.",
                    "label": 0
                },
                {
                    "sent": "You probably all know that the best thing since sliced bread or these cheap depth cameras by Consense and Microsoft Local Connect, is there anybody who hasn't bought 1 yet?",
                    "label": 0
                },
                {
                    "sent": "We should go out, spend $150 and you will not regret it.",
                    "label": 0
                },
                {
                    "sent": "They are the best thing since sliced bread and I have no financial interest in them.",
                    "label": 0
                },
                {
                    "sent": "But it is amazing.",
                    "label": 0
                },
                {
                    "sent": "For $150 you get a reasonable color and you get depth.",
                    "label": 0
                },
                {
                    "sent": "You get depth down to you know, but after centimeters 30 frames a second and no outliers, it's really beautiful.",
                    "label": 0
                },
                {
                    "sent": "OK, So what they have in the IS?",
                    "label": 0
                },
                {
                    "sent": "Just for the few of you, they don't have them yet.",
                    "label": 0
                },
                {
                    "sent": "They had two cameras.",
                    "label": 0
                },
                {
                    "sent": "The standard CMOS RGB camera, an infrared camera, and this is the secret.",
                    "label": 0
                },
                {
                    "sent": "Truth is they have a laser projector laser diode projector that projects a series of dots.",
                    "label": 0
                },
                {
                    "sent": "Patterns have been carefully calibrated and then the system inside looks at the IR image 3 times per second.",
                    "label": 0
                },
                {
                    "sent": "And then calculate suit correlation and other techniques.",
                    "label": 0
                },
                {
                    "sent": "What the likely depth is adapted for pixel and then puts it into the space of the color camera.",
                    "label": 1
                },
                {
                    "sent": "So you get out is death for each color pixel.",
                    "label": 0
                },
                {
                    "sent": "OK, now.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Great thing about that so you get it.",
                    "label": 0
                },
                {
                    "sent": "You plug it in, it works.",
                    "label": 0
                },
                {
                    "sent": "There are a couple of problems.",
                    "label": 0
                },
                {
                    "sent": "The major problem is if you want to use multiple of them simultaneously, like you want to capture a few people because you got a small room.",
                    "label": 0
                },
                {
                    "sent": "They don't work very well and the reason is they weren't made to work.",
                    "label": 0
                },
                {
                    "sent": "They were made to work as a gaming accessory for single person.",
                    "label": 0
                },
                {
                    "sent": "The reason technically they don't work is that the projected IR pattern is of course the same in every one of the cameras and so if you have two of them that happened to hit the same surface then that surface is not going to get very good results because.",
                    "label": 0
                },
                {
                    "sent": "The cross correlation techniques you know get confused that there so then, but you needed to capture the entire room little time, so it's not like we have mentioned the choice.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "This is one of those things how many have seen the really beautiful results from Microsoft Cambridge on Connect Fusion.",
                    "label": 0
                },
                {
                    "sent": "I hope.",
                    "label": 0
                },
                {
                    "sent": "OK, those that haven't seen it look up connect Fusion in Google.",
                    "label": 0
                },
                {
                    "sent": "It is the best thing from connect.",
                    "label": 0
                },
                {
                    "sent": "I mean is best thing ever done for they could just take a scan, a single connect and they'll just slowly scan whatever it is and they will put it into a nice volume based on acrylics and avoid 1996 paper and.",
                    "label": 0
                },
                {
                    "sent": "It looks really lovely and you would think.",
                    "label": 0
                },
                {
                    "sent": "Why can't we just use one of those?",
                    "label": 0
                },
                {
                    "sent": "We could just impact there.",
                    "label": 0
                },
                {
                    "sent": "Now open source our versions of the code and the reason we can't use it is that the IR pattern you know from each connect OK will confuse the deposition system and it's worse.",
                    "label": 0
                },
                {
                    "sent": "Pay the surface of course observed by few connection scans.",
                    "label": 0
                },
                {
                    "sent": "So this is a different thing.",
                    "label": 0
                },
                {
                    "sent": "I want to explain to you when you have fixed you want to do a whole room, you need to have like a dozen connect you know carefully set now versus one of them.",
                    "label": 0
                },
                {
                    "sent": "If you have just one of them, you moving it around for that particular surface, you're going to get lots of different angles that you get that particular detail, so you could combine.",
                    "label": 0
                },
                {
                    "sent": "Those 510 fifteen 2050 frames because you're there for a second.",
                    "label": 0
                },
                {
                    "sent": "It is that clear now if you are having a whole room, you're scanning in real time.",
                    "label": 0
                },
                {
                    "sent": "You have fixed connects and any particular surface may only be hit by two or three or four connects and those are fixed.",
                    "label": 0
                },
                {
                    "sent": "They won't get any angles in between, and so it doesn't get as much good data.",
                    "label": 0
                },
                {
                    "sent": "K. Is once you get about 10, what you're getting is a lot of video footage, because each one has a color in a death screen coming at him, so you got like 20 streams coming at you and even the best PC's have difficulty with 20 streams, and so you say, why don't we divide it into like four or five PC's, but the problem there is that if you want to do that then you have difficulty that the distributed gather this scatter and gather.",
                    "label": 0
                },
                {
                    "sent": "Problems tend to be really difficult in real time 'cause what you've got to do is do a lot of GPU intensive computation and then you've got to combine them all at the end and the way that they are combined is not necessarily to get just the single result in combining and so all these reasons make it much more difficult to do a whole room then to do a single one.",
                    "label": 0
                },
                {
                    "sent": "The same room offline is that there, so would that have yet let me show you?",
                    "label": 0
                },
                {
                    "sent": "Can I show you this, yes.",
                    "label": 0
                },
                {
                    "sent": "Alright, this is our president.",
                    "label": 0
                },
                {
                    "sent": "So here this is tracked.",
                    "label": 0
                },
                {
                    "sent": "This is a conventional 2D display, not even stereo.",
                    "label": 0
                },
                {
                    "sent": "Well, I hope you get this illusion that in fact that room that entire rooms being skin in real time and combined.",
                    "label": 0
                },
                {
                    "sent": "How is that paper coming that I'm working on?",
                    "label": 0
                },
                {
                    "sent": "This is the paper for iPad that's beautiful.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this is not just a single connect.",
                    "label": 0
                },
                {
                    "sent": "This is like 10 connects, all being combined simultaneously.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey now.",
                    "label": 0
                },
                {
                    "sent": "The other problem then just show you this would be.",
                    "label": 0
                },
                {
                    "sent": "I think that's the last thing I'm telling you is, as I told you, as you add more and more connects some of the problems that you see there because we did drop out that as you get more and more places where there are multiple connects hitting and the each connect cannot decide what the pattern is and so cannot give you a debit an so answer, my money that's hard came up with a really brilliant simple idea.",
                    "label": 0
                },
                {
                    "sent": "I think phrasing.",
                    "label": 0
                },
                {
                    "sent": "As I had nothing to do with it, I mean I was sitting around, you know.",
                    "label": 0
                },
                {
                    "sent": "Yes, this looks great idea.",
                    "label": 0
                },
                {
                    "sent": "It turns out a few months later, independently.",
                    "label": 0
                },
                {
                    "sent": "People at Microsoft in Cambridge developed the same thing and they came out with it.",
                    "label": 0
                },
                {
                    "sent": "So our paper came out last March, and IEEE VR and this came out in sikhi couple months later.",
                    "label": 0
                },
                {
                    "sent": "So here's the idea.",
                    "label": 0
                },
                {
                    "sent": "If you take multiple connect, say two of them and you just vibrate both of them just with a cheap blue motor with a weight on one side.",
                    "label": 0
                },
                {
                    "sent": "What is that is a vibration of approach, the whole unit.",
                    "label": 0
                },
                {
                    "sent": "And that means that the cause your projector and camera vibrating together.",
                    "label": 0
                },
                {
                    "sent": "It won't change very much.",
                    "label": 0
                },
                {
                    "sent": "It's as if the whole room is vibrating, but the other patterns will of course be blurred.",
                    "label": 0
                },
                {
                    "sent": "And so this is the idealized simulation.",
                    "label": 0
                },
                {
                    "sent": "But this is from the actual system.",
                    "label": 0
                },
                {
                    "sent": "Could sort of see that here you have some that are more blurred and some data Leslie.",
                    "label": 0
                },
                {
                    "sent": "So let me show you the little simple result that we got here.",
                    "label": 0
                },
                {
                    "sent": "So here is just before here is 1 unit, just one operating in.",
                    "label": 0
                },
                {
                    "sent": "Here's what happens is you turn on multiple other.",
                    "label": 0
                },
                {
                    "sent": "How many families drop out again.",
                    "label": 0
                },
                {
                    "sent": "Projectors and cameras are rigidly attached.",
                    "label": 0
                },
                {
                    "sent": "Applying motion allows computer to see its projected pattern, sharply blurring the pattern, all other units.",
                    "label": 0
                },
                {
                    "sent": "Blurring of the high spatial frequency patterns of the connect results in a significant contrast loss.",
                    "label": 0
                },
                {
                    "sent": "Long devices to discontinuing their own parents and those of others to produce the motion.",
                    "label": 0
                },
                {
                    "sent": "We use a small motor with an eccentric mass attached to induce vibrations in each command.",
                    "label": 0
                },
                {
                    "sent": "To test our method we used in array of four vibrating connects to capture the scene shown here.",
                    "label": 0
                },
                {
                    "sent": "Is shown when motion is applied, the amount of missing data and noise is greatly different and similar experience.",
                    "label": 0
                },
                {
                    "sent": "We found that our technique reduce missing data by approximately 90%.",
                    "label": 0
                },
                {
                    "sent": "Reduce the measurement error introduced by interference by over 80%.",
                    "label": 0
                },
                {
                    "sent": "So you understand that.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "All you're doing is vibrating all of them and.",
                    "label": 0
                },
                {
                    "sent": "You don't say anything to the software.",
                    "label": 0
                },
                {
                    "sent": "You don't say anything to the connect.",
                    "label": 0
                },
                {
                    "sent": "You get fewer dropouts now.",
                    "label": 0
                },
                {
                    "sent": "In fact, you get slight lowering of the spatial resolution 'cause you're effect vibrating.",
                    "label": 0
                },
                {
                    "sent": "The world vibrated like a couple of pixels in ratings, so it's still we think the network.",
                    "label": 0
                },
                {
                    "sent": "So let me end with a blatant advertising for a telepresence center, because we're always looking for new people and new collaborators, and some of them are right here by config, and so this is.",
                    "label": 0
                },
                {
                    "sent": "We just started last year a collaboration between NTU Singapore, any exertion, UNC Chapel Hill.",
                    "label": 1
                },
                {
                    "sent": "This is one of the places impacted income will see.",
                    "label": 0
                },
                {
                    "sent": "It's really beautiful here.",
                    "label": 0
                },
                {
                    "sent": "It makes it a challenge for us to, uh, do some experiments because it is so beautiful.",
                    "label": 0
                },
                {
                    "sent": "It's so much class, but it's about eighteen $20,000,000 or 4 five years supported by Singapore's interactive Visual Media program.",
                    "label": 0
                },
                {
                    "sent": "Three universities probably know some of the leaders, not to Tom and Mark Strauss.",
                    "label": 0
                },
                {
                    "sent": "Myself.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bunch of projects.",
                    "label": 0
                },
                {
                    "sent": "This is the last advertisement opportunity you know about this.",
                    "label": 0
                },
                {
                    "sent": "I told you about baseball presence.",
                    "label": 0
                },
                {
                    "sent": "If they ha is doing a rolling display that I think is really cool.",
                    "label": 0
                },
                {
                    "sent": "Imagine Aruba with a life size autostereoscopic display.",
                    "label": 0
                },
                {
                    "sent": "This transparent and then you show only the person even more outrageous.",
                    "label": 0
                },
                {
                    "sent": "My friend Greg Wells leading a project an animatronic avatars and you have an avatar in which you project.",
                    "label": 0
                },
                {
                    "sent": "Your own live video and it moves the way you made and we're working hard with our colleagues in NTU.",
                    "label": 0
                },
                {
                    "sent": "So now there's movement around and you could drive these anywhere you want.",
                    "label": 0
                },
                {
                    "sent": "You don't have to be meeting rooms.",
                    "label": 0
                },
                {
                    "sent": "Finally, Nottamun who's been working on synthetic humans for many, many years is leading the project on Thomas virtual humans.",
                    "label": 0
                },
                {
                    "sent": "That is even saying one of these systems, that person right there with that person, right?",
                    "label": 0
                },
                {
                    "sent": "There is not really there, but as an avatar of them you may know because it looks slightly more mechanical.",
                    "label": 0
                },
                {
                    "sent": "But it might be more useful to have the person there in the meeting did not have anybody.",
                    "label": 0
                },
                {
                    "sent": "Because that might say 10 bringing to the same time you know, being crippled book, and so his avatar can do something to record some things.",
                    "label": 0
                },
                {
                    "sent": "You could answer some questions, and if there's some question that needs his immediate attention, then the Avatar could ring back to the person says I need your attention right now.",
                    "label": 0
                },
                {
                    "sent": "You could be in this meeting for the next few minutes, so that's the end.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The advertising let me end with one slide inclusions and I think we should have some discussion, right?",
                    "label": 0
                },
                {
                    "sent": "We have 950.",
                    "label": 0
                },
                {
                    "sent": "This is what you want.",
                    "label": 0
                },
                {
                    "sent": "OK, so one of the clues.",
                    "label": 0
                },
                {
                    "sent": "My sense is this is amazing.",
                    "label": 0
                },
                {
                    "sent": "I still think it's a great idea, but I think we've got a long ways to go and for inspiration.",
                    "label": 0
                },
                {
                    "sent": "I think it would be useful for those of you who are young and go back to something like 1965.",
                    "label": 0
                },
                {
                    "sent": "When I first featuring graphics item.",
                    "label": 0
                },
                {
                    "sent": "So when gave this famous talk about the ultimate display?",
                    "label": 1
                },
                {
                    "sent": "Many of you may have studied and this is at a time when people were making line drawings who were in the best place.",
                    "label": 0
                },
                {
                    "sent": "Is the people who are not in best places were making drawings out of printer paper with little X's and O's OK?",
                    "label": 0
                },
                {
                    "sent": "And what he said was.",
                    "label": 0
                },
                {
                    "sent": "That we should not think of the graphic display as making pictures.",
                    "label": 0
                },
                {
                    "sent": "I think about it as a window into a world created by the.",
                    "label": 0
                },
                {
                    "sent": "And that has largely been realized in terms of image generation.",
                    "label": 0
                },
                {
                    "sent": "That is the kind of video games that we see right now on our standard PC's are so realistic that they do look like a picture.",
                    "label": 0
                },
                {
                    "sent": "A window into a Wonderland created by, so it's, I think, encouraging to think that we might have telepresence in another generation of that level.",
                    "label": 0
                },
                {
                    "sent": "I think that for the short run you should all go out and buy RGB cameras that are cheap, because I think that they're going to change the face of what we do.",
                    "label": 0
                },
                {
                    "sent": "You know, a lot of different things, and I think that in terms of displays, I think that there are two possibilities.",
                    "label": 0
                },
                {
                    "sent": "One is these multilayer displays for this example here, because I don't want to steal the Thunder of other researchers, but go look at double and work at MIT Media Lab.",
                    "label": 0
                },
                {
                    "sent": "He uses multiple layers and dynamic barriers and not.",
                    "label": 0
                },
                {
                    "sent": "It's barriers and just really beautiful results.",
                    "label": 0
                },
                {
                    "sent": "And he admits that there's still some ways to go, so you could still contribute to it.",
                    "label": 0
                },
                {
                    "sent": "And I still think that in the longer term.",
                    "label": 0
                },
                {
                    "sent": "Head worn displays are going to be answering.",
                    "label": 1
                },
                {
                    "sent": "I'm most encouraged by Google Glass product.",
                    "label": 0
                },
                {
                    "sent": "How many have I assume most of you have seen this picture right?",
                    "label": 0
                },
                {
                    "sent": "So within a year Google is going to give these out or sell them to develop an.",
                    "label": 0
                },
                {
                    "sent": "I believe that that's going to fuel a renaissance in head worn displays and so there are some small companies actively like Louis that have wide field of view.",
                    "label": 0
                },
                {
                    "sent": "Headworn displays like this.",
                    "label": 0
                },
                {
                    "sent": "They're not that why there?",
                    "label": 0
                },
                {
                    "sent": "40 degrees, but that's a lot wider than Google Glass, and so I think within the next 5 or 10 years will see really nice displays in our eyeglasses that would work for a long time and I think Google Glass is just the beginning.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Again we have time for questions and if you could please go to the microphones to ask you questions.",
                    "label": 0
                },
                {
                    "sent": "Let me begin with the first question for the system where you had the panoramic camera views and the hidden camera views.",
                    "label": 0
                },
                {
                    "sent": "When you do for angles that were not either aligned with the panoramic view or handle, but where is the slight angle that was different.",
                    "label": 0
                },
                {
                    "sent": "For example, if people were spending but not each other, but it's slightly off.",
                    "label": 0
                },
                {
                    "sent": "So the answer is nothing.",
                    "label": 0
                },
                {
                    "sent": "What we do is.",
                    "label": 0
                },
                {
                    "sent": "We process what every part of you may be in each one of those images.",
                    "label": 0
                },
                {
                    "sent": "If you're within close distance and you happen to walk between we segment using connects and using color, whatever happens to be connected component within a certain range like less than two meters.",
                    "label": 0
                },
                {
                    "sent": "So what you will see on there if you're walking between it, is that you'll see put together some part of 1 camera image in another part of 1 camera image and we take advantage of the fact that each camera.",
                    "label": 0
                },
                {
                    "sent": "Is going to 1 display and there's the gap in between that.",
                    "label": 0
                },
                {
                    "sent": "We don't have to match the price alone.",
                    "label": 0
                },
                {
                    "sent": "Off in Angleton, exactly that maybe often angle exactly.",
                    "label": 0
                },
                {
                    "sent": "Foot by having additional cameras with different angle at each point, exactly what we have said to people.",
                    "label": 0
                },
                {
                    "sent": "Think of the cameras as being the kind that are in your laptop and so you might have like a Pearl string of pearls across.",
                    "label": 0
                },
                {
                    "sent": "And then we could select an do compositing for multiple accounts.",
                    "label": 0
                },
                {
                    "sent": "Basically, if you have to do with each each point along the path.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's not clear that panoramic around, but the closer that we have more cameras that we have for, the closer we get to iTunes and we've done by 10 or 11 in a row as well as many people here.",
                    "label": 0
                },
                {
                    "sent": "And those are nice for being introduced.",
                    "label": 0
                },
                {
                    "sent": "Next question.",
                    "label": 0
                },
                {
                    "sent": "Future please go to the microphone.",
                    "label": 0
                },
                {
                    "sent": "The great great heart.",
                    "label": 0
                },
                {
                    "sent": "I liked all these pictures and like I've been through some of your situations to my question is with you.",
                    "label": 0
                },
                {
                    "sent": "I don't work heading for this connect and everybody is every family get one.",
                    "label": 0
                },
                {
                    "sent": "I have no fiber.",
                    "label": 0
                },
                {
                    "sent": "My question is related to the.",
                    "label": 0
                },
                {
                    "sent": "Transmission power story for every family.",
                    "label": 0
                },
                {
                    "sent": "Got those under Florida law, the heavy presence, whatever you ask the telecommunication company provide oh I see so we just thinking is that the Internet will just be congested because we have so many telepresence system I don't know.",
                    "label": 0
                },
                {
                    "sent": "What is the language that that is the problem that we have?",
                    "label": 0
                },
                {
                    "sent": "Do you know he's sending yes?",
                    "label": 0
                },
                {
                    "sent": "Yes, I could answer you more seriously.",
                    "label": 0
                },
                {
                    "sent": "We have done some experiments.",
                    "label": 0
                },
                {
                    "sent": "In fact, use passed with one of the supercomputer centers in the US center and they were interested in.",
                    "label": 0
                },
                {
                    "sent": "Exploring some real time applications with a massive amount of data massive.",
                    "label": 0
                },
                {
                    "sent": "This was seven years ago maybe.",
                    "label": 0
                },
                {
                    "sent": "Something like that and we managed to get something like 27 video screens with our friends from Pennsylvania and managed to get it from one part of the country to the other using Internet two and very little amount of compression and managed to get the cross correlation done, 2000 processors something and then combine and send the data points back another 1000 miles.",
                    "label": 0
                },
                {
                    "sent": "A couple frames per second.",
                    "label": 0
                },
                {
                    "sent": "But we were using all the bandwidth that was available then.",
                    "label": 0
                },
                {
                    "sent": "Devastation it was something like a one Gigabit.",
                    "label": 0
                },
                {
                    "sent": "Our path from the Superview conference in Baltimore to a few places and we use 90% of them already.",
                    "label": 0
                },
                {
                    "sent": "So yes, you can certainly use up bandwidth.",
                    "label": 0
                },
                {
                    "sent": "Say I think we should be so lucky that this would be a problem, but I find it somewhere.",
                    "label": 0
                },
                {
                    "sent": "Yes, our friends, that system and other companies are working on that.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for a very interesting talk I have.",
                    "label": 0
                },
                {
                    "sent": "I have a question but I also have a little bit of promotional placement.",
                    "label": 0
                },
                {
                    "sent": "You're talking very interesting.",
                    "label": 0
                },
                {
                    "sent": "It would be nice to consider you as a very member of The Time Machine session, or which will be held tomorrow.",
                    "label": 0
                },
                {
                    "sent": "An Anna purposes.",
                    "label": 0
                },
                {
                    "sent": "Looking forward by looking back to past technologies and I think with citing work from 1558.",
                    "label": 0
                },
                {
                    "sent": "Basically you have really sold out their phone anytime soon.",
                    "label": 0
                },
                {
                    "sent": "I just found my Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "I I nothing happened to my scholarships.",
                    "label": 0
                },
                {
                    "sent": "I noted the website web page.",
                    "label": 0
                },
                {
                    "sent": "So thank you, thank you for that.",
                    "label": 0
                },
                {
                    "sent": "Great glad to know view on the topic.",
                    "label": 0
                },
                {
                    "sent": "My question has to do with the presence part of Telepresence.",
                    "label": 0
                },
                {
                    "sent": "So I notice that your talk was was very centered on on visual presence and actually having visual depiction of participants in the room.",
                    "label": 0
                },
                {
                    "sent": "And I was wondering if you could come down some of the elements of a presence that are that are non visual in nature.",
                    "label": 0
                },
                {
                    "sent": "I'd love to, but I'm I'm totally experience from the non visual after telling that I cheered so I would just had interaction an email with some friends at the Media Lab.",
                    "label": 0
                },
                {
                    "sent": "Each sheet you know who many of you know has been working for decades on haptic.",
                    "label": 0
                },
                {
                    "sent": "You know physical interfaces has some really nice things on haptic interfaces as an augmentation to the visual which I think is terrific.",
                    "label": 0
                },
                {
                    "sent": "And if I had more hours.",
                    "label": 0
                },
                {
                    "sent": "Today I would love to work on that.",
                    "label": 0
                },
                {
                    "sent": "I think that even a small amount of touch would do so much.",
                    "label": 0
                },
                {
                    "sent": "I I know I could, I had money, I would invest in.",
                    "label": 0
                },
                {
                    "sent": "I think that you know, I think if we had the same visuals we have now and just had a.",
                    "label": 0
                },
                {
                    "sent": "Mention touch, I think that it's done well.",
                    "label": 0
                },
                {
                    "sent": "It could enhance tremendously sensitive presence.",
                    "label": 0
                },
                {
                    "sent": "I wish I could design better.",
                    "label": 0
                },
                {
                    "sent": "Easy is the best one I know.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "We have time for one more question.",
                    "label": 0
                },
                {
                    "sent": "Really, really enjoyed very quick question around.",
                    "label": 0
                },
                {
                    "sent": "Everyone is saying everyone is really using tablets and mobile phones.",
                    "label": 0
                },
                {
                    "sent": "Future of buying this stuff and the role of tablets and mobile phones to create more anonymity telepresence.",
                    "label": 0
                },
                {
                    "sent": "That's a really good question.",
                    "label": 0
                },
                {
                    "sent": "I think it's in some ways too early to tell.",
                    "label": 0
                },
                {
                    "sent": "I mean, I like everybody else uses my tablet and get visuals on it and I I so much like they have it because it is bigger than my smartphone and so I get images of my loved ones that are, you know, closer to life size.",
                    "label": 0
                },
                {
                    "sent": "And I also find it that I'm moving my tablet around, you know, giving them tour of wherever I am, but you know, I don't have any greater insight than most of you have here about how it is going to go.",
                    "label": 0
                },
                {
                    "sent": "I think it's too early to tell my senses.",
                    "label": 0
                },
                {
                    "sent": "Where was tablets, the way PCs were when people in the first couple of years, personal computers?",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "We had some idea it was going to be.",
                    "label": 0
                },
                {
                    "sent": "Remember it was.",
                    "label": 0
                },
                {
                    "sent": "This account that you could do spreadsheets and that you could do like desktop publishing company.",
                    "label": 0
                },
                {
                    "sent": "But you know, we can get to the notion of having our laptop around with us all the time, even though it was around.",
                    "label": 0
                },
                {
                    "sent": "See what I mean.",
                    "label": 0
                },
                {
                    "sent": "So we just looked at the first new things and I think that's what's happening with tablets that we're looking at the first obvious applications from the previous technologies.",
                    "label": 0
                },
                {
                    "sent": "Like you know, using Skype.",
                    "label": 0
                },
                {
                    "sent": "But I think another 10 years and will have a different mixture of things that we're doing.",
                    "label": 0
                },
                {
                    "sent": "I think that the more we used to think faster, we'll get some new areas.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, very.",
                    "label": 0
                }
            ]
        }
    }
}