{
    "id": "nvj5ix4asmn54ujya5h3nrit7nkmqvzm",
    "title": "Online Clustering of High-Dimensional Trajectories under Concept Drift",
    "info": {
        "produced by": [
            "Data & Web Mining Lab"
        ],
        "author": [
            "Georg Krempl, Institut für Statistik und Operations Research, University of Graz"
        ],
        "published": "Nov. 30, 2011",
        "recorded": "September 2011",
        "category": [
            "Top->Computer Science->Data Mining->Temporal & Streams Mining"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd2011_krempl_trajectories/",
    "segmentation": [
        [
            "So this is trying to act that I'm going to present together with Salem Siddiqui and music video from Auto Correct University in marketable.",
            "In Germany, online clustering of high dimensional projectors under concept drift."
        ],
        [
            "So first.",
            "I don't like is just catch the problem and of clustering detector is and then show our approach which is actually an online algorithm.",
            "Finally, I want to show you some experiments and results on them before the conclusion."
        ],
        [
            "OK."
        ],
        [
            "So the software support and description assume for the moment that you have an application where, for example, customer relationship management tool and so you have customers which are who is shopping online, you can identify them or when they log into your system and then they spend money on different products, different items in the basket and then there what you can do is you can aggregate over the groups of products in the basket you can aggregate.",
            "The value until can great by such.",
            "Selector of measures and if you assume that customers are visiting your shop several times, then what you get is some kind of trajectory of such measurements and now assume that they are changing their behavior overtime.",
            "So for example could be due to economic to the change in the economic situation, either from the economy or from the customer itself.",
            "Or are there arises a new product?",
            "We have some kind of sudden change?",
            "And then instead question, how can we cluster this customers and Fillmore?",
            "Can we predict somehow the values that the customer would generate in the next?"
        ],
        [
            "Time to see him so we can formulate this problem as a trajectory clustering program where the verification operation of individuals.",
            "And each visit visit of the customer generates a measurement and then we have this kind of trajectory overtime and our objective is then took us to cluster.",
            "This data projector is.",
            "And.",
            "But you have to be careful about this that we will have a different number of measurements per individual.",
            "OK, and that these measurements are not necessarily Dick resistant times."
        ],
        [
            "So we decided that.",
            "If you look here, this is the horizontal axis is the time axis, so this picture you have discrete time steps, but could be also continuous time.",
            "Jimmy is a 2 dimensional feature space.",
            "So for example we have here the customer everything about time.",
            "If it's different purchases and what we want to know is how to which group of customers we should assign this green customer here."
        ],
        [
            "So this is."
        ],
        [
            "Actually, the first type of problem that is simply want to check the clusters.",
            "One idea would be to split the time access into disjoint intervals and then clustering each interval.",
            "But what we want instead of that is actually we want a clustering that is continuously going on overtime.",
            "So we want one clustering and we want to update this."
        ],
        [
            "And this would then allow us also for a new customer, for example.",
            "So assume we have observed yellow customer here to predict at which which values this customer with generating a later step.",
            "So this is."
        ],
        [
            "Problem.",
            "We can formulate this as a Goshen mixture model.",
            "This was done done by Goffman Smith.",
            "In their work they presented the generative model for that, so I won't go into detail here, but."
        ],
        [
            "What you can do is."
        ],
        [
            "You obtain you.",
            "Calculate the likelihood and then use the approach to calculate the choice of parameters.",
            "That maximizes you this likelihood.",
            "So this is an existing work.",
            "However, there is a problem if you use.",
            "This algorithm is not online, so you have to process all the data at once because you want to have this, you want to identify for each cluster part, is polynomial development.",
            "Overtime you want to get this better coefficients there, and for this you need to process all the data and the question is if we are applying this in the stream.",
            "It's probably not appropriate to simply retrain them again and again and again, because it would take too much time.",
            "And another thing is, if the path of each trajectory of each cluster is not really smooth, but we rather have some kind of change some change, then how robust is this result?"
        ],
        [
            "Against such drift.",
            "So this was the motivation for us to look into a kind of online algorithm for this problem."
        ],
        [
            "So the idea is that we make an initial clustering using the EM algorithm on a training set data set, and then we update this clustering overtime.",
            "So what we want is we want to estimate the new position of the clusters and also if new individuals arrive, we wanted to know where we should assign them.",
            "However, here in this work we assume that we have a starting number of clusters, so case number of clusters, and that the classes have started covariance matrices.",
            "So in our current research we are working on this.",
            "Come on.",
            "Extensions of the algorithm, but for this presentation."
        ],
        [
            "Is that they assumed to be static.",
            "Then what you could do is obviously you could."
        ],
        [
            "The common filter.",
            "Just a short wrap up if we discretize.",
            "A common filter.",
            "Then we simply say that accesses a state estimate, so we cannot directly observe the state, but because the party state itself should follow this state transition and we have a as a state transition matrix and WS is a random random values, actually white noise.",
            "And we have a status signal.",
            "Equation where we have very observed this measurement, said S which is transformed to state and there's also white noise involved."
        ],
        [
            "So.",
            "In our case, the States are obviously cluster centroids, so.",
            "Like this, the states are Decosta centroids.",
            "What we consider is you can consider for the cluster, for example before if you have the basket you can have the value of each group of products as one dimension.",
            "But you could also be interested in saying, well I don't want not only to use to know the absolute value, but I want also want to know the increase overtime so some kind of speed and acceleration.",
            "So higher order of movements.",
            "So This is why here we have this oh.",
            "This is actually also the order of the polynomial that we fitted in their M approach.",
            "The question then arises altruistic parameters for the common filter and how they assign individuals to."
        ],
        [
            "Stuff.",
            "Yeah, the idea is for the initial.",
            "State estimate what we will do is we simply take the coefficients that we have rounded am approach.",
            "And using them we can for one dimension.",
            "For example, we can for this dimension D. Here we can calculate the position.",
            "Or the value of this product group in the basket at time T by simply using the coefficients that we have learned from them.",
            "Obviously, if we draft the situation, we can also calculate the speed and acceleration so or any."
        ],
        [
            "Higher order.",
            "Moment OK?"
        ],
        [
            "Next thing that we need to decide is the decision matrix.",
            "I don't I think I don't have the time to go into detail here, but what you actually can do is.",
            "But theory of motion, if you use a. Taylor series expansion.",
            "You arrive at the Matrix, for example.",
            "Here you have been considering speed and acceleration for 2 dimensional paskett, and then you will simply.",
            "However, here once on the main diagonal and on their upper triangular matrix is then here the Delta and Delta squared.",
            "Divided by two, which is a dentist registered distant the time difference between one."
        ],
        [
            "Next measurement.",
            "Process noise current metrics.",
            "We've set it to the identity matrix.",
            "Ann Margaret.",
            "Process noise factor, which we have to."
        ],
        [
            "Estimated from the data, so there's a parameter we have to learn the measurement of data signal matrix H we were using here.",
            "Also the identity matrix.",
            "Yeah, yeah."
        ],
        [
            "OK, then, measurement noise covariance matrix what we're using here is then.",
            "Covariance matrix of the clusters from the EM algorithm.",
            "'cause this is legitimate, because if you assume that what you are tracking other cluster centers and what you can observe other individuals generating some measurements in your feature space, there always distributed by our assumption there distributed according to Goshen.",
            "Distribution with this covariance matrix."
        ],
        [
            "OK, so really the algorithm.",
            "What you have is actually for each cluster a kind of instance of a common filter, and we've now a new measurement arrives.",
            "You first have to decide whether you know this individual or not.",
            "If we know this individual, we're going to calculate features like spittle acceleration because we have already some measurements available and then we are going to update the clustering.",
            "Here what we could also do is you could say well, if I don't know the individual then I probably cannot calculate speed and acceleration from this individual.",
            "But I could update the cluster anyway, but we didn't do.",
            "This is because we want to have a more robust.",
            "Uh, algorithm, so if if there is only one outlier is not considered for the cluster update, and then finally what we're doing doing this, we are calculating the cluster membership probability of this measurement and then updating the cluster membership probability of the."
        ],
        [
            "Diesel.",
            "So."
        ],
        [
            "Now quickly do the experiments.",
            "But we wanted to know from our experiments are whether we can get a similar quality regarding the clustering from the M and from the Chase algorithm.",
            "Obviously immigration needs more time and can we tried several times over the data so it will be probably smoother, but we wanted to know whether we can somehow be competitive against this algorithm.",
            "Another thing we wanted to know, is there a business against the sudden shift, so if there's a nonlinear.",
            "Dance move.",
            "Detector whether we can drag the cluster anyway and we wanted to know their suitability for online process."
        ],
        [
            "So what do you by using their in a kind of controlled environment without generating synthetic data sets where.",
            "We had different extents of noise, different number of dimensions and we are actually creating observations for 1500 individuals that had averaged only two measurements for individual.",
            "This is motivated by the application we have in mind that we only have a very small number of measurements per individual.",
            "OK, and then we were using the first 1000 medicine measurements for training and the subsequent."
        ],
        [
            "1000 ones"
        ],
        [
            "For the test.",
            "And here is a result of one on one data set.",
            "So the 1st third of the time axis is actually is reserved for training and then we are applying the common filter.",
            "So here we have a gradual.",
            "Change so we don't have a sudden shift here, but at this moment here we have a sudden shift.",
            "This means that the classes are offset, So what you can see here.",
            "So the vertical axis you have the feature and what you can see here is actually that.",
            "The Green Line is the true state of the cluster, and we're offsetting this class stop by randomly randomly chosen vectors in the feature space.",
            "So actually they the two classes here are crossing, and what happens is the red line is the predicted state or estimated state by the common filter.",
            "You can see some various move.",
            "So this is this is if smoothness is an issue we have to work on that.",
            "But anyway he can is able to track the clusters even if they classes here are crossing."
        ],
        [
            "Then if you look at the balancing, So what we're comparing is that EM algorithm here.",
            "So the bars in yellow are from the 2nd paper of time that we have no shift but gradual change.",
            "The green ones are a few days shift in the data set, so this was the 3rd.",
            "Third of the data.",
            "And what we can see if there's no shift, then the M is is better.",
            "So we have this.",
            "That's that's it.",
            "If there is shift, then the common filter is quite compareable.",
            "So actually only one type of data sets.",
            "There was a significant difference between the two algorithms.",
            "This other pairs here.",
            "Other variants of the common filter, but I haven't said until now is how to assign an individual to a cluster.",
            "So how do you know which cluster to update?",
            "Yeah, if you receive a new observation and there are actually two strategies to use, one is to use a weighted update of all classes.",
            "So the update to perform the update step on all common filters and the other one is to choose it only on 141 cluster where we have the highest class membership probability.",
            "So we tried different variants.",
            "Actually the one which work best in our case was a squared squared plus membership probability as a wait for the update process.",
            "OK, and finally we can, but we can also see that we can expect this.",
            "The test this algorithm is.",
            "An hour and it was known that algorithm, that time he needs for the learning stays quite the same variance for their immigrant.",
            "Obviously we have a linear increase in the time need for processing."
        ],
        [
            "OK, I'm afraid I will not use the five minutes anyway, so to come to the summary, what we have looked into is the case where we want to cluster.",
            "For example, customers with purchases of customers this year.",
            "And we want to do this with us so we can formulate this in the trajectory clustering periodically.",
            "And for the online problem.",
            "So if you want to do it in a stream, we have proposed this algorithm based on the common filter which uses the M for initialization and then comment for update and is able to track the clusters.",
            "And I predict, make an uproar estimate value observed the next.",
            "The next cluster gives us a probability distribution on the new method will see the new measurements.",
            "Compared to the offline algorithm, we have to say that we have a competitive quality.",
            "If there is.",
            "If there is shift.",
            "But we are much faster and we are variables against shift, so this is an advantage.",
            "So it's really of particular interest if you are clustering streaming data."
        ],
        [
            "11 How couple of working points?",
            "One point is that we want to apply to this application that we had in mind and make some real world experiments.",
            "So outside this controlled environment.",
            "Another limitation of the current approach presented here is that we are assuming that current matrices and the number of clusters that look about.",
            "I'm obviously disappointed we are now working on that.",
            "We want to do have to allow for dynamic number of clusters and the dynamic development of covariance matrices.",
            "Another working behind this movement of prediction.",
            "If the combination of time allows, we would go could probably cover other for a common smoother instead of account filter.",
            "And another thing is the choice of the.",
            "Process knowledge matrix, which is.",
            "Yeah, maybe we are currently working to get a problem.",
            "Error result on that.",
            "OK, so."
        ],
        [
            "That's it actually from my part.",
            "Interested we are putting or we have put the source code online.",
            "There will be updates as the work progresses and otherwise I thank you for your attention and yeah.",
            "Questions.",
            "It looks to me like your algorithm would work equally well with random initialization instead of VM visualization.",
            "You mean the the OK?",
            "The common filter then it sensation of the common pizza we used the.",
            "We use the parameters of estimated by the M. And so we didn't actually use random initialization for the common filter, but they did I get the question is, why not try right now, but I think it would probably work with it.",
            "OK, we haven't tried that, so that's one thing we could look into, yes.",
            "But you need them anyway, or get the initial clustering to get an idea about the customers.",
            "So let's in this context.",
            "But that is one thing we could definitely look into so.",
            "In this case, then you would have to choose the.",
            "The covariance matrix.",
            "For the."
        ],
        [
            "Then setting this one for example to Infinity or so so that the initial as we then are not very secure about it.",
            "Thank you for this.",
            "Did you say you used to estimate the number of clusters?",
            "Yeah, actually we are using the M for initiating additional customers and then we have the number of clusters within fixed.",
            "So this is a thing that we want to look at it now.",
            "Wants to do allow for changing number of clusters.",
            "So your probability of estimates are available.",
            "Calculating what's the quality of the clusters.",
            "Also, that's one question that I have and Secondly you said that before updating clusters.",
            "My question is, before updating clusters, do you really look at the quality of the clusters as well?",
            "Actually we use the quality of the.",
            "I mean what we use actually is if.",
            "For updating the.",
            "You mean you mean like that?",
            "We look into the pretty or of the clustering percent exactly queasiness or purity of the cluster there at least half a dozen cluster quality indices.",
            "OK, yeah, it is the problem.",
            "We can't use actually any practice because we would need account proof.",
            "But for some, yeah we could.",
            "We could.",
            "You know we haven't added this.",
            "Yeah, this is.",
            "From what you said in the beginning and also from the pictures you have shown, it seems to me that you are really clustering on the level of whole trajectory.",
            "Yes, but later on it was no longer that clear to me that you are really doing this and if you are doing it, my question is what type of distance measure?",
            "Similarity measure on trajectories are you're using explicitly or implicitly, and what are you doing?",
            "I mean, if a new customer comes, you have a single observation.",
            "It's not yet a trajectory.",
            "So how do you compare it to other projective?",
            "Thank you for the question.",
            "This may be fine.",
            "I didn't stress enough.",
            "So what we do is actually if you have a.",
            "If you want to update your clustering or any for clustering, what we use actually is.",
            "How close is our new observation is to the cloud, to the estimated cluster center?",
            "So maybe let's go to this."
        ],
        [
            "You know at the beginning.",
            "Yeah, so if this new observation comes, but we actually have at this moment in time is we have a probability distribution on this cluster, then we can use this to calculate the probability that this particular measurement was generated by this cluster.",
            "And then we also have to cooperate using the formulas from the generative model multiplied with the probability data so.",
            "That we've got this series of observations of measurements.",
            "And by that we get the probability that this individual was connected by this cluster an as we can.",
            "This is simply a multiplication step.",
            "So actually what we did is we recommend a low rate, modeling it up to about numerical problems.",
            "But this is a thing we can do online so.",
            "But for the updates that what you really do is actually that in every point in time you are calculating.",
            "Probability likelihood that this this point was generated by this cluster, and you use this then As for the update.",
            "But the Cluster Center is a trajectory.",
            "The class center well.",
            "The cost of center itself is.",
            "If you look at what time central tractor but given point in time, simply according to the set of coordinates and also like the higher order movements like speed, acceleration at this point in time.",
            "So this is actually then what you use to integrate somehow the trajectory information into it.",
            "So as you know that if this if if a glass door is like I mean this case if it's like moving in this direction then you will see this in the state in the state space.",
            "If you include these terms into the state space.",
            "And this is that the idea to use a here kind of rich state where you consider these terms as well.",
            "For to get the trajectories into the mall.",
            "OK, any questions?",
            "Speak again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is trying to act that I'm going to present together with Salem Siddiqui and music video from Auto Correct University in marketable.",
                    "label": 0
                },
                {
                    "sent": "In Germany, online clustering of high dimensional projectors under concept drift.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So first.",
                    "label": 0
                },
                {
                    "sent": "I don't like is just catch the problem and of clustering detector is and then show our approach which is actually an online algorithm.",
                    "label": 0
                },
                {
                    "sent": "Finally, I want to show you some experiments and results on them before the conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the software support and description assume for the moment that you have an application where, for example, customer relationship management tool and so you have customers which are who is shopping online, you can identify them or when they log into your system and then they spend money on different products, different items in the basket and then there what you can do is you can aggregate over the groups of products in the basket you can aggregate.",
                    "label": 0
                },
                {
                    "sent": "The value until can great by such.",
                    "label": 0
                },
                {
                    "sent": "Selector of measures and if you assume that customers are visiting your shop several times, then what you get is some kind of trajectory of such measurements and now assume that they are changing their behavior overtime.",
                    "label": 0
                },
                {
                    "sent": "So for example could be due to economic to the change in the economic situation, either from the economy or from the customer itself.",
                    "label": 0
                },
                {
                    "sent": "Or are there arises a new product?",
                    "label": 1
                },
                {
                    "sent": "We have some kind of sudden change?",
                    "label": 0
                },
                {
                    "sent": "And then instead question, how can we cluster this customers and Fillmore?",
                    "label": 1
                },
                {
                    "sent": "Can we predict somehow the values that the customer would generate in the next?",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Time to see him so we can formulate this problem as a trajectory clustering program where the verification operation of individuals.",
                    "label": 1
                },
                {
                    "sent": "And each visit visit of the customer generates a measurement and then we have this kind of trajectory overtime and our objective is then took us to cluster.",
                    "label": 0
                },
                {
                    "sent": "This data projector is.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "But you have to be careful about this that we will have a different number of measurements per individual.",
                    "label": 1
                },
                {
                    "sent": "OK, and that these measurements are not necessarily Dick resistant times.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we decided that.",
                    "label": 0
                },
                {
                    "sent": "If you look here, this is the horizontal axis is the time axis, so this picture you have discrete time steps, but could be also continuous time.",
                    "label": 0
                },
                {
                    "sent": "Jimmy is a 2 dimensional feature space.",
                    "label": 0
                },
                {
                    "sent": "So for example we have here the customer everything about time.",
                    "label": 0
                },
                {
                    "sent": "If it's different purchases and what we want to know is how to which group of customers we should assign this green customer here.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually, the first type of problem that is simply want to check the clusters.",
                    "label": 0
                },
                {
                    "sent": "One idea would be to split the time access into disjoint intervals and then clustering each interval.",
                    "label": 0
                },
                {
                    "sent": "But what we want instead of that is actually we want a clustering that is continuously going on overtime.",
                    "label": 0
                },
                {
                    "sent": "So we want one clustering and we want to update this.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this would then allow us also for a new customer, for example.",
                    "label": 0
                },
                {
                    "sent": "So assume we have observed yellow customer here to predict at which which values this customer with generating a later step.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "We can formulate this as a Goshen mixture model.",
                    "label": 0
                },
                {
                    "sent": "This was done done by Goffman Smith.",
                    "label": 0
                },
                {
                    "sent": "In their work they presented the generative model for that, so I won't go into detail here, but.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What you can do is.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You obtain you.",
                    "label": 0
                },
                {
                    "sent": "Calculate the likelihood and then use the approach to calculate the choice of parameters.",
                    "label": 0
                },
                {
                    "sent": "That maximizes you this likelihood.",
                    "label": 0
                },
                {
                    "sent": "So this is an existing work.",
                    "label": 0
                },
                {
                    "sent": "However, there is a problem if you use.",
                    "label": 0
                },
                {
                    "sent": "This algorithm is not online, so you have to process all the data at once because you want to have this, you want to identify for each cluster part, is polynomial development.",
                    "label": 0
                },
                {
                    "sent": "Overtime you want to get this better coefficients there, and for this you need to process all the data and the question is if we are applying this in the stream.",
                    "label": 0
                },
                {
                    "sent": "It's probably not appropriate to simply retrain them again and again and again, because it would take too much time.",
                    "label": 0
                },
                {
                    "sent": "And another thing is, if the path of each trajectory of each cluster is not really smooth, but we rather have some kind of change some change, then how robust is this result?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Against such drift.",
                    "label": 0
                },
                {
                    "sent": "So this was the motivation for us to look into a kind of online algorithm for this problem.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea is that we make an initial clustering using the EM algorithm on a training set data set, and then we update this clustering overtime.",
                    "label": 1
                },
                {
                    "sent": "So what we want is we want to estimate the new position of the clusters and also if new individuals arrive, we wanted to know where we should assign them.",
                    "label": 1
                },
                {
                    "sent": "However, here in this work we assume that we have a starting number of clusters, so case number of clusters, and that the classes have started covariance matrices.",
                    "label": 0
                },
                {
                    "sent": "So in our current research we are working on this.",
                    "label": 0
                },
                {
                    "sent": "Come on.",
                    "label": 0
                },
                {
                    "sent": "Extensions of the algorithm, but for this presentation.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that they assumed to be static.",
                    "label": 0
                },
                {
                    "sent": "Then what you could do is obviously you could.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The common filter.",
                    "label": 0
                },
                {
                    "sent": "Just a short wrap up if we discretize.",
                    "label": 0
                },
                {
                    "sent": "A common filter.",
                    "label": 0
                },
                {
                    "sent": "Then we simply say that accesses a state estimate, so we cannot directly observe the state, but because the party state itself should follow this state transition and we have a as a state transition matrix and WS is a random random values, actually white noise.",
                    "label": 0
                },
                {
                    "sent": "And we have a status signal.",
                    "label": 0
                },
                {
                    "sent": "Equation where we have very observed this measurement, said S which is transformed to state and there's also white noise involved.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In our case, the States are obviously cluster centroids, so.",
                    "label": 1
                },
                {
                    "sent": "Like this, the states are Decosta centroids.",
                    "label": 0
                },
                {
                    "sent": "What we consider is you can consider for the cluster, for example before if you have the basket you can have the value of each group of products as one dimension.",
                    "label": 0
                },
                {
                    "sent": "But you could also be interested in saying, well I don't want not only to use to know the absolute value, but I want also want to know the increase overtime so some kind of speed and acceleration.",
                    "label": 0
                },
                {
                    "sent": "So higher order of movements.",
                    "label": 0
                },
                {
                    "sent": "So This is why here we have this oh.",
                    "label": 0
                },
                {
                    "sent": "This is actually also the order of the polynomial that we fitted in their M approach.",
                    "label": 0
                },
                {
                    "sent": "The question then arises altruistic parameters for the common filter and how they assign individuals to.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stuff.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the idea is for the initial.",
                    "label": 0
                },
                {
                    "sent": "State estimate what we will do is we simply take the coefficients that we have rounded am approach.",
                    "label": 0
                },
                {
                    "sent": "And using them we can for one dimension.",
                    "label": 0
                },
                {
                    "sent": "For example, we can for this dimension D. Here we can calculate the position.",
                    "label": 0
                },
                {
                    "sent": "Or the value of this product group in the basket at time T by simply using the coefficients that we have learned from them.",
                    "label": 0
                },
                {
                    "sent": "Obviously, if we draft the situation, we can also calculate the speed and acceleration so or any.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Higher order.",
                    "label": 0
                },
                {
                    "sent": "Moment OK?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next thing that we need to decide is the decision matrix.",
                    "label": 0
                },
                {
                    "sent": "I don't I think I don't have the time to go into detail here, but what you actually can do is.",
                    "label": 0
                },
                {
                    "sent": "But theory of motion, if you use a. Taylor series expansion.",
                    "label": 0
                },
                {
                    "sent": "You arrive at the Matrix, for example.",
                    "label": 0
                },
                {
                    "sent": "Here you have been considering speed and acceleration for 2 dimensional paskett, and then you will simply.",
                    "label": 0
                },
                {
                    "sent": "However, here once on the main diagonal and on their upper triangular matrix is then here the Delta and Delta squared.",
                    "label": 0
                },
                {
                    "sent": "Divided by two, which is a dentist registered distant the time difference between one.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next measurement.",
                    "label": 0
                },
                {
                    "sent": "Process noise current metrics.",
                    "label": 0
                },
                {
                    "sent": "We've set it to the identity matrix.",
                    "label": 0
                },
                {
                    "sent": "Ann Margaret.",
                    "label": 0
                },
                {
                    "sent": "Process noise factor, which we have to.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Estimated from the data, so there's a parameter we have to learn the measurement of data signal matrix H we were using here.",
                    "label": 0
                },
                {
                    "sent": "Also the identity matrix.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, then, measurement noise covariance matrix what we're using here is then.",
                    "label": 1
                },
                {
                    "sent": "Covariance matrix of the clusters from the EM algorithm.",
                    "label": 0
                },
                {
                    "sent": "'cause this is legitimate, because if you assume that what you are tracking other cluster centers and what you can observe other individuals generating some measurements in your feature space, there always distributed by our assumption there distributed according to Goshen.",
                    "label": 0
                },
                {
                    "sent": "Distribution with this covariance matrix.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so really the algorithm.",
                    "label": 0
                },
                {
                    "sent": "What you have is actually for each cluster a kind of instance of a common filter, and we've now a new measurement arrives.",
                    "label": 0
                },
                {
                    "sent": "You first have to decide whether you know this individual or not.",
                    "label": 0
                },
                {
                    "sent": "If we know this individual, we're going to calculate features like spittle acceleration because we have already some measurements available and then we are going to update the clustering.",
                    "label": 0
                },
                {
                    "sent": "Here what we could also do is you could say well, if I don't know the individual then I probably cannot calculate speed and acceleration from this individual.",
                    "label": 0
                },
                {
                    "sent": "But I could update the cluster anyway, but we didn't do.",
                    "label": 0
                },
                {
                    "sent": "This is because we want to have a more robust.",
                    "label": 0
                },
                {
                    "sent": "Uh, algorithm, so if if there is only one outlier is not considered for the cluster update, and then finally what we're doing doing this, we are calculating the cluster membership probability of this measurement and then updating the cluster membership probability of the.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Diesel.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now quickly do the experiments.",
                    "label": 0
                },
                {
                    "sent": "But we wanted to know from our experiments are whether we can get a similar quality regarding the clustering from the M and from the Chase algorithm.",
                    "label": 0
                },
                {
                    "sent": "Obviously immigration needs more time and can we tried several times over the data so it will be probably smoother, but we wanted to know whether we can somehow be competitive against this algorithm.",
                    "label": 0
                },
                {
                    "sent": "Another thing we wanted to know, is there a business against the sudden shift, so if there's a nonlinear.",
                    "label": 1
                },
                {
                    "sent": "Dance move.",
                    "label": 0
                },
                {
                    "sent": "Detector whether we can drag the cluster anyway and we wanted to know their suitability for online process.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what do you by using their in a kind of controlled environment without generating synthetic data sets where.",
                    "label": 1
                },
                {
                    "sent": "We had different extents of noise, different number of dimensions and we are actually creating observations for 1500 individuals that had averaged only two measurements for individual.",
                    "label": 1
                },
                {
                    "sent": "This is motivated by the application we have in mind that we only have a very small number of measurements per individual.",
                    "label": 0
                },
                {
                    "sent": "OK, and then we were using the first 1000 medicine measurements for training and the subsequent.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "1000 ones",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the test.",
                    "label": 0
                },
                {
                    "sent": "And here is a result of one on one data set.",
                    "label": 0
                },
                {
                    "sent": "So the 1st third of the time axis is actually is reserved for training and then we are applying the common filter.",
                    "label": 0
                },
                {
                    "sent": "So here we have a gradual.",
                    "label": 0
                },
                {
                    "sent": "Change so we don't have a sudden shift here, but at this moment here we have a sudden shift.",
                    "label": 0
                },
                {
                    "sent": "This means that the classes are offset, So what you can see here.",
                    "label": 0
                },
                {
                    "sent": "So the vertical axis you have the feature and what you can see here is actually that.",
                    "label": 0
                },
                {
                    "sent": "The Green Line is the true state of the cluster, and we're offsetting this class stop by randomly randomly chosen vectors in the feature space.",
                    "label": 0
                },
                {
                    "sent": "So actually they the two classes here are crossing, and what happens is the red line is the predicted state or estimated state by the common filter.",
                    "label": 0
                },
                {
                    "sent": "You can see some various move.",
                    "label": 0
                },
                {
                    "sent": "So this is this is if smoothness is an issue we have to work on that.",
                    "label": 0
                },
                {
                    "sent": "But anyway he can is able to track the clusters even if they classes here are crossing.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then if you look at the balancing, So what we're comparing is that EM algorithm here.",
                    "label": 0
                },
                {
                    "sent": "So the bars in yellow are from the 2nd paper of time that we have no shift but gradual change.",
                    "label": 0
                },
                {
                    "sent": "The green ones are a few days shift in the data set, so this was the 3rd.",
                    "label": 0
                },
                {
                    "sent": "Third of the data.",
                    "label": 0
                },
                {
                    "sent": "And what we can see if there's no shift, then the M is is better.",
                    "label": 0
                },
                {
                    "sent": "So we have this.",
                    "label": 0
                },
                {
                    "sent": "That's that's it.",
                    "label": 0
                },
                {
                    "sent": "If there is shift, then the common filter is quite compareable.",
                    "label": 0
                },
                {
                    "sent": "So actually only one type of data sets.",
                    "label": 0
                },
                {
                    "sent": "There was a significant difference between the two algorithms.",
                    "label": 0
                },
                {
                    "sent": "This other pairs here.",
                    "label": 0
                },
                {
                    "sent": "Other variants of the common filter, but I haven't said until now is how to assign an individual to a cluster.",
                    "label": 0
                },
                {
                    "sent": "So how do you know which cluster to update?",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you receive a new observation and there are actually two strategies to use, one is to use a weighted update of all classes.",
                    "label": 0
                },
                {
                    "sent": "So the update to perform the update step on all common filters and the other one is to choose it only on 141 cluster where we have the highest class membership probability.",
                    "label": 0
                },
                {
                    "sent": "So we tried different variants.",
                    "label": 0
                },
                {
                    "sent": "Actually the one which work best in our case was a squared squared plus membership probability as a wait for the update process.",
                    "label": 0
                },
                {
                    "sent": "OK, and finally we can, but we can also see that we can expect this.",
                    "label": 0
                },
                {
                    "sent": "The test this algorithm is.",
                    "label": 0
                },
                {
                    "sent": "An hour and it was known that algorithm, that time he needs for the learning stays quite the same variance for their immigrant.",
                    "label": 0
                },
                {
                    "sent": "Obviously we have a linear increase in the time need for processing.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I'm afraid I will not use the five minutes anyway, so to come to the summary, what we have looked into is the case where we want to cluster.",
                    "label": 0
                },
                {
                    "sent": "For example, customers with purchases of customers this year.",
                    "label": 0
                },
                {
                    "sent": "And we want to do this with us so we can formulate this in the trajectory clustering periodically.",
                    "label": 0
                },
                {
                    "sent": "And for the online problem.",
                    "label": 0
                },
                {
                    "sent": "So if you want to do it in a stream, we have proposed this algorithm based on the common filter which uses the M for initialization and then comment for update and is able to track the clusters.",
                    "label": 0
                },
                {
                    "sent": "And I predict, make an uproar estimate value observed the next.",
                    "label": 0
                },
                {
                    "sent": "The next cluster gives us a probability distribution on the new method will see the new measurements.",
                    "label": 0
                },
                {
                    "sent": "Compared to the offline algorithm, we have to say that we have a competitive quality.",
                    "label": 0
                },
                {
                    "sent": "If there is.",
                    "label": 0
                },
                {
                    "sent": "If there is shift.",
                    "label": 0
                },
                {
                    "sent": "But we are much faster and we are variables against shift, so this is an advantage.",
                    "label": 0
                },
                {
                    "sent": "So it's really of particular interest if you are clustering streaming data.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "11 How couple of working points?",
                    "label": 0
                },
                {
                    "sent": "One point is that we want to apply to this application that we had in mind and make some real world experiments.",
                    "label": 0
                },
                {
                    "sent": "So outside this controlled environment.",
                    "label": 0
                },
                {
                    "sent": "Another limitation of the current approach presented here is that we are assuming that current matrices and the number of clusters that look about.",
                    "label": 0
                },
                {
                    "sent": "I'm obviously disappointed we are now working on that.",
                    "label": 0
                },
                {
                    "sent": "We want to do have to allow for dynamic number of clusters and the dynamic development of covariance matrices.",
                    "label": 0
                },
                {
                    "sent": "Another working behind this movement of prediction.",
                    "label": 0
                },
                {
                    "sent": "If the combination of time allows, we would go could probably cover other for a common smoother instead of account filter.",
                    "label": 0
                },
                {
                    "sent": "And another thing is the choice of the.",
                    "label": 0
                },
                {
                    "sent": "Process knowledge matrix, which is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, maybe we are currently working to get a problem.",
                    "label": 0
                },
                {
                    "sent": "Error result on that.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's it actually from my part.",
                    "label": 0
                },
                {
                    "sent": "Interested we are putting or we have put the source code online.",
                    "label": 0
                },
                {
                    "sent": "There will be updates as the work progresses and otherwise I thank you for your attention and yeah.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "It looks to me like your algorithm would work equally well with random initialization instead of VM visualization.",
                    "label": 0
                },
                {
                    "sent": "You mean the the OK?",
                    "label": 0
                },
                {
                    "sent": "The common filter then it sensation of the common pizza we used the.",
                    "label": 0
                },
                {
                    "sent": "We use the parameters of estimated by the M. And so we didn't actually use random initialization for the common filter, but they did I get the question is, why not try right now, but I think it would probably work with it.",
                    "label": 0
                },
                {
                    "sent": "OK, we haven't tried that, so that's one thing we could look into, yes.",
                    "label": 0
                },
                {
                    "sent": "But you need them anyway, or get the initial clustering to get an idea about the customers.",
                    "label": 0
                },
                {
                    "sent": "So let's in this context.",
                    "label": 0
                },
                {
                    "sent": "But that is one thing we could definitely look into so.",
                    "label": 0
                },
                {
                    "sent": "In this case, then you would have to choose the.",
                    "label": 0
                },
                {
                    "sent": "The covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "For the.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then setting this one for example to Infinity or so so that the initial as we then are not very secure about it.",
                    "label": 0
                },
                {
                    "sent": "Thank you for this.",
                    "label": 0
                },
                {
                    "sent": "Did you say you used to estimate the number of clusters?",
                    "label": 0
                },
                {
                    "sent": "Yeah, actually we are using the M for initiating additional customers and then we have the number of clusters within fixed.",
                    "label": 0
                },
                {
                    "sent": "So this is a thing that we want to look at it now.",
                    "label": 0
                },
                {
                    "sent": "Wants to do allow for changing number of clusters.",
                    "label": 0
                },
                {
                    "sent": "So your probability of estimates are available.",
                    "label": 0
                },
                {
                    "sent": "Calculating what's the quality of the clusters.",
                    "label": 0
                },
                {
                    "sent": "Also, that's one question that I have and Secondly you said that before updating clusters.",
                    "label": 0
                },
                {
                    "sent": "My question is, before updating clusters, do you really look at the quality of the clusters as well?",
                    "label": 0
                },
                {
                    "sent": "Actually we use the quality of the.",
                    "label": 0
                },
                {
                    "sent": "I mean what we use actually is if.",
                    "label": 0
                },
                {
                    "sent": "For updating the.",
                    "label": 0
                },
                {
                    "sent": "You mean you mean like that?",
                    "label": 0
                },
                {
                    "sent": "We look into the pretty or of the clustering percent exactly queasiness or purity of the cluster there at least half a dozen cluster quality indices.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, it is the problem.",
                    "label": 0
                },
                {
                    "sent": "We can't use actually any practice because we would need account proof.",
                    "label": 0
                },
                {
                    "sent": "But for some, yeah we could.",
                    "label": 0
                },
                {
                    "sent": "We could.",
                    "label": 0
                },
                {
                    "sent": "You know we haven't added this.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is.",
                    "label": 0
                },
                {
                    "sent": "From what you said in the beginning and also from the pictures you have shown, it seems to me that you are really clustering on the level of whole trajectory.",
                    "label": 0
                },
                {
                    "sent": "Yes, but later on it was no longer that clear to me that you are really doing this and if you are doing it, my question is what type of distance measure?",
                    "label": 0
                },
                {
                    "sent": "Similarity measure on trajectories are you're using explicitly or implicitly, and what are you doing?",
                    "label": 0
                },
                {
                    "sent": "I mean, if a new customer comes, you have a single observation.",
                    "label": 0
                },
                {
                    "sent": "It's not yet a trajectory.",
                    "label": 0
                },
                {
                    "sent": "So how do you compare it to other projective?",
                    "label": 0
                },
                {
                    "sent": "Thank you for the question.",
                    "label": 1
                },
                {
                    "sent": "This may be fine.",
                    "label": 0
                },
                {
                    "sent": "I didn't stress enough.",
                    "label": 0
                },
                {
                    "sent": "So what we do is actually if you have a.",
                    "label": 0
                },
                {
                    "sent": "If you want to update your clustering or any for clustering, what we use actually is.",
                    "label": 0
                },
                {
                    "sent": "How close is our new observation is to the cloud, to the estimated cluster center?",
                    "label": 0
                },
                {
                    "sent": "So maybe let's go to this.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know at the beginning.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so if this new observation comes, but we actually have at this moment in time is we have a probability distribution on this cluster, then we can use this to calculate the probability that this particular measurement was generated by this cluster.",
                    "label": 0
                },
                {
                    "sent": "And then we also have to cooperate using the formulas from the generative model multiplied with the probability data so.",
                    "label": 0
                },
                {
                    "sent": "That we've got this series of observations of measurements.",
                    "label": 0
                },
                {
                    "sent": "And by that we get the probability that this individual was connected by this cluster an as we can.",
                    "label": 0
                },
                {
                    "sent": "This is simply a multiplication step.",
                    "label": 0
                },
                {
                    "sent": "So actually what we did is we recommend a low rate, modeling it up to about numerical problems.",
                    "label": 0
                },
                {
                    "sent": "But this is a thing we can do online so.",
                    "label": 0
                },
                {
                    "sent": "But for the updates that what you really do is actually that in every point in time you are calculating.",
                    "label": 0
                },
                {
                    "sent": "Probability likelihood that this this point was generated by this cluster, and you use this then As for the update.",
                    "label": 0
                },
                {
                    "sent": "But the Cluster Center is a trajectory.",
                    "label": 0
                },
                {
                    "sent": "The class center well.",
                    "label": 0
                },
                {
                    "sent": "The cost of center itself is.",
                    "label": 0
                },
                {
                    "sent": "If you look at what time central tractor but given point in time, simply according to the set of coordinates and also like the higher order movements like speed, acceleration at this point in time.",
                    "label": 0
                },
                {
                    "sent": "So this is actually then what you use to integrate somehow the trajectory information into it.",
                    "label": 0
                },
                {
                    "sent": "So as you know that if this if if a glass door is like I mean this case if it's like moving in this direction then you will see this in the state in the state space.",
                    "label": 0
                },
                {
                    "sent": "If you include these terms into the state space.",
                    "label": 0
                },
                {
                    "sent": "And this is that the idea to use a here kind of rich state where you consider these terms as well.",
                    "label": 0
                },
                {
                    "sent": "For to get the trajectories into the mall.",
                    "label": 0
                },
                {
                    "sent": "OK, any questions?",
                    "label": 0
                },
                {
                    "sent": "Speak again.",
                    "label": 0
                }
            ]
        }
    }
}