{
    "id": "nw6kraqv6oz7rq74dfp4ex6t3a6xujkf",
    "title": "Frequent Regular Itemset Mining",
    "info": {
        "author": [
            "Salvatore Ruggieri, Dipartimento di Informatica, University of Pisa"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Data Mining"
        ]
    },
    "url": "http://videolectures.net/kdd2010_ruggieri_fri/",
    "segmentation": [
        [
            "Which is a located by providing."
        ],
        [
            "On site service, additional equipment.",
            "High percent.",
            "Switch.",
            "You should be easy for innovation and we have a need of this program you through too many frequent admin center that provides more."
        ],
        [
            "Information that we did not easy.",
            "So we're both borderline.",
            "Is that the reason?"
        ],
        [
            "Addiction, such as opposed to higher, said you don't need directly interpretable by.",
            "Just give me a sample."
        ],
        [
            "The simple, the comparison database and for the Golden items in ABC, here you have.",
            "These are prepared packets at the interface of Passover appearance.",
            "But the."
        ],
        [
            "If you give to alarmist Augusta, this set of course it happens and it is difficult for a whole style.",
            "They said of icons."
        ],
        [
            "The cost of doing home baby CD.",
            "Please ask look at subsets or baby TV and also to subsets of other crossing the items and so in this sense."
        ],
        [
            "It's not before the end competition."
        ],
        [
            "So after this introduction paper in taxation in Ocean Island setting, we trust that has equal an animal position of the market and that one size as compared with the growth height.",
            "Yes.",
            "Example of."
        ],
        [
            "About 2 feet.",
            "Regular practices, which will be exactly this one and this one.",
            "The first one means the glass.",
            "Any combination of ABCD and we lost any running combination for 8:10."
        ],
        [
            "So the Ask toolbar recorder few."
        ],
        [
            "Application.",
            "We consider an evaluation variants operation and evacuates classes which are both Action Center which have the same cover over you.",
            "On closed items are maximal element cities, glass free iconset, army modern elements."
        ],
        [
            "Yeah, exactly essentially supported me and extended that I can accept the user iMac, iMac him or not in class?",
            "Or not.",
            "Then said we missed our operator or an admin set within the classroom curriculum.",
            "And they tended meaning hold on extended I am is that 80 is just this summer meaning."
        ],
        [
            "Age with the market needs that they may or may not be here.",
            "An 818 gauge star means that any subset of those may appear and a one 8 gauge loss means that any nonempty subsets near me.",
            "So actually they said for having set, then open the by extended item or an extended partition schema here, and this is precisely what.",
            "I said before the meeting, OK is just the."
        ],
        [
            "It may be the meeting with home page?",
            "Is 884.",
            "I accept and the meaning of stars and lacerate or R&B are getting upset over the pain and suffering.",
            "The meaning of overnight.",
            "Send that item set which is a sequence of it's an Italian is given by just looking at this market over the beach.",
            "Extended argument me and this Maps of an extended Arkansas.",
            "Cambodia.",
            "You see, we can.",
            "Repeat for Saturday.",
            "I can see.",
            "Yeah, I said more trees to look at their color or their extent of the artist set in this market.",
            "So I extended that in this case for example."
        ],
        [
            "That would be an extended and hyper 18?",
            "There are two items at the market, but they are different colors, so actually we are interested in."
        ],
        [
            "And the doctor said that we shared the.",
            "Which obviously means in their smart disappeared before it's disabled.",
            "So we define regular."
        ],
        [
            "Having said those extended I customer service said every time in Sydney it's marketing.",
            "So it's important we are in."
        ],
        [
            "Nations can work.",
            "The reasons to support at home."
        ],
        [
            "Don't know, yeah yeah, this definition we can save me to find the folder or when they were hyping as before already.",
            "I just semantics and supporters besides over any color."
        ],
        [
            "The program we want to press it is how to mine a concise dissipation of the.",
            "Once a certification and seeing all I said, Baker acted so will reach every damn time and said the Hindi they offered by sound an by plus one over there.",
            "They were participating in science fiction."
        ],
        [
            "Another bomb this isolation fences."
        ],
        [
            "People post in our data center but experimental will show that we decide we can extract the insights and presentation which are multiple."
        ],
        [
            "After how do we perceive that they may be actually is to start from the close attack and said the end real Princess in different class.",
            "For instance, consider D."
        ],
        [
            "We can then all of the this subplot is served by just taking deep and ABA is subsequence or a subset of KC and."
        ],
        [
            "By moving to BA can do the same thing.",
            "And."
        ],
        [
            "The same people receiving.",
            "For frequent items that indicate this class uncovered mother, Fortunately some are covered by more than."
        ],
        [
            "An exam doctor.",
            "So the problem is."
        ],
        [
            "OK 45 slot, but for the second one we would like to express those items that we charge in this MoD pizza or Ba City star, but not in this market so previously.",
            "Whole figures, not extend the documents that they need in this series."
        ],
        [
            "No, do they turn into member?",
            "Introduce our apartment.",
            "That extension called the normal procedure, are concerned where the minors of regular Now means any subset of AYAH apart from their Kool aid.",
            "Ykh this extension is not positional, which means we cannot reverse line Alex because as the same difficulties.",
            "What is this function under to find out?",
            "Homicides, everything big."
        ],
        [
            "How do we proceed?",
            "OK, if we are given as a closed until September, it's pencil freon is that these are normal position and Highland Center architects are recovered.",
            "Just go to see in example."
        ],
        [
            "We want the weekend at polar at the Oscars rewrites my filing PPC star, and as a signal on the opposition Happen V 8 + 3 minus, which means that we must not appear in Massapequa and CD star and as a Member what we see lost the personal computer V8 muscle car here because.",
            "He is covered by the treatment plan and a D star."
        ],
        [
            "So then the next problem, how do we write these three or this sequence alone and not official until I say probably make a lot of typing said in the paper there is.",
            "Simple rules here.",
            "We don't have that."
        ],
        [
            "In fact, if we must put up here, he's here.",
            "We can remove these anymore clearance for the assault.",
            "Be completely A and we are left with the star, which is just as you made following overproof and see."
        ],
        [
            "So that maybe we can derive a VC.",
            "Then starting from those two months with their doctors appointment so far."
        ],
        [
            "Not today, but we can.",
            "These two lines through the attic we got into.",
            "Hey Roger.",
            "Plus 18 Main St South Bend over Casey."
        ],
        [
            "And this is the final result in the paper that discusses or rules."
        ],
        [
            "One or the other sleeping on shoulder.",
            "Harness it into I said over regular items that actually this is the normal system, but the results you're opposed to draws the search space for these simple rules and laws to leave an example.",
            "On Monday morning."
        ],
        [
            "Or Ibiza this case?",
            "We can we end up with a cover of this part, this part and finally.",
            "Invite CD 8 so there.",
            "Wake up with these exact words that start to form an extraction so we can end up with two or more label arriving."
        ],
        [
            "Restrooms are most people because we just consider how we can exploit the classes are able to measure.",
            "Regular accent is simplest way is that if we have one power plant apart last eight.",
            "Of course this can be merging into hard a question mark, which means they may be normal president and the other rules are simply variations of these."
        ],
        [
            "So find out that it was a dog breeds where he's actually post processing under, partly because we purchased our requires Restart grossed out instead.",
            "Then it said that we set to English class for the previous.",
            "Then we build the opposition Highland circle.",
            "Considering the sequencing some more lotion.",
            "DH and access and the stock.",
            "The marriage of the vapor of consent from these revisions.",
            "Or what?"
        ],
        [
            "Is your name.",
            "We have X elementally.",
            "Right different man, because the order will feature.",
            "Be honest, I consider the."
        ],
        [
            "That is right under the site for the result and actually invest or there is it this one."
        ],
        [
            "Maybe use the evening much size the generic paper where I had said that is allegedly, but then another one, even the size and form over the first one is less than the site of the signals or beside their own people.",
            "And the first line makes graphically shorter than typical."
        ],
        [
            "Hey sorry had to resolve the gas to show that important then start setting up in this case.",
            "Yeah, grows into and vagrant happens inside that.",
            "We are almost the same."
        ],
        [
            "Four spots data set it apart from the Ms Word.",
            "If you want real December itself is useless.",
            "Surprising because for parts data set on site server presentations.",
            "Have no good performance."
        ],
        [
            "So that's going to drive improvements.",
            "We propose a regular habit.",
            "Segments are easy to understand, more yards.",
            "For science Visitation and we can close the tablet with factor.",
            "Can I use a Walker?"
        ],
        [
            "Wishing the approach inside the instructional approaches the islands and on at host processing an image skin ginger the use of regular action setting already learned Association rules."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is a located by providing.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On site service, additional equipment.",
                    "label": 0
                },
                {
                    "sent": "High percent.",
                    "label": 0
                },
                {
                    "sent": "Switch.",
                    "label": 0
                },
                {
                    "sent": "You should be easy for innovation and we have a need of this program you through too many frequent admin center that provides more.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Information that we did not easy.",
                    "label": 0
                },
                {
                    "sent": "So we're both borderline.",
                    "label": 0
                },
                {
                    "sent": "Is that the reason?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Addiction, such as opposed to higher, said you don't need directly interpretable by.",
                    "label": 0
                },
                {
                    "sent": "Just give me a sample.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The simple, the comparison database and for the Golden items in ABC, here you have.",
                    "label": 0
                },
                {
                    "sent": "These are prepared packets at the interface of Passover appearance.",
                    "label": 0
                },
                {
                    "sent": "But the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you give to alarmist Augusta, this set of course it happens and it is difficult for a whole style.",
                    "label": 0
                },
                {
                    "sent": "They said of icons.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The cost of doing home baby CD.",
                    "label": 0
                },
                {
                    "sent": "Please ask look at subsets or baby TV and also to subsets of other crossing the items and so in this sense.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's not before the end competition.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So after this introduction paper in taxation in Ocean Island setting, we trust that has equal an animal position of the market and that one size as compared with the growth height.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Example of.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About 2 feet.",
                    "label": 0
                },
                {
                    "sent": "Regular practices, which will be exactly this one and this one.",
                    "label": 0
                },
                {
                    "sent": "The first one means the glass.",
                    "label": 0
                },
                {
                    "sent": "Any combination of ABCD and we lost any running combination for 8:10.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the Ask toolbar recorder few.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Application.",
                    "label": 0
                },
                {
                    "sent": "We consider an evaluation variants operation and evacuates classes which are both Action Center which have the same cover over you.",
                    "label": 0
                },
                {
                    "sent": "On closed items are maximal element cities, glass free iconset, army modern elements.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, exactly essentially supported me and extended that I can accept the user iMac, iMac him or not in class?",
                    "label": 0
                },
                {
                    "sent": "Or not.",
                    "label": 0
                },
                {
                    "sent": "Then said we missed our operator or an admin set within the classroom curriculum.",
                    "label": 0
                },
                {
                    "sent": "And they tended meaning hold on extended I am is that 80 is just this summer meaning.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Age with the market needs that they may or may not be here.",
                    "label": 0
                },
                {
                    "sent": "An 818 gauge star means that any subset of those may appear and a one 8 gauge loss means that any nonempty subsets near me.",
                    "label": 0
                },
                {
                    "sent": "So actually they said for having set, then open the by extended item or an extended partition schema here, and this is precisely what.",
                    "label": 0
                },
                {
                    "sent": "I said before the meeting, OK is just the.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It may be the meeting with home page?",
                    "label": 0
                },
                {
                    "sent": "Is 884.",
                    "label": 0
                },
                {
                    "sent": "I accept and the meaning of stars and lacerate or R&B are getting upset over the pain and suffering.",
                    "label": 1
                },
                {
                    "sent": "The meaning of overnight.",
                    "label": 0
                },
                {
                    "sent": "Send that item set which is a sequence of it's an Italian is given by just looking at this market over the beach.",
                    "label": 0
                },
                {
                    "sent": "Extended argument me and this Maps of an extended Arkansas.",
                    "label": 1
                },
                {
                    "sent": "Cambodia.",
                    "label": 0
                },
                {
                    "sent": "You see, we can.",
                    "label": 0
                },
                {
                    "sent": "Repeat for Saturday.",
                    "label": 0
                },
                {
                    "sent": "I can see.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I said more trees to look at their color or their extent of the artist set in this market.",
                    "label": 0
                },
                {
                    "sent": "So I extended that in this case for example.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That would be an extended and hyper 18?",
                    "label": 0
                },
                {
                    "sent": "There are two items at the market, but they are different colors, so actually we are interested in.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the doctor said that we shared the.",
                    "label": 0
                },
                {
                    "sent": "Which obviously means in their smart disappeared before it's disabled.",
                    "label": 0
                },
                {
                    "sent": "So we define regular.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Having said those extended I customer service said every time in Sydney it's marketing.",
                    "label": 0
                },
                {
                    "sent": "So it's important we are in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nations can work.",
                    "label": 0
                },
                {
                    "sent": "The reasons to support at home.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Don't know, yeah yeah, this definition we can save me to find the folder or when they were hyping as before already.",
                    "label": 0
                },
                {
                    "sent": "I just semantics and supporters besides over any color.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The program we want to press it is how to mine a concise dissipation of the.",
                    "label": 0
                },
                {
                    "sent": "Once a certification and seeing all I said, Baker acted so will reach every damn time and said the Hindi they offered by sound an by plus one over there.",
                    "label": 0
                },
                {
                    "sent": "They were participating in science fiction.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another bomb this isolation fences.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People post in our data center but experimental will show that we decide we can extract the insights and presentation which are multiple.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After how do we perceive that they may be actually is to start from the close attack and said the end real Princess in different class.",
                    "label": 0
                },
                {
                    "sent": "For instance, consider D.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can then all of the this subplot is served by just taking deep and ABA is subsequence or a subset of KC and.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By moving to BA can do the same thing.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same people receiving.",
                    "label": 0
                },
                {
                    "sent": "For frequent items that indicate this class uncovered mother, Fortunately some are covered by more than.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An exam doctor.",
                    "label": 0
                },
                {
                    "sent": "So the problem is.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK 45 slot, but for the second one we would like to express those items that we charge in this MoD pizza or Ba City star, but not in this market so previously.",
                    "label": 0
                },
                {
                    "sent": "Whole figures, not extend the documents that they need in this series.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, do they turn into member?",
                    "label": 0
                },
                {
                    "sent": "Introduce our apartment.",
                    "label": 0
                },
                {
                    "sent": "That extension called the normal procedure, are concerned where the minors of regular Now means any subset of AYAH apart from their Kool aid.",
                    "label": 0
                },
                {
                    "sent": "Ykh this extension is not positional, which means we cannot reverse line Alex because as the same difficulties.",
                    "label": 0
                },
                {
                    "sent": "What is this function under to find out?",
                    "label": 0
                },
                {
                    "sent": "Homicides, everything big.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How do we proceed?",
                    "label": 0
                },
                {
                    "sent": "OK, if we are given as a closed until September, it's pencil freon is that these are normal position and Highland Center architects are recovered.",
                    "label": 0
                },
                {
                    "sent": "Just go to see in example.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We want the weekend at polar at the Oscars rewrites my filing PPC star, and as a signal on the opposition Happen V 8 + 3 minus, which means that we must not appear in Massapequa and CD star and as a Member what we see lost the personal computer V8 muscle car here because.",
                    "label": 0
                },
                {
                    "sent": "He is covered by the treatment plan and a D star.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So then the next problem, how do we write these three or this sequence alone and not official until I say probably make a lot of typing said in the paper there is.",
                    "label": 0
                },
                {
                    "sent": "Simple rules here.",
                    "label": 0
                },
                {
                    "sent": "We don't have that.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact, if we must put up here, he's here.",
                    "label": 0
                },
                {
                    "sent": "We can remove these anymore clearance for the assault.",
                    "label": 0
                },
                {
                    "sent": "Be completely A and we are left with the star, which is just as you made following overproof and see.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that maybe we can derive a VC.",
                    "label": 0
                },
                {
                    "sent": "Then starting from those two months with their doctors appointment so far.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not today, but we can.",
                    "label": 0
                },
                {
                    "sent": "These two lines through the attic we got into.",
                    "label": 0
                },
                {
                    "sent": "Hey Roger.",
                    "label": 0
                },
                {
                    "sent": "Plus 18 Main St South Bend over Casey.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is the final result in the paper that discusses or rules.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One or the other sleeping on shoulder.",
                    "label": 0
                },
                {
                    "sent": "Harness it into I said over regular items that actually this is the normal system, but the results you're opposed to draws the search space for these simple rules and laws to leave an example.",
                    "label": 0
                },
                {
                    "sent": "On Monday morning.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or Ibiza this case?",
                    "label": 0
                },
                {
                    "sent": "We can we end up with a cover of this part, this part and finally.",
                    "label": 0
                },
                {
                    "sent": "Invite CD 8 so there.",
                    "label": 0
                },
                {
                    "sent": "Wake up with these exact words that start to form an extraction so we can end up with two or more label arriving.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Restrooms are most people because we just consider how we can exploit the classes are able to measure.",
                    "label": 0
                },
                {
                    "sent": "Regular accent is simplest way is that if we have one power plant apart last eight.",
                    "label": 0
                },
                {
                    "sent": "Of course this can be merging into hard a question mark, which means they may be normal president and the other rules are simply variations of these.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So find out that it was a dog breeds where he's actually post processing under, partly because we purchased our requires Restart grossed out instead.",
                    "label": 0
                },
                {
                    "sent": "Then it said that we set to English class for the previous.",
                    "label": 0
                },
                {
                    "sent": "Then we build the opposition Highland circle.",
                    "label": 0
                },
                {
                    "sent": "Considering the sequencing some more lotion.",
                    "label": 0
                },
                {
                    "sent": "DH and access and the stock.",
                    "label": 0
                },
                {
                    "sent": "The marriage of the vapor of consent from these revisions.",
                    "label": 0
                },
                {
                    "sent": "Or what?",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is your name.",
                    "label": 0
                },
                {
                    "sent": "We have X elementally.",
                    "label": 0
                },
                {
                    "sent": "Right different man, because the order will feature.",
                    "label": 0
                },
                {
                    "sent": "Be honest, I consider the.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is right under the site for the result and actually invest or there is it this one.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe use the evening much size the generic paper where I had said that is allegedly, but then another one, even the size and form over the first one is less than the site of the signals or beside their own people.",
                    "label": 0
                },
                {
                    "sent": "And the first line makes graphically shorter than typical.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey sorry had to resolve the gas to show that important then start setting up in this case.",
                    "label": 0
                },
                {
                    "sent": "Yeah, grows into and vagrant happens inside that.",
                    "label": 0
                },
                {
                    "sent": "We are almost the same.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Four spots data set it apart from the Ms Word.",
                    "label": 0
                },
                {
                    "sent": "If you want real December itself is useless.",
                    "label": 0
                },
                {
                    "sent": "Surprising because for parts data set on site server presentations.",
                    "label": 0
                },
                {
                    "sent": "Have no good performance.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's going to drive improvements.",
                    "label": 0
                },
                {
                    "sent": "We propose a regular habit.",
                    "label": 0
                },
                {
                    "sent": "Segments are easy to understand, more yards.",
                    "label": 0
                },
                {
                    "sent": "For science Visitation and we can close the tablet with factor.",
                    "label": 0
                },
                {
                    "sent": "Can I use a Walker?",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Wishing the approach inside the instructional approaches the islands and on at host processing an image skin ginger the use of regular action setting already learned Association rules.",
                    "label": 0
                }
            ]
        }
    }
}