{
    "id": "nx3qnlelu6zp2dv3r2ubdxtrgkacbkvq",
    "title": "Abandoned Sitarjevec mine and endangerment of the Litija town",
    "info": {
        "author": [
            "Uroš Herlec, Faculty of Natural Sciences and Engineering, University of Ljubljana"
        ],
        "published": "June 7, 2010",
        "recorded": "March 2010",
        "category": [
            "Top->Earth Sciences->Hydrology->Hydrogeology"
        ]
    },
    "url": "http://videolectures.net/outbursts_herlec_asme/",
    "segmentation": [
        [
            "The teacher didn't know stroking, but the curriculum of predicting Lennon she completely the artist goes to you said that it only as a conditional systole is Pilkey supervision in the local nearest mirror.",
            "The Code of Civil Ownership interest in the politically more sneaker store owner is not so many when I should problematic in seemingly more than Ashes activity or the driver.",
            "So the working language for scientific and professional things which are connected to the acid mine water drainage and of course also water outbursts and water explosion problems.",
            "We're going to present our lectures in English for the topics which are more locally oriented and maybe might not be so interested for our distinguished guests.",
            "We will present them only in.",
            "Green language.",
            "So I would like to start.",
            "Goals and 30 points and goals of.",
            "Our conference, which is called the civil Converse of water from abandoned mines, causes consequences, renovation and force.",
            "Hello, what are the most important courses for organization of this international conference?",
            "Historical center of the town is obviously endangered by the possibility of water explosion or outbursts of mine waters from edits of the abandoned city Rio.",
            "That's mine, which is actually edits are 70 meters above the town, and the estimated quantity of demand water is more than 6000 cubic meters.",
            "Mainly neutral, but some in some and it's also acid.",
            "Mine water accumulated in last decades due to gradual limitation of acid.",
            "Mine water drainage, which is the course of specific do chemical environment in this mind.",
            "This is primarily the precipitation of lunatic settlements at so called Geo Chemical border with the transition from anoxic to oxic environment.",
            "Outbursts water explosion already happened in the history.",
            "And so these two events were documented in 1895 and much more in detail 1932.",
            "So we have the history of accidents already.",
            "Preliminary study on the situation here in the abandoned mine was done already in the year 2004 by experts of the faculty and for natural science isn't in generic University free planner and also results of the Special study which was financed by the Ministry of Environment and Spatial Planning done by institutes for Mining Geo Technology and Environment.",
            "So could you go was done?",
            "Three years ago.",
            "All these studies confirmed permanent in their judgment to the life and health of human animals.",
            "And of course, the proper property as well due to the possibility of repeated outbursts in the area.",
            "And of course.",
            "Transportation of gank rock and minerals and of course of settlement.",
            "Lunatic settlements according Yellowboy, which is which has accumulated in the mind itself.",
            "Unfortunately, so far the state authoritie's did not put priorities onto the projects of its remediation and to the project of the proper closure.",
            "Micosoft repeated outbursts of the mind waters from the abundant cigarettes mine we expect huge destructive power of the outburst water large and fast erosion of old ganggu and tailings from the plateau in front of the edit entrance and of course sedimentation of all this material into historic central idiot al as it happened in the previous accidents.",
            "Extremely large problem could be the transport of fun, great Community, lunatic mine sediment with heavy toxic elements from the flooded mine into the River, Sava of course because due to the fact that we have.",
            "Plan for the voter accumulations and inverter accumulation.",
            "There is segmentation of a lot of organic matter and do chemical environment in such.",
            "Snow accumulations can change, and three transportation of toxic elements from the sediments into the water can be easily done.",
            "In the so far explored, partly flooded edits, there is huge quantity of 1 grains of sediment, mainly made of precipitated, extremely fine grades.",
            "Eliminate actually X Ray diffraction showed that there are only the most strongest picks available, so it's a little still quite amorphic.",
            "Kind of lemonade.",
            "And of course this settlement is heavily contaminated with heavy toxic elements.",
            "Transport into the environment.",
            "The previous seven moods cause big problems.",
            "Problems for very, very long time.",
            "We can find out that similar critical conditions are also present in the flooded mine.",
            "Cannot pushing it more than about 40 kilometers from here and there.",
            "Judgment of people animals are property by the accidents exists also there at the entrance of the transport added from the mind.",
            "Our colleagues will present this problem of the Copper mine later on after the cigarettes presentation of cigarettes minutes case.",
            "Organizers of the conference, we believe that there could be similar conditions at some other abandoned mines in Slovenia.",
            "Unfortunately, there is no.",
            "Satisfying cadastre or inventory of abundant minds of historic abundant, nice.",
            "Of course we can follow the historic minds, let's say till the beginning of First World War and a few years earlier.",
            "But some of this historic minds have not been documented, but we can easily see in the field that they exist.",
            "Of course, such cases can be.",
            "Quite problematic in future as it's documented in some cases that quite so.",
            "That means explosions have happened already.",
            "Presentation of scientific research results on abundant Mind secrets in command project and of course with the comparison of update.",
            "Research of this type of problematics in other European states.",
            "We plan to define and emphasize processes which leads to the retention accumulation and of course of flooding offline waters within about 2 miles and of course.",
            "Which are causes for transport of toxic elements and of cozy.",
            "Also, for the transport of elements with the solution, and of course settlement outflow.",
            "So results on the research and causes and consequences.",
            "Methods for their prevention as well as urgent, more or less efficient, durable methods of remediation and necessary methods of monitoring will be presented by our distinct creation.",
            "Distinguished guests from Ireland, United Kingdom, Spain, Austria and Slovakia.",
            "In the state of Sylvania.",
            "Scientists and professionals obviously, if not not yet succeeded to convince the governmental authorities with all the mentioned evidence, evidences for the immediate and urgent action as well as we could not convince them into long-term, formal, systematic arrangement of this problematic which is.",
            "But this is the fact.",
            "Let's say we tried to approach to the Ministry of Environment and Spatial Planning as well as Ministry for Economic for last six years.",
            "With so many different ministers and so many different clerks at the ministries.",
            "But we were not hurt enough and we believe that.",
            "Sign some kind of pressure should be put into the into the States and of course we cannot take anymore the moral load.",
            "More obligation if such accidents, which were documented as well documented in the past would happen again.",
            "Actually, all of people dealing with this problematic in Slovenia are saying we cannot stand anymore if accident happened.",
            "They will all say why weren't you resistive?",
            "Why weren't you hard enough to convince people around?",
            "You are the one who knows the most, and if you know the most, it's your task to put pressure to show your voice to the government and authorities.",
            "And that's why we have organized this conference.",
            "Today unfortunately, we need to point out that minds are formally closed in Slovenia with the end of production and of course with the formal conclusion closure of the concession rights for the extraction for the mining exploitation.",
            "In spite that there are still possible dangerous source of toxic elements.",
            "Of course, nowadays every project for the mine closure needs to have all details about the remediation about the neutralization of water and so on.",
            "But Slovene legislations X and Fortunately do not define competence and responsibility for such already known.",
            "Old mines, historic remains, and let's say there is kind of gap between the recent mine and historic mind and kind of gap.",
            "Double another or white area which is not covered by our legislation.",
            "So all 2 bedroom eyes are not under the competence and responsibility of the Mining Act which is part of the Authority Ministry of Economy.",
            "Neither are covered by the law of the Nature Conservation Ministry for Environment and Special Planning.",
            "So for their monitoring and eventual risking of problematic in the state of Slovenia.",
            "Normally nobody is competent in spite of doubtless danger for life and health of inhabitants in their vicinity, and of course, in spite of ecological threats for water compilation along water outflow.",
            "My kids lectures will give insight into legislations in other European states, which of course have had some problems in the past, but Luckily they are solving them more successful, more successfully.",
            "And of course, the most important thing is who is responsible for financing of such monitoring and eventual interventions into abundance in their states.",
            "What are the conference goals?",
            "Our plan is to form international, scientific and professional set of arguments defining causes, consequences and metals.",
            "Methods for disabling of water explosions of outbursts of mine water from above 9 cent.",
            "Of course, there remediation plan to form proposal to the state opportunities for improvement of the system state competencies and modes of financing the wrestling.",
            "Injured minds and service city.",
            "Of course, on the higher significant professional levels, we will Additionally support the establishment of immediate urgent underground geological and mining intervention research and exploration of the abundant cigarettes mind and of course.",
            "Which is above the leaky account and also cannot put your mind to remove causes for.",
            "Accident generation and danger.",
            "Our goals in future is also to propose change the states authorities out tourist this approach to US methodology for remediation of mines in specific Geo chemical environments as I pointed out we can find in rocks of Upper Carboniferous age in the area of Lithia Town until Cinderella.",
            "Area of need watered down with a copper mine.",
            "Because in the past in Slovenia was thought that minds can be easily closed forever.",
            "But this is true also with the specific environments.",
            "Environments within the carbonate rocks where we usually do not have problems but with a specific due chemical environments where you have precipitation of yellowboy of settlements which do not allow water.",
            "To discharge properly and accumulate in the old edits.",
            "Of course, such kind of remediation.",
            "Then closure is not possible and there is a need for regular yearly monitoring of the Alex, not all but the most important is iaccessible my horizens, disabling the formation of water by water accumulation and of course to mediate outflow of contaminated acid.",
            "Mine waters with fine grades, toxic sediments which needs to be.",
            "Of course quotes in place and you do not.",
            "We can't let them out.",
            "To water sheds and into the OR moment.",
            "This is actually maybe a little bit long introduction, but I believe that it is very important to all of us to understand what's going on.",
            "What's our main problem?",
            "What's our pain, and what we need to solve in the future?",
            "So if there is any questions, any questions please, just.",
            "Stop me and we can solve something so we can sort out.",
            "Everything's so if there are any questions or comments I would like to continue with the lecture which is called bundled historics spirits mine, which is actually Hiram Mercury.",
            "Let's silver and bright mine enforce endangerment ability at all due to possible water outburst of mine water.",
            "This event I would like to thank cordially to Emeritus Professor recruited by June and of course to our team Professor, Doctor.",
            "Who gave us support for all last six years to continue to persist into?",
            "Let's say our determination to find the way to solve this."
        ],
        [
            "Homes.",
            "So romantic of the.",
            "It's mine.",
            "It's quite complex.",
            "As I mentioned, its historic mind, and in the medieval times.",
            "Started on this Hill separated skill which is about 250 meters that talk about the.",
            "Moment I believe we are somewhere here in the main building from the.",
            "Piano.",
            "There is a truck.",
            "And I need to point out that there is about 14 kilometers of edits and implants done in this area.",
            "I made this problematic maybe."
        ],
        [
            "Years ago, due to the fact that collectors of minerals inform me that here can be found.",
            "Very nice mineral specimens, quite quite complex immunization and I was shocked with the fact that in this book you can find open shafts and edit.",
            "Of course this is something which cannot happen.",
            "The Secrets Hill is also an area of sport activities.",
            "There are lot of runners.",
            "There are a lot of people collecting mushrooms and blueberries and for such things are extremely extremely dangerous.",
            "We have found out that there are nine open shots in the air."
        ],
        [
            "Course.",
            "Broached the areas where minerals were found my main activity at the University is mineral deposits studies, so I'm interested into the genetic environment of specific mineral deposits and due to the fact that this mine was formally close to 1965 and there was not many research articles on that we went into the mind trying to find some.",
            "Thanks of course I wanted to check also what's the.",
            "They enjoy our memory collectors are taking during their.",
            "I'm at their work and so I must admit this is quite shocking that people can easily come in and out.",
            "While we know very much that this is the most adrenaline type of sports probably ever invented."
        ],
        [
            "But you know when there is.",
            "Huge love there is not much brains included in such things and we'd love to the minerals.",
            "Of course, many other things can happen.",
            "Particular minerals were found.",
            "Colleague of mine will present them tomorrow.",
            "Also, I must point out that due to the mineral specimens in our collections Natural History Museum at the University and of course also in Vienna and other old mining schools.",
            "So previously in 1990 this area was defined as outcrop or let's say some area of specific natural heritage."
        ],
        [
            "Value, which is also very important.",
            "Spectacular cerussite crystals, switches left carbonate crystals were found also native left."
        ],
        [
            "Mercury and so on.",
            "What was the main point for the mining at the beginning?",
            "Beginning in medieval there were written documents that they were mining iron ore.",
            "But later on in 1850 they have found silver.",
            "Cinnabar was of course and still is a source of Mercury which was extremely important for the gold production and during the monarchy they were.",
            "Extracting kids alot.",
            "The second most important funeral was belina."
        ],
        [
            "And after dinner there were also ways of bright orange souffle which was used for colors and of course for drilling."
        ],
        [
            "This weather actually I just found out that the area is full of edits and in clients that we started with the collection gathering of."
        ],
        [
            "Motion from the old mess and we realized that there is almost 350 meters.",
            "Spend from the top mining area to the bottom.",
            "Actually the lower part of mines are 90 meters below the River of Sava.",
            "And the quite interesting.",
            "Cause that's just before the First World War.",
            "It was written they have found and mined out the Wayne which have the bedding plant almost almost parallel to the to the stratification to the bedding and.",
            "It is quite fascinating, kind of Wayne.",
            "For six months away we did they mention with sickness, up to 7 meters with 250 by 150 meters, and what's the most important thing is that above and below there are shells.",
            "That means from."
        ],
        [
            "Your mechanic and fun for few very very soft rocks.",
            "Of course, I saw immediately that it is impossible for this big or body to be of the same type of immunization later on.",
            "I have proved that this is so called since the mentari or settings type of deposit in the beginning it was mind here in this area.",
            "Actually this is the northern slope and they have followed.",
            "With the set of horizons, this so called set except for point.",
            "But later on, after the First World War, they started to mind out the way type of nization so called root zone where or was not as rich, but still they were able to produce something before the Second World War.",
            "Second World War.",
            "There were German territories they can go on and at the end of production can be year 1964 or 5, which is the final date that they have my notes, mainly by or.",
            "I need to point out that the rock itself it's highly suspicious it's consists more than 50% of work and the main problem this area was.",
            "Miners disease, silicosis alot of people, bites, duties, facts and.",
            "Due to the main reason due to the fact that.",
            "The modern Slovenia in the area of machines there is huge letting synchronization carbonate rocks where there are.",
            "Not so many problems or not at all with silicosis.",
            "They decided to move there and to close the map, but at that time the closure of the mine was quite easy.",
            "You just took it out what you needed.",
            "And of course you put some sticks of dynamite.",
            "The entrance of the mind and close the line with blasting of the interest."
        ],
        [
            "OK, so we can see.",
            "So two areas of money facilities are present and also two different kinds of hydrological logic systems are defiance.",
            "This edits here presents were of course connected with source which followed one specific example of the body on the other side with the feeder root when zone we have somehow more spread it.",
            "Let's aerial photo edits and they have solved the problematic words with toric.",
            "Want to flooding with incline here which actually connect it all ends and allows the mind water to discharge the River of summer.",
            "It was done in 1920."
        ],
        [
            "This is this over there."
        ],
        [
            "Not just mirrors.",
            "I was also astonished by the fact that big part of Iaccessible, part of the mind."
        ],
        [
            "Is flooded and which was very interesting.",
            "Who?",
            "Who have floods the mind then, which we can see by mistake.",
            "We open this part are soft, are made of lemonade.",
            "Very imminent, but actually with the with your.",
            "You can open this board and so we can find out the percolation of water through the roof of the edit gave into the moments water which is extremely rich in irony, to plus at the entrance of the mind and it's of course there is a lot of oxygen and this siren 2 plus just turn into the air and three plus and precipitate.",
            "And it's interesting as you are going to see later on in the film that some tiny, tiny crusts of oxides are floating on the top of this water, and with the slow transport on the top of it, they form step by step, small crusts from them.",
            "And of course they are.",
            "Pushing the border there, pushing them higher and higher 'cause it's in this area which, let's say.",
            "Is 70 centimeters of this lunatic sentiment segments.",
            "And then we opened we let's 2.",
            "Flow more than 500 cubic meters of water.",
            "There was a group of.",
            "Superior councilors with us and so due to the water which undermined some parts of the mind in the incline without Woods, it was quite, let's say spectacular and and frustrating with voices of.",
            "Drunks of this Woods falling down to the shaft.",
            "Luckily we we nobody was hurt but it still remembered this event."
        ],
        [
            "Only 500 meters, which is suddenly.",
            "Which relates to suddenly flow into the mind, made a big change.",
            "Of course we can imagine what would happen with the outflow of 6000 cubic meters seen influence.",
            "I'm done.",
            "Slope of cigarettes just about.",
            "Development."
        ],
        [
            "Ultra.",
            "It's.",
            "Obviously that water in some parts is quite clean.",
            "Actually, it's maturity.",
            "Water along open fractions.",
            "That or water can come into the mind with the regular.",
            "Let's say pH, pH value and this used to have for drinking water, but on the other side there are lot of fractures above old stops which still have active sophistic minerals.",
            "Spireites, cinnabar Galina and specially most solubles follow right as well.",
            "And of course oxygen is consumed and.",
            "Each value is changed and transport of Byron and heavy metal toxic elements just start but on the floor of the edit.",
            "Actually.",
            "On the problem."
        ],
        [
            "So the open edits things precipitate and quite.",
            "Often.",
            "Spell themes, Stalock tights and stolid mites are formed which block the outflow of water.",
            "I was quite impressed by the fact that such stalactites can be formed from the limelites becauses in Sylvania area, with the prevailing carbonate works with more than 9000 case cars caves."
        ],
        [
            "We are used to have such kind of features made of calcium carbonate, whether parasite or minor."
        ],
        [
            "I like that.",
            "Also, quite spectacular forms can be generated.",
            "These are so called clinic spaghetti.",
            "We don't know exactly what happened with this one, but it was not the meat, just some kind of stuff."
        ],
        [
            "And so we have documented that such kind of static mites were formed on the transport routes transfer trade, which was active in 1965.",
            "So let's say we could prove that the speeds of growth was up to 4 centimeters in a year."
        ],
        [
            "Which is very fast.",
            "Well."
        ],
        [
            "So but nice."
        ],
        [
            "Interesting, spectacular.",
            "The other thing which was surprise was just kind of this kind of Jelly material below some static bytes I didn't know for a long time.",
            "What is this now we know that the start so called chemosynthetic.",
            "Organisms that these are actually the colony of bacteria which transform.",
            "H2S into Sue Faith and take energy for their life for that.",
            "This is special group of living creatures so called extra mites.",
            "And actually we're quite happy to have it.",
            "You do not."
        ],
        [
            "In other parts of Slovenia, in other minds or some other environment so.",
            "Where was the spot where the documented accidents happen?",
            "This is so called for more Europe.",
            "Which gave.",
            "Water for the accident in 1895 and 1932 and it's it was documented and also we have a witness of this event.",
            "That's water outflow lasted for almost half an hour and huge amount of sediment from the plateau in front of the entrance was transported in the air of church and some buildings over here.",
            "Of course, this time nobody took care of the lunatic settlement and toxic metals in India.",
            "But Luckily the time there were not many buildings in here, so the damage was not very big and you do.",
            "The fact that this happens.",
            "It's 2:00 o'clock in the night nobody was hurt.",
            "But today as I'm going to show their local building set a lot of property here of course.",
            "Consolato of people which can be huge problem.",
            "So this was the lower part of mineralisation so called said explanation and from this social mind mostly.",
            "Solar edits for mostly added and sore here Aug edit the transport of or from the August edits went with the steel rope transport to the smelter which was located to the other side of the River."
        ],
        [
            "OK, let's go on.",
            "So we did this mapping an observation we have defined that there are two hydrological systems means old FedEx type or body 250 by 150 or 76 miss you in relation.",
            "Actually ends here at this edit centimeters above the church, and we must say that when we clients, when we descend to this point, we have found out that water table.",
            "What level is here that means 22 meters above the entrance which are collected clips of morning, August and edit.",
            "So what are called is quite frustrating for us.",
            "We just vectorized the iaccessible data.",
            "That means that it's in this area and stops and we estimate you know that these surveying Kingdom I were not very good.",
            "Usually four stops.",
            "There are useful only for the transport and it's and we think that it can be 6000.",
            "Interest or more water underwater?",
            "Actually, from this end it just goes in the into the area into the outflow of the main trust, and it's transported by medics 650 meters long, so called solid.",
            "It's the other hydrological system.",
            "We believe that we need to define the level of urgency.",
            "Fastest possible for this part, cause the outflow quantity water is very low, and as we can see, the water cones form polar, but on the other side this summer edit.",
            "Will be.",
            "We can wait more due to the fact that there is continuous outflow.",
            "Actually we can not go through with you to some collapse trucks, but till the.",
            "Wanted the outflow corresponds to the quantity of majorek precipitation.",
            "Everything is alright, but if the water stops in the outflow.",
            "He says, we know that the fact is that water is accumulating here, and I believe that more than 350 cubic meters accumulated in this park, and let's say the difference from this level up to here where there is the next entrance of this hydrologic system is 51 meters higher.",
            "So in case of flooding.",
            "Open volume up to 50."
        ],
        [
            "Hooters this is the area which was flooded in 1895 and also in 1932.",
            "Now this nice."
        ],
        [
            "And of course, you can imagine 6000 cubic meters coming.",
            "The backyard of this building and afterwards out to the Main Street of Lydia # Woods."
        ],
        [
            "Make a big."
        ],
        [
            "Problem.",
            "We can still find some results.",
            "Some evidences of the past flood actually along this Gorge re transportation of the whole gang."
        ],
        [
            "Well, and of course a lot of."
        ],
        [
            "Settlement is better.",
            "The other problem, so as I mentioned so called.",
            "Overall, summary really shines out on the normal side of the Sisters here with the constant outflow of more or less constants about hundreds and 30 interests.",
            "But of course, when you close it, you can imagine that within two years and could have accumulation of 250 kilometers.",
            "Particulation so.",
            "We need to measure it.",
            "Need to follow it and react in case of problems, but I would really like to see what's behind to put some."
        ],
        [
            "There and the measure level.",
            "This is the area where this summer edit comes out.",
            "It was since let's say 1928 when water just discharged from the mind directly into the River.",
            "I must point out this was defined by.",
            "Doctor Mario ball.",
            "She has done the detailed research of the water and she found out that surprisingly.",
            "It is not very acid.",
            "The pH value, the average pH value is just 6.3 waters within the mind itself.",
            "It can be very acid, but Luckily somewhere on the way in the little part of the mind there are some bits of of Mars carbonaceous Mars which neutralize the water.",
            "So let's say the water is not healthy.",
            "Polluted.",
            "Water itself has only think.",
            "And so if it's above the.",
            "Allowed level, but I need to point out that the main problem is actually."
        ],
        [
            "The transport of fine grained sediment.",
            "In the year 1965, they have done a pluck.",
            "The concrete block here, and it was made of 6 meters of concrete.",
            "I must must point out that this concrete have been dissolved totally.",
            "We cannot find it anymore through the park, and that was before the rearranged."
        ],
        [
            "It's about flow.",
            "Later on the community.",
            "The other day, actually."
        ],
        [
            "Rich and organized.",
            "The proper way, but they must point out that the settlement still goes into the River server and analysis of settlements show."
        ],
        [
            "That's anomalies are."
        ],
        [
            "Quite high.",
            "So.",
            "We believe that the money needed for remediation and to for solving this problem would be about 2 million point 5 minutes.",
            "But the main problem would be how to solve the server."
        ],
        [
            "Edit which is very long, which is 650 meters long becausw it was done in the June mechanically very unpleasant rock, which is merely shells and thin, bedded, sandstones.",
            "So it's not very good work for such work and actually new edit.",
            "You done too.",
            "Enable the broker of discharge of the mind water.",
            "But on the other."
        ],
        [
            "Which is the most dangerous for the town of?"
        ],
        [
            "Politie it means to.",
            "Solve this problem.",
            "The water coming.",
            "I believe that we start opening, reopening of the old mind to make access to these parts measured what level to pump it out, maybe to enable it to outflow into the main shaft.",
            "We would get rid of the.",
            "Endangerment of the."
        ],
        [
            "What's needed?",
            "We need to convince proper people.",
            "Obviously professionals and scientists are not proper people for our government for our authorities.",
            "Unfortunately we were not successful so far, but I hope the conclusion of this conference.",
            "We will find power and of course also arguments to convince them to support.",
            "The system market.",
            "Reopening of the mine and also true.",
            "Find the group of specialists who can.",
            "Define the new mining claw in the proper way.",
            "With the including of the old abandoned mines.",
            "OK, this is the end of my presentation.",
            "I propose that we just take a look of the film with lunatic special teams, Stalag mites and stalactites, and afterwards we can discuss about the presenting problem.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The teacher didn't know stroking, but the curriculum of predicting Lennon she completely the artist goes to you said that it only as a conditional systole is Pilkey supervision in the local nearest mirror.",
                    "label": 0
                },
                {
                    "sent": "The Code of Civil Ownership interest in the politically more sneaker store owner is not so many when I should problematic in seemingly more than Ashes activity or the driver.",
                    "label": 0
                },
                {
                    "sent": "So the working language for scientific and professional things which are connected to the acid mine water drainage and of course also water outbursts and water explosion problems.",
                    "label": 0
                },
                {
                    "sent": "We're going to present our lectures in English for the topics which are more locally oriented and maybe might not be so interested for our distinguished guests.",
                    "label": 0
                },
                {
                    "sent": "We will present them only in.",
                    "label": 0
                },
                {
                    "sent": "Green language.",
                    "label": 0
                },
                {
                    "sent": "So I would like to start.",
                    "label": 0
                },
                {
                    "sent": "Goals and 30 points and goals of.",
                    "label": 0
                },
                {
                    "sent": "Our conference, which is called the civil Converse of water from abandoned mines, causes consequences, renovation and force.",
                    "label": 0
                },
                {
                    "sent": "Hello, what are the most important courses for organization of this international conference?",
                    "label": 0
                },
                {
                    "sent": "Historical center of the town is obviously endangered by the possibility of water explosion or outbursts of mine waters from edits of the abandoned city Rio.",
                    "label": 0
                },
                {
                    "sent": "That's mine, which is actually edits are 70 meters above the town, and the estimated quantity of demand water is more than 6000 cubic meters.",
                    "label": 0
                },
                {
                    "sent": "Mainly neutral, but some in some and it's also acid.",
                    "label": 0
                },
                {
                    "sent": "Mine water accumulated in last decades due to gradual limitation of acid.",
                    "label": 0
                },
                {
                    "sent": "Mine water drainage, which is the course of specific do chemical environment in this mind.",
                    "label": 0
                },
                {
                    "sent": "This is primarily the precipitation of lunatic settlements at so called Geo Chemical border with the transition from anoxic to oxic environment.",
                    "label": 0
                },
                {
                    "sent": "Outbursts water explosion already happened in the history.",
                    "label": 0
                },
                {
                    "sent": "And so these two events were documented in 1895 and much more in detail 1932.",
                    "label": 0
                },
                {
                    "sent": "So we have the history of accidents already.",
                    "label": 0
                },
                {
                    "sent": "Preliminary study on the situation here in the abandoned mine was done already in the year 2004 by experts of the faculty and for natural science isn't in generic University free planner and also results of the Special study which was financed by the Ministry of Environment and Spatial Planning done by institutes for Mining Geo Technology and Environment.",
                    "label": 0
                },
                {
                    "sent": "So could you go was done?",
                    "label": 0
                },
                {
                    "sent": "Three years ago.",
                    "label": 0
                },
                {
                    "sent": "All these studies confirmed permanent in their judgment to the life and health of human animals.",
                    "label": 0
                },
                {
                    "sent": "And of course, the proper property as well due to the possibility of repeated outbursts in the area.",
                    "label": 0
                },
                {
                    "sent": "And of course.",
                    "label": 0
                },
                {
                    "sent": "Transportation of gank rock and minerals and of course of settlement.",
                    "label": 0
                },
                {
                    "sent": "Lunatic settlements according Yellowboy, which is which has accumulated in the mind itself.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, so far the state authoritie's did not put priorities onto the projects of its remediation and to the project of the proper closure.",
                    "label": 0
                },
                {
                    "sent": "Micosoft repeated outbursts of the mind waters from the abundant cigarettes mine we expect huge destructive power of the outburst water large and fast erosion of old ganggu and tailings from the plateau in front of the edit entrance and of course sedimentation of all this material into historic central idiot al as it happened in the previous accidents.",
                    "label": 0
                },
                {
                    "sent": "Extremely large problem could be the transport of fun, great Community, lunatic mine sediment with heavy toxic elements from the flooded mine into the River, Sava of course because due to the fact that we have.",
                    "label": 0
                },
                {
                    "sent": "Plan for the voter accumulations and inverter accumulation.",
                    "label": 0
                },
                {
                    "sent": "There is segmentation of a lot of organic matter and do chemical environment in such.",
                    "label": 0
                },
                {
                    "sent": "Snow accumulations can change, and three transportation of toxic elements from the sediments into the water can be easily done.",
                    "label": 0
                },
                {
                    "sent": "In the so far explored, partly flooded edits, there is huge quantity of 1 grains of sediment, mainly made of precipitated, extremely fine grades.",
                    "label": 0
                },
                {
                    "sent": "Eliminate actually X Ray diffraction showed that there are only the most strongest picks available, so it's a little still quite amorphic.",
                    "label": 0
                },
                {
                    "sent": "Kind of lemonade.",
                    "label": 0
                },
                {
                    "sent": "And of course this settlement is heavily contaminated with heavy toxic elements.",
                    "label": 0
                },
                {
                    "sent": "Transport into the environment.",
                    "label": 0
                },
                {
                    "sent": "The previous seven moods cause big problems.",
                    "label": 0
                },
                {
                    "sent": "Problems for very, very long time.",
                    "label": 0
                },
                {
                    "sent": "We can find out that similar critical conditions are also present in the flooded mine.",
                    "label": 0
                },
                {
                    "sent": "Cannot pushing it more than about 40 kilometers from here and there.",
                    "label": 0
                },
                {
                    "sent": "Judgment of people animals are property by the accidents exists also there at the entrance of the transport added from the mind.",
                    "label": 0
                },
                {
                    "sent": "Our colleagues will present this problem of the Copper mine later on after the cigarettes presentation of cigarettes minutes case.",
                    "label": 0
                },
                {
                    "sent": "Organizers of the conference, we believe that there could be similar conditions at some other abandoned mines in Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, there is no.",
                    "label": 0
                },
                {
                    "sent": "Satisfying cadastre or inventory of abundant minds of historic abundant, nice.",
                    "label": 0
                },
                {
                    "sent": "Of course we can follow the historic minds, let's say till the beginning of First World War and a few years earlier.",
                    "label": 0
                },
                {
                    "sent": "But some of this historic minds have not been documented, but we can easily see in the field that they exist.",
                    "label": 0
                },
                {
                    "sent": "Of course, such cases can be.",
                    "label": 0
                },
                {
                    "sent": "Quite problematic in future as it's documented in some cases that quite so.",
                    "label": 0
                },
                {
                    "sent": "That means explosions have happened already.",
                    "label": 0
                },
                {
                    "sent": "Presentation of scientific research results on abundant Mind secrets in command project and of course with the comparison of update.",
                    "label": 0
                },
                {
                    "sent": "Research of this type of problematics in other European states.",
                    "label": 0
                },
                {
                    "sent": "We plan to define and emphasize processes which leads to the retention accumulation and of course of flooding offline waters within about 2 miles and of course.",
                    "label": 0
                },
                {
                    "sent": "Which are causes for transport of toxic elements and of cozy.",
                    "label": 0
                },
                {
                    "sent": "Also, for the transport of elements with the solution, and of course settlement outflow.",
                    "label": 0
                },
                {
                    "sent": "So results on the research and causes and consequences.",
                    "label": 0
                },
                {
                    "sent": "Methods for their prevention as well as urgent, more or less efficient, durable methods of remediation and necessary methods of monitoring will be presented by our distinct creation.",
                    "label": 0
                },
                {
                    "sent": "Distinguished guests from Ireland, United Kingdom, Spain, Austria and Slovakia.",
                    "label": 0
                },
                {
                    "sent": "In the state of Sylvania.",
                    "label": 0
                },
                {
                    "sent": "Scientists and professionals obviously, if not not yet succeeded to convince the governmental authorities with all the mentioned evidence, evidences for the immediate and urgent action as well as we could not convince them into long-term, formal, systematic arrangement of this problematic which is.",
                    "label": 0
                },
                {
                    "sent": "But this is the fact.",
                    "label": 0
                },
                {
                    "sent": "Let's say we tried to approach to the Ministry of Environment and Spatial Planning as well as Ministry for Economic for last six years.",
                    "label": 0
                },
                {
                    "sent": "With so many different ministers and so many different clerks at the ministries.",
                    "label": 0
                },
                {
                    "sent": "But we were not hurt enough and we believe that.",
                    "label": 0
                },
                {
                    "sent": "Sign some kind of pressure should be put into the into the States and of course we cannot take anymore the moral load.",
                    "label": 0
                },
                {
                    "sent": "More obligation if such accidents, which were documented as well documented in the past would happen again.",
                    "label": 0
                },
                {
                    "sent": "Actually, all of people dealing with this problematic in Slovenia are saying we cannot stand anymore if accident happened.",
                    "label": 0
                },
                {
                    "sent": "They will all say why weren't you resistive?",
                    "label": 0
                },
                {
                    "sent": "Why weren't you hard enough to convince people around?",
                    "label": 0
                },
                {
                    "sent": "You are the one who knows the most, and if you know the most, it's your task to put pressure to show your voice to the government and authorities.",
                    "label": 0
                },
                {
                    "sent": "And that's why we have organized this conference.",
                    "label": 0
                },
                {
                    "sent": "Today unfortunately, we need to point out that minds are formally closed in Slovenia with the end of production and of course with the formal conclusion closure of the concession rights for the extraction for the mining exploitation.",
                    "label": 0
                },
                {
                    "sent": "In spite that there are still possible dangerous source of toxic elements.",
                    "label": 0
                },
                {
                    "sent": "Of course, nowadays every project for the mine closure needs to have all details about the remediation about the neutralization of water and so on.",
                    "label": 0
                },
                {
                    "sent": "But Slovene legislations X and Fortunately do not define competence and responsibility for such already known.",
                    "label": 0
                },
                {
                    "sent": "Old mines, historic remains, and let's say there is kind of gap between the recent mine and historic mind and kind of gap.",
                    "label": 0
                },
                {
                    "sent": "Double another or white area which is not covered by our legislation.",
                    "label": 0
                },
                {
                    "sent": "So all 2 bedroom eyes are not under the competence and responsibility of the Mining Act which is part of the Authority Ministry of Economy.",
                    "label": 0
                },
                {
                    "sent": "Neither are covered by the law of the Nature Conservation Ministry for Environment and Special Planning.",
                    "label": 0
                },
                {
                    "sent": "So for their monitoring and eventual risking of problematic in the state of Slovenia.",
                    "label": 0
                },
                {
                    "sent": "Normally nobody is competent in spite of doubtless danger for life and health of inhabitants in their vicinity, and of course, in spite of ecological threats for water compilation along water outflow.",
                    "label": 0
                },
                {
                    "sent": "My kids lectures will give insight into legislations in other European states, which of course have had some problems in the past, but Luckily they are solving them more successful, more successfully.",
                    "label": 0
                },
                {
                    "sent": "And of course, the most important thing is who is responsible for financing of such monitoring and eventual interventions into abundance in their states.",
                    "label": 0
                },
                {
                    "sent": "What are the conference goals?",
                    "label": 0
                },
                {
                    "sent": "Our plan is to form international, scientific and professional set of arguments defining causes, consequences and metals.",
                    "label": 0
                },
                {
                    "sent": "Methods for disabling of water explosions of outbursts of mine water from above 9 cent.",
                    "label": 0
                },
                {
                    "sent": "Of course, there remediation plan to form proposal to the state opportunities for improvement of the system state competencies and modes of financing the wrestling.",
                    "label": 0
                },
                {
                    "sent": "Injured minds and service city.",
                    "label": 0
                },
                {
                    "sent": "Of course, on the higher significant professional levels, we will Additionally support the establishment of immediate urgent underground geological and mining intervention research and exploration of the abundant cigarettes mind and of course.",
                    "label": 0
                },
                {
                    "sent": "Which is above the leaky account and also cannot put your mind to remove causes for.",
                    "label": 0
                },
                {
                    "sent": "Accident generation and danger.",
                    "label": 0
                },
                {
                    "sent": "Our goals in future is also to propose change the states authorities out tourist this approach to US methodology for remediation of mines in specific Geo chemical environments as I pointed out we can find in rocks of Upper Carboniferous age in the area of Lithia Town until Cinderella.",
                    "label": 0
                },
                {
                    "sent": "Area of need watered down with a copper mine.",
                    "label": 0
                },
                {
                    "sent": "Because in the past in Slovenia was thought that minds can be easily closed forever.",
                    "label": 0
                },
                {
                    "sent": "But this is true also with the specific environments.",
                    "label": 0
                },
                {
                    "sent": "Environments within the carbonate rocks where we usually do not have problems but with a specific due chemical environments where you have precipitation of yellowboy of settlements which do not allow water.",
                    "label": 0
                },
                {
                    "sent": "To discharge properly and accumulate in the old edits.",
                    "label": 0
                },
                {
                    "sent": "Of course, such kind of remediation.",
                    "label": 0
                },
                {
                    "sent": "Then closure is not possible and there is a need for regular yearly monitoring of the Alex, not all but the most important is iaccessible my horizens, disabling the formation of water by water accumulation and of course to mediate outflow of contaminated acid.",
                    "label": 0
                },
                {
                    "sent": "Mine waters with fine grades, toxic sediments which needs to be.",
                    "label": 0
                },
                {
                    "sent": "Of course quotes in place and you do not.",
                    "label": 0
                },
                {
                    "sent": "We can't let them out.",
                    "label": 0
                },
                {
                    "sent": "To water sheds and into the OR moment.",
                    "label": 0
                },
                {
                    "sent": "This is actually maybe a little bit long introduction, but I believe that it is very important to all of us to understand what's going on.",
                    "label": 0
                },
                {
                    "sent": "What's our main problem?",
                    "label": 0
                },
                {
                    "sent": "What's our pain, and what we need to solve in the future?",
                    "label": 0
                },
                {
                    "sent": "So if there is any questions, any questions please, just.",
                    "label": 0
                },
                {
                    "sent": "Stop me and we can solve something so we can sort out.",
                    "label": 0
                },
                {
                    "sent": "Everything's so if there are any questions or comments I would like to continue with the lecture which is called bundled historics spirits mine, which is actually Hiram Mercury.",
                    "label": 0
                },
                {
                    "sent": "Let's silver and bright mine enforce endangerment ability at all due to possible water outburst of mine water.",
                    "label": 1
                },
                {
                    "sent": "This event I would like to thank cordially to Emeritus Professor recruited by June and of course to our team Professor, Doctor.",
                    "label": 0
                },
                {
                    "sent": "Who gave us support for all last six years to continue to persist into?",
                    "label": 0
                },
                {
                    "sent": "Let's say our determination to find the way to solve this.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Homes.",
                    "label": 0
                },
                {
                    "sent": "So romantic of the.",
                    "label": 0
                },
                {
                    "sent": "It's mine.",
                    "label": 0
                },
                {
                    "sent": "It's quite complex.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, its historic mind, and in the medieval times.",
                    "label": 0
                },
                {
                    "sent": "Started on this Hill separated skill which is about 250 meters that talk about the.",
                    "label": 0
                },
                {
                    "sent": "Moment I believe we are somewhere here in the main building from the.",
                    "label": 0
                },
                {
                    "sent": "Piano.",
                    "label": 0
                },
                {
                    "sent": "There is a truck.",
                    "label": 0
                },
                {
                    "sent": "And I need to point out that there is about 14 kilometers of edits and implants done in this area.",
                    "label": 0
                },
                {
                    "sent": "I made this problematic maybe.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Years ago, due to the fact that collectors of minerals inform me that here can be found.",
                    "label": 0
                },
                {
                    "sent": "Very nice mineral specimens, quite quite complex immunization and I was shocked with the fact that in this book you can find open shafts and edit.",
                    "label": 0
                },
                {
                    "sent": "Of course this is something which cannot happen.",
                    "label": 0
                },
                {
                    "sent": "The Secrets Hill is also an area of sport activities.",
                    "label": 0
                },
                {
                    "sent": "There are lot of runners.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of people collecting mushrooms and blueberries and for such things are extremely extremely dangerous.",
                    "label": 0
                },
                {
                    "sent": "We have found out that there are nine open shots in the air.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Course.",
                    "label": 0
                },
                {
                    "sent": "Broached the areas where minerals were found my main activity at the University is mineral deposits studies, so I'm interested into the genetic environment of specific mineral deposits and due to the fact that this mine was formally close to 1965 and there was not many research articles on that we went into the mind trying to find some.",
                    "label": 0
                },
                {
                    "sent": "Thanks of course I wanted to check also what's the.",
                    "label": 0
                },
                {
                    "sent": "They enjoy our memory collectors are taking during their.",
                    "label": 0
                },
                {
                    "sent": "I'm at their work and so I must admit this is quite shocking that people can easily come in and out.",
                    "label": 0
                },
                {
                    "sent": "While we know very much that this is the most adrenaline type of sports probably ever invented.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you know when there is.",
                    "label": 0
                },
                {
                    "sent": "Huge love there is not much brains included in such things and we'd love to the minerals.",
                    "label": 0
                },
                {
                    "sent": "Of course, many other things can happen.",
                    "label": 0
                },
                {
                    "sent": "Particular minerals were found.",
                    "label": 0
                },
                {
                    "sent": "Colleague of mine will present them tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Also, I must point out that due to the mineral specimens in our collections Natural History Museum at the University and of course also in Vienna and other old mining schools.",
                    "label": 0
                },
                {
                    "sent": "So previously in 1990 this area was defined as outcrop or let's say some area of specific natural heritage.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Value, which is also very important.",
                    "label": 0
                },
                {
                    "sent": "Spectacular cerussite crystals, switches left carbonate crystals were found also native left.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mercury and so on.",
                    "label": 0
                },
                {
                    "sent": "What was the main point for the mining at the beginning?",
                    "label": 0
                },
                {
                    "sent": "Beginning in medieval there were written documents that they were mining iron ore.",
                    "label": 0
                },
                {
                    "sent": "But later on in 1850 they have found silver.",
                    "label": 0
                },
                {
                    "sent": "Cinnabar was of course and still is a source of Mercury which was extremely important for the gold production and during the monarchy they were.",
                    "label": 0
                },
                {
                    "sent": "Extracting kids alot.",
                    "label": 0
                },
                {
                    "sent": "The second most important funeral was belina.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And after dinner there were also ways of bright orange souffle which was used for colors and of course for drilling.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This weather actually I just found out that the area is full of edits and in clients that we started with the collection gathering of.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Motion from the old mess and we realized that there is almost 350 meters.",
                    "label": 0
                },
                {
                    "sent": "Spend from the top mining area to the bottom.",
                    "label": 0
                },
                {
                    "sent": "Actually the lower part of mines are 90 meters below the River of Sava.",
                    "label": 0
                },
                {
                    "sent": "And the quite interesting.",
                    "label": 0
                },
                {
                    "sent": "Cause that's just before the First World War.",
                    "label": 0
                },
                {
                    "sent": "It was written they have found and mined out the Wayne which have the bedding plant almost almost parallel to the to the stratification to the bedding and.",
                    "label": 0
                },
                {
                    "sent": "It is quite fascinating, kind of Wayne.",
                    "label": 0
                },
                {
                    "sent": "For six months away we did they mention with sickness, up to 7 meters with 250 by 150 meters, and what's the most important thing is that above and below there are shells.",
                    "label": 0
                },
                {
                    "sent": "That means from.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Your mechanic and fun for few very very soft rocks.",
                    "label": 0
                },
                {
                    "sent": "Of course, I saw immediately that it is impossible for this big or body to be of the same type of immunization later on.",
                    "label": 0
                },
                {
                    "sent": "I have proved that this is so called since the mentari or settings type of deposit in the beginning it was mind here in this area.",
                    "label": 0
                },
                {
                    "sent": "Actually this is the northern slope and they have followed.",
                    "label": 0
                },
                {
                    "sent": "With the set of horizons, this so called set except for point.",
                    "label": 0
                },
                {
                    "sent": "But later on, after the First World War, they started to mind out the way type of nization so called root zone where or was not as rich, but still they were able to produce something before the Second World War.",
                    "label": 0
                },
                {
                    "sent": "Second World War.",
                    "label": 0
                },
                {
                    "sent": "There were German territories they can go on and at the end of production can be year 1964 or 5, which is the final date that they have my notes, mainly by or.",
                    "label": 0
                },
                {
                    "sent": "I need to point out that the rock itself it's highly suspicious it's consists more than 50% of work and the main problem this area was.",
                    "label": 0
                },
                {
                    "sent": "Miners disease, silicosis alot of people, bites, duties, facts and.",
                    "label": 0
                },
                {
                    "sent": "Due to the main reason due to the fact that.",
                    "label": 0
                },
                {
                    "sent": "The modern Slovenia in the area of machines there is huge letting synchronization carbonate rocks where there are.",
                    "label": 0
                },
                {
                    "sent": "Not so many problems or not at all with silicosis.",
                    "label": 0
                },
                {
                    "sent": "They decided to move there and to close the map, but at that time the closure of the mine was quite easy.",
                    "label": 0
                },
                {
                    "sent": "You just took it out what you needed.",
                    "label": 0
                },
                {
                    "sent": "And of course you put some sticks of dynamite.",
                    "label": 0
                },
                {
                    "sent": "The entrance of the mind and close the line with blasting of the interest.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so we can see.",
                    "label": 0
                },
                {
                    "sent": "So two areas of money facilities are present and also two different kinds of hydrological logic systems are defiance.",
                    "label": 0
                },
                {
                    "sent": "This edits here presents were of course connected with source which followed one specific example of the body on the other side with the feeder root when zone we have somehow more spread it.",
                    "label": 0
                },
                {
                    "sent": "Let's aerial photo edits and they have solved the problematic words with toric.",
                    "label": 0
                },
                {
                    "sent": "Want to flooding with incline here which actually connect it all ends and allows the mind water to discharge the River of summer.",
                    "label": 0
                },
                {
                    "sent": "It was done in 1920.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this over there.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not just mirrors.",
                    "label": 0
                },
                {
                    "sent": "I was also astonished by the fact that big part of Iaccessible, part of the mind.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is flooded and which was very interesting.",
                    "label": 0
                },
                {
                    "sent": "Who?",
                    "label": 0
                },
                {
                    "sent": "Who have floods the mind then, which we can see by mistake.",
                    "label": 0
                },
                {
                    "sent": "We open this part are soft, are made of lemonade.",
                    "label": 0
                },
                {
                    "sent": "Very imminent, but actually with the with your.",
                    "label": 0
                },
                {
                    "sent": "You can open this board and so we can find out the percolation of water through the roof of the edit gave into the moments water which is extremely rich in irony, to plus at the entrance of the mind and it's of course there is a lot of oxygen and this siren 2 plus just turn into the air and three plus and precipitate.",
                    "label": 0
                },
                {
                    "sent": "And it's interesting as you are going to see later on in the film that some tiny, tiny crusts of oxides are floating on the top of this water, and with the slow transport on the top of it, they form step by step, small crusts from them.",
                    "label": 0
                },
                {
                    "sent": "And of course they are.",
                    "label": 0
                },
                {
                    "sent": "Pushing the border there, pushing them higher and higher 'cause it's in this area which, let's say.",
                    "label": 0
                },
                {
                    "sent": "Is 70 centimeters of this lunatic sentiment segments.",
                    "label": 0
                },
                {
                    "sent": "And then we opened we let's 2.",
                    "label": 0
                },
                {
                    "sent": "Flow more than 500 cubic meters of water.",
                    "label": 0
                },
                {
                    "sent": "There was a group of.",
                    "label": 0
                },
                {
                    "sent": "Superior councilors with us and so due to the water which undermined some parts of the mind in the incline without Woods, it was quite, let's say spectacular and and frustrating with voices of.",
                    "label": 0
                },
                {
                    "sent": "Drunks of this Woods falling down to the shaft.",
                    "label": 0
                },
                {
                    "sent": "Luckily we we nobody was hurt but it still remembered this event.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Only 500 meters, which is suddenly.",
                    "label": 0
                },
                {
                    "sent": "Which relates to suddenly flow into the mind, made a big change.",
                    "label": 0
                },
                {
                    "sent": "Of course we can imagine what would happen with the outflow of 6000 cubic meters seen influence.",
                    "label": 0
                },
                {
                    "sent": "I'm done.",
                    "label": 0
                },
                {
                    "sent": "Slope of cigarettes just about.",
                    "label": 0
                },
                {
                    "sent": "Development.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ultra.",
                    "label": 0
                },
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "Obviously that water in some parts is quite clean.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's maturity.",
                    "label": 0
                },
                {
                    "sent": "Water along open fractions.",
                    "label": 0
                },
                {
                    "sent": "That or water can come into the mind with the regular.",
                    "label": 0
                },
                {
                    "sent": "Let's say pH, pH value and this used to have for drinking water, but on the other side there are lot of fractures above old stops which still have active sophistic minerals.",
                    "label": 0
                },
                {
                    "sent": "Spireites, cinnabar Galina and specially most solubles follow right as well.",
                    "label": 0
                },
                {
                    "sent": "And of course oxygen is consumed and.",
                    "label": 0
                },
                {
                    "sent": "Each value is changed and transport of Byron and heavy metal toxic elements just start but on the floor of the edit.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "On the problem.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the open edits things precipitate and quite.",
                    "label": 0
                },
                {
                    "sent": "Often.",
                    "label": 0
                },
                {
                    "sent": "Spell themes, Stalock tights and stolid mites are formed which block the outflow of water.",
                    "label": 0
                },
                {
                    "sent": "I was quite impressed by the fact that such stalactites can be formed from the limelites becauses in Sylvania area, with the prevailing carbonate works with more than 9000 case cars caves.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We are used to have such kind of features made of calcium carbonate, whether parasite or minor.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I like that.",
                    "label": 0
                },
                {
                    "sent": "Also, quite spectacular forms can be generated.",
                    "label": 0
                },
                {
                    "sent": "These are so called clinic spaghetti.",
                    "label": 0
                },
                {
                    "sent": "We don't know exactly what happened with this one, but it was not the meat, just some kind of stuff.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we have documented that such kind of static mites were formed on the transport routes transfer trade, which was active in 1965.",
                    "label": 0
                },
                {
                    "sent": "So let's say we could prove that the speeds of growth was up to 4 centimeters in a year.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is very fast.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So but nice.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Interesting, spectacular.",
                    "label": 0
                },
                {
                    "sent": "The other thing which was surprise was just kind of this kind of Jelly material below some static bytes I didn't know for a long time.",
                    "label": 0
                },
                {
                    "sent": "What is this now we know that the start so called chemosynthetic.",
                    "label": 0
                },
                {
                    "sent": "Organisms that these are actually the colony of bacteria which transform.",
                    "label": 0
                },
                {
                    "sent": "H2S into Sue Faith and take energy for their life for that.",
                    "label": 0
                },
                {
                    "sent": "This is special group of living creatures so called extra mites.",
                    "label": 0
                },
                {
                    "sent": "And actually we're quite happy to have it.",
                    "label": 0
                },
                {
                    "sent": "You do not.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In other parts of Slovenia, in other minds or some other environment so.",
                    "label": 0
                },
                {
                    "sent": "Where was the spot where the documented accidents happen?",
                    "label": 0
                },
                {
                    "sent": "This is so called for more Europe.",
                    "label": 0
                },
                {
                    "sent": "Which gave.",
                    "label": 0
                },
                {
                    "sent": "Water for the accident in 1895 and 1932 and it's it was documented and also we have a witness of this event.",
                    "label": 0
                },
                {
                    "sent": "That's water outflow lasted for almost half an hour and huge amount of sediment from the plateau in front of the entrance was transported in the air of church and some buildings over here.",
                    "label": 0
                },
                {
                    "sent": "Of course, this time nobody took care of the lunatic settlement and toxic metals in India.",
                    "label": 0
                },
                {
                    "sent": "But Luckily the time there were not many buildings in here, so the damage was not very big and you do.",
                    "label": 0
                },
                {
                    "sent": "The fact that this happens.",
                    "label": 0
                },
                {
                    "sent": "It's 2:00 o'clock in the night nobody was hurt.",
                    "label": 0
                },
                {
                    "sent": "But today as I'm going to show their local building set a lot of property here of course.",
                    "label": 0
                },
                {
                    "sent": "Consolato of people which can be huge problem.",
                    "label": 0
                },
                {
                    "sent": "So this was the lower part of mineralisation so called said explanation and from this social mind mostly.",
                    "label": 0
                },
                {
                    "sent": "Solar edits for mostly added and sore here Aug edit the transport of or from the August edits went with the steel rope transport to the smelter which was located to the other side of the River.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, let's go on.",
                    "label": 0
                },
                {
                    "sent": "So we did this mapping an observation we have defined that there are two hydrological systems means old FedEx type or body 250 by 150 or 76 miss you in relation.",
                    "label": 0
                },
                {
                    "sent": "Actually ends here at this edit centimeters above the church, and we must say that when we clients, when we descend to this point, we have found out that water table.",
                    "label": 0
                },
                {
                    "sent": "What level is here that means 22 meters above the entrance which are collected clips of morning, August and edit.",
                    "label": 0
                },
                {
                    "sent": "So what are called is quite frustrating for us.",
                    "label": 0
                },
                {
                    "sent": "We just vectorized the iaccessible data.",
                    "label": 0
                },
                {
                    "sent": "That means that it's in this area and stops and we estimate you know that these surveying Kingdom I were not very good.",
                    "label": 0
                },
                {
                    "sent": "Usually four stops.",
                    "label": 0
                },
                {
                    "sent": "There are useful only for the transport and it's and we think that it can be 6000.",
                    "label": 0
                },
                {
                    "sent": "Interest or more water underwater?",
                    "label": 0
                },
                {
                    "sent": "Actually, from this end it just goes in the into the area into the outflow of the main trust, and it's transported by medics 650 meters long, so called solid.",
                    "label": 0
                },
                {
                    "sent": "It's the other hydrological system.",
                    "label": 0
                },
                {
                    "sent": "We believe that we need to define the level of urgency.",
                    "label": 0
                },
                {
                    "sent": "Fastest possible for this part, cause the outflow quantity water is very low, and as we can see, the water cones form polar, but on the other side this summer edit.",
                    "label": 0
                },
                {
                    "sent": "Will be.",
                    "label": 0
                },
                {
                    "sent": "We can wait more due to the fact that there is continuous outflow.",
                    "label": 0
                },
                {
                    "sent": "Actually we can not go through with you to some collapse trucks, but till the.",
                    "label": 0
                },
                {
                    "sent": "Wanted the outflow corresponds to the quantity of majorek precipitation.",
                    "label": 0
                },
                {
                    "sent": "Everything is alright, but if the water stops in the outflow.",
                    "label": 0
                },
                {
                    "sent": "He says, we know that the fact is that water is accumulating here, and I believe that more than 350 cubic meters accumulated in this park, and let's say the difference from this level up to here where there is the next entrance of this hydrologic system is 51 meters higher.",
                    "label": 0
                },
                {
                    "sent": "So in case of flooding.",
                    "label": 0
                },
                {
                    "sent": "Open volume up to 50.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hooters this is the area which was flooded in 1895 and also in 1932.",
                    "label": 0
                },
                {
                    "sent": "Now this nice.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, you can imagine 6000 cubic meters coming.",
                    "label": 0
                },
                {
                    "sent": "The backyard of this building and afterwards out to the Main Street of Lydia # Woods.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Make a big.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "We can still find some results.",
                    "label": 0
                },
                {
                    "sent": "Some evidences of the past flood actually along this Gorge re transportation of the whole gang.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, and of course a lot of.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Settlement is better.",
                    "label": 0
                },
                {
                    "sent": "The other problem, so as I mentioned so called.",
                    "label": 0
                },
                {
                    "sent": "Overall, summary really shines out on the normal side of the Sisters here with the constant outflow of more or less constants about hundreds and 30 interests.",
                    "label": 0
                },
                {
                    "sent": "But of course, when you close it, you can imagine that within two years and could have accumulation of 250 kilometers.",
                    "label": 0
                },
                {
                    "sent": "Particulation so.",
                    "label": 0
                },
                {
                    "sent": "We need to measure it.",
                    "label": 0
                },
                {
                    "sent": "Need to follow it and react in case of problems, but I would really like to see what's behind to put some.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There and the measure level.",
                    "label": 0
                },
                {
                    "sent": "This is the area where this summer edit comes out.",
                    "label": 0
                },
                {
                    "sent": "It was since let's say 1928 when water just discharged from the mind directly into the River.",
                    "label": 0
                },
                {
                    "sent": "I must point out this was defined by.",
                    "label": 0
                },
                {
                    "sent": "Doctor Mario ball.",
                    "label": 0
                },
                {
                    "sent": "She has done the detailed research of the water and she found out that surprisingly.",
                    "label": 0
                },
                {
                    "sent": "It is not very acid.",
                    "label": 0
                },
                {
                    "sent": "The pH value, the average pH value is just 6.3 waters within the mind itself.",
                    "label": 0
                },
                {
                    "sent": "It can be very acid, but Luckily somewhere on the way in the little part of the mind there are some bits of of Mars carbonaceous Mars which neutralize the water.",
                    "label": 0
                },
                {
                    "sent": "So let's say the water is not healthy.",
                    "label": 0
                },
                {
                    "sent": "Polluted.",
                    "label": 0
                },
                {
                    "sent": "Water itself has only think.",
                    "label": 0
                },
                {
                    "sent": "And so if it's above the.",
                    "label": 0
                },
                {
                    "sent": "Allowed level, but I need to point out that the main problem is actually.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The transport of fine grained sediment.",
                    "label": 0
                },
                {
                    "sent": "In the year 1965, they have done a pluck.",
                    "label": 0
                },
                {
                    "sent": "The concrete block here, and it was made of 6 meters of concrete.",
                    "label": 0
                },
                {
                    "sent": "I must must point out that this concrete have been dissolved totally.",
                    "label": 0
                },
                {
                    "sent": "We cannot find it anymore through the park, and that was before the rearranged.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's about flow.",
                    "label": 0
                },
                {
                    "sent": "Later on the community.",
                    "label": 0
                },
                {
                    "sent": "The other day, actually.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rich and organized.",
                    "label": 0
                },
                {
                    "sent": "The proper way, but they must point out that the settlement still goes into the River server and analysis of settlements show.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's anomalies are.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quite high.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We believe that the money needed for remediation and to for solving this problem would be about 2 million point 5 minutes.",
                    "label": 0
                },
                {
                    "sent": "But the main problem would be how to solve the server.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Edit which is very long, which is 650 meters long becausw it was done in the June mechanically very unpleasant rock, which is merely shells and thin, bedded, sandstones.",
                    "label": 0
                },
                {
                    "sent": "So it's not very good work for such work and actually new edit.",
                    "label": 0
                },
                {
                    "sent": "You done too.",
                    "label": 0
                },
                {
                    "sent": "Enable the broker of discharge of the mind water.",
                    "label": 0
                },
                {
                    "sent": "But on the other.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is the most dangerous for the town of?",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Politie it means to.",
                    "label": 0
                },
                {
                    "sent": "Solve this problem.",
                    "label": 0
                },
                {
                    "sent": "The water coming.",
                    "label": 0
                },
                {
                    "sent": "I believe that we start opening, reopening of the old mind to make access to these parts measured what level to pump it out, maybe to enable it to outflow into the main shaft.",
                    "label": 0
                },
                {
                    "sent": "We would get rid of the.",
                    "label": 0
                },
                {
                    "sent": "Endangerment of the.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What's needed?",
                    "label": 0
                },
                {
                    "sent": "We need to convince proper people.",
                    "label": 0
                },
                {
                    "sent": "Obviously professionals and scientists are not proper people for our government for our authorities.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately we were not successful so far, but I hope the conclusion of this conference.",
                    "label": 0
                },
                {
                    "sent": "We will find power and of course also arguments to convince them to support.",
                    "label": 0
                },
                {
                    "sent": "The system market.",
                    "label": 0
                },
                {
                    "sent": "Reopening of the mine and also true.",
                    "label": 1
                },
                {
                    "sent": "Find the group of specialists who can.",
                    "label": 0
                },
                {
                    "sent": "Define the new mining claw in the proper way.",
                    "label": 0
                },
                {
                    "sent": "With the including of the old abandoned mines.",
                    "label": 0
                },
                {
                    "sent": "OK, this is the end of my presentation.",
                    "label": 0
                },
                {
                    "sent": "I propose that we just take a look of the film with lunatic special teams, Stalag mites and stalactites, and afterwards we can discuss about the presenting problem.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}