{
    "id": "nxtueejlzbvma5l22v4pazyftgxew3m3",
    "title": "Using Semantic Web Technologies to Build a Community-driven Knowledge Curation Platform for the Skeletal Dysplasia Domain",
    "info": {
        "author": [
            "Tudor Groza, University of Queensland"
        ],
        "published": "Nov. 25, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Semantic Web->Ontologies"
        ]
    },
    "url": "http://videolectures.net/iswc2011_groza_dysplasia/",
    "segmentation": [
        [
            "So hi everyone, my name is tourism and I'm going to talk about today about skeleton.",
            "You use it.",
            "We have a very long very long title for the paper, but you know, in principle within do."
        ],
        [
            "The conference that we talked about philosophy and there were talks about or sorts of hardware devices which can replace tags and so on and so forth.",
            "Price tag, so I guess you know it's the time for us to talk about skeletal dysplasia in this conference, and I'm pretty sure that none.",
            "Most of you don't really know what are those, so I'm going to give you."
        ],
        [
            "Background on them, and then we'll go into the technical details.",
            "So in principle this talk will cover.",
            "As I mentioned, skeletal dysplasias from, but from the knowledge representation, creation and discovery perspectives, and I'll go through the challenges that we had the detail of going to details with respect to the skeleton platform and then.",
            "Talk about a bit about the next steps.",
            "As a small remark, I took the Liberty to give a bit of an updated view on what we have done since the paper was published, and I will focus on particular things and let you discover other things which are which are maybe detail more in the in the paper.",
            "OK, so let's start with the background.",
            "So skeletal displeasures represent a group of heterogeneous.",
            "Genetic disorders which affect the skeletal system.",
            "So in principle there are more than two 450 four 150 diseases group currently in 40 groups.",
            "And they're pretty rare.",
            "So as you can see, this is 1 one case in less than 10 thousand 10,000.",
            "Persons and the main problem is the fact the fact that genetic disease is the fact that they have as far as distribution so that you cannot relocate or a place in the world where the water is a continent in the world where where all the orders is occur but they are spread around the spread around the world.",
            "And an interesting really interesting fact is that they're actually dependent also among other things on the actual location in the world where they occur.",
            "So for some reason some of the lesser genetic.",
            "Genetic features of that location was was involved and also in in in this in this setting.",
            "So in principle.",
            "Patients with certain displeasures, huh?"
        ],
        [
            "Have really complex medical issues and I would not really go into very many details, but I will tell you that there are three main pillars on which these diseases kind of build up on an one are radiographical features that signal skeletal problems.",
            "Then there is that the genetic part with with respect to so that basically there Jim you tations is which causes diseases and then there are all other final phenotypic characteristics which are involved which are involved in them.",
            "Such as I don't know the I know the measure of the force for April.",
            "Wonderful story, quietly said the measure of calcium will counsel measures in the blood, and so on."
        ],
        [
            "Now if we look at skeletal dysplasias from a bit of a different perspective, that is, from the perspective of, let's say, the clinicians or a clinical perspective and the data perspective.",
            "So first of all, when it comes to the clinical clinical aspects, well there are Ray disorders.",
            "First of all, then there are a few established guidelines for for really putting a diagnosis of on and then it's a growing domain knowledge and by growing domain knowledge.",
            "Here I I wanted control.",
            "Vale the fact that the truth is that it's a quite immature domain knowledge and it's it's still still accumulating accumulating bits and pieces which will make it grow and make it maturing in time, which which so so from here one of the main problem is the fact that you cannot really provide any sort of decision support as you usually would in well established diseases, such As for example, diabetes.",
            "If we look at this from the data perspective as I was mentioning Woo, it's it's basically this disease have expressed part distribution and obviously this is reflected in the data, which means that the data is parsed and it's also heterogeneous in since it's managed by different organizations or additional hospitals.",
            "So then you could easily see that there might be an integration and."
        ],
        [
            "Integration problem.",
            "Looking at the current state, so OK, let's look at the current status both from the data perspective but also from the Community perspective, because I must say that what we have found within within, let's say domain is that there is a really tightly knit community that works together to try not really to solve this problem, but to try to help the people which have these problems and and to share knowledge among them so that the field grows so from the data perspective.",
            "There is this thing called the international scenario Skeletal dysplasias SoC nosology, which is sort of a classification of the of the diseases introduced this 40 groups, but this lists basically the groups lists, the the bonus pleasures where, which is the actual actual diseases.",
            "We are both via the ORM number they provide.",
            "For most of them are actually form over.",
            "All of them that they do have a gene mutation associated the gene, so not the gym mutation, but the gene associated with the disease.",
            "And sometimes the proteins which are linked to the link to the genes.",
            "But that's kind of it.",
            "So then the classification is done either on the genetic basis or on the phenotypic or an affair type information.",
            "But this is basically hidden because it is a table and then that's it.",
            "From the community perspective, as I was mentioning there are in in principle it's a really.",
            "As I mentioned, it's a really tightly knit community, but there are, depending on the continent of the area of the world.",
            "There are free.",
            "That's a major three major three major groups.",
            "If I may say so.",
            "So there's the European skeletal dysplasia network.",
            "There's the international catalyst Roger Register, which is the American side of the American side of things.",
            "And then there's.",
            "There are also smaller groups such as Kill Net which is which is located here in in in Germany and Freiburg.",
            "But is that?",
            "Let's say the hub is in fiber, but then it it has roots all over Germany.",
            "Now."
        ],
        [
            "Let's look at some of the challenges that.",
            "So exists in this domain and which we, let's say, turned into requirements for our for our platform and our focus on two of them.",
            "There are multiple who some of them are not functional.",
            "I will mention them, but our focus in principle on two of them, which which I know that it's kind of sounds like a deja vu, but unfortunately this is still the case.",
            "So first of all, means is the common terminology.",
            "There are in principle two major vocabularies which are used.",
            "To describe X Rays and radio graphic features, there's the whole the whole vocabulary, which is, which is, let's say the European.",
            "the European one, then this last month vocabulary which is which is the one from the state.",
            "And if you look a bit so.",
            "It can.",
            "I mean, it doesn't really matter because you cannot really see probably very well the X Rays, but it's not really going to help even if you see it so, but what what?",
            "What is important here is the actual the actual description of the X Rays, and with this description is the actual one, as as was annotated by by an expert.",
            "So you can see on the left hand side the whole vocabulary which says, well, you know this X Ray contains a post Accel productively on the hands or feet while on the right hand side you see that it's described as feed, polydactyly, postaxial, bilateral.",
            "I'll come a bit later on to kind of do analysis and conclusion is another.",
            "Another description would be short.",
            "Long bones with smooth fronted apathy sis, while on the other side you will see feminist metaphysics, Proxima rounded and and so on.",
            "And the last last bit would be, for example, drumstick appearance of the radius and ulna while on the right hand side you see radius metaphysical winding.",
            "Now you know you can look at this from multiple perspectives, but I'll tell you what we have seen.",
            "So one you can see.",
            "So before doing this, let me let me let me say something else on the right hand side.",
            "The small boxes actually should contain more annotations, justice for space reasons.",
            "I didn't put them all, and this is basically be cause of the granularity and of the structure that is used by for example by by the.",
            "But there's such as in the lobby.",
            "We use it a lot more vocabulary so you can see, for example, that the one on the right is really well structured.",
            "Then it goes pear organ and on per body part.",
            "And then it describes what exactly is the problem, while the first one on the left is more kind of, let's say, three text like we have three takes like, then you can see that on the left they they use also some sort of method for us to describe some of the things I for example dumb drumstick appearance and the places.",
            "So the elements which are which are bolded in both of them are the, let's say, the more problematic, problematic parts of the tagging, because for example.",
            "In the left you on the left hand side you can see that the world there were smooth appear so smooth rounded epiphysis worked on the right.",
            "They wouldn't have such a description, so they wouldn't use such a quality for four on on the on the on the on this on the description.",
            "While on the left you have that this this metaphorical expressions an interesting enough.",
            "You would also have you here.",
            "You can also observe the fact that the owner as as a let's say hello as a as a component.",
            "It is actually not present in the vocabulary of the 2nd."
        ],
        [
            "So it doesn't have a station on the second property.",
            "The second second aspect I wanted to focus on is the nella stress and knowledge Transfer is an evolution as I was mentioning the guy's DS Knology is published every four years.",
            "Actually I didn't mention but it is written on the slide.",
            "I'm sorry so the last version is actually for the Office 2010 but was published in 2011 due to the typical Journal Journal publishing cycles and I'll show you an example on how fast this I'm in domain.",
            "As any other probably Air Force.",
            "So in the 2010 NOSOLOGY would have disappointing Fibrocystic Kidney syndrome mentioned as part of the filming group and basically without really going into many details is because of the similarities or what they were thought to be.",
            "The similarities with the Malik senior syndrome which is the characteristic that will lead to the prominent syndrome in that group and more.",
            "Let's say more concretely because of the similarities with pronounce bowing of the long legs.",
            "Now a couple of months later after this after this paperwork.",
            "So those are the ones published.",
            "There's another, there's a paper by by Gray at all, which proposed that this syndrome should be moved from the filming group to the Osteolysis Group, and this time because of the similarities with hydrogen as you know now and then you know they actually also tried to do and show that there is actually a mutation which is common between alone.",
            "So what you should take home from this is the fact that knowledge evolves in the domain.",
            "An weather for example.",
            "'cause actually in the end I had an interesting discussion with with some of the experts and it turned out to that the last this conjecture was not really true, or some of them say that is not very true and what the important thing is that if you keep having only a four years of publishing cycle, you cannot really reflect the order is up to date knowledge which is present in the field.",
            "And obviously since you're dealing with the Main Express, you know there are a couple of them which are really really good.",
            "But we haven't still the same problem of the tacit knowledge being present in their heads.",
            "And let's say externalising it only when the meeting of the four year meeting comes, and then they'd sit altogether and they re try to read it.",
            "Read it to restructure the whole the whole domain.",
            "So as needed here is a sort of an incremental process in which everyone would be able to contribute first of all, and the 2nd second thing you know, you will receive our most up-to-date, up-to-date knowledge, and the very last thing I want to say about this is, for example such.",
            "Proposal or such a conjecture.",
            "The fact that you know that syndrome.",
            "It should be moved from one group to another can be modeled in different ways when it comes to when it comes to the evolving knowledge, and I'll show you how we try to do this.",
            "OK, this comes to this list."
        ],
        [
            "So the skeleton platform.",
            "So the skeleton project is a free project."
        ],
        [
            "Which.",
            "Funded in part by the Australian Research Council and by the Royal Brisbane and Women's Hospital.",
            "And it's led by by the University of Queensland Ann.",
            "Still at home is basically ontology based cause you know the core of our all of things we do is actually an ontology, community driven knowledge creation platform.",
            "So what we're trying to do is provide a way for the experts to maintain an incrementally avoid their knowledge.",
            "So basically by dealing with the domain knowledge.",
            "But at the same time, since the domain knowledge requires support from the patient, data were also trying to provide a way to.",
            "For for them to store and to exchange patient information and patient cases to do, and to do collaborative diagnose."
        ],
        [
            "So the ends in principle the ends of the skeleton skeleton platform system project is to provide this this knowledge integration to do some steps towards the decision support.",
            "Although I was mentioning in the beginning that is rich, this is really hard to do, but if you will think about think about decision support as a way to provide some sort of iterative data exploration techniques rather than really going towards semi automatic automatic diagnosis.",
            "This is possible and I was also mentioning about some of the requirements which were not directly.",
            "So I'm not reflected in the two that I mentioned previously.",
            "One would be obviously privacy and access control since we're talking about Primal, you know sensitive, sensitive, patient data, but also things like provenance, provenance and expertise, while on the community side of things we would aim to provide a sort of a common terminology for them so that you know that the X Rays descriptions that you'll see in have a have a common denominator and provide knowledge transfer and sustained knowledge evolution for."
        ],
        [
            "For the domain knowledge now.",
            "Skeleton proposes something that we call the knowledge engineering cycle, which means that starting from the bonus Special Ontology, which I will be talking about a bit in shortly.",
            "Plus plus means that it has some.",
            "It reuses some of the well known or other ontologies from from the field and import them.",
            "We transform them into a set of it in a set of pages which are which can be collectively or collaboratively edited.",
            "But we also transform it into an annotation vocabulary.",
            "And then we use this annotation vocabulary to annotate patient cases and X Rays and which are then also enriched.",
            "Let's say with instances or patient ontology in context Ontology which we have developed and what it does is basically then provides knowledge basically collaborative knowledge creation, iterative that expiration and collaborative diagnosis on this by by using the back end support which we stands in an entity extraction Ontology evolution decision.",
            "Support him now.",
            "Just to make it clear why there is a cycle.",
            "So if you come from the left to the right, basically you come from domain knowledge to the annotating patient cases, but in time the same annotated patient cases will provide a support for the four bits and pieces of domain knowledge to be to be involved, and that's why there's a.",
            "There's a cycle, so I'll start brief."
        ],
        [
            "So we've we've done it ologist that we have developed as a means for for common technology an."
        ],
        [
            "Knowledge integration, as I mentioned, we have to ontologies.",
            "We have abundant in displeasure ontology, patient on Telegina context, ontology.",
            "I guess the most important one is or not.",
            "I guess the most important ones, the body, specially because the other two really.",
            "I mean there are lots of other people that worked on this on this and and they did much more than we did.",
            "So we claim that our contribution is basically this.",
            "This this bonus pleasure Ontology which describes bonus pleasures that genotype and phenotype of this domain.",
            "The pension ontology has a patient diagnosis and investigations, and the context ontology really looks at provenance and temporality.",
            "And no, we haven't used standard provenance.",
            "The vocabulary, although we are aware of, but again other there are other people that work on this field and this is not something that we claim as a contribution."
        ],
        [
            "So the bone displeasure Ontology currently has more than 12112 hundred concepts and the way in which is structured is basically on the three pillars that I was mentioning.",
            "In this case, they're quite actually 3 three pillars that I was mentioning the very beginning, so we have on this page as which which are based in or which of the structured based on the groups which are present in the knology.",
            "We have the phenotype information which characterizes this.",
            "This bond is pleasures.",
            "And then we have the genotype information which which details the genetic mutation gene mutation gene."
        ],
        [
            "And an and proteins.",
            "And to have a closer look at them.",
            "You will consider this is for example how the first box looks like with the bones, measure the groups and an actual actual bonus pleasures then."
        ],
        [
            "This is the genetic origin.",
            "Genotype information.",
            "We have a gene and gene mutation in this gene is actually enriched with plenty of information from from a link to plenty of information already existing in in, in, in, in the paramedical."
        ],
        [
            "Listing biomedical ontology.",
            "While definitively character or some type information reuse is also a lot of other ontologies.",
            "Other introducer out there, such as the Human Phenotype Ontology, the.",
            "Genotype and trait ontology or the foundation model."
        ],
        [
            "Honestly, this is just to show up most simple example.",
            "This is how we have included some of the domain restricts the restrictions in the field, such As for example a condo.",
            "Plasia is in principle characterized by a set of gene mutations and some some typical typical actress.",
            "I mean obviously these are.",
            "You know if you go down to the actual label of the concepts, you'll see exactly what I'm talking about and.",
            "They also have a model inheritance, which in this case is dominant dominant inheritance.",
            "One last thing which I want to mention here is that so we have 1200 concepts which were manually important and automatically another part created and they're described by more than 3000 serotype phenotypic characteristics which we're taking."
        ],
        [
            "Only for human type ontology.",
            "I really want to spend too much time on the patient ontology which basically just says you know page.",
            "We have a patient on the patients under things which was diagnosed with bone displeasure and exhibits some fanatical characteristic sorkar Assange Matei."
        ],
        [
            "Mission and finally the context ontologies, which is really tries to capture where such information was was was, you know, presented 1st and then when and why."
        ],
        [
            "Context."
        ],
        [
            "Now let's get into the interim order to the interesting thing.",
            "So the platform is actually built on Drupal 7 and our contribution is a sort of models that we have built for Drupal seven to make.",
            "To make this work so one of the things that we did was to start wrapping some of the NCBO and CBO services and we started with severe annotator and So what we did was basically a Drupal Drupal 7 module for the NCR, not later which is fully customizable and you can use to do some automatic or automatic.",
            "Or semantic annotation?",
            "Sorry, in Drupal this as far as I know is actually already present in the code based off of the annotators.",
            "We probably you can you can find it already, find it there another another model that we have provided was what we have.",
            "We have implemented was a vocabulary imports which basically goes from an authority to taxonomy in Drupal which goes very well hand in hand.",
            "Basically with wins at the NCBA annotator because if you really want to do a semantic annotation, you know the answer.",
            "Gives a concept, but then you need those concepts within Drupal to to to be able to link them to the actual to the actual content.",
            "And the modularization is there.",
            "The mobilization is there because basically you can choose a view from the ontology, so you don't have to import oil teologi.",
            "But you can mention which concepts and which subclasses of those concepts or instances of the concepts we want to import.",
            "And finally we we, we, we to make sure that the cycle is closed and we implemented knowledge import we called it where.",
            "Basically it's an ontology to content to basically.",
            "Starting from ontology to create an entire Drupal website and then to do that too close to close that across the cycle.",
            "We also have their who they ontology evolution part, which is using currently on our dev back end, which is said some men doesn't use the actual Drupal back end, just under nickel the santanic ratio, which which I can talk about offline just."
        ],
        [
            "A quick overview on what does Rupert 7 provide currently as ever Def.",
            "So as you know at the office part of the 7:44 and what it does is basically it allows you to have error DFA annotating Drupal pages.",
            "So basically trooper content tool error def via instances.",
            "So basically every time you create a new node it creates an instance for the concept that was mapped to that with that content type and it has Parker support and we are really grateful to Steven Antolin and to the people that started.",
            "Is this this work and all we do is to basically just to try to.",
            "They also give something to this back to the community.",
            "So what we have added as a set of modules which will be or obviously open open source and we're only given to the Community is to start from an existing autology rather study starting from from from empty Drupal site and we have this ontology content to Drupal.",
            "So basically we have an ontology.",
            "You can generate an entire group aside with it.",
            "We have a concept based mapping.",
            "I won't talk too much about it.",
            "The idea is that instead of having Drupal content to earlier via instances, you have your classes which allows you then to do.",
            "Also this connection between the between those classes and classes, which might be related to them via class axioms, which is currently not possible."
        ],
        [
            "So what we provide in terms of the collaborative knowledge creation, so we have this wiki style editing of the."
        ],
        [
            "Of the of the bonus special have this micro contributions which are linked to the link to the conjectures as I was mentioning.",
            "For example, the fact that you propose a move of 1 disorder to another from a group with another can be modeled as a."
        ],
        [
            "My contribution, and we have Vicki Stylus sorry of direct domain knowledge encoding which allows be allows experts to move across from one place to another and so on."
        ],
        [
            "So basically by allowing altering the class and told the structure and the class axioms and I won't go into versioning and consistency checking and I'll tell you straight forward that we haven't done it before other four."
        ],
        [
            "No, but the way it is in the plan when it comes to knowledge transfer, I've already showed you this.",
            "So from a bonus pleasure ontology.",
            "You know we can annotate.",
            "We can produce an annotation vocabulary which annotates patient case next race and the way in which this is done is a bit more complicated because it takes a bit of time, so these things are there so that the the items on the left which are the patient case in X Rays are annotated.",
            "There are putting a another free pozza Tori and in time with the help of the community with a helper community then.",
            "They go and support that comes from from the patient.",
            "Places to go back to the ontology and the bits and pieces that connect the two things that the tool is a temporal states are collaborative diagnosis the micro contributions."
        ],
        [
            "Mission and this is their support in terms of what the modules, for example, that the model that we have we have mentioned provides semantic annotation of clinical summaries.",
            "As you can see here.",
            "So this is using for the report that we have implemented to do semantic annotation of this clinical summary and."
        ],
        [
            "We will HBO on teologi or and also on."
        ],
        [
            "Of the X Rays, and obviously these are then connected to A to a patient."
        ],
        [
            "Case and similarly follow collaborative diagnosis where which is characterized by by open discussions.",
            "We have a five star rating or voting system, but don't take the voting as an actual voting, but rather as a measure of confidence in that in that diagnosis it allows multiple diagnosis an it's it's case or not.",
            "Given so that the case will not this."
        ],
        [
            "Guys went to stop stop this."
        ],
        [
            "In terms of access control, because this is very sensitive issue.",
            "So we have authentication.",
            "We have groupings, access control intragroup and intergroup.",
            "So basically someone that is part of multiple groups can share a case with all the groups or summer."
        ],
        [
            "The groups we have individual and role based out of access control.",
            "Individual means that only the case order, for example sees the sensitive information, although the case is shared with the other with the other members of the group, they won't see it.",
            "They will only see the clinical summary which is shared for diagnosis purposes in the diagnosis and the role is connected to domain knowledge because we have an editorial in process and only the the editors of the disease are able to.",
            "To change the actual description of the disease while the rest can can assert micro contributions, and finally, for from."
        ],
        [
            "From the data RDF perspective, we do some sort of data filtration which basically the patient allows the patient.",
            "They are thought to be transforming patient descriptions only.",
            "The tags are only the tags are kept."
        ],
        [
            "Order some deep characteristics so I won't go into details with respect."
        ],
        [
            "To the decision support 'cause I'm I'm running out of time."
        ],
        [
            "But"
        ],
        [
            "I'll tell you a bit about the future work.",
            "So what we want to do next is to enrich the bonus special ontology with protein structures.",
            "Then we want to do a bit more on the ontology population side by mining.",
            "For example, genotype, phenotype associations and to really publish this data properly as linked data well."
        ],
        [
            "From the community side, we want to integrate with existing resources such as international connected is positive history or ESPN."
        ],
        [
            "Finally, from the troopers had of things we want to do extra tagging and clinical setting that clinical summaries tagging or annotation by you.",
            "For we are composite composite tax structures such as the one that is shown there, which you wouldn't find in any in any in any actual ontology as being as being a phenotypic characteristic.",
            "An proper and advanced auto generation support VR project for."
        ],
        [
            "Just to summarize so."
        ],
        [
            "So the skeleton platforms Clayton, Muskrat on projects that will I was talking about represent over or is a really apart from the trust to provide knowledge evolution decision support for us later.",
            "This pleasure domain by using the community or by supporting the community and by supporting or using the existing domain knowledge and the collaborative required patient cases and collaborative diagnosis.",
            "Thank you.",
            "Thanks for this presentation.",
            "I was just wondering, did you define some set of rules for Community annotation or something I mean.",
            "There was in terms of in the semantic sense or rules in terms of access control, know, annotating.",
            "The correct I mean so you can get a unified set of annotation because it was a community, not the annotation is done automatically, so the annotation is on the clinical summaries done automatically by using, then CBO annotate or end the vocabulary, sorry, the ontology taxonomy.",
            "Module that we have implemented.",
            "So does that automatically is not done by by the Community.",
            "The community does the collaborative diagnosis.",
            "Understanding and please correct me from if I'm wrong that that you're collecting an you know information from a very specific domain here in terms of the ontology that you've, your contribution ontology an while that's being produced and through the development of that what?",
            "Measures are you taking to ensure that the domain specific information is exactly as it should be.",
            "Becaused, I think it's I'm working in a completely disjoint domain.",
            "However the mapping problem is identical where.",
            "There might be logical, or you know, semantic discrepancies that are extremely hard to pick up that have not picked up at the design stage.",
            "And jeopardize the over overall usability of entology as things go on, because this system might be able to be used.",
            "However, there might be, you know really, really hard to define inaccuracy in the system itself.",
            "So.",
            "As I mentioned, when it comes to actual consistency of, for example, of the of the ontology within time, we haven't done yet something about it, however.",
            "Rules, not the rules.",
            "If Emma, sister class axioms and existing domain knowledge is curated by the community, so for example, when?",
            "If you know the ontology was created manually partly in automatically another part, which means that basically the you know some of the definitive characteristic Association with the diseases were doesn't automatically, but is the role of the Community.",
            "Then to clean this and to make sure that that's accurate from the domain perspective, what we do is just to transpose that into.",
            "Class axioms, then in the back.",
            "Thank you very much again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So hi everyone, my name is tourism and I'm going to talk about today about skeleton.",
                    "label": 0
                },
                {
                    "sent": "You use it.",
                    "label": 0
                },
                {
                    "sent": "We have a very long very long title for the paper, but you know, in principle within do.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The conference that we talked about philosophy and there were talks about or sorts of hardware devices which can replace tags and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Price tag, so I guess you know it's the time for us to talk about skeletal dysplasia in this conference, and I'm pretty sure that none.",
                    "label": 0
                },
                {
                    "sent": "Most of you don't really know what are those, so I'm going to give you.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Background on them, and then we'll go into the technical details.",
                    "label": 0
                },
                {
                    "sent": "So in principle this talk will cover.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, skeletal dysplasias from, but from the knowledge representation, creation and discovery perspectives, and I'll go through the challenges that we had the detail of going to details with respect to the skeleton platform and then.",
                    "label": 0
                },
                {
                    "sent": "Talk about a bit about the next steps.",
                    "label": 0
                },
                {
                    "sent": "As a small remark, I took the Liberty to give a bit of an updated view on what we have done since the paper was published, and I will focus on particular things and let you discover other things which are which are maybe detail more in the in the paper.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's start with the background.",
                    "label": 0
                },
                {
                    "sent": "So skeletal displeasures represent a group of heterogeneous.",
                    "label": 1
                },
                {
                    "sent": "Genetic disorders which affect the skeletal system.",
                    "label": 0
                },
                {
                    "sent": "So in principle there are more than two 450 four 150 diseases group currently in 40 groups.",
                    "label": 0
                },
                {
                    "sent": "And they're pretty rare.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, this is 1 one case in less than 10 thousand 10,000.",
                    "label": 0
                },
                {
                    "sent": "Persons and the main problem is the fact the fact that genetic disease is the fact that they have as far as distribution so that you cannot relocate or a place in the world where the water is a continent in the world where where all the orders is occur but they are spread around the spread around the world.",
                    "label": 0
                },
                {
                    "sent": "And an interesting really interesting fact is that they're actually dependent also among other things on the actual location in the world where they occur.",
                    "label": 0
                },
                {
                    "sent": "So for some reason some of the lesser genetic.",
                    "label": 0
                },
                {
                    "sent": "Genetic features of that location was was involved and also in in in this in this setting.",
                    "label": 0
                },
                {
                    "sent": "So in principle.",
                    "label": 0
                },
                {
                    "sent": "Patients with certain displeasures, huh?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have really complex medical issues and I would not really go into very many details, but I will tell you that there are three main pillars on which these diseases kind of build up on an one are radiographical features that signal skeletal problems.",
                    "label": 0
                },
                {
                    "sent": "Then there is that the genetic part with with respect to so that basically there Jim you tations is which causes diseases and then there are all other final phenotypic characteristics which are involved which are involved in them.",
                    "label": 0
                },
                {
                    "sent": "Such as I don't know the I know the measure of the force for April.",
                    "label": 0
                },
                {
                    "sent": "Wonderful story, quietly said the measure of calcium will counsel measures in the blood, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now if we look at skeletal dysplasias from a bit of a different perspective, that is, from the perspective of, let's say, the clinicians or a clinical perspective and the data perspective.",
                    "label": 0
                },
                {
                    "sent": "So first of all, when it comes to the clinical clinical aspects, well there are Ray disorders.",
                    "label": 0
                },
                {
                    "sent": "First of all, then there are a few established guidelines for for really putting a diagnosis of on and then it's a growing domain knowledge and by growing domain knowledge.",
                    "label": 1
                },
                {
                    "sent": "Here I I wanted control.",
                    "label": 0
                },
                {
                    "sent": "Vale the fact that the truth is that it's a quite immature domain knowledge and it's it's still still accumulating accumulating bits and pieces which will make it grow and make it maturing in time, which which so so from here one of the main problem is the fact that you cannot really provide any sort of decision support as you usually would in well established diseases, such As for example, diabetes.",
                    "label": 0
                },
                {
                    "sent": "If we look at this from the data perspective as I was mentioning Woo, it's it's basically this disease have expressed part distribution and obviously this is reflected in the data, which means that the data is parsed and it's also heterogeneous in since it's managed by different organizations or additional hospitals.",
                    "label": 0
                },
                {
                    "sent": "So then you could easily see that there might be an integration and.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Integration problem.",
                    "label": 0
                },
                {
                    "sent": "Looking at the current state, so OK, let's look at the current status both from the data perspective but also from the Community perspective, because I must say that what we have found within within, let's say domain is that there is a really tightly knit community that works together to try not really to solve this problem, but to try to help the people which have these problems and and to share knowledge among them so that the field grows so from the data perspective.",
                    "label": 0
                },
                {
                    "sent": "There is this thing called the international scenario Skeletal dysplasias SoC nosology, which is sort of a classification of the of the diseases introduced this 40 groups, but this lists basically the groups lists, the the bonus pleasures where, which is the actual actual diseases.",
                    "label": 0
                },
                {
                    "sent": "We are both via the ORM number they provide.",
                    "label": 0
                },
                {
                    "sent": "For most of them are actually form over.",
                    "label": 0
                },
                {
                    "sent": "All of them that they do have a gene mutation associated the gene, so not the gym mutation, but the gene associated with the disease.",
                    "label": 0
                },
                {
                    "sent": "And sometimes the proteins which are linked to the link to the genes.",
                    "label": 0
                },
                {
                    "sent": "But that's kind of it.",
                    "label": 0
                },
                {
                    "sent": "So then the classification is done either on the genetic basis or on the phenotypic or an affair type information.",
                    "label": 0
                },
                {
                    "sent": "But this is basically hidden because it is a table and then that's it.",
                    "label": 0
                },
                {
                    "sent": "From the community perspective, as I was mentioning there are in in principle it's a really.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, it's a really tightly knit community, but there are, depending on the continent of the area of the world.",
                    "label": 0
                },
                {
                    "sent": "There are free.",
                    "label": 0
                },
                {
                    "sent": "That's a major three major three major groups.",
                    "label": 0
                },
                {
                    "sent": "If I may say so.",
                    "label": 0
                },
                {
                    "sent": "So there's the European skeletal dysplasia network.",
                    "label": 1
                },
                {
                    "sent": "There's the international catalyst Roger Register, which is the American side of the American side of things.",
                    "label": 0
                },
                {
                    "sent": "And then there's.",
                    "label": 0
                },
                {
                    "sent": "There are also smaller groups such as Kill Net which is which is located here in in in Germany and Freiburg.",
                    "label": 0
                },
                {
                    "sent": "But is that?",
                    "label": 0
                },
                {
                    "sent": "Let's say the hub is in fiber, but then it it has roots all over Germany.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's look at some of the challenges that.",
                    "label": 0
                },
                {
                    "sent": "So exists in this domain and which we, let's say, turned into requirements for our for our platform and our focus on two of them.",
                    "label": 0
                },
                {
                    "sent": "There are multiple who some of them are not functional.",
                    "label": 0
                },
                {
                    "sent": "I will mention them, but our focus in principle on two of them, which which I know that it's kind of sounds like a deja vu, but unfortunately this is still the case.",
                    "label": 0
                },
                {
                    "sent": "So first of all, means is the common terminology.",
                    "label": 0
                },
                {
                    "sent": "There are in principle two major vocabularies which are used.",
                    "label": 0
                },
                {
                    "sent": "To describe X Rays and radio graphic features, there's the whole the whole vocabulary, which is, which is, let's say the European.",
                    "label": 0
                },
                {
                    "sent": "the European one, then this last month vocabulary which is which is the one from the state.",
                    "label": 0
                },
                {
                    "sent": "And if you look a bit so.",
                    "label": 0
                },
                {
                    "sent": "It can.",
                    "label": 0
                },
                {
                    "sent": "I mean, it doesn't really matter because you cannot really see probably very well the X Rays, but it's not really going to help even if you see it so, but what what?",
                    "label": 0
                },
                {
                    "sent": "What is important here is the actual the actual description of the X Rays, and with this description is the actual one, as as was annotated by by an expert.",
                    "label": 0
                },
                {
                    "sent": "So you can see on the left hand side the whole vocabulary which says, well, you know this X Ray contains a post Accel productively on the hands or feet while on the right hand side you see that it's described as feed, polydactyly, postaxial, bilateral.",
                    "label": 0
                },
                {
                    "sent": "I'll come a bit later on to kind of do analysis and conclusion is another.",
                    "label": 0
                },
                {
                    "sent": "Another description would be short.",
                    "label": 0
                },
                {
                    "sent": "Long bones with smooth fronted apathy sis, while on the other side you will see feminist metaphysics, Proxima rounded and and so on.",
                    "label": 1
                },
                {
                    "sent": "And the last last bit would be, for example, drumstick appearance of the radius and ulna while on the right hand side you see radius metaphysical winding.",
                    "label": 1
                },
                {
                    "sent": "Now you know you can look at this from multiple perspectives, but I'll tell you what we have seen.",
                    "label": 0
                },
                {
                    "sent": "So one you can see.",
                    "label": 0
                },
                {
                    "sent": "So before doing this, let me let me let me say something else on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "The small boxes actually should contain more annotations, justice for space reasons.",
                    "label": 0
                },
                {
                    "sent": "I didn't put them all, and this is basically be cause of the granularity and of the structure that is used by for example by by the.",
                    "label": 0
                },
                {
                    "sent": "But there's such as in the lobby.",
                    "label": 0
                },
                {
                    "sent": "We use it a lot more vocabulary so you can see, for example, that the one on the right is really well structured.",
                    "label": 0
                },
                {
                    "sent": "Then it goes pear organ and on per body part.",
                    "label": 0
                },
                {
                    "sent": "And then it describes what exactly is the problem, while the first one on the left is more kind of, let's say, three text like we have three takes like, then you can see that on the left they they use also some sort of method for us to describe some of the things I for example dumb drumstick appearance and the places.",
                    "label": 0
                },
                {
                    "sent": "So the elements which are which are bolded in both of them are the, let's say, the more problematic, problematic parts of the tagging, because for example.",
                    "label": 0
                },
                {
                    "sent": "In the left you on the left hand side you can see that the world there were smooth appear so smooth rounded epiphysis worked on the right.",
                    "label": 0
                },
                {
                    "sent": "They wouldn't have such a description, so they wouldn't use such a quality for four on on the on the on the on this on the description.",
                    "label": 0
                },
                {
                    "sent": "While on the left you have that this this metaphorical expressions an interesting enough.",
                    "label": 0
                },
                {
                    "sent": "You would also have you here.",
                    "label": 0
                },
                {
                    "sent": "You can also observe the fact that the owner as as a let's say hello as a as a component.",
                    "label": 0
                },
                {
                    "sent": "It is actually not present in the vocabulary of the 2nd.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it doesn't have a station on the second property.",
                    "label": 0
                },
                {
                    "sent": "The second second aspect I wanted to focus on is the nella stress and knowledge Transfer is an evolution as I was mentioning the guy's DS Knology is published every four years.",
                    "label": 0
                },
                {
                    "sent": "Actually I didn't mention but it is written on the slide.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry so the last version is actually for the Office 2010 but was published in 2011 due to the typical Journal Journal publishing cycles and I'll show you an example on how fast this I'm in domain.",
                    "label": 0
                },
                {
                    "sent": "As any other probably Air Force.",
                    "label": 0
                },
                {
                    "sent": "So in the 2010 NOSOLOGY would have disappointing Fibrocystic Kidney syndrome mentioned as part of the filming group and basically without really going into many details is because of the similarities or what they were thought to be.",
                    "label": 0
                },
                {
                    "sent": "The similarities with the Malik senior syndrome which is the characteristic that will lead to the prominent syndrome in that group and more.",
                    "label": 0
                },
                {
                    "sent": "Let's say more concretely because of the similarities with pronounce bowing of the long legs.",
                    "label": 0
                },
                {
                    "sent": "Now a couple of months later after this after this paperwork.",
                    "label": 0
                },
                {
                    "sent": "So those are the ones published.",
                    "label": 0
                },
                {
                    "sent": "There's another, there's a paper by by Gray at all, which proposed that this syndrome should be moved from the filming group to the Osteolysis Group, and this time because of the similarities with hydrogen as you know now and then you know they actually also tried to do and show that there is actually a mutation which is common between alone.",
                    "label": 0
                },
                {
                    "sent": "So what you should take home from this is the fact that knowledge evolves in the domain.",
                    "label": 0
                },
                {
                    "sent": "An weather for example.",
                    "label": 0
                },
                {
                    "sent": "'cause actually in the end I had an interesting discussion with with some of the experts and it turned out to that the last this conjecture was not really true, or some of them say that is not very true and what the important thing is that if you keep having only a four years of publishing cycle, you cannot really reflect the order is up to date knowledge which is present in the field.",
                    "label": 0
                },
                {
                    "sent": "And obviously since you're dealing with the Main Express, you know there are a couple of them which are really really good.",
                    "label": 0
                },
                {
                    "sent": "But we haven't still the same problem of the tacit knowledge being present in their heads.",
                    "label": 0
                },
                {
                    "sent": "And let's say externalising it only when the meeting of the four year meeting comes, and then they'd sit altogether and they re try to read it.",
                    "label": 0
                },
                {
                    "sent": "Read it to restructure the whole the whole domain.",
                    "label": 0
                },
                {
                    "sent": "So as needed here is a sort of an incremental process in which everyone would be able to contribute first of all, and the 2nd second thing you know, you will receive our most up-to-date, up-to-date knowledge, and the very last thing I want to say about this is, for example such.",
                    "label": 0
                },
                {
                    "sent": "Proposal or such a conjecture.",
                    "label": 0
                },
                {
                    "sent": "The fact that you know that syndrome.",
                    "label": 0
                },
                {
                    "sent": "It should be moved from one group to another can be modeled in different ways when it comes to when it comes to the evolving knowledge, and I'll show you how we try to do this.",
                    "label": 0
                },
                {
                    "sent": "OK, this comes to this list.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the skeleton platform.",
                    "label": 0
                },
                {
                    "sent": "So the skeleton project is a free project.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which.",
                    "label": 0
                },
                {
                    "sent": "Funded in part by the Australian Research Council and by the Royal Brisbane and Women's Hospital.",
                    "label": 0
                },
                {
                    "sent": "And it's led by by the University of Queensland Ann.",
                    "label": 0
                },
                {
                    "sent": "Still at home is basically ontology based cause you know the core of our all of things we do is actually an ontology, community driven knowledge creation platform.",
                    "label": 0
                },
                {
                    "sent": "So what we're trying to do is provide a way for the experts to maintain an incrementally avoid their knowledge.",
                    "label": 0
                },
                {
                    "sent": "So basically by dealing with the domain knowledge.",
                    "label": 1
                },
                {
                    "sent": "But at the same time, since the domain knowledge requires support from the patient, data were also trying to provide a way to.",
                    "label": 0
                },
                {
                    "sent": "For for them to store and to exchange patient information and patient cases to do, and to do collaborative diagnose.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the ends in principle the ends of the skeleton skeleton platform system project is to provide this this knowledge integration to do some steps towards the decision support.",
                    "label": 0
                },
                {
                    "sent": "Although I was mentioning in the beginning that is rich, this is really hard to do, but if you will think about think about decision support as a way to provide some sort of iterative data exploration techniques rather than really going towards semi automatic automatic diagnosis.",
                    "label": 0
                },
                {
                    "sent": "This is possible and I was also mentioning about some of the requirements which were not directly.",
                    "label": 0
                },
                {
                    "sent": "So I'm not reflected in the two that I mentioned previously.",
                    "label": 0
                },
                {
                    "sent": "One would be obviously privacy and access control since we're talking about Primal, you know sensitive, sensitive, patient data, but also things like provenance, provenance and expertise, while on the community side of things we would aim to provide a sort of a common terminology for them so that you know that the X Rays descriptions that you'll see in have a have a common denominator and provide knowledge transfer and sustained knowledge evolution for.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the domain knowledge now.",
                    "label": 0
                },
                {
                    "sent": "Skeleton proposes something that we call the knowledge engineering cycle, which means that starting from the bonus Special Ontology, which I will be talking about a bit in shortly.",
                    "label": 0
                },
                {
                    "sent": "Plus plus means that it has some.",
                    "label": 0
                },
                {
                    "sent": "It reuses some of the well known or other ontologies from from the field and import them.",
                    "label": 0
                },
                {
                    "sent": "We transform them into a set of it in a set of pages which are which can be collectively or collaboratively edited.",
                    "label": 0
                },
                {
                    "sent": "But we also transform it into an annotation vocabulary.",
                    "label": 0
                },
                {
                    "sent": "And then we use this annotation vocabulary to annotate patient cases and X Rays and which are then also enriched.",
                    "label": 0
                },
                {
                    "sent": "Let's say with instances or patient ontology in context Ontology which we have developed and what it does is basically then provides knowledge basically collaborative knowledge creation, iterative that expiration and collaborative diagnosis on this by by using the back end support which we stands in an entity extraction Ontology evolution decision.",
                    "label": 1
                },
                {
                    "sent": "Support him now.",
                    "label": 0
                },
                {
                    "sent": "Just to make it clear why there is a cycle.",
                    "label": 0
                },
                {
                    "sent": "So if you come from the left to the right, basically you come from domain knowledge to the annotating patient cases, but in time the same annotated patient cases will provide a support for the four bits and pieces of domain knowledge to be to be involved, and that's why there's a.",
                    "label": 0
                },
                {
                    "sent": "There's a cycle, so I'll start brief.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we've we've done it ologist that we have developed as a means for for common technology an.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Knowledge integration, as I mentioned, we have to ontologies.",
                    "label": 0
                },
                {
                    "sent": "We have abundant in displeasure ontology, patient on Telegina context, ontology.",
                    "label": 1
                },
                {
                    "sent": "I guess the most important one is or not.",
                    "label": 0
                },
                {
                    "sent": "I guess the most important ones, the body, specially because the other two really.",
                    "label": 0
                },
                {
                    "sent": "I mean there are lots of other people that worked on this on this and and they did much more than we did.",
                    "label": 0
                },
                {
                    "sent": "So we claim that our contribution is basically this.",
                    "label": 0
                },
                {
                    "sent": "This this bonus pleasure Ontology which describes bonus pleasures that genotype and phenotype of this domain.",
                    "label": 0
                },
                {
                    "sent": "The pension ontology has a patient diagnosis and investigations, and the context ontology really looks at provenance and temporality.",
                    "label": 0
                },
                {
                    "sent": "And no, we haven't used standard provenance.",
                    "label": 0
                },
                {
                    "sent": "The vocabulary, although we are aware of, but again other there are other people that work on this field and this is not something that we claim as a contribution.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the bone displeasure Ontology currently has more than 12112 hundred concepts and the way in which is structured is basically on the three pillars that I was mentioning.",
                    "label": 0
                },
                {
                    "sent": "In this case, they're quite actually 3 three pillars that I was mentioning the very beginning, so we have on this page as which which are based in or which of the structured based on the groups which are present in the knology.",
                    "label": 0
                },
                {
                    "sent": "We have the phenotype information which characterizes this.",
                    "label": 1
                },
                {
                    "sent": "This bond is pleasures.",
                    "label": 0
                },
                {
                    "sent": "And then we have the genotype information which which details the genetic mutation gene mutation gene.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And an and proteins.",
                    "label": 0
                },
                {
                    "sent": "And to have a closer look at them.",
                    "label": 0
                },
                {
                    "sent": "You will consider this is for example how the first box looks like with the bones, measure the groups and an actual actual bonus pleasures then.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the genetic origin.",
                    "label": 0
                },
                {
                    "sent": "Genotype information.",
                    "label": 0
                },
                {
                    "sent": "We have a gene and gene mutation in this gene is actually enriched with plenty of information from from a link to plenty of information already existing in in, in, in, in the paramedical.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Listing biomedical ontology.",
                    "label": 0
                },
                {
                    "sent": "While definitively character or some type information reuse is also a lot of other ontologies.",
                    "label": 0
                },
                {
                    "sent": "Other introducer out there, such as the Human Phenotype Ontology, the.",
                    "label": 0
                },
                {
                    "sent": "Genotype and trait ontology or the foundation model.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Honestly, this is just to show up most simple example.",
                    "label": 0
                },
                {
                    "sent": "This is how we have included some of the domain restricts the restrictions in the field, such As for example a condo.",
                    "label": 0
                },
                {
                    "sent": "Plasia is in principle characterized by a set of gene mutations and some some typical typical actress.",
                    "label": 0
                },
                {
                    "sent": "I mean obviously these are.",
                    "label": 0
                },
                {
                    "sent": "You know if you go down to the actual label of the concepts, you'll see exactly what I'm talking about and.",
                    "label": 0
                },
                {
                    "sent": "They also have a model inheritance, which in this case is dominant dominant inheritance.",
                    "label": 0
                },
                {
                    "sent": "One last thing which I want to mention here is that so we have 1200 concepts which were manually important and automatically another part created and they're described by more than 3000 serotype phenotypic characteristics which we're taking.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Only for human type ontology.",
                    "label": 0
                },
                {
                    "sent": "I really want to spend too much time on the patient ontology which basically just says you know page.",
                    "label": 1
                },
                {
                    "sent": "We have a patient on the patients under things which was diagnosed with bone displeasure and exhibits some fanatical characteristic sorkar Assange Matei.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mission and finally the context ontologies, which is really tries to capture where such information was was was, you know, presented 1st and then when and why.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Context.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let's get into the interim order to the interesting thing.",
                    "label": 0
                },
                {
                    "sent": "So the platform is actually built on Drupal 7 and our contribution is a sort of models that we have built for Drupal seven to make.",
                    "label": 0
                },
                {
                    "sent": "To make this work so one of the things that we did was to start wrapping some of the NCBO and CBO services and we started with severe annotator and So what we did was basically a Drupal Drupal 7 module for the NCR, not later which is fully customizable and you can use to do some automatic or automatic.",
                    "label": 0
                },
                {
                    "sent": "Or semantic annotation?",
                    "label": 0
                },
                {
                    "sent": "Sorry, in Drupal this as far as I know is actually already present in the code based off of the annotators.",
                    "label": 0
                },
                {
                    "sent": "We probably you can you can find it already, find it there another another model that we have provided was what we have.",
                    "label": 0
                },
                {
                    "sent": "We have implemented was a vocabulary imports which basically goes from an authority to taxonomy in Drupal which goes very well hand in hand.",
                    "label": 0
                },
                {
                    "sent": "Basically with wins at the NCBA annotator because if you really want to do a semantic annotation, you know the answer.",
                    "label": 0
                },
                {
                    "sent": "Gives a concept, but then you need those concepts within Drupal to to to be able to link them to the actual to the actual content.",
                    "label": 0
                },
                {
                    "sent": "And the modularization is there.",
                    "label": 0
                },
                {
                    "sent": "The mobilization is there because basically you can choose a view from the ontology, so you don't have to import oil teologi.",
                    "label": 0
                },
                {
                    "sent": "But you can mention which concepts and which subclasses of those concepts or instances of the concepts we want to import.",
                    "label": 0
                },
                {
                    "sent": "And finally we we, we, we to make sure that the cycle is closed and we implemented knowledge import we called it where.",
                    "label": 0
                },
                {
                    "sent": "Basically it's an ontology to content to basically.",
                    "label": 0
                },
                {
                    "sent": "Starting from ontology to create an entire Drupal website and then to do that too close to close that across the cycle.",
                    "label": 0
                },
                {
                    "sent": "We also have their who they ontology evolution part, which is using currently on our dev back end, which is said some men doesn't use the actual Drupal back end, just under nickel the santanic ratio, which which I can talk about offline just.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A quick overview on what does Rupert 7 provide currently as ever Def.",
                    "label": 0
                },
                {
                    "sent": "So as you know at the office part of the 7:44 and what it does is basically it allows you to have error DFA annotating Drupal pages.",
                    "label": 0
                },
                {
                    "sent": "So basically trooper content tool error def via instances.",
                    "label": 0
                },
                {
                    "sent": "So basically every time you create a new node it creates an instance for the concept that was mapped to that with that content type and it has Parker support and we are really grateful to Steven Antolin and to the people that started.",
                    "label": 0
                },
                {
                    "sent": "Is this this work and all we do is to basically just to try to.",
                    "label": 0
                },
                {
                    "sent": "They also give something to this back to the community.",
                    "label": 0
                },
                {
                    "sent": "So what we have added as a set of modules which will be or obviously open open source and we're only given to the Community is to start from an existing autology rather study starting from from from empty Drupal site and we have this ontology content to Drupal.",
                    "label": 1
                },
                {
                    "sent": "So basically we have an ontology.",
                    "label": 0
                },
                {
                    "sent": "You can generate an entire group aside with it.",
                    "label": 0
                },
                {
                    "sent": "We have a concept based mapping.",
                    "label": 0
                },
                {
                    "sent": "I won't talk too much about it.",
                    "label": 1
                },
                {
                    "sent": "The idea is that instead of having Drupal content to earlier via instances, you have your classes which allows you then to do.",
                    "label": 0
                },
                {
                    "sent": "Also this connection between the between those classes and classes, which might be related to them via class axioms, which is currently not possible.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we provide in terms of the collaborative knowledge creation, so we have this wiki style editing of the.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the of the bonus special have this micro contributions which are linked to the link to the conjectures as I was mentioning.",
                    "label": 0
                },
                {
                    "sent": "For example, the fact that you propose a move of 1 disorder to another from a group with another can be modeled as a.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My contribution, and we have Vicki Stylus sorry of direct domain knowledge encoding which allows be allows experts to move across from one place to another and so on.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So basically by allowing altering the class and told the structure and the class axioms and I won't go into versioning and consistency checking and I'll tell you straight forward that we haven't done it before other four.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, but the way it is in the plan when it comes to knowledge transfer, I've already showed you this.",
                    "label": 1
                },
                {
                    "sent": "So from a bonus pleasure ontology.",
                    "label": 0
                },
                {
                    "sent": "You know we can annotate.",
                    "label": 0
                },
                {
                    "sent": "We can produce an annotation vocabulary which annotates patient case next race and the way in which this is done is a bit more complicated because it takes a bit of time, so these things are there so that the the items on the left which are the patient case in X Rays are annotated.",
                    "label": 0
                },
                {
                    "sent": "There are putting a another free pozza Tori and in time with the help of the community with a helper community then.",
                    "label": 0
                },
                {
                    "sent": "They go and support that comes from from the patient.",
                    "label": 1
                },
                {
                    "sent": "Places to go back to the ontology and the bits and pieces that connect the two things that the tool is a temporal states are collaborative diagnosis the micro contributions.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mission and this is their support in terms of what the modules, for example, that the model that we have we have mentioned provides semantic annotation of clinical summaries.",
                    "label": 0
                },
                {
                    "sent": "As you can see here.",
                    "label": 0
                },
                {
                    "sent": "So this is using for the report that we have implemented to do semantic annotation of this clinical summary and.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We will HBO on teologi or and also on.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the X Rays, and obviously these are then connected to A to a patient.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Case and similarly follow collaborative diagnosis where which is characterized by by open discussions.",
                    "label": 1
                },
                {
                    "sent": "We have a five star rating or voting system, but don't take the voting as an actual voting, but rather as a measure of confidence in that in that diagnosis it allows multiple diagnosis an it's it's case or not.",
                    "label": 0
                },
                {
                    "sent": "Given so that the case will not this.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guys went to stop stop this.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In terms of access control, because this is very sensitive issue.",
                    "label": 0
                },
                {
                    "sent": "So we have authentication.",
                    "label": 0
                },
                {
                    "sent": "We have groupings, access control intragroup and intergroup.",
                    "label": 1
                },
                {
                    "sent": "So basically someone that is part of multiple groups can share a case with all the groups or summer.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The groups we have individual and role based out of access control.",
                    "label": 1
                },
                {
                    "sent": "Individual means that only the case order, for example sees the sensitive information, although the case is shared with the other with the other members of the group, they won't see it.",
                    "label": 0
                },
                {
                    "sent": "They will only see the clinical summary which is shared for diagnosis purposes in the diagnosis and the role is connected to domain knowledge because we have an editorial in process and only the the editors of the disease are able to.",
                    "label": 0
                },
                {
                    "sent": "To change the actual description of the disease while the rest can can assert micro contributions, and finally, for from.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "From the data RDF perspective, we do some sort of data filtration which basically the patient allows the patient.",
                    "label": 1
                },
                {
                    "sent": "They are thought to be transforming patient descriptions only.",
                    "label": 1
                },
                {
                    "sent": "The tags are only the tags are kept.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Order some deep characteristics so I won't go into details with respect.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To the decision support 'cause I'm I'm running out of time.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll tell you a bit about the future work.",
                    "label": 1
                },
                {
                    "sent": "So what we want to do next is to enrich the bonus special ontology with protein structures.",
                    "label": 1
                },
                {
                    "sent": "Then we want to do a bit more on the ontology population side by mining.",
                    "label": 0
                },
                {
                    "sent": "For example, genotype, phenotype associations and to really publish this data properly as linked data well.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From the community side, we want to integrate with existing resources such as international connected is positive history or ESPN.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, from the troopers had of things we want to do extra tagging and clinical setting that clinical summaries tagging or annotation by you.",
                    "label": 0
                },
                {
                    "sent": "For we are composite composite tax structures such as the one that is shown there, which you wouldn't find in any in any in any actual ontology as being as being a phenotypic characteristic.",
                    "label": 0
                },
                {
                    "sent": "An proper and advanced auto generation support VR project for.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to summarize so.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the skeleton platforms Clayton, Muskrat on projects that will I was talking about represent over or is a really apart from the trust to provide knowledge evolution decision support for us later.",
                    "label": 0
                },
                {
                    "sent": "This pleasure domain by using the community or by supporting the community and by supporting or using the existing domain knowledge and the collaborative required patient cases and collaborative diagnosis.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thanks for this presentation.",
                    "label": 0
                },
                {
                    "sent": "I was just wondering, did you define some set of rules for Community annotation or something I mean.",
                    "label": 0
                },
                {
                    "sent": "There was in terms of in the semantic sense or rules in terms of access control, know, annotating.",
                    "label": 0
                },
                {
                    "sent": "The correct I mean so you can get a unified set of annotation because it was a community, not the annotation is done automatically, so the annotation is on the clinical summaries done automatically by using, then CBO annotate or end the vocabulary, sorry, the ontology taxonomy.",
                    "label": 0
                },
                {
                    "sent": "Module that we have implemented.",
                    "label": 0
                },
                {
                    "sent": "So does that automatically is not done by by the Community.",
                    "label": 0
                },
                {
                    "sent": "The community does the collaborative diagnosis.",
                    "label": 0
                },
                {
                    "sent": "Understanding and please correct me from if I'm wrong that that you're collecting an you know information from a very specific domain here in terms of the ontology that you've, your contribution ontology an while that's being produced and through the development of that what?",
                    "label": 0
                },
                {
                    "sent": "Measures are you taking to ensure that the domain specific information is exactly as it should be.",
                    "label": 0
                },
                {
                    "sent": "Becaused, I think it's I'm working in a completely disjoint domain.",
                    "label": 0
                },
                {
                    "sent": "However the mapping problem is identical where.",
                    "label": 0
                },
                {
                    "sent": "There might be logical, or you know, semantic discrepancies that are extremely hard to pick up that have not picked up at the design stage.",
                    "label": 0
                },
                {
                    "sent": "And jeopardize the over overall usability of entology as things go on, because this system might be able to be used.",
                    "label": 0
                },
                {
                    "sent": "However, there might be, you know really, really hard to define inaccuracy in the system itself.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, when it comes to actual consistency of, for example, of the of the ontology within time, we haven't done yet something about it, however.",
                    "label": 0
                },
                {
                    "sent": "Rules, not the rules.",
                    "label": 0
                },
                {
                    "sent": "If Emma, sister class axioms and existing domain knowledge is curated by the community, so for example, when?",
                    "label": 0
                },
                {
                    "sent": "If you know the ontology was created manually partly in automatically another part, which means that basically the you know some of the definitive characteristic Association with the diseases were doesn't automatically, but is the role of the Community.",
                    "label": 0
                },
                {
                    "sent": "Then to clean this and to make sure that that's accurate from the domain perspective, what we do is just to transpose that into.",
                    "label": 0
                },
                {
                    "sent": "Class axioms, then in the back.",
                    "label": 1
                },
                {
                    "sent": "Thank you very much again.",
                    "label": 0
                }
            ]
        }
    }
}