{
    "id": "ny2ovtmsqzddh63un2gpxulgcezlnmwp",
    "title": "Predicting Severity of Road Traffic Congestion using Semantic Web Technologies",
    "info": {
        "author": [
            "Freddy Lecue, Accenture Technology Labs"
        ],
        "published": "July 30, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/eswc2014_lecue_predicting/",
    "segmentation": [
        [
            "So I'm going to present some work within an in IBM research in collaboration with Dublin City, sorted to traffic data and ready to finding way for predicting traffic condition in Dublin City so."
        ],
        [
            "So I mean OK in traffic and transportation domain traffic and congestion's cause a lot of problems in Spain, I mean and people waste time in the car and then you you waste fuels you?",
            "I mean at the end a lot of men.",
            "So here you have a few figures about some data and in the US and the team in terms of what kind of of?",
            "Of arrows or gallons of fuels are wasted every year, and it's getting worse and worse because people and citizens in the city get access much more to do cars and the infrastructure.",
            "Doesn't we change over years because it cost money and you know, it's a crisis of public sector.",
            "Doesn't really invest a lot of money in traffic infrastructure, so so the question is how you reduce traffic congestion using semantic web technologies?",
            "That could be.",
            "It could be look like with crazy, so we say.",
            "How can semantic activity can only reduce traffic conditions.",
            "So first a dowry many three ways.",
            "You want to reduce traffic congestion.",
            "So one is a first you increase the infrastructure so even knew you knew roads you increase.",
            "You change traffic lights to attention and things, but that cost a lot of money and a lot of time from their traffic management systems and from the managers, and so it's not where you kind of an easy way to go.",
            "The second one is to engage people to take public transport and and again, it's not an easy I mean in the US it's even more tricky because public transport is not as good.",
            "I mean, it's not as efficient as in in Europe or in some countries like Switzerland, Switzerland and.",
            "And public transport is not really a good options for some cities.",
            "And the third option is if you have a way to pretty congestion then you may have some insight on how people are in city managers and traffic managers could understand what is the traffic conditions and what are the impacts on traffic and how they can only take actions.",
            "So if you can predict that in two hours of five or 10 hours you will have traffic conditions in this specific location in the city and.",
            "Then you may give insight and in two traffic managers they can.",
            "They can take action, then we can say OK, let me be having some panels rerouting and giving.",
            "We kind of tools and system for the traffic manager to take actions on traffic."
        ],
        [
            "So you you may say, OK, fine traffic condition.",
            "I mean it's good.",
            "It's nice piece of work with that many traffic systems out there and in US in France, in Italy, in all cities they have all traffic system.",
            "They have the old system for doing predictions.",
            "So prediction is not new on its own.",
            "And you have many seats then."
        ],
        [
            "So mainly so we say OK, it's fine.",
            "They have many systems and one of The thing is they don't realize pretty well is the accuracy of the prediction.",
            "So in minis in many different domains, prediction is his other adverse, pretty nicely and very well with nice accuracy.",
            "Nice predictions within the context of traffic is much more tricky because the data.",
            "Is subject to many different contextual information, so whether washer rose events in the city, you know the disturbance in context.",
            "There you know or informations which which doesn't really come from the the people in the cars or the card itself.",
            "Or really the traffic light strategies.",
            "I mean the code doesn't really cause from this this information and so most of the existing techniques they use, Goshen models.",
            "They use regression models.",
            "Do you have a lot of state of the art?",
            "Getting matching learning that they kind of apply.",
            "I mean scandal, we all topics or 40 years ago.",
            "Try to address these problems and the question is how you can address accuracy in predictions 'cause they are systems where they are not that accurate and and we started from these statements and and and we say OK they are not that accurate because actually if you think about the problem is about context and and whether Russia was events woodworks, music events or whatever.",
            "I mean surrounding informations could be useful.",
            "Kind of contextualising the predictions and this is where we will be starting and say OK, there's nobody semantics nobody Contacts about.",
            "Very few like Russia was already on the day basis, their predictions, we want databases and based on the day on the weekends.",
            "OK they can do weekdays and weekends, but you can't fully stop at that level.",
            "So we try to go further."
        ],
        [
            "And say, OK, let's consider context.",
            "And and so you see on the right hand side, so you have different different type of data.",
            "So first you have the traffic condition, then we have the weather conditions and then you have incident conditions and you have made may have many more and this is what we call the context.",
            "And when you in context you also I mean underlying.",
            "It's kind of the semantic information semantic encoding because or the context is OK, it could have a temporal and spatial representation.",
            "But again if you want to link to rings everything because some are ready to even somehow related.",
            "Do informations and what what type of window informations?",
            "What type of days and you have a lovely we strongly typed in type of informations.",
            "So we will start from here and say we have a lot of data and we are fortunate to be in Dublin City and we have access to a lot of data that's not old.",
            "Open Data Committee may have access.",
            "For instance we have access to the best data which is not public and the few that information even if we really try to push up on data in the ring city.",
            "So if you go to doubling.",
            "But IE, which is the open data platform to 44 island and specifically for Dublin City, you will have access to traffic data and this we try to push data.",
            "I mean raw data 1st and the main goal is to say try to correlate all this information so.",
            "And how you contextualize and try to find OK, I know what is the weather info, what is the weather Now I know what is the traffic conditions and.",
            "Let's try to find techniques for for mining this information altogether and learn how it's how you can learn rules.",
            "And if you see those windows, there was the wet windows, it's the way you you have different time, so you can consider all this information as kind of streams.",
            "So because it's exposed with Stanford in formations, so weather data is coming as a stream, traffic data is coming as a stream and incident data is coming on the temporal basis which again can be considered a stream.",
            "So how you try to correlate information over past and existing techniques?",
            "They really focus on statistical patterns, matching similarity and vary based on.",
            "I mean SVN techniques and they try to finding clusters based on numerical values and in our context the data is not necessarily numerical values because you have events like traffic like music events and the overall types music or social events.",
            "Or would walks on the impact of the world works and the type of work that is already strongly typed and you try to find the the kind of the coalition.",
            "So the similarity, overtime and try to find OK.",
            "Which type of context was it you go and which is kind of similar of the context I have right now in terms of weather or traffic conditions and you try to find our things match together how they are similar to get on.",
            "We use semantic web technology for representing the information, so I'll go much more in details."
        ],
        [
            "About the approach and 1st about the data.",
            "So that's the data we consider.",
            "So older wet bubbles you see the map, the sensors in the city and the traffic, the traffic.",
            "The transportation guys could discuss data.",
            "So we went on achronim and smelly the if you look at the intersection in the city on the road you have a bit of cracking the pavement and those things actually have sensors behind and they measure cars passing by's and they have a few analytics and system for counting the number of cars.",
            "And they were reaching the whole busy the road based on the number of cars and a number of other than the size of the space between cars.",
            "And that's the that's the risk at state and all the the sensor we have here and we get this information.",
            "And in addition we have radio stations.",
            "So difference in Dublin City we have AIDS weather stations.",
            "We have also stations that that measure the condition of word of the world conditions.",
            "So if you have a lot of water on the world, I mean in the end you have a lot of humidity's.",
            "Obviously that's quite important to be considered and you also information about events.",
            "So catch data from social media to grab to get accident incidents and try to all cooperate and all combined this information and see how they impact and can be used for doing better print."
        ],
        [
            "So that's the system.",
            "So this system, the prediction system is part of of an IBM research asset which called Star City, which stand for semantic traffic.",
            "Kinetic sand reasoning for city.",
            "That's where we inject and interprets semantics, and we do a bit of explanation of congestion's analysis of analysis of traffic, and so this prediction part is a kind of a small system which is integrated into full complete.",
            "It's system here."
        ],
        [
            "So here you have a view of the traffic conditions.",
            "So so on the on the on the top.",
            "That's the that's part of Dublin City and you have a few colors.",
            "So green reason means that's OK road and the document document is the the worst is the traffic conditions and what we do is we do traffic conditions, traffic estimations of a few errors, head and control compared to state of the arts we consider context.",
            "Contact information and I will show you doing the further experimentation, but we get much accurate results in a longer time window because of the context that we consider and.",
            "So you can have traffic views and you have much more the proportion of traffic condition in Dublin City and the traffic manager can change.",
            "Views can change different locations and they can ask for different time window in terms of of the prediction time.",
            "So now."
        ],
        [
            "I'm going to discuss, so here I'm going to discuss the main challenges we were facing for doing other shipping.",
            "This works so, so here does the data again, so just come back to this slide just to say that's a lot of data.",
            "They don't have all the schema and and most of it.",
            "I mean I don't know if you if I can call it streams, but it's kind of dynamic informations at least.",
            "And you have."
        ],
        [
            "Mindy Domain 3 high level challenges while first how you enter data, variety and velocity.",
            "Because you have sensors from Bruce is you have sensors from this cat data you've seen.",
            "So from radio stations and they're all coming from different using different sorts of different formats and they all using different time of updates.",
            "So some updated every five minutes every 10 minutes every 10 seconds and at the end you need to aggregate and you have a bit of finish you and how you kind of capture you a snapshot.",
            "Of specific time, because some are much more updated if we if we refuse the guns and some much more or less awkward like accident, you don't have accidentally with five minutes like common random basis.",
            "And the second challenge was to how you reason on time evolving knowledge so you have streams and then OK save it and how you only do predictions and how you learn rules overtime.",
            "And the third one is how you do constant predictions and the consistent is very important.",
            "That's where the semantic was used for doing predictions.",
            "So when we get the results so you get some some some results about the prediction.",
            "Say OK, the traffic conditions in this in this small portion of the city will be even go over whatever stages.",
            "Then you need to kind of understand if the rules that you apply to your system because it's based on what will happen in the future and will be consistent based on historical information.",
            "And that's where we use this consistency checking to check if the knowledge that you get is consistent with the knowledge base that you get before to see if you don't actually too much.",
            "Crazy things coming along."
        ],
        [
            "And so the 1st the 8th, the data variety.",
            "So I guess I mean as many use papers you need to deal with the means you deal with real problem data doesn't really come as free in RDF and or in all or whatever semantic representation.",
            "So you need to spend a lot of time in having a common representation format for presenting information and.",
            "So that's why we have these architecture that transform all these different source of data.",
            "So you have merged CSV data that we transform on the fly to its information.",
            "You need to grab natural language terms in it, even if in our case the data was kind of pretty well structured and then you have XML format and even worse we have some PDF data.",
            "So you have word works describing PDF.",
            "So the first we will need engineers for.",
            "For doing those mapping files and every time you have a new data source, here you go.",
            "You need a new mapping files or knew wrapping technologies for forgetting inside.",
            "So and all the helper, the helper boxes we further to technology we use for transforming the raw data in the semantic problem mentation, and that's and that's not really an easy job to be honest, and specially if you go under from the left to the right inside you need a lot of tricks and.",
            "But the fingers because we walking into streams type of data.",
            "It's OK, you do it once and mainly the PDF.",
            "The guys in Dublin City using with always the same structure on the and they use and you can easily pass headers using some.",
            "I mean, some pretty fine techniques, so every time they upload you would work, so it's kind of everywhere.",
            "It's quickly, you can easily grab the District 2 or by by doing this and the same for this and for CSV and tweets against the data come from specific sensors from active.",
            "We have two main sense of the birds and the Scots data and again they don't change at all.",
            "So if the schema, even if they do risky by the form of CSV that's coming, it's always the same.",
            "So you do the mapping.",
            "Once and then you apply to systems.",
            "OK. Once one new source of data here the mapping found you do the transformation.",
            "You link everything and at the end you have this or what we call ontology streams.",
            "So it's a streams of RDF data with time attach.",
            "So because it's time related."
        ],
        [
            "OK, so here's an example of mapping files.",
            "Because we we play with streams in our context, so so that's the mapping files that how we transform the worst CSV to the details in the paper, so I won't go through.",
            "I'm going for the details, but that's the.",
            "So how you transform?",
            "Who do the Woody tattoo to RDF do all year in our case, and here is an example of the former representation of of a snapshot of one of ones, and so, so I'll go."
        ],
        [
            "How much money on the kind of the techniques we use for the for the reasoning?",
            "If you want so five more minutes, five last minutes, so that's where we focus on now.",
            "So so so consider you have one streams the top one and then you have another stream the green, I mean the one on the on the bottom and The thing is what we try to do is we we, do we do we do what we call auto correlation?",
            "So to coalition you reconsider one stream.",
            "So it's considered this guy and this guy, and then you know what is the weather, what weather will be in five hours because you have some some systems, some service that you can use.",
            "And then you say, OK, I know what kind of context I will get in five hours or in terms of events, because you know what kind of music event will be there in 5 minutes in five hours and then you have a lot of context and you try to find all similar information over the past with the same contextual information so you know what type of the weather, what type of word works right.",
            "Type of music events you would get and then you try to find similar patterns over the year and then you do kind of a ranking based on the similarity of the of the type of events.",
            "Or like a music.",
            "Events would be strongly linked to a concert events and you have your IO similarity, but that's we call auto coalition so you try to kind of filtering and find similar patterns and when we identify those want with are relevant then you say OK I know which context I should consider folding my predictions.",
            "Let's consider.",
            "All these sensors that match pretty well and try to learn words, so that's where we do the mining, so we do some Association mining over RDF files and try to find which artifacts come together even if they are not linked at all.",
            "We try to find we do some mining techniques for aggregating all the information together and that's where we do the kind of the magic if you want.",
            "So how you do the prediction based on these holes?",
            "That's what you get and out of these holes.",
            "You apply in these guys on base with data you get and then you you you learn.",
            "I mean you you, you predict what you should be, what you should get over here by applying the rules that you consider in historical data."
        ],
        [
            "OK, so that's more or less because I'm kind of running late, so that's kind of summarizing summarize the autocorrelations would look to coalition over historical data, and again, semantic is very important because all the data he is semantically encoded and you compute semantic similarity over the context.",
            "And so that's due to correlations.",
            "Domain imitation is the moisture equal data.",
            "The more time consuming it is, because you compute a lot of time with similar, but you have similarity between different snapshots and the more complex data streams.",
            "If you had much more expensive it in the representations, then you do.",
            "The matching is even more expressive, and then that's less scalable for the approach and then four."
        ],
        [
            "The reasoning on multiple streams, so that's why you're mentions you.",
            "You learn words and you try to find some basic support and confidence overtime, and then you kind of.",
            "You want these fools.",
            "You want this words and your probably the most yeah the most.",
            "Let's say the most efficient one based on the few scores that we have.",
            "But The thing is, computing those words is exponential based on the number of facts you have here, so that's one of the book to neck and the and the words filtering.",
            "So the whole thing is the bottleneck and we don't do cross temporal Association.",
            "So let's say if you have the music events right now and the weather condition is, but maybe if you have.",
            "Music events in five hours and maybe the weather will be not good in six hours.",
            "We don't do this.",
            "What Association?"
        ],
        [
            "That's one mutations and then, so that's for the consistent predictions.",
            "Then you get out.",
            "You get some rules when coding schools and then you apply to the current state of the current time at the time where you plan to do to do other predictions, and then you get some Wizards and try to find if that consistent with the context at the end that discard a lot of food because many are not really or consistent."
        ],
        [
            "So that's so.",
            "That's the data we consider, so we do some conversion of the data in RDF, and again it's pretty fast, just like defining the mapping is not and you have vocabularies, we use those mini state of the art mappings, plus a few ones that we needed to extend or even come with like the scottson tragedies knows concentrate.",
            "Their vocabulary is very simple with expressive and you can't really do that much reasoning."
        ],
        [
            "And so, in terms of experimentation are just quickly so security we getting we have definitely worse than state of the art techniques that don't use context.",
            "I mean they, that's where until when you move the context.",
            "The more data sources you get, the worst is our computations until they are purchased.",
            "It's kind of spell much better."
        ],
        [
            "With currency, so that's where the state of the art under that's where we get when we add much more context.",
            "So I'm sorry if I'm spinning up a bit.",
            "The expectation that you have any question producing, let me know."
        ],
        [
            "At the end I wanted to focus on the lesson learned we had from Dublin City, so definitely negative correlation between safety and accuracy.",
            "We get better accurate results, but definitely because you had streams, you had a lot of overhead.",
            "Security wise they also shows who we have some tricks for it for improving the scalability and then we do on the unit to do under fly discovery of appropriate context switch context with the best.",
            "Still an open issue and how you discover popular calories.",
            "And you need to spend some time for notating these data with a wide vocabulary, and which one is it?",
            "I mean, that's that's that's not an easy one and you have the classic complexity explicitly traders.",
            "So between the the way you were present in formations, and if that wasn't enough, your information that you can reason out of it and then stream data is noisy.",
            "So we need a lot of filtering techniques for forecasting out order the noisy data and temporal reasoning is.",
            "Not beyond or in our case, so it's very simple list of such notes."
        ],
        [
            "And so, in terms of accomplishments, that will be my last slide, so that's an IBM research asset.",
            "It's part of.",
            "It's part of the Star City or platform for dealing with traffic.",
            "It's running live in the ring, so dieseling here.",
            "If the server is not anymore on the maintenance, you can play with.",
            "The tool is doing different things and.",
            "And though it's power and we we so it's working with the in Dublin and we try to and we have some experimentation with with Bologna in Italy when U project with Miami for for doing another type of traffic related scenarios and in with you with some guys from from my PM over there and and all with different challenges and different level of success because they all have different changes so it's not.",
            "I mean we apply for one city and then applying to different cities.",
            "We come up with different challenges.",
            "I want this copy because it's out of scope for this, but.",
            "We did a few extra extra research on user challenges here, 'cause that's that's under my."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to present some work within an in IBM research in collaboration with Dublin City, sorted to traffic data and ready to finding way for predicting traffic condition in Dublin City so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I mean OK in traffic and transportation domain traffic and congestion's cause a lot of problems in Spain, I mean and people waste time in the car and then you you waste fuels you?",
                    "label": 0
                },
                {
                    "sent": "I mean at the end a lot of men.",
                    "label": 0
                },
                {
                    "sent": "So here you have a few figures about some data and in the US and the team in terms of what kind of of?",
                    "label": 0
                },
                {
                    "sent": "Of arrows or gallons of fuels are wasted every year, and it's getting worse and worse because people and citizens in the city get access much more to do cars and the infrastructure.",
                    "label": 0
                },
                {
                    "sent": "Doesn't we change over years because it cost money and you know, it's a crisis of public sector.",
                    "label": 0
                },
                {
                    "sent": "Doesn't really invest a lot of money in traffic infrastructure, so so the question is how you reduce traffic congestion using semantic web technologies?",
                    "label": 0
                },
                {
                    "sent": "That could be.",
                    "label": 0
                },
                {
                    "sent": "It could be look like with crazy, so we say.",
                    "label": 0
                },
                {
                    "sent": "How can semantic activity can only reduce traffic conditions.",
                    "label": 0
                },
                {
                    "sent": "So first a dowry many three ways.",
                    "label": 0
                },
                {
                    "sent": "You want to reduce traffic congestion.",
                    "label": 1
                },
                {
                    "sent": "So one is a first you increase the infrastructure so even knew you knew roads you increase.",
                    "label": 0
                },
                {
                    "sent": "You change traffic lights to attention and things, but that cost a lot of money and a lot of time from their traffic management systems and from the managers, and so it's not where you kind of an easy way to go.",
                    "label": 0
                },
                {
                    "sent": "The second one is to engage people to take public transport and and again, it's not an easy I mean in the US it's even more tricky because public transport is not as good.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's not as efficient as in in Europe or in some countries like Switzerland, Switzerland and.",
                    "label": 0
                },
                {
                    "sent": "And public transport is not really a good options for some cities.",
                    "label": 0
                },
                {
                    "sent": "And the third option is if you have a way to pretty congestion then you may have some insight on how people are in city managers and traffic managers could understand what is the traffic conditions and what are the impacts on traffic and how they can only take actions.",
                    "label": 1
                },
                {
                    "sent": "So if you can predict that in two hours of five or 10 hours you will have traffic conditions in this specific location in the city and.",
                    "label": 0
                },
                {
                    "sent": "Then you may give insight and in two traffic managers they can.",
                    "label": 0
                },
                {
                    "sent": "They can take action, then we can say OK, let me be having some panels rerouting and giving.",
                    "label": 0
                },
                {
                    "sent": "We kind of tools and system for the traffic manager to take actions on traffic.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you you may say, OK, fine traffic condition.",
                    "label": 0
                },
                {
                    "sent": "I mean it's good.",
                    "label": 0
                },
                {
                    "sent": "It's nice piece of work with that many traffic systems out there and in US in France, in Italy, in all cities they have all traffic system.",
                    "label": 1
                },
                {
                    "sent": "They have the old system for doing predictions.",
                    "label": 0
                },
                {
                    "sent": "So prediction is not new on its own.",
                    "label": 0
                },
                {
                    "sent": "And you have many seats then.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So mainly so we say OK, it's fine.",
                    "label": 0
                },
                {
                    "sent": "They have many systems and one of The thing is they don't realize pretty well is the accuracy of the prediction.",
                    "label": 0
                },
                {
                    "sent": "So in minis in many different domains, prediction is his other adverse, pretty nicely and very well with nice accuracy.",
                    "label": 0
                },
                {
                    "sent": "Nice predictions within the context of traffic is much more tricky because the data.",
                    "label": 0
                },
                {
                    "sent": "Is subject to many different contextual information, so whether washer rose events in the city, you know the disturbance in context.",
                    "label": 0
                },
                {
                    "sent": "There you know or informations which which doesn't really come from the the people in the cars or the card itself.",
                    "label": 0
                },
                {
                    "sent": "Or really the traffic light strategies.",
                    "label": 0
                },
                {
                    "sent": "I mean the code doesn't really cause from this this information and so most of the existing techniques they use, Goshen models.",
                    "label": 0
                },
                {
                    "sent": "They use regression models.",
                    "label": 0
                },
                {
                    "sent": "Do you have a lot of state of the art?",
                    "label": 0
                },
                {
                    "sent": "Getting matching learning that they kind of apply.",
                    "label": 0
                },
                {
                    "sent": "I mean scandal, we all topics or 40 years ago.",
                    "label": 0
                },
                {
                    "sent": "Try to address these problems and the question is how you can address accuracy in predictions 'cause they are systems where they are not that accurate and and we started from these statements and and and we say OK they are not that accurate because actually if you think about the problem is about context and and whether Russia was events woodworks, music events or whatever.",
                    "label": 0
                },
                {
                    "sent": "I mean surrounding informations could be useful.",
                    "label": 0
                },
                {
                    "sent": "Kind of contextualising the predictions and this is where we will be starting and say OK, there's nobody semantics nobody Contacts about.",
                    "label": 0
                },
                {
                    "sent": "Very few like Russia was already on the day basis, their predictions, we want databases and based on the day on the weekends.",
                    "label": 0
                },
                {
                    "sent": "OK they can do weekdays and weekends, but you can't fully stop at that level.",
                    "label": 0
                },
                {
                    "sent": "So we try to go further.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And say, OK, let's consider context.",
                    "label": 0
                },
                {
                    "sent": "And and so you see on the right hand side, so you have different different type of data.",
                    "label": 0
                },
                {
                    "sent": "So first you have the traffic condition, then we have the weather conditions and then you have incident conditions and you have made may have many more and this is what we call the context.",
                    "label": 0
                },
                {
                    "sent": "And when you in context you also I mean underlying.",
                    "label": 0
                },
                {
                    "sent": "It's kind of the semantic information semantic encoding because or the context is OK, it could have a temporal and spatial representation.",
                    "label": 0
                },
                {
                    "sent": "But again if you want to link to rings everything because some are ready to even somehow related.",
                    "label": 0
                },
                {
                    "sent": "Do informations and what what type of window informations?",
                    "label": 0
                },
                {
                    "sent": "What type of days and you have a lovely we strongly typed in type of informations.",
                    "label": 0
                },
                {
                    "sent": "So we will start from here and say we have a lot of data and we are fortunate to be in Dublin City and we have access to a lot of data that's not old.",
                    "label": 0
                },
                {
                    "sent": "Open Data Committee may have access.",
                    "label": 0
                },
                {
                    "sent": "For instance we have access to the best data which is not public and the few that information even if we really try to push up on data in the ring city.",
                    "label": 0
                },
                {
                    "sent": "So if you go to doubling.",
                    "label": 0
                },
                {
                    "sent": "But IE, which is the open data platform to 44 island and specifically for Dublin City, you will have access to traffic data and this we try to push data.",
                    "label": 0
                },
                {
                    "sent": "I mean raw data 1st and the main goal is to say try to correlate all this information so.",
                    "label": 0
                },
                {
                    "sent": "And how you contextualize and try to find OK, I know what is the weather info, what is the weather Now I know what is the traffic conditions and.",
                    "label": 0
                },
                {
                    "sent": "Let's try to find techniques for for mining this information altogether and learn how it's how you can learn rules.",
                    "label": 0
                },
                {
                    "sent": "And if you see those windows, there was the wet windows, it's the way you you have different time, so you can consider all this information as kind of streams.",
                    "label": 0
                },
                {
                    "sent": "So because it's exposed with Stanford in formations, so weather data is coming as a stream, traffic data is coming as a stream and incident data is coming on the temporal basis which again can be considered a stream.",
                    "label": 0
                },
                {
                    "sent": "So how you try to correlate information over past and existing techniques?",
                    "label": 0
                },
                {
                    "sent": "They really focus on statistical patterns, matching similarity and vary based on.",
                    "label": 0
                },
                {
                    "sent": "I mean SVN techniques and they try to finding clusters based on numerical values and in our context the data is not necessarily numerical values because you have events like traffic like music events and the overall types music or social events.",
                    "label": 0
                },
                {
                    "sent": "Or would walks on the impact of the world works and the type of work that is already strongly typed and you try to find the the kind of the coalition.",
                    "label": 0
                },
                {
                    "sent": "So the similarity, overtime and try to find OK.",
                    "label": 0
                },
                {
                    "sent": "Which type of context was it you go and which is kind of similar of the context I have right now in terms of weather or traffic conditions and you try to find our things match together how they are similar to get on.",
                    "label": 0
                },
                {
                    "sent": "We use semantic web technology for representing the information, so I'll go much more in details.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About the approach and 1st about the data.",
                    "label": 0
                },
                {
                    "sent": "So that's the data we consider.",
                    "label": 0
                },
                {
                    "sent": "So older wet bubbles you see the map, the sensors in the city and the traffic, the traffic.",
                    "label": 0
                },
                {
                    "sent": "The transportation guys could discuss data.",
                    "label": 0
                },
                {
                    "sent": "So we went on achronim and smelly the if you look at the intersection in the city on the road you have a bit of cracking the pavement and those things actually have sensors behind and they measure cars passing by's and they have a few analytics and system for counting the number of cars.",
                    "label": 0
                },
                {
                    "sent": "And they were reaching the whole busy the road based on the number of cars and a number of other than the size of the space between cars.",
                    "label": 0
                },
                {
                    "sent": "And that's the that's the risk at state and all the the sensor we have here and we get this information.",
                    "label": 0
                },
                {
                    "sent": "And in addition we have radio stations.",
                    "label": 0
                },
                {
                    "sent": "So difference in Dublin City we have AIDS weather stations.",
                    "label": 1
                },
                {
                    "sent": "We have also stations that that measure the condition of word of the world conditions.",
                    "label": 0
                },
                {
                    "sent": "So if you have a lot of water on the world, I mean in the end you have a lot of humidity's.",
                    "label": 0
                },
                {
                    "sent": "Obviously that's quite important to be considered and you also information about events.",
                    "label": 0
                },
                {
                    "sent": "So catch data from social media to grab to get accident incidents and try to all cooperate and all combined this information and see how they impact and can be used for doing better print.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's the system.",
                    "label": 0
                },
                {
                    "sent": "So this system, the prediction system is part of of an IBM research asset which called Star City, which stand for semantic traffic.",
                    "label": 0
                },
                {
                    "sent": "Kinetic sand reasoning for city.",
                    "label": 1
                },
                {
                    "sent": "That's where we inject and interprets semantics, and we do a bit of explanation of congestion's analysis of analysis of traffic, and so this prediction part is a kind of a small system which is integrated into full complete.",
                    "label": 0
                },
                {
                    "sent": "It's system here.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here you have a view of the traffic conditions.",
                    "label": 0
                },
                {
                    "sent": "So so on the on the on the top.",
                    "label": 0
                },
                {
                    "sent": "That's the that's part of Dublin City and you have a few colors.",
                    "label": 0
                },
                {
                    "sent": "So green reason means that's OK road and the document document is the the worst is the traffic conditions and what we do is we do traffic conditions, traffic estimations of a few errors, head and control compared to state of the arts we consider context.",
                    "label": 0
                },
                {
                    "sent": "Contact information and I will show you doing the further experimentation, but we get much accurate results in a longer time window because of the context that we consider and.",
                    "label": 0
                },
                {
                    "sent": "So you can have traffic views and you have much more the proportion of traffic condition in Dublin City and the traffic manager can change.",
                    "label": 1
                },
                {
                    "sent": "Views can change different locations and they can ask for different time window in terms of of the prediction time.",
                    "label": 0
                },
                {
                    "sent": "So now.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to discuss, so here I'm going to discuss the main challenges we were facing for doing other shipping.",
                    "label": 0
                },
                {
                    "sent": "This works so, so here does the data again, so just come back to this slide just to say that's a lot of data.",
                    "label": 0
                },
                {
                    "sent": "They don't have all the schema and and most of it.",
                    "label": 0
                },
                {
                    "sent": "I mean I don't know if you if I can call it streams, but it's kind of dynamic informations at least.",
                    "label": 0
                },
                {
                    "sent": "And you have.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mindy Domain 3 high level challenges while first how you enter data, variety and velocity.",
                    "label": 0
                },
                {
                    "sent": "Because you have sensors from Bruce is you have sensors from this cat data you've seen.",
                    "label": 0
                },
                {
                    "sent": "So from radio stations and they're all coming from different using different sorts of different formats and they all using different time of updates.",
                    "label": 0
                },
                {
                    "sent": "So some updated every five minutes every 10 minutes every 10 seconds and at the end you need to aggregate and you have a bit of finish you and how you kind of capture you a snapshot.",
                    "label": 0
                },
                {
                    "sent": "Of specific time, because some are much more updated if we if we refuse the guns and some much more or less awkward like accident, you don't have accidentally with five minutes like common random basis.",
                    "label": 0
                },
                {
                    "sent": "And the second challenge was to how you reason on time evolving knowledge so you have streams and then OK save it and how you only do predictions and how you learn rules overtime.",
                    "label": 0
                },
                {
                    "sent": "And the third one is how you do constant predictions and the consistent is very important.",
                    "label": 0
                },
                {
                    "sent": "That's where the semantic was used for doing predictions.",
                    "label": 0
                },
                {
                    "sent": "So when we get the results so you get some some some results about the prediction.",
                    "label": 0
                },
                {
                    "sent": "Say OK, the traffic conditions in this in this small portion of the city will be even go over whatever stages.",
                    "label": 0
                },
                {
                    "sent": "Then you need to kind of understand if the rules that you apply to your system because it's based on what will happen in the future and will be consistent based on historical information.",
                    "label": 0
                },
                {
                    "sent": "And that's where we use this consistency checking to check if the knowledge that you get is consistent with the knowledge base that you get before to see if you don't actually too much.",
                    "label": 0
                },
                {
                    "sent": "Crazy things coming along.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the 1st the 8th, the data variety.",
                    "label": 0
                },
                {
                    "sent": "So I guess I mean as many use papers you need to deal with the means you deal with real problem data doesn't really come as free in RDF and or in all or whatever semantic representation.",
                    "label": 0
                },
                {
                    "sent": "So you need to spend a lot of time in having a common representation format for presenting information and.",
                    "label": 0
                },
                {
                    "sent": "So that's why we have these architecture that transform all these different source of data.",
                    "label": 0
                },
                {
                    "sent": "So you have merged CSV data that we transform on the fly to its information.",
                    "label": 0
                },
                {
                    "sent": "You need to grab natural language terms in it, even if in our case the data was kind of pretty well structured and then you have XML format and even worse we have some PDF data.",
                    "label": 0
                },
                {
                    "sent": "So you have word works describing PDF.",
                    "label": 0
                },
                {
                    "sent": "So the first we will need engineers for.",
                    "label": 0
                },
                {
                    "sent": "For doing those mapping files and every time you have a new data source, here you go.",
                    "label": 0
                },
                {
                    "sent": "You need a new mapping files or knew wrapping technologies for forgetting inside.",
                    "label": 0
                },
                {
                    "sent": "So and all the helper, the helper boxes we further to technology we use for transforming the raw data in the semantic problem mentation, and that's and that's not really an easy job to be honest, and specially if you go under from the left to the right inside you need a lot of tricks and.",
                    "label": 0
                },
                {
                    "sent": "But the fingers because we walking into streams type of data.",
                    "label": 0
                },
                {
                    "sent": "It's OK, you do it once and mainly the PDF.",
                    "label": 0
                },
                {
                    "sent": "The guys in Dublin City using with always the same structure on the and they use and you can easily pass headers using some.",
                    "label": 0
                },
                {
                    "sent": "I mean, some pretty fine techniques, so every time they upload you would work, so it's kind of everywhere.",
                    "label": 0
                },
                {
                    "sent": "It's quickly, you can easily grab the District 2 or by by doing this and the same for this and for CSV and tweets against the data come from specific sensors from active.",
                    "label": 0
                },
                {
                    "sent": "We have two main sense of the birds and the Scots data and again they don't change at all.",
                    "label": 0
                },
                {
                    "sent": "So if the schema, even if they do risky by the form of CSV that's coming, it's always the same.",
                    "label": 0
                },
                {
                    "sent": "So you do the mapping.",
                    "label": 0
                },
                {
                    "sent": "Once and then you apply to systems.",
                    "label": 0
                },
                {
                    "sent": "OK. Once one new source of data here the mapping found you do the transformation.",
                    "label": 0
                },
                {
                    "sent": "You link everything and at the end you have this or what we call ontology streams.",
                    "label": 0
                },
                {
                    "sent": "So it's a streams of RDF data with time attach.",
                    "label": 0
                },
                {
                    "sent": "So because it's time related.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so here's an example of mapping files.",
                    "label": 0
                },
                {
                    "sent": "Because we we play with streams in our context, so so that's the mapping files that how we transform the worst CSV to the details in the paper, so I won't go through.",
                    "label": 0
                },
                {
                    "sent": "I'm going for the details, but that's the.",
                    "label": 0
                },
                {
                    "sent": "So how you transform?",
                    "label": 0
                },
                {
                    "sent": "Who do the Woody tattoo to RDF do all year in our case, and here is an example of the former representation of of a snapshot of one of ones, and so, so I'll go.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How much money on the kind of the techniques we use for the for the reasoning?",
                    "label": 0
                },
                {
                    "sent": "If you want so five more minutes, five last minutes, so that's where we focus on now.",
                    "label": 0
                },
                {
                    "sent": "So so so consider you have one streams the top one and then you have another stream the green, I mean the one on the on the bottom and The thing is what we try to do is we we, do we do we do what we call auto correlation?",
                    "label": 0
                },
                {
                    "sent": "So to coalition you reconsider one stream.",
                    "label": 0
                },
                {
                    "sent": "So it's considered this guy and this guy, and then you know what is the weather, what weather will be in five hours because you have some some systems, some service that you can use.",
                    "label": 0
                },
                {
                    "sent": "And then you say, OK, I know what kind of context I will get in five hours or in terms of events, because you know what kind of music event will be there in 5 minutes in five hours and then you have a lot of context and you try to find all similar information over the past with the same contextual information so you know what type of the weather, what type of word works right.",
                    "label": 0
                },
                {
                    "sent": "Type of music events you would get and then you try to find similar patterns over the year and then you do kind of a ranking based on the similarity of the of the type of events.",
                    "label": 0
                },
                {
                    "sent": "Or like a music.",
                    "label": 0
                },
                {
                    "sent": "Events would be strongly linked to a concert events and you have your IO similarity, but that's we call auto coalition so you try to kind of filtering and find similar patterns and when we identify those want with are relevant then you say OK I know which context I should consider folding my predictions.",
                    "label": 0
                },
                {
                    "sent": "Let's consider.",
                    "label": 0
                },
                {
                    "sent": "All these sensors that match pretty well and try to learn words, so that's where we do the mining, so we do some Association mining over RDF files and try to find which artifacts come together even if they are not linked at all.",
                    "label": 0
                },
                {
                    "sent": "We try to find we do some mining techniques for aggregating all the information together and that's where we do the kind of the magic if you want.",
                    "label": 0
                },
                {
                    "sent": "So how you do the prediction based on these holes?",
                    "label": 0
                },
                {
                    "sent": "That's what you get and out of these holes.",
                    "label": 0
                },
                {
                    "sent": "You apply in these guys on base with data you get and then you you you learn.",
                    "label": 0
                },
                {
                    "sent": "I mean you you, you predict what you should be, what you should get over here by applying the rules that you consider in historical data.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so that's more or less because I'm kind of running late, so that's kind of summarizing summarize the autocorrelations would look to coalition over historical data, and again, semantic is very important because all the data he is semantically encoded and you compute semantic similarity over the context.",
                    "label": 0
                },
                {
                    "sent": "And so that's due to correlations.",
                    "label": 0
                },
                {
                    "sent": "Domain imitation is the moisture equal data.",
                    "label": 0
                },
                {
                    "sent": "The more time consuming it is, because you compute a lot of time with similar, but you have similarity between different snapshots and the more complex data streams.",
                    "label": 1
                },
                {
                    "sent": "If you had much more expensive it in the representations, then you do.",
                    "label": 0
                },
                {
                    "sent": "The matching is even more expressive, and then that's less scalable for the approach and then four.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The reasoning on multiple streams, so that's why you're mentions you.",
                    "label": 1
                },
                {
                    "sent": "You learn words and you try to find some basic support and confidence overtime, and then you kind of.",
                    "label": 0
                },
                {
                    "sent": "You want these fools.",
                    "label": 0
                },
                {
                    "sent": "You want this words and your probably the most yeah the most.",
                    "label": 0
                },
                {
                    "sent": "Let's say the most efficient one based on the few scores that we have.",
                    "label": 0
                },
                {
                    "sent": "But The thing is, computing those words is exponential based on the number of facts you have here, so that's one of the book to neck and the and the words filtering.",
                    "label": 0
                },
                {
                    "sent": "So the whole thing is the bottleneck and we don't do cross temporal Association.",
                    "label": 1
                },
                {
                    "sent": "So let's say if you have the music events right now and the weather condition is, but maybe if you have.",
                    "label": 0
                },
                {
                    "sent": "Music events in five hours and maybe the weather will be not good in six hours.",
                    "label": 0
                },
                {
                    "sent": "We don't do this.",
                    "label": 0
                },
                {
                    "sent": "What Association?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's one mutations and then, so that's for the consistent predictions.",
                    "label": 0
                },
                {
                    "sent": "Then you get out.",
                    "label": 0
                },
                {
                    "sent": "You get some rules when coding schools and then you apply to the current state of the current time at the time where you plan to do to do other predictions, and then you get some Wizards and try to find if that consistent with the context at the end that discard a lot of food because many are not really or consistent.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's so.",
                    "label": 0
                },
                {
                    "sent": "That's the data we consider, so we do some conversion of the data in RDF, and again it's pretty fast, just like defining the mapping is not and you have vocabularies, we use those mini state of the art mappings, plus a few ones that we needed to extend or even come with like the scottson tragedies knows concentrate.",
                    "label": 0
                },
                {
                    "sent": "Their vocabulary is very simple with expressive and you can't really do that much reasoning.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so, in terms of experimentation are just quickly so security we getting we have definitely worse than state of the art techniques that don't use context.",
                    "label": 0
                },
                {
                    "sent": "I mean they, that's where until when you move the context.",
                    "label": 0
                },
                {
                    "sent": "The more data sources you get, the worst is our computations until they are purchased.",
                    "label": 0
                },
                {
                    "sent": "It's kind of spell much better.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With currency, so that's where the state of the art under that's where we get when we add much more context.",
                    "label": 0
                },
                {
                    "sent": "So I'm sorry if I'm spinning up a bit.",
                    "label": 0
                },
                {
                    "sent": "The expectation that you have any question producing, let me know.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the end I wanted to focus on the lesson learned we had from Dublin City, so definitely negative correlation between safety and accuracy.",
                    "label": 0
                },
                {
                    "sent": "We get better accurate results, but definitely because you had streams, you had a lot of overhead.",
                    "label": 0
                },
                {
                    "sent": "Security wise they also shows who we have some tricks for it for improving the scalability and then we do on the unit to do under fly discovery of appropriate context switch context with the best.",
                    "label": 1
                },
                {
                    "sent": "Still an open issue and how you discover popular calories.",
                    "label": 1
                },
                {
                    "sent": "And you need to spend some time for notating these data with a wide vocabulary, and which one is it?",
                    "label": 0
                },
                {
                    "sent": "I mean, that's that's that's not an easy one and you have the classic complexity explicitly traders.",
                    "label": 0
                },
                {
                    "sent": "So between the the way you were present in formations, and if that wasn't enough, your information that you can reason out of it and then stream data is noisy.",
                    "label": 1
                },
                {
                    "sent": "So we need a lot of filtering techniques for forecasting out order the noisy data and temporal reasoning is.",
                    "label": 0
                },
                {
                    "sent": "Not beyond or in our case, so it's very simple list of such notes.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so, in terms of accomplishments, that will be my last slide, so that's an IBM research asset.",
                    "label": 0
                },
                {
                    "sent": "It's part of.",
                    "label": 0
                },
                {
                    "sent": "It's part of the Star City or platform for dealing with traffic.",
                    "label": 1
                },
                {
                    "sent": "It's running live in the ring, so dieseling here.",
                    "label": 1
                },
                {
                    "sent": "If the server is not anymore on the maintenance, you can play with.",
                    "label": 0
                },
                {
                    "sent": "The tool is doing different things and.",
                    "label": 0
                },
                {
                    "sent": "And though it's power and we we so it's working with the in Dublin and we try to and we have some experimentation with with Bologna in Italy when U project with Miami for for doing another type of traffic related scenarios and in with you with some guys from from my PM over there and and all with different challenges and different level of success because they all have different changes so it's not.",
                    "label": 0
                },
                {
                    "sent": "I mean we apply for one city and then applying to different cities.",
                    "label": 1
                },
                {
                    "sent": "We come up with different challenges.",
                    "label": 0
                },
                {
                    "sent": "I want this copy because it's out of scope for this, but.",
                    "label": 0
                },
                {
                    "sent": "We did a few extra extra research on user challenges here, 'cause that's that's under my.",
                    "label": 0
                }
            ]
        }
    }
}