{
    "id": "nyzrbjbbp376bohxk6i3fbo3y562ugbr",
    "title": "Online Chinese Restaurant Process",
    "info": {
        "author": [
            "Chien-Liang Liu, Industrial Technology Research Institute (ITRI)"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_liu_chinese_restaurant/",
    "segmentation": [
        [
            "I'm not Chinese does Trump asset.",
            "This is a joint work with George in Thailand, job hungry and I'm generally I'm coming from industrial Technology Research Institute in Taiwan."
        ],
        [
            "OK, this is the owner of my presentation.",
            "First or I will start with the instructional departments.",
            "Next I will briefly introduce the unloading framework for linear classification because the the proposed method is an online learning algorithm.",
            "Next, I would tend to diluted process mixture models because the proposed method is the nonparametric model and then I will tend to the main topic of this presentation.",
            "I'm not Chinese.",
            "The Trump passes.",
            "Next, I will present the experimental results and any conclusions."
        ],
        [
            "OK, I would like to start from repeat data problems.",
            "Now we asked around it by your data.",
            "The data is coming from the computer and sensor network.",
            "Only mobile phones and how to efficiently process the big data is a concern to many people under the one they cut.",
            "Money customizes to device parallel algorithms to process the big data.",
            "Another popular one is to partition your data into pieces and then we can use debug conquer approach to speak.",
            "Up the Dell process.",
            "Another popular apologies to use online learning approaches and it has becoming one of the popular algorithms.",
            "Recently it has two important properties.",
            "First, you can process the data instance once and indicate that the memory consumption can be very efficient.",
            "This second properties that they, unlike any model, can be very simple and we argue that this property is very important in processing.",
            "Stream data or big data.",
            "This paper considers true issues to deny and nonparametric under learning algorithm.",
            "The first consideration is focused on efficiency.",
            "Obviously, efficiency is always an important issue in denying an online learning algorithm.",
            "This second issue is is that we try to tackle this problem from investing in parametric approaches because now the model complexity can be.",
            "That is true that there are instances and we.",
            "We also argue that this property is very important in big data and stream data."
        ],
        [
            "OK, now I would like to briefly introduce the online learning framework.",
            "As you can see from the speaker data instance comes through the Model 1 by 1.",
            "Then the model can make a petition.",
            "Whitehead, here, after the precipitation is met, the true cost information is available.",
            "So that is very important public in online learning with the predicted cost, labor and the true cost table.",
            "The model can calculate the loss.",
            "Such as they change those square roots or Latinos.",
            "And with the loss and the update rules, the model can update the parameters.",
            "From this figure you can see that two important properties of the online learning, the first one is that the true label information is available after prediction is Matt.",
            "Notice second parties that remodel can use the predicted class labels and the truth cast able to refile the predictive model so that they predicted model can be more accurate for this task sequence their instance in the future."
        ],
        [
            "OK, now I would like to move on to delete process miniature models digiday IT processes a distribution of probability measures, but here I'm not going to the detail with each data process.",
            "Instead I just focused on the plantations.",
            "Did you do?",
            "The process has two parameters.",
            "The first one is that the best major genome notice, second parameter, is the concentration parameter Alpha to explain the rich data process mixture models.",
            "I stuff finally final Mitchell models.",
            "I think there can be more easily to be understood.",
            "As you can see finally there hand side of the slide and the number of component is K which is the first number.",
            "So it means that the number of components is limited.",
            "And the pie here is the random variable for the mature weight of the component, and the eye is the indicator random variable with the DI in the state.",
            "Are they?",
            "Now we can simple data point is like with the specific distribution function F with the parameters set RDR.",
            "Here now let's move to the data process Mr models on the right hand side.",
            "You can see from this bigger the number of components become in finite, so that is the main difference between these two models.",
            "So now we have two.",
            "If they step breaking construction process to control the random variables.",
            "Hi here.",
            "The submission of the Pi J from J equals tried to infinite in finite should be one.",
            "If we integrate out the random variable pipe.",
            "Now we can get the Chinese restaurant process DRP."
        ],
        [
            "The metaphor of the CRPS, director and customers entered the restaurant and sit down at a table for the first customer.",
            "He will sit at the first table.",
            "As for the stuff secret customers, they can have two choices there.",
            "Further choices that they can choose sit at an occupied table with the probability proportional to MJ.",
            "Well, MJ is the number of people in terrible day, and they can also to choose to sit at the next unoccupied table with the probability proportional to Alpha.",
            "D figures Pearl.",
            "Just demonstrate the this process and you can see that the ERP has two important properties.",
            "First is that this ERP impulse custom property because you can see that it is proportional to MJ and the second property is that.",
            "Each customer had always has a positive probability to be assigned to a new table, and this is an unsupervised learning algorithm algorithm."
        ],
        [
            "OK, now I would like to introduce the proposed unless ERP.",
            "The ideas behind the proposed unless ERP are best only online learning properties.",
            "That is the true label is label is available after the prediction is met.",
            "So that compared to truly see RP in the previous slide.",
            "In unless ERP we allow the customer to move to the other table.",
            "So in this case.",
            "This third customer is assigned truth table to initially and he decided to move to table one so.",
            "In the online learning scenario, they predicted cost label is cost too and the truck has labeled it is class one.",
            "Besides that we have to use this information to refine our prediction model because the proposed method is the best thing nonparametric model indicating that we have to focus on employer distribution and likely function."
        ],
        [
            "OK, now I would like to stuff family pilot distribution.",
            "In this paper we keep track of the missing assignment of the previous I -- 1 there points those deployer information and we can use this part information to refine the model.",
            "Here we introduced two variables.",
            "The first one is abject and listicles eject.",
            "As you can see the update miss that.",
            "The true cost table is say, but the predicted cost is not.",
            "As for eject the predicate is there, but the true cost table is not intuitively a large value of essay indicates that the table probably assignment for the table.",
            "There should be increased.",
            "Conversely, the table assignment probability for TBJ, Subic decreased if the if the value of.",
            "Pizza is large.",
            "Besides that, we are also inspired by the question you proposed.",
            "Relaxing function list listed below will come along and gamma to our request."
        ],
        [
            "Besides the pilot distribution, we also have to update the class parameters.",
            "Go use the symbol flow chart to demonstrate the idea and well here the D is the predicted cost label for data aside for each prediction.",
            "We can have two conditions.",
            "The further condition is that the prediction is correct, so we just data points like joins 238.",
            "The second condition is that this prediction is incorrect, so we can further have two classes.",
            "The first character is focused on the.",
            "Later, the data as I browse to cost the is over estimated, why?",
            "Because the prediction is incorrect, so it is overestimated.",
            "In this case we pretend that suit their point as I plant joins true status here, we want to reduce the likelihood.",
            "So we use the - here and the second condition is that like a food for the class.",
            "Why is underestimated?",
            "So here we pretend that she got their point as I double prime George truth data.",
            "Why I?"
        ],
        [
            "OK, here in this paper we propose to give them give sampling algorithms to perform the posterior inference.",
            "In this state, the right hand side is the Quad core model only proposed unless ERP.",
            "But here I only focused on the Colossus seven point algorithm.",
            "In account contest we can integrate or birthday today, so now we can have only one londonberry above the here here.",
            "Here I present the conditional probability for DDI directory because I don't have time to explain.",
            "Everything under the definition of the list.",
            "Notations artist here and the proposed algorithm is very efficient because the prediction return competitive prediction is just order K&K.",
            "The barrier of K is very small.",
            "Go."
        ],
        [
            "We have conducted experiments on studio sets and one of their state is coming from Wikipedia which comprise about 2 million documents with 24 classes and the experimental settings are listed here."
        ],
        [
            "And this is the experimental results on 20 newsgroups.",
            "We have two settings on this experiment.",
            "The first setting is the online learning setting.",
            "In this, stating no training phrases used.",
            "We compared to the proposed online therapy with the algorithms implemented in label just listed here, which is open Source Java library for online learning.",
            "And as you can see from this figure, the proposed unlike pecan.",
            "Came out good parents between your alright and execution time exclusion is always very important in online learning and for some algorithm algorithms such as the OG D. It is very fast, but early early is high.",
            "As for complicated models such as The CW, the error is low.",
            "Battery execution times too long.",
            "The second setting is best returning.",
            "In this setting we allow the model to have a training phase.",
            "We compare the proposed unless the RP with the values of the perceptron algorithm and as you can see from this table we proposed.",
            "Unless the beacon outperformed the algorithms."
        ],
        [
            "This is a is for men to relax down RCB one and Wikipedia.",
            "These two massive datasets dirty algorithms implement enable cannot complete these permits.",
            "So here well, I only compare the proposed unless there be with just the perception.",
            "JCB one day offset.",
            "The last.",
            "Posted on our performance the proposed method, but exclusion ties to AL's fault Wikipedia.",
            "The estate realized ERP outperforms the last position posting error rate and execution time."
        ],
        [
            "OK, I this is the conclusion this this is the first walk through combined the basically nonparametric model with the unlearning and the benefits that now we can.",
            "We allow the model complexity to grow a small their instance, our boat and we think that this is a very very important property in processing big data upstream data and we also showed that the.",
            "The experimental relos indicated actually proposed method can work very well and efficiently.",
            "Massive datasets also for the future work we will work too.",
            "How is Paula Tori denim Becaused in traditional machine learning?",
            "We always assume that the trend out there.",
            "Comprise all of the classes.",
            "However, in some real applications we may have some.",
            "Robbins, for based on this assumption, such as the biosensing problem, sometimes we would like the learning algorithm can have the ability to detect new classes, even know this this cost.",
            "Is ever said the family trained outside OK?"
        ],
        [
            "This is my presentation."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not Chinese does Trump asset.",
                    "label": 0
                },
                {
                    "sent": "This is a joint work with George in Thailand, job hungry and I'm generally I'm coming from industrial Technology Research Institute in Taiwan.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, this is the owner of my presentation.",
                    "label": 0
                },
                {
                    "sent": "First or I will start with the instructional departments.",
                    "label": 0
                },
                {
                    "sent": "Next I will briefly introduce the unloading framework for linear classification because the the proposed method is an online learning algorithm.",
                    "label": 1
                },
                {
                    "sent": "Next, I would tend to diluted process mixture models because the proposed method is the nonparametric model and then I will tend to the main topic of this presentation.",
                    "label": 0
                },
                {
                    "sent": "I'm not Chinese.",
                    "label": 0
                },
                {
                    "sent": "The Trump passes.",
                    "label": 1
                },
                {
                    "sent": "Next, I will present the experimental results and any conclusions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, I would like to start from repeat data problems.",
                    "label": 0
                },
                {
                    "sent": "Now we asked around it by your data.",
                    "label": 0
                },
                {
                    "sent": "The data is coming from the computer and sensor network.",
                    "label": 1
                },
                {
                    "sent": "Only mobile phones and how to efficiently process the big data is a concern to many people under the one they cut.",
                    "label": 0
                },
                {
                    "sent": "Money customizes to device parallel algorithms to process the big data.",
                    "label": 1
                },
                {
                    "sent": "Another popular one is to partition your data into pieces and then we can use debug conquer approach to speak.",
                    "label": 0
                },
                {
                    "sent": "Up the Dell process.",
                    "label": 0
                },
                {
                    "sent": "Another popular apologies to use online learning approaches and it has becoming one of the popular algorithms.",
                    "label": 0
                },
                {
                    "sent": "Recently it has two important properties.",
                    "label": 0
                },
                {
                    "sent": "First, you can process the data instance once and indicate that the memory consumption can be very efficient.",
                    "label": 1
                },
                {
                    "sent": "This second properties that they, unlike any model, can be very simple and we argue that this property is very important in processing.",
                    "label": 0
                },
                {
                    "sent": "Stream data or big data.",
                    "label": 1
                },
                {
                    "sent": "This paper considers true issues to deny and nonparametric under learning algorithm.",
                    "label": 0
                },
                {
                    "sent": "The first consideration is focused on efficiency.",
                    "label": 0
                },
                {
                    "sent": "Obviously, efficiency is always an important issue in denying an online learning algorithm.",
                    "label": 0
                },
                {
                    "sent": "This second issue is is that we try to tackle this problem from investing in parametric approaches because now the model complexity can be.",
                    "label": 0
                },
                {
                    "sent": "That is true that there are instances and we.",
                    "label": 0
                },
                {
                    "sent": "We also argue that this property is very important in big data and stream data.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I would like to briefly introduce the online learning framework.",
                    "label": 0
                },
                {
                    "sent": "As you can see from the speaker data instance comes through the Model 1 by 1.",
                    "label": 0
                },
                {
                    "sent": "Then the model can make a petition.",
                    "label": 0
                },
                {
                    "sent": "Whitehead, here, after the precipitation is met, the true cost information is available.",
                    "label": 1
                },
                {
                    "sent": "So that is very important public in online learning with the predicted cost, labor and the true cost table.",
                    "label": 0
                },
                {
                    "sent": "The model can calculate the loss.",
                    "label": 0
                },
                {
                    "sent": "Such as they change those square roots or Latinos.",
                    "label": 0
                },
                {
                    "sent": "And with the loss and the update rules, the model can update the parameters.",
                    "label": 0
                },
                {
                    "sent": "From this figure you can see that two important properties of the online learning, the first one is that the true label information is available after prediction is Matt.",
                    "label": 1
                },
                {
                    "sent": "Notice second parties that remodel can use the predicted class labels and the truth cast able to refile the predictive model so that they predicted model can be more accurate for this task sequence their instance in the future.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I would like to move on to delete process miniature models digiday IT processes a distribution of probability measures, but here I'm not going to the detail with each data process.",
                    "label": 0
                },
                {
                    "sent": "Instead I just focused on the plantations.",
                    "label": 0
                },
                {
                    "sent": "Did you do?",
                    "label": 0
                },
                {
                    "sent": "The process has two parameters.",
                    "label": 0
                },
                {
                    "sent": "The first one is that the best major genome notice, second parameter, is the concentration parameter Alpha to explain the rich data process mixture models.",
                    "label": 1
                },
                {
                    "sent": "I stuff finally final Mitchell models.",
                    "label": 0
                },
                {
                    "sent": "I think there can be more easily to be understood.",
                    "label": 0
                },
                {
                    "sent": "As you can see finally there hand side of the slide and the number of component is K which is the first number.",
                    "label": 0
                },
                {
                    "sent": "So it means that the number of components is limited.",
                    "label": 0
                },
                {
                    "sent": "And the pie here is the random variable for the mature weight of the component, and the eye is the indicator random variable with the DI in the state.",
                    "label": 0
                },
                {
                    "sent": "Are they?",
                    "label": 0
                },
                {
                    "sent": "Now we can simple data point is like with the specific distribution function F with the parameters set RDR.",
                    "label": 0
                },
                {
                    "sent": "Here now let's move to the data process Mr models on the right hand side.",
                    "label": 0
                },
                {
                    "sent": "You can see from this bigger the number of components become in finite, so that is the main difference between these two models.",
                    "label": 0
                },
                {
                    "sent": "So now we have two.",
                    "label": 0
                },
                {
                    "sent": "If they step breaking construction process to control the random variables.",
                    "label": 0
                },
                {
                    "sent": "Hi here.",
                    "label": 0
                },
                {
                    "sent": "The submission of the Pi J from J equals tried to infinite in finite should be one.",
                    "label": 0
                },
                {
                    "sent": "If we integrate out the random variable pipe.",
                    "label": 1
                },
                {
                    "sent": "Now we can get the Chinese restaurant process DRP.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The metaphor of the CRPS, director and customers entered the restaurant and sit down at a table for the first customer.",
                    "label": 1
                },
                {
                    "sent": "He will sit at the first table.",
                    "label": 1
                },
                {
                    "sent": "As for the stuff secret customers, they can have two choices there.",
                    "label": 1
                },
                {
                    "sent": "Further choices that they can choose sit at an occupied table with the probability proportional to MJ.",
                    "label": 0
                },
                {
                    "sent": "Well, MJ is the number of people in terrible day, and they can also to choose to sit at the next unoccupied table with the probability proportional to Alpha.",
                    "label": 0
                },
                {
                    "sent": "D figures Pearl.",
                    "label": 0
                },
                {
                    "sent": "Just demonstrate the this process and you can see that the ERP has two important properties.",
                    "label": 0
                },
                {
                    "sent": "First is that this ERP impulse custom property because you can see that it is proportional to MJ and the second property is that.",
                    "label": 0
                },
                {
                    "sent": "Each customer had always has a positive probability to be assigned to a new table, and this is an unsupervised learning algorithm algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I would like to introduce the proposed unless ERP.",
                    "label": 0
                },
                {
                    "sent": "The ideas behind the proposed unless ERP are best only online learning properties.",
                    "label": 0
                },
                {
                    "sent": "That is the true label is label is available after the prediction is met.",
                    "label": 1
                },
                {
                    "sent": "So that compared to truly see RP in the previous slide.",
                    "label": 0
                },
                {
                    "sent": "In unless ERP we allow the customer to move to the other table.",
                    "label": 0
                },
                {
                    "sent": "So in this case.",
                    "label": 0
                },
                {
                    "sent": "This third customer is assigned truth table to initially and he decided to move to table one so.",
                    "label": 0
                },
                {
                    "sent": "In the online learning scenario, they predicted cost label is cost too and the truck has labeled it is class one.",
                    "label": 0
                },
                {
                    "sent": "Besides that we have to use this information to refine our prediction model because the proposed method is the best thing nonparametric model indicating that we have to focus on employer distribution and likely function.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I would like to stuff family pilot distribution.",
                    "label": 0
                },
                {
                    "sent": "In this paper we keep track of the missing assignment of the previous I -- 1 there points those deployer information and we can use this part information to refine the model.",
                    "label": 1
                },
                {
                    "sent": "Here we introduced two variables.",
                    "label": 0
                },
                {
                    "sent": "The first one is abject and listicles eject.",
                    "label": 0
                },
                {
                    "sent": "As you can see the update miss that.",
                    "label": 0
                },
                {
                    "sent": "The true cost table is say, but the predicted cost is not.",
                    "label": 0
                },
                {
                    "sent": "As for eject the predicate is there, but the true cost table is not intuitively a large value of essay indicates that the table probably assignment for the table.",
                    "label": 0
                },
                {
                    "sent": "There should be increased.",
                    "label": 0
                },
                {
                    "sent": "Conversely, the table assignment probability for TBJ, Subic decreased if the if the value of.",
                    "label": 0
                },
                {
                    "sent": "Pizza is large.",
                    "label": 1
                },
                {
                    "sent": "Besides that, we are also inspired by the question you proposed.",
                    "label": 0
                },
                {
                    "sent": "Relaxing function list listed below will come along and gamma to our request.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Besides the pilot distribution, we also have to update the class parameters.",
                    "label": 0
                },
                {
                    "sent": "Go use the symbol flow chart to demonstrate the idea and well here the D is the predicted cost label for data aside for each prediction.",
                    "label": 0
                },
                {
                    "sent": "We can have two conditions.",
                    "label": 0
                },
                {
                    "sent": "The further condition is that the prediction is correct, so we just data points like joins 238.",
                    "label": 0
                },
                {
                    "sent": "The second condition is that this prediction is incorrect, so we can further have two classes.",
                    "label": 0
                },
                {
                    "sent": "The first character is focused on the.",
                    "label": 1
                },
                {
                    "sent": "Later, the data as I browse to cost the is over estimated, why?",
                    "label": 0
                },
                {
                    "sent": "Because the prediction is incorrect, so it is overestimated.",
                    "label": 1
                },
                {
                    "sent": "In this case we pretend that suit their point as I plant joins true status here, we want to reduce the likelihood.",
                    "label": 0
                },
                {
                    "sent": "So we use the - here and the second condition is that like a food for the class.",
                    "label": 0
                },
                {
                    "sent": "Why is underestimated?",
                    "label": 0
                },
                {
                    "sent": "So here we pretend that she got their point as I double prime George truth data.",
                    "label": 0
                },
                {
                    "sent": "Why I?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, here in this paper we propose to give them give sampling algorithms to perform the posterior inference.",
                    "label": 1
                },
                {
                    "sent": "In this state, the right hand side is the Quad core model only proposed unless ERP.",
                    "label": 1
                },
                {
                    "sent": "But here I only focused on the Colossus seven point algorithm.",
                    "label": 1
                },
                {
                    "sent": "In account contest we can integrate or birthday today, so now we can have only one londonberry above the here here.",
                    "label": 1
                },
                {
                    "sent": "Here I present the conditional probability for DDI directory because I don't have time to explain.",
                    "label": 0
                },
                {
                    "sent": "Everything under the definition of the list.",
                    "label": 0
                },
                {
                    "sent": "Notations artist here and the proposed algorithm is very efficient because the prediction return competitive prediction is just order K&K.",
                    "label": 1
                },
                {
                    "sent": "The barrier of K is very small.",
                    "label": 0
                },
                {
                    "sent": "Go.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have conducted experiments on studio sets and one of their state is coming from Wikipedia which comprise about 2 million documents with 24 classes and the experimental settings are listed here.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is the experimental results on 20 newsgroups.",
                    "label": 1
                },
                {
                    "sent": "We have two settings on this experiment.",
                    "label": 0
                },
                {
                    "sent": "The first setting is the online learning setting.",
                    "label": 1
                },
                {
                    "sent": "In this, stating no training phrases used.",
                    "label": 0
                },
                {
                    "sent": "We compared to the proposed online therapy with the algorithms implemented in label just listed here, which is open Source Java library for online learning.",
                    "label": 0
                },
                {
                    "sent": "And as you can see from this figure, the proposed unlike pecan.",
                    "label": 0
                },
                {
                    "sent": "Came out good parents between your alright and execution time exclusion is always very important in online learning and for some algorithm algorithms such as the OG D. It is very fast, but early early is high.",
                    "label": 0
                },
                {
                    "sent": "As for complicated models such as The CW, the error is low.",
                    "label": 0
                },
                {
                    "sent": "Battery execution times too long.",
                    "label": 0
                },
                {
                    "sent": "The second setting is best returning.",
                    "label": 0
                },
                {
                    "sent": "In this setting we allow the model to have a training phase.",
                    "label": 0
                },
                {
                    "sent": "We compare the proposed unless the RP with the values of the perceptron algorithm and as you can see from this table we proposed.",
                    "label": 0
                },
                {
                    "sent": "Unless the beacon outperformed the algorithms.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is a is for men to relax down RCB one and Wikipedia.",
                    "label": 1
                },
                {
                    "sent": "These two massive datasets dirty algorithms implement enable cannot complete these permits.",
                    "label": 0
                },
                {
                    "sent": "So here well, I only compare the proposed unless there be with just the perception.",
                    "label": 0
                },
                {
                    "sent": "JCB one day offset.",
                    "label": 0
                },
                {
                    "sent": "The last.",
                    "label": 0
                },
                {
                    "sent": "Posted on our performance the proposed method, but exclusion ties to AL's fault Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "The estate realized ERP outperforms the last position posting error rate and execution time.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, I this is the conclusion this this is the first walk through combined the basically nonparametric model with the unlearning and the benefits that now we can.",
                    "label": 0
                },
                {
                    "sent": "We allow the model complexity to grow a small their instance, our boat and we think that this is a very very important property in processing big data upstream data and we also showed that the.",
                    "label": 0
                },
                {
                    "sent": "The experimental relos indicated actually proposed method can work very well and efficiently.",
                    "label": 1
                },
                {
                    "sent": "Massive datasets also for the future work we will work too.",
                    "label": 1
                },
                {
                    "sent": "How is Paula Tori denim Becaused in traditional machine learning?",
                    "label": 0
                },
                {
                    "sent": "We always assume that the trend out there.",
                    "label": 0
                },
                {
                    "sent": "Comprise all of the classes.",
                    "label": 0
                },
                {
                    "sent": "However, in some real applications we may have some.",
                    "label": 0
                },
                {
                    "sent": "Robbins, for based on this assumption, such as the biosensing problem, sometimes we would like the learning algorithm can have the ability to detect new classes, even know this this cost.",
                    "label": 0
                },
                {
                    "sent": "Is ever said the family trained outside OK?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is my presentation.",
                    "label": 0
                }
            ]
        }
    }
}