{
    "id": "o2xgjsgf5vp4427nadxmx6qwylrkzrst",
    "title": "Crossing Media Streams with Sentiment: Domain Adaptation in Blogs, Reviews and Twitter",
    "info": {
        "author": [
            "Yelena Mejova, Yahoo! Research Barcelona"
        ],
        "published": "July 6, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Social Media",
            "Top->Social Sciences->Society->Information Society"
        ]
    },
    "url": "http://videolectures.net/icwsm2012_mejova_twitter/",
    "segmentation": [
        [
            "Hello everyone and I'm Jillian image ova and I would like to tell you about some work I did at the University of Iowa with my advisor, doctor administer, New Boston and this is a very.",
            "Meat and potatoes kind of work where very heavy in machine learning, and so this is about the main adaptation in these three social media sources and specifically within the.",
            "Area of sentiment analysis.",
            "So of course when we think about social media, we think about many websites.",
            "There are many ways."
        ],
        [
            "Sharing data, video, audio, text and connecting to people.",
            "So when we analyze sentiment on social media, we really need to look at many sources.",
            "So even when we look at just chatter about this event, we already see several sources and I just copy pasted this yesterday and already these."
        ],
        [
            "These forums have have people expressing their opinions.",
            "So."
        ],
        [
            "There are two questions that we wanted to address in this project.",
            "The first is that.",
            "It's really asking whether sentiment on the topic differs in different social media sources, and this is actually not trivial because most of the research that's been done is only in one.",
            "In one source and then people claim that while in general social media, this is what happens, well it may not be the case for all of the various websites that you could look at.",
            "And also we want to look at the.",
            "Particular topics, so there are some projects that compare different sources of data, but they are not selecting them topically, so maybe they are comparing apples and oranges, and that's not quite proper either.",
            "So the second question is when we look at these different sources of data with whether what we can learn from one source is is useful for classifying data in another.",
            "So why it's just like in the?"
        ],
        [
            "The old tale of Blind men and an elephant.",
            "If we are really exploring only one part of the truth, then maybe we will really think it's something that we that is quite far from the truth so.",
            "So I want to show that different sources of social media are actually quite different in the way people express sentiment and we want to see how we can utilize this different information.",
            "So there are several."
        ],
        [
            "Contributions that this project makes.",
            "First of all, we make a data set that has multiple sources and multiple topics, and we compare sentiment that we find their positive negative mixed an neutral.",
            "And finally we have some cross source adaptation experiments looking at single sources and multiple sources.",
            "So let's start with the data and gathering.",
            "This data is actually."
        ],
        [
            "Can be a project in itself, it's quite difficult, so we're looking at three streams, Twitter logs and reviews.",
            "All of those have been used quite a bit in sentiment research, so we look at these, and of course, because we chose reviews, we have constraint on the kind of topics we want to look at so.",
            "Not every topic is present in reviews, so we choose mostly consumer products.",
            "So movies and music and computer games etc.",
            "So we go out and collect an initial set of topics.",
            "For example, a list of movies that IMDb and then we basically end up with lists of most popular topics and.",
            "And then we go and look for documents in these streams and we do not get enough documents.",
            "We throw out the topic and we forget too many.",
            "We sample it and thus we have a set of common topics that have that are represented in all of the three streams.",
            "So for reviews we just crawl."
        ],
        [
            "To review sites for Twitter, we use Twitter API to collect the most recent tweets on about these topics and for blogs we used Google Blog Search and then crawled these blogs and actually it's quite difficult to extract the.",
            "The content from blog posts, because it's actually quite messy, so we devised this tag density measure that tells us where HTML tags are not as common.",
            "So here are some statistics and."
        ],
        [
            "The easiest topic was our topical category was games.",
            "Everybody talked about computer games everywhere, so that was very nice.",
            "The most difficult one was music, because a lot of albums have very ambiguous titles, excuse me.",
            "So we had to throw away a lot of these.",
            "Then we and also blogs was the most limiting stream, so it was difficult to process difficult to search so we got fewer viewers documents from it and then when we were cleaning and sampling these streams we found a lot of duplication in the Twitter source.",
            "So each of these sources are peculiar and present their own difficulties.",
            "So the next step was labeling and for reviews.",
            "They are actually so popular because you can just take the star ratings and that's your sentiment class.",
            "But for Twitter and blogs that we had to go out and label these and we did this using Amazon Mechanical Turk which outsource."
        ],
        [
            "Is this task to basically anybody on the Internet?",
            "And of course you can't really trust just about anybody.",
            "Internet, as you might know, so we had to put in some quality controls such as putting in a very obvious question, so that if you get it wrong, it probably not paying attention.",
            "Another question that only a human being would understand very easily, but not a bot.",
            "So enter the first word of the last document or something.",
            "That way we can catch the bots.",
            "And then we took a majority vote out of several.",
            "So there were two.",
            "Changes to this labeling first pick ality whether these documents were relevant to the topic and 2nd sentiment, and we chose to let people say I don't know.",
            "Instead of forcing people to choose one of the classes because that would degrade the quality of the labels.",
            "So this is the kind of data we got, and this is a lot."
        ],
        [
            "So the reviews actually have no.",
            "No non topical.",
            "Documents, so it's a very nice clean stream and it was interesting to note that Twitter has very has about.",
            "Twitter is very topical, so about 95% of all documents that we got from it were topical, are great and we can use them, but with blogs only, about half of them we could use because it's such a noisy stream.",
            "So as I mentioned, most of our topics where popular, so people tend to like popular things and things that people like tend to be popular.",
            "So most of our."
        ],
        [
            "Our data was actually positive, so it was very heavy.",
            "On the positive side.",
            "We found that Twitter had many documents which actually did not express sentiment, so it was a bit surprising, but Twitter seems to be not only venue for expressing emotion, but also a venue for just sharing purely informational content.",
            "And between these we also found some.",
            "Some differences, so maybe some would have some stream would have more mixed sentiment than others, or even some topics would behave differently within these within these streams.",
            "So for example, here are three topics."
        ],
        [
            "And the first one is the King of limbs.",
            "Um?",
            "Album by Radiohead.",
            "I'm a big fan.",
            "That came out and you see that the share of.",
            "Emotion is quite different here, so for example, reviews have quite a bit of negative things to say, but Twitter has almost nothing and following we have this game, Littlebigplanet and it has a lot of negative reviews or a lot more and Twitter, whereas on the other venues people are mostly positive.",
            "Similar for prime rib.",
            "House of Prime Rib restaurant.",
            "Also, nobody said anything negative about it on Twitter, but so if you look at only one of these sources, you may be mistaken about what people say.",
            "In general, so this is a better look at what people may say.",
            "So we can actually look at a sentiment score.",
            "So basically difference between positive and negative sentiment and."
        ],
        [
            "See how different it is from from these streams and we see a really big difference, especially when we look at all the documents.",
            "But even when we consider just the documents having.",
            "Having subjective.",
            "Sentiments are yes, it has any subjectivity.",
            "This difference is still very large, so there are substantial differences between these streams.",
            "So, knowing this, we move on to trying to learn from one stream."
        ],
        [
            "And seeing how that affects the others, our knowledge about the others and we use the link link pipe logistic regression classifier.",
            "Ann is just a classifier that works quite well and we weren't really exploring which classifiers are best.",
            "This one worked fine, so we just used it and we had two tasks finding negative documents and finding positive documents and it's.",
            "We chose having two tasks instead of one that is kind of binary, just classification because we've assumed fewer things about the data, so it actually allows for documents to be mixed of both classes or having no sentiment at all.",
            "So there are.",
            "There are two scenarios to this, so first we could train on some source, train some model and then apply this model to the same kinds of documents from the same source and that would be our native scenario.",
            "So native model.",
            "Well, when we adapt a model, we train on one on one source and then apply to another to some foreign source.",
            "So that would be a foreign model so.",
            "Combining these two tasks, 5 topical categories, three sources, and three."
        ],
        [
            "Targets basically we had 90 experiments, so let's not squint of this and look too closely.",
            "Let me tell you what actually happened.",
            "So first of all, there are some native.",
            "Native experiment, so you trained on blogs and you classify blogs and then we looked at which ones were the best performing classifiers.",
            "And not only best, but also other classifiers which are statistically the same as best and some actually turned out to be better than the best the native.",
            "So first of all, native classifiers perform quite well.",
            "So if you train on Twitter and you classify Twitter, that turns out to be performing quite well.",
            "But when we look at at other need.",
            "At at other foreign classifiers we find that quite often they also performed very well and I think out of so we had 60 experiments where the classifier was foreign and 40.",
            "Three of those classifier performed as well as the native so.",
            "Actually, some foreign classifiers could outperform the native classifiers.",
            "So let's look at it in some other light, basically."
        ],
        [
            "Reviews where the best sources of data.",
            "Followed by Twitter and then followed by blogs.",
            "So it's kind of it's kind of nice that reviews are such a great source because they are easy to get.",
            "You don't need to label them, and the topicality is usually quite unambiguous.",
            "So if you're reviewing a camera, I'm pretty sure that the text is about the camera.",
            "But reviews are limited in their topical coverage so.",
            "If you're talking about political discourse, maybe reviews won't be as as interesting to you.",
            "That's why it was nice to see that Twitter was a close runner up for the best sources of data.",
            "So on Twitter you can of course see all kinds of topics, and that is a good place to get your data to train your classifiers.",
            "So we went a step further and tried to combine sources of data and we did this in two ways."
        ],
        [
            "First we looked at a mixed model.",
            "Basically would take some blogs, some tweets, some.",
            "Reviews and we train one big model and then apply it to some documents.",
            "So that's a mixed model.",
            "We also tried to voting model where we create several distinct models from different sources and they and then allow them to vote on what will be the class of the document.",
            "So basically we see that it is helpful basically to take all of these.",
            "All of this knowledge from different sources, put it together and."
        ],
        [
            "And the class of classification performance is very good, and in fact the two models were basically performing very similarly.",
            "So it doesn't matter where the whether you create several classifiers or only one, just putting together sources is beneficial.",
            "So so far we've been really looking at different models within the topic within the computer games, the."
        ],
        [
            "Top.",
            "Music etc.",
            "So we tried to just putting all of these topics together and building models just from the whole stream and we found that actually it's we get sometimes even more beneficial.",
            "A better classifier than the need of by far in some in some measurements.",
            "So for example.",
            "Put my classifying positive documents and blogs.",
            "Voting model significantly outperforms the native, so we find that it's both beneficial to combine the sources of data and the topics.",
            "We went again further and we were asking our."
        ],
        [
            "South, well, if we if combining topics is good then maybe can we just train on.",
            "Phones and or on games and then classify phones.",
            "So can we just jump from topic to topic?",
            "Well it turned out to be not the case.",
            "So if you do not have your topical data somewhere in the training set, you cannot really adapt very easily.",
            "So basically it's like you can't train oranges and classify apples.",
            "And Twitter was actually hit hit the most by this, so this kind of tells us that Twitter users when they talk about different topics that they use very different words basically.",
            "So we can't learn about conversation about about music and then judge about movies for example.",
            "So let me conclude.",
            "Well."
        ],
        [
            "Summarize what we've done here.",
            "First of all, we wanted to show that the sentiment between these social media sources is different and we did show this even these simple, simple topics.",
            "We found that people maybe complain more often in, for example, on Twitter, but not on reviews or the other way around.",
            "So people actually express their feelings differently in different social media.",
            "And this is actually.",
            "Rather.",
            "Banel example, if we do talk about, for example, grief like in a previous.",
            "Previous setting previous talk you probably see more grief shown in some venues, but not in others.",
            "And Secondly, we showed that it is possible to adapt to adapt models trained on one stream to another, and we find that reviews are the best.",
            "Then Twitter, then blogs, and finally we find that combining information is also beneficial.",
            "So from different sources etc.",
            "But I always have to say, and that's kind of the whole point of this talk is that you always have to qualify your findings.",
            "Will saying within the limits of this study.",
            "So let's see what limits there are first of all.",
            "We we don't know why exactly this happens.",
            "Do people really express their?"
        ],
        [
            "Feelings differently on different.",
            "On different sources?",
            "Or do we actually see different populations?",
            "Do grumpy people usually use Twitter or do happy people usually use reviews, etc.",
            "We want to look at language whether people really use different language when they talk about something on these social on these different streams.",
            "Furthermore, we're looking at consumer products such as there are many more very different topical categories that are that may have.",
            "For which there may be, it may be very different to train models and then adapt them.",
            "So for example, I have tried doing this for political topics and it did not work as well.",
            "So it's people talk about politics very differently.",
            "It looks like in different.",
            "Sources, but that's for another paper.",
            "Look out for it.",
            "And of course you can look at multimedia and see how that affects how people express themselves.",
            "Of course, looking at different selection of topics because these are really the popular topics and maybe if we look at more balanced datasets we will see something different.",
            "So thank you for coming."
        ],
        [
            "To this talk, and again, this was I would like to acknowledge the contribution of my advisor, but many senior boss and from the University of Iowa.",
            "And you know, if any of you are looking for an advisor, she's a pretty good one.",
            "Thank you returning to the question times, thank you.",
            "Do you think that you could actually improve the Twitter data by actually using the URLs are embedded in tweets so you can find out what the URL equals to and then figure out some sentimental ask so someone is linked to something that we could actually look at what you're linking to and then try and get sent from that document.",
            "No, we did not look at.",
            "You know, we didn't take the first step, but it would be interesting.",
            "For example, how the streams are connected via links.",
            "A quick question.",
            "Do you actually check that some of the effects that you observe when you combine data from multiple sources come from the fact that your training sets are now just bigger?",
            "In other words, you tend to have more documents than if you only have 1 one source of data.",
            "Actually, we did control for that.",
            "We limited this.",
            "Actually this was done several times to make sure that the sampling bias wouldn't introduce.",
            "Different results, so I think 10 times we would sample from different sources and have that as a training set to make sure that that's comparable to our native scenario.",
            "Very quickly could you have exploit the links from Twitter to the blogs or did you find sources where there was a lot of that and we could have exploited that?",
            "And where the Twitter may agree to the blog and disagree with the blog and that can give you good insights, well, I think it would be rather difficult to connect to because of the sparsity.",
            "You know, yes.",
            "Again, we didn't look too.",
            "You know, for the connection, but certainly it would be interesting to see if there's almost like a bias when people talk about the different different sources.",
            "Alright, thank you, Linda."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello everyone and I'm Jillian image ova and I would like to tell you about some work I did at the University of Iowa with my advisor, doctor administer, New Boston and this is a very.",
                    "label": 1
                },
                {
                    "sent": "Meat and potatoes kind of work where very heavy in machine learning, and so this is about the main adaptation in these three social media sources and specifically within the.",
                    "label": 0
                },
                {
                    "sent": "Area of sentiment analysis.",
                    "label": 0
                },
                {
                    "sent": "So of course when we think about social media, we think about many websites.",
                    "label": 0
                },
                {
                    "sent": "There are many ways.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sharing data, video, audio, text and connecting to people.",
                    "label": 0
                },
                {
                    "sent": "So when we analyze sentiment on social media, we really need to look at many sources.",
                    "label": 0
                },
                {
                    "sent": "So even when we look at just chatter about this event, we already see several sources and I just copy pasted this yesterday and already these.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These forums have have people expressing their opinions.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are two questions that we wanted to address in this project.",
                    "label": 0
                },
                {
                    "sent": "The first is that.",
                    "label": 0
                },
                {
                    "sent": "It's really asking whether sentiment on the topic differs in different social media sources, and this is actually not trivial because most of the research that's been done is only in one.",
                    "label": 1
                },
                {
                    "sent": "In one source and then people claim that while in general social media, this is what happens, well it may not be the case for all of the various websites that you could look at.",
                    "label": 0
                },
                {
                    "sent": "And also we want to look at the.",
                    "label": 0
                },
                {
                    "sent": "Particular topics, so there are some projects that compare different sources of data, but they are not selecting them topically, so maybe they are comparing apples and oranges, and that's not quite proper either.",
                    "label": 0
                },
                {
                    "sent": "So the second question is when we look at these different sources of data with whether what we can learn from one source is is useful for classifying data in another.",
                    "label": 0
                },
                {
                    "sent": "So why it's just like in the?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The old tale of Blind men and an elephant.",
                    "label": 0
                },
                {
                    "sent": "If we are really exploring only one part of the truth, then maybe we will really think it's something that we that is quite far from the truth so.",
                    "label": 0
                },
                {
                    "sent": "So I want to show that different sources of social media are actually quite different in the way people express sentiment and we want to see how we can utilize this different information.",
                    "label": 0
                },
                {
                    "sent": "So there are several.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Contributions that this project makes.",
                    "label": 0
                },
                {
                    "sent": "First of all, we make a data set that has multiple sources and multiple topics, and we compare sentiment that we find their positive negative mixed an neutral.",
                    "label": 0
                },
                {
                    "sent": "And finally we have some cross source adaptation experiments looking at single sources and multiple sources.",
                    "label": 1
                },
                {
                    "sent": "So let's start with the data and gathering.",
                    "label": 0
                },
                {
                    "sent": "This data is actually.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can be a project in itself, it's quite difficult, so we're looking at three streams, Twitter logs and reviews.",
                    "label": 0
                },
                {
                    "sent": "All of those have been used quite a bit in sentiment research, so we look at these, and of course, because we chose reviews, we have constraint on the kind of topics we want to look at so.",
                    "label": 0
                },
                {
                    "sent": "Not every topic is present in reviews, so we choose mostly consumer products.",
                    "label": 0
                },
                {
                    "sent": "So movies and music and computer games etc.",
                    "label": 0
                },
                {
                    "sent": "So we go out and collect an initial set of topics.",
                    "label": 0
                },
                {
                    "sent": "For example, a list of movies that IMDb and then we basically end up with lists of most popular topics and.",
                    "label": 0
                },
                {
                    "sent": "And then we go and look for documents in these streams and we do not get enough documents.",
                    "label": 0
                },
                {
                    "sent": "We throw out the topic and we forget too many.",
                    "label": 0
                },
                {
                    "sent": "We sample it and thus we have a set of common topics that have that are represented in all of the three streams.",
                    "label": 0
                },
                {
                    "sent": "So for reviews we just crawl.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To review sites for Twitter, we use Twitter API to collect the most recent tweets on about these topics and for blogs we used Google Blog Search and then crawled these blogs and actually it's quite difficult to extract the.",
                    "label": 0
                },
                {
                    "sent": "The content from blog posts, because it's actually quite messy, so we devised this tag density measure that tells us where HTML tags are not as common.",
                    "label": 0
                },
                {
                    "sent": "So here are some statistics and.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The easiest topic was our topical category was games.",
                    "label": 0
                },
                {
                    "sent": "Everybody talked about computer games everywhere, so that was very nice.",
                    "label": 0
                },
                {
                    "sent": "The most difficult one was music, because a lot of albums have very ambiguous titles, excuse me.",
                    "label": 0
                },
                {
                    "sent": "So we had to throw away a lot of these.",
                    "label": 0
                },
                {
                    "sent": "Then we and also blogs was the most limiting stream, so it was difficult to process difficult to search so we got fewer viewers documents from it and then when we were cleaning and sampling these streams we found a lot of duplication in the Twitter source.",
                    "label": 0
                },
                {
                    "sent": "So each of these sources are peculiar and present their own difficulties.",
                    "label": 0
                },
                {
                    "sent": "So the next step was labeling and for reviews.",
                    "label": 0
                },
                {
                    "sent": "They are actually so popular because you can just take the star ratings and that's your sentiment class.",
                    "label": 0
                },
                {
                    "sent": "But for Twitter and blogs that we had to go out and label these and we did this using Amazon Mechanical Turk which outsource.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is this task to basically anybody on the Internet?",
                    "label": 0
                },
                {
                    "sent": "And of course you can't really trust just about anybody.",
                    "label": 0
                },
                {
                    "sent": "Internet, as you might know, so we had to put in some quality controls such as putting in a very obvious question, so that if you get it wrong, it probably not paying attention.",
                    "label": 0
                },
                {
                    "sent": "Another question that only a human being would understand very easily, but not a bot.",
                    "label": 0
                },
                {
                    "sent": "So enter the first word of the last document or something.",
                    "label": 1
                },
                {
                    "sent": "That way we can catch the bots.",
                    "label": 1
                },
                {
                    "sent": "And then we took a majority vote out of several.",
                    "label": 0
                },
                {
                    "sent": "So there were two.",
                    "label": 0
                },
                {
                    "sent": "Changes to this labeling first pick ality whether these documents were relevant to the topic and 2nd sentiment, and we chose to let people say I don't know.",
                    "label": 0
                },
                {
                    "sent": "Instead of forcing people to choose one of the classes because that would degrade the quality of the labels.",
                    "label": 0
                },
                {
                    "sent": "So this is the kind of data we got, and this is a lot.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the reviews actually have no.",
                    "label": 0
                },
                {
                    "sent": "No non topical.",
                    "label": 0
                },
                {
                    "sent": "Documents, so it's a very nice clean stream and it was interesting to note that Twitter has very has about.",
                    "label": 0
                },
                {
                    "sent": "Twitter is very topical, so about 95% of all documents that we got from it were topical, are great and we can use them, but with blogs only, about half of them we could use because it's such a noisy stream.",
                    "label": 0
                },
                {
                    "sent": "So as I mentioned, most of our topics where popular, so people tend to like popular things and things that people like tend to be popular.",
                    "label": 0
                },
                {
                    "sent": "So most of our.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our data was actually positive, so it was very heavy.",
                    "label": 0
                },
                {
                    "sent": "On the positive side.",
                    "label": 0
                },
                {
                    "sent": "We found that Twitter had many documents which actually did not express sentiment, so it was a bit surprising, but Twitter seems to be not only venue for expressing emotion, but also a venue for just sharing purely informational content.",
                    "label": 0
                },
                {
                    "sent": "And between these we also found some.",
                    "label": 0
                },
                {
                    "sent": "Some differences, so maybe some would have some stream would have more mixed sentiment than others, or even some topics would behave differently within these within these streams.",
                    "label": 1
                },
                {
                    "sent": "So for example, here are three topics.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the first one is the King of limbs.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Album by Radiohead.",
                    "label": 0
                },
                {
                    "sent": "I'm a big fan.",
                    "label": 0
                },
                {
                    "sent": "That came out and you see that the share of.",
                    "label": 0
                },
                {
                    "sent": "Emotion is quite different here, so for example, reviews have quite a bit of negative things to say, but Twitter has almost nothing and following we have this game, Littlebigplanet and it has a lot of negative reviews or a lot more and Twitter, whereas on the other venues people are mostly positive.",
                    "label": 0
                },
                {
                    "sent": "Similar for prime rib.",
                    "label": 0
                },
                {
                    "sent": "House of Prime Rib restaurant.",
                    "label": 0
                },
                {
                    "sent": "Also, nobody said anything negative about it on Twitter, but so if you look at only one of these sources, you may be mistaken about what people say.",
                    "label": 0
                },
                {
                    "sent": "In general, so this is a better look at what people may say.",
                    "label": 0
                },
                {
                    "sent": "So we can actually look at a sentiment score.",
                    "label": 0
                },
                {
                    "sent": "So basically difference between positive and negative sentiment and.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "See how different it is from from these streams and we see a really big difference, especially when we look at all the documents.",
                    "label": 0
                },
                {
                    "sent": "But even when we consider just the documents having.",
                    "label": 0
                },
                {
                    "sent": "Having subjective.",
                    "label": 0
                },
                {
                    "sent": "Sentiments are yes, it has any subjectivity.",
                    "label": 0
                },
                {
                    "sent": "This difference is still very large, so there are substantial differences between these streams.",
                    "label": 1
                },
                {
                    "sent": "So, knowing this, we move on to trying to learn from one stream.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And seeing how that affects the others, our knowledge about the others and we use the link link pipe logistic regression classifier.",
                    "label": 1
                },
                {
                    "sent": "Ann is just a classifier that works quite well and we weren't really exploring which classifiers are best.",
                    "label": 0
                },
                {
                    "sent": "This one worked fine, so we just used it and we had two tasks finding negative documents and finding positive documents and it's.",
                    "label": 0
                },
                {
                    "sent": "We chose having two tasks instead of one that is kind of binary, just classification because we've assumed fewer things about the data, so it actually allows for documents to be mixed of both classes or having no sentiment at all.",
                    "label": 0
                },
                {
                    "sent": "So there are.",
                    "label": 0
                },
                {
                    "sent": "There are two scenarios to this, so first we could train on some source, train some model and then apply this model to the same kinds of documents from the same source and that would be our native scenario.",
                    "label": 0
                },
                {
                    "sent": "So native model.",
                    "label": 0
                },
                {
                    "sent": "Well, when we adapt a model, we train on one on one source and then apply to another to some foreign source.",
                    "label": 1
                },
                {
                    "sent": "So that would be a foreign model so.",
                    "label": 0
                },
                {
                    "sent": "Combining these two tasks, 5 topical categories, three sources, and three.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Targets basically we had 90 experiments, so let's not squint of this and look too closely.",
                    "label": 0
                },
                {
                    "sent": "Let me tell you what actually happened.",
                    "label": 0
                },
                {
                    "sent": "So first of all, there are some native.",
                    "label": 0
                },
                {
                    "sent": "Native experiment, so you trained on blogs and you classify blogs and then we looked at which ones were the best performing classifiers.",
                    "label": 0
                },
                {
                    "sent": "And not only best, but also other classifiers which are statistically the same as best and some actually turned out to be better than the best the native.",
                    "label": 1
                },
                {
                    "sent": "So first of all, native classifiers perform quite well.",
                    "label": 0
                },
                {
                    "sent": "So if you train on Twitter and you classify Twitter, that turns out to be performing quite well.",
                    "label": 0
                },
                {
                    "sent": "But when we look at at other need.",
                    "label": 0
                },
                {
                    "sent": "At at other foreign classifiers we find that quite often they also performed very well and I think out of so we had 60 experiments where the classifier was foreign and 40.",
                    "label": 1
                },
                {
                    "sent": "Three of those classifier performed as well as the native so.",
                    "label": 0
                },
                {
                    "sent": "Actually, some foreign classifiers could outperform the native classifiers.",
                    "label": 1
                },
                {
                    "sent": "So let's look at it in some other light, basically.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reviews where the best sources of data.",
                    "label": 0
                },
                {
                    "sent": "Followed by Twitter and then followed by blogs.",
                    "label": 0
                },
                {
                    "sent": "So it's kind of it's kind of nice that reviews are such a great source because they are easy to get.",
                    "label": 0
                },
                {
                    "sent": "You don't need to label them, and the topicality is usually quite unambiguous.",
                    "label": 0
                },
                {
                    "sent": "So if you're reviewing a camera, I'm pretty sure that the text is about the camera.",
                    "label": 0
                },
                {
                    "sent": "But reviews are limited in their topical coverage so.",
                    "label": 0
                },
                {
                    "sent": "If you're talking about political discourse, maybe reviews won't be as as interesting to you.",
                    "label": 0
                },
                {
                    "sent": "That's why it was nice to see that Twitter was a close runner up for the best sources of data.",
                    "label": 0
                },
                {
                    "sent": "So on Twitter you can of course see all kinds of topics, and that is a good place to get your data to train your classifiers.",
                    "label": 0
                },
                {
                    "sent": "So we went a step further and tried to combine sources of data and we did this in two ways.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First we looked at a mixed model.",
                    "label": 1
                },
                {
                    "sent": "Basically would take some blogs, some tweets, some.",
                    "label": 1
                },
                {
                    "sent": "Reviews and we train one big model and then apply it to some documents.",
                    "label": 0
                },
                {
                    "sent": "So that's a mixed model.",
                    "label": 1
                },
                {
                    "sent": "We also tried to voting model where we create several distinct models from different sources and they and then allow them to vote on what will be the class of the document.",
                    "label": 1
                },
                {
                    "sent": "So basically we see that it is helpful basically to take all of these.",
                    "label": 0
                },
                {
                    "sent": "All of this knowledge from different sources, put it together and.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the class of classification performance is very good, and in fact the two models were basically performing very similarly.",
                    "label": 0
                },
                {
                    "sent": "So it doesn't matter where the whether you create several classifiers or only one, just putting together sources is beneficial.",
                    "label": 0
                },
                {
                    "sent": "So so far we've been really looking at different models within the topic within the computer games, the.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Top.",
                    "label": 0
                },
                {
                    "sent": "Music etc.",
                    "label": 0
                },
                {
                    "sent": "So we tried to just putting all of these topics together and building models just from the whole stream and we found that actually it's we get sometimes even more beneficial.",
                    "label": 0
                },
                {
                    "sent": "A better classifier than the need of by far in some in some measurements.",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "Put my classifying positive documents and blogs.",
                    "label": 0
                },
                {
                    "sent": "Voting model significantly outperforms the native, so we find that it's both beneficial to combine the sources of data and the topics.",
                    "label": 0
                },
                {
                    "sent": "We went again further and we were asking our.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "South, well, if we if combining topics is good then maybe can we just train on.",
                    "label": 0
                },
                {
                    "sent": "Phones and or on games and then classify phones.",
                    "label": 0
                },
                {
                    "sent": "So can we just jump from topic to topic?",
                    "label": 0
                },
                {
                    "sent": "Well it turned out to be not the case.",
                    "label": 0
                },
                {
                    "sent": "So if you do not have your topical data somewhere in the training set, you cannot really adapt very easily.",
                    "label": 0
                },
                {
                    "sent": "So basically it's like you can't train oranges and classify apples.",
                    "label": 0
                },
                {
                    "sent": "And Twitter was actually hit hit the most by this, so this kind of tells us that Twitter users when they talk about different topics that they use very different words basically.",
                    "label": 1
                },
                {
                    "sent": "So we can't learn about conversation about about music and then judge about movies for example.",
                    "label": 0
                },
                {
                    "sent": "So let me conclude.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Summarize what we've done here.",
                    "label": 0
                },
                {
                    "sent": "First of all, we wanted to show that the sentiment between these social media sources is different and we did show this even these simple, simple topics.",
                    "label": 0
                },
                {
                    "sent": "We found that people maybe complain more often in, for example, on Twitter, but not on reviews or the other way around.",
                    "label": 0
                },
                {
                    "sent": "So people actually express their feelings differently in different social media.",
                    "label": 0
                },
                {
                    "sent": "And this is actually.",
                    "label": 0
                },
                {
                    "sent": "Rather.",
                    "label": 0
                },
                {
                    "sent": "Banel example, if we do talk about, for example, grief like in a previous.",
                    "label": 0
                },
                {
                    "sent": "Previous setting previous talk you probably see more grief shown in some venues, but not in others.",
                    "label": 0
                },
                {
                    "sent": "And Secondly, we showed that it is possible to adapt to adapt models trained on one stream to another, and we find that reviews are the best.",
                    "label": 0
                },
                {
                    "sent": "Then Twitter, then blogs, and finally we find that combining information is also beneficial.",
                    "label": 0
                },
                {
                    "sent": "So from different sources etc.",
                    "label": 0
                },
                {
                    "sent": "But I always have to say, and that's kind of the whole point of this talk is that you always have to qualify your findings.",
                    "label": 0
                },
                {
                    "sent": "Will saying within the limits of this study.",
                    "label": 1
                },
                {
                    "sent": "So let's see what limits there are first of all.",
                    "label": 0
                },
                {
                    "sent": "We we don't know why exactly this happens.",
                    "label": 0
                },
                {
                    "sent": "Do people really express their?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Feelings differently on different.",
                    "label": 0
                },
                {
                    "sent": "On different sources?",
                    "label": 0
                },
                {
                    "sent": "Or do we actually see different populations?",
                    "label": 0
                },
                {
                    "sent": "Do grumpy people usually use Twitter or do happy people usually use reviews, etc.",
                    "label": 0
                },
                {
                    "sent": "We want to look at language whether people really use different language when they talk about something on these social on these different streams.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, we're looking at consumer products such as there are many more very different topical categories that are that may have.",
                    "label": 1
                },
                {
                    "sent": "For which there may be, it may be very different to train models and then adapt them.",
                    "label": 0
                },
                {
                    "sent": "So for example, I have tried doing this for political topics and it did not work as well.",
                    "label": 0
                },
                {
                    "sent": "So it's people talk about politics very differently.",
                    "label": 0
                },
                {
                    "sent": "It looks like in different.",
                    "label": 0
                },
                {
                    "sent": "Sources, but that's for another paper.",
                    "label": 0
                },
                {
                    "sent": "Look out for it.",
                    "label": 0
                },
                {
                    "sent": "And of course you can look at multimedia and see how that affects how people express themselves.",
                    "label": 0
                },
                {
                    "sent": "Of course, looking at different selection of topics because these are really the popular topics and maybe if we look at more balanced datasets we will see something different.",
                    "label": 0
                },
                {
                    "sent": "So thank you for coming.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To this talk, and again, this was I would like to acknowledge the contribution of my advisor, but many senior boss and from the University of Iowa.",
                    "label": 1
                },
                {
                    "sent": "And you know, if any of you are looking for an advisor, she's a pretty good one.",
                    "label": 0
                },
                {
                    "sent": "Thank you returning to the question times, thank you.",
                    "label": 0
                },
                {
                    "sent": "Do you think that you could actually improve the Twitter data by actually using the URLs are embedded in tweets so you can find out what the URL equals to and then figure out some sentimental ask so someone is linked to something that we could actually look at what you're linking to and then try and get sent from that document.",
                    "label": 0
                },
                {
                    "sent": "No, we did not look at.",
                    "label": 0
                },
                {
                    "sent": "You know, we didn't take the first step, but it would be interesting.",
                    "label": 0
                },
                {
                    "sent": "For example, how the streams are connected via links.",
                    "label": 0
                },
                {
                    "sent": "A quick question.",
                    "label": 0
                },
                {
                    "sent": "Do you actually check that some of the effects that you observe when you combine data from multiple sources come from the fact that your training sets are now just bigger?",
                    "label": 0
                },
                {
                    "sent": "In other words, you tend to have more documents than if you only have 1 one source of data.",
                    "label": 0
                },
                {
                    "sent": "Actually, we did control for that.",
                    "label": 0
                },
                {
                    "sent": "We limited this.",
                    "label": 0
                },
                {
                    "sent": "Actually this was done several times to make sure that the sampling bias wouldn't introduce.",
                    "label": 0
                },
                {
                    "sent": "Different results, so I think 10 times we would sample from different sources and have that as a training set to make sure that that's comparable to our native scenario.",
                    "label": 0
                },
                {
                    "sent": "Very quickly could you have exploit the links from Twitter to the blogs or did you find sources where there was a lot of that and we could have exploited that?",
                    "label": 0
                },
                {
                    "sent": "And where the Twitter may agree to the blog and disagree with the blog and that can give you good insights, well, I think it would be rather difficult to connect to because of the sparsity.",
                    "label": 0
                },
                {
                    "sent": "You know, yes.",
                    "label": 0
                },
                {
                    "sent": "Again, we didn't look too.",
                    "label": 0
                },
                {
                    "sent": "You know, for the connection, but certainly it would be interesting to see if there's almost like a bias when people talk about the different different sources.",
                    "label": 0
                },
                {
                    "sent": "Alright, thank you, Linda.",
                    "label": 0
                }
            ]
        }
    }
}