{
    "id": "o47q23kv7arbzpxz3u4j246wojcbuj6x",
    "title": "Meeting Modelling",
    "info": {
        "author": [
            "Dennis Reidsma, Research Group Human Media Interaction (HMI), University of Twente"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "June 2004",
        "category": [
            "Top->Computer Science->Social Media"
        ]
    },
    "url": "http://videolectures.net/mlmi04ch_reidsma_mm/",
    "segmentation": [
        [
            "Take care of this.",
            "After ranks from 20 and one with his colleagues, there is going to tell us about model for meetings are sort of layered hierarchical model for structuring.",
            "Going on.",
            "Terry both."
        ],
        [
            "Al first introduced multimodal framework that we set up quite abstract favor, which researchers are.",
            "We think it's very important.",
            "It's already mentioned couple of times so far working on the browser.",
            "Machine learning techniques to classify.",
            "Whatever things they want to Best Buy, but well.",
            "Interest of the user we are.",
            "There's a question that is still not been answered.",
            "That is what we want to address you, Anne.",
            "David Kramer specific?",
            "Affordability model framer but we need better we start?"
        ],
        [
            "Call research goals project in general.",
            "Insights into human human interaction.",
            "Since we are dealing with.",
            "So we need this questions on human behavior.",
            "These questions might come from various users dealing with various interests.",
            "Maybe emotions has already mentioned or machine learning techniques whatever."
        ],
        [
            "I wish we can apply these questions.",
            "And then in most cases is a porpoise.",
            "Bases with annotations.",
            "Even with the multimodal framework, the data usually comes from several sensors, sources, audio, video heartbeats.",
            "Add the date of this.",
            "To enable the answering all these questions to be representative and there should be enough data to do the relevant research in order to answer the questions.",
            "Important aspect.",
            "And now I'm going to relay these two boxes, 'cause there's so much is missing.",
            "Choose them.",
            "So the previous.",
            "Browser that actually enables the visualization of the data.",
            "Access to the data in order to manipulate it or whatever.",
            "This can be seen as a tool that might help answering the research questions from the researcher in general.",
            "For instance, replay or summarize data making browsable.",
            "So we need tools."
        ],
        [
            "Now we want to.",
            "Through this data.",
            "For the tools to make the data accessible.",
            "And we can use two things.",
            "First place there's a need for models and theories of human interaction to structure the representations.",
            "This might sound quite complex in the most easy case, you can just see it as a set of labels for testifying your data.",
            "For instance, emotions that you want to use for your tools.",
            "If you want to look at that, how happy people are whatsoever, you can just make yourself two labels happy, not happy.",
            "And then that will be your model of order.",
            "Siri, where you working with.",
            "OK, and then you want to fit the data.",
            "In terms of the model, so you meant the data by labeling it according to your theory or you more.",
            "You can do that using layer annotations, since, well, that's the way to go as we think."
        ],
        [
            "Station bar.",
            "Two basic groups through the same groups.",
            "One of them is the objective event annotation or the perceptual annotation as mentioned by by Simon in Frisco Keziah.",
            "Deal with it with words or posters or whatever is directly observable in the data and therefore various machine learning techniques can be applied, for instance.",
            "And then there's the semantic interpretation of the lower level annotations that is second level, and this is more or less dealing with the function of the events.",
            "How do we see it as humans that we perceive it?",
            "Event.",
            "More or less dealing with form."
        ],
        [
            "Well, this resulting framework enables the positioning for all workers, building, model interaction, incretin.",
            "Can also be applied to empirical research.",
            "Do real time.",
            "Research as well, since we can.",
            "Removed.",
            "Just put the box containing data there.",
            "Then we still have the same usable framework.",
            "So this framework can be used to simplify the integration of the results and from research everywhere in the world.",
            "Interface.",
            "Also, probably the most important thing specific domain, and I will now show how it can be tailored to the meeting."
        ],
        [
            "Alright, so let's focus on.",
            "And their conversations.",
            "On the right side you see the annotation formats that are actually.",
            "Interaction on the left side.",
            "Objective events conservative defense.",
            "That's gonna also be regarded in this respect as the Inter dependent annotation format, relations square, African out, but.",
            "Since the overlayer can be derived from the lower level annotations, there is an interdependency between those layers."
        ],
        [
            "Moving back to them now.",
            "Here we see the recognized features that are directly observable in the data.",
            "We have first gestures, postures, numbers, etc.",
            "Directly from the corpus.",
            "And in terms of combined events.",
            "Well then we might come back to the question.",
            "Observations of interest from the user.",
            "While we have made distinctions of 6.",
            "Aspects that might be relevant to do or to answer the research questions as mentioned in the framework."
        ],
        [
            "Please.",
            "Two layers.",
            "Three distinct groups plantations have three distinct groups for lower level allocations that are still in the purple box.",
            "Directly.",
            "Exposing keyword spotting or their technique might be applied for from ASR.",
            "And Mom coming back.",
            "And again.",
            "Bruce models.",
            "Ford access then the labels.",
            "Glance, which were done solely power without hesitation.",
            "Scheme to label the data and classify it accordingly."
        ],
        [
            "Free.",
            "Communicate X and tasks and talked are closely related to edit them together.",
            "So we can derive these three boxes from the recognized features."
        ],
        [
            "By using several.",
            "And now we can.",
            "One more level.",
            "Will be important argument this state or the discourse state meeting or might be interested in that the emotional state of the meeting.",
            "The opinions of people about other people during the meeting and also the physical state.",
            "The positioning of the participants in the tables and all relevant projects.",
            "I think that's enough.",
            "Salera"
        ],
        [
            "Read more books and now back to the interdependency of these annotation layers.",
            "Documented state according to our opinions can be derived from both the Dawson topic walks past, communicate acts.",
            "And the emotional or interpersonal, say can be derived from communication access and non communicating.",
            "Next distinction between the communications X and not communicate with taxes that as Clark compliance it, there should be a communicate intent.",
            "That is, whether is communicating then then can be seen as communication next.",
            "So at the highest level."
        ],
        [
            "There's one more left like full level, and then we got segmentation of a meeting to meeting activities.",
            "That is to be derived from all the lower levels according to our thoughts, and there are two ways of deriving these components.",
            "One of them is fixed concept segment.",
            "We know that the meeting.",
            "Campaign presentation and discussion or whatsoever so we can just label it.",
            "In segments that we think are appropriate.",
            "Vinyl derive the segments obtained from steffel models or or.",
            "Machine learning techniques based on the occurrences of specific lower level components.",
            "So when we see that there's a whole debate going on and there's a storm and discourse structure, whatever we might be able to cosmetically cluster death and then label it as a discussion.",
            "By putting the discussion in the model besides the annotations itself."
        ],
        [
            "Meeting"
        ],
        [
            "So what we did was we created the global framework performance based human human interaction research.",
            "And all of the work in the field that need positions within this framework.",
            "Under that framework, willstatter price.",
            "Preston.",
            "So thank you for for them all, but going a bit beyond the boxes.",
            "What are the hopes of actually finding reasonable back sets and performing the recognition task at reasonable levels of performance for the various groups that have distinguished question?",
            "So the WB one.",
            "Read out in the Hobby project they are strongly debating the possible taxes that they think are applicable.",
            "We are also involved in those discussions, but well, there are some ideas about access, possibly to use for dialogue act annotation should we use.",
            "Lower the faucet from bales there both satisfied yet there.",
            "I can't tell.",
            "So if I may.",
            "Actually, then, what makes you think that all the work in the field can be invited in these boxes?",
            "You don't know yet?",
            "For instance, that accents.",
            "Well, it does not provide the actual taxes itself themselves, but it does enable that positioning of the work in a way that when you're dealing with access dealing with a specific box in the complete framework.",
            "Paris.",
            "Can we use discussion about Molly reduce or what should be there?",
            "Then observations of interest or whatever?",
            "The question what is the motivation of interest?",
            "This is dependent on your on your user group or all the questions you want to answer.",
            "Boxes in the talk, or so.",
            "I wonder how many of these are already implemented, or because that wasn't quite clear from your talk.",
            "Like which of these boxes turned out into subsystems already.",
            "University recurrently working on annotation tools itself.",
            "The data, but we have not.",
            "Been able to implement annual fees.",
            "We just stopped at work and we wanted the theoretical framework in which we could spin off that.",
            "For years, actually.",
            "Let's take one more question.",
            "You seem to have a huge organizational task in getting an experts who know about all the different things that you're talking about.",
            "How are you tackling that?",
            "Well, we tried to put it all together in the paper that we've written, so you can read it in there.",
            "But I think at least we tried that.",
            "I think that we tried to make a clear distinction about all the aspects that are going on in the field, and we've related them to each other.",
            "And that was our main aim so.",
            "I hope that every researcher in this in this room is also able to position his where in field.",
            "I don't think there's that much.",
            "In the way that I want you're dealing with.",
            "Hopefully also working on lower level recognition or.",
            "Down.",
            "Questions for everybody in this room.",
            "I think it's really our business.",
            "As this meeting continues on into the working groups which followed this page to try to address some of the questions that we're hearing now.",
            "So thanks for taking your first order."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Take care of this.",
                    "label": 0
                },
                {
                    "sent": "After ranks from 20 and one with his colleagues, there is going to tell us about model for meetings are sort of layered hierarchical model for structuring.",
                    "label": 0
                },
                {
                    "sent": "Going on.",
                    "label": 0
                },
                {
                    "sent": "Terry both.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Al first introduced multimodal framework that we set up quite abstract favor, which researchers are.",
                    "label": 1
                },
                {
                    "sent": "We think it's very important.",
                    "label": 0
                },
                {
                    "sent": "It's already mentioned couple of times so far working on the browser.",
                    "label": 0
                },
                {
                    "sent": "Machine learning techniques to classify.",
                    "label": 0
                },
                {
                    "sent": "Whatever things they want to Best Buy, but well.",
                    "label": 0
                },
                {
                    "sent": "Interest of the user we are.",
                    "label": 0
                },
                {
                    "sent": "There's a question that is still not been answered.",
                    "label": 0
                },
                {
                    "sent": "That is what we want to address you, Anne.",
                    "label": 0
                },
                {
                    "sent": "David Kramer specific?",
                    "label": 0
                },
                {
                    "sent": "Affordability model framer but we need better we start?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Call research goals project in general.",
                    "label": 1
                },
                {
                    "sent": "Insights into human human interaction.",
                    "label": 0
                },
                {
                    "sent": "Since we are dealing with.",
                    "label": 0
                },
                {
                    "sent": "So we need this questions on human behavior.",
                    "label": 1
                },
                {
                    "sent": "These questions might come from various users dealing with various interests.",
                    "label": 0
                },
                {
                    "sent": "Maybe emotions has already mentioned or machine learning techniques whatever.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wish we can apply these questions.",
                    "label": 0
                },
                {
                    "sent": "And then in most cases is a porpoise.",
                    "label": 1
                },
                {
                    "sent": "Bases with annotations.",
                    "label": 0
                },
                {
                    "sent": "Even with the multimodal framework, the data usually comes from several sensors, sources, audio, video heartbeats.",
                    "label": 1
                },
                {
                    "sent": "Add the date of this.",
                    "label": 1
                },
                {
                    "sent": "To enable the answering all these questions to be representative and there should be enough data to do the relevant research in order to answer the questions.",
                    "label": 0
                },
                {
                    "sent": "Important aspect.",
                    "label": 0
                },
                {
                    "sent": "And now I'm going to relay these two boxes, 'cause there's so much is missing.",
                    "label": 1
                },
                {
                    "sent": "Choose them.",
                    "label": 1
                },
                {
                    "sent": "So the previous.",
                    "label": 0
                },
                {
                    "sent": "Browser that actually enables the visualization of the data.",
                    "label": 0
                },
                {
                    "sent": "Access to the data in order to manipulate it or whatever.",
                    "label": 0
                },
                {
                    "sent": "This can be seen as a tool that might help answering the research questions from the researcher in general.",
                    "label": 1
                },
                {
                    "sent": "For instance, replay or summarize data making browsable.",
                    "label": 0
                },
                {
                    "sent": "So we need tools.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we want to.",
                    "label": 0
                },
                {
                    "sent": "Through this data.",
                    "label": 0
                },
                {
                    "sent": "For the tools to make the data accessible.",
                    "label": 0
                },
                {
                    "sent": "And we can use two things.",
                    "label": 0
                },
                {
                    "sent": "First place there's a need for models and theories of human interaction to structure the representations.",
                    "label": 1
                },
                {
                    "sent": "This might sound quite complex in the most easy case, you can just see it as a set of labels for testifying your data.",
                    "label": 0
                },
                {
                    "sent": "For instance, emotions that you want to use for your tools.",
                    "label": 0
                },
                {
                    "sent": "If you want to look at that, how happy people are whatsoever, you can just make yourself two labels happy, not happy.",
                    "label": 0
                },
                {
                    "sent": "And then that will be your model of order.",
                    "label": 0
                },
                {
                    "sent": "Siri, where you working with.",
                    "label": 0
                },
                {
                    "sent": "OK, and then you want to fit the data.",
                    "label": 1
                },
                {
                    "sent": "In terms of the model, so you meant the data by labeling it according to your theory or you more.",
                    "label": 0
                },
                {
                    "sent": "You can do that using layer annotations, since, well, that's the way to go as we think.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Station bar.",
                    "label": 0
                },
                {
                    "sent": "Two basic groups through the same groups.",
                    "label": 0
                },
                {
                    "sent": "One of them is the objective event annotation or the perceptual annotation as mentioned by by Simon in Frisco Keziah.",
                    "label": 1
                },
                {
                    "sent": "Deal with it with words or posters or whatever is directly observable in the data and therefore various machine learning techniques can be applied, for instance.",
                    "label": 1
                },
                {
                    "sent": "And then there's the semantic interpretation of the lower level annotations that is second level, and this is more or less dealing with the function of the events.",
                    "label": 1
                },
                {
                    "sent": "How do we see it as humans that we perceive it?",
                    "label": 0
                },
                {
                    "sent": "Event.",
                    "label": 0
                },
                {
                    "sent": "More or less dealing with form.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, this resulting framework enables the positioning for all workers, building, model interaction, incretin.",
                    "label": 1
                },
                {
                    "sent": "Can also be applied to empirical research.",
                    "label": 0
                },
                {
                    "sent": "Do real time.",
                    "label": 0
                },
                {
                    "sent": "Research as well, since we can.",
                    "label": 0
                },
                {
                    "sent": "Removed.",
                    "label": 0
                },
                {
                    "sent": "Just put the box containing data there.",
                    "label": 0
                },
                {
                    "sent": "Then we still have the same usable framework.",
                    "label": 0
                },
                {
                    "sent": "So this framework can be used to simplify the integration of the results and from research everywhere in the world.",
                    "label": 1
                },
                {
                    "sent": "Interface.",
                    "label": 1
                },
                {
                    "sent": "Also, probably the most important thing specific domain, and I will now show how it can be tailored to the meeting.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so let's focus on.",
                    "label": 0
                },
                {
                    "sent": "And their conversations.",
                    "label": 0
                },
                {
                    "sent": "On the right side you see the annotation formats that are actually.",
                    "label": 1
                },
                {
                    "sent": "Interaction on the left side.",
                    "label": 0
                },
                {
                    "sent": "Objective events conservative defense.",
                    "label": 0
                },
                {
                    "sent": "That's gonna also be regarded in this respect as the Inter dependent annotation format, relations square, African out, but.",
                    "label": 0
                },
                {
                    "sent": "Since the overlayer can be derived from the lower level annotations, there is an interdependency between those layers.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Moving back to them now.",
                    "label": 0
                },
                {
                    "sent": "Here we see the recognized features that are directly observable in the data.",
                    "label": 0
                },
                {
                    "sent": "We have first gestures, postures, numbers, etc.",
                    "label": 0
                },
                {
                    "sent": "Directly from the corpus.",
                    "label": 0
                },
                {
                    "sent": "And in terms of combined events.",
                    "label": 0
                },
                {
                    "sent": "Well then we might come back to the question.",
                    "label": 0
                },
                {
                    "sent": "Observations of interest from the user.",
                    "label": 0
                },
                {
                    "sent": "While we have made distinctions of 6.",
                    "label": 0
                },
                {
                    "sent": "Aspects that might be relevant to do or to answer the research questions as mentioned in the framework.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Please.",
                    "label": 0
                },
                {
                    "sent": "Two layers.",
                    "label": 0
                },
                {
                    "sent": "Three distinct groups plantations have three distinct groups for lower level allocations that are still in the purple box.",
                    "label": 0
                },
                {
                    "sent": "Directly.",
                    "label": 0
                },
                {
                    "sent": "Exposing keyword spotting or their technique might be applied for from ASR.",
                    "label": 0
                },
                {
                    "sent": "And Mom coming back.",
                    "label": 0
                },
                {
                    "sent": "And again.",
                    "label": 0
                },
                {
                    "sent": "Bruce models.",
                    "label": 0
                },
                {
                    "sent": "Ford access then the labels.",
                    "label": 0
                },
                {
                    "sent": "Glance, which were done solely power without hesitation.",
                    "label": 0
                },
                {
                    "sent": "Scheme to label the data and classify it accordingly.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Free.",
                    "label": 0
                },
                {
                    "sent": "Communicate X and tasks and talked are closely related to edit them together.",
                    "label": 0
                },
                {
                    "sent": "So we can derive these three boxes from the recognized features.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By using several.",
                    "label": 0
                },
                {
                    "sent": "And now we can.",
                    "label": 0
                },
                {
                    "sent": "One more level.",
                    "label": 0
                },
                {
                    "sent": "Will be important argument this state or the discourse state meeting or might be interested in that the emotional state of the meeting.",
                    "label": 1
                },
                {
                    "sent": "The opinions of people about other people during the meeting and also the physical state.",
                    "label": 0
                },
                {
                    "sent": "The positioning of the participants in the tables and all relevant projects.",
                    "label": 0
                },
                {
                    "sent": "I think that's enough.",
                    "label": 0
                },
                {
                    "sent": "Salera",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Read more books and now back to the interdependency of these annotation layers.",
                    "label": 1
                },
                {
                    "sent": "Documented state according to our opinions can be derived from both the Dawson topic walks past, communicate acts.",
                    "label": 1
                },
                {
                    "sent": "And the emotional or interpersonal, say can be derived from communication access and non communicating.",
                    "label": 1
                },
                {
                    "sent": "Next distinction between the communications X and not communicate with taxes that as Clark compliance it, there should be a communicate intent.",
                    "label": 1
                },
                {
                    "sent": "That is, whether is communicating then then can be seen as communication next.",
                    "label": 0
                },
                {
                    "sent": "So at the highest level.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's one more left like full level, and then we got segmentation of a meeting to meeting activities.",
                    "label": 0
                },
                {
                    "sent": "That is to be derived from all the lower levels according to our thoughts, and there are two ways of deriving these components.",
                    "label": 1
                },
                {
                    "sent": "One of them is fixed concept segment.",
                    "label": 1
                },
                {
                    "sent": "We know that the meeting.",
                    "label": 0
                },
                {
                    "sent": "Campaign presentation and discussion or whatsoever so we can just label it.",
                    "label": 0
                },
                {
                    "sent": "In segments that we think are appropriate.",
                    "label": 1
                },
                {
                    "sent": "Vinyl derive the segments obtained from steffel models or or.",
                    "label": 1
                },
                {
                    "sent": "Machine learning techniques based on the occurrences of specific lower level components.",
                    "label": 0
                },
                {
                    "sent": "So when we see that there's a whole debate going on and there's a storm and discourse structure, whatever we might be able to cosmetically cluster death and then label it as a discussion.",
                    "label": 0
                },
                {
                    "sent": "By putting the discussion in the model besides the annotations itself.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Meeting",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we did was we created the global framework performance based human human interaction research.",
                    "label": 1
                },
                {
                    "sent": "And all of the work in the field that need positions within this framework.",
                    "label": 1
                },
                {
                    "sent": "Under that framework, willstatter price.",
                    "label": 0
                },
                {
                    "sent": "Preston.",
                    "label": 0
                },
                {
                    "sent": "So thank you for for them all, but going a bit beyond the boxes.",
                    "label": 0
                },
                {
                    "sent": "What are the hopes of actually finding reasonable back sets and performing the recognition task at reasonable levels of performance for the various groups that have distinguished question?",
                    "label": 0
                },
                {
                    "sent": "So the WB one.",
                    "label": 0
                },
                {
                    "sent": "Read out in the Hobby project they are strongly debating the possible taxes that they think are applicable.",
                    "label": 0
                },
                {
                    "sent": "We are also involved in those discussions, but well, there are some ideas about access, possibly to use for dialogue act annotation should we use.",
                    "label": 0
                },
                {
                    "sent": "Lower the faucet from bales there both satisfied yet there.",
                    "label": 0
                },
                {
                    "sent": "I can't tell.",
                    "label": 0
                },
                {
                    "sent": "So if I may.",
                    "label": 0
                },
                {
                    "sent": "Actually, then, what makes you think that all the work in the field can be invited in these boxes?",
                    "label": 1
                },
                {
                    "sent": "You don't know yet?",
                    "label": 0
                },
                {
                    "sent": "For instance, that accents.",
                    "label": 0
                },
                {
                    "sent": "Well, it does not provide the actual taxes itself themselves, but it does enable that positioning of the work in a way that when you're dealing with access dealing with a specific box in the complete framework.",
                    "label": 0
                },
                {
                    "sent": "Paris.",
                    "label": 0
                },
                {
                    "sent": "Can we use discussion about Molly reduce or what should be there?",
                    "label": 0
                },
                {
                    "sent": "Then observations of interest or whatever?",
                    "label": 0
                },
                {
                    "sent": "The question what is the motivation of interest?",
                    "label": 0
                },
                {
                    "sent": "This is dependent on your on your user group or all the questions you want to answer.",
                    "label": 0
                },
                {
                    "sent": "Boxes in the talk, or so.",
                    "label": 0
                },
                {
                    "sent": "I wonder how many of these are already implemented, or because that wasn't quite clear from your talk.",
                    "label": 0
                },
                {
                    "sent": "Like which of these boxes turned out into subsystems already.",
                    "label": 1
                },
                {
                    "sent": "University recurrently working on annotation tools itself.",
                    "label": 0
                },
                {
                    "sent": "The data, but we have not.",
                    "label": 0
                },
                {
                    "sent": "Been able to implement annual fees.",
                    "label": 0
                },
                {
                    "sent": "We just stopped at work and we wanted the theoretical framework in which we could spin off that.",
                    "label": 0
                },
                {
                    "sent": "For years, actually.",
                    "label": 0
                },
                {
                    "sent": "Let's take one more question.",
                    "label": 0
                },
                {
                    "sent": "You seem to have a huge organizational task in getting an experts who know about all the different things that you're talking about.",
                    "label": 0
                },
                {
                    "sent": "How are you tackling that?",
                    "label": 0
                },
                {
                    "sent": "Well, we tried to put it all together in the paper that we've written, so you can read it in there.",
                    "label": 0
                },
                {
                    "sent": "But I think at least we tried that.",
                    "label": 0
                },
                {
                    "sent": "I think that we tried to make a clear distinction about all the aspects that are going on in the field, and we've related them to each other.",
                    "label": 0
                },
                {
                    "sent": "And that was our main aim so.",
                    "label": 0
                },
                {
                    "sent": "I hope that every researcher in this in this room is also able to position his where in field.",
                    "label": 0
                },
                {
                    "sent": "I don't think there's that much.",
                    "label": 0
                },
                {
                    "sent": "In the way that I want you're dealing with.",
                    "label": 1
                },
                {
                    "sent": "Hopefully also working on lower level recognition or.",
                    "label": 0
                },
                {
                    "sent": "Down.",
                    "label": 0
                },
                {
                    "sent": "Questions for everybody in this room.",
                    "label": 0
                },
                {
                    "sent": "I think it's really our business.",
                    "label": 0
                },
                {
                    "sent": "As this meeting continues on into the working groups which followed this page to try to address some of the questions that we're hearing now.",
                    "label": 0
                },
                {
                    "sent": "So thanks for taking your first order.",
                    "label": 0
                }
            ]
        }
    }
}