{
    "id": "o5snodbrnhpw4udqajwjqzewhdk4ftka",
    "title": "Current Research in Disordered Speech",
    "info": {
        "author": [
            "Deirdre O'Leary, University College Cork",
            "Jennifer Harte, University College Cork",
            "Nicola Bessell, University College Cork"
        ],
        "published": "June 26, 2018",
        "recorded": "November 2017",
        "category": [
            "Top->Computers->Digital Media",
            "Top->Humanities->Languages",
            "Top->Medicine"
        ]
    },
    "url": "http://videolectures.net/clarinworkshop2017_bessell_harte_oleary_research/",
    "segmentation": [
        [
            "So my name is Nicholas Alanso out because Alice has a class to teach.",
            "At 4:00 o'clock she just asked me if I would present the first couple of slides to get going and then I'll just give you a little bit of information about myself and my place in the Department and then do Drew is going to take over."
        ],
        [
            "And talk about some of her research and complete the presentation.",
            "So what we've done here is really just highlighted.",
            "The members of the of the Department who have a particular kind of an interest in collecting, collecting, and analyzing speech data.",
            "So that's Nicole, who you'll hear from later Alice, who you all know about.",
            "Nikola, that's me and Fiona.",
            "Given who you all know?",
            "And who was our emeritus?",
            "Who's emeritus professor now with our previous head of Department?",
            "And then there's Jennifer down the back and go down and back.",
            "Who also will both be telling you what their research is about now?",
            "There's also care O'Toole, who works on Child, child language phonology and bilingual acquisition, and I work with her on collecting speech data.",
            "She doesn't work on it, collecting speech data directly, but she's indirectly involved in it in that."
        ],
        [
            "So in terms of our research facilities, you're actually sitting in what has become our phonetics lab.",
            "We relocated down here a couple of years ago.",
            "So the one we're using it the electric pallet.",
            "Ography equipment is out down here.",
            "The ultrasound which is out at the moment are EG equipment and Denise Ometer are acoustic analysis and recording equipment is kind of spread out around various members of the Department.",
            "Depending what's going on and goes out into the clinics and stuff like that.",
            "And we also have half a dozen portable audiometers because obviously if you're doing speech work.",
            "You have to a lot of the protocols require you to test hearing, but the other side of it of course, is that we have an audiology Masters program that runs here.",
            "And so we're working on Inter interlinking with those with that Department.",
            "And the Audiometers are part of that process as well.",
            "So this is our lab affectively.",
            "We've a set of clinic rooms upon in the Brookfield Building.",
            "I'm sure you'll be around there.",
            "Perhaps at some point in the next day or so.",
            "We've clinic rooms on the main corridor down there where we have in-house clinics, pediatric clinics for the most part, and the audiology teaching and training labs are there.",
            "We were fully with one small soundproof booth and.",
            "Another larger one which is used for mostly for audiology, but we can do recording it if we need to.",
            "Um, so that's about it.",
            "In terms of our sort of."
        ],
        [
            "For structure this is me."
        ],
        [
            "In big letters.",
            "So my background initially I've had several sort of reincarnations in terms of my career, and initially I started off doing field work and minority language documentation in the Pacific Northwest Coast in Canada.",
            "So I worked on Haida Salish and Tlingit did a lot of field work on reservations and best quality recordings, which at the time meant going around with a cassette recorder and magnetic tapes.",
            "And the very best microphone that I could find and recording in peoples homes and all that kind of stuff.",
            "And then a lot of acoustic analysis and fed confirm logical analysis of the resulting material, so I carried it on nowadays in my Irish context, my Irish reincarnation in terms of working on Kent and Gammon, which is.",
            "I put it absolutely endangered.",
            "Minority language of the traveling community here in Ireland.",
            "Very very undocumented in every imaginable way, partly because it was largely a secretive language for a very long time.",
            "So the other side of that, I suppose, in the Irish context, is my work on varieties of Irish English.",
            "So the Canton Gammon could technically go in there, I'm Canadian.",
            "Grew up in Newfoundland, so that's actually an Irish English speaking culture.",
            "But collecting dialect material from all over Ireland at the end of the day is my hope starting off in Cork in the Monster Monster area.",
            "So I'm establishing a database there.",
            "Of well recorded, well recorded speech data in a couple of situations I've got some citation for citation citation, wordless sentence List, A paragraph, and then some informal conversation so that I would love to link up with other universities in Ireland and places to get cooperation on that.",
            "So all happening very, very slowly, I'm afraid.",
            "But needs to happen now because the data is disappearing.",
            "So then coming up into more clinical stuff, I started off when I was studying phonetics, working on Parkinson's disease, and some case early cases.",
            "Very early cases of foreign accent syndrome, so I followed through on that and I continue to do.",
            "Analysis On existing recordings of foreign accents in patients with foreign accent syndrome.",
            "An I'm trying to develop it in Irish database of that.",
            "So far I've one patient in there but a second on the way.",
            "That would be something that would be obviously very much perhaps of interest and an interesting contribution to the database that we're talking about today.",
            "And in all cases, because I come from this phonetics background.",
            "I spend a lot of time getting a good, very good quality recording that you can do acoustic analysis on, and I suppose the other side of it is establishing a protocol of what would be useful.",
            "Possibly outside of my, you know, my own research interests for this material, so a slightly broader base.",
            "So I'd be very interested in input for that and for models of that the other side of my work is very much at the coalface here in the Department, and that is struggling.",
            "Valerus Lee to persuade the.",
            "Health Service executive to cooperate and collaborate in getting clinical record clinical data recordings.",
            "We have as I set you free clinic rooms on the field building on the 2nd floor and every Monday morning and Tuesday afternoon there are clinics with our speech and language therapy students which are Co wrong with the HSE.",
            "And it's actually I'm slowly developing a database of case really case study material from that context.",
            "But the ethics and the.",
            "Sort of sorting out the A.",
            "Agreeable and appropriate relationship with the HSE has been very, very difficult.",
            "But again, as with all of this other material, the focus here is on a really decent audio recording, but also getting video recordings as well.",
            "And I thought the other issue there has been with getting data that is suitable for teaching.",
            "In the classroom, but not only in the classroom but also for examination.",
            "Because, you know, we would have a course that module that in which the examination process is transcribing of disorder, speech analysis of a set of data.",
            "And we are always looking for material for that purpose where you can have the students look at a video with a decent audio of.",
            "A particular client audio that's good enough for them to do transcription from and to go forward with that, and it's very hard to very hard to get that.",
            "I think in five years I've gotten one case that's actually usable for those purposes because you have to get into the clinic, persuade the clinician to allow you to record.",
            "Make sure you're not interfering, and if you've got a little 5 year old Mike, tough as many of you know, it's actually nontrivial in the clinic environment to ask for that to.",
            "Ask for that happen, but really, examining has been a big issue for us and also the clinical training and trying to establish a clinical database that the students can go to.",
            "And we can say, oh look, we were client there who has problems with our production.",
            "If you go to this file you can listen to their assessment and there are notes here on what the therapeutic but the diagnosis process was and what the decided therapy was.",
            "And there's some recordings of post.",
            "Intervention and so on so forth.",
            "And I suppose the other basic issue for me is analysis of the phonetics and phenology of disordered sort of speech, and I suppose in a way I look at this other stuff, But particularly this material.",
            "As a way of developing a control database now it isn't obviously not necessarily matched, but I suppose my other interest would be in developing norms for the Irish pop for the local Irish context, so that's me and."
        ],
        [
            "Next Jennifer, who is going to talk about her work with Atlas.",
            "Hi, I'm presenting a little bit analysis work in a little bit online.",
            "I'm a research assistant in the Department here."
        ],
        [
            "Um?",
            "Just on Alice's research interests, you probably already know she is interested in typical and atypical speech production, and mainly analyzer through perceptual, an instrument that measures three most common ones used by Electro pathography ultrasound, an acoustic analysis."
        ],
        [
            "Um regarding EPG studies out of.",
            "Along with you on a given.",
            "Has published a number of studies using typical and production by children, adults, and disordered.",
            "Speech in children and the type of data.",
            "And they obtained the audio files in a web format and.",
            "EPG files.",
            "But they they did not get permission from participants to share this data, so.",
            "I don't think the current dash as Allison.",
            "If you want to be able to be shared on the data bank, perhaps features."
        ],
        [
            "Face.",
            "And there's been a couple of studies using ultrasound to measure speech.",
            "In different populations an they've collected out from two children's piece on this order and two TD children at the moment and they have the video files from the ultrasound and the audio files, and as far as I know they don't have consented to say that either."
        ],
        [
            "And I'm working on a project with Alice looking at prosodic skills in children with spina bifida at the moment.",
            "So about a year into it and if you want to give and is a Co applicant on this project."
        ],
        [
            "So the the goal of this study was to.",
            "Look at the weaknesses and strengths and expressive and receptive product liability in children with Down syndrome and compare them to the age and language matched typical solution as well."
        ],
        [
            "So we used the Pepsi to assess prosody and so we're kind of still in the middle of data collection at the moment.",
            "So we have the Pepsi scores, but that we have language scores.",
            "The audio files from the property assessment and we recorded the Frog story.",
            "How much is a narrative story to produce produce the speech sample from each child as well, so that would be used for acoustic analysis?",
            "Um?"
        ],
        [
            "Just for interest sake there the results we have at the moment so far.",
            "So the spina bifida group and the language match group have very similar pattern.",
            "But we still need to finish our data collection to completely compare groups.",
            "Um?"
        ],
        [
            "That prosody study, and I did my Masters in a separate study.",
            "Accent comprehension and children with Sweet sound's order.",
            "So I was examining.",
            "The impact of a familiar accents to Carfax and an American accent.",
            "North American accent and a Indian accent on children's receptive language.",
            "Specifically, their sentence comprehension and I.",
            "To this it's 16 children, 15 children, three sons sorter and 16 language match children.",
            "I didn't find a significant difference in between the groups in the end, but I just thought I'd show you what that I collected, so I assess their language.",
            "Um, I did a screening using this portable audiometers we have here in the Department.",
            "Cognitive assessment speech and oral motor assessments and trying to audio record speech assessment in this management possible and then I had.",
            "The Sentence comprehension task used to analyze the effect of the different accents.",
            "So I used the tool contest for children.",
            "Much basically the children, her instruction in each accent, such as touch the Red Square in the blue circle or the yellow circle on the Red Square.",
            "The instructions get longer and longer.",
            "And I videotaped those.",
            "Part of that session, the video camera was just on the children's hands touching the shapes.",
            "In case I missed anything that can move quite fast.",
            "But yeah, so I had to make sure the camera was only on the hands.",
            "Um?",
            "But again, I don't have.",
            "I did not.",
            "That was from about year two ago and I don't have consent to share that data at the moment.",
            "But yeah, that's there's a couple of the studies.",
            "Me and Dallas are involved in an."
        ],
        [
            "I'd like to to talk maybe questions at the end.",
            "Hi everybody, my name is Daria and I'm a PhD student here in the Department.",
            "I so did my undergrad and speech and language therapy here and then I did my Masters by research here and that was an unfamiliar Axon comprehension and N syndrome.",
            "And no, they can't get ready.",
            "I'm doing my PhD here so."
        ],
        [
            "My PhD sponsored by Irish Research Council and maybe looking at speech intelligibility in Down syndrome."
        ],
        [
            "And so right now speech is mostly made up of five components.",
            "Respiration, phonation, articulation, resonance, and prosody.",
            "So when we produce speech and these components collaborate together, and we produce speech."
        ],
        [
            "And the speech intelligibility then is how much of the speech output that the listener corner stand.",
            "And this is what I'm investigating and Down syndrome."
        ],
        [
            "So the assessment of intelligibility is usually done using a few methods.",
            "There's perceptual methods, so this is kind of a listers judgment where they can rate or transcribes speech samples so they can race along a scale.",
            "How easy or difficult speech Thunder step is to understand, or they write down what they hear, and then as compared to a target."
        ],
        [
            "Sanders, also acoustic method.",
            "So this is more of an objective evaluation where we specialize software.",
            "It's mostly crash here in this Department and where we measure no specific acoustic parameters.",
            "I know probably a lot of you here are familiar with us, and then we compare the relationship of some of these parameters to speech intelligibility, or we can compare them to typical speakers."
        ],
        [
            "As for the ages and I study, then quickly are to assess the perceptual and acoustic features of each of the speech components in Down syndrome and then how they influence speech intelligibility.",
            "So this is never been done before.",
            "It usually one component like nasality or voice policy might be looked at individual how that impacts on speech intelligibility but no study has looked at them together.",
            "And I also want to investigate the impact of listener experience on speech intelligibility scores so.",
            "You know, as the experience of a listener can affect how easy or difficult it is for them to understand speech.",
            "So someone who is that who is working in the analysis of speech.",
            "Find you own care.",
            "Caesars understand and someone who has no experience with this.",
            "And then I also want to investigate the relationship between speech intelligibility and language ability in Down syndrome."
        ],
        [
            "So my participants quickly.",
            "I'll have hopefully 30 speakers are Down syndrome, age 16 and up, and 30 typical speakers matched for age and gender, and from them I will get various speech cell phones for analysis.",
            "So spontaneous speech sample prolonged vowels, pulses fricatives.",
            "I'm hoping to get a range of samples."
        ],
        [
            "And then I will be processing acoustically, analyzing the speech samples under all the five components of speech.",
            "So for example, on the respiration of perceptual measurement.",
            "Might be just a VSS highlight precedes the respiration to be in connected speech and then maybe an acoustic measurement might be maximum phonation type under phonation, which is voice at the perceptual measurement would be the case.",
            "The assessment, which is a perceptual analysis of voice and the acoustic measurement might be you know.",
            "SO for intensity.",
            "A lot of FDR range, so there's all the different parameters under each of the components, and then I will be carrying out that research."
        ],
        [
            "But then as well, I'll also be recruiting listeners to listen to the speech samples and give me intelligibility scores, so I have naive listeners so they have no training in the Georgia, the speech disorders or not, no regular contact with someone with an intellectual disability and then experiences.",
            "So these are the speech and language therapists working with people whose speech difficulties."
        ],
        [
            "And then I will have them to raise a spontaneous speech sample Anna BS scale and also transcribes sentence is to get to intelligibility scores.",
            "So."
        ],
        [
            "Stacy, well, I'm hoping to do so.",
            "The data will have at the end and I haven't actually started to collect collecting data yet, so maybe there's a possibility that this data set could go into the bank, so hopefully by the end for both groups so that the Group of Den syndrome and the group the typical speaker group and have a spontaneous speech sample with a minimum of 50 offenses.",
            "Prolonged bells.",
            "I will have our very cells produced in.",
            "So he's very deformed carrier phrase on the various plosives and fricatives.",
            "I also have add a sentence is from the assessment of intelligibility of the sciatic speech by your financial, and so these are just a range of sentence is an going from 5 to 15 words long, where they later reader repeat, and these are all be recorded.",
            "So that's what I get from both."
        ],
        [
            "Groups are known from the group again syndrome.",
            "I also have recordings of single words from the government crystal, an articulation assessment and I also have the KC scores, which is a voice assessment.",
            "Plus I'll have the rating and transcription scores of speech intelligibility from both, and I even experience lessers.",
            "I'll have oral motor assessment scores, perceptual scores and also the audio ologist in the Department is going to give each of my participants of full audio logical assessment.",
            "So I love hearing levels and data from that.",
            "And I also have language scores for the participants with Down syndrome.",
            "So that hope you want.",
            "Maybe I could add to.",
            "But after I."
        ],
        [
            "So that's it really.",
            "From UCC, I think so.",
            "Anyone has any questions or for Nicola or Jennifer myself?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my name is Nicholas Alanso out because Alice has a class to teach.",
                    "label": 0
                },
                {
                    "sent": "At 4:00 o'clock she just asked me if I would present the first couple of slides to get going and then I'll just give you a little bit of information about myself and my place in the Department and then do Drew is going to take over.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And talk about some of her research and complete the presentation.",
                    "label": 0
                },
                {
                    "sent": "So what we've done here is really just highlighted.",
                    "label": 0
                },
                {
                    "sent": "The members of the of the Department who have a particular kind of an interest in collecting, collecting, and analyzing speech data.",
                    "label": 0
                },
                {
                    "sent": "So that's Nicole, who you'll hear from later Alice, who you all know about.",
                    "label": 0
                },
                {
                    "sent": "Nikola, that's me and Fiona.",
                    "label": 0
                },
                {
                    "sent": "Given who you all know?",
                    "label": 0
                },
                {
                    "sent": "And who was our emeritus?",
                    "label": 0
                },
                {
                    "sent": "Who's emeritus professor now with our previous head of Department?",
                    "label": 0
                },
                {
                    "sent": "And then there's Jennifer down the back and go down and back.",
                    "label": 0
                },
                {
                    "sent": "Who also will both be telling you what their research is about now?",
                    "label": 0
                },
                {
                    "sent": "There's also care O'Toole, who works on Child, child language phonology and bilingual acquisition, and I work with her on collecting speech data.",
                    "label": 0
                },
                {
                    "sent": "She doesn't work on it, collecting speech data directly, but she's indirectly involved in it in that.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in terms of our research facilities, you're actually sitting in what has become our phonetics lab.",
                    "label": 1
                },
                {
                    "sent": "We relocated down here a couple of years ago.",
                    "label": 0
                },
                {
                    "sent": "So the one we're using it the electric pallet.",
                    "label": 0
                },
                {
                    "sent": "Ography equipment is out down here.",
                    "label": 0
                },
                {
                    "sent": "The ultrasound which is out at the moment are EG equipment and Denise Ometer are acoustic analysis and recording equipment is kind of spread out around various members of the Department.",
                    "label": 0
                },
                {
                    "sent": "Depending what's going on and goes out into the clinics and stuff like that.",
                    "label": 0
                },
                {
                    "sent": "And we also have half a dozen portable audiometers because obviously if you're doing speech work.",
                    "label": 1
                },
                {
                    "sent": "You have to a lot of the protocols require you to test hearing, but the other side of it of course, is that we have an audiology Masters program that runs here.",
                    "label": 0
                },
                {
                    "sent": "And so we're working on Inter interlinking with those with that Department.",
                    "label": 0
                },
                {
                    "sent": "And the Audiometers are part of that process as well.",
                    "label": 0
                },
                {
                    "sent": "So this is our lab affectively.",
                    "label": 0
                },
                {
                    "sent": "We've a set of clinic rooms upon in the Brookfield Building.",
                    "label": 0
                },
                {
                    "sent": "I'm sure you'll be around there.",
                    "label": 0
                },
                {
                    "sent": "Perhaps at some point in the next day or so.",
                    "label": 1
                },
                {
                    "sent": "We've clinic rooms on the main corridor down there where we have in-house clinics, pediatric clinics for the most part, and the audiology teaching and training labs are there.",
                    "label": 0
                },
                {
                    "sent": "We were fully with one small soundproof booth and.",
                    "label": 0
                },
                {
                    "sent": "Another larger one which is used for mostly for audiology, but we can do recording it if we need to.",
                    "label": 0
                },
                {
                    "sent": "Um, so that's about it.",
                    "label": 0
                },
                {
                    "sent": "In terms of our sort of.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For structure this is me.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In big letters.",
                    "label": 0
                },
                {
                    "sent": "So my background initially I've had several sort of reincarnations in terms of my career, and initially I started off doing field work and minority language documentation in the Pacific Northwest Coast in Canada.",
                    "label": 0
                },
                {
                    "sent": "So I worked on Haida Salish and Tlingit did a lot of field work on reservations and best quality recordings, which at the time meant going around with a cassette recorder and magnetic tapes.",
                    "label": 1
                },
                {
                    "sent": "And the very best microphone that I could find and recording in peoples homes and all that kind of stuff.",
                    "label": 0
                },
                {
                    "sent": "And then a lot of acoustic analysis and fed confirm logical analysis of the resulting material, so I carried it on nowadays in my Irish context, my Irish reincarnation in terms of working on Kent and Gammon, which is.",
                    "label": 0
                },
                {
                    "sent": "I put it absolutely endangered.",
                    "label": 0
                },
                {
                    "sent": "Minority language of the traveling community here in Ireland.",
                    "label": 0
                },
                {
                    "sent": "Very very undocumented in every imaginable way, partly because it was largely a secretive language for a very long time.",
                    "label": 1
                },
                {
                    "sent": "So the other side of that, I suppose, in the Irish context, is my work on varieties of Irish English.",
                    "label": 0
                },
                {
                    "sent": "So the Canton Gammon could technically go in there, I'm Canadian.",
                    "label": 0
                },
                {
                    "sent": "Grew up in Newfoundland, so that's actually an Irish English speaking culture.",
                    "label": 0
                },
                {
                    "sent": "But collecting dialect material from all over Ireland at the end of the day is my hope starting off in Cork in the Monster Monster area.",
                    "label": 0
                },
                {
                    "sent": "So I'm establishing a database there.",
                    "label": 0
                },
                {
                    "sent": "Of well recorded, well recorded speech data in a couple of situations I've got some citation for citation citation, wordless sentence List, A paragraph, and then some informal conversation so that I would love to link up with other universities in Ireland and places to get cooperation on that.",
                    "label": 0
                },
                {
                    "sent": "So all happening very, very slowly, I'm afraid.",
                    "label": 0
                },
                {
                    "sent": "But needs to happen now because the data is disappearing.",
                    "label": 0
                },
                {
                    "sent": "So then coming up into more clinical stuff, I started off when I was studying phonetics, working on Parkinson's disease, and some case early cases.",
                    "label": 1
                },
                {
                    "sent": "Very early cases of foreign accent syndrome, so I followed through on that and I continue to do.",
                    "label": 0
                },
                {
                    "sent": "Analysis On existing recordings of foreign accents in patients with foreign accent syndrome.",
                    "label": 0
                },
                {
                    "sent": "An I'm trying to develop it in Irish database of that.",
                    "label": 0
                },
                {
                    "sent": "So far I've one patient in there but a second on the way.",
                    "label": 0
                },
                {
                    "sent": "That would be something that would be obviously very much perhaps of interest and an interesting contribution to the database that we're talking about today.",
                    "label": 0
                },
                {
                    "sent": "And in all cases, because I come from this phonetics background.",
                    "label": 0
                },
                {
                    "sent": "I spend a lot of time getting a good, very good quality recording that you can do acoustic analysis on, and I suppose the other side of it is establishing a protocol of what would be useful.",
                    "label": 0
                },
                {
                    "sent": "Possibly outside of my, you know, my own research interests for this material, so a slightly broader base.",
                    "label": 0
                },
                {
                    "sent": "So I'd be very interested in input for that and for models of that the other side of my work is very much at the coalface here in the Department, and that is struggling.",
                    "label": 0
                },
                {
                    "sent": "Valerus Lee to persuade the.",
                    "label": 0
                },
                {
                    "sent": "Health Service executive to cooperate and collaborate in getting clinical record clinical data recordings.",
                    "label": 0
                },
                {
                    "sent": "We have as I set you free clinic rooms on the field building on the 2nd floor and every Monday morning and Tuesday afternoon there are clinics with our speech and language therapy students which are Co wrong with the HSE.",
                    "label": 0
                },
                {
                    "sent": "And it's actually I'm slowly developing a database of case really case study material from that context.",
                    "label": 0
                },
                {
                    "sent": "But the ethics and the.",
                    "label": 0
                },
                {
                    "sent": "Sort of sorting out the A.",
                    "label": 0
                },
                {
                    "sent": "Agreeable and appropriate relationship with the HSE has been very, very difficult.",
                    "label": 0
                },
                {
                    "sent": "But again, as with all of this other material, the focus here is on a really decent audio recording, but also getting video recordings as well.",
                    "label": 0
                },
                {
                    "sent": "And I thought the other issue there has been with getting data that is suitable for teaching.",
                    "label": 0
                },
                {
                    "sent": "In the classroom, but not only in the classroom but also for examination.",
                    "label": 1
                },
                {
                    "sent": "Because, you know, we would have a course that module that in which the examination process is transcribing of disorder, speech analysis of a set of data.",
                    "label": 0
                },
                {
                    "sent": "And we are always looking for material for that purpose where you can have the students look at a video with a decent audio of.",
                    "label": 0
                },
                {
                    "sent": "A particular client audio that's good enough for them to do transcription from and to go forward with that, and it's very hard to very hard to get that.",
                    "label": 0
                },
                {
                    "sent": "I think in five years I've gotten one case that's actually usable for those purposes because you have to get into the clinic, persuade the clinician to allow you to record.",
                    "label": 0
                },
                {
                    "sent": "Make sure you're not interfering, and if you've got a little 5 year old Mike, tough as many of you know, it's actually nontrivial in the clinic environment to ask for that to.",
                    "label": 0
                },
                {
                    "sent": "Ask for that happen, but really, examining has been a big issue for us and also the clinical training and trying to establish a clinical database that the students can go to.",
                    "label": 0
                },
                {
                    "sent": "And we can say, oh look, we were client there who has problems with our production.",
                    "label": 0
                },
                {
                    "sent": "If you go to this file you can listen to their assessment and there are notes here on what the therapeutic but the diagnosis process was and what the decided therapy was.",
                    "label": 1
                },
                {
                    "sent": "And there's some recordings of post.",
                    "label": 0
                },
                {
                    "sent": "Intervention and so on so forth.",
                    "label": 0
                },
                {
                    "sent": "And I suppose the other basic issue for me is analysis of the phonetics and phenology of disordered sort of speech, and I suppose in a way I look at this other stuff, But particularly this material.",
                    "label": 0
                },
                {
                    "sent": "As a way of developing a control database now it isn't obviously not necessarily matched, but I suppose my other interest would be in developing norms for the Irish pop for the local Irish context, so that's me and.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next Jennifer, who is going to talk about her work with Atlas.",
                    "label": 0
                },
                {
                    "sent": "Hi, I'm presenting a little bit analysis work in a little bit online.",
                    "label": 0
                },
                {
                    "sent": "I'm a research assistant in the Department here.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Just on Alice's research interests, you probably already know she is interested in typical and atypical speech production, and mainly analyzer through perceptual, an instrument that measures three most common ones used by Electro pathography ultrasound, an acoustic analysis.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um regarding EPG studies out of.",
                    "label": 1
                },
                {
                    "sent": "Along with you on a given.",
                    "label": 1
                },
                {
                    "sent": "Has published a number of studies using typical and production by children, adults, and disordered.",
                    "label": 1
                },
                {
                    "sent": "Speech in children and the type of data.",
                    "label": 0
                },
                {
                    "sent": "And they obtained the audio files in a web format and.",
                    "label": 0
                },
                {
                    "sent": "EPG files.",
                    "label": 0
                },
                {
                    "sent": "But they they did not get permission from participants to share this data, so.",
                    "label": 0
                },
                {
                    "sent": "I don't think the current dash as Allison.",
                    "label": 0
                },
                {
                    "sent": "If you want to be able to be shared on the data bank, perhaps features.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Face.",
                    "label": 0
                },
                {
                    "sent": "And there's been a couple of studies using ultrasound to measure speech.",
                    "label": 0
                },
                {
                    "sent": "In different populations an they've collected out from two children's piece on this order and two TD children at the moment and they have the video files from the ultrasound and the audio files, and as far as I know they don't have consented to say that either.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'm working on a project with Alice looking at prosodic skills in children with spina bifida at the moment.",
                    "label": 0
                },
                {
                    "sent": "So about a year into it and if you want to give and is a Co applicant on this project.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the the goal of this study was to.",
                    "label": 0
                },
                {
                    "sent": "Look at the weaknesses and strengths and expressive and receptive product liability in children with Down syndrome and compare them to the age and language matched typical solution as well.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we used the Pepsi to assess prosody and so we're kind of still in the middle of data collection at the moment.",
                    "label": 1
                },
                {
                    "sent": "So we have the Pepsi scores, but that we have language scores.",
                    "label": 0
                },
                {
                    "sent": "The audio files from the property assessment and we recorded the Frog story.",
                    "label": 1
                },
                {
                    "sent": "How much is a narrative story to produce produce the speech sample from each child as well, so that would be used for acoustic analysis?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just for interest sake there the results we have at the moment so far.",
                    "label": 0
                },
                {
                    "sent": "So the spina bifida group and the language match group have very similar pattern.",
                    "label": 0
                },
                {
                    "sent": "But we still need to finish our data collection to completely compare groups.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That prosody study, and I did my Masters in a separate study.",
                    "label": 0
                },
                {
                    "sent": "Accent comprehension and children with Sweet sound's order.",
                    "label": 1
                },
                {
                    "sent": "So I was examining.",
                    "label": 0
                },
                {
                    "sent": "The impact of a familiar accents to Carfax and an American accent.",
                    "label": 0
                },
                {
                    "sent": "North American accent and a Indian accent on children's receptive language.",
                    "label": 0
                },
                {
                    "sent": "Specifically, their sentence comprehension and I.",
                    "label": 0
                },
                {
                    "sent": "To this it's 16 children, 15 children, three sons sorter and 16 language match children.",
                    "label": 0
                },
                {
                    "sent": "I didn't find a significant difference in between the groups in the end, but I just thought I'd show you what that I collected, so I assess their language.",
                    "label": 0
                },
                {
                    "sent": "Um, I did a screening using this portable audiometers we have here in the Department.",
                    "label": 0
                },
                {
                    "sent": "Cognitive assessment speech and oral motor assessments and trying to audio record speech assessment in this management possible and then I had.",
                    "label": 0
                },
                {
                    "sent": "The Sentence comprehension task used to analyze the effect of the different accents.",
                    "label": 0
                },
                {
                    "sent": "So I used the tool contest for children.",
                    "label": 0
                },
                {
                    "sent": "Much basically the children, her instruction in each accent, such as touch the Red Square in the blue circle or the yellow circle on the Red Square.",
                    "label": 0
                },
                {
                    "sent": "The instructions get longer and longer.",
                    "label": 0
                },
                {
                    "sent": "And I videotaped those.",
                    "label": 0
                },
                {
                    "sent": "Part of that session, the video camera was just on the children's hands touching the shapes.",
                    "label": 0
                },
                {
                    "sent": "In case I missed anything that can move quite fast.",
                    "label": 0
                },
                {
                    "sent": "But yeah, so I had to make sure the camera was only on the hands.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But again, I don't have.",
                    "label": 0
                },
                {
                    "sent": "I did not.",
                    "label": 0
                },
                {
                    "sent": "That was from about year two ago and I don't have consent to share that data at the moment.",
                    "label": 0
                },
                {
                    "sent": "But yeah, that's there's a couple of the studies.",
                    "label": 0
                },
                {
                    "sent": "Me and Dallas are involved in an.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'd like to to talk maybe questions at the end.",
                    "label": 0
                },
                {
                    "sent": "Hi everybody, my name is Daria and I'm a PhD student here in the Department.",
                    "label": 0
                },
                {
                    "sent": "I so did my undergrad and speech and language therapy here and then I did my Masters by research here and that was an unfamiliar Axon comprehension and N syndrome.",
                    "label": 0
                },
                {
                    "sent": "And no, they can't get ready.",
                    "label": 0
                },
                {
                    "sent": "I'm doing my PhD here so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My PhD sponsored by Irish Research Council and maybe looking at speech intelligibility in Down syndrome.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so right now speech is mostly made up of five components.",
                    "label": 0
                },
                {
                    "sent": "Respiration, phonation, articulation, resonance, and prosody.",
                    "label": 1
                },
                {
                    "sent": "So when we produce speech and these components collaborate together, and we produce speech.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the speech intelligibility then is how much of the speech output that the listener corner stand.",
                    "label": 0
                },
                {
                    "sent": "And this is what I'm investigating and Down syndrome.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the assessment of intelligibility is usually done using a few methods.",
                    "label": 1
                },
                {
                    "sent": "There's perceptual methods, so this is kind of a listers judgment where they can rate or transcribes speech samples so they can race along a scale.",
                    "label": 0
                },
                {
                    "sent": "How easy or difficult speech Thunder step is to understand, or they write down what they hear, and then as compared to a target.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sanders, also acoustic method.",
                    "label": 0
                },
                {
                    "sent": "So this is more of an objective evaluation where we specialize software.",
                    "label": 1
                },
                {
                    "sent": "It's mostly crash here in this Department and where we measure no specific acoustic parameters.",
                    "label": 0
                },
                {
                    "sent": "I know probably a lot of you here are familiar with us, and then we compare the relationship of some of these parameters to speech intelligibility, or we can compare them to typical speakers.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As for the ages and I study, then quickly are to assess the perceptual and acoustic features of each of the speech components in Down syndrome and then how they influence speech intelligibility.",
                    "label": 1
                },
                {
                    "sent": "So this is never been done before.",
                    "label": 0
                },
                {
                    "sent": "It usually one component like nasality or voice policy might be looked at individual how that impacts on speech intelligibility but no study has looked at them together.",
                    "label": 0
                },
                {
                    "sent": "And I also want to investigate the impact of listener experience on speech intelligibility scores so.",
                    "label": 1
                },
                {
                    "sent": "You know, as the experience of a listener can affect how easy or difficult it is for them to understand speech.",
                    "label": 0
                },
                {
                    "sent": "So someone who is that who is working in the analysis of speech.",
                    "label": 0
                },
                {
                    "sent": "Find you own care.",
                    "label": 0
                },
                {
                    "sent": "Caesars understand and someone who has no experience with this.",
                    "label": 0
                },
                {
                    "sent": "And then I also want to investigate the relationship between speech intelligibility and language ability in Down syndrome.",
                    "label": 1
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my participants quickly.",
                    "label": 0
                },
                {
                    "sent": "I'll have hopefully 30 speakers are Down syndrome, age 16 and up, and 30 typical speakers matched for age and gender, and from them I will get various speech cell phones for analysis.",
                    "label": 0
                },
                {
                    "sent": "So spontaneous speech sample prolonged vowels, pulses fricatives.",
                    "label": 0
                },
                {
                    "sent": "I'm hoping to get a range of samples.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then I will be processing acoustically, analyzing the speech samples under all the five components of speech.",
                    "label": 0
                },
                {
                    "sent": "So for example, on the respiration of perceptual measurement.",
                    "label": 1
                },
                {
                    "sent": "Might be just a VSS highlight precedes the respiration to be in connected speech and then maybe an acoustic measurement might be maximum phonation type under phonation, which is voice at the perceptual measurement would be the case.",
                    "label": 0
                },
                {
                    "sent": "The assessment, which is a perceptual analysis of voice and the acoustic measurement might be you know.",
                    "label": 0
                },
                {
                    "sent": "SO for intensity.",
                    "label": 0
                },
                {
                    "sent": "A lot of FDR range, so there's all the different parameters under each of the components, and then I will be carrying out that research.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then as well, I'll also be recruiting listeners to listen to the speech samples and give me intelligibility scores, so I have naive listeners so they have no training in the Georgia, the speech disorders or not, no regular contact with someone with an intellectual disability and then experiences.",
                    "label": 0
                },
                {
                    "sent": "So these are the speech and language therapists working with people whose speech difficulties.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then I will have them to raise a spontaneous speech sample Anna BS scale and also transcribes sentence is to get to intelligibility scores.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stacy, well, I'm hoping to do so.",
                    "label": 0
                },
                {
                    "sent": "The data will have at the end and I haven't actually started to collect collecting data yet, so maybe there's a possibility that this data set could go into the bank, so hopefully by the end for both groups so that the Group of Den syndrome and the group the typical speaker group and have a spontaneous speech sample with a minimum of 50 offenses.",
                    "label": 0
                },
                {
                    "sent": "Prolonged bells.",
                    "label": 0
                },
                {
                    "sent": "I will have our very cells produced in.",
                    "label": 1
                },
                {
                    "sent": "So he's very deformed carrier phrase on the various plosives and fricatives.",
                    "label": 1
                },
                {
                    "sent": "I also have add a sentence is from the assessment of intelligibility of the sciatic speech by your financial, and so these are just a range of sentence is an going from 5 to 15 words long, where they later reader repeat, and these are all be recorded.",
                    "label": 0
                },
                {
                    "sent": "So that's what I get from both.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Groups are known from the group again syndrome.",
                    "label": 0
                },
                {
                    "sent": "I also have recordings of single words from the government crystal, an articulation assessment and I also have the KC scores, which is a voice assessment.",
                    "label": 1
                },
                {
                    "sent": "Plus I'll have the rating and transcription scores of speech intelligibility from both, and I even experience lessers.",
                    "label": 1
                },
                {
                    "sent": "I'll have oral motor assessment scores, perceptual scores and also the audio ologist in the Department is going to give each of my participants of full audio logical assessment.",
                    "label": 1
                },
                {
                    "sent": "So I love hearing levels and data from that.",
                    "label": 0
                },
                {
                    "sent": "And I also have language scores for the participants with Down syndrome.",
                    "label": 0
                },
                {
                    "sent": "So that hope you want.",
                    "label": 0
                },
                {
                    "sent": "Maybe I could add to.",
                    "label": 0
                },
                {
                    "sent": "But after I.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's it really.",
                    "label": 0
                },
                {
                    "sent": "From UCC, I think so.",
                    "label": 0
                },
                {
                    "sent": "Anyone has any questions or for Nicola or Jennifer myself?",
                    "label": 0
                }
            ]
        }
    }
}