{
    "id": "o7tqvg6emimomoxxcfzykp5k3uc4zzqh",
    "title": "eBIZ-TCF: An Initiative to Improve eAdoption in European Textile/Clothing and Footwear Industry",
    "info": {
        "author": [
            "Milena Stefanova, Computing and Modelling Unit, ENEA Casaccia Research Center"
        ],
        "published": "Sept. 24, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Business->Enterprise Collaboration"
        ]
    },
    "url": "http://videolectures.net/ice09_stefanova_ebiz/",
    "segmentation": [
        [
            "In their agency for Sustainable Development, which main goal is to support local SMS in their innovation practices?"
        ],
        [
            "So I'm going to present you the project if it's a TCF which is.",
            "Project caught by the European Commission DG Enterprise.",
            "It was a tender of the gentle price.",
            "It's not a research project, and the goal of this project is to facilitate the large scale adoption of the business in the textile, clothing and footwear industries.",
            "The project started in January 2028 and is going to finish indent of this year.",
            "Currently there are more than 160 companies and European organizations involved in this project."
        ],
        [
            "Shut down objective of the project is to create a favorable environment for the European textile, clothing and footwear industries.",
            "That stimulation tables, uptake of ICT, anti business technologies in the sectors.",
            "There are three main outcomes of the project.",
            "First is the definition of general architecture for the business, which is compliant to existing specific standard specification, European and international.",
            "For Vectibix transactions in the textile, clothing and footwear sectors.",
            "The second outcome of the project is the creation of extensive set of pilots that actual adopt and that harmonized standard specifications created in the general architecture and the third outcome is to create a broader awareness and acceptance by European stakeholders."
        ],
        [
            "So these are the project partners.",
            "There are three main project partners ever attacks, which is the European Association of Textile and clothing industry sector is the European Association on the Footwear industry.",
            "And then my Institute, which is the technological partner with the construction and then we have more than 160 subcontractors that are implementing the pilot projects in the within.",
            "The project that come from.",
            "Actually, more than the countries that are listed here are about 20 European countries and these are end users.",
            "Companies coming from the three sectors and also their ICT providers and invent.",
            "We have involved the same like a standardization but in the in the project.",
            "So the project I would like to."
        ],
        [
            "Outline the methodology followed by the project.",
            "This is not a research project so there is no research products or innovative products.",
            "But what is innovative here is the methodology that is followed to stimulate the uptake of standard specifications by the small and medium enterprises in the sector.",
            "So the methodology is having four parts.",
            "The first one is analysis for in the first six months of the project we performed an analysis of the state of the art in the adoption of ICT into business solutions by the small to medium companies in in the three sectors.",
            "As well, we have performed the state of the art analysis on the existing standard specifications and standardization and.",
            "Other kinds of initiatives.",
            "So the second part was the definition of what we call business architecture.",
            "So that architecture has is not ICT architecture, it is just a set of standards documented in a harmonized way that our mapping to various processes and documents exchanging business transactions among active players in the in the three sectors.",
            "And then we have defined the indications about this, IT infrastructures and the standards that has to be used on the.",
            "I stand firm in the world levels.",
            "Then the next step in our methodology is the creation of.",
            "A set of pilot projects that actually adopted the standard specifications with switching their earpiece systems and their scope is to validate the architecture and to provide feedback for improvements.",
            "But the ultimate objective is to create large scale impact and best practices.",
            "Currently there are 13 pilot projects running with more than 130 end users that are adopting the standard specifications.",
            "And the last part of the project is the creation of the awareness and dissemination through the two European associations.",
            "So I will present as quick as possible."
        ],
        [
            "The analysis that architecture and the pilot and more more stress on the pilot implementations.",
            "So the analysis that comes of the analysis was that first there are a large number of European enterprises that are involved in some kind of business activity and they are mainly concentrated in Western and Central Europe.",
            "But more often the number of electronic transactions exchanges are small.",
            "There are a small small number of connections and supported functions.",
            "And the search electronic transactions are limited to one or two large trading partners which demand use of their systems."
        ],
        [
            "So are we also notice that the level of adoption of the business is higher on the downstream part?",
            "The producer to retailer connections while in the upstream part there are few companies that are using transactions, electronic transactions and downstream systems are more diffused.",
            "In western central Europe, while southern Europe is preferring the use of such systems on the upstream part of the supply chain.",
            "And for some obstacles that."
        ],
        [
            "We found out that we business adoption that are, I guess, the standard one that are already listed everywhere but the problem in this sector says that there are many small and medium companies and few leaders cake that can impose a solution standard based solution.",
            "Then the pursuit meant of Porter, not investment, lack of time and insecure personnel.",
            "And we found out that many small to medium companies would like to adopt A business solutions, but they're scared of taking any solutions since they're scared that it is not the standard solution and so they waited some more standard based solution appears on the market.",
            "Now I'm going to present you the."
        ],
        [
            "E Business architecture that we defined in within the product."
        ],
        [
            "Checked.",
            "So the objectives of this architecture is to be defined on two key areas, so the first one is production to retail relationship and the second one is for manufacturing networks.",
            "In fact, during the analysis we found out that there are different requirements in the two parts of the supply chains, mainly in the downstream part, production to retail relationship.",
            "There is a strong need for normalization between the two sectors.",
            "And the very small sets of data that has to be exchanged while in the upstream part of manufacturing networks than it is for very specialized sectors in sector dependent information.",
            "Then the we have decided that the object the architecture should have higher compossible compliance with existing European and international public standards.",
            "For this sectors and then the purpose of the architecture is to serve like a technical and business reference for the pilot projects.",
            "In order to achieve interoperability between existing systems and organizations.",
            "So he."
        ],
        [
            "It is a graphical presentation of the of the supply chain.",
            "We have two separate parts for the textile clothing and footwear industry and upstream part and.",
            "In the downstream part of the of the supply chain we have provided common downstream specifications of the exchange documents.",
            "I'm scared."
        ],
        [
            "Toward you don't know if you are interested in the kind of methodology that we followed, but on the architecture level we have defined it on 2 levels on 3 levels.",
            "Actually business level, middleware level and communication level, and we have specified completely the business level that are it contains actually the specific XML specifications of the business documents that are exchanged between the trading partners in.",
            "Some set of specific business processes.",
            "The middleware and the communication level has mainly indications to standards, but there is need for further work on the ICT architecture itself and also on the profiling of existing standards.",
            "Since the existing standards are too complex and too big for.",
            "For this sector."
        ],
        [
            "So on the business level, what we did, we didn't harmonize existing standards, but we decided to harmonize the documentation of the standards.",
            "So we presented the supply chain like set of business processes, its business processes or set of activities, activities, sequence of one way document exchange transactions.",
            "Each transaction is a triple and then each document is presented by Document Model and then there is a reference to the actual Hicks email schema that implements the document.",
            "And."
        ],
        [
            "OK, on the downstream here for example, in the downstream part we have three processes.",
            "We have considered three processes and there are 17 documents exchanged and we are based on external skills that come from standardization projects in like WWS profile.",
            "Send text with from standard Project segment, show that is reengineering always the same kind of business models and we have creating created.",
            "Also you blueys profiles that are based always on the same document model.",
            "So we have syntax independent document model that is mapping to various standards."
        ],
        [
            "Similar process went was done for the textile clotting upstream and the footwear upstream part of the supply chain."
        ],
        [
            "Then we have also defined the product.",
            "We haven't defined that actually, we have considered several specifications for product classifications and here the main were not just the major problems for intra interoperability problems.",
            "So the next part of that?"
        ],
        [
            "I would like to illustrate to you are the pilot implementations of this architecture."
        ],
        [
            "So what are the pilots?",
            "So these are actually group of companies and users from the three sectors.",
            "That are organized together to implement the business specifications in their in their information systems and with the scope to test to test the validity of the architecture to test the interoperability of systems and to create the base for large scale adoption and best practices on European level.",
            "So the the pilots were organized or organized in two phases.",
            "The first phase was from July to October 2028, contained 5 pilots and their main scope was the testing and validation of the architecture.",
            "And for the second phase, pilots, now they're running 13 pilots that has an optimal ultimate objective of creating best practices and the setting up the base for large scale adoption on European level."
        ],
        [
            "So the first phase of the pilots here we're about 40 car companies were initially involved in the project.",
            "Actually here are pilots, but from the 1st and the second phase."
        ],
        [
            "And at this moment we are like this, many about 20 countries are participating in the project and more than 130 end users are participating directly in the pilots and there is like other actually not 200 but 300 data like first follow up since their clients of of ICT providers or bigger companies that are participating directly in the project."
        ],
        [
            "So each pilot is organized in this way.",
            "There is one facilitator company that is coordinating all the project and is.",
            "He's acting like a subcontractor to the Hibbitts TCF consortium.",
            "Then we have one or several producers for the downstream pilots there also one or several retailers, and then we have at least one nicety service provider that is implementing the mapping.",
            "Between the existing systems and the.",
            "It's architecture."
        ],
        [
            "So here just a table that is summarizing the pilots from the first phase.",
            "Pan"
        ],
        [
            "Results after the first phase are already available in testing.",
            "The end improvement of the architecture.",
            "There were no major technical problems found for in mapping the business processes and the documents exchange, but the problems were mainly on product identifications since GS One.",
            "Product identification codes are used and some countries, mainly from the text I'm plotting sector, are very reluctant in using that that qualification and for the major problems that were encountered.",
            "War with global product classification.",
            "Can you explain?",
            "So I there isn't for GS adoption for the adoption of this one product identification you mean?",
            "The product identification the the numbers that they assigned to the products.",
            "So the problem with this.",
            "Remember exactly what was the name of that?",
            "The barcodes hectically?",
            "They have a name, but.",
            "So the problem for the the major problems were in the textile clothing sector, becauses in this sector there are many variants of 1 dress are produced and they're based on a seasonal seasonal basis.",
            "So they end up with two many barcodes that they have to adopt and at barcodes cost.",
            "It's not a commodity service.",
            "So the costs are too high for.",
            "I know that in Italy Italian producers are on the production part.",
            "They're really reluctant in using bar codes on the retail part.",
            "It's not a problem, but on the production part, since they change collection 2 times per year and they produce too many too many variants of the same cloth, and that requires a separate barcode, then they're reluctant in adopting that.",
            "Notification in their systems.",
            "Supporting and also the.",
            "RFID as a technical solution because it controls the architecture that you.",
            "Yes, the.",
            "Virus.",
            "Yes, they are using their own qualification system, so it's not so big problem for using some technical also RFID.",
            "But the problem is to base everything.",
            "On GS1 they're using their internal.",
            "Qualification of products that are later mapped to the GS one when they need to communicate with the retailer they're making the mapping, but they are reluctant of using it directly in their information systems.",
            "Anne.",
            "Yeah, it's just some.",
            "OK, here it is here."
        ],
        [
            "Here is the table of the pilots that are running now.",
            "There are 13.",
            "And the.",
            "OK, the conclusions are."
        ],
        [
            "We found them very useful.",
            "The usability of documentation of harmonized documentation of this complex heximer standards that was appreciated by the small and medium companies that are participating in the.",
            "Project and and so this conventional standard based approach are beneficial for small medium companies because they have common common guidance and critical and basic critical mass adopters, but is lacking flexibility and we are getting continuous requests from the companies participating in the project for adding new documents, new processes and.",
            "So."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In their agency for Sustainable Development, which main goal is to support local SMS in their innovation practices?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to present you the project if it's a TCF which is.",
                    "label": 0
                },
                {
                    "sent": "Project caught by the European Commission DG Enterprise.",
                    "label": 1
                },
                {
                    "sent": "It was a tender of the gentle price.",
                    "label": 0
                },
                {
                    "sent": "It's not a research project, and the goal of this project is to facilitate the large scale adoption of the business in the textile, clothing and footwear industries.",
                    "label": 1
                },
                {
                    "sent": "The project started in January 2028 and is going to finish indent of this year.",
                    "label": 0
                },
                {
                    "sent": "Currently there are more than 160 companies and European organizations involved in this project.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Shut down objective of the project is to create a favorable environment for the European textile, clothing and footwear industries.",
                    "label": 1
                },
                {
                    "sent": "That stimulation tables, uptake of ICT, anti business technologies in the sectors.",
                    "label": 1
                },
                {
                    "sent": "There are three main outcomes of the project.",
                    "label": 0
                },
                {
                    "sent": "First is the definition of general architecture for the business, which is compliant to existing specific standard specification, European and international.",
                    "label": 0
                },
                {
                    "sent": "For Vectibix transactions in the textile, clothing and footwear sectors.",
                    "label": 0
                },
                {
                    "sent": "The second outcome of the project is the creation of extensive set of pilots that actual adopt and that harmonized standard specifications created in the general architecture and the third outcome is to create a broader awareness and acceptance by European stakeholders.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these are the project partners.",
                    "label": 0
                },
                {
                    "sent": "There are three main project partners ever attacks, which is the European Association of Textile and clothing industry sector is the European Association on the Footwear industry.",
                    "label": 1
                },
                {
                    "sent": "And then my Institute, which is the technological partner with the construction and then we have more than 160 subcontractors that are implementing the pilot projects in the within.",
                    "label": 0
                },
                {
                    "sent": "The project that come from.",
                    "label": 0
                },
                {
                    "sent": "Actually, more than the countries that are listed here are about 20 European countries and these are end users.",
                    "label": 0
                },
                {
                    "sent": "Companies coming from the three sectors and also their ICT providers and invent.",
                    "label": 0
                },
                {
                    "sent": "We have involved the same like a standardization but in the in the project.",
                    "label": 0
                },
                {
                    "sent": "So the project I would like to.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Outline the methodology followed by the project.",
                    "label": 0
                },
                {
                    "sent": "This is not a research project so there is no research products or innovative products.",
                    "label": 0
                },
                {
                    "sent": "But what is innovative here is the methodology that is followed to stimulate the uptake of standard specifications by the small and medium enterprises in the sector.",
                    "label": 0
                },
                {
                    "sent": "So the methodology is having four parts.",
                    "label": 0
                },
                {
                    "sent": "The first one is analysis for in the first six months of the project we performed an analysis of the state of the art in the adoption of ICT into business solutions by the small to medium companies in in the three sectors.",
                    "label": 0
                },
                {
                    "sent": "As well, we have performed the state of the art analysis on the existing standard specifications and standardization and.",
                    "label": 0
                },
                {
                    "sent": "Other kinds of initiatives.",
                    "label": 0
                },
                {
                    "sent": "So the second part was the definition of what we call business architecture.",
                    "label": 0
                },
                {
                    "sent": "So that architecture has is not ICT architecture, it is just a set of standards documented in a harmonized way that our mapping to various processes and documents exchanging business transactions among active players in the in the three sectors.",
                    "label": 0
                },
                {
                    "sent": "And then we have defined the indications about this, IT infrastructures and the standards that has to be used on the.",
                    "label": 0
                },
                {
                    "sent": "I stand firm in the world levels.",
                    "label": 0
                },
                {
                    "sent": "Then the next step in our methodology is the creation of.",
                    "label": 0
                },
                {
                    "sent": "A set of pilot projects that actually adopted the standard specifications with switching their earpiece systems and their scope is to validate the architecture and to provide feedback for improvements.",
                    "label": 0
                },
                {
                    "sent": "But the ultimate objective is to create large scale impact and best practices.",
                    "label": 1
                },
                {
                    "sent": "Currently there are 13 pilot projects running with more than 130 end users that are adopting the standard specifications.",
                    "label": 0
                },
                {
                    "sent": "And the last part of the project is the creation of the awareness and dissemination through the two European associations.",
                    "label": 0
                },
                {
                    "sent": "So I will present as quick as possible.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The analysis that architecture and the pilot and more more stress on the pilot implementations.",
                    "label": 0
                },
                {
                    "sent": "So the analysis that comes of the analysis was that first there are a large number of European enterprises that are involved in some kind of business activity and they are mainly concentrated in Western and Central Europe.",
                    "label": 1
                },
                {
                    "sent": "But more often the number of electronic transactions exchanges are small.",
                    "label": 1
                },
                {
                    "sent": "There are a small small number of connections and supported functions.",
                    "label": 0
                },
                {
                    "sent": "And the search electronic transactions are limited to one or two large trading partners which demand use of their systems.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So are we also notice that the level of adoption of the business is higher on the downstream part?",
                    "label": 1
                },
                {
                    "sent": "The producer to retailer connections while in the upstream part there are few companies that are using transactions, electronic transactions and downstream systems are more diffused.",
                    "label": 0
                },
                {
                    "sent": "In western central Europe, while southern Europe is preferring the use of such systems on the upstream part of the supply chain.",
                    "label": 1
                },
                {
                    "sent": "And for some obstacles that.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We found out that we business adoption that are, I guess, the standard one that are already listed everywhere but the problem in this sector says that there are many small and medium companies and few leaders cake that can impose a solution standard based solution.",
                    "label": 0
                },
                {
                    "sent": "Then the pursuit meant of Porter, not investment, lack of time and insecure personnel.",
                    "label": 0
                },
                {
                    "sent": "And we found out that many small to medium companies would like to adopt A business solutions, but they're scared of taking any solutions since they're scared that it is not the standard solution and so they waited some more standard based solution appears on the market.",
                    "label": 0
                },
                {
                    "sent": "Now I'm going to present you the.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "E Business architecture that we defined in within the product.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Checked.",
                    "label": 0
                },
                {
                    "sent": "So the objectives of this architecture is to be defined on two key areas, so the first one is production to retail relationship and the second one is for manufacturing networks.",
                    "label": 1
                },
                {
                    "sent": "In fact, during the analysis we found out that there are different requirements in the two parts of the supply chains, mainly in the downstream part, production to retail relationship.",
                    "label": 0
                },
                {
                    "sent": "There is a strong need for normalization between the two sectors.",
                    "label": 0
                },
                {
                    "sent": "And the very small sets of data that has to be exchanged while in the upstream part of manufacturing networks than it is for very specialized sectors in sector dependent information.",
                    "label": 0
                },
                {
                    "sent": "Then the we have decided that the object the architecture should have higher compossible compliance with existing European and international public standards.",
                    "label": 1
                },
                {
                    "sent": "For this sectors and then the purpose of the architecture is to serve like a technical and business reference for the pilot projects.",
                    "label": 0
                },
                {
                    "sent": "In order to achieve interoperability between existing systems and organizations.",
                    "label": 1
                },
                {
                    "sent": "So he.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is a graphical presentation of the of the supply chain.",
                    "label": 0
                },
                {
                    "sent": "We have two separate parts for the textile clothing and footwear industry and upstream part and.",
                    "label": 1
                },
                {
                    "sent": "In the downstream part of the of the supply chain we have provided common downstream specifications of the exchange documents.",
                    "label": 0
                },
                {
                    "sent": "I'm scared.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Toward you don't know if you are interested in the kind of methodology that we followed, but on the architecture level we have defined it on 2 levels on 3 levels.",
                    "label": 0
                },
                {
                    "sent": "Actually business level, middleware level and communication level, and we have specified completely the business level that are it contains actually the specific XML specifications of the business documents that are exchanged between the trading partners in.",
                    "label": 1
                },
                {
                    "sent": "Some set of specific business processes.",
                    "label": 1
                },
                {
                    "sent": "The middleware and the communication level has mainly indications to standards, but there is need for further work on the ICT architecture itself and also on the profiling of existing standards.",
                    "label": 0
                },
                {
                    "sent": "Since the existing standards are too complex and too big for.",
                    "label": 0
                },
                {
                    "sent": "For this sector.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So on the business level, what we did, we didn't harmonize existing standards, but we decided to harmonize the documentation of the standards.",
                    "label": 0
                },
                {
                    "sent": "So we presented the supply chain like set of business processes, its business processes or set of activities, activities, sequence of one way document exchange transactions.",
                    "label": 1
                },
                {
                    "sent": "Each transaction is a triple and then each document is presented by Document Model and then there is a reference to the actual Hicks email schema that implements the document.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, on the downstream here for example, in the downstream part we have three processes.",
                    "label": 0
                },
                {
                    "sent": "We have considered three processes and there are 17 documents exchanged and we are based on external skills that come from standardization projects in like WWS profile.",
                    "label": 0
                },
                {
                    "sent": "Send text with from standard Project segment, show that is reengineering always the same kind of business models and we have creating created.",
                    "label": 0
                },
                {
                    "sent": "Also you blueys profiles that are based always on the same document model.",
                    "label": 0
                },
                {
                    "sent": "So we have syntax independent document model that is mapping to various standards.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Similar process went was done for the textile clotting upstream and the footwear upstream part of the supply chain.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we have also defined the product.",
                    "label": 0
                },
                {
                    "sent": "We haven't defined that actually, we have considered several specifications for product classifications and here the main were not just the major problems for intra interoperability problems.",
                    "label": 0
                },
                {
                    "sent": "So the next part of that?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to illustrate to you are the pilot implementations of this architecture.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are the pilots?",
                    "label": 1
                },
                {
                    "sent": "So these are actually group of companies and users from the three sectors.",
                    "label": 0
                },
                {
                    "sent": "That are organized together to implement the business specifications in their in their information systems and with the scope to test to test the validity of the architecture to test the interoperability of systems and to create the base for large scale adoption and best practices on European level.",
                    "label": 1
                },
                {
                    "sent": "So the the pilots were organized or organized in two phases.",
                    "label": 0
                },
                {
                    "sent": "The first phase was from July to October 2028, contained 5 pilots and their main scope was the testing and validation of the architecture.",
                    "label": 0
                },
                {
                    "sent": "And for the second phase, pilots, now they're running 13 pilots that has an optimal ultimate objective of creating best practices and the setting up the base for large scale adoption on European level.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the first phase of the pilots here we're about 40 car companies were initially involved in the project.",
                    "label": 0
                },
                {
                    "sent": "Actually here are pilots, but from the 1st and the second phase.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And at this moment we are like this, many about 20 countries are participating in the project and more than 130 end users are participating directly in the pilots and there is like other actually not 200 but 300 data like first follow up since their clients of of ICT providers or bigger companies that are participating directly in the project.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So each pilot is organized in this way.",
                    "label": 0
                },
                {
                    "sent": "There is one facilitator company that is coordinating all the project and is.",
                    "label": 1
                },
                {
                    "sent": "He's acting like a subcontractor to the Hibbitts TCF consortium.",
                    "label": 1
                },
                {
                    "sent": "Then we have one or several producers for the downstream pilots there also one or several retailers, and then we have at least one nicety service provider that is implementing the mapping.",
                    "label": 1
                },
                {
                    "sent": "Between the existing systems and the.",
                    "label": 0
                },
                {
                    "sent": "It's architecture.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here just a table that is summarizing the pilots from the first phase.",
                    "label": 0
                },
                {
                    "sent": "Pan",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Results after the first phase are already available in testing.",
                    "label": 0
                },
                {
                    "sent": "The end improvement of the architecture.",
                    "label": 1
                },
                {
                    "sent": "There were no major technical problems found for in mapping the business processes and the documents exchange, but the problems were mainly on product identifications since GS One.",
                    "label": 0
                },
                {
                    "sent": "Product identification codes are used and some countries, mainly from the text I'm plotting sector, are very reluctant in using that that qualification and for the major problems that were encountered.",
                    "label": 1
                },
                {
                    "sent": "War with global product classification.",
                    "label": 0
                },
                {
                    "sent": "Can you explain?",
                    "label": 0
                },
                {
                    "sent": "So I there isn't for GS adoption for the adoption of this one product identification you mean?",
                    "label": 0
                },
                {
                    "sent": "The product identification the the numbers that they assigned to the products.",
                    "label": 0
                },
                {
                    "sent": "So the problem with this.",
                    "label": 0
                },
                {
                    "sent": "Remember exactly what was the name of that?",
                    "label": 0
                },
                {
                    "sent": "The barcodes hectically?",
                    "label": 0
                },
                {
                    "sent": "They have a name, but.",
                    "label": 0
                },
                {
                    "sent": "So the problem for the the major problems were in the textile clothing sector, becauses in this sector there are many variants of 1 dress are produced and they're based on a seasonal seasonal basis.",
                    "label": 0
                },
                {
                    "sent": "So they end up with two many barcodes that they have to adopt and at barcodes cost.",
                    "label": 0
                },
                {
                    "sent": "It's not a commodity service.",
                    "label": 0
                },
                {
                    "sent": "So the costs are too high for.",
                    "label": 0
                },
                {
                    "sent": "I know that in Italy Italian producers are on the production part.",
                    "label": 0
                },
                {
                    "sent": "They're really reluctant in using bar codes on the retail part.",
                    "label": 0
                },
                {
                    "sent": "It's not a problem, but on the production part, since they change collection 2 times per year and they produce too many too many variants of the same cloth, and that requires a separate barcode, then they're reluctant in adopting that.",
                    "label": 0
                },
                {
                    "sent": "Notification in their systems.",
                    "label": 0
                },
                {
                    "sent": "Supporting and also the.",
                    "label": 0
                },
                {
                    "sent": "RFID as a technical solution because it controls the architecture that you.",
                    "label": 0
                },
                {
                    "sent": "Yes, the.",
                    "label": 1
                },
                {
                    "sent": "Virus.",
                    "label": 0
                },
                {
                    "sent": "Yes, they are using their own qualification system, so it's not so big problem for using some technical also RFID.",
                    "label": 0
                },
                {
                    "sent": "But the problem is to base everything.",
                    "label": 0
                },
                {
                    "sent": "On GS1 they're using their internal.",
                    "label": 0
                },
                {
                    "sent": "Qualification of products that are later mapped to the GS one when they need to communicate with the retailer they're making the mapping, but they are reluctant of using it directly in their information systems.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's just some.",
                    "label": 0
                },
                {
                    "sent": "OK, here it is here.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is the table of the pilots that are running now.",
                    "label": 0
                },
                {
                    "sent": "There are 13.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "OK, the conclusions are.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We found them very useful.",
                    "label": 0
                },
                {
                    "sent": "The usability of documentation of harmonized documentation of this complex heximer standards that was appreciated by the small and medium companies that are participating in the.",
                    "label": 1
                },
                {
                    "sent": "Project and and so this conventional standard based approach are beneficial for small medium companies because they have common common guidance and critical and basic critical mass adopters, but is lacking flexibility and we are getting continuous requests from the companies participating in the project for adding new documents, new processes and.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        }
    }
}