{
    "id": "oh65mt66odnhyqwir77vicjsxhuxaln2",
    "title": "Exploring Europe’s Asset: Critical Concepts for the Future Internet",
    "info": {
        "author": [
            "Geert Lovink, Institute of Network Cultures"
        ],
        "published": "April 16, 2008",
        "recorded": "March 2008",
        "category": [
            "Top->Computer Science->Internet, World Wide Web"
        ]
    },
    "url": "http://videolectures.net/foi08_lovink_eea/",
    "segmentation": [
        [
            "Thanks so much for inviting me.",
            "I'm probably one of the few here who has a background or speaks on behalf of the Arts and humanities.",
            "Let's say that creative.",
            "Sector and.",
            "I'm also a non technical person or non commercial as well so I'm very pleased that I can present you here with some of my projects and proposals for the future of the Internet.",
            "'cause I think the arts and humanities have come of age and it's I think it's very important for those who make decisions.",
            "Those who implement the technologies to understand that there is a new.",
            "Digital native generation in this sector that needs to be seen that needs to be identified.",
            "And this."
        ],
        [
            "This has not happened as of yet.",
            "The sector, specially if you look at the new media arts sector.",
            "Has the tendency to become a bit of a ghetto, whereas SoC speeds ahead and we need to do something about this.",
            "We need that humanities 2.0 in which these scholars, these artists designers really.",
            "I put at the forefront of the developments and this is my message that I have here today.",
            "Yeah, we've seen these kinds of.",
            "Chronologies it's important, I think, to see that in the work that I've been involved in also had a lot of the kind of different aspects in the different phases that we were in.",
            "I've been involved in Internet culture approximately since the late 1980s, then done a lot of public access work also in Continental East European countries.",
            "Also been involved in a lot of European projects to kind of critique the techno libertarian bias agenda coming from California.",
            "To deconstruct the kind of subculture from from there and develop a European continental European agenda to debt the same.",
            "Yeah, then I probably switched more to research and.",
            "I've tried my bit with books like that dark fiber and my first recession and also my latest book 0 comments to kind of deconstruct the.com mania to fully understand because there is a real problem here that we have to work in real time now.",
            "What is criticism?",
            "What is researching this?",
            "Field if you have to do it in real time and also develop an agenda for the future, because I think this is what the arts and creative people want to do.",
            "They do not only want to comment or make some interface at the very end of the process.",
            "Now we want to be involved."
        ],
        [
            "To define the very notions that we worked with and since I am came back from Australia, having spent five years there, I have been in a position to build up my own research space.",
            "It's very small, it's in the Amsterdam Polytechnic together with the Amsterdam University.",
            "And here we set up an agenda to build kind of sustainable networks of artists, creative people.",
            "And intellectuals, critics around emerging topics.",
            "This is really important.",
            "Where where we find out how we can build distributed networks.",
            "Around here I start somehow started with a more historical approach to look back at the first 10 years of web design the web designers have gone through all the different phases.",
            "It's really quite remarkable.",
            "It's in the Meanwhile it's it's in a profession that hasn't really established yet, however.",
            "You mentioned that the you know the usability interface is such a problem.",
            "Well, if you look at this profession, it's in fact quite precarious.",
            "Position of web designers, even though it's quite important seeing as pivotal in the communication too many people, the economic position of these people are is quite uncertain, in fact, and the more there are of course the prices drop and so on.",
            "You can imagine, yeah.",
            "Urban screens after I find that are really interesting.",
            "Area where we have set up a research network where we see how very large streams in public areas start to communicate with the very small screens on our mobile phones and artists are doing very interesting experimental work in this field.",
            "Did an overriding may be termed as you might have heard in creative industries, the creative industries people would say that they have already included all of you in their agenda.",
            "Now I don't know if that's really the way to go, but anyway, there is a dialogue happening.",
            "Or maybe it should happen between these agendas.",
            "Usually of urban planners and.",
            "Educational people and this my creativity project has brought together critical researchers from all over the world who are looking into these so-called creative industries.",
            "Because all people in ICT design and so on from now on, working in this creative industries.",
            "Whether you like it or not, so that's a bit, you know, it's up to debate, really, I think.",
            "And the latest project on just going through it quickly is the phenomenal rise of online video video platforms.",
            "And this is another project that started in Brussels, then moved to Amsterdam this January and the next one will be held in Ankara and then split.",
            "There's an enormous dimension here.",
            "It's called video Vortex responses to YouTube and it looks at how artists curators how creative people are using these technologies.",
            "But also how how we collaborate with the geeks and programmers to develop alternative platforms.",
            "How do we deal with these?",
            "Amazing licenses that Google presents us with when we use YouTube artists have to sign away all their rights.",
            "Many people think that that's not really acceptable, so we really need to work in my view, on a long term economy.",
            "Here if I would sum up these topics an is it is really a challenge and I think it's the task of EU and EU research.",
            "To develop the platforms for this sustainable economy.",
            "Internet economy.",
            "Because the artists are really needed at the moment, they can only live under the American promise.",
            "You have to give everything away for free and in all the conferences we hear it time and again.",
            "Artists know you cannot make a living, you have to give all the content away for free.",
            "There is no model.",
            "Sorry, I don't think that this is a real sustainable model, but it's really up to you.",
            "The communities that gather here please think about this.",
            "Pick up the ideas maybe from the early 90s again about micro payments and rethink.",
            "You know this idea that everything has to be given away for free artists and creative people.",
            "They are very sensitive to intellectual property rights.",
            "They don't want to be part of these corporate structures, they support creative comments and so on.",
            "But they also have to make a living.",
            "And we are completely in a deadlock situation at the moment and this really cry."
        ],
        [
            "For fundamental research in this area so that over the next decade this problem will have to be solved.",
            "Because we cannot say on the one hand, creatives have to be involved.",
            "But then on the other hand say, but you know sorry, you just have to get your mcjob and then maybe in the evening do the work for us for free.",
            "This is no longer a sustainable model.",
            "App I have through all these projects I've been kind of developing a lot of these critical concepts that I see that.",
            "Maybe come together in a term like net criticism or Internet criticism.",
            "I think it's a great European tradition that we should somehow stick to or start to develop an Internet really deserves it.",
            "Now it has grown up as a medium we can no longer just say it's new and then deconstruct the new.",
            "Now we have to take it very very seriously and so far in media studies departments and so on in research agendas.",
            "There's very, very little space for this, but nonetheless this is what the new generation wants.",
            "You know, they come to me, they ask where is the book?",
            "Where is the really literature that we are going to use to study YouTube and then I said sorry there is nothing like that.",
            "You are going to write this, yeah, and but of course this is not the right answer."
        ],
        [
            "This should not be the case.",
            "So this is kind of in general what my agenda is.",
            "I think we have to take these new humanities more serious and move on beyond what I call the East syndrome humanity.",
            "So far have really been associated too much with cultural heritage with the past, and this also often accounts for culture and.",
            "The arts in general.",
            "We have to understand that we have to reverse this motor and I'm very motivated and with me many, many others to do this.",
            "So I would really urge you to stop the cultural heritage programs and invest this money in future heritage in future concepts.",
            "This is very, very important and I have to say that the European young people they are ready for this they are absolutely ready.",
            "To take this up."
        ],
        [
            "Um?",
            "And this is what I'm trying to do with all this work together with many many others in these distributed networks is to establish covered that code, a culture of critical anticipation at the the concept that we are here.",
            "Here.",
            "They are often not questions, you know.",
            "What do we?",
            "What do you mean when you say the word open?",
            "What do you mean with free?",
            "Do you mean freedom?",
            "In what context?",
            "So that we need to really?",
            "Take these.",
            "Concepts of parts discuss them up course we have talked about what is free and open in the SoC of controlling society that is more and more dominated.",
            "Much being.",
            "Anyway aside control.",
            "Good gentle reminder removing or this."
        ],
        [
            "Is the last, but yeah, so this is this is just a few of the topics that my center will be focusing on.",
            "Very much interested in direct collaboration with those of you who are working in the field of search engine search engines.",
            "Do something that is absolutely crucial when it comes to knowledge production arts.",
            "The same with multilingualism.",
            "Multilingualism is moving to the arts in the cultures.",
            "Hasn't really been kind of a technological problem and I've seen it in a lot of your descriptions here, but you have to remind that.",
            "Artists and the cultural sector in general in Europe is moving in that direction too.",
            "And.",
            "To sum up, I would like to say that we will try together with you and the technical community, create tools and this course is for critical and innovative research culture and with this I mean kind of digital methods that have grown out of the Internet itself so that we stop to apply the Internet to existing disciplines.",
            "Thank you very much.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thanks so much for inviting me.",
                    "label": 0
                },
                {
                    "sent": "I'm probably one of the few here who has a background or speaks on behalf of the Arts and humanities.",
                    "label": 0
                },
                {
                    "sent": "Let's say that creative.",
                    "label": 0
                },
                {
                    "sent": "Sector and.",
                    "label": 0
                },
                {
                    "sent": "I'm also a non technical person or non commercial as well so I'm very pleased that I can present you here with some of my projects and proposals for the future of the Internet.",
                    "label": 1
                },
                {
                    "sent": "'cause I think the arts and humanities have come of age and it's I think it's very important for those who make decisions.",
                    "label": 0
                },
                {
                    "sent": "Those who implement the technologies to understand that there is a new.",
                    "label": 0
                },
                {
                    "sent": "Digital native generation in this sector that needs to be seen that needs to be identified.",
                    "label": 0
                },
                {
                    "sent": "And this.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This has not happened as of yet.",
                    "label": 0
                },
                {
                    "sent": "The sector, specially if you look at the new media arts sector.",
                    "label": 0
                },
                {
                    "sent": "Has the tendency to become a bit of a ghetto, whereas SoC speeds ahead and we need to do something about this.",
                    "label": 0
                },
                {
                    "sent": "We need that humanities 2.0 in which these scholars, these artists designers really.",
                    "label": 0
                },
                {
                    "sent": "I put at the forefront of the developments and this is my message that I have here today.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we've seen these kinds of.",
                    "label": 0
                },
                {
                    "sent": "Chronologies it's important, I think, to see that in the work that I've been involved in also had a lot of the kind of different aspects in the different phases that we were in.",
                    "label": 0
                },
                {
                    "sent": "I've been involved in Internet culture approximately since the late 1980s, then done a lot of public access work also in Continental East European countries.",
                    "label": 0
                },
                {
                    "sent": "Also been involved in a lot of European projects to kind of critique the techno libertarian bias agenda coming from California.",
                    "label": 0
                },
                {
                    "sent": "To deconstruct the kind of subculture from from there and develop a European continental European agenda to debt the same.",
                    "label": 0
                },
                {
                    "sent": "Yeah, then I probably switched more to research and.",
                    "label": 0
                },
                {
                    "sent": "I've tried my bit with books like that dark fiber and my first recession and also my latest book 0 comments to kind of deconstruct the.com mania to fully understand because there is a real problem here that we have to work in real time now.",
                    "label": 0
                },
                {
                    "sent": "What is criticism?",
                    "label": 0
                },
                {
                    "sent": "What is researching this?",
                    "label": 0
                },
                {
                    "sent": "Field if you have to do it in real time and also develop an agenda for the future, because I think this is what the arts and creative people want to do.",
                    "label": 0
                },
                {
                    "sent": "They do not only want to comment or make some interface at the very end of the process.",
                    "label": 0
                },
                {
                    "sent": "Now we want to be involved.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To define the very notions that we worked with and since I am came back from Australia, having spent five years there, I have been in a position to build up my own research space.",
                    "label": 0
                },
                {
                    "sent": "It's very small, it's in the Amsterdam Polytechnic together with the Amsterdam University.",
                    "label": 0
                },
                {
                    "sent": "And here we set up an agenda to build kind of sustainable networks of artists, creative people.",
                    "label": 0
                },
                {
                    "sent": "And intellectuals, critics around emerging topics.",
                    "label": 0
                },
                {
                    "sent": "This is really important.",
                    "label": 0
                },
                {
                    "sent": "Where where we find out how we can build distributed networks.",
                    "label": 0
                },
                {
                    "sent": "Around here I start somehow started with a more historical approach to look back at the first 10 years of web design the web designers have gone through all the different phases.",
                    "label": 0
                },
                {
                    "sent": "It's really quite remarkable.",
                    "label": 0
                },
                {
                    "sent": "It's in the Meanwhile it's it's in a profession that hasn't really established yet, however.",
                    "label": 0
                },
                {
                    "sent": "You mentioned that the you know the usability interface is such a problem.",
                    "label": 0
                },
                {
                    "sent": "Well, if you look at this profession, it's in fact quite precarious.",
                    "label": 0
                },
                {
                    "sent": "Position of web designers, even though it's quite important seeing as pivotal in the communication too many people, the economic position of these people are is quite uncertain, in fact, and the more there are of course the prices drop and so on.",
                    "label": 0
                },
                {
                    "sent": "You can imagine, yeah.",
                    "label": 0
                },
                {
                    "sent": "Urban screens after I find that are really interesting.",
                    "label": 0
                },
                {
                    "sent": "Area where we have set up a research network where we see how very large streams in public areas start to communicate with the very small screens on our mobile phones and artists are doing very interesting experimental work in this field.",
                    "label": 0
                },
                {
                    "sent": "Did an overriding may be termed as you might have heard in creative industries, the creative industries people would say that they have already included all of you in their agenda.",
                    "label": 0
                },
                {
                    "sent": "Now I don't know if that's really the way to go, but anyway, there is a dialogue happening.",
                    "label": 0
                },
                {
                    "sent": "Or maybe it should happen between these agendas.",
                    "label": 0
                },
                {
                    "sent": "Usually of urban planners and.",
                    "label": 0
                },
                {
                    "sent": "Educational people and this my creativity project has brought together critical researchers from all over the world who are looking into these so-called creative industries.",
                    "label": 0
                },
                {
                    "sent": "Because all people in ICT design and so on from now on, working in this creative industries.",
                    "label": 0
                },
                {
                    "sent": "Whether you like it or not, so that's a bit, you know, it's up to debate, really, I think.",
                    "label": 0
                },
                {
                    "sent": "And the latest project on just going through it quickly is the phenomenal rise of online video video platforms.",
                    "label": 0
                },
                {
                    "sent": "And this is another project that started in Brussels, then moved to Amsterdam this January and the next one will be held in Ankara and then split.",
                    "label": 0
                },
                {
                    "sent": "There's an enormous dimension here.",
                    "label": 0
                },
                {
                    "sent": "It's called video Vortex responses to YouTube and it looks at how artists curators how creative people are using these technologies.",
                    "label": 1
                },
                {
                    "sent": "But also how how we collaborate with the geeks and programmers to develop alternative platforms.",
                    "label": 0
                },
                {
                    "sent": "How do we deal with these?",
                    "label": 0
                },
                {
                    "sent": "Amazing licenses that Google presents us with when we use YouTube artists have to sign away all their rights.",
                    "label": 0
                },
                {
                    "sent": "Many people think that that's not really acceptable, so we really need to work in my view, on a long term economy.",
                    "label": 0
                },
                {
                    "sent": "Here if I would sum up these topics an is it is really a challenge and I think it's the task of EU and EU research.",
                    "label": 0
                },
                {
                    "sent": "To develop the platforms for this sustainable economy.",
                    "label": 0
                },
                {
                    "sent": "Internet economy.",
                    "label": 0
                },
                {
                    "sent": "Because the artists are really needed at the moment, they can only live under the American promise.",
                    "label": 0
                },
                {
                    "sent": "You have to give everything away for free and in all the conferences we hear it time and again.",
                    "label": 0
                },
                {
                    "sent": "Artists know you cannot make a living, you have to give all the content away for free.",
                    "label": 0
                },
                {
                    "sent": "There is no model.",
                    "label": 0
                },
                {
                    "sent": "Sorry, I don't think that this is a real sustainable model, but it's really up to you.",
                    "label": 0
                },
                {
                    "sent": "The communities that gather here please think about this.",
                    "label": 0
                },
                {
                    "sent": "Pick up the ideas maybe from the early 90s again about micro payments and rethink.",
                    "label": 0
                },
                {
                    "sent": "You know this idea that everything has to be given away for free artists and creative people.",
                    "label": 0
                },
                {
                    "sent": "They are very sensitive to intellectual property rights.",
                    "label": 0
                },
                {
                    "sent": "They don't want to be part of these corporate structures, they support creative comments and so on.",
                    "label": 0
                },
                {
                    "sent": "But they also have to make a living.",
                    "label": 0
                },
                {
                    "sent": "And we are completely in a deadlock situation at the moment and this really cry.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For fundamental research in this area so that over the next decade this problem will have to be solved.",
                    "label": 0
                },
                {
                    "sent": "Because we cannot say on the one hand, creatives have to be involved.",
                    "label": 0
                },
                {
                    "sent": "But then on the other hand say, but you know sorry, you just have to get your mcjob and then maybe in the evening do the work for us for free.",
                    "label": 0
                },
                {
                    "sent": "This is no longer a sustainable model.",
                    "label": 0
                },
                {
                    "sent": "App I have through all these projects I've been kind of developing a lot of these critical concepts that I see that.",
                    "label": 0
                },
                {
                    "sent": "Maybe come together in a term like net criticism or Internet criticism.",
                    "label": 0
                },
                {
                    "sent": "I think it's a great European tradition that we should somehow stick to or start to develop an Internet really deserves it.",
                    "label": 0
                },
                {
                    "sent": "Now it has grown up as a medium we can no longer just say it's new and then deconstruct the new.",
                    "label": 0
                },
                {
                    "sent": "Now we have to take it very very seriously and so far in media studies departments and so on in research agendas.",
                    "label": 0
                },
                {
                    "sent": "There's very, very little space for this, but nonetheless this is what the new generation wants.",
                    "label": 0
                },
                {
                    "sent": "You know, they come to me, they ask where is the book?",
                    "label": 0
                },
                {
                    "sent": "Where is the really literature that we are going to use to study YouTube and then I said sorry there is nothing like that.",
                    "label": 0
                },
                {
                    "sent": "You are going to write this, yeah, and but of course this is not the right answer.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This should not be the case.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of in general what my agenda is.",
                    "label": 0
                },
                {
                    "sent": "I think we have to take these new humanities more serious and move on beyond what I call the East syndrome humanity.",
                    "label": 0
                },
                {
                    "sent": "So far have really been associated too much with cultural heritage with the past, and this also often accounts for culture and.",
                    "label": 0
                },
                {
                    "sent": "The arts in general.",
                    "label": 0
                },
                {
                    "sent": "We have to understand that we have to reverse this motor and I'm very motivated and with me many, many others to do this.",
                    "label": 0
                },
                {
                    "sent": "So I would really urge you to stop the cultural heritage programs and invest this money in future heritage in future concepts.",
                    "label": 0
                },
                {
                    "sent": "This is very, very important and I have to say that the European young people they are ready for this they are absolutely ready.",
                    "label": 0
                },
                {
                    "sent": "To take this up.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And this is what I'm trying to do with all this work together with many many others in these distributed networks is to establish covered that code, a culture of critical anticipation at the the concept that we are here.",
                    "label": 1
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "They are often not questions, you know.",
                    "label": 0
                },
                {
                    "sent": "What do we?",
                    "label": 0
                },
                {
                    "sent": "What do you mean when you say the word open?",
                    "label": 0
                },
                {
                    "sent": "What do you mean with free?",
                    "label": 0
                },
                {
                    "sent": "Do you mean freedom?",
                    "label": 0
                },
                {
                    "sent": "In what context?",
                    "label": 0
                },
                {
                    "sent": "So that we need to really?",
                    "label": 0
                },
                {
                    "sent": "Take these.",
                    "label": 0
                },
                {
                    "sent": "Concepts of parts discuss them up course we have talked about what is free and open in the SoC of controlling society that is more and more dominated.",
                    "label": 0
                },
                {
                    "sent": "Much being.",
                    "label": 0
                },
                {
                    "sent": "Anyway aside control.",
                    "label": 0
                },
                {
                    "sent": "Good gentle reminder removing or this.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is the last, but yeah, so this is this is just a few of the topics that my center will be focusing on.",
                    "label": 0
                },
                {
                    "sent": "Very much interested in direct collaboration with those of you who are working in the field of search engine search engines.",
                    "label": 0
                },
                {
                    "sent": "Do something that is absolutely crucial when it comes to knowledge production arts.",
                    "label": 0
                },
                {
                    "sent": "The same with multilingualism.",
                    "label": 0
                },
                {
                    "sent": "Multilingualism is moving to the arts in the cultures.",
                    "label": 1
                },
                {
                    "sent": "Hasn't really been kind of a technological problem and I've seen it in a lot of your descriptions here, but you have to remind that.",
                    "label": 0
                },
                {
                    "sent": "Artists and the cultural sector in general in Europe is moving in that direction too.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "To sum up, I would like to say that we will try together with you and the technical community, create tools and this course is for critical and innovative research culture and with this I mean kind of digital methods that have grown out of the Internet itself so that we stop to apply the Internet to existing disciplines.",
                    "label": 1
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}