{
    "id": "ohoysrfseo3xbfleerezt2yzojbn5vyc",
    "title": "Deconvolution of Networks into Communities",
    "info": {
        "author": [
            "Jure Leskovec, Computer Science Department, Stanford University"
        ],
        "published": "Sept. 27, 2013",
        "recorded": "August 2013",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/kdd2013_leskovec_online_communities/",
    "segmentation": [
        [
            "So let me tell you about our work on network communities and the way we call this.",
            "We call this the convolution of networks into communities.",
            "Why I'm using this word deconvolution?",
            "It will become clear in a second, right?"
        ],
        [
            "So what is my goal?",
            "My goal is to try to find communities in a network, right?",
            "So given a network, this is a picture of online socialnetworkopinions.com.",
            "If you visualize this networks, this is how they look like.",
            "Technically they are called furballs, right kind of no structure whatsoever, and my goal is as I said, I want to find communities.",
            "The question is what is a community?",
            "The way I will define this I will use what is called the functional functional definition, right?",
            "So I want to find a set of nodes that has a common function role or.",
            "Property right there is something latent about the nodes that I will extract that I will call a community that they have in common.",
            "This may be a social group if I have a biological network, this may be a functional module, and so on, right?",
            "So this is what I would really like to do.",
            "I would like to somehow extract sets of nodes that have something in common."
        ],
        [
            "And the question is of course, can I use the unlabeled graph structure or labeled graph structure if you like to identify this this communities?",
            "So what you want to do now is to say, OK, what is the structural signature of Community so that I can then define define an algorithm that will go and search the network for such a structure and return me a set of nodes with that particular connectivity pattern.",
            "So if I want to do that, then the next thing I need to ask is you know how and why do communities form right?",
            "What is what is their structural signature and basically?",
            "If you go back into the literature and think about how like what do we know theoretically about why communities forum, you basically get back to the work of Mark Granovetter on the strength of weak ties, right?",
            "And he was saying basically he classified ties into strong and weak and there are two types of classification.",
            "One is whether ties kind of, let's say personally strong right are we?",
            "Are we really good friends or are we kind of distant friends?",
            "And then there is also this structural notion of strength, which is what role does this type play in the network?",
            "And what Granovetter found is that basically strong ties are well embedded, right?",
            "So people to whom I have strong ties there is many.",
            "We have many friends in common, so this this strong ties are well embedded in the network and then this long ties or the weak ties.",
            "I have very few friends in common with my kind of weak or long range friends, right?",
            "So this kind of suggests that we should think of networks like this, right?",
            "I have these clusters of strong ties and then I have this week ties spanning the clusters, right?",
            "And this is really a prototypical picture when we think about how to identify network communities, right?",
            "We're thinking about.",
            "Mean cuts and densities and things like that, right?",
            "So now, if this is kind of my view of how the network is and how the communities are, the question is how do I go and now find these kinds of things."
        ],
        [
            "Right, and if you think about metrics based on like algorithms based on modularity, things based on between the centrality graph partitioning methods and so on.",
            "They're basically all based on this idea, right?",
            "So the idea is I want to find sets of nodes that are internally well connected to each other and have relatively few links to the rest of the network, right?",
            "So if I kind of ask myself what's the assumption I'm making about the network structure?",
            "Here is what I mean by that right?",
            "So just I have I have to pictures there?",
            "One is kind of how the graph looks like right or what?",
            "Sumption about the graph I'm making and the other one is there.",
            "What's the structure of the adjacency matrix that I'm thinking of right?",
            "I have two clusters and then I have a few a few edges between the two clusters, right?",
            "So that's kind of community detection."
        ],
        [
            "Point out.",
            "So now the question is, what if these communities start to overlap right?",
            "What do I do then?",
            "What how should I think about overlapping clusters?",
            "What I mean by overlapping clusters?",
            "I really mean when a single person is a member of multiple communities or multiple clusters."
        ],
        [
            "Right and what is interesting here?",
            "And this is a bit unexpected if you actually go and think and apply the strength of weak ties theory or intuition and you apply it to overlapping communities, you find that the edge probability between a pair of nodes will actually decrease as a function with the number of shared communities.",
            "OK, so let me let me show you pictorially what this means, right?",
            "So what this means is if I have a network where two groups overlap, then the probability of a connection between those two red nodes that are in the overlap of my two groups.",
            "Will actually be lower than the probability of connection of people that are in individual communities, right?",
            "So really, the assumption that I'm making about the structure of Community overlaps is something like this, right?",
            "Is that here when the two of my groups overlap the density of connections is actually lower than inside the groups, right?",
            "And the question is right?",
            "Is this?",
            "Is this valid assumption or not?",
            "Is this how groups overlap so that's what I want to test.",
            "So now is this is this assumption about the structure of the network that would come from the strength of weak ties?",
            "Is this something that is?"
        ],
        [
            "Added So what we did here is also another thing that is that is important.",
            "Then is that basically whenever kind of when you do Community detection.",
            "One problem is that you usually usually have no ground truth, right?",
            "It's very hard to kind of evaluate your methods in supervised way if you like, right?",
            "So what we did is we identified a number of networks where we have the network structure plus the communities explicitly labeled OK. And let me tell you what these networks are right?",
            "So for example in online social networks people joined two groups right?",
            "So these groups.",
            "You can use them as proxies for ground truth communities, right?",
            "So for example, in live Journal, Friendster, Orkut, and YouTube, we use these groups as as notions of pre labeled ground truth communities that we would like to discover from the graph structure.",
            "There are two more networks where you can use notions of ground truth.",
            "One, you can use this DLP, which is a collection which is basically you create a collaboration network between scientists.",
            "And then if you say, what do I expect communities in.",
            "Collaboration network of scientists to respond to that would my expectation would be that corresponds to scientific areas, and so on, right?",
            "So I can hear I can use labels of conferences.",
            "Such journals are some kind of surrogates for heavily overlapping communities.",
            "Of course, these labels are not perfect, but they're better than anything we had before, which is kind of no labels at all, right?",
            "And the last network where we have these kinds of labels is Amazon product code purchasing network.",
            "So here nodes are products to products are connected.",
            "If they are commonly called purchased and now you can use product classification.",
            "Basically the hierarchy of the product as labels for these communities.",
            "What is nice in this network is that every node here explicitly states what are the communities they belong to and they can belong to as many communities as they want.",
            "And all this data we actually are making it available.",
            "So for people who do Community detection this should be a very valuable resource.",
            "OK, so now what is nice?",
            "I have a network and I have labeled communities so now I go back to my original question which was how is this?",
            "Assumption from the previous slide.",
            "Is it valid so?"
        ],
        [
            "Here is the basic thing to ask.",
            "I have a pair of people they share K communities.",
            "The question is how does the probability of an edge between a pair change with the number of communities they share, right?",
            "And if you do this measurement So what this graph show X axis is the number of communities we have in common and the Y axis is probability that we are connected.",
            "What you see is this increase in the probability of connection given the number of groups we share and the other thing you can see, these probabilities are actually quite high.",
            "They go to point.",
            "Two and and in terms of the social network they go to point 7.8 right?",
            "These networks are like our super sparse meaning.",
            "The baseline probability of an edge here is like 10 to the minus five, right?",
            "So as soon as you share one or two groups in common, the probability of a connection kind of increases.",
            "For four orders of magnitude in the end, right?",
            "So so the effect of this is is super strong, right?",
            "So kind of everything makes sense.",
            "So far, the more groups we share, the more likely we are connected."
        ],
        [
            "What this basically tells me if now I take this graph and think about it, what is really tells me that the way I should really think about communities I should think of them in this kind of way, right?",
            "So if I have two groups overlapping, then the density of the edges here in the overlap is higher than in the non overlapping parts of the communities.",
            "Or if I think of the about adjacency matrix POV, if I have two groups and they overlap here in the center when there is the overlap, there is more edges, there is more stuff there than in the non overlapping parts of the communities.",
            "Right, and this is really kind of conceptually what the idea that I want to to kind of make emphasize here is that the way the way this tells you one should think about communities, we should think of them as styles, right?",
            "That you have this overlapping tiles and then the thickness of the tiles correspond to the density of the edges, right?",
            "So if I have more tiles overlapping in some part of the network, the density of the edges there will be thicker right?",
            "Because more tiles overlap, right?",
            "This is kind of what this is saying.",
            "What is maybe?"
        ],
        [
            "Interesting is that if you now go and think about this, how do I think of communities as styles?",
            "This is very different from what has been assumed or what Granovetter was telling you and is actually have to go even like 1010 years before granulator to the work of symbol on the web of group group affiliations where he actually talks about this kind of structure of communities and how the overlap gets densely connected, right?",
            "So kind of everything is still consistent with social science, just you have to go 15 years.",
            "Sooner, right?",
            "The other thing that is interesting is the is the connection of.",
            "This is back to the homophily right?",
            "Homophily is a force in social networks where the idea is that basically people that share latent attributes, they are more likely to be connected right?",
            "And so far we thought of homophily networks as if it operates in pockets, right?",
            "Kind of from Granulator view.",
            "It says here is a pocket of homophily and here's a pocket of homophily, right?",
            "What this view tells you is that we should really think of the way the homophily operates in networks.",
            "In kind of in multiple dimensions, right?",
            "And if I have two two groups that overlap, then kind of the homophily in the overlap is even higher than in the non overlapping parts, right?",
            "So kind of the homophily or the similarity is not is not just along a single dimension but along multiple dimensions."
        ],
        [
            "Alright, so The thing is, for example, if you look at what the most well known community detection methods they're making this assumption without realizing it, right?",
            "So for example, clique, percolation method for people who know makes this assumption link clustering.",
            "Another method makes this assumption even mixed membership stochastic block models make this assumption.",
            "So this assumption has been made kind of implicitly and what we did was we actually went back to this algorithms and thought hard of them.",
            "And what turns out is that they're basically making these assumptions.",
            "So if you would run them.",
            "On networks that densely that on networks where communities overlap the way I'll tell you, they would give you wrong results, right?",
            "For example, so clique percolation it would either take the two overlapping clusters and think of them as one cluster, or it would identify the overlap as a separate cluster, right?",
            "Sure you could say oh, and then I post process and so on, but still it would give you a wrong result, mixed membership, stochastic block model will also naturally give you a wrong result.",
            "The reason for that is because it will identify this overlap as a separate cluster, because what mixed membership is really doing.",
            "It's basically averaging together contributions from multiple clusters, right?",
            "And it's hard to say that edge probability of an average is always at least or at most the highest than the edge probability of a single cluster, so also mixed memberships will detect things wrong under this kind of community overlaps and also link clustering.",
            "That's harder to see.",
            "So basically what I'm trying to say is that this this assumption has been implicitly made without a serializing it.",
            "And the way the way we come to that was, we made this first observation with increasing probability of connection.",
            "Then we went back to the algorithms and we were kind of very surprised that this is kind of this assumption is made without realization, right?",
            "So now if basically these methods work well where the probability of a connection decreases with the number of community have in common.",
            "But real communities overlap in a way that actually that probability increases.",
            "The point is you need a new method in a new way.",
            "How to think about this?"
        ],
        [
            "Right, so just to be very explicit, this is what overlapping community detection.",
            "Large majority of them is are assuming today about the structure of community overlaps.",
            "This is what comes out from the data and also makes kind of total sense in the in the hindsight, right that overlaps are more densely connected."
        ],
        [
            "So now the question is what Samantha that allows me to pull these communities apart if they overlap in this kind of in this kind of way and the way the way we do this is, I will now define generative model that I will call affiliation, graph model and then I will show you how to fit this model to the data to be able to separate out these communities and that's why I also called this convolution right?",
            "Because it's really kind of a summation of all small parts of overlapping communities that gives rise to the global network structure.",
            "So the way my model works is the following is an example of an affiliation network model, which is something at least worked on.",
            "And other people before, but the idea is the following, right?",
            "So we have the nodes of the network and I have communities on the top and every node can belong to a community.",
            "So if a node belongs to community then it's connected to the Community belongs to and I will also assume that every community has a single parameter P. OK and the simple assumption is the generative model that we will apply.",
            "Here is the following for every pair of nodes.",
            "I will ask what is the community you have in common and we will flip a coin according to that probability and that will create a connection right?",
            "So the green nodes here have community in common so they get one coin flip and.",
            "It's a piece of and that's the coin flip bias piece of a blue notes have been commuting common so they get one flip coin flip, but these notes here they have two communities in common, both A&B, so they get two coin flips right?",
            "And we will connect them if at least one of these two coin flips says yes.",
            "So very naturally I will get overlapping communities.",
            "What is nice about this model?",
            "This is a variation also of the affiliation network model by La Conciencia Kumar and you can show that this model for example is able to generate your power law degree distributions and basically is able to model the large scale structure of networks well.",
            "Another way how to think about this model.",
            "It's basically nothing else in the Union of error shreni graphs, right?",
            "So each of these guys defines an airdash rainy graph, and here are here's the union of those two errors or any graphs, OK?"
        ],
        [
            "So now what I showed you is basically if I give you this affiliation graph how to generate communities or how to generate networks where the Community community overlaps will be realistic and you can get realistic degree distributions, diameters and things like that.",
            "OK, so now this is the first."
        ],
        [
            "What is nice about this model is that it's very expressive, right?",
            "So I can basically expressing it any kind of Community structure I want, right?",
            "So if I want non overlapping communities, kind of the old style granulator type communities here is how the affiliation network would look like right?",
            "So I have community a.",
            "There are people who are members of community A. I have Community B and these are the people who are in the community.",
            "But if I want to overlapping I just showed you right?",
            "I can have people that are members of multiple communities and I get the overlap and if I want hierarchically nested communities, that's also easy.",
            "I just made this mother community that, let's say everyone is a member of right?",
            "So I can very easily express any combination of these of these kinds of structures very naturally in this model."
        ],
        [
            "So now, really, given the given the affiliation network I can generate, I know how to generate a realistic graph, But what I would really like to do is I would like to go the other way right.",
            "So given a graph, I would like to figure out what is the model and if I'm able to figure out the model.",
            "Then I'm basically doing community detection because for every node I infer what communities they belong to.",
            "OK, So what do I mean by what do I need to infer?",
            "I need to infer this bipartite affiliation network.",
            "I need to infer the number of communities, the number of square nodes, and I need to infer the density parameter.",
            "Of every community.",
            "So this Pizza Bay or PC.",
            "So the the parameter of the Community.",
            "The thing is, yes we can.",
            "We can do that."
        ],
        [
            "Here is 1 simple way that that you can do and it scales to around 5000 nodes.",
            "But we also have methods to up to 5 million nodes right now.",
            "OK so basically all you do is you can write everything down as a simple maximum likelihood optimization problem where you say I want to find the model that best explains the structure of my network.",
            "The way we solve this is that basically we're using a version of coordinate Ascent where we are iterating between two step.",
            "The first step is stochastic search over the affiliation graph, right?",
            "That's kind of a combinatorial object, so we have to use stochastic search.",
            "And the other nice thing is if you keep the affiliation graphics, then finding the optimal parameters for communities is actually a convex optimization problem.",
            "So we can solve that very quickly.",
            "So we're iterating back and forth between these two steps and we can scale this to like 5000 nodes.",
            "As I said, we also have a different fitting procedure that can go up to 5 million."
        ],
        [
            "So here is.",
            "Here is an example of how our method works.",
            "So what I'm showing you here is this is a Facebook network of one of my students and we I ask the student to go and label every one of his friends ahead of time what community they belong to and the student labeled his friends into four communities.",
            "Basically his high school friends, his summer internship friends, and then two communities of Stanford Friends, one whom with whom the student plays basketball and the other one he play squash with.",
            "Right and then so those were the ground truth labels.",
            "Then I also took the unlabeled network.",
            "We applied our algorithm, it decided to find 4 communities.",
            "Here they are and what you see is that basically what I show you here is black nodes are the ones where we correctly identified the membership of the of that node to the community and empty nodes are.",
            "Are our mistakes what you find is that we basically perfectly identified the overlaps.",
            "What you find is that overall our accuracy in assigning nodes to communities here is 94%."
        ],
        [
            "We also applied this, given that now we have ground truths.",
            "Do you want a question or pocket good?",
            "So the other thing is, this works really well.",
            "So using our ground truth communities, this is the how much let's say improvement we get on different networks over different based over different current method."
        ],
        [
            "We also use this using another evaluation that was done using metadata of nodes and also here our performance is really good."
        ],
        [
            "We also applied this to biological network and then use gene ontology to measure the value.",
            "The log P value of the terms and here we dwarf basically everyone and so on.",
            "So the method works really."
        ],
        [
            "But really, what I want to tell you at the end is kind of up trying to abstract up and really say what do we learn right and one problem when working with networks is basically when we visualize them.",
            "They kind of look like this right?",
            "They don't see any clusters.",
            "We just see this kind of furballs where everything is sticking out from the center right and the question is, is this real or our visualization algorithms bad?",
            "What's going on right and the way how to understand this kind of structure?",
            "You can think of it as a core periphery structure that I have.",
            "I have a core here and I have some.",
            "Free around it.",
            "So the question is, how do I reconcile these two views of kind of this core periphery structure where I think of a network as one huge mess versus having clusters and communities and."
        ],
        [
            "So right and the way to think about the core periphery here is just a conceptual picture, right?",
            "I have this kind of I can think of this as as as as if the network is kind of getting denser and denser as I move to the center of the network.",
            "I have a few right.",
            "I have sparsely connected periphery and then the thing gets denser and denser and the question is you know how does this relate to the explanation about communities?",
            "I just gave you right?",
            "And if communities were to overlap in this kind of way and given this idea that communities actor styles then I could be able actually able to explain.",
            "Why this structure emerges, right?",
            "So if I have communities overlap in this kind of way, then here in the center where most communities overlap I will see the most edges, right?",
            "So kind of without Community labels my networks will look like this kind of mess that gets denser and denser as I move towards the center.",
            "But if I overlay the communities, the reason for for seeing such a network structure is because communities overlap in this kind of flower pattern.",
            "If you like and one way how you can test if this hypothesis."
        ],
        [
            "It is true you can.",
            "You can do the following.",
            "You measure what sociologists call farmers centrality.",
            "So it's the average shortest path length of a note to any other node in the network, right?",
            "So if your path length is slow, it means you are in the center of the network.",
            "If it's high, it means you are on the edge of the network.",
            "And then the Y axis.",
            "Here I show you the number of community memberships that the node belongs to and what you find is that the nodes that belong into the center of the network they have higher average number of communities they belong to.",
            "So basically this picture that I showed you on the previous slide is a good way how to understand how the global network structure emerges from this overlapping overlapping clusters or communities.",
            "So globally networks look as having this kind of core periphery structure and that kind of comes up because of this.",
            "Community overlaps"
        ],
        [
            "What is interesting is that then you can actually also go and say try to better understand this core periphery structure.",
            "So what you can do is for example in this plot I'm showing you I will only keep the nodes that belong to at least X communities and on the YX on the Y axis I show you what is the largest connected component size of this graph and what this what this tells me is that for example if the if the plot is flat.",
            "This tells me that there is one single primary core.",
            "There is a primary code in the network.",
            "While for example, for PPI, an product based networks, I basically see that I get my connected component size drops very quickly, which tells me that the network has many local cores and actually for two of these network."
        ],
        [
            "We were able to visualize them.",
            "For example, food, net food networks.",
            "This is how the single primary core networks look like, right?",
            "So basically I have these communities overlapping with each other, so this is the result of our algorithm and you can see kind of the mess here in the center where pretty much everything overlaps.",
            "But then for example if you apply these things to PPI networks, here is how PPI communities overlap, right?",
            "So we get lots of these kind of local cores with this with one major core where the density is of edges is high.",
            "Where multiple communities overlap.",
            "So with that basically what I wanted to say is that you find primary course in like food webs, web graphs and social networks and then PPI networks and product networks tend to have more local cores centered around."
        ],
        [
            "Different things, so with that I'm done.",
            "The data and the code for our stuff is on our website and I'll be very happy to take questions."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me tell you about our work on network communities and the way we call this.",
                    "label": 0
                },
                {
                    "sent": "We call this the convolution of networks into communities.",
                    "label": 0
                },
                {
                    "sent": "Why I'm using this word deconvolution?",
                    "label": 0
                },
                {
                    "sent": "It will become clear in a second, right?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is my goal?",
                    "label": 0
                },
                {
                    "sent": "My goal is to try to find communities in a network, right?",
                    "label": 0
                },
                {
                    "sent": "So given a network, this is a picture of online socialnetworkopinions.com.",
                    "label": 1
                },
                {
                    "sent": "If you visualize this networks, this is how they look like.",
                    "label": 0
                },
                {
                    "sent": "Technically they are called furballs, right kind of no structure whatsoever, and my goal is as I said, I want to find communities.",
                    "label": 0
                },
                {
                    "sent": "The question is what is a community?",
                    "label": 0
                },
                {
                    "sent": "The way I will define this I will use what is called the functional functional definition, right?",
                    "label": 0
                },
                {
                    "sent": "So I want to find a set of nodes that has a common function role or.",
                    "label": 1
                },
                {
                    "sent": "Property right there is something latent about the nodes that I will extract that I will call a community that they have in common.",
                    "label": 0
                },
                {
                    "sent": "This may be a social group if I have a biological network, this may be a functional module, and so on, right?",
                    "label": 0
                },
                {
                    "sent": "So this is what I would really like to do.",
                    "label": 0
                },
                {
                    "sent": "I would like to somehow extract sets of nodes that have something in common.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the question is of course, can I use the unlabeled graph structure or labeled graph structure if you like to identify this this communities?",
                    "label": 0
                },
                {
                    "sent": "So what you want to do now is to say, OK, what is the structural signature of Community so that I can then define define an algorithm that will go and search the network for such a structure and return me a set of nodes with that particular connectivity pattern.",
                    "label": 0
                },
                {
                    "sent": "So if I want to do that, then the next thing I need to ask is you know how and why do communities form right?",
                    "label": 1
                },
                {
                    "sent": "What is what is their structural signature and basically?",
                    "label": 0
                },
                {
                    "sent": "If you go back into the literature and think about how like what do we know theoretically about why communities forum, you basically get back to the work of Mark Granovetter on the strength of weak ties, right?",
                    "label": 0
                },
                {
                    "sent": "And he was saying basically he classified ties into strong and weak and there are two types of classification.",
                    "label": 0
                },
                {
                    "sent": "One is whether ties kind of, let's say personally strong right are we?",
                    "label": 0
                },
                {
                    "sent": "Are we really good friends or are we kind of distant friends?",
                    "label": 0
                },
                {
                    "sent": "And then there is also this structural notion of strength, which is what role does this type play in the network?",
                    "label": 0
                },
                {
                    "sent": "And what Granovetter found is that basically strong ties are well embedded, right?",
                    "label": 0
                },
                {
                    "sent": "So people to whom I have strong ties there is many.",
                    "label": 1
                },
                {
                    "sent": "We have many friends in common, so this this strong ties are well embedded in the network and then this long ties or the weak ties.",
                    "label": 0
                },
                {
                    "sent": "I have very few friends in common with my kind of weak or long range friends, right?",
                    "label": 0
                },
                {
                    "sent": "So this kind of suggests that we should think of networks like this, right?",
                    "label": 0
                },
                {
                    "sent": "I have these clusters of strong ties and then I have this week ties spanning the clusters, right?",
                    "label": 0
                },
                {
                    "sent": "And this is really a prototypical picture when we think about how to identify network communities, right?",
                    "label": 0
                },
                {
                    "sent": "We're thinking about.",
                    "label": 0
                },
                {
                    "sent": "Mean cuts and densities and things like that, right?",
                    "label": 0
                },
                {
                    "sent": "So now, if this is kind of my view of how the network is and how the communities are, the question is how do I go and now find these kinds of things.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, and if you think about metrics based on like algorithms based on modularity, things based on between the centrality graph partitioning methods and so on.",
                    "label": 0
                },
                {
                    "sent": "They're basically all based on this idea, right?",
                    "label": 1
                },
                {
                    "sent": "So the idea is I want to find sets of nodes that are internally well connected to each other and have relatively few links to the rest of the network, right?",
                    "label": 0
                },
                {
                    "sent": "So if I kind of ask myself what's the assumption I'm making about the network structure?",
                    "label": 0
                },
                {
                    "sent": "Here is what I mean by that right?",
                    "label": 0
                },
                {
                    "sent": "So just I have I have to pictures there?",
                    "label": 0
                },
                {
                    "sent": "One is kind of how the graph looks like right or what?",
                    "label": 0
                },
                {
                    "sent": "Sumption about the graph I'm making and the other one is there.",
                    "label": 0
                },
                {
                    "sent": "What's the structure of the adjacency matrix that I'm thinking of right?",
                    "label": 0
                },
                {
                    "sent": "I have two clusters and then I have a few a few edges between the two clusters, right?",
                    "label": 0
                },
                {
                    "sent": "So that's kind of community detection.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Point out.",
                    "label": 0
                },
                {
                    "sent": "So now the question is, what if these communities start to overlap right?",
                    "label": 0
                },
                {
                    "sent": "What do I do then?",
                    "label": 0
                },
                {
                    "sent": "What how should I think about overlapping clusters?",
                    "label": 1
                },
                {
                    "sent": "What I mean by overlapping clusters?",
                    "label": 0
                },
                {
                    "sent": "I really mean when a single person is a member of multiple communities or multiple clusters.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right and what is interesting here?",
                    "label": 0
                },
                {
                    "sent": "And this is a bit unexpected if you actually go and think and apply the strength of weak ties theory or intuition and you apply it to overlapping communities, you find that the edge probability between a pair of nodes will actually decrease as a function with the number of shared communities.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me let me show you pictorially what this means, right?",
                    "label": 0
                },
                {
                    "sent": "So what this means is if I have a network where two groups overlap, then the probability of a connection between those two red nodes that are in the overlap of my two groups.",
                    "label": 0
                },
                {
                    "sent": "Will actually be lower than the probability of connection of people that are in individual communities, right?",
                    "label": 0
                },
                {
                    "sent": "So really, the assumption that I'm making about the structure of Community overlaps is something like this, right?",
                    "label": 0
                },
                {
                    "sent": "Is that here when the two of my groups overlap the density of connections is actually lower than inside the groups, right?",
                    "label": 0
                },
                {
                    "sent": "And the question is right?",
                    "label": 0
                },
                {
                    "sent": "Is this?",
                    "label": 0
                },
                {
                    "sent": "Is this valid assumption or not?",
                    "label": 0
                },
                {
                    "sent": "Is this how groups overlap so that's what I want to test.",
                    "label": 0
                },
                {
                    "sent": "So now is this is this assumption about the structure of the network that would come from the strength of weak ties?",
                    "label": 1
                },
                {
                    "sent": "Is this something that is?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Added So what we did here is also another thing that is that is important.",
                    "label": 0
                },
                {
                    "sent": "Then is that basically whenever kind of when you do Community detection.",
                    "label": 0
                },
                {
                    "sent": "One problem is that you usually usually have no ground truth, right?",
                    "label": 0
                },
                {
                    "sent": "It's very hard to kind of evaluate your methods in supervised way if you like, right?",
                    "label": 0
                },
                {
                    "sent": "So what we did is we identified a number of networks where we have the network structure plus the communities explicitly labeled OK. And let me tell you what these networks are right?",
                    "label": 0
                },
                {
                    "sent": "So for example in online social networks people joined two groups right?",
                    "label": 0
                },
                {
                    "sent": "So these groups.",
                    "label": 0
                },
                {
                    "sent": "You can use them as proxies for ground truth communities, right?",
                    "label": 0
                },
                {
                    "sent": "So for example, in live Journal, Friendster, Orkut, and YouTube, we use these groups as as notions of pre labeled ground truth communities that we would like to discover from the graph structure.",
                    "label": 0
                },
                {
                    "sent": "There are two more networks where you can use notions of ground truth.",
                    "label": 0
                },
                {
                    "sent": "One, you can use this DLP, which is a collection which is basically you create a collaboration network between scientists.",
                    "label": 0
                },
                {
                    "sent": "And then if you say, what do I expect communities in.",
                    "label": 0
                },
                {
                    "sent": "Collaboration network of scientists to respond to that would my expectation would be that corresponds to scientific areas, and so on, right?",
                    "label": 0
                },
                {
                    "sent": "So I can hear I can use labels of conferences.",
                    "label": 0
                },
                {
                    "sent": "Such journals are some kind of surrogates for heavily overlapping communities.",
                    "label": 0
                },
                {
                    "sent": "Of course, these labels are not perfect, but they're better than anything we had before, which is kind of no labels at all, right?",
                    "label": 0
                },
                {
                    "sent": "And the last network where we have these kinds of labels is Amazon product code purchasing network.",
                    "label": 0
                },
                {
                    "sent": "So here nodes are products to products are connected.",
                    "label": 0
                },
                {
                    "sent": "If they are commonly called purchased and now you can use product classification.",
                    "label": 0
                },
                {
                    "sent": "Basically the hierarchy of the product as labels for these communities.",
                    "label": 0
                },
                {
                    "sent": "What is nice in this network is that every node here explicitly states what are the communities they belong to and they can belong to as many communities as they want.",
                    "label": 0
                },
                {
                    "sent": "And all this data we actually are making it available.",
                    "label": 0
                },
                {
                    "sent": "So for people who do Community detection this should be a very valuable resource.",
                    "label": 0
                },
                {
                    "sent": "OK, so now what is nice?",
                    "label": 0
                },
                {
                    "sent": "I have a network and I have labeled communities so now I go back to my original question which was how is this?",
                    "label": 0
                },
                {
                    "sent": "Assumption from the previous slide.",
                    "label": 0
                },
                {
                    "sent": "Is it valid so?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is the basic thing to ask.",
                    "label": 0
                },
                {
                    "sent": "I have a pair of people they share K communities.",
                    "label": 1
                },
                {
                    "sent": "The question is how does the probability of an edge between a pair change with the number of communities they share, right?",
                    "label": 0
                },
                {
                    "sent": "And if you do this measurement So what this graph show X axis is the number of communities we have in common and the Y axis is probability that we are connected.",
                    "label": 0
                },
                {
                    "sent": "What you see is this increase in the probability of connection given the number of groups we share and the other thing you can see, these probabilities are actually quite high.",
                    "label": 0
                },
                {
                    "sent": "They go to point.",
                    "label": 0
                },
                {
                    "sent": "Two and and in terms of the social network they go to point 7.8 right?",
                    "label": 0
                },
                {
                    "sent": "These networks are like our super sparse meaning.",
                    "label": 0
                },
                {
                    "sent": "The baseline probability of an edge here is like 10 to the minus five, right?",
                    "label": 0
                },
                {
                    "sent": "So as soon as you share one or two groups in common, the probability of a connection kind of increases.",
                    "label": 0
                },
                {
                    "sent": "For four orders of magnitude in the end, right?",
                    "label": 0
                },
                {
                    "sent": "So so the effect of this is is super strong, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of everything makes sense.",
                    "label": 0
                },
                {
                    "sent": "So far, the more groups we share, the more likely we are connected.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What this basically tells me if now I take this graph and think about it, what is really tells me that the way I should really think about communities I should think of them in this kind of way, right?",
                    "label": 0
                },
                {
                    "sent": "So if I have two groups overlapping, then the density of the edges here in the overlap is higher than in the non overlapping parts of the communities.",
                    "label": 1
                },
                {
                    "sent": "Or if I think of the about adjacency matrix POV, if I have two groups and they overlap here in the center when there is the overlap, there is more edges, there is more stuff there than in the non overlapping parts of the communities.",
                    "label": 0
                },
                {
                    "sent": "Right, and this is really kind of conceptually what the idea that I want to to kind of make emphasize here is that the way the way this tells you one should think about communities, we should think of them as styles, right?",
                    "label": 0
                },
                {
                    "sent": "That you have this overlapping tiles and then the thickness of the tiles correspond to the density of the edges, right?",
                    "label": 0
                },
                {
                    "sent": "So if I have more tiles overlapping in some part of the network, the density of the edges there will be thicker right?",
                    "label": 0
                },
                {
                    "sent": "Because more tiles overlap, right?",
                    "label": 0
                },
                {
                    "sent": "This is kind of what this is saying.",
                    "label": 0
                },
                {
                    "sent": "What is maybe?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Interesting is that if you now go and think about this, how do I think of communities as styles?",
                    "label": 0
                },
                {
                    "sent": "This is very different from what has been assumed or what Granovetter was telling you and is actually have to go even like 1010 years before granulator to the work of symbol on the web of group group affiliations where he actually talks about this kind of structure of communities and how the overlap gets densely connected, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of everything is still consistent with social science, just you have to go 15 years.",
                    "label": 0
                },
                {
                    "sent": "Sooner, right?",
                    "label": 0
                },
                {
                    "sent": "The other thing that is interesting is the is the connection of.",
                    "label": 1
                },
                {
                    "sent": "This is back to the homophily right?",
                    "label": 0
                },
                {
                    "sent": "Homophily is a force in social networks where the idea is that basically people that share latent attributes, they are more likely to be connected right?",
                    "label": 0
                },
                {
                    "sent": "And so far we thought of homophily networks as if it operates in pockets, right?",
                    "label": 1
                },
                {
                    "sent": "Kind of from Granulator view.",
                    "label": 0
                },
                {
                    "sent": "It says here is a pocket of homophily and here's a pocket of homophily, right?",
                    "label": 0
                },
                {
                    "sent": "What this view tells you is that we should really think of the way the homophily operates in networks.",
                    "label": 0
                },
                {
                    "sent": "In kind of in multiple dimensions, right?",
                    "label": 0
                },
                {
                    "sent": "And if I have two two groups that overlap, then kind of the homophily in the overlap is even higher than in the non overlapping parts, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of the homophily or the similarity is not is not just along a single dimension but along multiple dimensions.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so The thing is, for example, if you look at what the most well known community detection methods they're making this assumption without realizing it, right?",
                    "label": 0
                },
                {
                    "sent": "So for example, clique, percolation method for people who know makes this assumption link clustering.",
                    "label": 1
                },
                {
                    "sent": "Another method makes this assumption even mixed membership stochastic block models make this assumption.",
                    "label": 1
                },
                {
                    "sent": "So this assumption has been made kind of implicitly and what we did was we actually went back to this algorithms and thought hard of them.",
                    "label": 0
                },
                {
                    "sent": "And what turns out is that they're basically making these assumptions.",
                    "label": 0
                },
                {
                    "sent": "So if you would run them.",
                    "label": 0
                },
                {
                    "sent": "On networks that densely that on networks where communities overlap the way I'll tell you, they would give you wrong results, right?",
                    "label": 0
                },
                {
                    "sent": "For example, so clique percolation it would either take the two overlapping clusters and think of them as one cluster, or it would identify the overlap as a separate cluster, right?",
                    "label": 0
                },
                {
                    "sent": "Sure you could say oh, and then I post process and so on, but still it would give you a wrong result, mixed membership, stochastic block model will also naturally give you a wrong result.",
                    "label": 0
                },
                {
                    "sent": "The reason for that is because it will identify this overlap as a separate cluster, because what mixed membership is really doing.",
                    "label": 0
                },
                {
                    "sent": "It's basically averaging together contributions from multiple clusters, right?",
                    "label": 0
                },
                {
                    "sent": "And it's hard to say that edge probability of an average is always at least or at most the highest than the edge probability of a single cluster, so also mixed memberships will detect things wrong under this kind of community overlaps and also link clustering.",
                    "label": 0
                },
                {
                    "sent": "That's harder to see.",
                    "label": 0
                },
                {
                    "sent": "So basically what I'm trying to say is that this this assumption has been implicitly made without a serializing it.",
                    "label": 0
                },
                {
                    "sent": "And the way the way we come to that was, we made this first observation with increasing probability of connection.",
                    "label": 0
                },
                {
                    "sent": "Then we went back to the algorithms and we were kind of very surprised that this is kind of this assumption is made without realization, right?",
                    "label": 0
                },
                {
                    "sent": "So now if basically these methods work well where the probability of a connection decreases with the number of community have in common.",
                    "label": 0
                },
                {
                    "sent": "But real communities overlap in a way that actually that probability increases.",
                    "label": 0
                },
                {
                    "sent": "The point is you need a new method in a new way.",
                    "label": 0
                },
                {
                    "sent": "How to think about this?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so just to be very explicit, this is what overlapping community detection.",
                    "label": 0
                },
                {
                    "sent": "Large majority of them is are assuming today about the structure of community overlaps.",
                    "label": 0
                },
                {
                    "sent": "This is what comes out from the data and also makes kind of total sense in the in the hindsight, right that overlaps are more densely connected.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now the question is what Samantha that allows me to pull these communities apart if they overlap in this kind of in this kind of way and the way the way we do this is, I will now define generative model that I will call affiliation, graph model and then I will show you how to fit this model to the data to be able to separate out these communities and that's why I also called this convolution right?",
                    "label": 0
                },
                {
                    "sent": "Because it's really kind of a summation of all small parts of overlapping communities that gives rise to the global network structure.",
                    "label": 0
                },
                {
                    "sent": "So the way my model works is the following is an example of an affiliation network model, which is something at least worked on.",
                    "label": 0
                },
                {
                    "sent": "And other people before, but the idea is the following, right?",
                    "label": 1
                },
                {
                    "sent": "So we have the nodes of the network and I have communities on the top and every node can belong to a community.",
                    "label": 0
                },
                {
                    "sent": "So if a node belongs to community then it's connected to the Community belongs to and I will also assume that every community has a single parameter P. OK and the simple assumption is the generative model that we will apply.",
                    "label": 0
                },
                {
                    "sent": "Here is the following for every pair of nodes.",
                    "label": 0
                },
                {
                    "sent": "I will ask what is the community you have in common and we will flip a coin according to that probability and that will create a connection right?",
                    "label": 0
                },
                {
                    "sent": "So the green nodes here have community in common so they get one coin flip and.",
                    "label": 0
                },
                {
                    "sent": "It's a piece of and that's the coin flip bias piece of a blue notes have been commuting common so they get one flip coin flip, but these notes here they have two communities in common, both A&B, so they get two coin flips right?",
                    "label": 0
                },
                {
                    "sent": "And we will connect them if at least one of these two coin flips says yes.",
                    "label": 0
                },
                {
                    "sent": "So very naturally I will get overlapping communities.",
                    "label": 0
                },
                {
                    "sent": "What is nice about this model?",
                    "label": 0
                },
                {
                    "sent": "This is a variation also of the affiliation network model by La Conciencia Kumar and you can show that this model for example is able to generate your power law degree distributions and basically is able to model the large scale structure of networks well.",
                    "label": 1
                },
                {
                    "sent": "Another way how to think about this model.",
                    "label": 0
                },
                {
                    "sent": "It's basically nothing else in the Union of error shreni graphs, right?",
                    "label": 0
                },
                {
                    "sent": "So each of these guys defines an airdash rainy graph, and here are here's the union of those two errors or any graphs, OK?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now what I showed you is basically if I give you this affiliation graph how to generate communities or how to generate networks where the Community community overlaps will be realistic and you can get realistic degree distributions, diameters and things like that.",
                    "label": 0
                },
                {
                    "sent": "OK, so now this is the first.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is nice about this model is that it's very expressive, right?",
                    "label": 0
                },
                {
                    "sent": "So I can basically expressing it any kind of Community structure I want, right?",
                    "label": 1
                },
                {
                    "sent": "So if I want non overlapping communities, kind of the old style granulator type communities here is how the affiliation network would look like right?",
                    "label": 0
                },
                {
                    "sent": "So I have community a.",
                    "label": 0
                },
                {
                    "sent": "There are people who are members of community A. I have Community B and these are the people who are in the community.",
                    "label": 0
                },
                {
                    "sent": "But if I want to overlapping I just showed you right?",
                    "label": 0
                },
                {
                    "sent": "I can have people that are members of multiple communities and I get the overlap and if I want hierarchically nested communities, that's also easy.",
                    "label": 0
                },
                {
                    "sent": "I just made this mother community that, let's say everyone is a member of right?",
                    "label": 0
                },
                {
                    "sent": "So I can very easily express any combination of these of these kinds of structures very naturally in this model.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now, really, given the given the affiliation network I can generate, I know how to generate a realistic graph, But what I would really like to do is I would like to go the other way right.",
                    "label": 0
                },
                {
                    "sent": "So given a graph, I would like to figure out what is the model and if I'm able to figure out the model.",
                    "label": 1
                },
                {
                    "sent": "Then I'm basically doing community detection because for every node I infer what communities they belong to.",
                    "label": 0
                },
                {
                    "sent": "OK, So what do I mean by what do I need to infer?",
                    "label": 0
                },
                {
                    "sent": "I need to infer this bipartite affiliation network.",
                    "label": 1
                },
                {
                    "sent": "I need to infer the number of communities, the number of square nodes, and I need to infer the density parameter.",
                    "label": 0
                },
                {
                    "sent": "Of every community.",
                    "label": 0
                },
                {
                    "sent": "So this Pizza Bay or PC.",
                    "label": 0
                },
                {
                    "sent": "So the the parameter of the Community.",
                    "label": 0
                },
                {
                    "sent": "The thing is, yes we can.",
                    "label": 1
                },
                {
                    "sent": "We can do that.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is 1 simple way that that you can do and it scales to around 5000 nodes.",
                    "label": 0
                },
                {
                    "sent": "But we also have methods to up to 5 million nodes right now.",
                    "label": 0
                },
                {
                    "sent": "OK so basically all you do is you can write everything down as a simple maximum likelihood optimization problem where you say I want to find the model that best explains the structure of my network.",
                    "label": 0
                },
                {
                    "sent": "The way we solve this is that basically we're using a version of coordinate Ascent where we are iterating between two step.",
                    "label": 1
                },
                {
                    "sent": "The first step is stochastic search over the affiliation graph, right?",
                    "label": 1
                },
                {
                    "sent": "That's kind of a combinatorial object, so we have to use stochastic search.",
                    "label": 0
                },
                {
                    "sent": "And the other nice thing is if you keep the affiliation graphics, then finding the optimal parameters for communities is actually a convex optimization problem.",
                    "label": 0
                },
                {
                    "sent": "So we can solve that very quickly.",
                    "label": 0
                },
                {
                    "sent": "So we're iterating back and forth between these two steps and we can scale this to like 5000 nodes.",
                    "label": 0
                },
                {
                    "sent": "As I said, we also have a different fitting procedure that can go up to 5 million.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is.",
                    "label": 0
                },
                {
                    "sent": "Here is an example of how our method works.",
                    "label": 0
                },
                {
                    "sent": "So what I'm showing you here is this is a Facebook network of one of my students and we I ask the student to go and label every one of his friends ahead of time what community they belong to and the student labeled his friends into four communities.",
                    "label": 0
                },
                {
                    "sent": "Basically his high school friends, his summer internship friends, and then two communities of Stanford Friends, one whom with whom the student plays basketball and the other one he play squash with.",
                    "label": 0
                },
                {
                    "sent": "Right and then so those were the ground truth labels.",
                    "label": 0
                },
                {
                    "sent": "Then I also took the unlabeled network.",
                    "label": 0
                },
                {
                    "sent": "We applied our algorithm, it decided to find 4 communities.",
                    "label": 0
                },
                {
                    "sent": "Here they are and what you see is that basically what I show you here is black nodes are the ones where we correctly identified the membership of the of that node to the community and empty nodes are.",
                    "label": 0
                },
                {
                    "sent": "Are our mistakes what you find is that we basically perfectly identified the overlaps.",
                    "label": 0
                },
                {
                    "sent": "What you find is that overall our accuracy in assigning nodes to communities here is 94%.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also applied this, given that now we have ground truths.",
                    "label": 0
                },
                {
                    "sent": "Do you want a question or pocket good?",
                    "label": 0
                },
                {
                    "sent": "So the other thing is, this works really well.",
                    "label": 0
                },
                {
                    "sent": "So using our ground truth communities, this is the how much let's say improvement we get on different networks over different based over different current method.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also use this using another evaluation that was done using metadata of nodes and also here our performance is really good.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also applied this to biological network and then use gene ontology to measure the value.",
                    "label": 0
                },
                {
                    "sent": "The log P value of the terms and here we dwarf basically everyone and so on.",
                    "label": 0
                },
                {
                    "sent": "So the method works really.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But really, what I want to tell you at the end is kind of up trying to abstract up and really say what do we learn right and one problem when working with networks is basically when we visualize them.",
                    "label": 0
                },
                {
                    "sent": "They kind of look like this right?",
                    "label": 0
                },
                {
                    "sent": "They don't see any clusters.",
                    "label": 0
                },
                {
                    "sent": "We just see this kind of furballs where everything is sticking out from the center right and the question is, is this real or our visualization algorithms bad?",
                    "label": 0
                },
                {
                    "sent": "What's going on right and the way how to understand this kind of structure?",
                    "label": 0
                },
                {
                    "sent": "You can think of it as a core periphery structure that I have.",
                    "label": 0
                },
                {
                    "sent": "I have a core here and I have some.",
                    "label": 0
                },
                {
                    "sent": "Free around it.",
                    "label": 0
                },
                {
                    "sent": "So the question is, how do I reconcile these two views of kind of this core periphery structure where I think of a network as one huge mess versus having clusters and communities and.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So right and the way to think about the core periphery here is just a conceptual picture, right?",
                    "label": 0
                },
                {
                    "sent": "I have this kind of I can think of this as as as as if the network is kind of getting denser and denser as I move to the center of the network.",
                    "label": 0
                },
                {
                    "sent": "I have a few right.",
                    "label": 0
                },
                {
                    "sent": "I have sparsely connected periphery and then the thing gets denser and denser and the question is you know how does this relate to the explanation about communities?",
                    "label": 0
                },
                {
                    "sent": "I just gave you right?",
                    "label": 0
                },
                {
                    "sent": "And if communities were to overlap in this kind of way and given this idea that communities actor styles then I could be able actually able to explain.",
                    "label": 0
                },
                {
                    "sent": "Why this structure emerges, right?",
                    "label": 0
                },
                {
                    "sent": "So if I have communities overlap in this kind of way, then here in the center where most communities overlap I will see the most edges, right?",
                    "label": 0
                },
                {
                    "sent": "So kind of without Community labels my networks will look like this kind of mess that gets denser and denser as I move towards the center.",
                    "label": 0
                },
                {
                    "sent": "But if I overlay the communities, the reason for for seeing such a network structure is because communities overlap in this kind of flower pattern.",
                    "label": 0
                },
                {
                    "sent": "If you like and one way how you can test if this hypothesis.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is true you can.",
                    "label": 0
                },
                {
                    "sent": "You can do the following.",
                    "label": 0
                },
                {
                    "sent": "You measure what sociologists call farmers centrality.",
                    "label": 0
                },
                {
                    "sent": "So it's the average shortest path length of a note to any other node in the network, right?",
                    "label": 0
                },
                {
                    "sent": "So if your path length is slow, it means you are in the center of the network.",
                    "label": 0
                },
                {
                    "sent": "If it's high, it means you are on the edge of the network.",
                    "label": 0
                },
                {
                    "sent": "And then the Y axis.",
                    "label": 0
                },
                {
                    "sent": "Here I show you the number of community memberships that the node belongs to and what you find is that the nodes that belong into the center of the network they have higher average number of communities they belong to.",
                    "label": 0
                },
                {
                    "sent": "So basically this picture that I showed you on the previous slide is a good way how to understand how the global network structure emerges from this overlapping overlapping clusters or communities.",
                    "label": 0
                },
                {
                    "sent": "So globally networks look as having this kind of core periphery structure and that kind of comes up because of this.",
                    "label": 0
                },
                {
                    "sent": "Community overlaps",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is interesting is that then you can actually also go and say try to better understand this core periphery structure.",
                    "label": 0
                },
                {
                    "sent": "So what you can do is for example in this plot I'm showing you I will only keep the nodes that belong to at least X communities and on the YX on the Y axis I show you what is the largest connected component size of this graph and what this what this tells me is that for example if the if the plot is flat.",
                    "label": 0
                },
                {
                    "sent": "This tells me that there is one single primary core.",
                    "label": 1
                },
                {
                    "sent": "There is a primary code in the network.",
                    "label": 0
                },
                {
                    "sent": "While for example, for PPI, an product based networks, I basically see that I get my connected component size drops very quickly, which tells me that the network has many local cores and actually for two of these network.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We were able to visualize them.",
                    "label": 0
                },
                {
                    "sent": "For example, food, net food networks.",
                    "label": 0
                },
                {
                    "sent": "This is how the single primary core networks look like, right?",
                    "label": 1
                },
                {
                    "sent": "So basically I have these communities overlapping with each other, so this is the result of our algorithm and you can see kind of the mess here in the center where pretty much everything overlaps.",
                    "label": 0
                },
                {
                    "sent": "But then for example if you apply these things to PPI networks, here is how PPI communities overlap, right?",
                    "label": 0
                },
                {
                    "sent": "So we get lots of these kind of local cores with this with one major core where the density is of edges is high.",
                    "label": 0
                },
                {
                    "sent": "Where multiple communities overlap.",
                    "label": 0
                },
                {
                    "sent": "So with that basically what I wanted to say is that you find primary course in like food webs, web graphs and social networks and then PPI networks and product networks tend to have more local cores centered around.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different things, so with that I'm done.",
                    "label": 0
                },
                {
                    "sent": "The data and the code for our stuff is on our website and I'll be very happy to take questions.",
                    "label": 0
                }
            ]
        }
    }
}