{
    "id": "ojhc7pylko7st4z5hkmqd55yziww5m3k",
    "title": "PVC basic concepts & typologies",
    "info": {
        "author": [
            "Servane Crave, France Telecom Research"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "September 2006",
        "category": [
            "Top->Business->Virtual Enterprises"
        ]
    },
    "url": "http://videolectures.net/ess06_crave_pbct/",
    "segmentation": [
        [
            "Talk about professional virtual communities.",
            "7 club graduated at the Eco Superior.",
            "The question from Paris.",
            "And is currently working as a researcher in France Telecom Orange Resistant Development Center.",
            "Yes, taking part in several projects on usages of ICT on small and medium sized enterprise market.",
            "She has been responsible for experiencing new services from for France Telecom Research and development based on homemade new technologies and new standards.",
            "She has also collaborated with American universities and European consulting companies.",
            "On the study of evolution of interfirm relationships.",
            "Since the end of 2004, she has been responsible for research access.",
            "On new forms of interpersonal relationships, she is now leaving a larger insert access, entitled Transformation of the services delivery.",
            "Which is one of the four research access in the newly created services science microfold directly connected to the France Telecom Research and Development Scientific Board.",
            "She's involved in the equity project.",
            "Related to.",
            "Professional virtual communities.",
            "I'm business suits.",
            "For instance, the different definition of the value network of accolade.",
            "Welcome, thank you.",
            "Thank you honey.",
            "Good morning everybody.",
            "I had a challenge when I arrived here.",
            "It was to convince you of the reality of professional virtual communities, but since Wednesday Ave Challenge is to be able to do this presentation with my broken voice.",
            "So I hope I will be able to manage it and please feel free to ask questions.",
            "This way I will speak less would be good.",
            "So just a precision because on prosthetic Camerons alot of people believe that orange has booked posticum because one my name now is arranged, but actually the fact is that it's fine.",
            "Silica Newburgh Tour and UK seven years ago, so it was just a precision because I've been asked about about this.",
            "So what are professional communities so?"
        ],
        [
            "Professional virtual communities are seen as key driver for innovation and cooperation in collaborative networked organizations.",
            "This concept is strongly supported by the European Commission and for many reasons one of the reason is the aging of the population which may prevent transfer or knowledge from people who retire too young generation.",
            "Another reason can also be the flexibility that you find due to globalization of the market and which forces companies to use people for short period of time and not for their whole life and not for their life.",
            "So the outline of my presentation will be."
        ],
        [
            "As photo first, I think it was interesting to provide you with some definitions and case studies about communities, virtual communities, and Community of practice, and then to introduce the concept of PVC inequalities in the second part of my presentation I will give you the principle and also the challenges of professional virtual communities and after a short conclusion I would like to have a discussion with you on a way to.",
            "Evaluate as a propensity of PC to create successful collaboration and this discussion is related to the paper represented at provi on Tuesday morning.",
            "So maybe some of you have already read or similar presentation, but it's just a short discussion at the end of my presentation."
        ],
        [
            "So is.",
            "I like."
        ],
        [
            "This definition of Bender in 1982, which is about what is a community.",
            "It's before the Internet, So what he emphasizes it's that it's a limited number of people in a somewhat restricted social space or network which are held together by shared understandings and also a sense of obligations.",
            "What we can see here is that relationships are often face to face.",
            "And individuals are bound together by affective or emotional ties.",
            "Riser resolution by perception of individual self interest for in committee is something which is none.",
            "Opportunities for its members and there is a witness.",
            "Willingness in this community.",
            "One is a member.",
            "14 years ago said weeks and raphaeli kind definition, which is strongly influenced by the web actually and define virtual community as a computer mediated social group, which is based on the belief that humans are social creatures and that communities and number them to socialize and the virtual community is a technological response to this inherent human need."
        ],
        [
            "So unlike communities, an web community of virtual community is simply a community which happens to exist online rather than in a physical world.",
            "Three dimension exists when talking about online or virtual community.",
            "Social dimensions which open networks that you may certainly know, which can be higher.",
            "See AOL, Yahoo and MSN.",
            "You can also hear music from dating for instance, so they can be informal branded communities and customer services.",
            "Service sites such as ZDNet, for instance, or as we are in Finland.",
            "We can also speak of the Nokia Club.",
            "Which was quite new concept when it was introduced on the web and tried to create a relationship between Nokia device owners and the company and they can also be practical.",
            "For instance open political action groups like move on, but we can see that there isn't a trend to use the term community in every way you have such communities so dating or just speak of it.",
            "Trading communities auction communities such as eBay education communities.",
            "And this community here are quite different from the definition I just gave you before about virtual communities, because these communities are commercial communities and their objective is to make business."
        ],
        [
            "What is the technology of virtual community according to Porter which is not supporter?",
            "You know with famous in marketing but with a lady.",
            "In 2004 she presented this technology of virtual communities which is of interest because you can see that it can be either.",
            "Remember initiated or it can be organization sponsored and the type of relationship orientation inside a member initiated community virtual community can be social or professional.",
            "So here you have seen tradition of the word professional for organization sponsored.",
            "You can have commercial non for profit or governmental virtual communities."
        ],
        [
            "When, when did English professional issues what there is there is?",
            "Can speak of community of practice set.",
            "As you will see in the case today, I will present you.",
            "Widespread in large and large companies who have multi location dimension.",
            "It is Wenger who first coined the term community of practice and now he's doing business with this as a consultant and set set.",
            "Practice is a set of people who share concerns.",
            "The set of problems or passion about the topic and who depends on knowledge and expertise in this area.",
            "By interacting on an ongoing basis.",
            "Just provide you some more definition, but I think what is really interesting is to see that.",
            "When did foot and foot in 1969, nineteen 96.",
            "Introduce the idea of professional and here.",
            "See LeBron is Solomon Grace said that it's not a team.",
            "It's not a task force and it's not necessary.",
            "An authorized or identified group, but participation.",
            "Is certainly is a key to understand cups and two participation is also certainly the building element for success of cups.",
            "Wet Wet Wenger said, is that cops do not do imply participation in an activity about which all participants have a common understanding about what it is and what it means for their lives, and also for the community.",
            "So we have here is introduction of ideas such as share code, mutual understanding, that I will detail.",
            "So that's the first surprise."
        ],
        [
            "I just change this one because I think the previous one I inserted in my printouts is not that clear and I prefer this one which is adapted from vengeur, which has been done by green.",
            "I think in 2000 something which which really shows what a community of OK, which really shows that committed Community of practice is at the center of the domains.",
            "It means the things that matter.",
            "So practice.",
            "And also the community.",
            "And here are some elements that have just briefly introduced before, but practice is to develop and share and maintain knowledge.",
            "It means to have stories, information to use license, land when you want to create something new.",
            "Good definition of process is you also need to have frameworks, tools, documents and ideas.",
            "The community is seen as a social fabric of learning because here you've got to achieve this objective.",
            "You've got mutual respect, community, entity, willingness to share regular interaction, opening to questioning goodwill and trust, and the domain which is a thing.",
            "Things that matter is the common ground shared identity, shared interest, relevance value and purpose."
        ],
        [
            "Just to show you our vendor sees as evolution of a community of practice, so it's something which starts with the image image Ng something.",
            "Put it into effect developing, maintaining and let it lapse.",
            "That's what it recommends to companies who want to create inside their different locations.",
            "Community of practice to share, increase and develop knowledge.",
            "So there is here for instance during the potential and Constitution service and also maturity.",
            "Trust is really important to enable people to communicate and to share information once.",
            "So Community activity begins to be operational.",
            "What I don't I don't really agree is a scattering of the community because for vendor so community of practice is supposed to disappear after a certain amount of time."
        ],
        [
            "I also wanted to give you some elements of comparison of Community of practice compared to Community of interest and also project community service.",
            "Also another communities that you may have heard of that communities list.",
            "Any communities where you've got, for instance a group of knowledge worker who knows they have a problem to serve so are going to form a group to serve it and to give recommendation for instance to government.",
            "Ought to DC, for instance, is a nice place to make community.",
            "It's a quite closed in community with knowledge expert.",
            "For instance, knowledge workers and community of interests.",
            "Is.",
            "Is quite different from a community of practice in the Community of interest.",
            "What you want is to have access to information in Community of practice.",
            "What you want is to create, share and exchange knowledge and a community of interest doesn't have delimited boundaries.",
            "It's open community.",
            "According to practice, is an open community, but some members need to act all in the same domain.",
            "For instance, a community of users could be a Business School alumni.",
            "I said, for instance, which is one of the partners of equal.",
            "It is a community of interest and tries to move toward the professional community."
        ],
        [
            "Maybe I can go OK.",
            "I have two case studies in my presentation.",
            "I will maybe focus on this one and give you some lesson learned from C IBM case today and after we will move to professional virtual communities.",
            "And so it's not a electricty flop some years ago.",
            "Community of practice in order to develop a shared knowledge culture.",
            "And the first cups appeared when the group internists were settled, and why because there was an obvious need to fill in the blanks of these pages.",
            "Knowledge in genetics.",
            "It was often tested knowledge and using this intranet to build Cup and creating crops in the group was the most clever solution to codify knowledge within with workers.",
            "What are the lessons learned we've got from Schneider Electric?",
            "Is that ICT support apps and free seated but what say the observed is that Cup do not find their roots in Internet intranet tours?",
            "What is required at the beginning of the Cup is a support of the management management at the beginning, which is a necessity to give legitimity to people too.",
            "But in this cups, which are not business oriented, which is a task which is in parallel of the business actions.",
            "But what we can also see is employees and managers motivation are different in the knowledge management program.",
            "And both point of view I have to be analyzed differently.",
            "And when and also could conclusion is that successful community of practice are not source which are very good databases or very nice website.",
            "But those who have a good network of members inside."
        ],
        [
            "And what out is the Cup work in Schneider Logistics?",
            "So there is a kind of pyramid and with experts or group for instance.",
            "Or have worldwide reputation.",
            "For instance in one particular area or company recognition and after under them you've got confirmed participants Biggie nerves and you have all sorts of people want to enter security of practice and you see that's our interactions between them, which is.",
            "Which is at the beginning of the community of practice.",
            "Helped by the company, but we which we which should be auto organized when the company is operating and which shouldn't be done without which will be done without so yucky participation.",
            "So I will skip this one."
        ],
        [
            "And.",
            "And."
        ],
        [
            "Go to the key SuccessFactors of Cup.",
            "So what we do is in cups is high level of participation among Members.",
            "What we also need is belonging feelings developed developed which are supported by recondition costs that people share the same culture, the same language.",
            "What we also need is maybe you have already seen this figure, which is as an onion.",
            "You've got core members who are orphans, initiators of this community of practice.",
            "You have active Members who are participating, but maybe unless regular.",
            "Time basis and you have peripheral members who are acting when they need.",
            "When there is a need.",
            "When there is a specific competence in the knowledge domain.",
            "And after you've got Lurkers, which are people who are there just for looking at what's happening and in the community of Practice, lurkers are not welcome because they don't contribute to the increase of knowledge.",
            "So I leave Sunny with a consistent plan to consume Punta consultant.",
            "I think he defined really good to wake up.",
            "Should be because you need to have well defined goals, focus, research, extensive planning, appropriate application to support your company on going support from sponsors.",
            "But with the kind of flexibility there wasn't sponsors like Jarocki must be there, but they shouldn't be.",
            "Radioactive insecurity of practice.",
            "Because if she's a case, there will be some interest of conflict between what Manager wants and what the employees would like to develop, and it also needs flexibility to to evolve.",
            "And ingredients are shared purpose easier views, accountability of each Member Trust rewards.",
            "For instance of price, context and continuity.",
            "So I."
        ],
        [
            "I would like to introduce the concept of provisional virtual community.",
            "The concept of professional virtual communities in the equality context."
        ],
        [
            "So this is the definition.",
            "This was not a definition at the beginning of the project because it has evolved.",
            "The project started two years and life ago and I think this definition is now quite stable.",
            "So proficient I'm going to read it and you see, in birds you've got professional communities.",
            "Professional communities in Cell Association of individuals.",
            "Who can be employed by companies or individual professional?",
            "We were explicitly pursuing an economic objective identified by specific knowledge scope and aimed at generating value through members, interaction, sharing and collaboration, and this interaction is optimized by the synergy cues of ICT mediated and face to face mechanisms.",
            "See override paresthesia narrative value consists of elephants professional after posit.",
            "Sorry of advanced knowledge.",
            "Professional services.",
            "And social cohesion among members.",
            "So you."
        ],
        [
            "This PC is a long term structure, so as we we have seen the cups it it's.",
            "It's quite easy to make the comparison between a Cup and a PVC because long term structure and at.",
            "Enabling a changing between the members, but the professional virtual community really as a business objective which is translated and as a form of virtual team.",
            "Because a PC member are going to agree with temporarily in virtual team which can be compared to a virtual organization for addressing specific business opportunities, which is quite important is that it is up to the members to decide the extent of their individual involvement in PVC activities.",
            "Which is complimentary to and coexistent with other classical occupational forms, so you can imagine that member of PVC convert 80% of his time at his company and spend 20% of his side of it sign in a PC."
        ],
        [
            "Some similarities and differences between PVC and VB, so a media presented you yesterday virtual building environment and we see that it's almost the same structure except that for PVC you've gotta Villa 20 instead of virtual organization and you have an animator which we certainly so most important person.",
            "This PC because season matter is most of the times in the center of the PC and he creates a glue among members and the main difference in VB.",
            "If you've got organization, public organizations, universities for instance in professional virtual communities, you've got individual professional group of experts.",
            "OK yes yeah.",
            "Have their own like a.",
            "Yes, it's a kind of leader, but what is really important is that his or her competences must be recognized by the community.",
            "And I think that not only won an emitter, so is also the broker with taking advantage of collaboration of commercial opportunities.",
            "For instance, yes, he's a leader is someone who is recognizes someone who should be charismatic also.",
            "I don't know what time you say it is.",
            "You tell me when I have."
        ],
        [
            "15 minutes left.",
            "I don't know where.",
            "Good yes Ricardo."
        ],
        [
            "Question.",
            "Relationship.",
            "The point of connection between decline in DB is made by this.",
            "Let's say one guy is your manager, let's say or do the manager.",
            "Whereas in the PC perhaps the client getting direct with all the members, because normally was a service is very much customized.",
            "So the level of indirection is much more.",
            "Let's say for example, instead of only lets revertible compared to the people of the deal.",
            "I don't know.",
            "We yeah I yes.",
            "It also depends on who is a customer, because the professional virtual community in the political context is seen as a support to develop view because it brings the expertise which is maybe not.",
            "Is that sweetie?",
            "Yes, which, which may not be available for a network of SMEs?",
            "Because SMS Alec lacking competences and they can't find these competences for short duration.",
            "For instance individual team.",
            "But you know this is quite the structured.",
            "I don't think that all members of society are going to interact with the customer, OK?",
            "Much more than the other two days.",
            "Yes, because it's because you're not.",
            "You're not selling product, you are selling some expertise.",
            "So maybe you need more brainstorming session with your customer to better understand these requirements.",
            "Or maybe you need some to do some Co creation with him so involves a customer in the process of developing some new ideas some and some new services.",
            "Yes, it can be can be.",
            "So I'd let you go too.",
            "PC, So Louise already showed you this picture yesterday and.",
            "We see that we have 3 dimensions for professional virtual communities and this example is not very good, because here purple prose orange makes pink and you see that you've got a PC which is more oriented towards social and knowledge dimension and the idea is to pull the PVC toward business and to go toward a third balance.",
            "Professional Detroit communities.",
            "But you need all these three.",
            "Elements to define your PC.",
            "And we were trying to deflect some tools to measure as so proportion of social knowledge, business dimension in one piece, which can be very interesting because this is something which is subjective and if you don't you can't measure it.",
            "For instance, social knowledge and business.",
            "You don't know what is the orientation of your professional community.",
            "And I just added this morning this slide because this is a presentation.",
            "We had a short presentation we had yesterday and I was really happy to have it because I was not aware of this professional virtual community.",
            "Because if you read here, the girl of your is to enhance the potential and the capabilities of the error by increased exchange of ideas and context knowledge and by that European long term competitiveness business.",
            "And also when you speak of things, there is yes.",
            "So sharing of best practices.",
            "This is also social knowledge, so I think this community as prisons are characteristic of a professional virtual community in the sense we define agency, Akali, concept, context.",
            "So I was very happy to to discover it and I think I will investigate a little more with some too.",
            "Yes."
        ],
        [
            "So I'm going."
        ],
        [
            "To fester, and so I've I've given you some principle of BBC.",
            "But I will."
        ],
        [
            "Let them, I will let you read them.",
            "Let's go to see the PC lifecycle model.",
            "So you've got the PVC creation which is supposed and which ends at helping members to be ready to cooperate.",
            "So at this phase we must be sure that people share the common objectives that expert in the same domain and all coordination issues.",
            "For instance, our deal here and during the PVC creation.",
            "Remembers Union I was Speaking of when you have the car members active members, peripheral members, that's what year we're doing creates a PC.",
            "So second stage stage of a PC is the PVC operation through virtual teams.",
            "An ear says set must be something familiar for you.",
            "After 2 days of summer school you see something which is quite which is the same actually Cenveo creation, operation, involution and dissolution.",
            "Inserts phase is a PVC evolution where.",
            "Core members are going to learn from experience, so going to adapt so professional virtual community according to what's happening on the market.",
            "For instance, development, richer and noisy in English, richer in some technologies for instance, and they're going also to adapt to the customers requirements.",
            "And here you can have an you operational cycle with the creation of virtual team.",
            "And of course these are.",
            "You don't have only one virtual team.",
            "Plenty of plenty of virtual team organised two and such a specific collaboration opportunities and the last stages.",
            "A PVC metamorphosis because we do not base believe as Wenger that the only issue of the community is to die.",
            "It can of course die for instance if there is some distrust among members, but it can also evolve and metamorph and.",
            "Change the topic of the knowledge area, for instance."
        ],
        [
            "So what does the governance principles of a PVC so we have defined four different governance principles which are empowerment.",
            "It means that all decisions and responsibility must be taken as far as possible at the lowest hierarchical level.",
            "As a result, for instance, the PC business activities will be fully endorsed by the V team members and the contract is between Vt and the client, so PC itself carrying out.",
            "Brokerage function, so here you've got this idea of broker species based on the voluntary approach I've already spoken of this in the previous slide and also on self organization.",
            "Which means that the organization of the PVC is left as much as possible to its member actually performing the activities, and there is also something that we didn't find in virtual communities, which is a peer assessment because anytime there is a necessity anytime there is a necessity for subjective evaluation.",
            "For instance, Project Solution, Award, price, award quality control, subjective performance metrics.",
            "This is done by.",
            "Possibly another peer committee which is empowered to take that decision.",
            "So what we can prove through the year is that a PVC tries to involve all its member in the governance principles."
        ],
        [
            "An equally is another ICT I ICT project and what you have seen before is only social developments around professional virtual communities and in the project we are currently developing an advanced collaborative platform which is build which is composed of three building blocks.",
            "You've got a social work workspace, business workspace and also an alleged workspace.",
            "And all this building blocks are interconnected just to show you."
        ],
        [
            "What does the main functionality's without going too much into details that we will have in this advanced collaborative platform?",
            "We will have, of course CSC W twos here for cowork management, but they are not going to be developed in this specific work package.",
            "They will be delivered by ICT by the ICT infrastructure, but for business for instance, we are going to have some functionalities such as collaborative business management knowledge management.",
            "In social we are going to develop human competences, management.",
            "We need some ontologies.",
            "Because when you want to create, for instance a virtual team, you need to find out which Members are as best and as fit with the requirements you've got.",
            "And there is also a portal and such.",
            "There's a supporter and social management."
        ],
        [
            "OK, I will skip this and go to."
        ],
        [
            "Something I go back now to social issues and what we have done in one of deliverable is trying to define what is the social impact of professional virtual community.",
            "We have also defined what could be the economic impact and what could also be so political impact.",
            "I will only present the socially back but if you're interested by the economic political pack I can provide you with the figures.",
            "So I hope you can read."
        ],
        [
            "So we what we do here is we have four stages of a PVC developlment which is now once it is created.",
            "Short term, medium term and long term and hear from plus positive effect 2 minus negative effect.",
            "And for instance if I take.",
            "It's impact the social impact of PVC we can define, for instance, for social capital.",
            "What could be the positive impact so it can be activity in closer virtual collaboration in existing networks?",
            "Because the PVC is supported by ICT tools integration with the existing social networks which will be facilitated online in the short time.",
            "What we can see that we can have improved existing social bonds and network and easier access to knowledge and social networks.",
            "That which can also happen and sets interest of SIS.",
            "The table is that you can also have negative expect and you must be around then.",
            "For instance, if we're still dealing with this issue of social capital, APC can be in the short term and you layer or social interaction because you are member of a PVC, but you are so you are you're you're also working in a company and it can in the long term.",
            "In be a desert social capital due to too many layers of social interaction and why not to the to the effect of Avatar isation so you lose your identity because you belong to too many social networks.",
            "Your company and the PC.",
            "The.",
            "We did the same for instance, also for education and training and what positive effects you can see them for.",
            "The four different stages which provides incentive to evaluate once competences and skills.",
            "And the result could be the professional Theatre critique could be part of education and training process, but the negative negative aspect effect we have also detect and which should be taken into account when you create a PVC when PC is operating is.",
            "It's one more technology really relative subject to learn and become aware of, and it can lead to a loss of tacit knowledge and competences with due to an excessive digital digital digitalization."
        ],
        [
            "So."
        ],
        [
            "I have almost finished establishing PC to foster innovation in Encino.",
            "What has the challenges we have seen that the professional Utrecht community is a structure and long term framework which enables no legislation and sharing socialization and also success of collaboration opportunities for individual professional.",
            "However, there is a strong need for PC to focus its activities to involve individuals and prevents knowledge dissipation.",
            "And what we also need is.",
            "Some efforts from the European Commission to develop a legal framework which could enable to develop cross borders PVC because for the moment it's not that easy.",
            "We also need to define some key performance indicators to measure rich of objectives and what is also really important is to have shared goals and transparency.",
            "In this Cup."
        ],
        [
            "Of my PhD thesis said I began last December.",
            "I am studying.",
            "Propensity of a PVC.",
            "To trigger collaboration, we found out that PVC maybe to be able to detect this, we decided to use social capital concept and we used nappy and go Sharps model which which is bad based on three dimension which which is a share collective dimension share, shared values, shared stories.",
            "So rational dimension which is defined by trust reciprocity.",
            "And stricter than structural dimension, which is defined by the network connectivity.",
            "When Appian Ghoshal defines is this three building blocks they didn't intend to make relationships between the three building bugs.",
            "That's what we did, and we think that.",
            "These two first building blocks here creates the interpersonal relationships which are going to create interaction corrective action and which will influence the network connectivity.",
            "And this is a network connectivity which is going to impact on the efficient.",
            "C of section on cooperation and coordination.",
            "So I think I have finished.",
            "I wanted to ask you to.",
            "After this presentation, is it clearer for you where to PC is?",
            "And do you have just wait?",
            "Do you have in mind some examples of PVC according to where you come from, for instance?",
            "I think it's like 5 fifth working groups to my mind, OK?",
            "I don't do makeup.",
            "Maybe once a year or something of that nature.",
            "OK, thank you.",
            "University of University in Mexico were trying to deal some kind of provincial, brittle community.",
            "Given a ICD platform to add to all the teachers involved at the end of the campus in Mexico and tried to bully, not except we're kind of virtual teams to respond for some consulting opportunities that comes to University.",
            "So we're trying to put together all the competencies human competencies of all the teachers of the University to be able to build our really expert team, OK?",
            "I can't think of a thing.",
            "OK, thank you.",
            "For example, institutional electrical engineering.",
            "OK. OK.",
            "Camera.",
            "I mean, participation to the embassy.",
            "Is.",
            "Yes.",
            "So.",
            "Because it's better.",
            "You cannot tell a disease or something like that.",
            "I mean, you can have any identity.",
            "Or anyone something to do?",
            "For a specific date, no.",
            "It's different when when we say that a participation is on voluntary basis, it means that it's not like community of practice, which are often difficult in a company, for instance, and why you are.",
            "You are invited.",
            "Between brokers to participate that if you want to join a PVC, you're free to do it, but after that after this, you're free to participate to virtual team which are not business oriented.",
            "If you just want to be in the professional community to create and exchange knowledge, for instance, this is not a problem.",
            "But if you decide to go to work on business opportunities, for instance you will, you will sign a contract contract because we've developed templates.",
            "And you have some obligations to respect.",
            "Did answer.",
            "Going into the virtual community, you're like making some kind of moral contract because you're you also fell asleep just just seeing what's happening there.",
            "That community?",
            "Perhaps it's gonna reject you because we have to participate within it.",
            "Yes, you can be an active member without participating to business opportunities.",
            "Because you can deliver information you can be initiator of collaboration opportunity because you have heard that this customer raycrisis exercise.",
            "But you can decide on your own not to participate to some business phase which is of your chanting.",
            "You know how?",
            "Violence and PVCS OK.",
            "In my opinion, there was this difference in the degree of expertise.",
            "I think I think so.",
            "Main difference is that in a VB you're dealing with organizations such as SMEs for instance, or universities or schools, and in professional veteran it is.",
            "You're you're dealing with individual professionals who can belong to a company and.",
            "Work 20% of the time for the PC or who can be freelancers.",
            "Because I don't have the figures in mind, but I read that in Europe some more and more freelancers people leaving the companion trying to work on their own.",
            "Open.",
            "Yep.",
            "According to their field, yes, yes.",
            "For example.",
            "In the open source projects like the Linux project.",
            "People.",
            "Select PVC or virtual tools,, task or come with a database, yes, but I think there are many differences between C specific case of open source where some information is qualified and really easy to.",
            "It's really easy to share it because you've got guidelines for instance and you have documentation associated and knowledge is not tested.",
            "In a community of little PC is quite different because the knowledge is often tested and you need a way to make it explicit.",
            "So this can be under face to face meetings for instance, or virtual meetings.",
            "That's a difference, Ann.",
            "I think the product in it, that's what I wrote in the paper for open source communities say they're really put the production system because they are able to deliver product.",
            "But it's not.",
            "It's not the case here in professional virtual communities where we are modeling with expertise, for instance.",
            "Yeah.",
            "Neighbors.",
            "But I thought it was coming in factories.",
            "Now I learned it was actually professional virtual community so.",
            "But why?",
            "Why do you think it was more pieces and the community of practice?",
            "Because you had some business, strong business orientation and as a form of it renting?",
            "OK. Our customers with an idea Community, practices that could improve.",
            "Have this concept yet to say and my my thing that I've been wondering is that I really do that community of practice disappears after certain amount of time.",
            "But how to make in the marketing interesting marketing?",
            "So how to make it work with X?",
            "Your organization.",
            "100% of your salary.",
            "There is a time to make it usable exit.",
            "How do you help anyone?",
            "Do it actually does.",
            "Active members members.",
            "Their penetration members all join needed be back at the time were not active.",
            "You might even have some special.",
            "It wasn't really used to be done.",
            "In the air there is no.",
            "Meeting of the community, but I try once more.",
            "Like yes, it shows it shows in bottoms of CM.",
            "Of course.",
            "I like that.",
            "OK.",
            "Thank you very much Sir.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talk about professional virtual communities.",
                    "label": 1
                },
                {
                    "sent": "7 club graduated at the Eco Superior.",
                    "label": 0
                },
                {
                    "sent": "The question from Paris.",
                    "label": 0
                },
                {
                    "sent": "And is currently working as a researcher in France Telecom Orange Resistant Development Center.",
                    "label": 0
                },
                {
                    "sent": "Yes, taking part in several projects on usages of ICT on small and medium sized enterprise market.",
                    "label": 0
                },
                {
                    "sent": "She has been responsible for experiencing new services from for France Telecom Research and development based on homemade new technologies and new standards.",
                    "label": 0
                },
                {
                    "sent": "She has also collaborated with American universities and European consulting companies.",
                    "label": 0
                },
                {
                    "sent": "On the study of evolution of interfirm relationships.",
                    "label": 0
                },
                {
                    "sent": "Since the end of 2004, she has been responsible for research access.",
                    "label": 0
                },
                {
                    "sent": "On new forms of interpersonal relationships, she is now leaving a larger insert access, entitled Transformation of the services delivery.",
                    "label": 0
                },
                {
                    "sent": "Which is one of the four research access in the newly created services science microfold directly connected to the France Telecom Research and Development Scientific Board.",
                    "label": 0
                },
                {
                    "sent": "She's involved in the equity project.",
                    "label": 0
                },
                {
                    "sent": "Related to.",
                    "label": 0
                },
                {
                    "sent": "Professional virtual communities.",
                    "label": 0
                },
                {
                    "sent": "I'm business suits.",
                    "label": 0
                },
                {
                    "sent": "For instance, the different definition of the value network of accolade.",
                    "label": 0
                },
                {
                    "sent": "Welcome, thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you honey.",
                    "label": 0
                },
                {
                    "sent": "Good morning everybody.",
                    "label": 0
                },
                {
                    "sent": "I had a challenge when I arrived here.",
                    "label": 0
                },
                {
                    "sent": "It was to convince you of the reality of professional virtual communities, but since Wednesday Ave Challenge is to be able to do this presentation with my broken voice.",
                    "label": 0
                },
                {
                    "sent": "So I hope I will be able to manage it and please feel free to ask questions.",
                    "label": 0
                },
                {
                    "sent": "This way I will speak less would be good.",
                    "label": 0
                },
                {
                    "sent": "So just a precision because on prosthetic Camerons alot of people believe that orange has booked posticum because one my name now is arranged, but actually the fact is that it's fine.",
                    "label": 0
                },
                {
                    "sent": "Silica Newburgh Tour and UK seven years ago, so it was just a precision because I've been asked about about this.",
                    "label": 1
                },
                {
                    "sent": "So what are professional communities so?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Professional virtual communities are seen as key driver for innovation and cooperation in collaborative networked organizations.",
                    "label": 1
                },
                {
                    "sent": "This concept is strongly supported by the European Commission and for many reasons one of the reason is the aging of the population which may prevent transfer or knowledge from people who retire too young generation.",
                    "label": 0
                },
                {
                    "sent": "Another reason can also be the flexibility that you find due to globalization of the market and which forces companies to use people for short period of time and not for their whole life and not for their life.",
                    "label": 0
                },
                {
                    "sent": "So the outline of my presentation will be.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As photo first, I think it was interesting to provide you with some definitions and case studies about communities, virtual communities, and Community of practice, and then to introduce the concept of PVC inequalities in the second part of my presentation I will give you the principle and also the challenges of professional virtual communities and after a short conclusion I would like to have a discussion with you on a way to.",
                    "label": 1
                },
                {
                    "sent": "Evaluate as a propensity of PC to create successful collaboration and this discussion is related to the paper represented at provi on Tuesday morning.",
                    "label": 0
                },
                {
                    "sent": "So maybe some of you have already read or similar presentation, but it's just a short discussion at the end of my presentation.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So is.",
                    "label": 0
                },
                {
                    "sent": "I like.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This definition of Bender in 1982, which is about what is a community.",
                    "label": 0
                },
                {
                    "sent": "It's before the Internet, So what he emphasizes it's that it's a limited number of people in a somewhat restricted social space or network which are held together by shared understandings and also a sense of obligations.",
                    "label": 1
                },
                {
                    "sent": "What we can see here is that relationships are often face to face.",
                    "label": 1
                },
                {
                    "sent": "And individuals are bound together by affective or emotional ties.",
                    "label": 0
                },
                {
                    "sent": "Riser resolution by perception of individual self interest for in committee is something which is none.",
                    "label": 0
                },
                {
                    "sent": "Opportunities for its members and there is a witness.",
                    "label": 0
                },
                {
                    "sent": "Willingness in this community.",
                    "label": 0
                },
                {
                    "sent": "One is a member.",
                    "label": 0
                },
                {
                    "sent": "14 years ago said weeks and raphaeli kind definition, which is strongly influenced by the web actually and define virtual community as a computer mediated social group, which is based on the belief that humans are social creatures and that communities and number them to socialize and the virtual community is a technological response to this inherent human need.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So unlike communities, an web community of virtual community is simply a community which happens to exist online rather than in a physical world.",
                    "label": 1
                },
                {
                    "sent": "Three dimension exists when talking about online or virtual community.",
                    "label": 0
                },
                {
                    "sent": "Social dimensions which open networks that you may certainly know, which can be higher.",
                    "label": 1
                },
                {
                    "sent": "See AOL, Yahoo and MSN.",
                    "label": 0
                },
                {
                    "sent": "You can also hear music from dating for instance, so they can be informal branded communities and customer services.",
                    "label": 0
                },
                {
                    "sent": "Service sites such as ZDNet, for instance, or as we are in Finland.",
                    "label": 0
                },
                {
                    "sent": "We can also speak of the Nokia Club.",
                    "label": 0
                },
                {
                    "sent": "Which was quite new concept when it was introduced on the web and tried to create a relationship between Nokia device owners and the company and they can also be practical.",
                    "label": 1
                },
                {
                    "sent": "For instance open political action groups like move on, but we can see that there isn't a trend to use the term community in every way you have such communities so dating or just speak of it.",
                    "label": 0
                },
                {
                    "sent": "Trading communities auction communities such as eBay education communities.",
                    "label": 0
                },
                {
                    "sent": "And this community here are quite different from the definition I just gave you before about virtual communities, because these communities are commercial communities and their objective is to make business.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is the technology of virtual community according to Porter which is not supporter?",
                    "label": 1
                },
                {
                    "sent": "You know with famous in marketing but with a lady.",
                    "label": 0
                },
                {
                    "sent": "In 2004 she presented this technology of virtual communities which is of interest because you can see that it can be either.",
                    "label": 0
                },
                {
                    "sent": "Remember initiated or it can be organization sponsored and the type of relationship orientation inside a member initiated community virtual community can be social or professional.",
                    "label": 0
                },
                {
                    "sent": "So here you have seen tradition of the word professional for organization sponsored.",
                    "label": 0
                },
                {
                    "sent": "You can have commercial non for profit or governmental virtual communities.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When, when did English professional issues what there is there is?",
                    "label": 0
                },
                {
                    "sent": "Can speak of community of practice set.",
                    "label": 1
                },
                {
                    "sent": "As you will see in the case today, I will present you.",
                    "label": 0
                },
                {
                    "sent": "Widespread in large and large companies who have multi location dimension.",
                    "label": 0
                },
                {
                    "sent": "It is Wenger who first coined the term community of practice and now he's doing business with this as a consultant and set set.",
                    "label": 0
                },
                {
                    "sent": "Practice is a set of people who share concerns.",
                    "label": 1
                },
                {
                    "sent": "The set of problems or passion about the topic and who depends on knowledge and expertise in this area.",
                    "label": 1
                },
                {
                    "sent": "By interacting on an ongoing basis.",
                    "label": 1
                },
                {
                    "sent": "Just provide you some more definition, but I think what is really interesting is to see that.",
                    "label": 1
                },
                {
                    "sent": "When did foot and foot in 1969, nineteen 96.",
                    "label": 1
                },
                {
                    "sent": "Introduce the idea of professional and here.",
                    "label": 0
                },
                {
                    "sent": "See LeBron is Solomon Grace said that it's not a team.",
                    "label": 0
                },
                {
                    "sent": "It's not a task force and it's not necessary.",
                    "label": 0
                },
                {
                    "sent": "An authorized or identified group, but participation.",
                    "label": 0
                },
                {
                    "sent": "Is certainly is a key to understand cups and two participation is also certainly the building element for success of cups.",
                    "label": 0
                },
                {
                    "sent": "Wet Wet Wenger said, is that cops do not do imply participation in an activity about which all participants have a common understanding about what it is and what it means for their lives, and also for the community.",
                    "label": 1
                },
                {
                    "sent": "So we have here is introduction of ideas such as share code, mutual understanding, that I will detail.",
                    "label": 0
                },
                {
                    "sent": "So that's the first surprise.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I just change this one because I think the previous one I inserted in my printouts is not that clear and I prefer this one which is adapted from vengeur, which has been done by green.",
                    "label": 0
                },
                {
                    "sent": "I think in 2000 something which which really shows what a community of OK, which really shows that committed Community of practice is at the center of the domains.",
                    "label": 1
                },
                {
                    "sent": "It means the things that matter.",
                    "label": 0
                },
                {
                    "sent": "So practice.",
                    "label": 0
                },
                {
                    "sent": "And also the community.",
                    "label": 0
                },
                {
                    "sent": "And here are some elements that have just briefly introduced before, but practice is to develop and share and maintain knowledge.",
                    "label": 0
                },
                {
                    "sent": "It means to have stories, information to use license, land when you want to create something new.",
                    "label": 0
                },
                {
                    "sent": "Good definition of process is you also need to have frameworks, tools, documents and ideas.",
                    "label": 1
                },
                {
                    "sent": "The community is seen as a social fabric of learning because here you've got to achieve this objective.",
                    "label": 1
                },
                {
                    "sent": "You've got mutual respect, community, entity, willingness to share regular interaction, opening to questioning goodwill and trust, and the domain which is a thing.",
                    "label": 0
                },
                {
                    "sent": "Things that matter is the common ground shared identity, shared interest, relevance value and purpose.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to show you our vendor sees as evolution of a community of practice, so it's something which starts with the image image Ng something.",
                    "label": 1
                },
                {
                    "sent": "Put it into effect developing, maintaining and let it lapse.",
                    "label": 0
                },
                {
                    "sent": "That's what it recommends to companies who want to create inside their different locations.",
                    "label": 0
                },
                {
                    "sent": "Community of practice to share, increase and develop knowledge.",
                    "label": 0
                },
                {
                    "sent": "So there is here for instance during the potential and Constitution service and also maturity.",
                    "label": 0
                },
                {
                    "sent": "Trust is really important to enable people to communicate and to share information once.",
                    "label": 0
                },
                {
                    "sent": "So Community activity begins to be operational.",
                    "label": 0
                },
                {
                    "sent": "What I don't I don't really agree is a scattering of the community because for vendor so community of practice is supposed to disappear after a certain amount of time.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I also wanted to give you some elements of comparison of Community of practice compared to Community of interest and also project community service.",
                    "label": 1
                },
                {
                    "sent": "Also another communities that you may have heard of that communities list.",
                    "label": 0
                },
                {
                    "sent": "Any communities where you've got, for instance a group of knowledge worker who knows they have a problem to serve so are going to form a group to serve it and to give recommendation for instance to government.",
                    "label": 0
                },
                {
                    "sent": "Ought to DC, for instance, is a nice place to make community.",
                    "label": 0
                },
                {
                    "sent": "It's a quite closed in community with knowledge expert.",
                    "label": 0
                },
                {
                    "sent": "For instance, knowledge workers and community of interests.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Is quite different from a community of practice in the Community of interest.",
                    "label": 0
                },
                {
                    "sent": "What you want is to have access to information in Community of practice.",
                    "label": 0
                },
                {
                    "sent": "What you want is to create, share and exchange knowledge and a community of interest doesn't have delimited boundaries.",
                    "label": 0
                },
                {
                    "sent": "It's open community.",
                    "label": 0
                },
                {
                    "sent": "According to practice, is an open community, but some members need to act all in the same domain.",
                    "label": 1
                },
                {
                    "sent": "For instance, a community of users could be a Business School alumni.",
                    "label": 0
                },
                {
                    "sent": "I said, for instance, which is one of the partners of equal.",
                    "label": 0
                },
                {
                    "sent": "It is a community of interest and tries to move toward the professional community.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Maybe I can go OK.",
                    "label": 0
                },
                {
                    "sent": "I have two case studies in my presentation.",
                    "label": 0
                },
                {
                    "sent": "I will maybe focus on this one and give you some lesson learned from C IBM case today and after we will move to professional virtual communities.",
                    "label": 0
                },
                {
                    "sent": "And so it's not a electricty flop some years ago.",
                    "label": 0
                },
                {
                    "sent": "Community of practice in order to develop a shared knowledge culture.",
                    "label": 0
                },
                {
                    "sent": "And the first cups appeared when the group internists were settled, and why because there was an obvious need to fill in the blanks of these pages.",
                    "label": 1
                },
                {
                    "sent": "Knowledge in genetics.",
                    "label": 1
                },
                {
                    "sent": "It was often tested knowledge and using this intranet to build Cup and creating crops in the group was the most clever solution to codify knowledge within with workers.",
                    "label": 1
                },
                {
                    "sent": "What are the lessons learned we've got from Schneider Electric?",
                    "label": 1
                },
                {
                    "sent": "Is that ICT support apps and free seated but what say the observed is that Cup do not find their roots in Internet intranet tours?",
                    "label": 1
                },
                {
                    "sent": "What is required at the beginning of the Cup is a support of the management management at the beginning, which is a necessity to give legitimity to people too.",
                    "label": 1
                },
                {
                    "sent": "But in this cups, which are not business oriented, which is a task which is in parallel of the business actions.",
                    "label": 0
                },
                {
                    "sent": "But what we can also see is employees and managers motivation are different in the knowledge management program.",
                    "label": 1
                },
                {
                    "sent": "And both point of view I have to be analyzed differently.",
                    "label": 0
                },
                {
                    "sent": "And when and also could conclusion is that successful community of practice are not source which are very good databases or very nice website.",
                    "label": 0
                },
                {
                    "sent": "But those who have a good network of members inside.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what out is the Cup work in Schneider Logistics?",
                    "label": 0
                },
                {
                    "sent": "So there is a kind of pyramid and with experts or group for instance.",
                    "label": 0
                },
                {
                    "sent": "Or have worldwide reputation.",
                    "label": 0
                },
                {
                    "sent": "For instance in one particular area or company recognition and after under them you've got confirmed participants Biggie nerves and you have all sorts of people want to enter security of practice and you see that's our interactions between them, which is.",
                    "label": 0
                },
                {
                    "sent": "Which is at the beginning of the community of practice.",
                    "label": 0
                },
                {
                    "sent": "Helped by the company, but we which we which should be auto organized when the company is operating and which shouldn't be done without which will be done without so yucky participation.",
                    "label": 0
                },
                {
                    "sent": "So I will skip this one.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Go to the key SuccessFactors of Cup.",
                    "label": 0
                },
                {
                    "sent": "So what we do is in cups is high level of participation among Members.",
                    "label": 1
                },
                {
                    "sent": "What we also need is belonging feelings developed developed which are supported by recondition costs that people share the same culture, the same language.",
                    "label": 0
                },
                {
                    "sent": "What we also need is maybe you have already seen this figure, which is as an onion.",
                    "label": 0
                },
                {
                    "sent": "You've got core members who are orphans, initiators of this community of practice.",
                    "label": 0
                },
                {
                    "sent": "You have active Members who are participating, but maybe unless regular.",
                    "label": 0
                },
                {
                    "sent": "Time basis and you have peripheral members who are acting when they need.",
                    "label": 0
                },
                {
                    "sent": "When there is a need.",
                    "label": 0
                },
                {
                    "sent": "When there is a specific competence in the knowledge domain.",
                    "label": 0
                },
                {
                    "sent": "And after you've got Lurkers, which are people who are there just for looking at what's happening and in the community of Practice, lurkers are not welcome because they don't contribute to the increase of knowledge.",
                    "label": 0
                },
                {
                    "sent": "So I leave Sunny with a consistent plan to consume Punta consultant.",
                    "label": 0
                },
                {
                    "sent": "I think he defined really good to wake up.",
                    "label": 0
                },
                {
                    "sent": "Should be because you need to have well defined goals, focus, research, extensive planning, appropriate application to support your company on going support from sponsors.",
                    "label": 1
                },
                {
                    "sent": "But with the kind of flexibility there wasn't sponsors like Jarocki must be there, but they shouldn't be.",
                    "label": 0
                },
                {
                    "sent": "Radioactive insecurity of practice.",
                    "label": 0
                },
                {
                    "sent": "Because if she's a case, there will be some interest of conflict between what Manager wants and what the employees would like to develop, and it also needs flexibility to to evolve.",
                    "label": 0
                },
                {
                    "sent": "And ingredients are shared purpose easier views, accountability of each Member Trust rewards.",
                    "label": 1
                },
                {
                    "sent": "For instance of price, context and continuity.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would like to introduce the concept of provisional virtual community.",
                    "label": 0
                },
                {
                    "sent": "The concept of professional virtual communities in the equality context.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the definition.",
                    "label": 0
                },
                {
                    "sent": "This was not a definition at the beginning of the project because it has evolved.",
                    "label": 0
                },
                {
                    "sent": "The project started two years and life ago and I think this definition is now quite stable.",
                    "label": 0
                },
                {
                    "sent": "So proficient I'm going to read it and you see, in birds you've got professional communities.",
                    "label": 0
                },
                {
                    "sent": "Professional communities in Cell Association of individuals.",
                    "label": 1
                },
                {
                    "sent": "Who can be employed by companies or individual professional?",
                    "label": 1
                },
                {
                    "sent": "We were explicitly pursuing an economic objective identified by specific knowledge scope and aimed at generating value through members, interaction, sharing and collaboration, and this interaction is optimized by the synergy cues of ICT mediated and face to face mechanisms.",
                    "label": 1
                },
                {
                    "sent": "See override paresthesia narrative value consists of elephants professional after posit.",
                    "label": 0
                },
                {
                    "sent": "Sorry of advanced knowledge.",
                    "label": 0
                },
                {
                    "sent": "Professional services.",
                    "label": 1
                },
                {
                    "sent": "And social cohesion among members.",
                    "label": 0
                },
                {
                    "sent": "So you.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This PC is a long term structure, so as we we have seen the cups it it's.",
                    "label": 0
                },
                {
                    "sent": "It's quite easy to make the comparison between a Cup and a PVC because long term structure and at.",
                    "label": 0
                },
                {
                    "sent": "Enabling a changing between the members, but the professional virtual community really as a business objective which is translated and as a form of virtual team.",
                    "label": 0
                },
                {
                    "sent": "Because a PC member are going to agree with temporarily in virtual team which can be compared to a virtual organization for addressing specific business opportunities, which is quite important is that it is up to the members to decide the extent of their individual involvement in PVC activities.",
                    "label": 1
                },
                {
                    "sent": "Which is complimentary to and coexistent with other classical occupational forms, so you can imagine that member of PVC convert 80% of his time at his company and spend 20% of his side of it sign in a PC.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some similarities and differences between PVC and VB, so a media presented you yesterday virtual building environment and we see that it's almost the same structure except that for PVC you've gotta Villa 20 instead of virtual organization and you have an animator which we certainly so most important person.",
                    "label": 1
                },
                {
                    "sent": "This PC because season matter is most of the times in the center of the PC and he creates a glue among members and the main difference in VB.",
                    "label": 0
                },
                {
                    "sent": "If you've got organization, public organizations, universities for instance in professional virtual communities, you've got individual professional group of experts.",
                    "label": 1
                },
                {
                    "sent": "OK yes yeah.",
                    "label": 0
                },
                {
                    "sent": "Have their own like a.",
                    "label": 0
                },
                {
                    "sent": "Yes, it's a kind of leader, but what is really important is that his or her competences must be recognized by the community.",
                    "label": 0
                },
                {
                    "sent": "And I think that not only won an emitter, so is also the broker with taking advantage of collaboration of commercial opportunities.",
                    "label": 0
                },
                {
                    "sent": "For instance, yes, he's a leader is someone who is recognizes someone who should be charismatic also.",
                    "label": 0
                },
                {
                    "sent": "I don't know what time you say it is.",
                    "label": 0
                },
                {
                    "sent": "You tell me when I have.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "15 minutes left.",
                    "label": 0
                },
                {
                    "sent": "I don't know where.",
                    "label": 0
                },
                {
                    "sent": "Good yes Ricardo.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "Relationship.",
                    "label": 0
                },
                {
                    "sent": "The point of connection between decline in DB is made by this.",
                    "label": 0
                },
                {
                    "sent": "Let's say one guy is your manager, let's say or do the manager.",
                    "label": 0
                },
                {
                    "sent": "Whereas in the PC perhaps the client getting direct with all the members, because normally was a service is very much customized.",
                    "label": 0
                },
                {
                    "sent": "So the level of indirection is much more.",
                    "label": 0
                },
                {
                    "sent": "Let's say for example, instead of only lets revertible compared to the people of the deal.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "We yeah I yes.",
                    "label": 0
                },
                {
                    "sent": "It also depends on who is a customer, because the professional virtual community in the political context is seen as a support to develop view because it brings the expertise which is maybe not.",
                    "label": 0
                },
                {
                    "sent": "Is that sweetie?",
                    "label": 0
                },
                {
                    "sent": "Yes, which, which may not be available for a network of SMEs?",
                    "label": 0
                },
                {
                    "sent": "Because SMS Alec lacking competences and they can't find these competences for short duration.",
                    "label": 0
                },
                {
                    "sent": "For instance individual team.",
                    "label": 0
                },
                {
                    "sent": "But you know this is quite the structured.",
                    "label": 0
                },
                {
                    "sent": "I don't think that all members of society are going to interact with the customer, OK?",
                    "label": 0
                },
                {
                    "sent": "Much more than the other two days.",
                    "label": 0
                },
                {
                    "sent": "Yes, because it's because you're not.",
                    "label": 0
                },
                {
                    "sent": "You're not selling product, you are selling some expertise.",
                    "label": 0
                },
                {
                    "sent": "So maybe you need more brainstorming session with your customer to better understand these requirements.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you need some to do some Co creation with him so involves a customer in the process of developing some new ideas some and some new services.",
                    "label": 0
                },
                {
                    "sent": "Yes, it can be can be.",
                    "label": 0
                },
                {
                    "sent": "So I'd let you go too.",
                    "label": 0
                },
                {
                    "sent": "PC, So Louise already showed you this picture yesterday and.",
                    "label": 0
                },
                {
                    "sent": "We see that we have 3 dimensions for professional virtual communities and this example is not very good, because here purple prose orange makes pink and you see that you've got a PC which is more oriented towards social and knowledge dimension and the idea is to pull the PVC toward business and to go toward a third balance.",
                    "label": 0
                },
                {
                    "sent": "Professional Detroit communities.",
                    "label": 0
                },
                {
                    "sent": "But you need all these three.",
                    "label": 0
                },
                {
                    "sent": "Elements to define your PC.",
                    "label": 0
                },
                {
                    "sent": "And we were trying to deflect some tools to measure as so proportion of social knowledge, business dimension in one piece, which can be very interesting because this is something which is subjective and if you don't you can't measure it.",
                    "label": 0
                },
                {
                    "sent": "For instance, social knowledge and business.",
                    "label": 0
                },
                {
                    "sent": "You don't know what is the orientation of your professional community.",
                    "label": 0
                },
                {
                    "sent": "And I just added this morning this slide because this is a presentation.",
                    "label": 0
                },
                {
                    "sent": "We had a short presentation we had yesterday and I was really happy to have it because I was not aware of this professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "Because if you read here, the girl of your is to enhance the potential and the capabilities of the error by increased exchange of ideas and context knowledge and by that European long term competitiveness business.",
                    "label": 0
                },
                {
                    "sent": "And also when you speak of things, there is yes.",
                    "label": 0
                },
                {
                    "sent": "So sharing of best practices.",
                    "label": 0
                },
                {
                    "sent": "This is also social knowledge, so I think this community as prisons are characteristic of a professional virtual community in the sense we define agency, Akali, concept, context.",
                    "label": 0
                },
                {
                    "sent": "So I was very happy to to discover it and I think I will investigate a little more with some too.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To fester, and so I've I've given you some principle of BBC.",
                    "label": 0
                },
                {
                    "sent": "But I will.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let them, I will let you read them.",
                    "label": 0
                },
                {
                    "sent": "Let's go to see the PC lifecycle model.",
                    "label": 0
                },
                {
                    "sent": "So you've got the PVC creation which is supposed and which ends at helping members to be ready to cooperate.",
                    "label": 1
                },
                {
                    "sent": "So at this phase we must be sure that people share the common objectives that expert in the same domain and all coordination issues.",
                    "label": 1
                },
                {
                    "sent": "For instance, our deal here and during the PVC creation.",
                    "label": 0
                },
                {
                    "sent": "Remembers Union I was Speaking of when you have the car members active members, peripheral members, that's what year we're doing creates a PC.",
                    "label": 0
                },
                {
                    "sent": "So second stage stage of a PC is the PVC operation through virtual teams.",
                    "label": 1
                },
                {
                    "sent": "An ear says set must be something familiar for you.",
                    "label": 1
                },
                {
                    "sent": "After 2 days of summer school you see something which is quite which is the same actually Cenveo creation, operation, involution and dissolution.",
                    "label": 1
                },
                {
                    "sent": "Inserts phase is a PVC evolution where.",
                    "label": 0
                },
                {
                    "sent": "Core members are going to learn from experience, so going to adapt so professional virtual community according to what's happening on the market.",
                    "label": 0
                },
                {
                    "sent": "For instance, development, richer and noisy in English, richer in some technologies for instance, and they're going also to adapt to the customers requirements.",
                    "label": 0
                },
                {
                    "sent": "And here you can have an you operational cycle with the creation of virtual team.",
                    "label": 0
                },
                {
                    "sent": "And of course these are.",
                    "label": 0
                },
                {
                    "sent": "You don't have only one virtual team.",
                    "label": 0
                },
                {
                    "sent": "Plenty of plenty of virtual team organised two and such a specific collaboration opportunities and the last stages.",
                    "label": 0
                },
                {
                    "sent": "A PVC metamorphosis because we do not base believe as Wenger that the only issue of the community is to die.",
                    "label": 0
                },
                {
                    "sent": "It can of course die for instance if there is some distrust among members, but it can also evolve and metamorph and.",
                    "label": 0
                },
                {
                    "sent": "Change the topic of the knowledge area, for instance.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what does the governance principles of a PVC so we have defined four different governance principles which are empowerment.",
                    "label": 0
                },
                {
                    "sent": "It means that all decisions and responsibility must be taken as far as possible at the lowest hierarchical level.",
                    "label": 1
                },
                {
                    "sent": "As a result, for instance, the PC business activities will be fully endorsed by the V team members and the contract is between Vt and the client, so PC itself carrying out.",
                    "label": 1
                },
                {
                    "sent": "Brokerage function, so here you've got this idea of broker species based on the voluntary approach I've already spoken of this in the previous slide and also on self organization.",
                    "label": 0
                },
                {
                    "sent": "Which means that the organization of the PVC is left as much as possible to its member actually performing the activities, and there is also something that we didn't find in virtual communities, which is a peer assessment because anytime there is a necessity anytime there is a necessity for subjective evaluation.",
                    "label": 1
                },
                {
                    "sent": "For instance, Project Solution, Award, price, award quality control, subjective performance metrics.",
                    "label": 0
                },
                {
                    "sent": "This is done by.",
                    "label": 0
                },
                {
                    "sent": "Possibly another peer committee which is empowered to take that decision.",
                    "label": 0
                },
                {
                    "sent": "So what we can prove through the year is that a PVC tries to involve all its member in the governance principles.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An equally is another ICT I ICT project and what you have seen before is only social developments around professional virtual communities and in the project we are currently developing an advanced collaborative platform which is build which is composed of three building blocks.",
                    "label": 0
                },
                {
                    "sent": "You've got a social work workspace, business workspace and also an alleged workspace.",
                    "label": 0
                },
                {
                    "sent": "And all this building blocks are interconnected just to show you.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What does the main functionality's without going too much into details that we will have in this advanced collaborative platform?",
                    "label": 0
                },
                {
                    "sent": "We will have, of course CSC W twos here for cowork management, but they are not going to be developed in this specific work package.",
                    "label": 0
                },
                {
                    "sent": "They will be delivered by ICT by the ICT infrastructure, but for business for instance, we are going to have some functionalities such as collaborative business management knowledge management.",
                    "label": 0
                },
                {
                    "sent": "In social we are going to develop human competences, management.",
                    "label": 0
                },
                {
                    "sent": "We need some ontologies.",
                    "label": 0
                },
                {
                    "sent": "Because when you want to create, for instance a virtual team, you need to find out which Members are as best and as fit with the requirements you've got.",
                    "label": 0
                },
                {
                    "sent": "And there is also a portal and such.",
                    "label": 0
                },
                {
                    "sent": "There's a supporter and social management.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I will skip this and go to.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Something I go back now to social issues and what we have done in one of deliverable is trying to define what is the social impact of professional virtual community.",
                    "label": 0
                },
                {
                    "sent": "We have also defined what could be the economic impact and what could also be so political impact.",
                    "label": 0
                },
                {
                    "sent": "I will only present the socially back but if you're interested by the economic political pack I can provide you with the figures.",
                    "label": 0
                },
                {
                    "sent": "So I hope you can read.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we what we do here is we have four stages of a PVC developlment which is now once it is created.",
                    "label": 0
                },
                {
                    "sent": "Short term, medium term and long term and hear from plus positive effect 2 minus negative effect.",
                    "label": 0
                },
                {
                    "sent": "And for instance if I take.",
                    "label": 0
                },
                {
                    "sent": "It's impact the social impact of PVC we can define, for instance, for social capital.",
                    "label": 1
                },
                {
                    "sent": "What could be the positive impact so it can be activity in closer virtual collaboration in existing networks?",
                    "label": 1
                },
                {
                    "sent": "Because the PVC is supported by ICT tools integration with the existing social networks which will be facilitated online in the short time.",
                    "label": 0
                },
                {
                    "sent": "What we can see that we can have improved existing social bonds and network and easier access to knowledge and social networks.",
                    "label": 1
                },
                {
                    "sent": "That which can also happen and sets interest of SIS.",
                    "label": 0
                },
                {
                    "sent": "The table is that you can also have negative expect and you must be around then.",
                    "label": 0
                },
                {
                    "sent": "For instance, if we're still dealing with this issue of social capital, APC can be in the short term and you layer or social interaction because you are member of a PVC, but you are so you are you're you're also working in a company and it can in the long term.",
                    "label": 1
                },
                {
                    "sent": "In be a desert social capital due to too many layers of social interaction and why not to the to the effect of Avatar isation so you lose your identity because you belong to too many social networks.",
                    "label": 0
                },
                {
                    "sent": "Your company and the PC.",
                    "label": 1
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "We did the same for instance, also for education and training and what positive effects you can see them for.",
                    "label": 0
                },
                {
                    "sent": "The four different stages which provides incentive to evaluate once competences and skills.",
                    "label": 0
                },
                {
                    "sent": "And the result could be the professional Theatre critique could be part of education and training process, but the negative negative aspect effect we have also detect and which should be taken into account when you create a PVC when PC is operating is.",
                    "label": 0
                },
                {
                    "sent": "It's one more technology really relative subject to learn and become aware of, and it can lead to a loss of tacit knowledge and competences with due to an excessive digital digital digitalization.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have almost finished establishing PC to foster innovation in Encino.",
                    "label": 1
                },
                {
                    "sent": "What has the challenges we have seen that the professional Utrecht community is a structure and long term framework which enables no legislation and sharing socialization and also success of collaboration opportunities for individual professional.",
                    "label": 0
                },
                {
                    "sent": "However, there is a strong need for PC to focus its activities to involve individuals and prevents knowledge dissipation.",
                    "label": 1
                },
                {
                    "sent": "And what we also need is.",
                    "label": 0
                },
                {
                    "sent": "Some efforts from the European Commission to develop a legal framework which could enable to develop cross borders PVC because for the moment it's not that easy.",
                    "label": 0
                },
                {
                    "sent": "We also need to define some key performance indicators to measure rich of objectives and what is also really important is to have shared goals and transparency.",
                    "label": 0
                },
                {
                    "sent": "In this Cup.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of my PhD thesis said I began last December.",
                    "label": 0
                },
                {
                    "sent": "I am studying.",
                    "label": 0
                },
                {
                    "sent": "Propensity of a PVC.",
                    "label": 0
                },
                {
                    "sent": "To trigger collaboration, we found out that PVC maybe to be able to detect this, we decided to use social capital concept and we used nappy and go Sharps model which which is bad based on three dimension which which is a share collective dimension share, shared values, shared stories.",
                    "label": 0
                },
                {
                    "sent": "So rational dimension which is defined by trust reciprocity.",
                    "label": 0
                },
                {
                    "sent": "And stricter than structural dimension, which is defined by the network connectivity.",
                    "label": 0
                },
                {
                    "sent": "When Appian Ghoshal defines is this three building blocks they didn't intend to make relationships between the three building bugs.",
                    "label": 0
                },
                {
                    "sent": "That's what we did, and we think that.",
                    "label": 0
                },
                {
                    "sent": "These two first building blocks here creates the interpersonal relationships which are going to create interaction corrective action and which will influence the network connectivity.",
                    "label": 0
                },
                {
                    "sent": "And this is a network connectivity which is going to impact on the efficient.",
                    "label": 0
                },
                {
                    "sent": "C of section on cooperation and coordination.",
                    "label": 0
                },
                {
                    "sent": "So I think I have finished.",
                    "label": 0
                },
                {
                    "sent": "I wanted to ask you to.",
                    "label": 0
                },
                {
                    "sent": "After this presentation, is it clearer for you where to PC is?",
                    "label": 0
                },
                {
                    "sent": "And do you have just wait?",
                    "label": 0
                },
                {
                    "sent": "Do you have in mind some examples of PVC according to where you come from, for instance?",
                    "label": 0
                },
                {
                    "sent": "I think it's like 5 fifth working groups to my mind, OK?",
                    "label": 0
                },
                {
                    "sent": "I don't do makeup.",
                    "label": 0
                },
                {
                    "sent": "Maybe once a year or something of that nature.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "University of University in Mexico were trying to deal some kind of provincial, brittle community.",
                    "label": 0
                },
                {
                    "sent": "Given a ICD platform to add to all the teachers involved at the end of the campus in Mexico and tried to bully, not except we're kind of virtual teams to respond for some consulting opportunities that comes to University.",
                    "label": 0
                },
                {
                    "sent": "So we're trying to put together all the competencies human competencies of all the teachers of the University to be able to build our really expert team, OK?",
                    "label": 0
                },
                {
                    "sent": "I can't think of a thing.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "For example, institutional electrical engineering.",
                    "label": 0
                },
                {
                    "sent": "OK. OK.",
                    "label": 0
                },
                {
                    "sent": "Camera.",
                    "label": 0
                },
                {
                    "sent": "I mean, participation to the embassy.",
                    "label": 1
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Because it's better.",
                    "label": 0
                },
                {
                    "sent": "You cannot tell a disease or something like that.",
                    "label": 0
                },
                {
                    "sent": "I mean, you can have any identity.",
                    "label": 0
                },
                {
                    "sent": "Or anyone something to do?",
                    "label": 0
                },
                {
                    "sent": "For a specific date, no.",
                    "label": 0
                },
                {
                    "sent": "It's different when when we say that a participation is on voluntary basis, it means that it's not like community of practice, which are often difficult in a company, for instance, and why you are.",
                    "label": 0
                },
                {
                    "sent": "You are invited.",
                    "label": 0
                },
                {
                    "sent": "Between brokers to participate that if you want to join a PVC, you're free to do it, but after that after this, you're free to participate to virtual team which are not business oriented.",
                    "label": 0
                },
                {
                    "sent": "If you just want to be in the professional community to create and exchange knowledge, for instance, this is not a problem.",
                    "label": 0
                },
                {
                    "sent": "But if you decide to go to work on business opportunities, for instance you will, you will sign a contract contract because we've developed templates.",
                    "label": 0
                },
                {
                    "sent": "And you have some obligations to respect.",
                    "label": 0
                },
                {
                    "sent": "Did answer.",
                    "label": 0
                },
                {
                    "sent": "Going into the virtual community, you're like making some kind of moral contract because you're you also fell asleep just just seeing what's happening there.",
                    "label": 0
                },
                {
                    "sent": "That community?",
                    "label": 1
                },
                {
                    "sent": "Perhaps it's gonna reject you because we have to participate within it.",
                    "label": 0
                },
                {
                    "sent": "Yes, you can be an active member without participating to business opportunities.",
                    "label": 0
                },
                {
                    "sent": "Because you can deliver information you can be initiator of collaboration opportunity because you have heard that this customer raycrisis exercise.",
                    "label": 0
                },
                {
                    "sent": "But you can decide on your own not to participate to some business phase which is of your chanting.",
                    "label": 0
                },
                {
                    "sent": "You know how?",
                    "label": 0
                },
                {
                    "sent": "Violence and PVCS OK.",
                    "label": 0
                },
                {
                    "sent": "In my opinion, there was this difference in the degree of expertise.",
                    "label": 0
                },
                {
                    "sent": "I think I think so.",
                    "label": 0
                },
                {
                    "sent": "Main difference is that in a VB you're dealing with organizations such as SMEs for instance, or universities or schools, and in professional veteran it is.",
                    "label": 1
                },
                {
                    "sent": "You're you're dealing with individual professionals who can belong to a company and.",
                    "label": 0
                },
                {
                    "sent": "Work 20% of the time for the PC or who can be freelancers.",
                    "label": 0
                },
                {
                    "sent": "Because I don't have the figures in mind, but I read that in Europe some more and more freelancers people leaving the companion trying to work on their own.",
                    "label": 0
                },
                {
                    "sent": "Open.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "According to their field, yes, yes.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "In the open source projects like the Linux project.",
                    "label": 0
                },
                {
                    "sent": "People.",
                    "label": 1
                },
                {
                    "sent": "Select PVC or virtual tools,, task or come with a database, yes, but I think there are many differences between C specific case of open source where some information is qualified and really easy to.",
                    "label": 0
                },
                {
                    "sent": "It's really easy to share it because you've got guidelines for instance and you have documentation associated and knowledge is not tested.",
                    "label": 0
                },
                {
                    "sent": "In a community of little PC is quite different because the knowledge is often tested and you need a way to make it explicit.",
                    "label": 0
                },
                {
                    "sent": "So this can be under face to face meetings for instance, or virtual meetings.",
                    "label": 0
                },
                {
                    "sent": "That's a difference, Ann.",
                    "label": 0
                },
                {
                    "sent": "I think the product in it, that's what I wrote in the paper for open source communities say they're really put the production system because they are able to deliver product.",
                    "label": 0
                },
                {
                    "sent": "But it's not.",
                    "label": 0
                },
                {
                    "sent": "It's not the case here in professional virtual communities where we are modeling with expertise, for instance.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Neighbors.",
                    "label": 0
                },
                {
                    "sent": "But I thought it was coming in factories.",
                    "label": 0
                },
                {
                    "sent": "Now I learned it was actually professional virtual community so.",
                    "label": 0
                },
                {
                    "sent": "But why?",
                    "label": 0
                },
                {
                    "sent": "Why do you think it was more pieces and the community of practice?",
                    "label": 0
                },
                {
                    "sent": "Because you had some business, strong business orientation and as a form of it renting?",
                    "label": 0
                },
                {
                    "sent": "OK. Our customers with an idea Community, practices that could improve.",
                    "label": 0
                },
                {
                    "sent": "Have this concept yet to say and my my thing that I've been wondering is that I really do that community of practice disappears after certain amount of time.",
                    "label": 0
                },
                {
                    "sent": "But how to make in the marketing interesting marketing?",
                    "label": 0
                },
                {
                    "sent": "So how to make it work with X?",
                    "label": 0
                },
                {
                    "sent": "Your organization.",
                    "label": 0
                },
                {
                    "sent": "100% of your salary.",
                    "label": 0
                },
                {
                    "sent": "There is a time to make it usable exit.",
                    "label": 0
                },
                {
                    "sent": "How do you help anyone?",
                    "label": 0
                },
                {
                    "sent": "Do it actually does.",
                    "label": 0
                },
                {
                    "sent": "Active members members.",
                    "label": 0
                },
                {
                    "sent": "Their penetration members all join needed be back at the time were not active.",
                    "label": 0
                },
                {
                    "sent": "You might even have some special.",
                    "label": 0
                },
                {
                    "sent": "It wasn't really used to be done.",
                    "label": 0
                },
                {
                    "sent": "In the air there is no.",
                    "label": 0
                },
                {
                    "sent": "Meeting of the community, but I try once more.",
                    "label": 0
                },
                {
                    "sent": "Like yes, it shows it shows in bottoms of CM.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "I like that.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much Sir.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}