{
    "id": "oqcyspmvsqd5hxxmkixgu4rzsk3d27p3",
    "title": "Short- and long-term predictability. Relation to weather and climate models",
    "info": {
        "author": [
            "Lasko Basnarkov, Faculty of Computer Science and Engineering (FCSE), St. Cyril and Methodius University in Skopje"
        ],
        "published": "April 24, 2014",
        "recorded": "April 2014",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/sumosummerschool2013_basnarkov_predictability/",
    "segmentation": [
        [
            "Sorry.",
            "Um?"
        ],
        [
            "Here is Ellen."
        ],
        [
            "Start.",
            "The idea is to share with you some experience.",
            "Our group is gained or working on this topic on the project.",
            "And.",
            "First, we will speak a little bit about models, generally methodology into logical science.",
            "Then how we can use those models for making the directions, whether short or long term?",
            "And we will generally introduce subclasses.",
            "Maybe some of them are familiar to you, but you like to verify them.",
            "Course will show you some examples making forward understandable."
        ],
        [
            "So even in Oxford Dictionary we can find a good definition of normal.",
            "OK, that model is a simplified.",
            "Hot spot for one.",
            "Process, which is our calculations and.",
            "So I think it contains a lot of information you need 'cause there is.",
            "Or process which is some phenomenon or some object in the nature that we want to understand?",
            "The mechanism will work or try to make predictions or make a control of that.",
            "And the examples of systems that we're working with range from the foreign particles are entry particles and extend as far as like?",
            "Why not system or human brain?",
            "Human bodies society so long?",
            "And make models.",
            "We just make a lot of.",
            "Neglection about some things that we think are not important enough and vent or find some basic concepts or observed physics we have experienced with.",
            "This, or Virginia's media frictionless surface.",
            "So on, and we attach or find some.",
            "Wanted this through the process.",
            "And again, we aim to make connection between those quantities.",
            "Windows rivals.",
            "Relations."
        ],
        [
            "For the atmosphere, most appropriate models are off base.",
            "Systems although we have a lot in previous talks this morning.",
            "Just repeat some things.",
            "So we have an ecosystem is a mathematical object system of ordinary differential equations.",
            "And we can see there are some variables.",
            "There are three, although we observe then there is very little that explains all those variables.",
            "Changing time, rate of change, both trials and then there are some parameters which are generally constant and also there are external influences or forces that.",
            "Replace the behavior of Friday.",
            "So it is generally.",
            "Being the dynamical systems that should be used for only phenomenon general in more briefly.",
            "Atmosphere are normally not.",
            "The American rivals, but they are generally linearly from others and also.",
            "Boys are good to work with.",
            "Our goal is that not get time dependent external forces or they are.",
            "Outermost animal.",
            "We just buy.",
            "Hold appropriate are those that have.",
            "Exquisite timing random is around here for us.",
            "And the longer term used in meteorology effect are based on partial differential equations attenuate.",
            "Their solution is based again on.",
            "Ordinary differential equations."
        ],
        [
            "Tell me a good rate should have a clearer.",
            "The state space and the space is the space or except for possible problems that.",
            "That Brian was can have and one choice of the vector variables one instant of time is so called states.",
            "The system all.",
            "And we should make operation.",
            "I would say between what is it state system or of the reality of truth and what is staple 'em all that so?",
            "We have some very useful analysis, which means that by making observations, filtering and calculations about reality, we obtain analysis which is representation that reality in the space of.",
            "The pool.",
            "It is a kind of projection, ignoring.",
            "And we have natural assumption here that the reality is more complex as more dimensions or complex wages.",
            "Please describe or import the real business."
        ],
        [
            "More.",
            "Clear.",
            "I don't know what is wrong here.",
            "Or repair it.",
            "So we can imagine what I have said previously.",
            "Some system which is real system that is 3 dimensional nature, so it's evolution traces trajectory right here in three dimensional space and when we model that system.",
            "We can imagine that we model it with a 2 dimensional model, so our model will belong to the mental space or a plane.",
            "And when we make observations and calculations measurements for the system we make.",
            "Of the state of the system.",
            "In the world of the model.",
            "To make a prediction of 3D points who we make?",
            "Measurements.",
            "Time.",
            "And going off of the region for analysis.",
            "Points entries that were sick with your trajectory of owners.",
            "And we want to build a model that will all possible.",
            "Project Lee of all the analysis.",
            "So we have shown here one offer model this.",
            "A sequence of points here."
        ],
        [
            "OK. We can make a model about.",
            "Using the previous model states performing analysis as a major simulation this week.",
            "So you're not using the previous model states to form analysis doesn't need assimilation.",
            "Meaning, yeah, analysis can be if I understood well, you can use for analysis previous information so.",
            "Yeah, it is a process that uses measurements previous measurements.",
            "Put on your chart.",
            "It's just coming from.",
            "Yeah, this is just a simple figured out.",
            "So.",
            "To take 1 three case work with we can take.",
            "63 system cause it has a lot of properties that atmosphere.",
            "Yes it is nonlinear retest behavior.",
            "Or or making that list.",
            "And here we can assume that we have 6 dimensional system is reality and we observe only subset like 3 probably was.",
            "And they are influenced by the other rivals.",
            "And we can make with ratios here, train them as they make the trajectory into 3D space and try to make the model.",
            "That j.crew.",
            "Play because they measure Sounders values to parameters for these brands."
        ],
        [
            "So here we have problem.",
            "The at one.",
            "So the booth is sequence of the analysis points.",
            "Preview of driving can you bring?"
        ],
        [
            "Square or it can be of course.",
            "Of course, this is just a PC mode.",
            "So we have.",
            "Welcome here the one has."
        ],
        [
            "Sorry, S. Her and the reader is a model.",
            "So the first slide, we can think that they look quite similar, so we have a good enough.",
            "Paul."
        ],
        [
            "Yes, I've said that in the heat of action."
        ],
        [
            "There are some varieties that we are not aware of baby or we cannot serve."
        ],
        [
            "Same things, same thing happens in reality, like in the Yakima sphere.",
            "Their process is there are forces.",
            "That we can not fully understand, like power formation or the influence of dust particles in the air or.",
            "Why are seen in forests and so on?",
            "So their influence is modeled by entering, inserting some parameters in equations, and like in this case we would have to.",
            "Model."
        ],
        [
            "The purpose of this force here in this course here by some parameters."
        ],
        [
            "And there is interesting finish for meteorology, right?",
            "For the same process.",
            "Sometimes different theological centers use different parameter values for different stations, and I found this interesting.",
            "That one particular process type collection.",
            "Best scheme, right?",
            "One scheme is better according to one measure of quality.",
            "When you use another measure quality, maybe some other organization scheme will be better.",
            "So this I think is good."
        ],
        [
            "So to go back to our toy case.",
            "Information about the upper part of the equation about one.",
            "These expert we can make like.",
            "Gordon Ramsay in the offline down zero.",
            "Then we can model the sound form disappeared with the X.",
            "Where I will buy some chronicles?",
            "Alpha or the other gamma or both of them so we can take different models just to mimic the power.",
            "Different logical centers are built differently."
        ],
        [
            "We have models we have made great with the equations, then we have.",
            "Put some parameters just through model differences.",
            "Those small scale processor or hidden processes we should find which values parameters are best shoes.",
            "The predictions of the model and also the.",
            "Patience bear.",
            "Different values, parameters and the best one is chosen.",
            "Various machine learning techniques can be used as more advanced metals make basic choices.",
            "And the process modeling.",
            "When we get the smallest possible errors or do some.",
            "Function quite."
        ],
        [
            "We should make things now that there are two orders or scenarios.",
            "Gold perfect Model serial, which means that there are some processes that are good that helps put models.",
            "Which means that they are in reality, maybe reality is governed by some equation that are simple enough and we have found those equations exactly.",
            "Like the type of equations of the Model S reality?",
            "Or identical?",
            "But maybe we do not know the exact values parameters or we do not know exactly the state of the real.",
            "So there are a lot of different Nicks.",
            "Which can be used to make.",
            "A good choice of the parameter values and of the state of the system.",
            "So.",
            "One such case is based on coupling."
        ],
        [
            "Additionally Nick, which means like we want to.",
            "Logo here we have chosen the building around 63 an observation.",
            "This image that we know perfectly rather under cinnamon roll from orbit.",
            "Now we have only rough estimation.",
            "So why not G?",
            "The operation the Model arrivals works observations.",
            "And changing our estimation of parameter data we can make.",
            "The state of the model.",
            "Produce words for state of reality and also the parameters of the model.",
            "We found identical to the song here to the radio of them.",
            "For the parameter of the truth, so we have here perfect knowledge about the state of the equations, and we can make if we have known this gracious we can make almost perfect relations so."
        ],
        [
            "I have showed one example here for the previous equations like I think the look over here is.",
            "Truth, trajectory and the red one is the whole objective, which is different initial state with different parameter beta and when they are launched their recovery goals and also by creating enough time we can make them nearly identical.",
            "Then we can remove.",
            "Information from the reality to the model and let the model evolves.",
            "Cream and the model will trade the same trajectory as nearly the same.",
            "As a reality for other one time because due to the sensitive to initial conditions, if there is at least more mismatch between the states because of exponential divergance, however they will."
        ],
        [
            "Yeah, but in reality that is not the case.",
            "In fact, the reality more complex than any of these models, and maybe there are no, at least at all equations, reality or it?",
            "Is there more understand that those model?",
            "And the.",
            "No more examples that show that if we can have a like own sequence observationes, we can make a model trajectory that will hold up.",
            "But if you want to predict the next observation, the model will fail, so there is no such model that any place will work like you predict all.",
            "Subsequent observation.",
            "And this is due to so-called direction error.",
            "So it will be more clear."
        ],
        [
            "OK, we have to wait.",
            "A little off.",
            "So.",
            "We have I said the operations here.",
            "They traced the analysis of the observations traits projector in the space modes.",
            "So as a proxy for dependency of the change of of the state of reality, we can assume that the difference between measurements.",
            "Or we can use by methods may be better.",
            "When we use model trajectory then it's the last.",
            "These responses at.",
            "At the point duration so generally always the vectors of the rationes deprivation.",
            "And then the model will not be clearer.",
            "They could have also differences in August as well.",
            "So if there is differences in the tendencies, even if we have perfect knowledge of the state.",
            "The next moment.",
            "The prediction will be performed.",
            "The the next measure.",
            "So you do this so called model errors, which means the model is.",
            "Simpler than the reality.",
            "And the different equations is able.",
            "Our predictions are limited.",
            "OK."
        ],
        [
            "So let us see what means roughly short what is already.",
            "So for short term prediction or a list.",
            "Dayforce journalists.",
            "At some point.",
            "And maybe by using it and it's history, maybe previous analysis?",
            "We estimate of the next dollars or over the next state of freon.",
            "Asia.",
            "Information can be brave simply by running the model.",
            "Home of the analysis point is initial condition so."
        ],
        [
            "Like this region and we run the model.",
            "From this point."
        ],
        [
            "And how good are we in?",
            "All the way through line by finding the difference between what we have estimated win exploration and what it will appear.",
            "It is simply the distance between those two points in the space of the more.",
            "This would mean like for meteorology when we have like 3 variables like aperture pression community and we find repeatedly static pressure difference unit difference.",
            "Unless we are interested, only subsequent arrivals.",
            "Very interesting, only difference."
        ],
        [
            "So for the.",
            "Driven more in 63.",
            "It will look like this.",
            "We have trajectory alterations.",
            "We wanted one and we have three different toys.",
            "All of them started from.",
            "There is a racial.",
            "There is noise.",
            "There is no measurement error.",
            "And there are different predictions for some future state which is there is game point of these curves.",
            "And the.",
            "180 for the error of the prediction would be the distance between.",
            "The endpoint is eration of the models.",
            "And sometimes if we are in responding home arrival, we can find all the difference in Y.",
            "Rights."
        ],
        [
            "What is the weather prediction?",
            "So we can start working mythology girls questions on logical questions.",
            "So they are interested more in estimating the average values, right?",
            "Average rental station home.",
            "And then working with dynamical systems racial equations outrageous are generally found by using the early city principle, which means either we can run one long trajectory and find the average rate is that projectory, or we can make an example prediction which means.",
            "Large number of visual points, 8 integrations and finding example.",
            "Here we come to the tracker, which is we have heard about or similar trackers previous exploiting cycle there can be.",
            "So Rosie, why not?",
            "That's the time system amuze or finding the.",
            "So when we are interested in finding average values or some dynamical system which is model some reality, we would like to find tractor or density of states that attract database and from there we can extract 1.",
            "Rock.",
            "Tractors that we're used to work with her well.",
            "Those that are generally four of the normal, then inconsistent, which means they don't care explicitly and or I will see."
        ],
        [
            "But what we have with the atmosphere?",
            "Atmosphere or ocean?",
            "Open system, which means there is external proxy.",
            "Sample song and there is also an important issue which is a recorded increase in the concentration in the air for Model Y CO2 percent.",
            "Asian is influence on the Apple sphere.",
            "I suppose, or rather it should be independent.",
            "Push through the need different ways.",
            "And so these make is a straight assumption about conference prompts when good short-term prediction like a few days.",
            "Hey Cortana.",
            "While working for 100 years, they will change.",
            "So one typical question, maybe the most interesting question from terminologies is what will be the mean annual?",
            "Average temperature of Europe against this century.",
            "So Google tractors that we have heard before settling for East or also parameters systems.",
            "And the Earth climate is system which has accuracy and branded or just we should find something else which would be more."
        ],
        [
            "We come home so cold.",
            "Here is mathematics about it, which means it is an exposure or generalization of the attractor, or.",
            "Random or not, almost or explicitly or.",
            "And of course system so."
        ],
        [
            "Where is boat slide will be more clear?",
            "How we update the previous.",
            "Soon.",
            "Weeks otherwise read story back attractors variety.",
            "So we get for giving notice after we can run start the dynamical system starting from one point.",
            "We threw out the transient and just pulled the trickery.",
            "It is a visualization of the truck in fact.",
            "Actually later.",
            "Or we can make.",
            "Run of large number.",
            "Their Christmas party home around chosen initially and issues with charcoal tracker and observe them or like wait for awhile just.",
            "And observe their positions in the base case.",
            "So I will show you one image of that later.",
            "I cannot put the DP because the agent now.",
            "And we can find one thing that.",
            "When we work with this.",
            "Case like Rhonda example, initial conditions for the J. Chris and when we observe them in some Eastern Time.",
            "The image will proximate we see or the density of both space points in the.",
            "Please, please, we won't change.",
            "But when we have full background.",
            "Great job, there is something that is something starting with large number of your points and observing them at one or people into intact.",
            "And that is where when the.",
            "Regions of the system are explicitly and ended, and the dropper sheets shape basically with changing.",
            "We"
        ],
        [
            "Get more air.",
            "We can take one simple example.",
            "Leader, but.",
            "Not always.",
            "Little different initial points.",
            "An actual three of them.",
            "Here they will all collapse one projection, so we can say that the attractor of this system is a point.",
            "Only one point but its position in the space.",
            "We have only once favorable or X if changing entire row."
        ],
        [
            "Them for like 100.",
            "Time steps and we obtain the red points.",
            "So this look likes the Lorenz attractor.",
            "If any one of you have seen it from this perspective.",
            "But as time goes on because row is changing, the dynamical system is changing.",
            "So if we make a snapshot of all those trajectories at moment 200, we have see we will see a shift or change of the image.",
            "As a comparison, if we integrate the ordinary Loren system with Ro Sigma Beta constant.",
            "Whenever we make a snapshot of the attractor, we will always obtain.",
            "This is approximately the same the same image, so it means that when we have some parameter changing like CO2 concentration.",
            "The average is the the expectation of the average, like if rival Z is temperature, it will change.",
            "So in the first case we cause the whole attractors.",
            "Down its value will be smaller than the value obtained from the averaging the Z variable of these blue points here.",
            "So this is a more appropriate object that we should work.",
            "When we want to answer climatological questions like what will happen when the conditions on the Earth or the atmosphere change?"
        ],
        [
            "And I would say.",
            "One more thing which is interesting.",
            "Like we are all interested in prediction where either short or long term because our behavior, our actions, our life depends on the on the weather so.",
            "We make plan when we have.",
            "And we want we plan make plan for tomorrow if it is sunny then we can go to the beach here of it is rainy.",
            "We should have Plan B and the idea is because we have imperfect models here.",
            "Which means that we cannot make perfect prediction.",
            "And if we rely on only one model or only one prediction, then it can say tomorrow will be sunny and we will prepare for it.",
            "But why shouldn't we try to make 100 predictions and make intentionally some mistakes or errors in the equations?",
            "And if one of them reports rain that then we will be aware that there is some possibility about some other outcome for the weather tomorrow, so maybe we should prepare for that case.",
            "Maybe this example is not so important, but knowing that there is maybe.",
            "Very strong draught upcoming in a summer or some flood then maybe especially the government should or the public should prepare for such events.",
            "So we come to so called.",
            "Probabilistic forecasts, which are based on.",
            "Using different models, different runs, different predictions and giving weights to them."
        ],
        [
            "So.",
            "1 technical term about this.",
            "Prediction based on probability, so called uncertainty.",
            "So first of all we are not always certain about the state of the atmosphere on the Earth.",
            "Like if we have measurement about the temperature in offret we know only in over it we do not know about like 50 kilometers from it.",
            "We have only rough estimation of it.",
            "So, and this uncertainty in the state will affect the predictions.",
            "So the predictions that we will make, we can make various predictions have some uncertainty.",
            "And we would like to estimate how large is that uncertainty?",
            "So.",
            "To make this more clear, we can.",
            "Take one assemble of predictions like 50 predictions.",
            "Then find the average values about temperature, pressure and so on and report those averages at our is our best estimate with future state.",
            "That is one thing the mean and the other thing.",
            "The uncertainty about our prediction is so called spread, which is the standard deviation of this answer, and we want to have.",
            "A good estimate of how large is this spread?"
        ],
        [
            "OK.",
            "So.",
            "Here we have that kind of example.",
            "So here we are shown the measurements for the future.",
            "So we are at this moment now we want to make predictions for the next 5 days.",
            "And we make runs of different.",
            "Starting from different initial conditions here, like we use one model, but we make perturbation of this observation.",
            "We will obtain different predictions and by finding the average of them, we say that most probably the state of the weather.",
            "Here for tomorrow will be at this point and it appeared OK in this case that it is not the same, but it is close.",
            "The standard deviation of this ansambl is shown by this ellipse here, so we would be good will dissatisfy by this prediction method if the.",
            "The outcome is always within.",
            "Let us say one standard deviation of the prediction, but it appears that sometimes.",
            "The the the real.",
            "Weather for the next day is outside of this one standard deviation, so the idea is that we should always make appropriate.",
            "Spread.",
            "A large enough spread, not too large or but large enough spread such that the.",
            "The next observation.",
            "Will be within one standard deviation."
        ],
        [
            "So which are possible ways of making an ensemble?",
            "So the first one was shown previously, like we can use one model, take different initial conditions, make perturbations.",
            "An random independent.",
            "2nd way of doing that is taking different parameter values in the models like make perturbations of the parameters.",
            "And it was obtained that generally the second type of making and assemble is better than the previous one, because it has."
        ],
        [
            "Larger spreads, larger standard deviation then.",
            "The first one."
        ],
        [
            "There is also a recent.",
            "Experimentation.",
            "With the supposed to plastic parameterization, which means instead of taking constants as parameters, may adding noise to them and and assemble members are taken.",
            "The trajectories obtained from different realizations of the noise.",
            "Anne.",
            "The newest one is the Super idea.",
            "To use those example members share information with each other while running in order.",
            "Of course, to make better predictions."
        ],
        [
            "So I would summarize about the concepts that I have talked about now.",
            "Which I find to be interesting and important when working with short or long term prediction.",
            "First one is that we should be aware that the models are not perfect.",
            "Then instead of taking the ordinary attractor or taking autonomous dynamical systems for the climate for making long term predictions, we should consider so-called who Becca tractor and also that instead of using one single prediction, we should make predictions based on probability or using and assembles."
        ],
        [
            "So I have listed some.",
            "Papers that I was reading while preparing this and I find.",
            "To be interesting and worth reading.",
            "So there are some of them about imperfect models.",
            "There is one about pullback attractor, of course you can find more in the references there."
        ],
        [
            "And.",
            "Few of them about.",
            "Probabilistic probability based or example based forecasts."
        ],
        [
            "So I would like to thank all my colleagues from the project.",
            "Or making better understanding this topic.",
            "Specially, ellipticals are an evil triple ski.",
            "With whom I was working most."
        ],
        [
            "And you for listening."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is Ellen.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Start.",
                    "label": 0
                },
                {
                    "sent": "The idea is to share with you some experience.",
                    "label": 0
                },
                {
                    "sent": "Our group is gained or working on this topic on the project.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "First, we will speak a little bit about models, generally methodology into logical science.",
                    "label": 0
                },
                {
                    "sent": "Then how we can use those models for making the directions, whether short or long term?",
                    "label": 0
                },
                {
                    "sent": "And we will generally introduce subclasses.",
                    "label": 0
                },
                {
                    "sent": "Maybe some of them are familiar to you, but you like to verify them.",
                    "label": 0
                },
                {
                    "sent": "Course will show you some examples making forward understandable.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So even in Oxford Dictionary we can find a good definition of normal.",
                    "label": 0
                },
                {
                    "sent": "OK, that model is a simplified.",
                    "label": 0
                },
                {
                    "sent": "Hot spot for one.",
                    "label": 0
                },
                {
                    "sent": "Process, which is our calculations and.",
                    "label": 0
                },
                {
                    "sent": "So I think it contains a lot of information you need 'cause there is.",
                    "label": 0
                },
                {
                    "sent": "Or process which is some phenomenon or some object in the nature that we want to understand?",
                    "label": 1
                },
                {
                    "sent": "The mechanism will work or try to make predictions or make a control of that.",
                    "label": 0
                },
                {
                    "sent": "And the examples of systems that we're working with range from the foreign particles are entry particles and extend as far as like?",
                    "label": 0
                },
                {
                    "sent": "Why not system or human brain?",
                    "label": 1
                },
                {
                    "sent": "Human bodies society so long?",
                    "label": 0
                },
                {
                    "sent": "And make models.",
                    "label": 0
                },
                {
                    "sent": "We just make a lot of.",
                    "label": 0
                },
                {
                    "sent": "Neglection about some things that we think are not important enough and vent or find some basic concepts or observed physics we have experienced with.",
                    "label": 0
                },
                {
                    "sent": "This, or Virginia's media frictionless surface.",
                    "label": 0
                },
                {
                    "sent": "So on, and we attach or find some.",
                    "label": 0
                },
                {
                    "sent": "Wanted this through the process.",
                    "label": 0
                },
                {
                    "sent": "And again, we aim to make connection between those quantities.",
                    "label": 0
                },
                {
                    "sent": "Windows rivals.",
                    "label": 0
                },
                {
                    "sent": "Relations.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the atmosphere, most appropriate models are off base.",
                    "label": 1
                },
                {
                    "sent": "Systems although we have a lot in previous talks this morning.",
                    "label": 0
                },
                {
                    "sent": "Just repeat some things.",
                    "label": 0
                },
                {
                    "sent": "So we have an ecosystem is a mathematical object system of ordinary differential equations.",
                    "label": 0
                },
                {
                    "sent": "And we can see there are some variables.",
                    "label": 0
                },
                {
                    "sent": "There are three, although we observe then there is very little that explains all those variables.",
                    "label": 0
                },
                {
                    "sent": "Changing time, rate of change, both trials and then there are some parameters which are generally constant and also there are external influences or forces that.",
                    "label": 0
                },
                {
                    "sent": "Replace the behavior of Friday.",
                    "label": 0
                },
                {
                    "sent": "So it is generally.",
                    "label": 0
                },
                {
                    "sent": "Being the dynamical systems that should be used for only phenomenon general in more briefly.",
                    "label": 0
                },
                {
                    "sent": "Atmosphere are normally not.",
                    "label": 0
                },
                {
                    "sent": "The American rivals, but they are generally linearly from others and also.",
                    "label": 0
                },
                {
                    "sent": "Boys are good to work with.",
                    "label": 0
                },
                {
                    "sent": "Our goal is that not get time dependent external forces or they are.",
                    "label": 0
                },
                {
                    "sent": "Outermost animal.",
                    "label": 0
                },
                {
                    "sent": "We just buy.",
                    "label": 0
                },
                {
                    "sent": "Hold appropriate are those that have.",
                    "label": 0
                },
                {
                    "sent": "Exquisite timing random is around here for us.",
                    "label": 0
                },
                {
                    "sent": "And the longer term used in meteorology effect are based on partial differential equations attenuate.",
                    "label": 1
                },
                {
                    "sent": "Their solution is based again on.",
                    "label": 0
                },
                {
                    "sent": "Ordinary differential equations.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tell me a good rate should have a clearer.",
                    "label": 0
                },
                {
                    "sent": "The state space and the space is the space or except for possible problems that.",
                    "label": 1
                },
                {
                    "sent": "That Brian was can have and one choice of the vector variables one instant of time is so called states.",
                    "label": 0
                },
                {
                    "sent": "The system all.",
                    "label": 0
                },
                {
                    "sent": "And we should make operation.",
                    "label": 0
                },
                {
                    "sent": "I would say between what is it state system or of the reality of truth and what is staple 'em all that so?",
                    "label": 0
                },
                {
                    "sent": "We have some very useful analysis, which means that by making observations, filtering and calculations about reality, we obtain analysis which is representation that reality in the space of.",
                    "label": 1
                },
                {
                    "sent": "The pool.",
                    "label": 0
                },
                {
                    "sent": "It is a kind of projection, ignoring.",
                    "label": 0
                },
                {
                    "sent": "And we have natural assumption here that the reality is more complex as more dimensions or complex wages.",
                    "label": 1
                },
                {
                    "sent": "Please describe or import the real business.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More.",
                    "label": 0
                },
                {
                    "sent": "Clear.",
                    "label": 0
                },
                {
                    "sent": "I don't know what is wrong here.",
                    "label": 0
                },
                {
                    "sent": "Or repair it.",
                    "label": 0
                },
                {
                    "sent": "So we can imagine what I have said previously.",
                    "label": 0
                },
                {
                    "sent": "Some system which is real system that is 3 dimensional nature, so it's evolution traces trajectory right here in three dimensional space and when we model that system.",
                    "label": 0
                },
                {
                    "sent": "We can imagine that we model it with a 2 dimensional model, so our model will belong to the mental space or a plane.",
                    "label": 1
                },
                {
                    "sent": "And when we make observations and calculations measurements for the system we make.",
                    "label": 0
                },
                {
                    "sent": "Of the state of the system.",
                    "label": 1
                },
                {
                    "sent": "In the world of the model.",
                    "label": 0
                },
                {
                    "sent": "To make a prediction of 3D points who we make?",
                    "label": 0
                },
                {
                    "sent": "Measurements.",
                    "label": 0
                },
                {
                    "sent": "Time.",
                    "label": 0
                },
                {
                    "sent": "And going off of the region for analysis.",
                    "label": 0
                },
                {
                    "sent": "Points entries that were sick with your trajectory of owners.",
                    "label": 0
                },
                {
                    "sent": "And we want to build a model that will all possible.",
                    "label": 0
                },
                {
                    "sent": "Project Lee of all the analysis.",
                    "label": 0
                },
                {
                    "sent": "So we have shown here one offer model this.",
                    "label": 0
                },
                {
                    "sent": "A sequence of points here.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK. We can make a model about.",
                    "label": 0
                },
                {
                    "sent": "Using the previous model states performing analysis as a major simulation this week.",
                    "label": 0
                },
                {
                    "sent": "So you're not using the previous model states to form analysis doesn't need assimilation.",
                    "label": 0
                },
                {
                    "sent": "Meaning, yeah, analysis can be if I understood well, you can use for analysis previous information so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it is a process that uses measurements previous measurements.",
                    "label": 0
                },
                {
                    "sent": "Put on your chart.",
                    "label": 0
                },
                {
                    "sent": "It's just coming from.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is just a simple figured out.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To take 1 three case work with we can take.",
                    "label": 0
                },
                {
                    "sent": "63 system cause it has a lot of properties that atmosphere.",
                    "label": 0
                },
                {
                    "sent": "Yes it is nonlinear retest behavior.",
                    "label": 0
                },
                {
                    "sent": "Or or making that list.",
                    "label": 0
                },
                {
                    "sent": "And here we can assume that we have 6 dimensional system is reality and we observe only subset like 3 probably was.",
                    "label": 0
                },
                {
                    "sent": "And they are influenced by the other rivals.",
                    "label": 0
                },
                {
                    "sent": "And we can make with ratios here, train them as they make the trajectory into 3D space and try to make the model.",
                    "label": 0
                },
                {
                    "sent": "That j.crew.",
                    "label": 0
                },
                {
                    "sent": "Play because they measure Sounders values to parameters for these brands.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we have problem.",
                    "label": 0
                },
                {
                    "sent": "The at one.",
                    "label": 0
                },
                {
                    "sent": "So the booth is sequence of the analysis points.",
                    "label": 1
                },
                {
                    "sent": "Preview of driving can you bring?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Square or it can be of course.",
                    "label": 0
                },
                {
                    "sent": "Of course, this is just a PC mode.",
                    "label": 0
                },
                {
                    "sent": "So we have.",
                    "label": 0
                },
                {
                    "sent": "Welcome here the one has.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorry, S. Her and the reader is a model.",
                    "label": 0
                },
                {
                    "sent": "So the first slide, we can think that they look quite similar, so we have a good enough.",
                    "label": 0
                },
                {
                    "sent": "Paul.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes, I've said that in the heat of action.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are some varieties that we are not aware of baby or we cannot serve.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Same things, same thing happens in reality, like in the Yakima sphere.",
                    "label": 0
                },
                {
                    "sent": "Their process is there are forces.",
                    "label": 0
                },
                {
                    "sent": "That we can not fully understand, like power formation or the influence of dust particles in the air or.",
                    "label": 0
                },
                {
                    "sent": "Why are seen in forests and so on?",
                    "label": 0
                },
                {
                    "sent": "So their influence is modeled by entering, inserting some parameters in equations, and like in this case we would have to.",
                    "label": 0
                },
                {
                    "sent": "Model.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The purpose of this force here in this course here by some parameters.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And there is interesting finish for meteorology, right?",
                    "label": 0
                },
                {
                    "sent": "For the same process.",
                    "label": 0
                },
                {
                    "sent": "Sometimes different theological centers use different parameter values for different stations, and I found this interesting.",
                    "label": 0
                },
                {
                    "sent": "That one particular process type collection.",
                    "label": 0
                },
                {
                    "sent": "Best scheme, right?",
                    "label": 0
                },
                {
                    "sent": "One scheme is better according to one measure of quality.",
                    "label": 1
                },
                {
                    "sent": "When you use another measure quality, maybe some other organization scheme will be better.",
                    "label": 0
                },
                {
                    "sent": "So this I think is good.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to go back to our toy case.",
                    "label": 0
                },
                {
                    "sent": "Information about the upper part of the equation about one.",
                    "label": 0
                },
                {
                    "sent": "These expert we can make like.",
                    "label": 0
                },
                {
                    "sent": "Gordon Ramsay in the offline down zero.",
                    "label": 0
                },
                {
                    "sent": "Then we can model the sound form disappeared with the X.",
                    "label": 0
                },
                {
                    "sent": "Where I will buy some chronicles?",
                    "label": 0
                },
                {
                    "sent": "Alpha or the other gamma or both of them so we can take different models just to mimic the power.",
                    "label": 0
                },
                {
                    "sent": "Different logical centers are built differently.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have models we have made great with the equations, then we have.",
                    "label": 0
                },
                {
                    "sent": "Put some parameters just through model differences.",
                    "label": 0
                },
                {
                    "sent": "Those small scale processor or hidden processes we should find which values parameters are best shoes.",
                    "label": 0
                },
                {
                    "sent": "The predictions of the model and also the.",
                    "label": 0
                },
                {
                    "sent": "Patience bear.",
                    "label": 0
                },
                {
                    "sent": "Different values, parameters and the best one is chosen.",
                    "label": 0
                },
                {
                    "sent": "Various machine learning techniques can be used as more advanced metals make basic choices.",
                    "label": 0
                },
                {
                    "sent": "And the process modeling.",
                    "label": 0
                },
                {
                    "sent": "When we get the smallest possible errors or do some.",
                    "label": 0
                },
                {
                    "sent": "Function quite.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We should make things now that there are two orders or scenarios.",
                    "label": 0
                },
                {
                    "sent": "Gold perfect Model serial, which means that there are some processes that are good that helps put models.",
                    "label": 1
                },
                {
                    "sent": "Which means that they are in reality, maybe reality is governed by some equation that are simple enough and we have found those equations exactly.",
                    "label": 0
                },
                {
                    "sent": "Like the type of equations of the Model S reality?",
                    "label": 0
                },
                {
                    "sent": "Or identical?",
                    "label": 0
                },
                {
                    "sent": "But maybe we do not know the exact values parameters or we do not know exactly the state of the real.",
                    "label": 0
                },
                {
                    "sent": "So there are a lot of different Nicks.",
                    "label": 0
                },
                {
                    "sent": "Which can be used to make.",
                    "label": 0
                },
                {
                    "sent": "A good choice of the parameter values and of the state of the system.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "One such case is based on coupling.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Additionally Nick, which means like we want to.",
                    "label": 0
                },
                {
                    "sent": "Logo here we have chosen the building around 63 an observation.",
                    "label": 0
                },
                {
                    "sent": "This image that we know perfectly rather under cinnamon roll from orbit.",
                    "label": 0
                },
                {
                    "sent": "Now we have only rough estimation.",
                    "label": 0
                },
                {
                    "sent": "So why not G?",
                    "label": 0
                },
                {
                    "sent": "The operation the Model arrivals works observations.",
                    "label": 0
                },
                {
                    "sent": "And changing our estimation of parameter data we can make.",
                    "label": 0
                },
                {
                    "sent": "The state of the model.",
                    "label": 0
                },
                {
                    "sent": "Produce words for state of reality and also the parameters of the model.",
                    "label": 0
                },
                {
                    "sent": "We found identical to the song here to the radio of them.",
                    "label": 0
                },
                {
                    "sent": "For the parameter of the truth, so we have here perfect knowledge about the state of the equations, and we can make if we have known this gracious we can make almost perfect relations so.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have showed one example here for the previous equations like I think the look over here is.",
                    "label": 0
                },
                {
                    "sent": "Truth, trajectory and the red one is the whole objective, which is different initial state with different parameter beta and when they are launched their recovery goals and also by creating enough time we can make them nearly identical.",
                    "label": 0
                },
                {
                    "sent": "Then we can remove.",
                    "label": 0
                },
                {
                    "sent": "Information from the reality to the model and let the model evolves.",
                    "label": 0
                },
                {
                    "sent": "Cream and the model will trade the same trajectory as nearly the same.",
                    "label": 0
                },
                {
                    "sent": "As a reality for other one time because due to the sensitive to initial conditions, if there is at least more mismatch between the states because of exponential divergance, however they will.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, but in reality that is not the case.",
                    "label": 0
                },
                {
                    "sent": "In fact, the reality more complex than any of these models, and maybe there are no, at least at all equations, reality or it?",
                    "label": 1
                },
                {
                    "sent": "Is there more understand that those model?",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 1
                },
                {
                    "sent": "No more examples that show that if we can have a like own sequence observationes, we can make a model trajectory that will hold up.",
                    "label": 1
                },
                {
                    "sent": "But if you want to predict the next observation, the model will fail, so there is no such model that any place will work like you predict all.",
                    "label": 0
                },
                {
                    "sent": "Subsequent observation.",
                    "label": 1
                },
                {
                    "sent": "And this is due to so-called direction error.",
                    "label": 0
                },
                {
                    "sent": "So it will be more clear.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, we have to wait.",
                    "label": 0
                },
                {
                    "sent": "A little off.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We have I said the operations here.",
                    "label": 0
                },
                {
                    "sent": "They traced the analysis of the observations traits projector in the space modes.",
                    "label": 0
                },
                {
                    "sent": "So as a proxy for dependency of the change of of the state of reality, we can assume that the difference between measurements.",
                    "label": 1
                },
                {
                    "sent": "Or we can use by methods may be better.",
                    "label": 0
                },
                {
                    "sent": "When we use model trajectory then it's the last.",
                    "label": 0
                },
                {
                    "sent": "These responses at.",
                    "label": 0
                },
                {
                    "sent": "At the point duration so generally always the vectors of the rationes deprivation.",
                    "label": 0
                },
                {
                    "sent": "And then the model will not be clearer.",
                    "label": 0
                },
                {
                    "sent": "They could have also differences in August as well.",
                    "label": 0
                },
                {
                    "sent": "So if there is differences in the tendencies, even if we have perfect knowledge of the state.",
                    "label": 0
                },
                {
                    "sent": "The next moment.",
                    "label": 0
                },
                {
                    "sent": "The prediction will be performed.",
                    "label": 0
                },
                {
                    "sent": "The the next measure.",
                    "label": 0
                },
                {
                    "sent": "So you do this so called model errors, which means the model is.",
                    "label": 0
                },
                {
                    "sent": "Simpler than the reality.",
                    "label": 0
                },
                {
                    "sent": "And the different equations is able.",
                    "label": 0
                },
                {
                    "sent": "Our predictions are limited.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let us see what means roughly short what is already.",
                    "label": 0
                },
                {
                    "sent": "So for short term prediction or a list.",
                    "label": 0
                },
                {
                    "sent": "Dayforce journalists.",
                    "label": 0
                },
                {
                    "sent": "At some point.",
                    "label": 0
                },
                {
                    "sent": "And maybe by using it and it's history, maybe previous analysis?",
                    "label": 1
                },
                {
                    "sent": "We estimate of the next dollars or over the next state of freon.",
                    "label": 1
                },
                {
                    "sent": "Asia.",
                    "label": 1
                },
                {
                    "sent": "Information can be brave simply by running the model.",
                    "label": 0
                },
                {
                    "sent": "Home of the analysis point is initial condition so.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Like this region and we run the model.",
                    "label": 0
                },
                {
                    "sent": "From this point.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And how good are we in?",
                    "label": 0
                },
                {
                    "sent": "All the way through line by finding the difference between what we have estimated win exploration and what it will appear.",
                    "label": 0
                },
                {
                    "sent": "It is simply the distance between those two points in the space of the more.",
                    "label": 0
                },
                {
                    "sent": "This would mean like for meteorology when we have like 3 variables like aperture pression community and we find repeatedly static pressure difference unit difference.",
                    "label": 0
                },
                {
                    "sent": "Unless we are interested, only subsequent arrivals.",
                    "label": 0
                },
                {
                    "sent": "Very interesting, only difference.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for the.",
                    "label": 0
                },
                {
                    "sent": "Driven more in 63.",
                    "label": 0
                },
                {
                    "sent": "It will look like this.",
                    "label": 0
                },
                {
                    "sent": "We have trajectory alterations.",
                    "label": 0
                },
                {
                    "sent": "We wanted one and we have three different toys.",
                    "label": 0
                },
                {
                    "sent": "All of them started from.",
                    "label": 0
                },
                {
                    "sent": "There is a racial.",
                    "label": 0
                },
                {
                    "sent": "There is noise.",
                    "label": 0
                },
                {
                    "sent": "There is no measurement error.",
                    "label": 0
                },
                {
                    "sent": "And there are different predictions for some future state which is there is game point of these curves.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "180 for the error of the prediction would be the distance between.",
                    "label": 0
                },
                {
                    "sent": "The endpoint is eration of the models.",
                    "label": 0
                },
                {
                    "sent": "And sometimes if we are in responding home arrival, we can find all the difference in Y.",
                    "label": 0
                },
                {
                    "sent": "Rights.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is the weather prediction?",
                    "label": 0
                },
                {
                    "sent": "So we can start working mythology girls questions on logical questions.",
                    "label": 0
                },
                {
                    "sent": "So they are interested more in estimating the average values, right?",
                    "label": 0
                },
                {
                    "sent": "Average rental station home.",
                    "label": 0
                },
                {
                    "sent": "And then working with dynamical systems racial equations outrageous are generally found by using the early city principle, which means either we can run one long trajectory and find the average rate is that projectory, or we can make an example prediction which means.",
                    "label": 0
                },
                {
                    "sent": "Large number of visual points, 8 integrations and finding example.",
                    "label": 0
                },
                {
                    "sent": "Here we come to the tracker, which is we have heard about or similar trackers previous exploiting cycle there can be.",
                    "label": 1
                },
                {
                    "sent": "So Rosie, why not?",
                    "label": 0
                },
                {
                    "sent": "That's the time system amuze or finding the.",
                    "label": 0
                },
                {
                    "sent": "So when we are interested in finding average values or some dynamical system which is model some reality, we would like to find tractor or density of states that attract database and from there we can extract 1.",
                    "label": 1
                },
                {
                    "sent": "Rock.",
                    "label": 1
                },
                {
                    "sent": "Tractors that we're used to work with her well.",
                    "label": 0
                },
                {
                    "sent": "Those that are generally four of the normal, then inconsistent, which means they don't care explicitly and or I will see.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what we have with the atmosphere?",
                    "label": 0
                },
                {
                    "sent": "Atmosphere or ocean?",
                    "label": 0
                },
                {
                    "sent": "Open system, which means there is external proxy.",
                    "label": 0
                },
                {
                    "sent": "Sample song and there is also an important issue which is a recorded increase in the concentration in the air for Model Y CO2 percent.",
                    "label": 0
                },
                {
                    "sent": "Asian is influence on the Apple sphere.",
                    "label": 0
                },
                {
                    "sent": "I suppose, or rather it should be independent.",
                    "label": 0
                },
                {
                    "sent": "Push through the need different ways.",
                    "label": 0
                },
                {
                    "sent": "And so these make is a straight assumption about conference prompts when good short-term prediction like a few days.",
                    "label": 0
                },
                {
                    "sent": "Hey Cortana.",
                    "label": 0
                },
                {
                    "sent": "While working for 100 years, they will change.",
                    "label": 0
                },
                {
                    "sent": "So one typical question, maybe the most interesting question from terminologies is what will be the mean annual?",
                    "label": 0
                },
                {
                    "sent": "Average temperature of Europe against this century.",
                    "label": 0
                },
                {
                    "sent": "So Google tractors that we have heard before settling for East or also parameters systems.",
                    "label": 0
                },
                {
                    "sent": "And the Earth climate is system which has accuracy and branded or just we should find something else which would be more.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We come home so cold.",
                    "label": 0
                },
                {
                    "sent": "Here is mathematics about it, which means it is an exposure or generalization of the attractor, or.",
                    "label": 0
                },
                {
                    "sent": "Random or not, almost or explicitly or.",
                    "label": 0
                },
                {
                    "sent": "And of course system so.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Where is boat slide will be more clear?",
                    "label": 1
                },
                {
                    "sent": "How we update the previous.",
                    "label": 0
                },
                {
                    "sent": "Soon.",
                    "label": 0
                },
                {
                    "sent": "Weeks otherwise read story back attractors variety.",
                    "label": 0
                },
                {
                    "sent": "So we get for giving notice after we can run start the dynamical system starting from one point.",
                    "label": 1
                },
                {
                    "sent": "We threw out the transient and just pulled the trickery.",
                    "label": 1
                },
                {
                    "sent": "It is a visualization of the truck in fact.",
                    "label": 0
                },
                {
                    "sent": "Actually later.",
                    "label": 1
                },
                {
                    "sent": "Or we can make.",
                    "label": 0
                },
                {
                    "sent": "Run of large number.",
                    "label": 0
                },
                {
                    "sent": "Their Christmas party home around chosen initially and issues with charcoal tracker and observe them or like wait for awhile just.",
                    "label": 0
                },
                {
                    "sent": "And observe their positions in the base case.",
                    "label": 0
                },
                {
                    "sent": "So I will show you one image of that later.",
                    "label": 0
                },
                {
                    "sent": "I cannot put the DP because the agent now.",
                    "label": 0
                },
                {
                    "sent": "And we can find one thing that.",
                    "label": 1
                },
                {
                    "sent": "When we work with this.",
                    "label": 0
                },
                {
                    "sent": "Case like Rhonda example, initial conditions for the J. Chris and when we observe them in some Eastern Time.",
                    "label": 0
                },
                {
                    "sent": "The image will proximate we see or the density of both space points in the.",
                    "label": 1
                },
                {
                    "sent": "Please, please, we won't change.",
                    "label": 0
                },
                {
                    "sent": "But when we have full background.",
                    "label": 0
                },
                {
                    "sent": "Great job, there is something that is something starting with large number of your points and observing them at one or people into intact.",
                    "label": 0
                },
                {
                    "sent": "And that is where when the.",
                    "label": 0
                },
                {
                    "sent": "Regions of the system are explicitly and ended, and the dropper sheets shape basically with changing.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Get more air.",
                    "label": 0
                },
                {
                    "sent": "We can take one simple example.",
                    "label": 1
                },
                {
                    "sent": "Leader, but.",
                    "label": 0
                },
                {
                    "sent": "Not always.",
                    "label": 0
                },
                {
                    "sent": "Little different initial points.",
                    "label": 0
                },
                {
                    "sent": "An actual three of them.",
                    "label": 1
                },
                {
                    "sent": "Here they will all collapse one projection, so we can say that the attractor of this system is a point.",
                    "label": 1
                },
                {
                    "sent": "Only one point but its position in the space.",
                    "label": 0
                },
                {
                    "sent": "We have only once favorable or X if changing entire row.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Them for like 100.",
                    "label": 0
                },
                {
                    "sent": "Time steps and we obtain the red points.",
                    "label": 0
                },
                {
                    "sent": "So this look likes the Lorenz attractor.",
                    "label": 0
                },
                {
                    "sent": "If any one of you have seen it from this perspective.",
                    "label": 0
                },
                {
                    "sent": "But as time goes on because row is changing, the dynamical system is changing.",
                    "label": 0
                },
                {
                    "sent": "So if we make a snapshot of all those trajectories at moment 200, we have see we will see a shift or change of the image.",
                    "label": 0
                },
                {
                    "sent": "As a comparison, if we integrate the ordinary Loren system with Ro Sigma Beta constant.",
                    "label": 0
                },
                {
                    "sent": "Whenever we make a snapshot of the attractor, we will always obtain.",
                    "label": 0
                },
                {
                    "sent": "This is approximately the same the same image, so it means that when we have some parameter changing like CO2 concentration.",
                    "label": 0
                },
                {
                    "sent": "The average is the the expectation of the average, like if rival Z is temperature, it will change.",
                    "label": 0
                },
                {
                    "sent": "So in the first case we cause the whole attractors.",
                    "label": 0
                },
                {
                    "sent": "Down its value will be smaller than the value obtained from the averaging the Z variable of these blue points here.",
                    "label": 0
                },
                {
                    "sent": "So this is a more appropriate object that we should work.",
                    "label": 0
                },
                {
                    "sent": "When we want to answer climatological questions like what will happen when the conditions on the Earth or the atmosphere change?",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I would say.",
                    "label": 0
                },
                {
                    "sent": "One more thing which is interesting.",
                    "label": 0
                },
                {
                    "sent": "Like we are all interested in prediction where either short or long term because our behavior, our actions, our life depends on the on the weather so.",
                    "label": 1
                },
                {
                    "sent": "We make plan when we have.",
                    "label": 0
                },
                {
                    "sent": "And we want we plan make plan for tomorrow if it is sunny then we can go to the beach here of it is rainy.",
                    "label": 1
                },
                {
                    "sent": "We should have Plan B and the idea is because we have imperfect models here.",
                    "label": 0
                },
                {
                    "sent": "Which means that we cannot make perfect prediction.",
                    "label": 0
                },
                {
                    "sent": "And if we rely on only one model or only one prediction, then it can say tomorrow will be sunny and we will prepare for it.",
                    "label": 0
                },
                {
                    "sent": "But why shouldn't we try to make 100 predictions and make intentionally some mistakes or errors in the equations?",
                    "label": 0
                },
                {
                    "sent": "And if one of them reports rain that then we will be aware that there is some possibility about some other outcome for the weather tomorrow, so maybe we should prepare for that case.",
                    "label": 1
                },
                {
                    "sent": "Maybe this example is not so important, but knowing that there is maybe.",
                    "label": 0
                },
                {
                    "sent": "Very strong draught upcoming in a summer or some flood then maybe especially the government should or the public should prepare for such events.",
                    "label": 0
                },
                {
                    "sent": "So we come to so called.",
                    "label": 0
                },
                {
                    "sent": "Probabilistic forecasts, which are based on.",
                    "label": 0
                },
                {
                    "sent": "Using different models, different runs, different predictions and giving weights to them.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "1 technical term about this.",
                    "label": 0
                },
                {
                    "sent": "Prediction based on probability, so called uncertainty.",
                    "label": 0
                },
                {
                    "sent": "So first of all we are not always certain about the state of the atmosphere on the Earth.",
                    "label": 1
                },
                {
                    "sent": "Like if we have measurement about the temperature in offret we know only in over it we do not know about like 50 kilometers from it.",
                    "label": 0
                },
                {
                    "sent": "We have only rough estimation of it.",
                    "label": 0
                },
                {
                    "sent": "So, and this uncertainty in the state will affect the predictions.",
                    "label": 1
                },
                {
                    "sent": "So the predictions that we will make, we can make various predictions have some uncertainty.",
                    "label": 0
                },
                {
                    "sent": "And we would like to estimate how large is that uncertainty?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "To make this more clear, we can.",
                    "label": 0
                },
                {
                    "sent": "Take one assemble of predictions like 50 predictions.",
                    "label": 1
                },
                {
                    "sent": "Then find the average values about temperature, pressure and so on and report those averages at our is our best estimate with future state.",
                    "label": 0
                },
                {
                    "sent": "That is one thing the mean and the other thing.",
                    "label": 0
                },
                {
                    "sent": "The uncertainty about our prediction is so called spread, which is the standard deviation of this answer, and we want to have.",
                    "label": 0
                },
                {
                    "sent": "A good estimate of how large is this spread?",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Here we have that kind of example.",
                    "label": 0
                },
                {
                    "sent": "So here we are shown the measurements for the future.",
                    "label": 0
                },
                {
                    "sent": "So we are at this moment now we want to make predictions for the next 5 days.",
                    "label": 0
                },
                {
                    "sent": "And we make runs of different.",
                    "label": 1
                },
                {
                    "sent": "Starting from different initial conditions here, like we use one model, but we make perturbation of this observation.",
                    "label": 0
                },
                {
                    "sent": "We will obtain different predictions and by finding the average of them, we say that most probably the state of the weather.",
                    "label": 0
                },
                {
                    "sent": "Here for tomorrow will be at this point and it appeared OK in this case that it is not the same, but it is close.",
                    "label": 0
                },
                {
                    "sent": "The standard deviation of this ansambl is shown by this ellipse here, so we would be good will dissatisfy by this prediction method if the.",
                    "label": 0
                },
                {
                    "sent": "The outcome is always within.",
                    "label": 1
                },
                {
                    "sent": "Let us say one standard deviation of the prediction, but it appears that sometimes.",
                    "label": 0
                },
                {
                    "sent": "The the the real.",
                    "label": 0
                },
                {
                    "sent": "Weather for the next day is outside of this one standard deviation, so the idea is that we should always make appropriate.",
                    "label": 1
                },
                {
                    "sent": "Spread.",
                    "label": 0
                },
                {
                    "sent": "A large enough spread, not too large or but large enough spread such that the.",
                    "label": 0
                },
                {
                    "sent": "The next observation.",
                    "label": 0
                },
                {
                    "sent": "Will be within one standard deviation.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So which are possible ways of making an ensemble?",
                    "label": 0
                },
                {
                    "sent": "So the first one was shown previously, like we can use one model, take different initial conditions, make perturbations.",
                    "label": 1
                },
                {
                    "sent": "An random independent.",
                    "label": 0
                },
                {
                    "sent": "2nd way of doing that is taking different parameter values in the models like make perturbations of the parameters.",
                    "label": 1
                },
                {
                    "sent": "And it was obtained that generally the second type of making and assemble is better than the previous one, because it has.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Larger spreads, larger standard deviation then.",
                    "label": 0
                },
                {
                    "sent": "The first one.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is also a recent.",
                    "label": 0
                },
                {
                    "sent": "Experimentation.",
                    "label": 0
                },
                {
                    "sent": "With the supposed to plastic parameterization, which means instead of taking constants as parameters, may adding noise to them and and assemble members are taken.",
                    "label": 0
                },
                {
                    "sent": "The trajectories obtained from different realizations of the noise.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "The newest one is the Super idea.",
                    "label": 0
                },
                {
                    "sent": "To use those example members share information with each other while running in order.",
                    "label": 0
                },
                {
                    "sent": "Of course, to make better predictions.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I would summarize about the concepts that I have talked about now.",
                    "label": 0
                },
                {
                    "sent": "Which I find to be interesting and important when working with short or long term prediction.",
                    "label": 1
                },
                {
                    "sent": "First one is that we should be aware that the models are not perfect.",
                    "label": 1
                },
                {
                    "sent": "Then instead of taking the ordinary attractor or taking autonomous dynamical systems for the climate for making long term predictions, we should consider so-called who Becca tractor and also that instead of using one single prediction, we should make predictions based on probability or using and assembles.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I have listed some.",
                    "label": 0
                },
                {
                    "sent": "Papers that I was reading while preparing this and I find.",
                    "label": 0
                },
                {
                    "sent": "To be interesting and worth reading.",
                    "label": 0
                },
                {
                    "sent": "So there are some of them about imperfect models.",
                    "label": 1
                },
                {
                    "sent": "There is one about pullback attractor, of course you can find more in the references there.",
                    "label": 1
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Few of them about.",
                    "label": 0
                },
                {
                    "sent": "Probabilistic probability based or example based forecasts.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I would like to thank all my colleagues from the project.",
                    "label": 0
                },
                {
                    "sent": "Or making better understanding this topic.",
                    "label": 0
                },
                {
                    "sent": "Specially, ellipticals are an evil triple ski.",
                    "label": 0
                },
                {
                    "sent": "With whom I was working most.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you for listening.",
                    "label": 0
                }
            ]
        }
    }
}