{
    "id": "owzjdjg4jxw2mutbczng74b5vskd2mhr",
    "title": "Coming Good and Breaking Bad: Generating Transformative Character Arcs For Use in Compelling Stories",
    "info": {
        "author": [
            "Tony Veale, UCD School of Computer Science and Informatics, University College Dublin"
        ],
        "published": "Aug. 8, 2014",
        "recorded": "June 2014",
        "category": [
            "Top->Philosophy",
            "Top->Social Sciences->Psychology",
            "Top->Computer Science->Artificial Intelligence",
            "Top->Computer Science->Machine Learning",
            "Top->Arts"
        ]
    },
    "url": "http://videolectures.net/iccc2014_veale_compelling_stories/",
    "segmentation": [
        [
            "OK, I feel quite lucky to be at the end of the second session or narrative because I can piggyback and streamline behind the other talks and storytelling and justice.",
            "Give you relevant pointers, for instance at Raphael spoke about the arse Italian model of storytelling and he mentioned about how tension which makes stories interesting arises from Inter character conflict.",
            "But in psychologically real modern stories, much of the conflict and tension arises from internal character conflict.",
            "Characters that are war with themselves.",
            "That can happen in a soap opera or in a horse opera or a space opera, or any kind of story.",
            "Anna really good, inspiring example is breaking.",
            "But most if you've seen it and you all know he dies at the end.",
            "So let's get on with this.",
            "Breaking Bad is very interesting example inside the pinnacle of drama.",
            "Really, for a number of reasons, one is grounded in metaphor.",
            "OK, it's based on the meter for that life is chemistry and chemistry is all about change and the characters in this story are always changing their in a state of becoming throughout the entire narrative.",
            "OK, so that's one method for your metaphor is that the main character Walt is an over educated, brilliant, under respected chemistry teacher, have only gets respect when he becomes drug chemist and from becoming a drug chemist he becomes a meth cook.",
            "And he goes from being a meth cook to being drug kingpin, fearsome kingpin, and the creator of the show described his evolution as going from Mr Chips to Scarface.",
            "And that's a pretty good summary of what the story is about.",
            "OK, so.",
            "Walt changes, but he changes between two states that are very different but are very similar, so we can use metaphor technology.",
            "We have the technology as they used to say in the Bionic man to do this and generate the germ of an idea for a story.",
            "So what we're interested in is the part of the process that Pablo identified as invention were not generating stories were generating interesting ideas for stories.",
            "We're using breaking bottles or inspiring example, but don't expect the systems generate breaking part.",
            "That's a caveat emptor."
        ],
        [
            "I'm going to talk about using metaphor, technology, and conceptual blending technology, and I'll talk about irony.",
            "Little.",
            "This story is very ironic because of characters changed category throughout the narrative, their conception of which category are in often diverges from the perception of other characters, and it diverges from our perception of the characters, and we call that dramatic irony.",
            "Another form of irony.",
            "So we're using blending metapher irony, stereotypical representations, and a lot of knowledge about the world.",
            "Which I don't have time to describe, but I invite you to go to Robot comics or commoners, which have very comprehensive tutorial there on how we generate metaphors and where we get her knowledge from what we do with it.",
            "And another important call."
        ],
        [
            "But this is part of the whim projects which Teresa introduced earlier.",
            "As you might remember, Kwim is an acronym for Why Me?",
            "Only sometimes.",
            "It's actually a very fun project coordinated by Simon and it's funded by our doting aunt in the basement who likes it very much at the moment and liberates us to do really interesting stuff with creativity without having to think about real applications or talking to business people.",
            "So it's great fun.",
            "Now what do we do?",
            "When is all about generating ideas just a pure ideas, and considering how we might turn him into stories or poems or jokes, so we're going to deliver the ideas, and Pablo is going to be numbered with the responsibility of turning them into fully fleshed stories.",
            "He's got all of the architecture and the concepts and interest in doing that.",
            "All of the property and.",
            "Propensity's that one needs to generate stories and I'll give you an example of another story other than Breaking Bad.",
            "And that's the movie Gladiator everyone remembers Gladiator, right?",
            "It's the story of a Roman general.",
            "My name is Maximus gluteus Maximus, he's a.",
            "A powerful general and he suffers the slings and arrows of outrageous fortune.",
            "And he suffers a lot around film, but he doesn't manfully 'cause he's Russell Crowe.",
            "And the story is a story about change.",
            "OK, Gladiator is just one of the categories that he finds himself in.",
            "So Maximus goes in the film and.",
            "The sweeper film he goes from Germania to goal to Lusitania the cartridge up to Rome.",
            "That's where rent he dies at the end.",
            "Spoiler alert.",
            "OK so but if not a geographic story, it's not about where in the world is Maximus gluteus?",
            "It's a story about what's going on in his head and what's the conflict between this man out of time and out of joint with his circumstance.",
            "And just in case people missed that point, the villain Commodus summarizes the movie.",
            "At a conceptual level, halfway through."
        ],
        [
            "Great, he describes Maximus the.",
            "The truculent who will rid me of this truculent gladiator, he says.",
            "The general who became a slave.",
            "Transformation one, the slave who became a gladiator transformation.",
            "2 The Gladiator who defied an emperor potential transformation tree.",
            "Will he take over so notice this is a character arc.",
            "Maximus goes through these States and these states conflict with each other because they're different, but they're also logically connected, which makes for a coherent narrative.",
            "Now you might say, OK, Tony, your system will give us character arcs where you say what if there was a story about a character who was in A and became AB.",
            "And the system might say OK, what if there was a story about a character who went from being a CEO to being chairman of the board?",
            "OK, you pitched at the Hollywood, and they're not going to say I see Oscar all over this one called Christopher Nolan.",
            "They're not going to do that.",
            "There has to be conflict.",
            "What often reversal of fortune?",
            "What are subtle called peripeteia?",
            "The idea of conflict and contrast and sudden change?",
            "OK, so lots of transformations are possible are utterly boring.",
            "The ones that grow up, uh, sort of ones that are surprising, but which makes sense.",
            "Kind of retrospectively."
        ],
        [
            "Right, So what we want is something to suddenly change.",
            "OK, Maximus, are you not entertained?",
            "OK, and of course he wasn't entertaining 'cause he was killing people too quickly.",
            "Others spoiler alert.",
            "So good stories often use incongruity.",
            "The character changes are.",
            "Surprising they go from one state to another.",
            "Word.",
            "Errors of flipping of properties, sometimes a radical flipping of properties.",
            "You go from a powerful general to a lowly slave.",
            "You go from a lowly slave to popular gladiator you got from the popular gladiator to someone who threatens the emperor himself.",
            "So how do we do this?",
            "We need to have representations of characters that are detailed in their properties and we need to line them up on character arcs.",
            "Let's say you go from.",
            "Concept A which has these stereotypical properties.",
            "The concept be which has these different but related character properties, and that's surprising but apt."
        ],
        [
            "We need OK back to Breaking Bad Walt in Breaking Bad is ontologically unstable.",
            "He's unstable and all sorts of other ways as well.",
            "But he is ontologically unstable.",
            "He goes through this when he goes from slob to Kingpin too.",
            "Kind of lone gunman and dead in the space of 50 hours.",
            "He calls himself Heisenberg, which is a double irony.",
            "He's Heisenberg because he's clever, and he's a chemist and he wants to hide behind this cool name.",
            "But he's also Heisenberg 'cause he doesn't really know himself.",
            "He's uncertain about himself, Warren.",
            "Certain about him.",
            "We think he's a hero for a lot of the time.",
            "It's a very complex, engaging drama to do this kind of transformation."
        ],
        [
            "We need to be able to take characters apart, right?",
            "We need to be able to say what makes this one of the properties that define the state that this character is in.",
            "We need to deconstruct, pull them apart, reassemble them again.",
            "As published said, you take things apart, put them back together again, hopefully in a new way.",
            "Throw away the bits that don't fit or put them in a jar under the sink for later.",
            "But generally you try to deconstruct and reconstruct.",
            "OK, so how do we do that?"
        ],
        [
            "Well, as I said, I'm not going to tell you how meter magnet works.",
            "I spent hours about it on on Monday.",
            "New addition to meter magnet called Flux capacitor is just a way of putting states together that conflict, but which are plausibly aligned.",
            "And we use metaphor as a commodity.",
            "Magical Magnet is a factory for meta fruits.",
            "We say give us a metaphor on X and then we say well don't give me that money metrics.",
            "We filter through them and we say it filtered by affect by how surprising they are explained, the emotions involved in these matters.",
            "What properties conflict?",
            "What properties are preserved?",
            "It can do all of these things and it's a service that you can use to.",
            "And the flux capacitor uses the metaphors to turn the freedom literally as the endpoints of a transformation.",
            "So instead of saying that I drug chemist is like a chemistry teacher, you say what if a chemistry teacher became a drug chemist, so you treat the metaphor literally."
        ],
        [
            "We get a knowledge representation by semi automatic curated extraction from the web, so we mind similes in the first instance to find out you might be similar as boring as an accountant, and we said thank you similes for telling us our accountants are boring.",
            "OK, as reckless as a daredevil, as sharp as.",
            "I. Assort OK as insightful as a guru, although we have thousands of concepts and we have very detailed property level representations of all of them, which we've extracted from similes which are languages, way of telling computer scientists what properties are important about concepts, and we get these ones here from the Google Ngram that we also go to the web back when it was possible to manipulate and abuse Google at your leisure."
        ],
        [
            "Now how do we get flux capacitor to build character arcs?",
            "We don't want to simply randomly combine two states that are two concepts like drug chemists and chemistry teacher, but happened to share properties and have conflicting properties.",
            "We need to know what makes a compelling start state and what makes it compelling end state.",
            "So we measure the potentiality of a concept to be a start state or an end state by looking at corporate.",
            "Again, the Google N grams.",
            "So we look at the pattern X is become an its frequency.",
            "To find that how likely something is to be the start state of a pattern of an arc.",
            "So boys become they grow up.",
            "Obviously sometimes thirty 4704.",
            "Now you're not going to see very many instances of the ngram become boys, right?",
            "So you're not going to get a story that says there was an accountant who became a boy.",
            "But you might get a story.",
            "There was an exciting child who wanted to be a scientist and grew up to be an accountant.",
            "So accountant is more is better suited at the end of the transformation.",
            "And boy at the beginning, so slave.",
            "It's the nature of life, isn't it?",
            "Slave is kind of the end of the line for you if you get.",
            "If you become a slave, you very little options there.",
            "So becoming slaves is much more frequent than slaves become, so we use frequencies to organize and come up with the most right corpus, attested.",
            "Plausable directionality of arcs.",
            "This is all in the paper we evaluate in the paper.",
            "I don't have time to talk about evaluation here, but we build these arcs based on is the start state a good start state is attested as the start of an arc is the end state a good end state?",
            "Is a test is at the end of an arc.",
            "Ann would be or could be better according to Corpus data if we switched it around.",
            "And of course, we pick the start and end states based on whether they have similarities and contrasts.",
            "So very good example.",
            "I hope you."
        ],
        [
            "And it is one of a millionaire became a pauper, right?",
            "So you lose all of your money at Monopoly and you become this wretched smelly creature there on the right.",
            "Art how does that work?",
            "OK, well millionaires become unbecome poppers or attested phrases and the transformation is deemed to be a good one.",
            "It's plausable, but it's interesting 'cause there are conflicts internal conflicts.",
            "Millionaires are considered to be dashing again are similes, bums, or drab millionaires are happy.",
            "You'd like to think so.",
            "Moms are miserable.",
            "They millionaires are wealthy bums or destitute, so that's a very interesting transformation.",
            "What of this really rich character?",
            "All of these good properties suddenly became broke and had to fend for himself on the streets and learn the lessons of life.",
            "Maybe get his money back at the end.",
            "Kind of Hollywood ending.",
            "OK."
        ],
        [
            "So the flux capacitor at the present generates.",
            "Headlines, just Hollywood pictures, and then imagines them as kind of tabloid pictures.",
            "And it uses a simple pun generator.",
            "What lexical look up so Millionaire Mart and buy mansions walks into workhouses?",
            "OK, imagine a really bad tabloid.",
            "Imagine a tabloid and you get a millionaire, rejects richness, hungers for hopelessness, OK?",
            "Living in going from living in mansions, to living in shacks and slums?",
            "It's like it's doing analogy, and it's lining up to representations.",
            "And it's doing structure mapping based on similar predicates and then it tries to come up with some faux psychological interpretation because you need that for good stories, millionaires, public worldmark, pervasive poverty, right difference, millionaires, false wealth, mass, genuine deprivation.",
            "Goes from ostentatious to unpretentious millionaires.",
            "Private pampering.",
            "Masked by outer property.",
            "So he's still in this scenario.",
            "He's still rich but he looks like the pump.",
            "Here's a one that the system generated which I find interesting.",
            "Spicy perhaps maybe a little offensive to."
        ],
        [
            "What if a nun became a prostitute?",
            "The system says, or vice versa, which is kind of happy story, right?",
            "Kind of the Scarlet lady here.",
            "So of course this is an interesting transformation, 'cause it is.",
            "It is a big transformation, right?",
            "It's not something that happens every day.",
            "And with the declining population of nuns that it's becoming less likely, OK, so nunchucks Chassidy Wallace and wickedness.",
            "9 wine unwinds about Wimples, grabs Carters.",
            "You can see this general strategy as you work here, and some of it is kind of nasty.",
            "Nun goes from counting rosary beads that carrying infections and so forth.",
            "So this is incongruity.",
            "It's a bit of crash blossom as well.",
            "Which is terminology for newspaper headlines that crash two scenarios together.",
            "Like symbols to get this interesting effect now.",
            "Begin to get boring after awhile.",
            "We really need some good headline generators.",
            "An inspiring example I came up with is hot Mama, superior self body of Christ, but that would be.",
            "I can't say that in Ireland from Satan lubiano OK.",
            "So."
        ],
        [
            "We put these ideas instead of me talking about the evaluation.",
            "We put them into an online system that everybody can access.",
            "Meter magnet and this is where we get into the story.",
            "Telling Realm meter magnet generates these jaded hardboiled metaphors.",
            "'cause it again because it's looking for positive to negative transformations.",
            "It sounds like Phillip Marlowe.",
            "A lot of the time actually.",
            "Philip Marlowe was an idealist in a grubby world.",
            "It sounds more like Sam Spade.",
            "OK, so abuse leads to crime that causes suffering.",
            "Justice provides the punishment inflicts suffering.",
            "Take your pick their bullcrap right.",
            "That's the view misfit Nana word cocktail of five parts quick developing genius to four powered, shortcoming stricken was it uses very emotive language."
        ],
        [
            "But a lot of these ideas can turn into the seeds of interesting stories, so here it's comparing artists to dictators.",
            "Becausw artists promote our true beauty and dictators suppress critics.",
            "What if they were to suppress the critics that criticize art?",
            "What kind of friendly dictator would not be so you can say, OK?",
            "What if an artist became a dictator, then what would they do?",
            "Well, the first thing they would do is they would round up all their critics right and do something nasty to them.",
            "So that's an interesting story.",
            "There is a change from an artist to a dictator, and we have causal reasoning going on in the system.",
            "So these tweets can be seen as little story ideas and a lot of Twitter bots work that way."
        ],
        [
            "So in this particular one here we use sophistry to line things up.",
            "Comedians break taboos.",
            "This is a tweet.",
            "Discontent on reminds the societies that enforced taboos do discontents make good comedians.",
            "This was treated 1st of June.",
            "OK, so there was a story idea right there.",
            "What if someone was really upset with SoC but found happiness by becoming a malcontented comedian?",
            "OK, or apostles nurture fates?",
            "She had to threaten the infidels to disavow Bates who was better.",
            "This was a few months ago.",
            "One of an Apostle who was a really religious person suddenly turned into my son the extremist right.",
            "It's not an inconceivable leap.",
            "In fact, it happens all the time.",
            "Interesting story to lack a goal.",
            "This can turn assiduous researchers and the prodigal waste throats look around you, right?",
            "So there's another causality.",
            "Change transformation pioneers created enterprises propaganda serve the leaders that launch enterprises who was better and we all know that entrepreneurs are propagandists for their own stuff.",
            "What if they became real propagandists and there was nothing that they were selling?",
            "It was all just hype.",
            "Great story ideas come from conflict so.",
            "If you feel like you need you would like to use somebody storage that is top directly into metaphor magnet the web service or the Twitter bot app meter magnet."
        ],
        [
            "Quick call out to Mike.",
            "As Angelina, he's a method cook terrible point.",
            "Matt Cook, right so.",
            "Basically, in his appreciation bot.",
            "He's generating particular kinds of narratives about these static objects in the Metropolitan Museum.",
            "He's generating this.",
            "He's kind of.",
            "His tweets are kind of positive compared to my negative ones.",
            "OK, he's kind of.",
            "He sees the good in everything in these stories.",
            "Interesting representation and that kind of thing.",
            "Where as I would be damning it with Metro magnet."
        ],
        [
            "OK, and just to conclude.",
            "Just think of our group as a metaphor factory.",
            "We have so many metaphors to give away and we genuinely will give them away.",
            "We want to give you metaphors.",
            "OK we want we have services on the web.",
            "We have the Twitter bot.",
            "We are convinced that a lot of the work going on here would benefit from having the conceptual conceit that is provided by interesting metaphors.",
            "Mike is A is an avid user trying to convert more of you if you want metaphors by the truckload for your particular needs in real time via web service, we're happy to talk to you, the tailor, the output to collaborate, but just see it as a stream of conceptual oppositions that involve conflict and similarity.",
            "Poetry blending we can provide all of that via web services, so please do check out afflatus at UCD, IE an app metapher Magnus OK, I will leave it there.",
            "I think if I understood you right, you're you're starting and ending your arcs on corpus, attested.",
            "Things that say you should start here and you should end here is that you can't start here and you can't end right because there are corpus and it uses ways to measure just.",
            "It's a fuzziness thing, not a binary distinction.",
            "So the question though is wouldn't you get potentially really interesting things if you did just the opposite of that, so you said nobody becomes a boy.",
            "Well, Benjamin Button became a boy, and that's a really different store.",
            "Did not workout for him.",
            "Did you see that movie I did?",
            "He died at the end.",
            "I mean, if you will.",
            "I think he was born at the end of it.",
            "It too.",
            "If you watch that movie on a plane you walk out.",
            "Come on.",
            "No, but seriously, that's called science, and there's all sorts of crap storylines that you can make sensible by invoking the card science rule.",
            "Richard Curtis does a lot of them.",
            "What about if I could go back in time and marry a librarian and then go back in time whenever we had an argument?",
            "That kind of thing.",
            "Time travel, sex change?",
            "Immersing yourself, I mean, once you do it once it's done, move on to make plausible stories that are still interesting, you have to have plausibility built into the mechanism.",
            "And if you say anything goes, anything will go.",
            "We don't want that, I just wanted to question the big assumption about stories or interesting stories requiring conflict.",
            "There's a huge well.",
            "There's a huge history of Japanese and Chinese storytelling, which is just about changing perspectives.",
            "Just A twist, and it doesn't require any domination of one party over another one.",
            "And I think that metaphor magnet can be equally applied to that, but I really want to stress that you know conflict is a.",
            "It's a very western centric thing that we have and that we have an appetite for and we shouldn't have any assumptions about that.",
            "Yeah, I've got a monstrous appetite for that.",
            "It's a fair cop Gov, so we're not covering Japanese.",
            "Chinese sensibilities were working squarely in a Western tradition, guided by our Stottle Latter Day prop.",
            "We could we could generalize to everybody, but then we would get this Gray soup.",
            "So I say, let the Japanese and Chinese researchers come up with models of their storytelling culture and will come up with arts and let's them fight it out on Twitter.",
            "OK, well I think lunch is being served down in the Gallery, so let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I feel quite lucky to be at the end of the second session or narrative because I can piggyback and streamline behind the other talks and storytelling and justice.",
                    "label": 0
                },
                {
                    "sent": "Give you relevant pointers, for instance at Raphael spoke about the arse Italian model of storytelling and he mentioned about how tension which makes stories interesting arises from Inter character conflict.",
                    "label": 0
                },
                {
                    "sent": "But in psychologically real modern stories, much of the conflict and tension arises from internal character conflict.",
                    "label": 0
                },
                {
                    "sent": "Characters that are war with themselves.",
                    "label": 0
                },
                {
                    "sent": "That can happen in a soap opera or in a horse opera or a space opera, or any kind of story.",
                    "label": 0
                },
                {
                    "sent": "Anna really good, inspiring example is breaking.",
                    "label": 0
                },
                {
                    "sent": "But most if you've seen it and you all know he dies at the end.",
                    "label": 0
                },
                {
                    "sent": "So let's get on with this.",
                    "label": 0
                },
                {
                    "sent": "Breaking Bad is very interesting example inside the pinnacle of drama.",
                    "label": 0
                },
                {
                    "sent": "Really, for a number of reasons, one is grounded in metaphor.",
                    "label": 0
                },
                {
                    "sent": "OK, it's based on the meter for that life is chemistry and chemistry is all about change and the characters in this story are always changing their in a state of becoming throughout the entire narrative.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's one method for your metaphor is that the main character Walt is an over educated, brilliant, under respected chemistry teacher, have only gets respect when he becomes drug chemist and from becoming a drug chemist he becomes a meth cook.",
                    "label": 0
                },
                {
                    "sent": "And he goes from being a meth cook to being drug kingpin, fearsome kingpin, and the creator of the show described his evolution as going from Mr Chips to Scarface.",
                    "label": 0
                },
                {
                    "sent": "And that's a pretty good summary of what the story is about.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Walt changes, but he changes between two states that are very different but are very similar, so we can use metaphor technology.",
                    "label": 0
                },
                {
                    "sent": "We have the technology as they used to say in the Bionic man to do this and generate the germ of an idea for a story.",
                    "label": 0
                },
                {
                    "sent": "So what we're interested in is the part of the process that Pablo identified as invention were not generating stories were generating interesting ideas for stories.",
                    "label": 0
                },
                {
                    "sent": "We're using breaking bottles or inspiring example, but don't expect the systems generate breaking part.",
                    "label": 0
                },
                {
                    "sent": "That's a caveat emptor.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm going to talk about using metaphor, technology, and conceptual blending technology, and I'll talk about irony.",
                    "label": 0
                },
                {
                    "sent": "Little.",
                    "label": 0
                },
                {
                    "sent": "This story is very ironic because of characters changed category throughout the narrative, their conception of which category are in often diverges from the perception of other characters, and it diverges from our perception of the characters, and we call that dramatic irony.",
                    "label": 0
                },
                {
                    "sent": "Another form of irony.",
                    "label": 0
                },
                {
                    "sent": "So we're using blending metapher irony, stereotypical representations, and a lot of knowledge about the world.",
                    "label": 0
                },
                {
                    "sent": "Which I don't have time to describe, but I invite you to go to Robot comics or commoners, which have very comprehensive tutorial there on how we generate metaphors and where we get her knowledge from what we do with it.",
                    "label": 0
                },
                {
                    "sent": "And another important call.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But this is part of the whim projects which Teresa introduced earlier.",
                    "label": 0
                },
                {
                    "sent": "As you might remember, Kwim is an acronym for Why Me?",
                    "label": 0
                },
                {
                    "sent": "Only sometimes.",
                    "label": 0
                },
                {
                    "sent": "It's actually a very fun project coordinated by Simon and it's funded by our doting aunt in the basement who likes it very much at the moment and liberates us to do really interesting stuff with creativity without having to think about real applications or talking to business people.",
                    "label": 0
                },
                {
                    "sent": "So it's great fun.",
                    "label": 0
                },
                {
                    "sent": "Now what do we do?",
                    "label": 0
                },
                {
                    "sent": "When is all about generating ideas just a pure ideas, and considering how we might turn him into stories or poems or jokes, so we're going to deliver the ideas, and Pablo is going to be numbered with the responsibility of turning them into fully fleshed stories.",
                    "label": 0
                },
                {
                    "sent": "He's got all of the architecture and the concepts and interest in doing that.",
                    "label": 0
                },
                {
                    "sent": "All of the property and.",
                    "label": 0
                },
                {
                    "sent": "Propensity's that one needs to generate stories and I'll give you an example of another story other than Breaking Bad.",
                    "label": 0
                },
                {
                    "sent": "And that's the movie Gladiator everyone remembers Gladiator, right?",
                    "label": 0
                },
                {
                    "sent": "It's the story of a Roman general.",
                    "label": 0
                },
                {
                    "sent": "My name is Maximus gluteus Maximus, he's a.",
                    "label": 0
                },
                {
                    "sent": "A powerful general and he suffers the slings and arrows of outrageous fortune.",
                    "label": 0
                },
                {
                    "sent": "And he suffers a lot around film, but he doesn't manfully 'cause he's Russell Crowe.",
                    "label": 0
                },
                {
                    "sent": "And the story is a story about change.",
                    "label": 0
                },
                {
                    "sent": "OK, Gladiator is just one of the categories that he finds himself in.",
                    "label": 1
                },
                {
                    "sent": "So Maximus goes in the film and.",
                    "label": 0
                },
                {
                    "sent": "The sweeper film he goes from Germania to goal to Lusitania the cartridge up to Rome.",
                    "label": 0
                },
                {
                    "sent": "That's where rent he dies at the end.",
                    "label": 0
                },
                {
                    "sent": "Spoiler alert.",
                    "label": 0
                },
                {
                    "sent": "OK so but if not a geographic story, it's not about where in the world is Maximus gluteus?",
                    "label": 0
                },
                {
                    "sent": "It's a story about what's going on in his head and what's the conflict between this man out of time and out of joint with his circumstance.",
                    "label": 0
                },
                {
                    "sent": "And just in case people missed that point, the villain Commodus summarizes the movie.",
                    "label": 0
                },
                {
                    "sent": "At a conceptual level, halfway through.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Great, he describes Maximus the.",
                    "label": 0
                },
                {
                    "sent": "The truculent who will rid me of this truculent gladiator, he says.",
                    "label": 0
                },
                {
                    "sent": "The general who became a slave.",
                    "label": 0
                },
                {
                    "sent": "Transformation one, the slave who became a gladiator transformation.",
                    "label": 0
                },
                {
                    "sent": "2 The Gladiator who defied an emperor potential transformation tree.",
                    "label": 0
                },
                {
                    "sent": "Will he take over so notice this is a character arc.",
                    "label": 0
                },
                {
                    "sent": "Maximus goes through these States and these states conflict with each other because they're different, but they're also logically connected, which makes for a coherent narrative.",
                    "label": 0
                },
                {
                    "sent": "Now you might say, OK, Tony, your system will give us character arcs where you say what if there was a story about a character who was in A and became AB.",
                    "label": 0
                },
                {
                    "sent": "And the system might say OK, what if there was a story about a character who went from being a CEO to being chairman of the board?",
                    "label": 0
                },
                {
                    "sent": "OK, you pitched at the Hollywood, and they're not going to say I see Oscar all over this one called Christopher Nolan.",
                    "label": 0
                },
                {
                    "sent": "They're not going to do that.",
                    "label": 0
                },
                {
                    "sent": "There has to be conflict.",
                    "label": 0
                },
                {
                    "sent": "What often reversal of fortune?",
                    "label": 0
                },
                {
                    "sent": "What are subtle called peripeteia?",
                    "label": 0
                },
                {
                    "sent": "The idea of conflict and contrast and sudden change?",
                    "label": 0
                },
                {
                    "sent": "OK, so lots of transformations are possible are utterly boring.",
                    "label": 0
                },
                {
                    "sent": "The ones that grow up, uh, sort of ones that are surprising, but which makes sense.",
                    "label": 0
                },
                {
                    "sent": "Kind of retrospectively.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, So what we want is something to suddenly change.",
                    "label": 0
                },
                {
                    "sent": "OK, Maximus, are you not entertained?",
                    "label": 0
                },
                {
                    "sent": "OK, and of course he wasn't entertaining 'cause he was killing people too quickly.",
                    "label": 0
                },
                {
                    "sent": "Others spoiler alert.",
                    "label": 0
                },
                {
                    "sent": "So good stories often use incongruity.",
                    "label": 0
                },
                {
                    "sent": "The character changes are.",
                    "label": 0
                },
                {
                    "sent": "Surprising they go from one state to another.",
                    "label": 0
                },
                {
                    "sent": "Word.",
                    "label": 0
                },
                {
                    "sent": "Errors of flipping of properties, sometimes a radical flipping of properties.",
                    "label": 0
                },
                {
                    "sent": "You go from a powerful general to a lowly slave.",
                    "label": 0
                },
                {
                    "sent": "You go from a lowly slave to popular gladiator you got from the popular gladiator to someone who threatens the emperor himself.",
                    "label": 0
                },
                {
                    "sent": "So how do we do this?",
                    "label": 0
                },
                {
                    "sent": "We need to have representations of characters that are detailed in their properties and we need to line them up on character arcs.",
                    "label": 0
                },
                {
                    "sent": "Let's say you go from.",
                    "label": 0
                },
                {
                    "sent": "Concept A which has these stereotypical properties.",
                    "label": 0
                },
                {
                    "sent": "The concept be which has these different but related character properties, and that's surprising but apt.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We need OK back to Breaking Bad Walt in Breaking Bad is ontologically unstable.",
                    "label": 0
                },
                {
                    "sent": "He's unstable and all sorts of other ways as well.",
                    "label": 0
                },
                {
                    "sent": "But he is ontologically unstable.",
                    "label": 0
                },
                {
                    "sent": "He goes through this when he goes from slob to Kingpin too.",
                    "label": 0
                },
                {
                    "sent": "Kind of lone gunman and dead in the space of 50 hours.",
                    "label": 1
                },
                {
                    "sent": "He calls himself Heisenberg, which is a double irony.",
                    "label": 0
                },
                {
                    "sent": "He's Heisenberg because he's clever, and he's a chemist and he wants to hide behind this cool name.",
                    "label": 0
                },
                {
                    "sent": "But he's also Heisenberg 'cause he doesn't really know himself.",
                    "label": 0
                },
                {
                    "sent": "He's uncertain about himself, Warren.",
                    "label": 0
                },
                {
                    "sent": "Certain about him.",
                    "label": 0
                },
                {
                    "sent": "We think he's a hero for a lot of the time.",
                    "label": 0
                },
                {
                    "sent": "It's a very complex, engaging drama to do this kind of transformation.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We need to be able to take characters apart, right?",
                    "label": 0
                },
                {
                    "sent": "We need to be able to say what makes this one of the properties that define the state that this character is in.",
                    "label": 0
                },
                {
                    "sent": "We need to deconstruct, pull them apart, reassemble them again.",
                    "label": 1
                },
                {
                    "sent": "As published said, you take things apart, put them back together again, hopefully in a new way.",
                    "label": 0
                },
                {
                    "sent": "Throw away the bits that don't fit or put them in a jar under the sink for later.",
                    "label": 0
                },
                {
                    "sent": "But generally you try to deconstruct and reconstruct.",
                    "label": 0
                },
                {
                    "sent": "OK, so how do we do that?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, as I said, I'm not going to tell you how meter magnet works.",
                    "label": 0
                },
                {
                    "sent": "I spent hours about it on on Monday.",
                    "label": 0
                },
                {
                    "sent": "New addition to meter magnet called Flux capacitor is just a way of putting states together that conflict, but which are plausibly aligned.",
                    "label": 0
                },
                {
                    "sent": "And we use metaphor as a commodity.",
                    "label": 0
                },
                {
                    "sent": "Magical Magnet is a factory for meta fruits.",
                    "label": 0
                },
                {
                    "sent": "We say give us a metaphor on X and then we say well don't give me that money metrics.",
                    "label": 0
                },
                {
                    "sent": "We filter through them and we say it filtered by affect by how surprising they are explained, the emotions involved in these matters.",
                    "label": 0
                },
                {
                    "sent": "What properties conflict?",
                    "label": 0
                },
                {
                    "sent": "What properties are preserved?",
                    "label": 0
                },
                {
                    "sent": "It can do all of these things and it's a service that you can use to.",
                    "label": 0
                },
                {
                    "sent": "And the flux capacitor uses the metaphors to turn the freedom literally as the endpoints of a transformation.",
                    "label": 1
                },
                {
                    "sent": "So instead of saying that I drug chemist is like a chemistry teacher, you say what if a chemistry teacher became a drug chemist, so you treat the metaphor literally.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We get a knowledge representation by semi automatic curated extraction from the web, so we mind similes in the first instance to find out you might be similar as boring as an accountant, and we said thank you similes for telling us our accountants are boring.",
                    "label": 0
                },
                {
                    "sent": "OK, as reckless as a daredevil, as sharp as.",
                    "label": 0
                },
                {
                    "sent": "I. Assort OK as insightful as a guru, although we have thousands of concepts and we have very detailed property level representations of all of them, which we've extracted from similes which are languages, way of telling computer scientists what properties are important about concepts, and we get these ones here from the Google Ngram that we also go to the web back when it was possible to manipulate and abuse Google at your leisure.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now how do we get flux capacitor to build character arcs?",
                    "label": 1
                },
                {
                    "sent": "We don't want to simply randomly combine two states that are two concepts like drug chemists and chemistry teacher, but happened to share properties and have conflicting properties.",
                    "label": 0
                },
                {
                    "sent": "We need to know what makes a compelling start state and what makes it compelling end state.",
                    "label": 0
                },
                {
                    "sent": "So we measure the potentiality of a concept to be a start state or an end state by looking at corporate.",
                    "label": 0
                },
                {
                    "sent": "Again, the Google N grams.",
                    "label": 0
                },
                {
                    "sent": "So we look at the pattern X is become an its frequency.",
                    "label": 0
                },
                {
                    "sent": "To find that how likely something is to be the start state of a pattern of an arc.",
                    "label": 1
                },
                {
                    "sent": "So boys become they grow up.",
                    "label": 0
                },
                {
                    "sent": "Obviously sometimes thirty 4704.",
                    "label": 0
                },
                {
                    "sent": "Now you're not going to see very many instances of the ngram become boys, right?",
                    "label": 0
                },
                {
                    "sent": "So you're not going to get a story that says there was an accountant who became a boy.",
                    "label": 0
                },
                {
                    "sent": "But you might get a story.",
                    "label": 1
                },
                {
                    "sent": "There was an exciting child who wanted to be a scientist and grew up to be an accountant.",
                    "label": 0
                },
                {
                    "sent": "So accountant is more is better suited at the end of the transformation.",
                    "label": 0
                },
                {
                    "sent": "And boy at the beginning, so slave.",
                    "label": 0
                },
                {
                    "sent": "It's the nature of life, isn't it?",
                    "label": 0
                },
                {
                    "sent": "Slave is kind of the end of the line for you if you get.",
                    "label": 0
                },
                {
                    "sent": "If you become a slave, you very little options there.",
                    "label": 0
                },
                {
                    "sent": "So becoming slaves is much more frequent than slaves become, so we use frequencies to organize and come up with the most right corpus, attested.",
                    "label": 0
                },
                {
                    "sent": "Plausable directionality of arcs.",
                    "label": 0
                },
                {
                    "sent": "This is all in the paper we evaluate in the paper.",
                    "label": 0
                },
                {
                    "sent": "I don't have time to talk about evaluation here, but we build these arcs based on is the start state a good start state is attested as the start of an arc is the end state a good end state?",
                    "label": 0
                },
                {
                    "sent": "Is a test is at the end of an arc.",
                    "label": 0
                },
                {
                    "sent": "Ann would be or could be better according to Corpus data if we switched it around.",
                    "label": 0
                },
                {
                    "sent": "And of course, we pick the start and end states based on whether they have similarities and contrasts.",
                    "label": 0
                },
                {
                    "sent": "So very good example.",
                    "label": 0
                },
                {
                    "sent": "I hope you.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it is one of a millionaire became a pauper, right?",
                    "label": 1
                },
                {
                    "sent": "So you lose all of your money at Monopoly and you become this wretched smelly creature there on the right.",
                    "label": 0
                },
                {
                    "sent": "Art how does that work?",
                    "label": 0
                },
                {
                    "sent": "OK, well millionaires become unbecome poppers or attested phrases and the transformation is deemed to be a good one.",
                    "label": 0
                },
                {
                    "sent": "It's plausable, but it's interesting 'cause there are conflicts internal conflicts.",
                    "label": 0
                },
                {
                    "sent": "Millionaires are considered to be dashing again are similes, bums, or drab millionaires are happy.",
                    "label": 0
                },
                {
                    "sent": "You'd like to think so.",
                    "label": 0
                },
                {
                    "sent": "Moms are miserable.",
                    "label": 0
                },
                {
                    "sent": "They millionaires are wealthy bums or destitute, so that's a very interesting transformation.",
                    "label": 0
                },
                {
                    "sent": "What of this really rich character?",
                    "label": 0
                },
                {
                    "sent": "All of these good properties suddenly became broke and had to fend for himself on the streets and learn the lessons of life.",
                    "label": 0
                },
                {
                    "sent": "Maybe get his money back at the end.",
                    "label": 0
                },
                {
                    "sent": "Kind of Hollywood ending.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the flux capacitor at the present generates.",
                    "label": 0
                },
                {
                    "sent": "Headlines, just Hollywood pictures, and then imagines them as kind of tabloid pictures.",
                    "label": 0
                },
                {
                    "sent": "And it uses a simple pun generator.",
                    "label": 0
                },
                {
                    "sent": "What lexical look up so Millionaire Mart and buy mansions walks into workhouses?",
                    "label": 1
                },
                {
                    "sent": "OK, imagine a really bad tabloid.",
                    "label": 0
                },
                {
                    "sent": "Imagine a tabloid and you get a millionaire, rejects richness, hungers for hopelessness, OK?",
                    "label": 1
                },
                {
                    "sent": "Living in going from living in mansions, to living in shacks and slums?",
                    "label": 1
                },
                {
                    "sent": "It's like it's doing analogy, and it's lining up to representations.",
                    "label": 0
                },
                {
                    "sent": "And it's doing structure mapping based on similar predicates and then it tries to come up with some faux psychological interpretation because you need that for good stories, millionaires, public worldmark, pervasive poverty, right difference, millionaires, false wealth, mass, genuine deprivation.",
                    "label": 1
                },
                {
                    "sent": "Goes from ostentatious to unpretentious millionaires.",
                    "label": 0
                },
                {
                    "sent": "Private pampering.",
                    "label": 0
                },
                {
                    "sent": "Masked by outer property.",
                    "label": 0
                },
                {
                    "sent": "So he's still in this scenario.",
                    "label": 0
                },
                {
                    "sent": "He's still rich but he looks like the pump.",
                    "label": 0
                },
                {
                    "sent": "Here's a one that the system generated which I find interesting.",
                    "label": 0
                },
                {
                    "sent": "Spicy perhaps maybe a little offensive to.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What if a nun became a prostitute?",
                    "label": 0
                },
                {
                    "sent": "The system says, or vice versa, which is kind of happy story, right?",
                    "label": 0
                },
                {
                    "sent": "Kind of the Scarlet lady here.",
                    "label": 0
                },
                {
                    "sent": "So of course this is an interesting transformation, 'cause it is.",
                    "label": 0
                },
                {
                    "sent": "It is a big transformation, right?",
                    "label": 0
                },
                {
                    "sent": "It's not something that happens every day.",
                    "label": 0
                },
                {
                    "sent": "And with the declining population of nuns that it's becoming less likely, OK, so nunchucks Chassidy Wallace and wickedness.",
                    "label": 0
                },
                {
                    "sent": "9 wine unwinds about Wimples, grabs Carters.",
                    "label": 1
                },
                {
                    "sent": "You can see this general strategy as you work here, and some of it is kind of nasty.",
                    "label": 0
                },
                {
                    "sent": "Nun goes from counting rosary beads that carrying infections and so forth.",
                    "label": 1
                },
                {
                    "sent": "So this is incongruity.",
                    "label": 0
                },
                {
                    "sent": "It's a bit of crash blossom as well.",
                    "label": 0
                },
                {
                    "sent": "Which is terminology for newspaper headlines that crash two scenarios together.",
                    "label": 0
                },
                {
                    "sent": "Like symbols to get this interesting effect now.",
                    "label": 0
                },
                {
                    "sent": "Begin to get boring after awhile.",
                    "label": 0
                },
                {
                    "sent": "We really need some good headline generators.",
                    "label": 0
                },
                {
                    "sent": "An inspiring example I came up with is hot Mama, superior self body of Christ, but that would be.",
                    "label": 0
                },
                {
                    "sent": "I can't say that in Ireland from Satan lubiano OK.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We put these ideas instead of me talking about the evaluation.",
                    "label": 0
                },
                {
                    "sent": "We put them into an online system that everybody can access.",
                    "label": 0
                },
                {
                    "sent": "Meter magnet and this is where we get into the story.",
                    "label": 0
                },
                {
                    "sent": "Telling Realm meter magnet generates these jaded hardboiled metaphors.",
                    "label": 0
                },
                {
                    "sent": "'cause it again because it's looking for positive to negative transformations.",
                    "label": 0
                },
                {
                    "sent": "It sounds like Phillip Marlowe.",
                    "label": 0
                },
                {
                    "sent": "A lot of the time actually.",
                    "label": 0
                },
                {
                    "sent": "Philip Marlowe was an idealist in a grubby world.",
                    "label": 0
                },
                {
                    "sent": "It sounds more like Sam Spade.",
                    "label": 0
                },
                {
                    "sent": "OK, so abuse leads to crime that causes suffering.",
                    "label": 0
                },
                {
                    "sent": "Justice provides the punishment inflicts suffering.",
                    "label": 0
                },
                {
                    "sent": "Take your pick their bullcrap right.",
                    "label": 0
                },
                {
                    "sent": "That's the view misfit Nana word cocktail of five parts quick developing genius to four powered, shortcoming stricken was it uses very emotive language.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But a lot of these ideas can turn into the seeds of interesting stories, so here it's comparing artists to dictators.",
                    "label": 0
                },
                {
                    "sent": "Becausw artists promote our true beauty and dictators suppress critics.",
                    "label": 0
                },
                {
                    "sent": "What if they were to suppress the critics that criticize art?",
                    "label": 0
                },
                {
                    "sent": "What kind of friendly dictator would not be so you can say, OK?",
                    "label": 0
                },
                {
                    "sent": "What if an artist became a dictator, then what would they do?",
                    "label": 0
                },
                {
                    "sent": "Well, the first thing they would do is they would round up all their critics right and do something nasty to them.",
                    "label": 0
                },
                {
                    "sent": "So that's an interesting story.",
                    "label": 0
                },
                {
                    "sent": "There is a change from an artist to a dictator, and we have causal reasoning going on in the system.",
                    "label": 0
                },
                {
                    "sent": "So these tweets can be seen as little story ideas and a lot of Twitter bots work that way.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this particular one here we use sophistry to line things up.",
                    "label": 0
                },
                {
                    "sent": "Comedians break taboos.",
                    "label": 0
                },
                {
                    "sent": "This is a tweet.",
                    "label": 0
                },
                {
                    "sent": "Discontent on reminds the societies that enforced taboos do discontents make good comedians.",
                    "label": 0
                },
                {
                    "sent": "This was treated 1st of June.",
                    "label": 0
                },
                {
                    "sent": "OK, so there was a story idea right there.",
                    "label": 0
                },
                {
                    "sent": "What if someone was really upset with SoC but found happiness by becoming a malcontented comedian?",
                    "label": 0
                },
                {
                    "sent": "OK, or apostles nurture fates?",
                    "label": 0
                },
                {
                    "sent": "She had to threaten the infidels to disavow Bates who was better.",
                    "label": 0
                },
                {
                    "sent": "This was a few months ago.",
                    "label": 0
                },
                {
                    "sent": "One of an Apostle who was a really religious person suddenly turned into my son the extremist right.",
                    "label": 0
                },
                {
                    "sent": "It's not an inconceivable leap.",
                    "label": 0
                },
                {
                    "sent": "In fact, it happens all the time.",
                    "label": 0
                },
                {
                    "sent": "Interesting story to lack a goal.",
                    "label": 0
                },
                {
                    "sent": "This can turn assiduous researchers and the prodigal waste throats look around you, right?",
                    "label": 0
                },
                {
                    "sent": "So there's another causality.",
                    "label": 0
                },
                {
                    "sent": "Change transformation pioneers created enterprises propaganda serve the leaders that launch enterprises who was better and we all know that entrepreneurs are propagandists for their own stuff.",
                    "label": 0
                },
                {
                    "sent": "What if they became real propagandists and there was nothing that they were selling?",
                    "label": 0
                },
                {
                    "sent": "It was all just hype.",
                    "label": 0
                },
                {
                    "sent": "Great story ideas come from conflict so.",
                    "label": 0
                },
                {
                    "sent": "If you feel like you need you would like to use somebody storage that is top directly into metaphor magnet the web service or the Twitter bot app meter magnet.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quick call out to Mike.",
                    "label": 0
                },
                {
                    "sent": "As Angelina, he's a method cook terrible point.",
                    "label": 0
                },
                {
                    "sent": "Matt Cook, right so.",
                    "label": 0
                },
                {
                    "sent": "Basically, in his appreciation bot.",
                    "label": 0
                },
                {
                    "sent": "He's generating particular kinds of narratives about these static objects in the Metropolitan Museum.",
                    "label": 0
                },
                {
                    "sent": "He's generating this.",
                    "label": 0
                },
                {
                    "sent": "He's kind of.",
                    "label": 0
                },
                {
                    "sent": "His tweets are kind of positive compared to my negative ones.",
                    "label": 0
                },
                {
                    "sent": "OK, he's kind of.",
                    "label": 0
                },
                {
                    "sent": "He sees the good in everything in these stories.",
                    "label": 0
                },
                {
                    "sent": "Interesting representation and that kind of thing.",
                    "label": 0
                },
                {
                    "sent": "Where as I would be damning it with Metro magnet.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and just to conclude.",
                    "label": 0
                },
                {
                    "sent": "Just think of our group as a metaphor factory.",
                    "label": 0
                },
                {
                    "sent": "We have so many metaphors to give away and we genuinely will give them away.",
                    "label": 1
                },
                {
                    "sent": "We want to give you metaphors.",
                    "label": 0
                },
                {
                    "sent": "OK we want we have services on the web.",
                    "label": 0
                },
                {
                    "sent": "We have the Twitter bot.",
                    "label": 0
                },
                {
                    "sent": "We are convinced that a lot of the work going on here would benefit from having the conceptual conceit that is provided by interesting metaphors.",
                    "label": 1
                },
                {
                    "sent": "Mike is A is an avid user trying to convert more of you if you want metaphors by the truckload for your particular needs in real time via web service, we're happy to talk to you, the tailor, the output to collaborate, but just see it as a stream of conceptual oppositions that involve conflict and similarity.",
                    "label": 0
                },
                {
                    "sent": "Poetry blending we can provide all of that via web services, so please do check out afflatus at UCD, IE an app metapher Magnus OK, I will leave it there.",
                    "label": 0
                },
                {
                    "sent": "I think if I understood you right, you're you're starting and ending your arcs on corpus, attested.",
                    "label": 0
                },
                {
                    "sent": "Things that say you should start here and you should end here is that you can't start here and you can't end right because there are corpus and it uses ways to measure just.",
                    "label": 0
                },
                {
                    "sent": "It's a fuzziness thing, not a binary distinction.",
                    "label": 0
                },
                {
                    "sent": "So the question though is wouldn't you get potentially really interesting things if you did just the opposite of that, so you said nobody becomes a boy.",
                    "label": 0
                },
                {
                    "sent": "Well, Benjamin Button became a boy, and that's a really different store.",
                    "label": 0
                },
                {
                    "sent": "Did not workout for him.",
                    "label": 0
                },
                {
                    "sent": "Did you see that movie I did?",
                    "label": 0
                },
                {
                    "sent": "He died at the end.",
                    "label": 0
                },
                {
                    "sent": "I mean, if you will.",
                    "label": 0
                },
                {
                    "sent": "I think he was born at the end of it.",
                    "label": 0
                },
                {
                    "sent": "It too.",
                    "label": 0
                },
                {
                    "sent": "If you watch that movie on a plane you walk out.",
                    "label": 0
                },
                {
                    "sent": "Come on.",
                    "label": 0
                },
                {
                    "sent": "No, but seriously, that's called science, and there's all sorts of crap storylines that you can make sensible by invoking the card science rule.",
                    "label": 0
                },
                {
                    "sent": "Richard Curtis does a lot of them.",
                    "label": 0
                },
                {
                    "sent": "What about if I could go back in time and marry a librarian and then go back in time whenever we had an argument?",
                    "label": 0
                },
                {
                    "sent": "That kind of thing.",
                    "label": 0
                },
                {
                    "sent": "Time travel, sex change?",
                    "label": 0
                },
                {
                    "sent": "Immersing yourself, I mean, once you do it once it's done, move on to make plausible stories that are still interesting, you have to have plausibility built into the mechanism.",
                    "label": 0
                },
                {
                    "sent": "And if you say anything goes, anything will go.",
                    "label": 0
                },
                {
                    "sent": "We don't want that, I just wanted to question the big assumption about stories or interesting stories requiring conflict.",
                    "label": 0
                },
                {
                    "sent": "There's a huge well.",
                    "label": 0
                },
                {
                    "sent": "There's a huge history of Japanese and Chinese storytelling, which is just about changing perspectives.",
                    "label": 0
                },
                {
                    "sent": "Just A twist, and it doesn't require any domination of one party over another one.",
                    "label": 0
                },
                {
                    "sent": "And I think that metaphor magnet can be equally applied to that, but I really want to stress that you know conflict is a.",
                    "label": 0
                },
                {
                    "sent": "It's a very western centric thing that we have and that we have an appetite for and we shouldn't have any assumptions about that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I've got a monstrous appetite for that.",
                    "label": 0
                },
                {
                    "sent": "It's a fair cop Gov, so we're not covering Japanese.",
                    "label": 0
                },
                {
                    "sent": "Chinese sensibilities were working squarely in a Western tradition, guided by our Stottle Latter Day prop.",
                    "label": 0
                },
                {
                    "sent": "We could we could generalize to everybody, but then we would get this Gray soup.",
                    "label": 0
                },
                {
                    "sent": "So I say, let the Japanese and Chinese researchers come up with models of their storytelling culture and will come up with arts and let's them fight it out on Twitter.",
                    "label": 0
                },
                {
                    "sent": "OK, well I think lunch is being served down in the Gallery, so let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}