{
    "id": "p2pphsegtorklp4qat5hjnvfoipgsdmn",
    "title": "Semantic Reasoning: A Path To New Possibilities of Personalization",
    "info": {
        "author": [
            "Yolanda Blanco-Fernández, University of Vigo"
        ],
        "published": "Aug. 16, 2008",
        "recorded": "June 2008",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc08_blanco_sr/",
    "segmentation": [
        [
            "My name is Rhonda Blanco and I'm going to present the paper semantic reasoning about to new possibilities of personalization.",
            "Nowadays, recommender systems are gaining moment."
        ],
        [
            "You mean the digital revolution helping people to manage the overload of information in diverse domains and reducing complexity when searching for relevant information, three components are needed in a recommender system to meet its their personalization requirements.",
            "First database, where the items available in the personalization tools a restore second, the profiles where the preferences or needs of each user, our model, and finally recommendation strategies to select the personalized suggestions for each individual.",
            "Where?",
            "In this regard, two of the most popular solutions are the so called content based filtering and collaborative filtering."
        ],
        [
            "Content based filtering is a strategy ace and suggesting to user items similar to those he like in the past considering their respective content, descriptions or attributes.",
            "The employee metrics a result too inflexible syntactic matching techniques that only measure similarity detect similarity between items sharing identical attributes.",
            "For that reason, traditional content based strategies lead to overspecialized recommendations, including only items very similar to those the user already knows.",
            "To fight over specialization, researchers device a new approach and collaborative filtering based on suggesting to a user items interesting for other viewers.",
            "For other individuals with similar preferences name neighbors.",
            "Collaborative filtering approach is a diversified offer recommendations and considering the preferences of other users, but this fact causes news limitations.",
            "For example, privacy concerns related to the confidentiality of the personal data of the of the users is scalability problems and, limitation in the state of the art name sparsity problem related to difficulties to select the neighbors of each user when they consider users have not rated.",
            "The same items in their respective profiles."
        ],
        [
            "OK, beating in mind the severe limitations of collaborative approach.",
            "Using our research, we have Explorer Noble, content based strategy.",
            "Our goal is to exploit the main strengths of this personalization paradigm and to reduce the effects of the overspecialized traditional recommendation so far by this strategy.",
            "We diversify the the suggestion software to the users without knowing the preferences of other users as like in traditional collaborative approaches, and so it's possible to protect the privacy of the users.",
            "More precisely, we fight the syntactic limitations of the traditional content based strategies by adapting to reasoning techniques I will describe later name semantic associations and spreading activation techniques.",
            "Even though these mechanisms have been having a widely used in the field of the reasoning, we need to meet their internals to satisfy the personalization personalization requirements of recommender system.",
            "More precisely, are restricted in must learn, automatically know it's about the user preferences from their relevance feedback provided by them after recommendations, and we must also adapt recommendations as the user preferences able for change overtime.",
            "In order to apply reasoning process is we need to formalize the domain of their recommender system in ontology.",
            "This anthology includes the items available in the personalization tool along with their main annotation, semantic annotations, attributes and things are approach.",
            "We exploit the knowledge of these domain ontology to model the user preferences, so it's possible to infer extra information about the likings and disliking so fits user by means of different inferential processes."
        ],
        [
            "Here we can see a brief, very brief start from ontology adopting activity recommender system where the goal is to select the TV programs most appealing to its individual.",
            "We were taken into account, the programs within the past week and see a hierarchy of different categories.",
            "Refer to fiction, contents, nonfiction programs, and laser contents with more specific categories and there under then the Intelligencia specific TV programs linked to the respective attributes.",
            "If I mean sort of level properties that you would say that essay topics a great symbol from the program, so I identifiers.",
            "So for example, we can see I'm going to documentary about the World War One or several movies involving Tom Cruise, starring actor for example as well shot Vanilla Sky or Jerry Maguire."
        ],
        [
            "In our approach, we model the user preferences, reusing the knowledge of the knowledge, formalizing the domain ontology.",
            "As we can see in this figure, it's user's profile contains a list of the identifiers of the items that were appealing or unappealing to the user, along with their respective ratings.",
            "Measuring the interest of the user in each individual item.",
            "Thanks to identifiers, we can obtain a complete, detailed description of its.",
            "Item in the user's profile so we can obtain, for example, the hierarchy of categories under which the item is classified in the domain ontology and their respective attributes.",
            "This user modeling technique based on ontologies provides.",
            "Formal representation with the user preferences permitting to reason about then and to infer extra knowledge about the user preferences.",
            "So it's possible to compare these preferences against the items available in the recommender system in a more efficient way, leading to personalization process is more accurate than the traditional syntactic approaches."
        ],
        [
            "How we presented the domain ontology and the user modeling technique I'm going to describe the internals of our content based strategy enhanced by semantic reasoning consisting of two phases.",
            "A name filtering phase and recommendation phase.",
            "They roll in the filtering faces to select start from the domain ontology containing instances of classes and properties that are really bad for the user.",
            "Then we must infer semantic associations relationships between the specific items available in the recommender system and the users preferences.",
            "This ain't no listen further in the filtering phase must be processed in the recommendation phase of the strategy, exploiting the inferential capabilities of spreading activation techniques.",
            "Here the goal is to detect concepts items in the ontology strongly related to the users positive preferences.",
            "Leading to enhance content based recommendations.",
            "If I miss of semantic reasoning."
        ],
        [
            "OK, I will start describing the first phase in the strategy in the first question is how do we find the instances relevant for a specific user?",
            "First, we locate in the anthology the items defined in the user's profile and we travel successfully.",
            "The properties bound to these items until until reaching nodes in the domain ontology.",
            "In order to guarantee the computational feasibility, we have developed control inference mechanism working as follows.",
            "As new nodes are read from a specific instance in the domain Ontology, we measure their relevance for the user according to his preferences.",
            "So the nodes with the relevance index is lower than specific threshold are ignored and so that we continu exploring continued travel scenes successfully.",
            "Only properties permitting to reach new nodes from those relevant for the user.",
            "This way our inference mechanism is able to explore only instances of classes and properties.",
            "Real event for the consider user filtering others that probably don't provide knowledge useful for our personalization process."
        ],
        [
            "The second question is how do we compute the relevance index corresponding to a given node N?",
            "In our approach, the stronger the relationship established between they consider node and the node whose relevance index we want to measure and they use sorry and the user preferences, they hire the relevance index of this node N. We measure these relevance value considering different entirely dependent filtering criteria.",
            "The first criterium established that depends on the length of a change or properties.",
            "A permitting to reach the consider node N is starting from the items they find in the user's profile.",
            "In our approach, the longer listing of properties established between N and the user preferences, the lower the relevance value of the node N because the relationship between the node end and the user preferences is less significant due to the presence of many intermediate nodes between them.",
            "The second Secretary am established that the greater the hierarchical relationships established between the node and another instances in the user's profile, the greater the relevance of the node end and Lastly, we compute the relevance of the node considering different implicit relationships detected by means of different concepts borrowed from the graph theory.",
            "More precisely, we adopt the notion of betweeness according to a graph theoretic bitterness among three nodes.",
            "Is high when in the most paths between the 1st and the 2nd node, the third node is also included in our approach.",
            "They consider nodes are the user preferences.",
            "On the one hand, and the node and we who say relevance in less, we want to measure on the other one."
        ],
        [
            "OK, having selected based as he is really bad for a user, we must infer semantic associations relationships between the selected instances.",
            "Refer to specific items in the recommender system.",
            "For example, a semantic associations between programs in a TV recommender system.",
            "For that purpose we have adopted three of the semantic associations proposed by the authors and yambo and set in the context of the research projects and this, as we can see in the figure a, we consider that too.",
            "Items are robot associated when they are joined by mean by means of a chain or a sequence of properties.",
            "For example, the documentary Learn about World War One and the movie Paths of Glory are associated by means of the instance.",
            "Refer to this world.",
            "The second Association, established at two items, are raging associated when their respective attributes a share recommend a class in the Domain Ontology.",
            "For example, the programs, last samurai and welcome to Tokyo are associated because they both programs are bound to different series in Japan.",
            "And finally, we consider two programs, a row CP associated when they share a common ancestor in some of the hierarchy is defined in the domain ontology in the figure.",
            "Acquiring end of this to movies belonging to the categories, drama and Mystery, respectively, are related by means of the common ancestor fiction contests.",
            "Then only thing for a."
        ],
        [
            "During the filtering, fast must be processed in the second phase of the strategy.",
            "For that purpose, we exploit the inferential capabilities capabilities of the spreading activation techniques and they are intelligent mechanisms able to explain exploring efficient way the relationships established among nodes interconnected by means of links in a generic network name spreading activation network.",
            "The goal of spreading activation techniques in our approach is to detect items strongly related to the user's positive preferences, leading to content based recommendations endowed with rich data."
        ],
        [
            "City.",
            "Before detailing the internals of our strategy, I will explain how traditional splitting activation techniques work.",
            "These techniques explore here.",
            "Note Huey.",
            "No let's say net worth, including notes and links it snowed A has an activation level measuring its relevance in the network and its link between two nodes has a has associated weight.",
            "Measuring the strength of the relationship established between the two link nodes.",
            "Initially, a set of nodes are activated in the network and their respective activation levels are expressed until reaching other nodes in the network connected to them by means of links.",
            "A name neighbor nodes.",
            "This is pretty OK.",
            "I say this the activation level of reads.",
            "A node is a computed is updated during this printing process and this value is computed combining the activation levels of the neighbor nodes of the node.",
            "And the weights of the links established between the consider note the note I in the figure and its respective neighbors.",
            "Finally, the highest in the splitting process.",
            "Here, Rich Rich is all the nodes in the network, and finally the highest activation levels correspond to the nodes strongest related to those initially activated in the network."
        ],
        [
            "OK, so to exploit the inference capability capabilities, office spreading activation techniques in our strategy is necessary to create the spring activation network for the user.",
            "The notes of this network are the class instance is selected during the filtering phase and the links are able to property the selected property instances and the semantic associations infer the domain ontology.",
            "The next question is how do we weight the links of the spreading activation network of the user?",
            "In traditional spreading activation techniques, the weight of the link between two nodes depend only the strength of the relationship established between these two link nodes.",
            "Remaining static overtime, bearing in mind the personalization requirements of recommender system.",
            "It's obvious that we must also consider the user preferences during this waiting process of the links of the network for the.",
            "For the consider use.",
            "More precisely, in our approach, the stronger the relationship established between the two link nodes and the positive preferences of a user, the higher the great assigned to this link.",
            "So as the user preferences evolve overtime, we can update the weights of the links in his neighbor in his network.",
            "Sorry, and therefore we can also update the content based recommendations over to him."
        ],
        [
            "OK, having a created a user suspending activation network and waiting it's links, we can apply spreading activation techniques.",
            "They know, cynical, activated are the items they find in the user's profile and we use US activation as initial activation levels.",
            "The respective rating.",
            "Seeing in the profile after splitting process, the items with highest activation levels have suggested to the user.",
            "More precisely, we suggest a the items whose activation levels are greater than.",
            "A specific threshold.",
            "These items is satisfy two conditions.",
            "First a, their neighbor notes in the users network are also really want for the user, and for that reason this neighbor nodes have a high activation levels.",
            "After this building process and second they suggested items are strongly related to the users positive preferences and for that reason the weights of the links established between the suggested items and their neighbors have also a very high value, is very high rates.",
            "Finally, they suggested items are ranked according to their respective activation levels, with the items strongest related to their positive preferences of the user."
        ],
        [
            "The top of the recommendation.",
            "Next I will describe some examples of content recommendations in the domain of the little TV where users where we were, say, face overload of advisor content, interactive applications.",
            "We're going to assume the state of dreaming of the TV ontology described previously.",
            "Remembering this figure.",
            "And we consider everywhere Mary, whose preferences are depicted in the below a table according to this table that we were married a like the documentary is welcome to Tokyo and Learn about World War One and the movies.",
            "Vanilla Sky and Jerry Maguire, a involving Tom Cruise starring actor regarding the negative preferences of everywhere.",
            "We will assume that Mary didn't like $1,000,000 baby with Morgan Freeman as a supporting actor and the movie about martial arts game of."
        ],
        [
            "Initially we select the set of instances relevant for this viewer.",
            "For example, we select the instances, refer to the movies born on the 4th of July to the last Samurai be cause they are related to the preferences of the viewer by means of their common ancestors, drama movies and action movies respectively.",
            "As many like a other programs about World War One in Kyoto, we select instances of the class is sharing.",
            "The classes were topics in Japanese cities and finally we select for example an instance very relevant for the personalization process.",
            "The instant refer to the movie Danny Dog.",
            "This instance is very important because it's strongly related to the negative preferences of the users.",
            "On the one hand, I need OK involves a young actor, few interesting for Mary Morgan Freeman, and it's about a topic few interesting for this viewer."
        ],
        [
            "Yeah, we can see a we can see a brief state of the semantic associations infer from the TV ontology we associate.",
            "For example, Jerry Maguire and Bond with the 4th of July by means of the common ancestor Tom Cruise.",
            "We're going to talk in the last samurai because both programs are bound to different series in Japan.",
            "An for example, Vanilla Sky and the last summer it goes.",
            "Both movies recommend sister in the TV ontology refers to the action content."
        ],
        [
            "OK, in this figure we can see the spinning activation network depicted for created for the user may.",
            "Here we can see the instances of classes and properties selected during the filtering phase and the semantic associations infer from the TB ontology represented by means of Red Arrows.",
            "The programs in the images profile are a depicted by means of a Gray... and the program suggested by our strategy are denoted by means of a Gray... according to what I explained before, the program suggested to marry a receive links from other programs.",
            "Very interesting for this viewer.",
            "For example, we suggest the movie paths of Glory because the activation level of this movie will be increased thanks to the positive weight injected.",
            "Write the note.",
            "Learn about World War One.",
            "Similarly, we suggest born on the 4th of July or the last samurai because their respective activation levels are increased by means of the links received from other nodes.",
            "Very relevant for the viewer.",
            "Lastly, we this spring activation Network a also identifies TV programs that must not be suggested to Mary.",
            "For example, Danny the dog is not suggested to this.",
            "Beware because he's activation level is decreased thanks to the negative weights injected by the nodes.",
            "Morgan Freeman and gains of death refer to negative preferences of Mary, so it's possible to prevent from suggesting to everywhere TV programs say closely related to other contents.",
            "Few interesting for her."
        ],
        [
            "In the past.",
            "OK, in order to validate our strategy, you have carry out preliminary test involving four hundreds and graduate students from our University, University of Vigo.",
            "We have developed if anthology including programs extracted from the Internet Movie Database, all programming Gate and the BBC website.",
            "We requested the users to rate 400 programs and they assigned a positive and negative ratings 2 four programs appealing or unappealing to them.",
            "Typically we evaluated our strategy against to.",
            "A protein is defined in the return in the fighting literature.",
            "The first strategy was proposed by O'Sullivan at all these authors a describe an approach employing content based filtering where the similarity between the user preferences and the suggested programs is measured between by means of different Association rules.",
            "More precisely, Association rule is detected between two programs.",
            "When both programs appear together in many turning profiles.",
            "The second thing evaluated frustrated we proposed by by Maurice ET al.",
            "This author, say, propose a collaborative filtering approach and hence by means of semantics, where the neighborhood of its user is a creative.",
            "Considering the ratings defined in the user's profile and the attributes of the items included in these profiles."
        ],
        [
            "The preferences of our users were divided into two groups.",
            "The preferences of the 40% of the users were storing the training profiles using the approach of all to measure similarity between programs to detect Association rules between programs, and more precisely, the greater the number of training profiles containing together the two compare programs.",
            "The higher their similarity value.",
            "The preferences of the remaining users were used to execute the three evaluated strategies.",
            "Out of the initially rated 400 programs, we have selected the temperance most appealing for its user according to his ratings and the same programs most unappealing to him.",
            "And we with these twenty programs, we initialize the there's a user's profiles in this profile.",
            "In this process, we obtain a low overlap between the programs rated by the users.",
            "And the remaining programs had a ratings where store in the so called users evaluation data and were used to measure the accuracy of the recommendations offered by by it's evaluated strategy, especially as accurate accuracy metrics.",
            "We have used recall and precision Ricord was defined as the percentage of programs with positive rating in the users evaluation data that were suggested by the consider strategy and the precision of strategy where was defined.",
            "As a percentage of the programs suggested by the strategy having a positive rating in the users evaluation data, finally we average the recording precision values considering the 200."
        ],
        [
            "40 test users.",
            "We can see they obtain results.",
            "According to this figure.",
            "A our restated influence by semantic reasoning or things the leads to the greatest number of programs appealing to its user and the lowest number of programs are appealing to the users.",
            "That is the greatest values of recalling precision respectively.",
            "Thanks to the combination of the two recent mechanisms, spreading activation techniques and the semantic associations infer from the domain ontology.",
            "According to this figure, our strategy a discovers many problems relevant for the users going unnoticed in the two other evaluated strategies.",
            "The voice of our reasoning capabilities.",
            "The process of a suliban head master at all a lead to lower values of recall and precision, and this lower values are strongly related to the low overlap between the programs they find in the test users.",
            "Considering the experiments in the approach of a solid bang at all, they'll overlap between the programs in the considered profiles, makes difficult to detect Association rules between the compare programs, and therefore to measure similarity between.",
            "The program suggested to the user and his preferences in the approach of mobasser at all this low overlap between programs make it difficult to detect the neighbors of each user and therefore to offer collaborative recommendations."
        ],
        [
            "To conclude, this tool K, I'm going to present some conclusions.",
            "We have presented a personalization paradigm eruditione the reducing limitations are resolved in traditional content based strategies thanks to the combination of semantic Association Santa spreading activation techniques as reasoning mechanisms.",
            "More precisely, we diversify the offer recommendations, including items semantically related to the user's preferences, going beyond the traditional syntactic matching techniques.",
            "At least 80 considers the positive and negative preferences of the users positive preferences.",
            "Elite two programs that must be suggested to the user, while negative preferences decrease, tend to decrease the activation levels of items strongly related to them.",
            "A duty that's recommendations as user preferences.",
            "A bowl for change.",
            "Overtime.",
            "In this case, the filtering phase a selects new instances of classes and properties in first new associations from the domain Ontology and incorporates all this information in the current spreading activation network created for the user.",
            "A district is flexible enough to be using multiple domains a.",
            "This only depends on the domain ontology, and the strategy is not exclusively joined to a specific domain.",
            "And finally, according to the experimental results of our evaluation, we obtain significant increase increases in recording position with regard to other strategies, which are the both of our reasoning."
        ],
        [
            "This.",
            "Regarding the further work we plan to we are going.",
            "We are working in a mechanism to adjust the threshold using the filtering and recommendation faces.",
            "Specifically the values of distress calls will be a dynamically adjusted at the user preferences, evolve overtime and the values will depend on the domain ontology and the feedback provided by the users have their recommendations and we also plan to carry out new experiments with other state of the art strategies.",
            "And symbol being the subscribers of the cable networks or for Spanish operator or with recommender systems using our strategy, is being currently diploid."
        ],
        [
            "And with this I finish presentation.",
            "Thank you."
        ],
        [
            "How do you capture the preferences of?",
            "In the experiment.",
            "Yes, intermingle TV.",
            "We can infer a notice about their user preferences from parameters such as the time elapse, it from the user selected program, suggested program by the assistant until the instant the user watch this program an from the selection of the users they're rejecting, or the attention acceptance of the recommendations offered by the user in the test, we explicitly requested the users to rate.",
            "A list of TV programmes assigning positive or negative ratings, but this process can be automated, can be made automatically.",
            "Any other questions?",
            "2004 sorry, can you repeat the question?",
            "But there's no.",
            "The World Wide Web 2004 conference.",
            "But those almost exactly what we're doing for semantic searching.",
            "Thanks for that solution.",
            "Sorry I can't understand the first one paper published in 2004 that does follows the similar uploads and the question is whether you are aware over that work published in 2004.",
            "About the number of those users know about an approach to personalization.",
            "And the question is.",
            "And so on.",
            "But the question is, are there other approaches?",
            "Map of that.",
            "Working with semantic reasoning and personalization.",
            "Other similar to yours?",
            "If are there other approaches similar to this one?",
            "Activation overspeeding activation techniques or sorry OK, yes there are another work seeing literature working with spreading activation techniques, but we don't know other works in the field of personalization.",
            "A yes in the field day off a certain semantic searching in the semantic web, but not in the filter personalization, and for that reason we need to adapt the spreading activation techniques.",
            "For example the waiting process of the links to the personalization requirements of assistant.",
            "We don't use only the strength of the relationships between the two linked nodes, but we also consider the user preferences.",
            "We consider the strength of the relationship between the two lymph nodes and the user preferences in their profile in order to satisfy the personalization requirements.",
            "If I understood correctly.",
            "Given the user's profile, we try to find.",
            "Glasses, yes.",
            "Profile associations of the ontology level we search instances specific instances of classes and properties relevant for the user, and then we establish semantic associations between these selected instances.",
            "Refer to items in the in the.",
            "In the recommender system we only study semantic associations between, for example, TV programs.",
            "In active recommender system between books in recommender systems offering personalized books for for each individual.",
            "You do it on the instance.",
            "Instances you haven't anthology was used with other people doing other ontology with the description, pluses or property descriptions in the target at work levels are using this method.",
            "Level of specific instances only.",
            "On the other level of specific instances.",
            "Any other question?",
            "They have a short one there.",
            "What the propagation of weights is bidirectionally, yes.",
            "Wait for yes no.",
            "We use an average value between the relevance indexes of the tooling of the true link nodes.",
            "We have to link nodes within by means.",
            "So far bidirectional node and when we consider A1 node we consider the great injected by the other one and.",
            "Vice versa.",
            "Thanks again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Rhonda Blanco and I'm going to present the paper semantic reasoning about to new possibilities of personalization.",
                    "label": 0
                },
                {
                    "sent": "Nowadays, recommender systems are gaining moment.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You mean the digital revolution helping people to manage the overload of information in diverse domains and reducing complexity when searching for relevant information, three components are needed in a recommender system to meet its their personalization requirements.",
                    "label": 1
                },
                {
                    "sent": "First database, where the items available in the personalization tools a restore second, the profiles where the preferences or needs of each user, our model, and finally recommendation strategies to select the personalized suggestions for each individual.",
                    "label": 1
                },
                {
                    "sent": "Where?",
                    "label": 0
                },
                {
                    "sent": "In this regard, two of the most popular solutions are the so called content based filtering and collaborative filtering.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Content based filtering is a strategy ace and suggesting to user items similar to those he like in the past considering their respective content, descriptions or attributes.",
                    "label": 1
                },
                {
                    "sent": "The employee metrics a result too inflexible syntactic matching techniques that only measure similarity detect similarity between items sharing identical attributes.",
                    "label": 0
                },
                {
                    "sent": "For that reason, traditional content based strategies lead to overspecialized recommendations, including only items very similar to those the user already knows.",
                    "label": 1
                },
                {
                    "sent": "To fight over specialization, researchers device a new approach and collaborative filtering based on suggesting to a user items interesting for other viewers.",
                    "label": 1
                },
                {
                    "sent": "For other individuals with similar preferences name neighbors.",
                    "label": 0
                },
                {
                    "sent": "Collaborative filtering approach is a diversified offer recommendations and considering the preferences of other users, but this fact causes news limitations.",
                    "label": 0
                },
                {
                    "sent": "For example, privacy concerns related to the confidentiality of the personal data of the of the users is scalability problems and, limitation in the state of the art name sparsity problem related to difficulties to select the neighbors of each user when they consider users have not rated.",
                    "label": 0
                },
                {
                    "sent": "The same items in their respective profiles.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, beating in mind the severe limitations of collaborative approach.",
                    "label": 0
                },
                {
                    "sent": "Using our research, we have Explorer Noble, content based strategy.",
                    "label": 0
                },
                {
                    "sent": "Our goal is to exploit the main strengths of this personalization paradigm and to reduce the effects of the overspecialized traditional recommendation so far by this strategy.",
                    "label": 0
                },
                {
                    "sent": "We diversify the the suggestion software to the users without knowing the preferences of other users as like in traditional collaborative approaches, and so it's possible to protect the privacy of the users.",
                    "label": 0
                },
                {
                    "sent": "More precisely, we fight the syntactic limitations of the traditional content based strategies by adapting to reasoning techniques I will describe later name semantic associations and spreading activation techniques.",
                    "label": 1
                },
                {
                    "sent": "Even though these mechanisms have been having a widely used in the field of the reasoning, we need to meet their internals to satisfy the personalization personalization requirements of recommender system.",
                    "label": 0
                },
                {
                    "sent": "More precisely, are restricted in must learn, automatically know it's about the user preferences from their relevance feedback provided by them after recommendations, and we must also adapt recommendations as the user preferences able for change overtime.",
                    "label": 0
                },
                {
                    "sent": "In order to apply reasoning process is we need to formalize the domain of their recommender system in ontology.",
                    "label": 0
                },
                {
                    "sent": "This anthology includes the items available in the personalization tool along with their main annotation, semantic annotations, attributes and things are approach.",
                    "label": 0
                },
                {
                    "sent": "We exploit the knowledge of these domain ontology to model the user preferences, so it's possible to infer extra information about the likings and disliking so fits user by means of different inferential processes.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we can see a brief, very brief start from ontology adopting activity recommender system where the goal is to select the TV programs most appealing to its individual.",
                    "label": 0
                },
                {
                    "sent": "We were taken into account, the programs within the past week and see a hierarchy of different categories.",
                    "label": 0
                },
                {
                    "sent": "Refer to fiction, contents, nonfiction programs, and laser contents with more specific categories and there under then the Intelligencia specific TV programs linked to the respective attributes.",
                    "label": 0
                },
                {
                    "sent": "If I mean sort of level properties that you would say that essay topics a great symbol from the program, so I identifiers.",
                    "label": 0
                },
                {
                    "sent": "So for example, we can see I'm going to documentary about the World War One or several movies involving Tom Cruise, starring actor for example as well shot Vanilla Sky or Jerry Maguire.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In our approach, we model the user preferences, reusing the knowledge of the knowledge, formalizing the domain ontology.",
                    "label": 0
                },
                {
                    "sent": "As we can see in this figure, it's user's profile contains a list of the identifiers of the items that were appealing or unappealing to the user, along with their respective ratings.",
                    "label": 0
                },
                {
                    "sent": "Measuring the interest of the user in each individual item.",
                    "label": 0
                },
                {
                    "sent": "Thanks to identifiers, we can obtain a complete, detailed description of its.",
                    "label": 0
                },
                {
                    "sent": "Item in the user's profile so we can obtain, for example, the hierarchy of categories under which the item is classified in the domain ontology and their respective attributes.",
                    "label": 0
                },
                {
                    "sent": "This user modeling technique based on ontologies provides.",
                    "label": 0
                },
                {
                    "sent": "Formal representation with the user preferences permitting to reason about then and to infer extra knowledge about the user preferences.",
                    "label": 0
                },
                {
                    "sent": "So it's possible to compare these preferences against the items available in the recommender system in a more efficient way, leading to personalization process is more accurate than the traditional syntactic approaches.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How we presented the domain ontology and the user modeling technique I'm going to describe the internals of our content based strategy enhanced by semantic reasoning consisting of two phases.",
                    "label": 0
                },
                {
                    "sent": "A name filtering phase and recommendation phase.",
                    "label": 1
                },
                {
                    "sent": "They roll in the filtering faces to select start from the domain ontology containing instances of classes and properties that are really bad for the user.",
                    "label": 1
                },
                {
                    "sent": "Then we must infer semantic associations relationships between the specific items available in the recommender system and the users preferences.",
                    "label": 0
                },
                {
                    "sent": "This ain't no listen further in the filtering phase must be processed in the recommendation phase of the strategy, exploiting the inferential capabilities of spreading activation techniques.",
                    "label": 0
                },
                {
                    "sent": "Here the goal is to detect concepts items in the ontology strongly related to the users positive preferences.",
                    "label": 1
                },
                {
                    "sent": "Leading to enhance content based recommendations.",
                    "label": 0
                },
                {
                    "sent": "If I miss of semantic reasoning.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, I will start describing the first phase in the strategy in the first question is how do we find the instances relevant for a specific user?",
                    "label": 1
                },
                {
                    "sent": "First, we locate in the anthology the items defined in the user's profile and we travel successfully.",
                    "label": 1
                },
                {
                    "sent": "The properties bound to these items until until reaching nodes in the domain ontology.",
                    "label": 0
                },
                {
                    "sent": "In order to guarantee the computational feasibility, we have developed control inference mechanism working as follows.",
                    "label": 0
                },
                {
                    "sent": "As new nodes are read from a specific instance in the domain Ontology, we measure their relevance for the user according to his preferences.",
                    "label": 1
                },
                {
                    "sent": "So the nodes with the relevance index is lower than specific threshold are ignored and so that we continu exploring continued travel scenes successfully.",
                    "label": 0
                },
                {
                    "sent": "Only properties permitting to reach new nodes from those relevant for the user.",
                    "label": 0
                },
                {
                    "sent": "This way our inference mechanism is able to explore only instances of classes and properties.",
                    "label": 0
                },
                {
                    "sent": "Real event for the consider user filtering others that probably don't provide knowledge useful for our personalization process.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second question is how do we compute the relevance index corresponding to a given node N?",
                    "label": 0
                },
                {
                    "sent": "In our approach, the stronger the relationship established between they consider node and the node whose relevance index we want to measure and they use sorry and the user preferences, they hire the relevance index of this node N. We measure these relevance value considering different entirely dependent filtering criteria.",
                    "label": 0
                },
                {
                    "sent": "The first criterium established that depends on the length of a change or properties.",
                    "label": 0
                },
                {
                    "sent": "A permitting to reach the consider node N is starting from the items they find in the user's profile.",
                    "label": 0
                },
                {
                    "sent": "In our approach, the longer listing of properties established between N and the user preferences, the lower the relevance value of the node N because the relationship between the node end and the user preferences is less significant due to the presence of many intermediate nodes between them.",
                    "label": 1
                },
                {
                    "sent": "The second Secretary am established that the greater the hierarchical relationships established between the node and another instances in the user's profile, the greater the relevance of the node end and Lastly, we compute the relevance of the node considering different implicit relationships detected by means of different concepts borrowed from the graph theory.",
                    "label": 1
                },
                {
                    "sent": "More precisely, we adopt the notion of betweeness according to a graph theoretic bitterness among three nodes.",
                    "label": 0
                },
                {
                    "sent": "Is high when in the most paths between the 1st and the 2nd node, the third node is also included in our approach.",
                    "label": 0
                },
                {
                    "sent": "They consider nodes are the user preferences.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, and the node and we who say relevance in less, we want to measure on the other one.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, having selected based as he is really bad for a user, we must infer semantic associations relationships between the selected instances.",
                    "label": 0
                },
                {
                    "sent": "Refer to specific items in the recommender system.",
                    "label": 0
                },
                {
                    "sent": "For example, a semantic associations between programs in a TV recommender system.",
                    "label": 1
                },
                {
                    "sent": "For that purpose we have adopted three of the semantic associations proposed by the authors and yambo and set in the context of the research projects and this, as we can see in the figure a, we consider that too.",
                    "label": 0
                },
                {
                    "sent": "Items are robot associated when they are joined by mean by means of a chain or a sequence of properties.",
                    "label": 0
                },
                {
                    "sent": "For example, the documentary Learn about World War One and the movie Paths of Glory are associated by means of the instance.",
                    "label": 0
                },
                {
                    "sent": "Refer to this world.",
                    "label": 0
                },
                {
                    "sent": "The second Association, established at two items, are raging associated when their respective attributes a share recommend a class in the Domain Ontology.",
                    "label": 0
                },
                {
                    "sent": "For example, the programs, last samurai and welcome to Tokyo are associated because they both programs are bound to different series in Japan.",
                    "label": 0
                },
                {
                    "sent": "And finally, we consider two programs, a row CP associated when they share a common ancestor in some of the hierarchy is defined in the domain ontology in the figure.",
                    "label": 0
                },
                {
                    "sent": "Acquiring end of this to movies belonging to the categories, drama and Mystery, respectively, are related by means of the common ancestor fiction contests.",
                    "label": 0
                },
                {
                    "sent": "Then only thing for a.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "During the filtering, fast must be processed in the second phase of the strategy.",
                    "label": 0
                },
                {
                    "sent": "For that purpose, we exploit the inferential capabilities capabilities of the spreading activation techniques and they are intelligent mechanisms able to explain exploring efficient way the relationships established among nodes interconnected by means of links in a generic network name spreading activation network.",
                    "label": 0
                },
                {
                    "sent": "The goal of spreading activation techniques in our approach is to detect items strongly related to the user's positive preferences, leading to content based recommendations endowed with rich data.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "City.",
                    "label": 0
                },
                {
                    "sent": "Before detailing the internals of our strategy, I will explain how traditional splitting activation techniques work.",
                    "label": 0
                },
                {
                    "sent": "These techniques explore here.",
                    "label": 0
                },
                {
                    "sent": "Note Huey.",
                    "label": 0
                },
                {
                    "sent": "No let's say net worth, including notes and links it snowed A has an activation level measuring its relevance in the network and its link between two nodes has a has associated weight.",
                    "label": 1
                },
                {
                    "sent": "Measuring the strength of the relationship established between the two link nodes.",
                    "label": 0
                },
                {
                    "sent": "Initially, a set of nodes are activated in the network and their respective activation levels are expressed until reaching other nodes in the network connected to them by means of links.",
                    "label": 0
                },
                {
                    "sent": "A name neighbor nodes.",
                    "label": 0
                },
                {
                    "sent": "This is pretty OK.",
                    "label": 0
                },
                {
                    "sent": "I say this the activation level of reads.",
                    "label": 0
                },
                {
                    "sent": "A node is a computed is updated during this printing process and this value is computed combining the activation levels of the neighbor nodes of the node.",
                    "label": 0
                },
                {
                    "sent": "And the weights of the links established between the consider note the note I in the figure and its respective neighbors.",
                    "label": 0
                },
                {
                    "sent": "Finally, the highest in the splitting process.",
                    "label": 0
                },
                {
                    "sent": "Here, Rich Rich is all the nodes in the network, and finally the highest activation levels correspond to the nodes strongest related to those initially activated in the network.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so to exploit the inference capability capabilities, office spreading activation techniques in our strategy is necessary to create the spring activation network for the user.",
                    "label": 0
                },
                {
                    "sent": "The notes of this network are the class instance is selected during the filtering phase and the links are able to property the selected property instances and the semantic associations infer the domain ontology.",
                    "label": 1
                },
                {
                    "sent": "The next question is how do we weight the links of the spreading activation network of the user?",
                    "label": 1
                },
                {
                    "sent": "In traditional spreading activation techniques, the weight of the link between two nodes depend only the strength of the relationship established between these two link nodes.",
                    "label": 0
                },
                {
                    "sent": "Remaining static overtime, bearing in mind the personalization requirements of recommender system.",
                    "label": 0
                },
                {
                    "sent": "It's obvious that we must also consider the user preferences during this waiting process of the links of the network for the.",
                    "label": 0
                },
                {
                    "sent": "For the consider use.",
                    "label": 0
                },
                {
                    "sent": "More precisely, in our approach, the stronger the relationship established between the two link nodes and the positive preferences of a user, the higher the great assigned to this link.",
                    "label": 1
                },
                {
                    "sent": "So as the user preferences evolve overtime, we can update the weights of the links in his neighbor in his network.",
                    "label": 0
                },
                {
                    "sent": "Sorry, and therefore we can also update the content based recommendations over to him.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, having a created a user suspending activation network and waiting it's links, we can apply spreading activation techniques.",
                    "label": 0
                },
                {
                    "sent": "They know, cynical, activated are the items they find in the user's profile and we use US activation as initial activation levels.",
                    "label": 1
                },
                {
                    "sent": "The respective rating.",
                    "label": 0
                },
                {
                    "sent": "Seeing in the profile after splitting process, the items with highest activation levels have suggested to the user.",
                    "label": 1
                },
                {
                    "sent": "More precisely, we suggest a the items whose activation levels are greater than.",
                    "label": 0
                },
                {
                    "sent": "A specific threshold.",
                    "label": 0
                },
                {
                    "sent": "These items is satisfy two conditions.",
                    "label": 0
                },
                {
                    "sent": "First a, their neighbor notes in the users network are also really want for the user, and for that reason this neighbor nodes have a high activation levels.",
                    "label": 0
                },
                {
                    "sent": "After this building process and second they suggested items are strongly related to the users positive preferences and for that reason the weights of the links established between the suggested items and their neighbors have also a very high value, is very high rates.",
                    "label": 1
                },
                {
                    "sent": "Finally, they suggested items are ranked according to their respective activation levels, with the items strongest related to their positive preferences of the user.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The top of the recommendation.",
                    "label": 0
                },
                {
                    "sent": "Next I will describe some examples of content recommendations in the domain of the little TV where users where we were, say, face overload of advisor content, interactive applications.",
                    "label": 0
                },
                {
                    "sent": "We're going to assume the state of dreaming of the TV ontology described previously.",
                    "label": 0
                },
                {
                    "sent": "Remembering this figure.",
                    "label": 0
                },
                {
                    "sent": "And we consider everywhere Mary, whose preferences are depicted in the below a table according to this table that we were married a like the documentary is welcome to Tokyo and Learn about World War One and the movies.",
                    "label": 1
                },
                {
                    "sent": "Vanilla Sky and Jerry Maguire, a involving Tom Cruise starring actor regarding the negative preferences of everywhere.",
                    "label": 1
                },
                {
                    "sent": "We will assume that Mary didn't like $1,000,000 baby with Morgan Freeman as a supporting actor and the movie about martial arts game of.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Initially we select the set of instances relevant for this viewer.",
                    "label": 1
                },
                {
                    "sent": "For example, we select the instances, refer to the movies born on the 4th of July to the last Samurai be cause they are related to the preferences of the viewer by means of their common ancestors, drama movies and action movies respectively.",
                    "label": 1
                },
                {
                    "sent": "As many like a other programs about World War One in Kyoto, we select instances of the class is sharing.",
                    "label": 0
                },
                {
                    "sent": "The classes were topics in Japanese cities and finally we select for example an instance very relevant for the personalization process.",
                    "label": 0
                },
                {
                    "sent": "The instant refer to the movie Danny Dog.",
                    "label": 1
                },
                {
                    "sent": "This instance is very important because it's strongly related to the negative preferences of the users.",
                    "label": 0
                },
                {
                    "sent": "On the one hand, I need OK involves a young actor, few interesting for Mary Morgan Freeman, and it's about a topic few interesting for this viewer.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, we can see a we can see a brief state of the semantic associations infer from the TV ontology we associate.",
                    "label": 0
                },
                {
                    "sent": "For example, Jerry Maguire and Bond with the 4th of July by means of the common ancestor Tom Cruise.",
                    "label": 1
                },
                {
                    "sent": "We're going to talk in the last samurai because both programs are bound to different series in Japan.",
                    "label": 0
                },
                {
                    "sent": "An for example, Vanilla Sky and the last summer it goes.",
                    "label": 0
                },
                {
                    "sent": "Both movies recommend sister in the TV ontology refers to the action content.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, in this figure we can see the spinning activation network depicted for created for the user may.",
                    "label": 0
                },
                {
                    "sent": "Here we can see the instances of classes and properties selected during the filtering phase and the semantic associations infer from the TB ontology represented by means of Red Arrows.",
                    "label": 0
                },
                {
                    "sent": "The programs in the images profile are a depicted by means of a Gray... and the program suggested by our strategy are denoted by means of a Gray... according to what I explained before, the program suggested to marry a receive links from other programs.",
                    "label": 0
                },
                {
                    "sent": "Very interesting for this viewer.",
                    "label": 0
                },
                {
                    "sent": "For example, we suggest the movie paths of Glory because the activation level of this movie will be increased thanks to the positive weight injected.",
                    "label": 0
                },
                {
                    "sent": "Write the note.",
                    "label": 0
                },
                {
                    "sent": "Learn about World War One.",
                    "label": 0
                },
                {
                    "sent": "Similarly, we suggest born on the 4th of July or the last samurai because their respective activation levels are increased by means of the links received from other nodes.",
                    "label": 1
                },
                {
                    "sent": "Very relevant for the viewer.",
                    "label": 0
                },
                {
                    "sent": "Lastly, we this spring activation Network a also identifies TV programs that must not be suggested to Mary.",
                    "label": 0
                },
                {
                    "sent": "For example, Danny the dog is not suggested to this.",
                    "label": 0
                },
                {
                    "sent": "Beware because he's activation level is decreased thanks to the negative weights injected by the nodes.",
                    "label": 0
                },
                {
                    "sent": "Morgan Freeman and gains of death refer to negative preferences of Mary, so it's possible to prevent from suggesting to everywhere TV programs say closely related to other contents.",
                    "label": 0
                },
                {
                    "sent": "Few interesting for her.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the past.",
                    "label": 0
                },
                {
                    "sent": "OK, in order to validate our strategy, you have carry out preliminary test involving four hundreds and graduate students from our University, University of Vigo.",
                    "label": 1
                },
                {
                    "sent": "We have developed if anthology including programs extracted from the Internet Movie Database, all programming Gate and the BBC website.",
                    "label": 1
                },
                {
                    "sent": "We requested the users to rate 400 programs and they assigned a positive and negative ratings 2 four programs appealing or unappealing to them.",
                    "label": 1
                },
                {
                    "sent": "Typically we evaluated our strategy against to.",
                    "label": 0
                },
                {
                    "sent": "A protein is defined in the return in the fighting literature.",
                    "label": 0
                },
                {
                    "sent": "The first strategy was proposed by O'Sullivan at all these authors a describe an approach employing content based filtering where the similarity between the user preferences and the suggested programs is measured between by means of different Association rules.",
                    "label": 0
                },
                {
                    "sent": "More precisely, Association rule is detected between two programs.",
                    "label": 0
                },
                {
                    "sent": "When both programs appear together in many turning profiles.",
                    "label": 0
                },
                {
                    "sent": "The second thing evaluated frustrated we proposed by by Maurice ET al.",
                    "label": 0
                },
                {
                    "sent": "This author, say, propose a collaborative filtering approach and hence by means of semantics, where the neighborhood of its user is a creative.",
                    "label": 0
                },
                {
                    "sent": "Considering the ratings defined in the user's profile and the attributes of the items included in these profiles.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The preferences of our users were divided into two groups.",
                    "label": 1
                },
                {
                    "sent": "The preferences of the 40% of the users were storing the training profiles using the approach of all to measure similarity between programs to detect Association rules between programs, and more precisely, the greater the number of training profiles containing together the two compare programs.",
                    "label": 1
                },
                {
                    "sent": "The higher their similarity value.",
                    "label": 0
                },
                {
                    "sent": "The preferences of the remaining users were used to execute the three evaluated strategies.",
                    "label": 0
                },
                {
                    "sent": "Out of the initially rated 400 programs, we have selected the temperance most appealing for its user according to his ratings and the same programs most unappealing to him.",
                    "label": 0
                },
                {
                    "sent": "And we with these twenty programs, we initialize the there's a user's profiles in this profile.",
                    "label": 1
                },
                {
                    "sent": "In this process, we obtain a low overlap between the programs rated by the users.",
                    "label": 0
                },
                {
                    "sent": "And the remaining programs had a ratings where store in the so called users evaluation data and were used to measure the accuracy of the recommendations offered by by it's evaluated strategy, especially as accurate accuracy metrics.",
                    "label": 0
                },
                {
                    "sent": "We have used recall and precision Ricord was defined as the percentage of programs with positive rating in the users evaluation data that were suggested by the consider strategy and the precision of strategy where was defined.",
                    "label": 1
                },
                {
                    "sent": "As a percentage of the programs suggested by the strategy having a positive rating in the users evaluation data, finally we average the recording precision values considering the 200.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "40 test users.",
                    "label": 0
                },
                {
                    "sent": "We can see they obtain results.",
                    "label": 0
                },
                {
                    "sent": "According to this figure.",
                    "label": 0
                },
                {
                    "sent": "A our restated influence by semantic reasoning or things the leads to the greatest number of programs appealing to its user and the lowest number of programs are appealing to the users.",
                    "label": 0
                },
                {
                    "sent": "That is the greatest values of recalling precision respectively.",
                    "label": 0
                },
                {
                    "sent": "Thanks to the combination of the two recent mechanisms, spreading activation techniques and the semantic associations infer from the domain ontology.",
                    "label": 0
                },
                {
                    "sent": "According to this figure, our strategy a discovers many problems relevant for the users going unnoticed in the two other evaluated strategies.",
                    "label": 0
                },
                {
                    "sent": "The voice of our reasoning capabilities.",
                    "label": 0
                },
                {
                    "sent": "The process of a suliban head master at all a lead to lower values of recall and precision, and this lower values are strongly related to the low overlap between the programs they find in the test users.",
                    "label": 0
                },
                {
                    "sent": "Considering the experiments in the approach of a solid bang at all, they'll overlap between the programs in the considered profiles, makes difficult to detect Association rules between the compare programs, and therefore to measure similarity between.",
                    "label": 1
                },
                {
                    "sent": "The program suggested to the user and his preferences in the approach of mobasser at all this low overlap between programs make it difficult to detect the neighbors of each user and therefore to offer collaborative recommendations.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To conclude, this tool K, I'm going to present some conclusions.",
                    "label": 0
                },
                {
                    "sent": "We have presented a personalization paradigm eruditione the reducing limitations are resolved in traditional content based strategies thanks to the combination of semantic Association Santa spreading activation techniques as reasoning mechanisms.",
                    "label": 0
                },
                {
                    "sent": "More precisely, we diversify the offer recommendations, including items semantically related to the user's preferences, going beyond the traditional syntactic matching techniques.",
                    "label": 1
                },
                {
                    "sent": "At least 80 considers the positive and negative preferences of the users positive preferences.",
                    "label": 0
                },
                {
                    "sent": "Elite two programs that must be suggested to the user, while negative preferences decrease, tend to decrease the activation levels of items strongly related to them.",
                    "label": 0
                },
                {
                    "sent": "A duty that's recommendations as user preferences.",
                    "label": 0
                },
                {
                    "sent": "A bowl for change.",
                    "label": 0
                },
                {
                    "sent": "Overtime.",
                    "label": 0
                },
                {
                    "sent": "In this case, the filtering phase a selects new instances of classes and properties in first new associations from the domain Ontology and incorporates all this information in the current spreading activation network created for the user.",
                    "label": 1
                },
                {
                    "sent": "A district is flexible enough to be using multiple domains a.",
                    "label": 0
                },
                {
                    "sent": "This only depends on the domain ontology, and the strategy is not exclusively joined to a specific domain.",
                    "label": 0
                },
                {
                    "sent": "And finally, according to the experimental results of our evaluation, we obtain significant increase increases in recording position with regard to other strategies, which are the both of our reasoning.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Regarding the further work we plan to we are going.",
                    "label": 0
                },
                {
                    "sent": "We are working in a mechanism to adjust the threshold using the filtering and recommendation faces.",
                    "label": 0
                },
                {
                    "sent": "Specifically the values of distress calls will be a dynamically adjusted at the user preferences, evolve overtime and the values will depend on the domain ontology and the feedback provided by the users have their recommendations and we also plan to carry out new experiments with other state of the art strategies.",
                    "label": 0
                },
                {
                    "sent": "And symbol being the subscribers of the cable networks or for Spanish operator or with recommender systems using our strategy, is being currently diploid.",
                    "label": 1
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And with this I finish presentation.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How do you capture the preferences of?",
                    "label": 0
                },
                {
                    "sent": "In the experiment.",
                    "label": 0
                },
                {
                    "sent": "Yes, intermingle TV.",
                    "label": 0
                },
                {
                    "sent": "We can infer a notice about their user preferences from parameters such as the time elapse, it from the user selected program, suggested program by the assistant until the instant the user watch this program an from the selection of the users they're rejecting, or the attention acceptance of the recommendations offered by the user in the test, we explicitly requested the users to rate.",
                    "label": 0
                },
                {
                    "sent": "A list of TV programmes assigning positive or negative ratings, but this process can be automated, can be made automatically.",
                    "label": 0
                },
                {
                    "sent": "Any other questions?",
                    "label": 0
                },
                {
                    "sent": "2004 sorry, can you repeat the question?",
                    "label": 0
                },
                {
                    "sent": "But there's no.",
                    "label": 0
                },
                {
                    "sent": "The World Wide Web 2004 conference.",
                    "label": 0
                },
                {
                    "sent": "But those almost exactly what we're doing for semantic searching.",
                    "label": 0
                },
                {
                    "sent": "Thanks for that solution.",
                    "label": 0
                },
                {
                    "sent": "Sorry I can't understand the first one paper published in 2004 that does follows the similar uploads and the question is whether you are aware over that work published in 2004.",
                    "label": 0
                },
                {
                    "sent": "About the number of those users know about an approach to personalization.",
                    "label": 0
                },
                {
                    "sent": "And the question is.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "But the question is, are there other approaches?",
                    "label": 0
                },
                {
                    "sent": "Map of that.",
                    "label": 0
                },
                {
                    "sent": "Working with semantic reasoning and personalization.",
                    "label": 0
                },
                {
                    "sent": "Other similar to yours?",
                    "label": 0
                },
                {
                    "sent": "If are there other approaches similar to this one?",
                    "label": 0
                },
                {
                    "sent": "Activation overspeeding activation techniques or sorry OK, yes there are another work seeing literature working with spreading activation techniques, but we don't know other works in the field of personalization.",
                    "label": 0
                },
                {
                    "sent": "A yes in the field day off a certain semantic searching in the semantic web, but not in the filter personalization, and for that reason we need to adapt the spreading activation techniques.",
                    "label": 0
                },
                {
                    "sent": "For example the waiting process of the links to the personalization requirements of assistant.",
                    "label": 0
                },
                {
                    "sent": "We don't use only the strength of the relationships between the two linked nodes, but we also consider the user preferences.",
                    "label": 0
                },
                {
                    "sent": "We consider the strength of the relationship between the two lymph nodes and the user preferences in their profile in order to satisfy the personalization requirements.",
                    "label": 0
                },
                {
                    "sent": "If I understood correctly.",
                    "label": 0
                },
                {
                    "sent": "Given the user's profile, we try to find.",
                    "label": 0
                },
                {
                    "sent": "Glasses, yes.",
                    "label": 0
                },
                {
                    "sent": "Profile associations of the ontology level we search instances specific instances of classes and properties relevant for the user, and then we establish semantic associations between these selected instances.",
                    "label": 0
                },
                {
                    "sent": "Refer to items in the in the.",
                    "label": 0
                },
                {
                    "sent": "In the recommender system we only study semantic associations between, for example, TV programs.",
                    "label": 0
                },
                {
                    "sent": "In active recommender system between books in recommender systems offering personalized books for for each individual.",
                    "label": 0
                },
                {
                    "sent": "You do it on the instance.",
                    "label": 0
                },
                {
                    "sent": "Instances you haven't anthology was used with other people doing other ontology with the description, pluses or property descriptions in the target at work levels are using this method.",
                    "label": 0
                },
                {
                    "sent": "Level of specific instances only.",
                    "label": 0
                },
                {
                    "sent": "On the other level of specific instances.",
                    "label": 0
                },
                {
                    "sent": "Any other question?",
                    "label": 0
                },
                {
                    "sent": "They have a short one there.",
                    "label": 0
                },
                {
                    "sent": "What the propagation of weights is bidirectionally, yes.",
                    "label": 0
                },
                {
                    "sent": "Wait for yes no.",
                    "label": 0
                },
                {
                    "sent": "We use an average value between the relevance indexes of the tooling of the true link nodes.",
                    "label": 0
                },
                {
                    "sent": "We have to link nodes within by means.",
                    "label": 0
                },
                {
                    "sent": "So far bidirectional node and when we consider A1 node we consider the great injected by the other one and.",
                    "label": 0
                },
                {
                    "sent": "Vice versa.",
                    "label": 0
                },
                {
                    "sent": "Thanks again.",
                    "label": 0
                }
            ]
        }
    }
}