{
    "id": "p2vp7ngcqbup3f7rnsisi2gr4c5luwkj",
    "title": "Locomotion Interface for Outdoor Virtual Environments",
    "info": {
        "author": [
            "John M. Hollerbach, School of Computing, University of Utah"
        ],
        "published": "Aug. 9, 2011",
        "recorded": "June 2011",
        "category": [
            "Top->Technology"
        ]
    },
    "url": "http://videolectures.net/kolokviji_hollerbach_interface/",
    "segmentation": [
        [
            "They put down our national coloquio Kia talk.",
            "It was the chain.",
            "Purpose of the thematic E keenness their manual save known as an email.",
            "So yeah, she approached her about the camping, then struck with a questionnaire is OK. Gray is be sort of modern presenters dot Co. English name.",
            "So we have the.",
            "The.",
            "Pleasure today to host Professor John Hollerbach.",
            "John made his.",
            "This is very interesting.",
            "He graduated in chemistry.",
            "He got his BS in chemistry and Master of Science.",
            "He got in mathematics.",
            "Both by the University of Michigan.",
            "And later he killed his PhD at MIT in computer science.",
            "Covers all aspects of engineering and science almost.",
            "His first position was at MIT and then he left and went to McGill, which is in, you know, in Canada and Montreal, and then from there he went to University of Utah.",
            "A slightly sticky city which is known to School of Computing.",
            "He is so you know those who work in robotics, know that Utah.",
            "The group in Utah is the most one of the most, or maybe between the three.",
            "The most experimental groups, universities in the world.",
            "That's important for the for the robotics community.",
            "So I know I know, John, since middle of 80s and I can easily say that he's one of The Pioneers in robotics is search in general.",
            "He also collaborated with the most important people.",
            "Around in this area, for example with Michael Grady and others, and your successor of his of the general public search.",
            "So he's also and I will tell it later.",
            "So he was actually contained.",
            "Now he's very known for the community as the editor of Robotics Research, International Journal, Robotics Search, and the first editor was Michael Brady, right.",
            "The second one, and the only one.",
            "About the only ones.",
            "OK, but he was also technical editor of the IEEE of Robotics Automation.",
            "Can't robotics and automation.",
            "And you know that these two journals are far the most important journals in robotics and I take robotics such as an elite Journal.",
            "He doesn't publish so many papers and probably the impact factor is a little bit lower because of that, but it's definitely an elite Journal and.",
            "Jones is the most important person there.",
            "So he's topics are in motion of robots in general, but lately he's more involved in what we call virtual reality, teleporation, haptics, and so the main question here, which is which I created today, is he wants to create a real virtual reality.",
            "Whatever it means, but it is really, it's true, so his lecture is on locomotion and virtual environments, and so I would give the state too.",
            "Thank thank you.",
            "I don't.",
            "It's been a great pleasure to visit you and I had a great time over the weekend with your wife going to.",
            "To the ocean.",
            "Drinking wine.",
            "OK, so in recent years I've become particularly interested in haptic interfaces.",
            "And I define haptic interfaces fairly broadly.",
            "So I mean by haptic interface.",
            "Any force application to the human body by a robot.",
            "So of course usually we think of hands with haptic interfaces but it can be any energetic force exchange to new robot and human and to any part of the body.",
            "So it can be surgical robots that can be real vegetation robots and be teleoperation.",
            "And even locomotion, which is something I'm particularly interested in.",
            "And so I've been working for the past 15 years.",
            "One of my main projects on making the experience of walking as realistic as possible.",
            "And most recently, particularly in terms of walking outdoors."
        ],
        [
            "So I'll try to answer these kinds of questions.",
            "What would be an example of an ideal virtual environment?",
            "What should we try to obtain?",
            "If we had such a virtual environment, what would it be used for?",
            "Lastly, how do we go about creating it?",
            "So."
        ],
        [
            "I think we already know what an ideal virtual environment should look like.",
            "Or left handed, your brother was right handed.",
            "The alleged suicide note was written by a left handed individual such as yourself.",
            "Data.",
            "It's in his right hand, London's greatest detective.",
            "Freeze program before so.",
            "Barkley Barkley here reads something went wrong with the holiday program again, I'm sorry, I'll look into it right away.",
            "Computer in program and save.",
            "So this would be the gold standard.",
            "We could create some such a thing would be fantastic."
        ],
        [
            "So if we had such a virtual environment, what would be used for practically everything?",
            "Where we could simulate the human experience and find some value to doing that?",
            "Be used for emergency response training mission rehearsal.",
            "We can design buildings and then walk around the building virtually to make sure the layout is correct.",
            "All kinds of educational purposes histories we can pretend are ants going through colonies.",
            "Tele communication we can use the locomotion interface to remotely walk with the person.",
            "Certainly entertainment and exercise rehabilitation is something that I've been particularly looking at and will talk about at the end of my lecture.",
            "It's being used heavily in psychological research because we can manipulate virtual reality in such a way that it's not possible in the real world, so we can tease out what are the important factors in human experience, such as navigation and appreciation of metric distances.",
            "Or I even imagine like for the Star Trek that you know we all grow up and we make a lot of mistakes and you said wasn't someone tell me about this.",
            "I would have made this mistake, but probably your parents told you but no one listens to their parents.",
            "And so if we could kind of play out important life experiences, maybe we avoid some of the mistakes of."
        ],
        [
            "Hang up.",
            "So how do we go about creating it?",
            "Well, this is the big problem.",
            "We're not anywhere close to building the Star Trek holodeck, but we gotta start somewhere.",
            "And so here are the kinds of elements that you might have in a virtual environment.",
            "First of all, you have to have the actual environment you're trying to simulate.",
            "Whether you're indoors environment or an outdoors environments, there has to be some kind of script.",
            "Maybe there's some gold as actors avatars.",
            "So that's the simulation part.",
            "Then we have to have physical interface and a sensory interface to the human.",
            "So the physical interfaces you walk you touch.",
            "You manipulate sensor interfaces.",
            "All our senses should be getting the appropriate feedback based upon the experience."
        ],
        [
            "So in this talk I'm very limited in my scope, is just trying to make walking outdoors seem more natural, well focused, particularly on the mechanical aspects named the Act of walking and how to make walking realistic is harder than one might think.",
            "And then the most novel aspect is that we create a realistic atmosphere in our virtual environment.",
            "So we generate real wind.",
            "Real smell and radiant heat as well.",
            "Other things we don't do, like rain and lightning.",
            "You know we have to draw the line someplace so we don't do those."
        ],
        [
            "OK, so the general question is if you have a locomotion interface, let's say a big treadmill like we have.",
            "Why do you want multi sensory feedback for locomotion interface?",
            "There are several reasons why you want locomotion interfaces.",
            "As opposed to say, sitting in your chair in front of your computer screen moving a mouse.",
            "So you could also explore a virtual environment like we all do, probably with computer games, right?",
            "So this virtual environment and you're exploring it.",
            "There's scenarios there, actors, and you're controlling, usually with a mouse.",
            "So why isn't that good enough?",
            "There's several reasons why it's not good enough.",
            "One is realistic energy expenditure takes no energy expenditure practically to move your mouse, but you have walk or run or go up Hill.",
            "To get to a goal, it's realistic, you get tired and that may affect affect your decision making.",
            "Another more subtle point is that for reasons people don't completely understand, their severe spatial compression in appreciating distances and vision, only virtual environments.",
            "So if you're asked to move forward 10 meters, you'll get it wrong by up to 50% and no one understands why this is practically ruled.",
            "Everything out, nothing's left, and so just by looking at some virtual environment you'll.",
            "Underappreciate this distances.",
            "So the psychologists have a idea called calibration calibration in their context means that a vision is a good relative distance sensor.",
            "But unless it's up close, it's not a good absolute distance sensor, and so you need other sensors to come in to calibrate your vision, and one of the main ones is walking because you know how far you go with each step.",
            "OK, so as I move forward, the visual display goes by, so I have kind of optical flow.",
            "And so you calibrate how much you move forward with.",
            "How fast the visual display goes back and this calibration is almost instantaneous.",
            "So like if you go to the airport, these horizontal beltways as soon as you stop start step on a horizontal Beltway, immediately change the game between your foot and optical slow.",
            "The world goes by faster.",
            "OK, you re calibrate just like this immediately.",
            "Your body recalibrates.",
            "So if you at the end of the walkway if you're asked to blindfolded, move forward 10 meters.",
            "You'll get it.",
            "Wrong.",
            "OK, so this is how fast your body recalibrates.",
            "So the idea is that the reason you have to walk through virtual worlds is get otherwise you won't appreciate the geometry correctly.",
            "Finally, we want the virtual environment to seem as realistic as possible, and so in 2003 I attended a lecture by the Chief ride developer of Universal Studios, and he made the point that if you want people to suspend disbelief if you want them to feel that it's realistic, you have to provide a totality of sensory experiments.",
            "So this means that if you're outdoors in, your graphics is showing that the trees are swaying, but you don't feel any wind.",
            "It's going to seem fake to you.",
            "You're just looking at a picture you're not really there.",
            "OK, and so as much as possible, you have to have all the sensors engaged that can be, and they are mutually reinforcing.",
            "So that's our goal for the outdoors.",
            "Wind smell and radiant heat are the ones we're trying."
        ],
        [
            "OK, so let me briefly a survey that types of locomotion interface is basically you can view them as souped up exercise machines."
        ],
        [
            "One idea is kind of a 3 dimensional stair stepper device.",
            "One originally made it circles another one made by Awatere School, University of Scuba.",
            "And so the idea here is you have three degree of freedom hydraulic arms which serve as foot platforms.",
            "And so this person is connected to the platform by kind of a ski binding.",
            "Furthermore, there are four sensors on the platform, so it's kind of a difficult control problem because when when the user lifts off his foot, there should be no drag on.",
            "The foot has to feel free under your hand when you step by step through the virtual ground that has to be rigid.",
            "So those in robotics knows that this is kind of a difficult force control problem.",
            "Also, this is about the fastest person can go because of structural resonances in the arms.",
            "Make make the.",
            "System unstable, so do the weight of the person and force of stepping.",
            "You can't go too fast.",
            "OK, so this kind of system is has its uses, but it's very expensive, it's somewhat dangerous.",
            "And also you're limited in terms of how you can turn 'cause of the arms get in the way of each other."
        ],
        [
            "OK, so more useful maybe and certainly cheaper are treadmill style devices and their variety of just linear treadmills.",
            "This is the first generation tradeport I'll be talking about the second generation.",
            "A couple have been built at ATR in Kyoto by Noma one is this small treadmill Anna spherical joint.",
            "So this treadmill can act as a turntable and it can tilt sideways and tilt up.",
            "And so for turning control, the treadmill actually swivels, so by measuring the foot motion the belts going.",
            "This way you go this way.",
            "And the treadmill tilts swivels.",
            "This way you can also simulate uneven ground by having these plungers underneath the belt.",
            "They have a deformable built in tensioning system which allows you to make stair like patterns on the belt."
        ],
        [
            "They've also been two.",
            "The treadmill designs original one with an Omni directional treadmill where you have two belts.",
            "Basically you have a bottom belt here.",
            "And a top belt.",
            "So the top belt goes around.",
            "And it also has rollers.",
            "So the rollers are like this and then the bottom belt moves the rollers.",
            "So this is how you get a 2 dimensional motion.",
            "The second type is this so called Taurus treadmill.",
            "What is this is?",
            "It's a big treadmill made of little treadmills so here you can see one of the little treadmills here so they're hinged and they form a platform up here so the Taurus is this big treadmill here providing One Direction of motion and then the little treadmills go the other way so large version of this is Now the Cyber Walk system.",
            "Which is in both office laboratory at the Max Planck Institute in Tubingen.",
            "However, these are complicated and certainly in the case of the Max Planck system, extremely."
        ],
        [
            "Expensive.",
            "Our system is more humble, it's just a very big treadmill, but we've added a lot to it.",
            "So we have a large tilting linear treadmill.",
            "We have a three wall, a cavelike visual display, so each each wall has its own projector and graphics computer.",
            "We have an important aspect here is that this this mechanical tether, which has 6 degrees of freedom to measure the position and orientation of the user plus the linear act access is actuated.",
            "We can push and pull on the user.",
            "Finally, the user has to wear a harness for force coupling."
        ],
        [
            "And so I'm sorry this is English units, but just give some specifications of the treadmill.",
            "It's a fairly large belt and I think this is extremely important.",
            "I think using smaller exercise treadmills are very much worse in terms of.",
            "The experience of walking and not worrying about where you put your feet.",
            "It can.",
            "It can allow you to go about as fast as you want, or 1G belt acceleration.",
            "The tilting is pretty fast.",
            "We have to design the belt motor so that when you run you generate up to six times body weight impact on the belt.",
            "So if you have a coefficient of friction about .15 or .2, that's a lot of force that the belt motor has to overcome, so you don't want the belt to slow down very much when impact happens.",
            "Do the football and so we have a powerful motor to prevent.",
            "Very much slow down.",
            "Finally, it turns out that to simulate inertial force like I'm talking about, we have to pull with 70 pounds to the force at three Hertz.",
            "OK, so this was our design goals for a treadmill."
        ],
        [
            "And this is how it looks like in walking and mountainous terrain.",
            "So here is the tether.",
            "Again, it's measuring the user position and orientation, which is used as a basis of motion control.",
            "OK, so you see it looks like he's going uphill and also looks like.",
            "He's walking up here so you can see him leaning forward and I'm going to explain how we achieve this effect even though the treadmill is flat, so he looks like he's going uphill with treadmills flat.",
            "Today is going downhill again.",
            "The treadmill is flat OK, so how are we achieving this effects?",
            "Well, what's happening.",
            "So we're pushing and pulling with this tablet, OK?",
            "But it's very realistic, in fact, is by mechanically the same."
        ],
        [
            "OK, so let me get a little bit into the technical details of how we control the belt.",
            "So one important aspect of our system and other systems is that the belt speed is totally under the control of the user, so there's no dials to adjust or anything, so the amount by which you are forward of center as measured by the tether controls the velocity of the belt.",
            "So the further forward you are, the faster the belt goes, so it's totally user directed.",
            "You can also go backwards.",
            "Turning it's what's a linear treadmill.",
            "So how do we control?",
            "Angle well, basically we use the body as a joystick.",
            "The amount by which you turn left or right is the rate control variable.",
            "So just like any rate control system to stop turning, you have to re index the center if you want to turn the other way you have to go to the right.",
            "When you're walking fast, it's not convenient to be twisting your body, so we use as the rate control variable demand by which you're sideways on the treadmill.",
            "Works very well, and before long you don't even think about it.",
            "You just move naturally."
        ],
        [
            "OK, so while while we have built a hydraulic tilting mechanism which is pretty fast for the treadmill, there really big problems with treadmill tilt.",
            "First of all, it gets in the way the visual screens and as I will talk.",
            "The wind generation.",
            "Tilt mechanism can be slow, especially large for large treadmills.",
            "No, the top platform where he's at least a couple metric tons has to be very stiff.",
            "You can have backlash which makes the platform uneven as you're walking out, so you don't want it to bounce as you're walking on it.",
            "This could be a problem if you have too many actuators.",
            "Finally, it great greatly increases the mechanical complexity and cost.",
            "So, if possible, we'd like not to move the treadmill belt."
        ],
        [
            "Form Fortunately, we don't have to because we can substitute pulling and pushing on the user for a treadmill tilt.",
            "So here is a slope analysis.",
            "So when you're walking up slope.",
            "He was kind of a force diagram, so the users wait is MG Theta slope that you're walking on and so the amount of force you have to overcome when you're walking uphill is MG sine Theta.",
            "So this is how much This is why it's harder to walk uphill.",
            "Conversely, going downhill this force assists you, so instead."
        ],
        [
            "Tilting the treadmill we just pull on a level treadmill with MG sine Theta.",
            "OK, well it just looks nice in terms of force diagrams.",
            "Does it work, yes."
        ],
        [
            "Works very well.",
            "So we've shown that both biomechanically and energetically, that is almost indistinguishable from real slope walking.",
            "So here's a user walking on a tilted treadmill in a minute.",
            "You're going to be seeing a blue, the blue is.",
            "He's actually walking on a flat treadmill.",
            "We've just tilted up the image.",
            "And so now these images are going to coincide and you can see that the user has the same biomechanical position.",
            "OK so treadmill.",
            "Tilt can be very realistically simulated by treadmill force about horizontal force and we don't have to move to move the bed."
        ],
        [
            "That they built.",
            "So that's one important reason for being able to pull and push horizontally.",
            "Here's another reason.",
            "And the big problem with treadmills is that it's not energetically realistic.",
            "It's much easier to run on treadmills than it is on ground.",
            "Now, why is that?",
            "It's because your body is stationary with respect to the ground.",
            "Yes, your arms are pumping and your legs are pumping, but your body is stationary.",
            "You are not accelerating your body relative to ground, and so there's a newtons force missing on your body which can make running on a treadmill up to 35% easier than running on the ground.",
            "So we can fix that, so to speak, by supplying an artificial inertial force.",
            "In fact, if we don't, for reasons I'll talk about in a second, you'll fall down on our system because of the way we control the Belt belt speed."
        ],
        [
            "So the idea is that we have a common filter to estimate the acceleration of the belt set by the user position, so this is not programmed in any way, so we estimate the acceleration and feedback and artificial inertial force.",
            "So ours is really the only energetically realistic treadmill in the world that I know of.",
            "OK, so why do people fall down if we don't put this force in place?",
            "But if you think about it, if every time I move forward the belt moves back the same amount, it's very unstable.",
            "It's like someone is taking a rug.",
            "And pulled it out from underneath your feet, or some people described as walking on ice.",
            "And so.",
            "The inertial force feedback stabilizes that situation and you don't have any problems of stability that way.",
            "Why don't you see it in the exercise room?",
            "Why aren't people falling down all the time in the exercise room?",
            "It's because the belt speed is not determined by their position, it's some dial here, so there's no instability caused by."
        ],
        [
            "The final thing that we do is that we generate vertical forces by having a programmable winch on the ceiling acting on the use."
        ],
        [
            "So why do we want to do that?",
            "Variety of reasons, partial weight support through rotation.",
            "We've looked in the past walking and reduced gravity environments such as Mars.",
            "And finally, if we're doing slope display by pulling and pushing in the user for steep slopes, if you do the force diagram we generate more than the weight of the users have to pull up to get it correct force balance.",
            "And just a slightly tricky thing here.",
            "When you want to support a person's weight, you have to be careful not just to do it through leg loops, 'cause this can actually be dangerous, and it could stop the blood to your legs over the long term.",
            "It can kill you, so you just can't just support a person through leg loops.",
            "You have to also support through the rib cage."
        ],
        [
            "OK, so I'm going to spend a few minutes on harness design because it's been a very difficult issue for us.",
            "We initially started with kind of a backpack harness, so this means it's all straps.",
            "Plus all these soft straps we got all these.",
            "Tensioning systems here, so we abandoned this for reasons I'll talk about and went to a mechanism style of harness here with an added rehabilitation harness."
        ],
        [
            "So the backpack style harness is what we tried initially and it's not very good.",
            "It's poor mechanical coupling.",
            "It's compliant, the straps give it doesn't really follow the degrees of freedom of the body, so the straps slip.",
            "This poor poor fitting repeat ability and in terms of where you push in the back with a vertical horizontal tether, that point of force application is fixed, so we eventually."
        ],
        [
            "And in this and came up with the mechanism style harness.",
            "So in this harness it naturally follows the complex motion of the back, and there's practically no slipping of the straps.",
            "You can put it on a reputable Reaper repeatably.",
            "You get full mobility and we can adjust where we push on the back with the."
        ],
        [
            "Sir.",
            "So this slide is for yadron 'cause I know it's a condition.",
            "So basically we have a telescoping joint here.",
            "So the sliding joint here and up here we have the equivalent of a spherical joint.",
            "We have hip, hip and shoulder plates to apply force either to the hips or.",
            "To the shoulders in some combination determined by where we put the slider.",
            "So by moving the slider up and down we change the distribution of forces to the shoulders and hips and hopefully adjust for body lean better that way.",
            "Another important point is for repeatability.",
            "We should have a precise control of how the subjects strap on the device, and so they should always pull the straps with the same amount of force.",
            "So what we have is kind of a tensioning system.",
            "Here where we have an elastic cord and so when you have pulled this loop out then we know that you've strapped to the proper amount."
        ],
        [
            "And so we get a much improved mechanical coupling as opposed to backpack style harness.",
            "So here I'm not sure you can see it very well, but there's a lot of give here.",
            "This is kind of we call him cement man.",
            "This is a elliptical bucket full of cement meant to represent the tour so you can see here with our mechanisms to harness that we get a very good mechanical coupling.",
            "So why is this important?",
            "It's important because if we're trying to do close loop force control with the tether to apply, use horizontal forces.",
            "If you have a lot of backlash you can't do it.",
            "Your system is unstable and not able to good job.",
            "So basically eliminate backlash.",
            "You are then able to apply closed loop force control through the tether, so we get an order of magnitude improvement in stiffness by our particular harness design."
        ],
        [
            "And I'll skip this, but basically we've done studies with users trapped in to measure.",
            "How stiffly coupled the person is to the harness."
        ],
        [
            "Then finally two to make it safer for rotation and long-term vertical support.",
            "We include a rebuild Tatian harness so it has the leg loops.",
            "For one thing, so you support it through your hips which are also supported, the rib cage.",
            "So this is vest which goes around in front in the lift you on the rib cage and so this allows you to be safely supported for a long time vertically.",
            "And you can see how this this mechanism has been integrated into the reputation harness."
        ],
        [
            "OK, so now let me get to.",
            "So this is kind of background in terms of how the system operates.",
            "Now let me get to the main point of my talk, which is the atmospheric display.",
            "So what are our goals?",
            "So we're going to try to generate wind up to 20 kilometers per hour in the context of our.",
            "Existing virtual reality system."
        ],
        [
            "And Furthermore, we want to have control of the wind direction.",
            "So basically what we're trying to do is trying to build a 2D wind tunnel which has never been built before in any context.",
            "Wind tunnels usually are just One Direction, the wind goes just to run direction, but we're trying to control the angle of the wind.",
            "This has never been done before by anyone.",
            "At the same time, we want to have a realistic target for the wind, so it's not just the windows just arbitrarily appearing.",
            "So our goal is to display how wind flows through an urban landscape.",
            "So you have a wind coming in a certain direction.",
            "You have a bunch of buildings around and you get complicated flow due to the buildings.",
            "So we want to simulate.",
            "The flow and the user moving through these scenarios at the same time.",
            "So when you turn the corner and go down a different direction, the wind should change directions.",
            "That's our goal.",
            "So we're able to do that, and we're able to make it real time by using a graphics processor unit implementation for fluid dynamics."
        ],
        [
            "OK, so not very many people have tried to do atmospheric display for virtual environments or even older display and so mostly it involves having some fans close to the user.",
            "So very old one with the Sensorama, which had a whole bunch of.",
            "Types of sensory feedback, but the user kind of set in this chair.",
            "And there were some fans near his face is another one here.",
            "A kind of a wind cube here.",
            "Or they can be honest, share blowing forward on the user.",
            "And so this is.",
            "These are kind of encumbering systems, and you really can't move around with these kind of fans around.",
            "And it also wouldn't work in terms of our goals.",
            "So what we're really trying to do is to try to build a kind of a 2D wind tunnel.",
            "And usually the wind tunnels are kind of these long things and.",
            "The wind tunnel, which is closest to our design, is something we just built along time ago.",
            "With the first high speed wind tunnel design at NASA is called a variable density tunnel and then recirculating kind of wind tunnel, so that's.",
            "I think that's most close."
        ],
        [
            "Related to what we're doing.",
            "So how do we generate we end?",
            "Given that we have to use the existing system, so we have these screens in front.",
            "We can't do anything with the screens.",
            "We can't poke holes in them to let wind flow through.",
            "So if we want to create frontal wind, we can have no direct source of wind in the front.",
            "So how do we get around that?",
            "What we do is we create sheets of error along each side screen, so there's sheet of air coming along the left screen.",
            "There's a sheet of air parallel to the right screen.",
            "They meet in the front.",
            "And two counter rotating vortices are created.",
            "So we create two counter rotating vortices and a jet of air is squeezed out between them and at the user OK.",
            "So this is the approach that we're taking so the wind comes into sign like this impact the user.",
            "So this is how we generate wind display, how do we?"
        ],
        [
            "Control wind direction.",
            "What we do is we change the velocity ratio of air current coming from the left and the right.",
            "So here the velocity ratio is 1, so equal velocity of wind from the left and the right.",
            "You can see the vortices here are symmetric.",
            "And the wind is going directly at the user.",
            "If we change the velocity ratio to .76, for example, and this is in simulation.",
            "The vortices are moved around and now the user feels a wind at 45 degrees."
        ],
        [
            "So our simulations using a steady flow case and I have to emphasize this point in a minute.",
            "We can change both the speed at the user by the totality of the.",
            "Velocities from the left and right rents right vents and by changing the velocity ratio, these simulations show that we can smoothly change the wind direction.",
            "Well, that's for steady flow.",
            "It turns out that things are more difficult than that.",
            "If if you do unsteady."
        ],
        [
            "Slow.",
            "Doesn't work well after awhile so.",
            "So if you vent to the room, you may start out well if you want to go at the user, But the thing soon comes unstable, and here's to one of the side walls.",
            "So it's not that simple.",
            "So what do we have to do?",
            "It turns out that we have to make a return plenum to create a low pressure region which stabilizes the direction of wind flow this way, so we just can't discharge to the open room.",
            "We have to have a closed loop system with the return plenum, and so this indicates.",
            "That with the return plenum we're now able to get stable control of wind direction.",
            "OK, so these simulations played the role of informing our."
        ],
        [
            "Design.",
            "So how did we actually build this system?",
            "Based upon these concepts?",
            "OK, so we have a big fan to generate.",
            "The wind is blowing forward and this is looking down.",
            "And the fan and these ducks are on the floor.",
            "And so the fan blows to a Y splitter, so part of the flow goes to the left part of the flow goes to the right.",
            "There are these.",
            "Ducks.",
            "Leading to the left and the right.",
            "And then they go to Event Tower event Tower turns the flow up, then it turns it sideways and there's a nozzle here to create a sheet of air along the left and the right screen.",
            "OK, so that's how we went about it."
        ],
        [
            "And here's some design schematics.",
            "So one of the big problems was that we had a fifth.",
            "The wind tunnel in into the constraints of the room.",
            "We couldn't move anything.",
            "We couldn't move the screens.",
            "We couldn't move the treadmill there.",
            "Pillars in the way.",
            "There are pipes in the ceiling in the way so we had to get around all these room limitations.",
            "If we had more space would have simplified our life.",
            "So here's the schematic of on the left where you have lost my pointer.",
            "So here's the fan splitter is here.",
            "This decking here so you can't see the ducting below, but here goes to the right duct.",
            "There's a throttle valve here that will talk about in a minute.",
            "Here's the vent tower.",
            "That tower is the most difficult.",
            "Design aspect of this then the nozzle to create the sheet of air flowing along the right screen.",
            "Same thing on the left screen.",
            "And here's a different view of the system showing the return plenum needed to stabilize the air.",
            "We also have two to build an enclosure so have to build side walls and a ceiling as well as the floor decking."
        ],
        [
            "OK, this is what it looks like in construction first without the sidewalls and then with the sidewalls.",
            "So it shows kind of the big fan.",
            "Here's the Y splitter.",
            "Here is the right duct.",
            "There's a throttle valve here.",
            "A louver type throttle valve here.",
            "Here's the vent tower.",
            "And you can see the tread port nestled inside the structure.",
            "And this is what it looks like with the sidewalls.",
            "We have stairs leading to glass doors.",
            "To control the environment, here's the vent tower.",
            "The novel, which I'll talk about in a minute."
        ],
        [
            "So we chose a large fan to give us adequate air capacity.",
            "And the decks were constructed of plywood.",
            "It took a long time to build this.",
            "This thing basically took us one year to design and build deducting.",
            "By the way, everything was built by students."
        ],
        [
            "OK, so we have to have a throttle to choke the flow to increase or decrease the velocity and so we use louver type servovalves here.",
            "So here you can see.",
            "That the server valtierra partly open.",
            "Here there partly closed.",
            "So basically that's how we choke the flow and control the velocity coming out."
        ],
        [
            "By far the hardest part of this project was designing the vent tower.",
            "And the reason is that you have to try to avoid turbulence while changing the wind direction.",
            "And so turbulence destroys the jet at the user, so you won't have this night slow at the user.",
            "If you have turbulence.",
            "So you have to do everything possible to minimize turbulence.",
            "So what happens is that this entire takes the flow coming.",
            "In this way there are turning vanes shown here at the bottom to turn to flow up when we experiment a lot on these turning vanes to minimize the turbulence as it changes the direction.",
            "Then there have to be the upper turning vanes to turn it the other way, and again we experiment a lot to reduce turbulence.",
            "And finally, there's this large nozzle.",
            "So The thing is, large nozzle running that the whole height of the screen.",
            "So here's the nozzle design here was built out of fiberglass.",
            "And in addition, we added gratings and honeycomb to straighten the flow and to help eliminate turbulence.",
            "Here, here's how the vent tower looks like.",
            "It's in place, so lower turning vanes, the upper turning vanes, the nozzle then goes along the screen."
        ],
        [
            "And then we did had to enclose the whole space by constructing sides and ceilings."
        ],
        [
            "Now this is how the system looks after it's constructed.",
            "There's a hole in the ceiling right now for.",
            "The vertical weight support, but this is later closed off."
        ],
        [
            "OK, so how does it work?",
            "It works reasonably well.",
            "It took us a long time, but we finally got it to work.",
            "We had to make a lot of modifications, but what we've done here is we've injected theater fog.",
            "Into the system.",
            "And we use a laser sheet.",
            "At the bottom we just take a video.",
            "Of the theater flog.",
            "So this should be going.",
            "OK, here we go.",
            "So you can get some indication that you can see the theater fog going along the side screens meeting and then coming out at the user."
        ],
        [
            "And these are some graphs which shows our ability to control the wind direction.",
            "So these are for various wind directions where we are achieving.",
            "Basically wind control in a plus or minus 30 degree.",
            "Angle."
        ],
        [
            "Chris all finally were able to control wind.",
            "The nice thing about the ability to to generate and control wind is that it's easy to build an old factory display.",
            "People have worked an old factory displays in the past, but you had to wear a mask.",
            "You have to have some kind of order source close to your nose.",
            "That's not good when you're walking around in a big treadmill.",
            "Fortunately for us, since wind naturally carries smell, all we have to do is to inject smells.",
            "Into the Windstream and we do it with this.",
            "System here.",
            "So the system has here this white cylinder.",
            "Here's the order reservoir.",
            "It's basically a cotton ball.",
            "Soaked with scented oil.",
            "And that the nozzle is here.",
            "So what happens is that air comes down this blue tube here, and it creates a siphon effect where this end is the cylinder is open so it draws air through here.",
            "And out through the nozzle, so the nozzle is here.",
            "It's a high frequency solenoid to atomize the oils, so that's how we generate the smell."
        ],
        [
            "Finally, we generate heat by having an infrared radiant heater in the ceiling."
        ],
        [
            "So we've been looking at a couple of near term applications of the system.",
            "I think we're essentially done with the construction phase at the moment, so now we're looking at applications.",
            "One of them we've been looking at is emergency response training.",
            "The idea is that you have to simulate.",
            "Physically, what you need to do in an emergency scenario, rather than looking at manuals or computer screen so you have to act it out just like a flight simulator.",
            "It's required by pilots to keep their physical skills sharp.",
            "So what do you do when emergency almost never happens, but when it does happen you have to be ready to act?",
            "So the idea is that such a system as ours.",
            "We can even generate maybe smoke, smells and so on that it would allow personnel to maintain readiness for emergency responses.",
            "Another thing we've been working on is.",
            "Partial spinal cord injury.",
            "So we've been working with a private rehabilitation clinic called Neuro Works.",
            "To see if our system can help patients who have partial spinal cord injuries, this means that their spinal cords have not been completely broken.",
            "This only partial severance, and they get some walking ability back.",
            "What happens with these patients is that they often reach a plateau of walking.",
            "So they get better for awhile then they don't get better anymore.",
            "They just stay at the plateau.",
            "And so we're hoping that with a more sophisticated device.",
            "Such as ours, as as as compared to rotation, treadmills that maybe people can get over this plateau and reach a new level of walking ability.",
            "So recently very recently we tested forth for patients with spinal partial spinal cord injuries and found that they all immediately walked better on our system.",
            "So they all immediately got over the plateau with almost no training.",
            "They walked more symmetrically.",
            "They were able to exercise harder and longer.",
            "In one case, a patient ran for the first time ever.",
            "And so our hypothesis is that.",
            "The reason that patients reach plateau of rehabilitation is due to the limitations of their exercise.",
            "Treadmills, not due to neural capacity.",
            "So.",
            "I don't have the direct video video, but so I have to go to the Internet to get the video it was shown on Channel 2 News, so I don't have access to those videos.",
            "I have to go to the Internet, so here it is.",
            "So was playing on Channel 2 News in Utah and you can see it was telling you.",
            "I don't recall seeing delicate arch in Utah before it falls down.",
            "OK, so there's a Channel 2 news segment.",
            "Yep, let me try again.",
            "Just over thousands of people who suffer spinal cord injuries, not all of them end up in a wheelchair, but walking again takes time and drive.",
            "Scientists at the University of Utah are developing a way to enhance their rehabilitation, feels mostly joins us tonight and this is kind of treadmill meets high tech, right?",
            "It's early as The Walking in a computer generated environment, but take the wind we've had tonight, for example, a person with a spinal injury might be just blown over because they can't keep their balance.",
            "This experimental system can also create win.",
            "Help people train their bodies for the real world.",
            "Over the past two months, Zach Lindsey was strapped into a harness, too.",
            "Then launched on a stroll through a virtual world with giant treadmill and University of Utah.",
            "Does more than just spin.",
            "It puts a patient in charge of their own rehabilitation faster.",
            "You go faster it goes through one more resistance they can give you more resistance.",
            "Anything in less they can give you less.",
            "Lindsey has a bullet lodged in his spinal canal like Chess, My left side and just play pinball.",
            "My insights and has little feeling in his legs.",
            "Lots of surgeries and then the rehab began.",
            "So in this case I can focus more on my left side.",
            "For example, I quit turning left.",
            "I put more weight on my left side.",
            "Patients are safe.",
            "Professor John Harbaugh specializes in robotics in the School of Computing, he says local company Neural Works approached him about developing this technology.",
            "They found that after oh point of patients don't.",
            "Progress as fast or they reach a plateau as patients will talk, they have to negotiate terms and avoid buildings.",
            "Motion sensors tracked, measuring and computing ways for improvement.",
            "We're hoping that by making measurements of the angles at the same time that we can quantify progress.",
            "Is there some also creates a level of reality the patient could see buildings on the screens and they're experimenting with win.",
            "Even smells put actors into the scene like their cars.",
            "That they have to avoid, Zach Lindsey says to workout with its twists and turns is exhausting for him.",
            "And he thinks the technology has potential and they can help you start it.",
            "And this can help keep you going.",
            "Well, simply being motivated by something new and visual is the most basic attraction to this level of therapy.",
            "The first 5 patients.",
            "OK, so we were really surprised we did a pilot study.",
            "We didn't know what to expect.",
            "You know, we've just hypothesis and we were surprised in every single case.",
            "Patient got almost immediately better, and so hopefully we'll be able to pursue this more in the future.",
            "We are planning to do so."
        ],
        [
            "So just to conclude, we emphasize some of the things said sudden in this video clip.",
            "We want to come up with scenarios of increasing sophistication that will will speed their abilitation process because we want to move them into the real environment, and so it's like the specificity of training.",
            "If you want to train for something, you have to train exactly.",
            "For that you can't have a kind of different exercise which is different from the real exercise that you're trying to achieve, and so the treadmill thread port is the most realistic.",
            "Walking system which simulates real walking but in a safe setting, so we hope to create scenarios making more and more difficult.",
            "You know, actors jumping out at them like they're in a crowd.",
            "They have to adjust wind.",
            "Gust comes at them.",
            "The wind can blow people over, and so we're hoping to.",
            "To help them adjust to perturbations, which is one of the big problems in returning to the real world."
        ],
        [
            "So I've come to the end of my talk and of course is not just me.",
            "There's a number of faculty members involved in this project, as well as a few of the number of students who've helped us on this project, and it was found funded by the National Science Foundation.",
            "So thank you very much for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They put down our national coloquio Kia talk.",
                    "label": 0
                },
                {
                    "sent": "It was the chain.",
                    "label": 0
                },
                {
                    "sent": "Purpose of the thematic E keenness their manual save known as an email.",
                    "label": 0
                },
                {
                    "sent": "So yeah, she approached her about the camping, then struck with a questionnaire is OK. Gray is be sort of modern presenters dot Co. English name.",
                    "label": 0
                },
                {
                    "sent": "So we have the.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Pleasure today to host Professor John Hollerbach.",
                    "label": 0
                },
                {
                    "sent": "John made his.",
                    "label": 0
                },
                {
                    "sent": "This is very interesting.",
                    "label": 0
                },
                {
                    "sent": "He graduated in chemistry.",
                    "label": 0
                },
                {
                    "sent": "He got his BS in chemistry and Master of Science.",
                    "label": 0
                },
                {
                    "sent": "He got in mathematics.",
                    "label": 0
                },
                {
                    "sent": "Both by the University of Michigan.",
                    "label": 0
                },
                {
                    "sent": "And later he killed his PhD at MIT in computer science.",
                    "label": 0
                },
                {
                    "sent": "Covers all aspects of engineering and science almost.",
                    "label": 0
                },
                {
                    "sent": "His first position was at MIT and then he left and went to McGill, which is in, you know, in Canada and Montreal, and then from there he went to University of Utah.",
                    "label": 0
                },
                {
                    "sent": "A slightly sticky city which is known to School of Computing.",
                    "label": 1
                },
                {
                    "sent": "He is so you know those who work in robotics, know that Utah.",
                    "label": 0
                },
                {
                    "sent": "The group in Utah is the most one of the most, or maybe between the three.",
                    "label": 0
                },
                {
                    "sent": "The most experimental groups, universities in the world.",
                    "label": 0
                },
                {
                    "sent": "That's important for the for the robotics community.",
                    "label": 0
                },
                {
                    "sent": "So I know I know, John, since middle of 80s and I can easily say that he's one of The Pioneers in robotics is search in general.",
                    "label": 0
                },
                {
                    "sent": "He also collaborated with the most important people.",
                    "label": 0
                },
                {
                    "sent": "Around in this area, for example with Michael Grady and others, and your successor of his of the general public search.",
                    "label": 0
                },
                {
                    "sent": "So he's also and I will tell it later.",
                    "label": 0
                },
                {
                    "sent": "So he was actually contained.",
                    "label": 0
                },
                {
                    "sent": "Now he's very known for the community as the editor of Robotics Research, International Journal, Robotics Search, and the first editor was Michael Brady, right.",
                    "label": 0
                },
                {
                    "sent": "The second one, and the only one.",
                    "label": 0
                },
                {
                    "sent": "About the only ones.",
                    "label": 0
                },
                {
                    "sent": "OK, but he was also technical editor of the IEEE of Robotics Automation.",
                    "label": 0
                },
                {
                    "sent": "Can't robotics and automation.",
                    "label": 0
                },
                {
                    "sent": "And you know that these two journals are far the most important journals in robotics and I take robotics such as an elite Journal.",
                    "label": 0
                },
                {
                    "sent": "He doesn't publish so many papers and probably the impact factor is a little bit lower because of that, but it's definitely an elite Journal and.",
                    "label": 0
                },
                {
                    "sent": "Jones is the most important person there.",
                    "label": 0
                },
                {
                    "sent": "So he's topics are in motion of robots in general, but lately he's more involved in what we call virtual reality, teleporation, haptics, and so the main question here, which is which I created today, is he wants to create a real virtual reality.",
                    "label": 0
                },
                {
                    "sent": "Whatever it means, but it is really, it's true, so his lecture is on locomotion and virtual environments, and so I would give the state too.",
                    "label": 0
                },
                {
                    "sent": "Thank thank you.",
                    "label": 0
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "It's been a great pleasure to visit you and I had a great time over the weekend with your wife going to.",
                    "label": 0
                },
                {
                    "sent": "To the ocean.",
                    "label": 0
                },
                {
                    "sent": "Drinking wine.",
                    "label": 0
                },
                {
                    "sent": "OK, so in recent years I've become particularly interested in haptic interfaces.",
                    "label": 0
                },
                {
                    "sent": "And I define haptic interfaces fairly broadly.",
                    "label": 0
                },
                {
                    "sent": "So I mean by haptic interface.",
                    "label": 0
                },
                {
                    "sent": "Any force application to the human body by a robot.",
                    "label": 0
                },
                {
                    "sent": "So of course usually we think of hands with haptic interfaces but it can be any energetic force exchange to new robot and human and to any part of the body.",
                    "label": 0
                },
                {
                    "sent": "So it can be surgical robots that can be real vegetation robots and be teleoperation.",
                    "label": 0
                },
                {
                    "sent": "And even locomotion, which is something I'm particularly interested in.",
                    "label": 0
                },
                {
                    "sent": "And so I've been working for the past 15 years.",
                    "label": 0
                },
                {
                    "sent": "One of my main projects on making the experience of walking as realistic as possible.",
                    "label": 0
                },
                {
                    "sent": "And most recently, particularly in terms of walking outdoors.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'll try to answer these kinds of questions.",
                    "label": 0
                },
                {
                    "sent": "What would be an example of an ideal virtual environment?",
                    "label": 1
                },
                {
                    "sent": "What should we try to obtain?",
                    "label": 0
                },
                {
                    "sent": "If we had such a virtual environment, what would it be used for?",
                    "label": 1
                },
                {
                    "sent": "Lastly, how do we go about creating it?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think we already know what an ideal virtual environment should look like.",
                    "label": 1
                },
                {
                    "sent": "Or left handed, your brother was right handed.",
                    "label": 0
                },
                {
                    "sent": "The alleged suicide note was written by a left handed individual such as yourself.",
                    "label": 0
                },
                {
                    "sent": "Data.",
                    "label": 0
                },
                {
                    "sent": "It's in his right hand, London's greatest detective.",
                    "label": 0
                },
                {
                    "sent": "Freeze program before so.",
                    "label": 0
                },
                {
                    "sent": "Barkley Barkley here reads something went wrong with the holiday program again, I'm sorry, I'll look into it right away.",
                    "label": 0
                },
                {
                    "sent": "Computer in program and save.",
                    "label": 1
                },
                {
                    "sent": "So this would be the gold standard.",
                    "label": 0
                },
                {
                    "sent": "We could create some such a thing would be fantastic.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So if we had such a virtual environment, what would be used for practically everything?",
                    "label": 0
                },
                {
                    "sent": "Where we could simulate the human experience and find some value to doing that?",
                    "label": 0
                },
                {
                    "sent": "Be used for emergency response training mission rehearsal.",
                    "label": 1
                },
                {
                    "sent": "We can design buildings and then walk around the building virtually to make sure the layout is correct.",
                    "label": 0
                },
                {
                    "sent": "All kinds of educational purposes histories we can pretend are ants going through colonies.",
                    "label": 0
                },
                {
                    "sent": "Tele communication we can use the locomotion interface to remotely walk with the person.",
                    "label": 1
                },
                {
                    "sent": "Certainly entertainment and exercise rehabilitation is something that I've been particularly looking at and will talk about at the end of my lecture.",
                    "label": 0
                },
                {
                    "sent": "It's being used heavily in psychological research because we can manipulate virtual reality in such a way that it's not possible in the real world, so we can tease out what are the important factors in human experience, such as navigation and appreciation of metric distances.",
                    "label": 0
                },
                {
                    "sent": "Or I even imagine like for the Star Trek that you know we all grow up and we make a lot of mistakes and you said wasn't someone tell me about this.",
                    "label": 0
                },
                {
                    "sent": "I would have made this mistake, but probably your parents told you but no one listens to their parents.",
                    "label": 0
                },
                {
                    "sent": "And so if we could kind of play out important life experiences, maybe we avoid some of the mistakes of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hang up.",
                    "label": 0
                },
                {
                    "sent": "So how do we go about creating it?",
                    "label": 1
                },
                {
                    "sent": "Well, this is the big problem.",
                    "label": 0
                },
                {
                    "sent": "We're not anywhere close to building the Star Trek holodeck, but we gotta start somewhere.",
                    "label": 0
                },
                {
                    "sent": "And so here are the kinds of elements that you might have in a virtual environment.",
                    "label": 0
                },
                {
                    "sent": "First of all, you have to have the actual environment you're trying to simulate.",
                    "label": 0
                },
                {
                    "sent": "Whether you're indoors environment or an outdoors environments, there has to be some kind of script.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's some gold as actors avatars.",
                    "label": 0
                },
                {
                    "sent": "So that's the simulation part.",
                    "label": 0
                },
                {
                    "sent": "Then we have to have physical interface and a sensory interface to the human.",
                    "label": 0
                },
                {
                    "sent": "So the physical interfaces you walk you touch.",
                    "label": 0
                },
                {
                    "sent": "You manipulate sensor interfaces.",
                    "label": 0
                },
                {
                    "sent": "All our senses should be getting the appropriate feedback based upon the experience.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in this talk I'm very limited in my scope, is just trying to make walking outdoors seem more natural, well focused, particularly on the mechanical aspects named the Act of walking and how to make walking realistic is harder than one might think.",
                    "label": 0
                },
                {
                    "sent": "And then the most novel aspect is that we create a realistic atmosphere in our virtual environment.",
                    "label": 0
                },
                {
                    "sent": "So we generate real wind.",
                    "label": 0
                },
                {
                    "sent": "Real smell and radiant heat as well.",
                    "label": 1
                },
                {
                    "sent": "Other things we don't do, like rain and lightning.",
                    "label": 0
                },
                {
                    "sent": "You know we have to draw the line someplace so we don't do those.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so the general question is if you have a locomotion interface, let's say a big treadmill like we have.",
                    "label": 0
                },
                {
                    "sent": "Why do you want multi sensory feedback for locomotion interface?",
                    "label": 0
                },
                {
                    "sent": "There are several reasons why you want locomotion interfaces.",
                    "label": 1
                },
                {
                    "sent": "As opposed to say, sitting in your chair in front of your computer screen moving a mouse.",
                    "label": 0
                },
                {
                    "sent": "So you could also explore a virtual environment like we all do, probably with computer games, right?",
                    "label": 0
                },
                {
                    "sent": "So this virtual environment and you're exploring it.",
                    "label": 0
                },
                {
                    "sent": "There's scenarios there, actors, and you're controlling, usually with a mouse.",
                    "label": 0
                },
                {
                    "sent": "So why isn't that good enough?",
                    "label": 0
                },
                {
                    "sent": "There's several reasons why it's not good enough.",
                    "label": 0
                },
                {
                    "sent": "One is realistic energy expenditure takes no energy expenditure practically to move your mouse, but you have walk or run or go up Hill.",
                    "label": 1
                },
                {
                    "sent": "To get to a goal, it's realistic, you get tired and that may affect affect your decision making.",
                    "label": 0
                },
                {
                    "sent": "Another more subtle point is that for reasons people don't completely understand, their severe spatial compression in appreciating distances and vision, only virtual environments.",
                    "label": 1
                },
                {
                    "sent": "So if you're asked to move forward 10 meters, you'll get it wrong by up to 50% and no one understands why this is practically ruled.",
                    "label": 0
                },
                {
                    "sent": "Everything out, nothing's left, and so just by looking at some virtual environment you'll.",
                    "label": 0
                },
                {
                    "sent": "Underappreciate this distances.",
                    "label": 0
                },
                {
                    "sent": "So the psychologists have a idea called calibration calibration in their context means that a vision is a good relative distance sensor.",
                    "label": 0
                },
                {
                    "sent": "But unless it's up close, it's not a good absolute distance sensor, and so you need other sensors to come in to calibrate your vision, and one of the main ones is walking because you know how far you go with each step.",
                    "label": 0
                },
                {
                    "sent": "OK, so as I move forward, the visual display goes by, so I have kind of optical flow.",
                    "label": 0
                },
                {
                    "sent": "And so you calibrate how much you move forward with.",
                    "label": 0
                },
                {
                    "sent": "How fast the visual display goes back and this calibration is almost instantaneous.",
                    "label": 0
                },
                {
                    "sent": "So like if you go to the airport, these horizontal beltways as soon as you stop start step on a horizontal Beltway, immediately change the game between your foot and optical slow.",
                    "label": 0
                },
                {
                    "sent": "The world goes by faster.",
                    "label": 0
                },
                {
                    "sent": "OK, you re calibrate just like this immediately.",
                    "label": 0
                },
                {
                    "sent": "Your body recalibrates.",
                    "label": 0
                },
                {
                    "sent": "So if you at the end of the walkway if you're asked to blindfolded, move forward 10 meters.",
                    "label": 0
                },
                {
                    "sent": "You'll get it.",
                    "label": 0
                },
                {
                    "sent": "Wrong.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is how fast your body recalibrates.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that the reason you have to walk through virtual worlds is get otherwise you won't appreciate the geometry correctly.",
                    "label": 0
                },
                {
                    "sent": "Finally, we want the virtual environment to seem as realistic as possible, and so in 2003 I attended a lecture by the Chief ride developer of Universal Studios, and he made the point that if you want people to suspend disbelief if you want them to feel that it's realistic, you have to provide a totality of sensory experiments.",
                    "label": 0
                },
                {
                    "sent": "So this means that if you're outdoors in, your graphics is showing that the trees are swaying, but you don't feel any wind.",
                    "label": 0
                },
                {
                    "sent": "It's going to seem fake to you.",
                    "label": 0
                },
                {
                    "sent": "You're just looking at a picture you're not really there.",
                    "label": 0
                },
                {
                    "sent": "OK, and so as much as possible, you have to have all the sensors engaged that can be, and they are mutually reinforcing.",
                    "label": 0
                },
                {
                    "sent": "So that's our goal for the outdoors.",
                    "label": 0
                },
                {
                    "sent": "Wind smell and radiant heat are the ones we're trying.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let me briefly a survey that types of locomotion interface is basically you can view them as souped up exercise machines.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One idea is kind of a 3 dimensional stair stepper device.",
                    "label": 0
                },
                {
                    "sent": "One originally made it circles another one made by Awatere School, University of Scuba.",
                    "label": 0
                },
                {
                    "sent": "And so the idea here is you have three degree of freedom hydraulic arms which serve as foot platforms.",
                    "label": 1
                },
                {
                    "sent": "And so this person is connected to the platform by kind of a ski binding.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, there are four sensors on the platform, so it's kind of a difficult control problem because when when the user lifts off his foot, there should be no drag on.",
                    "label": 0
                },
                {
                    "sent": "The foot has to feel free under your hand when you step by step through the virtual ground that has to be rigid.",
                    "label": 0
                },
                {
                    "sent": "So those in robotics knows that this is kind of a difficult force control problem.",
                    "label": 0
                },
                {
                    "sent": "Also, this is about the fastest person can go because of structural resonances in the arms.",
                    "label": 0
                },
                {
                    "sent": "Make make the.",
                    "label": 0
                },
                {
                    "sent": "System unstable, so do the weight of the person and force of stepping.",
                    "label": 0
                },
                {
                    "sent": "You can't go too fast.",
                    "label": 0
                },
                {
                    "sent": "OK, so this kind of system is has its uses, but it's very expensive, it's somewhat dangerous.",
                    "label": 0
                },
                {
                    "sent": "And also you're limited in terms of how you can turn 'cause of the arms get in the way of each other.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so more useful maybe and certainly cheaper are treadmill style devices and their variety of just linear treadmills.",
                    "label": 0
                },
                {
                    "sent": "This is the first generation tradeport I'll be talking about the second generation.",
                    "label": 0
                },
                {
                    "sent": "A couple have been built at ATR in Kyoto by Noma one is this small treadmill Anna spherical joint.",
                    "label": 0
                },
                {
                    "sent": "So this treadmill can act as a turntable and it can tilt sideways and tilt up.",
                    "label": 0
                },
                {
                    "sent": "And so for turning control, the treadmill actually swivels, so by measuring the foot motion the belts going.",
                    "label": 0
                },
                {
                    "sent": "This way you go this way.",
                    "label": 0
                },
                {
                    "sent": "And the treadmill tilts swivels.",
                    "label": 0
                },
                {
                    "sent": "This way you can also simulate uneven ground by having these plungers underneath the belt.",
                    "label": 0
                },
                {
                    "sent": "They have a deformable built in tensioning system which allows you to make stair like patterns on the belt.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They've also been two.",
                    "label": 0
                },
                {
                    "sent": "The treadmill designs original one with an Omni directional treadmill where you have two belts.",
                    "label": 0
                },
                {
                    "sent": "Basically you have a bottom belt here.",
                    "label": 0
                },
                {
                    "sent": "And a top belt.",
                    "label": 0
                },
                {
                    "sent": "So the top belt goes around.",
                    "label": 0
                },
                {
                    "sent": "And it also has rollers.",
                    "label": 0
                },
                {
                    "sent": "So the rollers are like this and then the bottom belt moves the rollers.",
                    "label": 0
                },
                {
                    "sent": "So this is how you get a 2 dimensional motion.",
                    "label": 0
                },
                {
                    "sent": "The second type is this so called Taurus treadmill.",
                    "label": 0
                },
                {
                    "sent": "What is this is?",
                    "label": 0
                },
                {
                    "sent": "It's a big treadmill made of little treadmills so here you can see one of the little treadmills here so they're hinged and they form a platform up here so the Taurus is this big treadmill here providing One Direction of motion and then the little treadmills go the other way so large version of this is Now the Cyber Walk system.",
                    "label": 0
                },
                {
                    "sent": "Which is in both office laboratory at the Max Planck Institute in Tubingen.",
                    "label": 0
                },
                {
                    "sent": "However, these are complicated and certainly in the case of the Max Planck system, extremely.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Expensive.",
                    "label": 0
                },
                {
                    "sent": "Our system is more humble, it's just a very big treadmill, but we've added a lot to it.",
                    "label": 0
                },
                {
                    "sent": "So we have a large tilting linear treadmill.",
                    "label": 0
                },
                {
                    "sent": "We have a three wall, a cavelike visual display, so each each wall has its own projector and graphics computer.",
                    "label": 0
                },
                {
                    "sent": "We have an important aspect here is that this this mechanical tether, which has 6 degrees of freedom to measure the position and orientation of the user plus the linear act access is actuated.",
                    "label": 1
                },
                {
                    "sent": "We can push and pull on the user.",
                    "label": 0
                },
                {
                    "sent": "Finally, the user has to wear a harness for force coupling.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so I'm sorry this is English units, but just give some specifications of the treadmill.",
                    "label": 0
                },
                {
                    "sent": "It's a fairly large belt and I think this is extremely important.",
                    "label": 0
                },
                {
                    "sent": "I think using smaller exercise treadmills are very much worse in terms of.",
                    "label": 0
                },
                {
                    "sent": "The experience of walking and not worrying about where you put your feet.",
                    "label": 0
                },
                {
                    "sent": "It can.",
                    "label": 0
                },
                {
                    "sent": "It can allow you to go about as fast as you want, or 1G belt acceleration.",
                    "label": 1
                },
                {
                    "sent": "The tilting is pretty fast.",
                    "label": 0
                },
                {
                    "sent": "We have to design the belt motor so that when you run you generate up to six times body weight impact on the belt.",
                    "label": 0
                },
                {
                    "sent": "So if you have a coefficient of friction about .15 or .2, that's a lot of force that the belt motor has to overcome, so you don't want the belt to slow down very much when impact happens.",
                    "label": 0
                },
                {
                    "sent": "Do the football and so we have a powerful motor to prevent.",
                    "label": 0
                },
                {
                    "sent": "Very much slow down.",
                    "label": 1
                },
                {
                    "sent": "Finally, it turns out that to simulate inertial force like I'm talking about, we have to pull with 70 pounds to the force at three Hertz.",
                    "label": 0
                },
                {
                    "sent": "OK, so this was our design goals for a treadmill.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is how it looks like in walking and mountainous terrain.",
                    "label": 0
                },
                {
                    "sent": "So here is the tether.",
                    "label": 0
                },
                {
                    "sent": "Again, it's measuring the user position and orientation, which is used as a basis of motion control.",
                    "label": 0
                },
                {
                    "sent": "OK, so you see it looks like he's going uphill and also looks like.",
                    "label": 0
                },
                {
                    "sent": "He's walking up here so you can see him leaning forward and I'm going to explain how we achieve this effect even though the treadmill is flat, so he looks like he's going uphill with treadmills flat.",
                    "label": 0
                },
                {
                    "sent": "Today is going downhill again.",
                    "label": 0
                },
                {
                    "sent": "The treadmill is flat OK, so how are we achieving this effects?",
                    "label": 0
                },
                {
                    "sent": "Well, what's happening.",
                    "label": 0
                },
                {
                    "sent": "So we're pushing and pulling with this tablet, OK?",
                    "label": 0
                },
                {
                    "sent": "But it's very realistic, in fact, is by mechanically the same.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so let me get a little bit into the technical details of how we control the belt.",
                    "label": 0
                },
                {
                    "sent": "So one important aspect of our system and other systems is that the belt speed is totally under the control of the user, so there's no dials to adjust or anything, so the amount by which you are forward of center as measured by the tether controls the velocity of the belt.",
                    "label": 1
                },
                {
                    "sent": "So the further forward you are, the faster the belt goes, so it's totally user directed.",
                    "label": 0
                },
                {
                    "sent": "You can also go backwards.",
                    "label": 0
                },
                {
                    "sent": "Turning it's what's a linear treadmill.",
                    "label": 0
                },
                {
                    "sent": "So how do we control?",
                    "label": 0
                },
                {
                    "sent": "Angle well, basically we use the body as a joystick.",
                    "label": 0
                },
                {
                    "sent": "The amount by which you turn left or right is the rate control variable.",
                    "label": 1
                },
                {
                    "sent": "So just like any rate control system to stop turning, you have to re index the center if you want to turn the other way you have to go to the right.",
                    "label": 0
                },
                {
                    "sent": "When you're walking fast, it's not convenient to be twisting your body, so we use as the rate control variable demand by which you're sideways on the treadmill.",
                    "label": 0
                },
                {
                    "sent": "Works very well, and before long you don't even think about it.",
                    "label": 0
                },
                {
                    "sent": "You just move naturally.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so while while we have built a hydraulic tilting mechanism which is pretty fast for the treadmill, there really big problems with treadmill tilt.",
                    "label": 0
                },
                {
                    "sent": "First of all, it gets in the way the visual screens and as I will talk.",
                    "label": 0
                },
                {
                    "sent": "The wind generation.",
                    "label": 0
                },
                {
                    "sent": "Tilt mechanism can be slow, especially large for large treadmills.",
                    "label": 1
                },
                {
                    "sent": "No, the top platform where he's at least a couple metric tons has to be very stiff.",
                    "label": 0
                },
                {
                    "sent": "You can have backlash which makes the platform uneven as you're walking out, so you don't want it to bounce as you're walking on it.",
                    "label": 0
                },
                {
                    "sent": "This could be a problem if you have too many actuators.",
                    "label": 0
                },
                {
                    "sent": "Finally, it great greatly increases the mechanical complexity and cost.",
                    "label": 0
                },
                {
                    "sent": "So, if possible, we'd like not to move the treadmill belt.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Form Fortunately, we don't have to because we can substitute pulling and pushing on the user for a treadmill tilt.",
                    "label": 0
                },
                {
                    "sent": "So here is a slope analysis.",
                    "label": 0
                },
                {
                    "sent": "So when you're walking up slope.",
                    "label": 0
                },
                {
                    "sent": "He was kind of a force diagram, so the users wait is MG Theta slope that you're walking on and so the amount of force you have to overcome when you're walking uphill is MG sine Theta.",
                    "label": 0
                },
                {
                    "sent": "So this is how much This is why it's harder to walk uphill.",
                    "label": 0
                },
                {
                    "sent": "Conversely, going downhill this force assists you, so instead.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tilting the treadmill we just pull on a level treadmill with MG sine Theta.",
                    "label": 0
                },
                {
                    "sent": "OK, well it just looks nice in terms of force diagrams.",
                    "label": 0
                },
                {
                    "sent": "Does it work, yes.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Works very well.",
                    "label": 0
                },
                {
                    "sent": "So we've shown that both biomechanically and energetically, that is almost indistinguishable from real slope walking.",
                    "label": 0
                },
                {
                    "sent": "So here's a user walking on a tilted treadmill in a minute.",
                    "label": 0
                },
                {
                    "sent": "You're going to be seeing a blue, the blue is.",
                    "label": 0
                },
                {
                    "sent": "He's actually walking on a flat treadmill.",
                    "label": 0
                },
                {
                    "sent": "We've just tilted up the image.",
                    "label": 0
                },
                {
                    "sent": "And so now these images are going to coincide and you can see that the user has the same biomechanical position.",
                    "label": 0
                },
                {
                    "sent": "OK so treadmill.",
                    "label": 0
                },
                {
                    "sent": "Tilt can be very realistically simulated by treadmill force about horizontal force and we don't have to move to move the bed.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That they built.",
                    "label": 0
                },
                {
                    "sent": "So that's one important reason for being able to pull and push horizontally.",
                    "label": 0
                },
                {
                    "sent": "Here's another reason.",
                    "label": 0
                },
                {
                    "sent": "And the big problem with treadmills is that it's not energetically realistic.",
                    "label": 0
                },
                {
                    "sent": "It's much easier to run on treadmills than it is on ground.",
                    "label": 0
                },
                {
                    "sent": "Now, why is that?",
                    "label": 0
                },
                {
                    "sent": "It's because your body is stationary with respect to the ground.",
                    "label": 1
                },
                {
                    "sent": "Yes, your arms are pumping and your legs are pumping, but your body is stationary.",
                    "label": 1
                },
                {
                    "sent": "You are not accelerating your body relative to ground, and so there's a newtons force missing on your body which can make running on a treadmill up to 35% easier than running on the ground.",
                    "label": 0
                },
                {
                    "sent": "So we can fix that, so to speak, by supplying an artificial inertial force.",
                    "label": 0
                },
                {
                    "sent": "In fact, if we don't, for reasons I'll talk about in a second, you'll fall down on our system because of the way we control the Belt belt speed.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the idea is that we have a common filter to estimate the acceleration of the belt set by the user position, so this is not programmed in any way, so we estimate the acceleration and feedback and artificial inertial force.",
                    "label": 0
                },
                {
                    "sent": "So ours is really the only energetically realistic treadmill in the world that I know of.",
                    "label": 0
                },
                {
                    "sent": "OK, so why do people fall down if we don't put this force in place?",
                    "label": 0
                },
                {
                    "sent": "But if you think about it, if every time I move forward the belt moves back the same amount, it's very unstable.",
                    "label": 0
                },
                {
                    "sent": "It's like someone is taking a rug.",
                    "label": 0
                },
                {
                    "sent": "And pulled it out from underneath your feet, or some people described as walking on ice.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "The inertial force feedback stabilizes that situation and you don't have any problems of stability that way.",
                    "label": 1
                },
                {
                    "sent": "Why don't you see it in the exercise room?",
                    "label": 0
                },
                {
                    "sent": "Why aren't people falling down all the time in the exercise room?",
                    "label": 0
                },
                {
                    "sent": "It's because the belt speed is not determined by their position, it's some dial here, so there's no instability caused by.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The final thing that we do is that we generate vertical forces by having a programmable winch on the ceiling acting on the use.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why do we want to do that?",
                    "label": 0
                },
                {
                    "sent": "Variety of reasons, partial weight support through rotation.",
                    "label": 1
                },
                {
                    "sent": "We've looked in the past walking and reduced gravity environments such as Mars.",
                    "label": 1
                },
                {
                    "sent": "And finally, if we're doing slope display by pulling and pushing in the user for steep slopes, if you do the force diagram we generate more than the weight of the users have to pull up to get it correct force balance.",
                    "label": 0
                },
                {
                    "sent": "And just a slightly tricky thing here.",
                    "label": 0
                },
                {
                    "sent": "When you want to support a person's weight, you have to be careful not just to do it through leg loops, 'cause this can actually be dangerous, and it could stop the blood to your legs over the long term.",
                    "label": 1
                },
                {
                    "sent": "It can kill you, so you just can't just support a person through leg loops.",
                    "label": 0
                },
                {
                    "sent": "You have to also support through the rib cage.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so I'm going to spend a few minutes on harness design because it's been a very difficult issue for us.",
                    "label": 1
                },
                {
                    "sent": "We initially started with kind of a backpack harness, so this means it's all straps.",
                    "label": 0
                },
                {
                    "sent": "Plus all these soft straps we got all these.",
                    "label": 1
                },
                {
                    "sent": "Tensioning systems here, so we abandoned this for reasons I'll talk about and went to a mechanism style of harness here with an added rehabilitation harness.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the backpack style harness is what we tried initially and it's not very good.",
                    "label": 0
                },
                {
                    "sent": "It's poor mechanical coupling.",
                    "label": 0
                },
                {
                    "sent": "It's compliant, the straps give it doesn't really follow the degrees of freedom of the body, so the straps slip.",
                    "label": 0
                },
                {
                    "sent": "This poor poor fitting repeat ability and in terms of where you push in the back with a vertical horizontal tether, that point of force application is fixed, so we eventually.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in this and came up with the mechanism style harness.",
                    "label": 0
                },
                {
                    "sent": "So in this harness it naturally follows the complex motion of the back, and there's practically no slipping of the straps.",
                    "label": 0
                },
                {
                    "sent": "You can put it on a reputable Reaper repeatably.",
                    "label": 0
                },
                {
                    "sent": "You get full mobility and we can adjust where we push on the back with the.",
                    "label": 1
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sir.",
                    "label": 0
                },
                {
                    "sent": "So this slide is for yadron 'cause I know it's a condition.",
                    "label": 1
                },
                {
                    "sent": "So basically we have a telescoping joint here.",
                    "label": 0
                },
                {
                    "sent": "So the sliding joint here and up here we have the equivalent of a spherical joint.",
                    "label": 1
                },
                {
                    "sent": "We have hip, hip and shoulder plates to apply force either to the hips or.",
                    "label": 0
                },
                {
                    "sent": "To the shoulders in some combination determined by where we put the slider.",
                    "label": 0
                },
                {
                    "sent": "So by moving the slider up and down we change the distribution of forces to the shoulders and hips and hopefully adjust for body lean better that way.",
                    "label": 0
                },
                {
                    "sent": "Another important point is for repeatability.",
                    "label": 0
                },
                {
                    "sent": "We should have a precise control of how the subjects strap on the device, and so they should always pull the straps with the same amount of force.",
                    "label": 0
                },
                {
                    "sent": "So what we have is kind of a tensioning system.",
                    "label": 0
                },
                {
                    "sent": "Here where we have an elastic cord and so when you have pulled this loop out then we know that you've strapped to the proper amount.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so we get a much improved mechanical coupling as opposed to backpack style harness.",
                    "label": 0
                },
                {
                    "sent": "So here I'm not sure you can see it very well, but there's a lot of give here.",
                    "label": 0
                },
                {
                    "sent": "This is kind of we call him cement man.",
                    "label": 0
                },
                {
                    "sent": "This is a elliptical bucket full of cement meant to represent the tour so you can see here with our mechanisms to harness that we get a very good mechanical coupling.",
                    "label": 0
                },
                {
                    "sent": "So why is this important?",
                    "label": 0
                },
                {
                    "sent": "It's important because if we're trying to do close loop force control with the tether to apply, use horizontal forces.",
                    "label": 0
                },
                {
                    "sent": "If you have a lot of backlash you can't do it.",
                    "label": 0
                },
                {
                    "sent": "Your system is unstable and not able to good job.",
                    "label": 0
                },
                {
                    "sent": "So basically eliminate backlash.",
                    "label": 0
                },
                {
                    "sent": "You are then able to apply closed loop force control through the tether, so we get an order of magnitude improvement in stiffness by our particular harness design.",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll skip this, but basically we've done studies with users trapped in to measure.",
                    "label": 0
                },
                {
                    "sent": "How stiffly coupled the person is to the harness.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then finally two to make it safer for rotation and long-term vertical support.",
                    "label": 0
                },
                {
                    "sent": "We include a rebuild Tatian harness so it has the leg loops.",
                    "label": 0
                },
                {
                    "sent": "For one thing, so you support it through your hips which are also supported, the rib cage.",
                    "label": 0
                },
                {
                    "sent": "So this is vest which goes around in front in the lift you on the rib cage and so this allows you to be safely supported for a long time vertically.",
                    "label": 0
                },
                {
                    "sent": "And you can see how this this mechanism has been integrated into the reputation harness.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now let me get to.",
                    "label": 0
                },
                {
                    "sent": "So this is kind of background in terms of how the system operates.",
                    "label": 0
                },
                {
                    "sent": "Now let me get to the main point of my talk, which is the atmospheric display.",
                    "label": 1
                },
                {
                    "sent": "So what are our goals?",
                    "label": 0
                },
                {
                    "sent": "So we're going to try to generate wind up to 20 kilometers per hour in the context of our.",
                    "label": 1
                },
                {
                    "sent": "Existing virtual reality system.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And Furthermore, we want to have control of the wind direction.",
                    "label": 0
                },
                {
                    "sent": "So basically what we're trying to do is trying to build a 2D wind tunnel which has never been built before in any context.",
                    "label": 0
                },
                {
                    "sent": "Wind tunnels usually are just One Direction, the wind goes just to run direction, but we're trying to control the angle of the wind.",
                    "label": 0
                },
                {
                    "sent": "This has never been done before by anyone.",
                    "label": 0
                },
                {
                    "sent": "At the same time, we want to have a realistic target for the wind, so it's not just the windows just arbitrarily appearing.",
                    "label": 0
                },
                {
                    "sent": "So our goal is to display how wind flows through an urban landscape.",
                    "label": 0
                },
                {
                    "sent": "So you have a wind coming in a certain direction.",
                    "label": 0
                },
                {
                    "sent": "You have a bunch of buildings around and you get complicated flow due to the buildings.",
                    "label": 1
                },
                {
                    "sent": "So we want to simulate.",
                    "label": 0
                },
                {
                    "sent": "The flow and the user moving through these scenarios at the same time.",
                    "label": 0
                },
                {
                    "sent": "So when you turn the corner and go down a different direction, the wind should change directions.",
                    "label": 0
                },
                {
                    "sent": "That's our goal.",
                    "label": 1
                },
                {
                    "sent": "So we're able to do that, and we're able to make it real time by using a graphics processor unit implementation for fluid dynamics.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so not very many people have tried to do atmospheric display for virtual environments or even older display and so mostly it involves having some fans close to the user.",
                    "label": 0
                },
                {
                    "sent": "So very old one with the Sensorama, which had a whole bunch of.",
                    "label": 0
                },
                {
                    "sent": "Types of sensory feedback, but the user kind of set in this chair.",
                    "label": 0
                },
                {
                    "sent": "And there were some fans near his face is another one here.",
                    "label": 0
                },
                {
                    "sent": "A kind of a wind cube here.",
                    "label": 0
                },
                {
                    "sent": "Or they can be honest, share blowing forward on the user.",
                    "label": 0
                },
                {
                    "sent": "And so this is.",
                    "label": 0
                },
                {
                    "sent": "These are kind of encumbering systems, and you really can't move around with these kind of fans around.",
                    "label": 0
                },
                {
                    "sent": "And it also wouldn't work in terms of our goals.",
                    "label": 0
                },
                {
                    "sent": "So what we're really trying to do is to try to build a kind of a 2D wind tunnel.",
                    "label": 0
                },
                {
                    "sent": "And usually the wind tunnels are kind of these long things and.",
                    "label": 0
                },
                {
                    "sent": "The wind tunnel, which is closest to our design, is something we just built along time ago.",
                    "label": 0
                },
                {
                    "sent": "With the first high speed wind tunnel design at NASA is called a variable density tunnel and then recirculating kind of wind tunnel, so that's.",
                    "label": 1
                },
                {
                    "sent": "I think that's most close.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Related to what we're doing.",
                    "label": 0
                },
                {
                    "sent": "So how do we generate we end?",
                    "label": 0
                },
                {
                    "sent": "Given that we have to use the existing system, so we have these screens in front.",
                    "label": 0
                },
                {
                    "sent": "We can't do anything with the screens.",
                    "label": 1
                },
                {
                    "sent": "We can't poke holes in them to let wind flow through.",
                    "label": 0
                },
                {
                    "sent": "So if we want to create frontal wind, we can have no direct source of wind in the front.",
                    "label": 0
                },
                {
                    "sent": "So how do we get around that?",
                    "label": 0
                },
                {
                    "sent": "What we do is we create sheets of error along each side screen, so there's sheet of air coming along the left screen.",
                    "label": 0
                },
                {
                    "sent": "There's a sheet of air parallel to the right screen.",
                    "label": 0
                },
                {
                    "sent": "They meet in the front.",
                    "label": 1
                },
                {
                    "sent": "And two counter rotating vortices are created.",
                    "label": 0
                },
                {
                    "sent": "So we create two counter rotating vortices and a jet of air is squeezed out between them and at the user OK.",
                    "label": 0
                },
                {
                    "sent": "So this is the approach that we're taking so the wind comes into sign like this impact the user.",
                    "label": 1
                },
                {
                    "sent": "So this is how we generate wind display, how do we?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Control wind direction.",
                    "label": 0
                },
                {
                    "sent": "What we do is we change the velocity ratio of air current coming from the left and the right.",
                    "label": 1
                },
                {
                    "sent": "So here the velocity ratio is 1, so equal velocity of wind from the left and the right.",
                    "label": 1
                },
                {
                    "sent": "You can see the vortices here are symmetric.",
                    "label": 0
                },
                {
                    "sent": "And the wind is going directly at the user.",
                    "label": 0
                },
                {
                    "sent": "If we change the velocity ratio to .76, for example, and this is in simulation.",
                    "label": 1
                },
                {
                    "sent": "The vortices are moved around and now the user feels a wind at 45 degrees.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our simulations using a steady flow case and I have to emphasize this point in a minute.",
                    "label": 0
                },
                {
                    "sent": "We can change both the speed at the user by the totality of the.",
                    "label": 1
                },
                {
                    "sent": "Velocities from the left and right rents right vents and by changing the velocity ratio, these simulations show that we can smoothly change the wind direction.",
                    "label": 1
                },
                {
                    "sent": "Well, that's for steady flow.",
                    "label": 0
                },
                {
                    "sent": "It turns out that things are more difficult than that.",
                    "label": 0
                },
                {
                    "sent": "If if you do unsteady.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Slow.",
                    "label": 0
                },
                {
                    "sent": "Doesn't work well after awhile so.",
                    "label": 0
                },
                {
                    "sent": "So if you vent to the room, you may start out well if you want to go at the user, But the thing soon comes unstable, and here's to one of the side walls.",
                    "label": 0
                },
                {
                    "sent": "So it's not that simple.",
                    "label": 0
                },
                {
                    "sent": "So what do we have to do?",
                    "label": 0
                },
                {
                    "sent": "It turns out that we have to make a return plenum to create a low pressure region which stabilizes the direction of wind flow this way, so we just can't discharge to the open room.",
                    "label": 1
                },
                {
                    "sent": "We have to have a closed loop system with the return plenum, and so this indicates.",
                    "label": 1
                },
                {
                    "sent": "That with the return plenum we're now able to get stable control of wind direction.",
                    "label": 0
                },
                {
                    "sent": "OK, so these simulations played the role of informing our.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Design.",
                    "label": 0
                },
                {
                    "sent": "So how did we actually build this system?",
                    "label": 0
                },
                {
                    "sent": "Based upon these concepts?",
                    "label": 0
                },
                {
                    "sent": "OK, so we have a big fan to generate.",
                    "label": 0
                },
                {
                    "sent": "The wind is blowing forward and this is looking down.",
                    "label": 0
                },
                {
                    "sent": "And the fan and these ducks are on the floor.",
                    "label": 0
                },
                {
                    "sent": "And so the fan blows to a Y splitter, so part of the flow goes to the left part of the flow goes to the right.",
                    "label": 0
                },
                {
                    "sent": "There are these.",
                    "label": 0
                },
                {
                    "sent": "Ducks.",
                    "label": 0
                },
                {
                    "sent": "Leading to the left and the right.",
                    "label": 0
                },
                {
                    "sent": "And then they go to Event Tower event Tower turns the flow up, then it turns it sideways and there's a nozzle here to create a sheet of air along the left and the right screen.",
                    "label": 1
                },
                {
                    "sent": "OK, so that's how we went about it.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's some design schematics.",
                    "label": 0
                },
                {
                    "sent": "So one of the big problems was that we had a fifth.",
                    "label": 0
                },
                {
                    "sent": "The wind tunnel in into the constraints of the room.",
                    "label": 0
                },
                {
                    "sent": "We couldn't move anything.",
                    "label": 0
                },
                {
                    "sent": "We couldn't move the screens.",
                    "label": 0
                },
                {
                    "sent": "We couldn't move the treadmill there.",
                    "label": 0
                },
                {
                    "sent": "Pillars in the way.",
                    "label": 0
                },
                {
                    "sent": "There are pipes in the ceiling in the way so we had to get around all these room limitations.",
                    "label": 0
                },
                {
                    "sent": "If we had more space would have simplified our life.",
                    "label": 0
                },
                {
                    "sent": "So here's the schematic of on the left where you have lost my pointer.",
                    "label": 0
                },
                {
                    "sent": "So here's the fan splitter is here.",
                    "label": 0
                },
                {
                    "sent": "This decking here so you can't see the ducting below, but here goes to the right duct.",
                    "label": 0
                },
                {
                    "sent": "There's a throttle valve here that will talk about in a minute.",
                    "label": 0
                },
                {
                    "sent": "Here's the vent tower.",
                    "label": 0
                },
                {
                    "sent": "That tower is the most difficult.",
                    "label": 0
                },
                {
                    "sent": "Design aspect of this then the nozzle to create the sheet of air flowing along the right screen.",
                    "label": 0
                },
                {
                    "sent": "Same thing on the left screen.",
                    "label": 0
                },
                {
                    "sent": "And here's a different view of the system showing the return plenum needed to stabilize the air.",
                    "label": 1
                },
                {
                    "sent": "We also have two to build an enclosure so have to build side walls and a ceiling as well as the floor decking.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this is what it looks like in construction first without the sidewalls and then with the sidewalls.",
                    "label": 0
                },
                {
                    "sent": "So it shows kind of the big fan.",
                    "label": 0
                },
                {
                    "sent": "Here's the Y splitter.",
                    "label": 0
                },
                {
                    "sent": "Here is the right duct.",
                    "label": 0
                },
                {
                    "sent": "There's a throttle valve here.",
                    "label": 0
                },
                {
                    "sent": "A louver type throttle valve here.",
                    "label": 0
                },
                {
                    "sent": "Here's the vent tower.",
                    "label": 0
                },
                {
                    "sent": "And you can see the tread port nestled inside the structure.",
                    "label": 0
                },
                {
                    "sent": "And this is what it looks like with the sidewalls.",
                    "label": 0
                },
                {
                    "sent": "We have stairs leading to glass doors.",
                    "label": 0
                },
                {
                    "sent": "To control the environment, here's the vent tower.",
                    "label": 0
                },
                {
                    "sent": "The novel, which I'll talk about in a minute.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we chose a large fan to give us adequate air capacity.",
                    "label": 0
                },
                {
                    "sent": "And the decks were constructed of plywood.",
                    "label": 0
                },
                {
                    "sent": "It took a long time to build this.",
                    "label": 0
                },
                {
                    "sent": "This thing basically took us one year to design and build deducting.",
                    "label": 0
                },
                {
                    "sent": "By the way, everything was built by students.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so we have to have a throttle to choke the flow to increase or decrease the velocity and so we use louver type servovalves here.",
                    "label": 0
                },
                {
                    "sent": "So here you can see.",
                    "label": 0
                },
                {
                    "sent": "That the server valtierra partly open.",
                    "label": 0
                },
                {
                    "sent": "Here there partly closed.",
                    "label": 0
                },
                {
                    "sent": "So basically that's how we choke the flow and control the velocity coming out.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "By far the hardest part of this project was designing the vent tower.",
                    "label": 0
                },
                {
                    "sent": "And the reason is that you have to try to avoid turbulence while changing the wind direction.",
                    "label": 0
                },
                {
                    "sent": "And so turbulence destroys the jet at the user, so you won't have this night slow at the user.",
                    "label": 0
                },
                {
                    "sent": "If you have turbulence.",
                    "label": 0
                },
                {
                    "sent": "So you have to do everything possible to minimize turbulence.",
                    "label": 0
                },
                {
                    "sent": "So what happens is that this entire takes the flow coming.",
                    "label": 0
                },
                {
                    "sent": "In this way there are turning vanes shown here at the bottom to turn to flow up when we experiment a lot on these turning vanes to minimize the turbulence as it changes the direction.",
                    "label": 0
                },
                {
                    "sent": "Then there have to be the upper turning vanes to turn it the other way, and again we experiment a lot to reduce turbulence.",
                    "label": 0
                },
                {
                    "sent": "And finally, there's this large nozzle.",
                    "label": 0
                },
                {
                    "sent": "So The thing is, large nozzle running that the whole height of the screen.",
                    "label": 0
                },
                {
                    "sent": "So here's the nozzle design here was built out of fiberglass.",
                    "label": 0
                },
                {
                    "sent": "And in addition, we added gratings and honeycomb to straighten the flow and to help eliminate turbulence.",
                    "label": 0
                },
                {
                    "sent": "Here, here's how the vent tower looks like.",
                    "label": 0
                },
                {
                    "sent": "It's in place, so lower turning vanes, the upper turning vanes, the nozzle then goes along the screen.",
                    "label": 1
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we did had to enclose the whole space by constructing sides and ceilings.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now this is how the system looks after it's constructed.",
                    "label": 0
                },
                {
                    "sent": "There's a hole in the ceiling right now for.",
                    "label": 0
                },
                {
                    "sent": "The vertical weight support, but this is later closed off.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so how does it work?",
                    "label": 0
                },
                {
                    "sent": "It works reasonably well.",
                    "label": 0
                },
                {
                    "sent": "It took us a long time, but we finally got it to work.",
                    "label": 0
                },
                {
                    "sent": "We had to make a lot of modifications, but what we've done here is we've injected theater fog.",
                    "label": 0
                },
                {
                    "sent": "Into the system.",
                    "label": 0
                },
                {
                    "sent": "And we use a laser sheet.",
                    "label": 1
                },
                {
                    "sent": "At the bottom we just take a video.",
                    "label": 0
                },
                {
                    "sent": "Of the theater flog.",
                    "label": 0
                },
                {
                    "sent": "So this should be going.",
                    "label": 0
                },
                {
                    "sent": "OK, here we go.",
                    "label": 1
                },
                {
                    "sent": "So you can get some indication that you can see the theater fog going along the side screens meeting and then coming out at the user.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these are some graphs which shows our ability to control the wind direction.",
                    "label": 0
                },
                {
                    "sent": "So these are for various wind directions where we are achieving.",
                    "label": 0
                },
                {
                    "sent": "Basically wind control in a plus or minus 30 degree.",
                    "label": 0
                },
                {
                    "sent": "Angle.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Chris all finally were able to control wind.",
                    "label": 0
                },
                {
                    "sent": "The nice thing about the ability to to generate and control wind is that it's easy to build an old factory display.",
                    "label": 0
                },
                {
                    "sent": "People have worked an old factory displays in the past, but you had to wear a mask.",
                    "label": 0
                },
                {
                    "sent": "You have to have some kind of order source close to your nose.",
                    "label": 0
                },
                {
                    "sent": "That's not good when you're walking around in a big treadmill.",
                    "label": 0
                },
                {
                    "sent": "Fortunately for us, since wind naturally carries smell, all we have to do is to inject smells.",
                    "label": 0
                },
                {
                    "sent": "Into the Windstream and we do it with this.",
                    "label": 0
                },
                {
                    "sent": "System here.",
                    "label": 0
                },
                {
                    "sent": "So the system has here this white cylinder.",
                    "label": 1
                },
                {
                    "sent": "Here's the order reservoir.",
                    "label": 0
                },
                {
                    "sent": "It's basically a cotton ball.",
                    "label": 1
                },
                {
                    "sent": "Soaked with scented oil.",
                    "label": 1
                },
                {
                    "sent": "And that the nozzle is here.",
                    "label": 0
                },
                {
                    "sent": "So what happens is that air comes down this blue tube here, and it creates a siphon effect where this end is the cylinder is open so it draws air through here.",
                    "label": 1
                },
                {
                    "sent": "And out through the nozzle, so the nozzle is here.",
                    "label": 0
                },
                {
                    "sent": "It's a high frequency solenoid to atomize the oils, so that's how we generate the smell.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Finally, we generate heat by having an infrared radiant heater in the ceiling.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we've been looking at a couple of near term applications of the system.",
                    "label": 0
                },
                {
                    "sent": "I think we're essentially done with the construction phase at the moment, so now we're looking at applications.",
                    "label": 0
                },
                {
                    "sent": "One of them we've been looking at is emergency response training.",
                    "label": 1
                },
                {
                    "sent": "The idea is that you have to simulate.",
                    "label": 0
                },
                {
                    "sent": "Physically, what you need to do in an emergency scenario, rather than looking at manuals or computer screen so you have to act it out just like a flight simulator.",
                    "label": 1
                },
                {
                    "sent": "It's required by pilots to keep their physical skills sharp.",
                    "label": 0
                },
                {
                    "sent": "So what do you do when emergency almost never happens, but when it does happen you have to be ready to act?",
                    "label": 1
                },
                {
                    "sent": "So the idea is that such a system as ours.",
                    "label": 0
                },
                {
                    "sent": "We can even generate maybe smoke, smells and so on that it would allow personnel to maintain readiness for emergency responses.",
                    "label": 0
                },
                {
                    "sent": "Another thing we've been working on is.",
                    "label": 0
                },
                {
                    "sent": "Partial spinal cord injury.",
                    "label": 0
                },
                {
                    "sent": "So we've been working with a private rehabilitation clinic called Neuro Works.",
                    "label": 0
                },
                {
                    "sent": "To see if our system can help patients who have partial spinal cord injuries, this means that their spinal cords have not been completely broken.",
                    "label": 0
                },
                {
                    "sent": "This only partial severance, and they get some walking ability back.",
                    "label": 0
                },
                {
                    "sent": "What happens with these patients is that they often reach a plateau of walking.",
                    "label": 0
                },
                {
                    "sent": "So they get better for awhile then they don't get better anymore.",
                    "label": 0
                },
                {
                    "sent": "They just stay at the plateau.",
                    "label": 0
                },
                {
                    "sent": "And so we're hoping that with a more sophisticated device.",
                    "label": 0
                },
                {
                    "sent": "Such as ours, as as as compared to rotation, treadmills that maybe people can get over this plateau and reach a new level of walking ability.",
                    "label": 0
                },
                {
                    "sent": "So recently very recently we tested forth for patients with spinal partial spinal cord injuries and found that they all immediately walked better on our system.",
                    "label": 0
                },
                {
                    "sent": "So they all immediately got over the plateau with almost no training.",
                    "label": 0
                },
                {
                    "sent": "They walked more symmetrically.",
                    "label": 0
                },
                {
                    "sent": "They were able to exercise harder and longer.",
                    "label": 0
                },
                {
                    "sent": "In one case, a patient ran for the first time ever.",
                    "label": 0
                },
                {
                    "sent": "And so our hypothesis is that.",
                    "label": 0
                },
                {
                    "sent": "The reason that patients reach plateau of rehabilitation is due to the limitations of their exercise.",
                    "label": 0
                },
                {
                    "sent": "Treadmills, not due to neural capacity.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I don't have the direct video video, but so I have to go to the Internet to get the video it was shown on Channel 2 News, so I don't have access to those videos.",
                    "label": 0
                },
                {
                    "sent": "I have to go to the Internet, so here it is.",
                    "label": 0
                },
                {
                    "sent": "So was playing on Channel 2 News in Utah and you can see it was telling you.",
                    "label": 0
                },
                {
                    "sent": "I don't recall seeing delicate arch in Utah before it falls down.",
                    "label": 0
                },
                {
                    "sent": "OK, so there's a Channel 2 news segment.",
                    "label": 0
                },
                {
                    "sent": "Yep, let me try again.",
                    "label": 0
                },
                {
                    "sent": "Just over thousands of people who suffer spinal cord injuries, not all of them end up in a wheelchair, but walking again takes time and drive.",
                    "label": 0
                },
                {
                    "sent": "Scientists at the University of Utah are developing a way to enhance their rehabilitation, feels mostly joins us tonight and this is kind of treadmill meets high tech, right?",
                    "label": 0
                },
                {
                    "sent": "It's early as The Walking in a computer generated environment, but take the wind we've had tonight, for example, a person with a spinal injury might be just blown over because they can't keep their balance.",
                    "label": 0
                },
                {
                    "sent": "This experimental system can also create win.",
                    "label": 0
                },
                {
                    "sent": "Help people train their bodies for the real world.",
                    "label": 0
                },
                {
                    "sent": "Over the past two months, Zach Lindsey was strapped into a harness, too.",
                    "label": 0
                },
                {
                    "sent": "Then launched on a stroll through a virtual world with giant treadmill and University of Utah.",
                    "label": 0
                },
                {
                    "sent": "Does more than just spin.",
                    "label": 0
                },
                {
                    "sent": "It puts a patient in charge of their own rehabilitation faster.",
                    "label": 0
                },
                {
                    "sent": "You go faster it goes through one more resistance they can give you more resistance.",
                    "label": 0
                },
                {
                    "sent": "Anything in less they can give you less.",
                    "label": 0
                },
                {
                    "sent": "Lindsey has a bullet lodged in his spinal canal like Chess, My left side and just play pinball.",
                    "label": 0
                },
                {
                    "sent": "My insights and has little feeling in his legs.",
                    "label": 0
                },
                {
                    "sent": "Lots of surgeries and then the rehab began.",
                    "label": 0
                },
                {
                    "sent": "So in this case I can focus more on my left side.",
                    "label": 0
                },
                {
                    "sent": "For example, I quit turning left.",
                    "label": 0
                },
                {
                    "sent": "I put more weight on my left side.",
                    "label": 0
                },
                {
                    "sent": "Patients are safe.",
                    "label": 0
                },
                {
                    "sent": "Professor John Harbaugh specializes in robotics in the School of Computing, he says local company Neural Works approached him about developing this technology.",
                    "label": 0
                },
                {
                    "sent": "They found that after oh point of patients don't.",
                    "label": 0
                },
                {
                    "sent": "Progress as fast or they reach a plateau as patients will talk, they have to negotiate terms and avoid buildings.",
                    "label": 0
                },
                {
                    "sent": "Motion sensors tracked, measuring and computing ways for improvement.",
                    "label": 0
                },
                {
                    "sent": "We're hoping that by making measurements of the angles at the same time that we can quantify progress.",
                    "label": 0
                },
                {
                    "sent": "Is there some also creates a level of reality the patient could see buildings on the screens and they're experimenting with win.",
                    "label": 0
                },
                {
                    "sent": "Even smells put actors into the scene like their cars.",
                    "label": 0
                },
                {
                    "sent": "That they have to avoid, Zach Lindsey says to workout with its twists and turns is exhausting for him.",
                    "label": 0
                },
                {
                    "sent": "And he thinks the technology has potential and they can help you start it.",
                    "label": 0
                },
                {
                    "sent": "And this can help keep you going.",
                    "label": 0
                },
                {
                    "sent": "Well, simply being motivated by something new and visual is the most basic attraction to this level of therapy.",
                    "label": 0
                },
                {
                    "sent": "The first 5 patients.",
                    "label": 0
                },
                {
                    "sent": "OK, so we were really surprised we did a pilot study.",
                    "label": 0
                },
                {
                    "sent": "We didn't know what to expect.",
                    "label": 0
                },
                {
                    "sent": "You know, we've just hypothesis and we were surprised in every single case.",
                    "label": 0
                },
                {
                    "sent": "Patient got almost immediately better, and so hopefully we'll be able to pursue this more in the future.",
                    "label": 0
                },
                {
                    "sent": "We are planning to do so.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So just to conclude, we emphasize some of the things said sudden in this video clip.",
                    "label": 0
                },
                {
                    "sent": "We want to come up with scenarios of increasing sophistication that will will speed their abilitation process because we want to move them into the real environment, and so it's like the specificity of training.",
                    "label": 0
                },
                {
                    "sent": "If you want to train for something, you have to train exactly.",
                    "label": 0
                },
                {
                    "sent": "For that you can't have a kind of different exercise which is different from the real exercise that you're trying to achieve, and so the treadmill thread port is the most realistic.",
                    "label": 0
                },
                {
                    "sent": "Walking system which simulates real walking but in a safe setting, so we hope to create scenarios making more and more difficult.",
                    "label": 0
                },
                {
                    "sent": "You know, actors jumping out at them like they're in a crowd.",
                    "label": 0
                },
                {
                    "sent": "They have to adjust wind.",
                    "label": 0
                },
                {
                    "sent": "Gust comes at them.",
                    "label": 0
                },
                {
                    "sent": "The wind can blow people over, and so we're hoping to.",
                    "label": 0
                },
                {
                    "sent": "To help them adjust to perturbations, which is one of the big problems in returning to the real world.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I've come to the end of my talk and of course is not just me.",
                    "label": 0
                },
                {
                    "sent": "There's a number of faculty members involved in this project, as well as a few of the number of students who've helped us on this project, and it was found funded by the National Science Foundation.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much for your attention.",
                    "label": 0
                }
            ]
        }
    }
}