{
    "id": "p3v6z5p4xqvdhg66x6mr3jbeawkdgrnf",
    "title": "Random Matrices in Wireless Flexible Networks",
    "info": {
        "author": [
            "Romain Couillet, Supélec"
        ],
        "recorded by": [
            "Institute for Communications Engineering and RF-Systems"
        ],
        "published": "April 4, 2012",
        "recorded": "December 2011",
        "category": [
            "Top->Computer Science->Information Theory",
            "Top->Computer Science->Digital Signal Processing"
        ]
    },
    "url": "http://videolectures.net/nthfs_couillet_matrices/",
    "segmentation": [
        [
            "Site, picture tutorial randomly.",
            "Would like to welcome more quickly.",
            "Is the nature today.",
            "But I also want to welcome especially the external guests from Vienna.",
            "As far as I have seen.",
            "How long this is a event jointly organized by the Institute of Communications, Engineering and RF Systems, together with the IEEE Joint, Empty question chapter and together with your consent of competence.",
            "Like pink around.",
            "No.",
            "The topic of today.",
            "The introduction of the speaker.",
            "Communications.",
            "Systems Ericsson.",
            "Preparing speech.",
            "And he graduated from speech Team 2010 and he is currently assistant Professor Jia System Science Project Challenge.",
            "Research topics, information theory, signal processing, complex system and of course, random matrix theory, which is the topic for today.",
            "Just have to switch to.",
            "Nice, this is recorded.",
            "Can be downloaded.",
            "These weeks for my language.",
            "So thank you for the invitation.",
            "Some people beautiful day.",
            "Sorry dude.",
            "Maybe I should mention that I do some short introduction of super leg so super cool one of those so called chronicled in France.",
            "So kind of although it's called because the tiny school 300 students dedicated to engineering studies in electricity talk engineering related topics.",
            "So in particular we have a group wanted.",
            "Education senior processing.",
            "Energy automatics.",
            "And in particular, did my PhD within groups somewhat connected to the?",
            "Communication Department which is the Alcatel Lucent shares.",
            "Different entity who dis entities working with connective radios.",
            "And so I did my my PSU Amanda Matrix theory full for connective radios, so the topic today will be random matrices, so I said in wireless flexible networks I should maybe say these both wireless communications an important signal processing.",
            "So since I know that there are quite a few people doing.",
            "Radar detection and the subspace methods will be interested in part of the talk.",
            "That will be OK to signal processing, so half of it will be communication related to information theory.",
            "And the other half of it will be.",
            "Signal processing, so the key motivations stop that.",
            "The chemo divisions for each area so that the one for information theory the question is.",
            "Since nowadays we have those complicated networks where you have multiple antennas at the base stations you have multiple self interference, multiple users using the same bandwidth.",
            "How can you study the performance of search networks and how can you optimize it?",
            "Knowing that is inherently filled with random randomness because everyone is moving, the channels are have different probability distribution and very simplistic programs such as.",
            "Just do the capacity evaluation of such networks or kind of become quickly intractable.",
            "In particular when you have for multiple antennas, multiple users, and because complex in particular, if I have a very simple channel like mine, more structure where I have.",
            "Minor transmission.",
            "How to receive a reason and with the given number VN antennas the transmitter is Max with slow and I should call this one W, then small then.",
            "Dennis and my atheism, my Mood channel, which has a given probability distribution.",
            "Then we know that of interest would be the capacity of this channel, which is.",
            "In the organic sense, with the Superman over the pre chorus queued.",
            "Forex being Russian distributed.",
            "If I called you the covariance matrix of my transferring signal, then I'm interested into this type of quantity.",
            "So the expectation of load contaminants.",
            "All I know is this called Ruby.",
            "It's enough information.",
            "It's cute.",
            "And.",
            "Solving this is not is not trivial, so you cannot.",
            "Actually, we cannot find it.",
            "So some solution for this Q that will reach these.",
            "That will reach the capacity with everything capacity of the job.",
            "So what so far people note is that if you do, the problem is convex in queue, so that we should do convex optimization.",
            "You can find your key given, so the expectation is obviously on the distribution on edge to edge of statistical distribution.",
            "And when I want to find this capacity so far we only got so far 10 years ago.",
            "We only knew that convex optimization problems could control that.",
            "And here what we will do is something different.",
            "We will say that if the small end and weekend are sufficiently large, so let's say bigger than one, that's the bigger than one, then it turns out that this I for some good distributions of age, will be close to something that would pull high bar closing the center.",
            "The difference goes to zero and goes.",
            "You go to infinite while the ratio between big and small end is so constant, that is not trivial Sisneros, but infinite.",
            "And this quantity here will have the interesting property of being teacher ministik.",
            "Well, I is also deterministic, but it won't depend on an expectation of some probability distribution.",
            "So this terministic object on which we can optimize the queue that maximizes the server.",
            "And in this sense, we can find a close kind of closed form solution that gives us the big good approximation of the capacity.",
            "So that's the motivation from the communication file from the signal processing part.",
            "So in the end, the important aspect of random matrix theory is that actually allows dimensional random matrix theory.",
            "Is that these?",
            "Dimensions on both large and their issues.",
            "Some constants.",
            "That means if I look at two of the two 2 dimensions in my system, they both form kind of large, but the ratio between the no no one of the trees are dominating the duration junior Twitter account.",
            "So in signal processing and that's what they will start here in signal processing.",
            "Um?",
            "We are interesting into the case where I have."
        ],
        [
            "Some I received some steam."
        ],
        [
            "That all vector signals.",
            "So I will call them W, one WN, etc.",
            "That's all.",
            "Each signals of time outside weekend.",
            "And I will make small and observations of these, and that will be interesting to the case where small and is not large compared to big.",
            "And so in classical signal processing would assume that you have sufficiently many observations so that lower class members and the central limit theorems comes in, and you use classical statistical properties of these lower numbers.",
            "So here we will assume that both.",
            "The small end is not big compared to the hand and we will do something better, right?",
            "So in particular, well, that's what I'm mentioning.",
            "If I have a few realizations, quite a few positions of those W Idol ID we were given covariance matrix of that.",
            "I know from their local members that that this guy could WW operation, so the value is the metrics that collects all the the stacks the current vectors, so it's and then began times smaller matrix then this WW original almost surely will converge to this true covariance matrix.",
            "Now let's say so.",
            "But yeah, often is the case.",
            "Or more and more to do cases we cannot afford N going to Infinity, or at least we can order form.",
            "And being extremely large compared to big and we should do my new radars and you have not 10 but 2030 antennas.",
            "Then it becomes maybe come in some cases complicated to have sufficiently many observations.",
            "So that's more than is very big compared to begin.",
            "So what happens if?",
            "What happens if I look at this sample covariance matrix with small end going infinite?",
            "It's easy to see that every individual entry that's a large numbers for every entry.",
            "Every individual entry tends to the respective entry of.",
            "But since I assume it's big in Islam, the rate at which this convergence holes is.",
            "Maybe so slow that on from an aggregated POV, so the whole matrix does not converge in any matrix known to the ER.",
            "So in particular, let's look at the eigenvalue distribution.",
            "So if all is an identity, so it's an identity matrix, I think a few observation of white.",
            "Of these white signals, then I expect that with a big N, so N equals.",
            "I think in the next slide, which will be 500 small end being 500, that even if we get is large, I expect that my RN will be close to an identity.",
            "So if I look at the eigenvalue distribution, I expect you have a direct model.",
            "This is not the case.",
            "So if I didn't hear so small answer, it's 2000."
        ],
        [
            "Release number, but began is kind of a big number also and if I look at the eigenvalue distribution of these RN metrics when I sample programs metrics, it's not directing one.",
            "It will be distributed like this.",
            "So a way to press yourself is that effectually Smalling was even that began.",
            "It was bigger than small end, and you necessarily have a deficient rank metrics so necessary you have zero eigenvalues, so it cannot be directly one for sure.",
            "So in the intermediate case, you'd have a distribution like this.",
            "A turns out that there's some nice property that arises, which will be a kind of lower class members for endometrosis, which is that the eigenvalue distribution, although it's not directly one, will converge to re converge weakly to some given distribution.",
            "When I called a matching Costolo.",
            "So if I look at the eigenvalue distribution, you take those big matrixes so you can do that.",
            "In simulations began small N being.",
            "With Rachel 11, before you take the dimension going allows, you will observe that you have Easter and it is there closely matching matching capacity.",
            "And we will use those properties.",
            "So obviously depending on the ratio began over small end, the curves of the difference in part."
        ],
        [
            "Either way you have small and very large compared to big and we will get back into this direction one, but you have some flexibility in the mean time in the in the middle I for different ratios an override.",
            "OK, that's what I'm mentioning.",
            "Here is.",
            "Although every and every roll."
        ],
        [
            "Thanks for the color.",
            "Will give you 1 every wartime so different color will give you a 0.",
            "The Matrix will look like an identity, but it's clearly not an identity.",
            "In terms of Agendar distribution at least.",
            "So that was that was the main order to get to spirit."
        ],
        [
            "What's happening issue?",
            "Make the mistake of assuming that because small N is big, then you have close approximation of your simple programs.",
            "Metrics for local trooper, expedited central programs one.",
            "Let's move to what people did in random matrix theory.",
            "So now that we understand that it's not so obvious the strings."
        ],
        [
            "People did, so he studies actually quite awhile ago in 1955 for different type of metrics.",
            "Is such was no simple programs metrics is it was our mission ID metric system.",
            "Mission ID means I think the upper left upper right part of the metrics.",
            "I feel it with plus or minus ones or any distribution.",
            "In fact where those have ID distributions.",
            "And you copy pasted below, then other seats innovation metrics.",
            "So the eigenvalue distribution will be real.",
            "And if you look at very large such matrices and you look at the eigenvalue distribution wiegner, so we know he was interested into that because of nuclear physics, because it's a matrix of skins.",
            "I'm here with that.",
            "Evilized you realize that the eigenvalue distribution will be something like this, so they."
        ],
        [
            "Be negative here because it metrics is not."
        ],
        [
            "And turned out to be this so called semi circular So what?",
            "So what Victor did is that in back in 1950 he said, OK, how do I prove that?",
            "Well, it's."
        ],
        [
            "Let's look at the eigenvalue distribution and try to compute all the moments.",
            "So the moments of the distribution, the first moment is the average of the eigenvalues, so it's nothing more than the average trace of X and metrics.",
            "Then the 2nd order moment will be the squares of the eigenvalues, which are, which is nothing more than a trace of X squared.",
            "So it computes the computed all the moments.",
            "So now to be this cattenom numbers thing.",
            "And then proving that the moments give you the distributions so that these distribution has these moments.",
            "So clearly this this distribution, which is a semi circle over if the limiting distribution.",
            "That's how initially it started with that.",
            "The problem is that this technique, which consists of looking at all the moments, only gives you successive moments.",
            "So from there, how do you figure what will be the distribution in this case?",
            "It was very easy because you look at it and you say OK, looks like assuming so close I just have to do to take a distribution that looks like a screen software and check out the moments correspond.",
            "But if you only have a moments and you want to figure the distribution, it usually is kind of a tough thing to do, so you need other techniques.",
            "Here I'm just mentioning another one, which is the full sample.",
            "Also in my metrics, and now instead of."
        ],
        [
            "Techniques are vision.",
            "I fill it with ID entries plus minus one or Gaussian, whatever.",
            "Then you can't.",
            "Then I put the eigenvalues, which I'll never complex because the matrix is no longer duration and those eigenvalue oh actually distributed uniformly on the unit circle so well.",
            "I need any some scaling.",
            "Obviously some scaling here so that the eigenvalues don't blow up.",
            "OK."
        ],
        [
            "So that was small.",
            "Some some things that were initiated in the past."
        ],
        [
            "The problem is that it's very nice, but when you want to move to more involved metrics models of things that will be more realistic from a signal processing point of view of communication point of view.",
            "While you cannot use those techniques of looking at moments and trying to figure what will be the distribution, so you need to do something more and for that.",
            "OK, for that you need you need more info methods.",
            "So in the powerful mathematical tools.",
            "So one of them is the free probability framework that I think I want."
        ],
        [
            "Too much time on this because it's not my priority and I don't like it.",
            "I tried to send my work I mean.",
            "But yeah, I think it's as some intuition.",
            "So I'm talking talking.",
            "So I was mentioning one thing you could so."
        ],
        [
            "One thing you could do is to look at the successive moments of the distribution of the of the random metrics, and sometimes it's enough.",
            "Sometimes is sufficient to just consider moment, because what you want to look at some value of the trace of powers or whatever, and the question is how do you handle that if you have mattresses.",
            "So that can be a product of matrices instead of a regular ID.",
            "Metrics were taken metrics times of deterministic random metrics.",
            "Damages to Mystic one times another elementary school, also random matrix.",
            "How do you figure what is the eigenvalue distribution of the whole thing?",
            "And for that we can use.",
            "This is kind of interesting thing.",
            "You can use a kind of classical probability theory of moments and cumulants so you know you may know that in probability theory if you have independent random variables A&B then you can compute the moments.",
            "If they are.",
            "I said that they are independent, you can compute the moments of the same based on the moments of the individual vials and if you turn things into Cumulus then you have this property that the components of A+B is committed.",
            "Variance of a proviso.",
            "Go to this, etc.",
            "And there's a link between cumulants and moments.",
            "The link is just well formula where you take partitions over supplies, all all possible partitions of numbers taken from one to K, so they converted from one to K. You look at all the possible partitions of this set, and while you can, you can use this formula to compute that.",
            "To make a pile afterwards.",
            "Problem is now building with mattress is so metrics is on have this problem that 8 * B is not be times a, so there's regular probability theory that you use in the scalar assembles like real numbers or complex numbers doesn't work any longer.",
            "So you need to come up with something else and some people have a guy called vocalist who created something for lunch.",
            "To the random variable so uncommitted committed for the product.",
            "So which is called free probability.",
            "So in these frameworks I want so in this framework.",
            "Ren, now we talk about matrices."
        ],
        [
            "So independence would not be enough.",
            "If you take 2 random matrices that are independent, you won't have results, they have to be much more than that which will be in that case, what we call asymptotically free.",
            "Which means somehow that you should look at the eigenvectors of.",
            "If you take the product of A&B and the eigenvectors of a kind of isotropically distributed on the unit sphere, like regression metrics, concussion for Russian ID metrics.",
            "Music playing on this site by unitary matrix.",
            "You still have the same distribution, so the eigenvalue the eigenvectors on kind of turning on the space of on the unit sphere see to the end.",
            "In that case, if you have this property of the eigenvalue distribution, eigenvector distributions or anything, and then the B matrix has also eigenvectors of go somewhere else, then there are some particular free.",
            "That's how you you need to decorate the matrices in terms of eigenvectors.",
            "And obviously there has to be independent with respect to their entries.",
            "So for instance, 2 Goshen matrices are free aggression metric center deterministic metrics are free, so you can do operations on those.",
            "In that case, what vocalist who came up with this theory that creates three components?",
            "So the three components are something that looks like that look like the criminals respect moments, but here you don't.",
            "You have a little change in the partition.",
            "Thing is almost the same.",
            "And you have this same thing, the same property that the components of A+B is a criminal."
        ],
        [
            "And the freak."
        ],
        [
            "Sort of a especificamente, some being so somehow if I give you so, it will be the same for the product.",
            "So if I give you a gushan metrics and I do want to sorry progression metrics, deterministic one and then another Goshen metrics like credit for all of them and I can figure the eigenvalue distribution of the product base.",
            "But the moments of this distribution based on the moments of every individual.",
            "So it gives me some properties of how those matrices are on the 18th.",
            "As I was saying, I don't like that because it's still the same problem.",
            "It gives you moments, sometimes moments from letting up.",
            "We want to get more information on the other distribution if you want to get the distribution itself is not sufficient.",
            "OK. Just say thank you.",
            "You can really have a problem between classical moments and."
        ],
        [
            "Free moments."
        ],
        [
            "Slight differences, you have the notion of independence, which is different, but it's called convolution and never look at the distribution of the sum of two random between dependent variables and it will be the convolution of the distributions.",
            "In that case it will be some new operation that we.",
            "This is based on the community.",
            "So you have the same framework somehow in here.",
            "Essentially Theorem becomes a convergence to a similar problem.",
            "So you have a new theory of probability that has been carried from scalar case matrix case.",
            "But again, that's not so much interest for us here, although I will talk a bit about that afterwards."
        ],
        [
            "OK, so the tool I like most and that's more."
        ],
        [
            "Or used.",
            "Install the pros and it will be very useful as machine well, both in communications Anning, senior processing for reasons that will be clear both very soon.",
            "OK, so let's just be very abstract."
        ],
        [
            "Beginning.",
            "Let's take a nap that is a distribution function like that's a cumulative distribution function.",
            "And what I call this tedious transfer mode of F is this integral of one over Lambda minus ZI.",
            "Pointedly, so these taken anywhere with this guy will exist.",
            "On this distribution.",
            "OK, so somehow just see this till just transform as a four year transform within random matrix theory.",
            "We don't like for your transform.",
            "If it doesn't work that much, so we will move away from the from the distribution space to another one and this space will be the space of tedious transfer, OK?",
            "And then similar to free transform, we can come back into the distribution space by by by having an inverse transform, which is that the distribution that has the for the transform MF will be given in density by this formula will take value that is on the complex space you have that you get very close to the real axis by taking why here, going to zero and gives you the.",
            "In game engineering product that gives you the density.",
            "Of the distribution.",
            "This never purely is complex.",
            "If you take the complex.",
            "They have a nonzero imaginary cost and you get closer to the real axis and it will give you the density.",
            "So we care about those changes transforms because, well, we just hit next night.",
            "If.",
            "I look at the eigenvalue distribution so my distribution function now is the eigenvalue distribution of."
        ],
        [
            "Even random matrix, but I could extract then it's not difficult to see if X is our mission.",
            "Sorry, that's an admission metrics that accent if you direct diagonal license then it's clear that one over any trace of this diagonal minus the minus one is exactly this son of one over eigenvalue minors.",
            "OK.",
            "So my message is transformed is something that looks like this trace of the inverse of this metrics and This is why I like to just transforms, because when I will play around with metric system I will have inversion lemmas, classical matrix inversion, Ms they will come up very often.",
            "OK, and well, something interesting also or not so much actually is that.",
            "Interesting respect to what I was saying before is the fact that this eigenvalue distribute this so studious transform is the generating function moment generating function.",
            "Because you can see by just writing that one minus Lambda is over Z.",
            "Is this some of the groups?",
            "There's a DF of Lambda missing.",
            "Here it is the sum of the Lambda over Z to the power 123 etc then.",
            "Then you recognize that you have moments so well as a link between those moments in history.",
            "Um, OK. OK, so thank you.",
            "How are you feeling?",
            "I don't want to do a mathematics for this."
        ],
        [
            "Enjoy it is just for you to get the feeling that these changes.",
            "Transform makes sense.",
            "We want to use it so will demonstrate very quickly how you get additional professor, because again, if you look only at their moments of the distribution, while it's very nice you have all the moments.",
            "But how do you figure these curves?",
            "That's kind of.",
            "You know it is very difficult to to fit to something to some parametric distribution, and well, doesn't work.",
            "So we need another way to figure what is this distribution, and that's what machine code.",
            "N + 2 approved in the 67 so.",
            "Proof.",
            "And what they do?",
            "Following thing so we want to study.",
            "This teaches transform so we take it should start with the fact that I take an extent metrics that is filled with ID entries so it doesn't need to be Russian or whatever it has just to have.",
            "Independent and identically distributed entries.",
            "So if.",
            "They have zero mean.",
            "All the entries have zero mean and variance 1 / N, so this one of our ends.",
            "Just because I want to scale everything otherwise.",
            "Again they can practice with this clothes.",
            "And I want to look at the distribution of the eigenvalues.",
            "So ESD is empirical spectrals, so the eigenvalue distribution of this guy which I know, will congressional discussion progressed.",
            "So since I've been looking at stitches transformed, I will be interested into this object XX or mission wenzi today, minus to minus one."
        ],
        [
            "Not I do is I will take my accent and then we'll just take the first rule of it's an isolated from the rest.",
            "So those two independent.",
            "And then we'll start to do some matrix inversion lemma, so if I so here I'm just rewriting what's inside like this.",
            "So this wire mission, multiplied by its corresponding exenteration will give me a wire mesh y -- Z because of his C and well, we have other terms and I will be interested into this first term on the left upper left part.",
            "And by just using a matrix inversion MSO in particular, this display Mother tells you that for block matrix like this you have this inversion formula.",
            "I only look at this guy, so the entry 11.",
            "It turns out that this is given by this, which due to the.",
            "Yeah, which which well do this inversion lemma will give me something which is the inverse of sum, or something that looks like this.",
            "Why's it up interest?",
            "Because now we start to recognize already the same structure both on the left and on the right here.",
            "OK, this guy is almost the same, you just it just has one color removed.",
            "But since we're going to Infinity one column less will be something like almost the same thing.",
            "So.",
            "So far we don't want to have this quadratic forms for this projection of Y over these metrics we want to work to have a trace because we want this to transform, but it will turn out that we have these from dental.",
            "During that I called that race in work that tells me that if I have an egg."
        ],
        [
            "Vector with ID entries with various 1 / N so remember that the model over weekend or one of our small ends.",
            "Kind of the same thing.",
            "'cause this scale is saying.",
            "Then at least I * A matrix AN that has its larger second value that cannot explode, kind of contained.",
            "Then this difference between this one and the trace it goes to 0.",
            "Very easy to see in expectation.",
            "Should take the expectation here.",
            "All the cross product disappear, so whatever is outside the diagonal of a N will disappear.",
            "Now to prove it in a normal way you have to go a bit deeper, but you can prove that.",
            "Can you project those independent variables on the end, it's almost that race again.",
            "Bing that case what I had before here.",
            "I can replace it by the trace, because why is independent of this wiring?"
        ],
        [
            "In life.",
            "OK, because it's a it's a column that I have isolated from the rest and the entries of the matrix.",
            "So independent so I can use my lemma and say that this guy will be approximately equal where approximately equal means for large dimensions."
        ],
        [
            "To this to this thing, and here I recognize almost the stitches transform.",
            "Well here I have access permission now where?",
            "Kind of X permission X.",
            "Date change, but it doesn't really matter because OK, we'll see that afterwards.",
            "So do you all the difference.",
            "Obviously that here is X, and here it's why.",
            "But we figure that the trace of a matrix.",
            "With one rank removed, one rank column removed shouldn't be much different from the same without with the with the column hide it does something that we also have.",
            "We have another level that tells us that if I have a metrics B minus the minus one and I had to rank one for."
        ],
        [
            "Vision, then, is almost the same and it's getting one of them.",
            "So again, I can replace my wire vision, Wi-Fi Exhibition X and then I recognize these teachers transform.",
            "I see the details of moving from exclamation next week, the opposite.",
            "But in the end, this is the case for the entry 1 one, but since my magic is very symmetric, this I could have done for any of the entries in fact, or something you have to prove rigorously, but it makes sense that entry 1 one or two, two it's all the same and you see that these results here is independent of the choice of the entry.",
            "So that if I take you some over those, so I think the trace of that and I normalize it, I should get the same reason I have the same result.",
            "Which is what I say here, so hopefully this switch up, exclamation, exclamation vaccination, age."
        ],
        [
            "I've had in the end that.",
            "My normalized race is almost something approximately equal to 1 over, while the same thing is whether I pulled an F is in fact.",
            "Why is this like this trace?",
            "OK, so it's just an object, so in the end I have on the right and on the left."
        ],
        [
            "The same objects, but like MF almost equal to 1 over something with."
        ],
        [
            "Skier that this will be a second order for the normal.",
            "And then I couldn't solve it.",
            "And so I have my stitches transform given exactly by this function.",
            "Now since I have to do the inversion formula from this transform to the to the to the distribution, I can find the distribution and that's exactly my Russian capacitors.",
            "OK, so thanks to those matrix inversion Members using this stitches transform helps me how to get to do the full distribution.",
            "So.",
            "So based on that we can do much more.",
            "So not only these."
        ],
        [
            "X exhibition, but now I can introduce AT metrics in between.",
            "I could determine istic one.",
            "And we have the same kind of results and reproduces the similar proof that, say, an we have now.",
            "That so if when the dimensions go lost my matrix tiene hasn't given eigenvalue for limiting and very distribution then I can find the distribution of my BN.",
            "This guy has a limit and this limit is characterized by stitches transform but unfortunately in that case I don't have an explicit solution.",
            "I haven't known most will have an implicit solution, which is that this transformer.",
            "F is the is the fixed point solution of this.",
            "OK, so you remember before we had like these six points, this one equals one over something of this kind.",
            "Well, we could pass this guy on the left.",
            "Now we can."
        ],
        [
            "So.",
            "So we know that this situation is the solution of this fixed point equation, where."
        ],
        [
            "FT Here is the eigenvalue distribution of limiting eigenvalue distribution of the T and metrics.",
            "So you take your key metrics you as soon as kind of growing large because limiting distribution, then what is your limiting distribution of XTX?",
            "It will be this F with stitches.",
            "Transform is given by that.",
            "So I will give an example.",
            "This.",
            "Well, these guys many interests so back to what I was saying at the very beginning.",
            "This case is exactly summarized here, so if I have, well, we'll see later, though that's positive I have edge Q edgeware, curious, deterministic.",
            "Because he will be independent of age.",
            "Then I have exactly this setup where I XTX so well we already see somehow the link here.",
            "Um?",
            "And in signal processing, well if instead of XTX I look at the contrast one, which is this one T 1/2 exhibition XT 1/2, then this is a sample covariance matrix.",
            "OK of vectors.",
            "So extending the metrics that correlate 61X2X3 etc that all have the same covariance Tien.",
            "So now.",
            "I tell you what is the covariance matrix and I can get the distribution of of the eigenvalues of the sample programs.",
            "And of interest in the second part of the lecture here will be to say how do you do in France with that.",
            "But now I want to do the opposite.",
            "I see I'm in value.",
            "This repository I see sample programs metrics.",
            "What can I tell about the true programs measures?",
            "But now I cannot say as before that the limiting one is the same.",
            "It doesn't work in order, so I have to be able to say some things here, and that's what we're going to see the second part.",
            "OK.",
            "So this one is very fundamentals, be improved by Silverstein, volume 95.",
            "And we will come back to that very often.",
            "Something I should notice here.",
            "So well then no two ways to denote that first, because here if.",
            "The distribution of of tea.",
            "This FT is the eigenvalue solution of Tien.",
            "So here T / 1 + T something is kind of a trace of TN times the inverse of tiendas.",
            "And the other thing I want to mention is that.",
            "OK, by doing some manipulation it's kind of clear that this could be written as vestiges transform also of teeth, so we have kind of a link between the Steelers transform of Tianda solutions to model.",
            "And this is how we do statistical inference so young PC paid a bit, but well will happen is that if you had any information on the observation which will be this transfer the ETH metric, the F distribution, then what can you say about the.",
            "The distribution of the teeth, so the true covariance matrix?",
            "How do you have a link here?",
            "The district is transformed into.",
            "Will be here later.",
            "Show you the.",
            "Things were so I was mentioning that we have."
        ],
        [
            "Given by the solution of this given by the fact that this is transforming the solution of these sticks."
        ],
        [
            "How can we get F?",
            "Well, exactly like I said you take this email generating part of the Seas transform when Y is very close to 0.",
            "So what?"
        ],
        [
            "I do.",
            "I do is I. I take the X axis.",
            "That will be the PDF of.",
            "So what I call F of X. I take X + X + I times and this unit is very small.",
            "And for each 4 inches equals experts I accident.",
            "I sold this fixed point equation so this one I find the M that solve this thing.",
            "You can prove that the algorithm that solves that is a very trivial and converges all the time.",
            "And it will give me the first point at X = 0, then a second one further one and I go like this.",
            "And it will give me my distribution.",
            "OK, by taking action sufficiently small you will get something very, very close to 0 here, and that will give you the full distribution.",
            "So in particular.",
            "Let's say that the T matrix is a is a matrix filled with like this 1133 cakes.",
            "So one 30s, once 133 one 30s case and I want to see the entire distribution about that.",
            "So obviously you again if small hands the number of observations was super large.",
            "What you see is 3 directs one in one 131K.",
            "What do you see if both dimensions on kind of the same, it will be exactly this.",
            "But you can simulate it with Matlab.",
            "You will get Easter Gram and now if I sold my fixed point equation."
        ],
        [
            "For every X I'll get exactly this profile.",
            "So I know exactly how it will behave asymptotically.",
            "So it's interesting because here I took 137.",
            "You see that we generate blobs.",
            "Rams those 137.",
            "And one question that will have the second part of the talk will be once I see this once I see those blogs, how do I figure the 1 three at 7?",
            "Something like we have, we will have in my examples on transmitters with different powers or we different distances that can be a radar system.",
            "I want to identify yourself to power sources.",
            "And what I see after a few samples is by looking at the eigenvalue distribution, those blocks and the question is, where is the source?",
            "The source will be at a distance 7 here, but.",
            "I don't know where is the 7 hidden there and if I take obviously the average over the block doesn't work, then the seven is not in the middle.",
            "So we have to do something more refined and then it gets worse.",
            "If you don't have enough observations or if 2 powers are very close to one another, and this is something classical numerator when you have from 2 angles very close you have this avalanche effect that semester.",
            "Another makes it impossible to decide.",
            "Well here you will have a kind of similar behavior that well in this.",
            "How do you see that there is 2 values, so we'll see that will get into trouble in that case.",
            "Um, OK. No, let's get back to communication.",
            "What?"
        ],
        [
            "Why do we care which is transforming communications?",
            "Well, because we have an extremely nice property that is.",
            "You should take this distribution that you have to think of again as a negative value distribution.",
            "Then the sum of the log of 1 + X Thunder with Mandarin treated like this.",
            "He can be written as an integral for the function if you wish of the cities transformer that.",
            "So once you know this, this transform of the distribution, you can get this interval form.",
            "But what is this integral form?",
            "If F is the distribution of the eigenvalues of a channel, etc mission, it's exactly this laggy terminum, so my capacity.",
            "So once I know this is transformed, if I'm able to walk even showing not able to find an integrating for that, at least I have a numerical integral I can solve then then I have an idea on what is the dog that I seen, particularly that means for this random generated logdet thing, I could have an approximation that is deterministic and it is a function that this integral outages transform.",
            "So it will be equally still true if I put an expectation from privacy.",
            "So maybe I'll get back to that at the end of the first poll."
        ],
        [
            "Things we can do these days now.",
            "Another thing, so I mentioned these sample programs metrics case we can go for."
        ],
        [
            "Correlation on both sides.",
            "Were they in that case for signal processing, that means they are linearly corrected curve related signal in time.",
            "In wireless communications, that will be a Chronicle model for channels with my child H as a left correlation right coalition, and when I multiply right submission it gives me this edge transmission.",
            "Well, I could have also some external things that's so useful.",
            "The one that is useful is this one, which is an information personal as well.",
            "That means you receive noise and you have some deterministic informations.",
            "I again for music and this kind of thing is super useful for communication.",
            "It will be a Russian channel, which is you have a line of sight component in your channel and you have the rest of its fading channel you can do.",
            "The.",
            "OK, frequency selective in cash you have K path channel multipath you consume such such channels.",
            "And other things one.",
            "This was the.",
            "This one which is useful for multiple access channel.",
            "So everyone you have key users they they all transmit to the base station and the capacity of this system will be characterized by.",
            "This indicates where everyone's Chronicle model.",
            "OK anyways, just send this to say that we can do a lot of things that have other models and if the X is now turned into a W or W is not an idea metrics but random unique.",
            "Metrics.",
            "Like when you do, we want to do random beamforming.",
            "Then we can still do things about it.",
            "Claire OK. You can also turn this T and all random and independent of the of the X matrix.",
            "For instance, will be in a multiple access channel.",
            "the T will be the distance from every of every users and like the path knows, you can have like a distribution of all the path losses so that you can figure what is the capacity of a network you know your multi cell system.",
            "We configure the capacity by adding distribution of everything.",
            "OK, the rest.",
            "It's important.",
            "So let."
        ],
        [
            "Just give you 2 examples."
        ],
        [
            "I don't know.",
            "That"
        ],
        [
            "Simple, but."
        ],
        [
            "At the end, mission, if it's with you doing.",
            "Close or maybe not so interesting is this DNA is not so big, so just just because it will be easy to understand, but I think the case of a system with random uplinks VM."
        ],
        [
            "So now I hope it's going to be a bit more concrete.",
            "So we have an uplink TDMA system, so I have a given number of users.",
            "They will have a code here semacode they will take here for simplicity of the talk I will take random.",
            "So that means that you take a random code for this guy, an independent random code for this guy, meaning the owners offer goal, but kind of almost.",
            "But you can do the same study for oral and the other debit given single path channel.",
            "Again for simplicity and a given power they will use and the question will be.",
            "The question would be, for instance, how do you distribute the powers?",
            "What is the optimal power allocation so that you have a maximum rate of the receiver or maximum rate?",
            "So how do you study?",
            "How do you see the performance of such a system?",
            "Well, you have."
        ],
        [
            "That the receiver so the based issue in that case as a switch that I'm saying things not so minor thing, so you have a given number of.",
            "If it could last days begin.",
            "And we let's assume that so the callback is quite normal and the number of users which is big K will be also quite big.",
            "So what do you do?",
            "PlayStation receives all the sum of over all the channels of the codes of every user multiplied by the power used for transmission and the symbol that the guy will stand up to some noise.",
            "So if you actually put this WK inside the big matrix W. The HP inside diagonal matrices and you can compact all this like that, so it will be.",
            "Really looking like my microchannel here.",
            "OK where the matrix is this one?",
            "So what what people do for in DNA at the base station?",
            "If you want to decode the information?"
        ],
        [
            "User K1 way to do that is to do classical way to do that is to do linear decoding and particulare NSC decoding.",
            "The MSE decoder is the one that will reach the highest sign now.",
            "So an interesting thing to do is to premultiplied signal you receive by this MSE color.",
            "So here's your sign now, so the discussion one or two is equivalent.",
            "USA now and the problem is that your W is zaranda metrics.",
            "And the P House normative mistreated powers.",
            "But at least the edge channel maybe vary in time so well, that's really nice expression.",
            "But how do you fear?",
            "How do you do a lot of that?",
            "I mean, that's how can you characterize the capacity of social systems?",
            "Performance of social system, right?",
            "Turns out that this system is large enough.",
            "This guy can be approximated using our random matrix framework because.",
            "These W. Keiser Vector that is independent of what's inside here.",
            "So we can use our tracing them out and say that this old guy.",
            "Is OK, I recall.",
            "Trace them out.",
            "This old guy is very close to so this quadratic form here is very close to the trace of what's inside.",
            "But again, the tracer was inside.",
            "Looks like as teachers transform because I have metrics minus well before it was minus ZI.",
            "Now is suppressing a square high.",
            "So I just take the minus square.",
            "And so I have that.",
            "Well again during contribution thing.",
            "I have that my."
        ],
        [
            "My original thing, which is my saying now.",
            "Receiver will be very close to this tedious transform of these metrics in this position.",
            "Minus is correct, but this.",
            "Cities transform for this type of metrics.",
            "It's an ID times the something independent and ID is something we've seen a few slides back, so I know that this disease transform is the solution of these fixed point equation and the sort of is a function of these things."
        ],
        [
            "So the performance of my system is very close to this when the dimensions on big.",
            "Well, OK, I can recast this into sums instead of traces.",
            "And so I know.",
            "That might be a sign of my performance will be extremely close when the dimensional out enough to to this power of the transmitter K times and channel variance times these sausages transform.",
            "Which is a deterministic object.",
            "And if I want to look so well, the interest for the training for the base station will be to look at the same rate capacity with some weight capacity is the, so here it will be appearing server capacity.",
            "We just say Mother loves.",
            "Of one person you say now separation.",
            "And this one if I have a distribution for the edge case.",
            "So if this guy is a. Exponential decay really.",
            "Really fitting then I know.",
            "Well, using this."
        ],
        [
            "OK, so in that case it's good.",
            "Israeli fading here it's clear rating then I know that this has even distribution that exponencial minus T so the capacity is exactly disturbed.",
            "Which is deterministic.",
            "OK.",
            "So this term is much more easy to study than the sum of the love of 1 plus this only objects.",
            "So in the object here.",
            "OK so now in some sense."
        ],
        [
            "I have captured due to the fact that system."
        ],
        [
            "Dimensions are kind of large.",
            "Using a lower those numbers on my random matrices, I have captured the Villa in my system into a very simple object which is which is this guy.",
            "So here before for the case of a WGN channel meaning you have no."
        ],
        [
            "No HH equals one.",
            "You have something that's even more deterministic because explicit form so of interest.",
            "When I get the Lucent or Orange and I want to decide what's how many base stations should I put knowing that have 10,000 users there?",
            "Where do I position how many of them one question will be basically how many users per position.",
            "And how many users service station is?",
            "What should be K forgiven end?",
            "And this K / N is my ratio of intimacy and so now that I have a deterministic expression, I can simply plot.",
            "That's what I do here.",
            "Here I can simply plug the evolution."
        ],
        [
            "Four different seas."
        ],
        [
            "So that."
        ],
        [
            "What they call number?",
            "I'm looking to see will be the racial came over and we just sell loading so for different recorders.",
            "So here I should only NSC so the one I was talking about is this one.",
            "ICD evolution as a function of the number of users per per per code.",
            "So I see for instance that here my capacity is maximized.",
            "I can assign Arneson of 10 DB so under an SNL attendee I know that my capacity is maximized here so I should serve.",
            "As many or a bit more users than I use code length.",
            "My my my cell loading will be exactly here and that's something you can find an identically instead of.",
            "Before that you would do it.",
            "You would have done it just by running simulation and figuring what where is the point.",
            "So here instead of having 10,000 Monte Carlo simulations, I have an explicit expression that is extremely close to what's happening in your life.",
            "Hopefully.",
            "OK, and of interest also is.",
            "Let's keep the radio case here what I did."
        ],
        [
            "Instead."
        ],
        [
            "I drew this simulations in."
        ],
        [
            "Blue, so I did those better than multicolor simulations and I compared to the.",
            "Deterministic, what I call deterministic equivalent would be.",
            "But in case, and I assume that the system size is not so big, so I have 16 users, potato chips per code.",
            "And I see that those curves are extremely close to this one, not so much.",
            "But those two are extremely close to one another, and what I have in the works.",
            "What happened here is just standard Edition, so it is clear that when the system is not in the system gets not.",
            "You have a very small variance around are kind of limiting behavior, so we have a small parents and this and a central point.",
            "The average is very well approximated by my Internet equipment.",
            "So again, really do the key message here is they had changed this complicated random system into something that is just boils down into one log of 1 percentage is transformed and that is extremely simple to exploit and stream is simple to exploit when you want to optimize things.",
            "So in particular and if I talk about that, yeah, so that would be the next part of my new system.",
            "We want we will want to maximize."
        ],
        [
            "Find the solution."
        ],
        [
            "Which is finding the optimal recorder for maximizing the mutual information.",
            "So here minus system.",
            "Same thing you have a metric that have the two dimensions and something you will tell me first is that we won't have a system with 10,000 antennas, so we're very fast from Infinity.",
            "But it's also now that believe me for four by four matrices in terms of adding capacity.",
            "So because of the average here.",
            "I would have to be able to be extremely close to the terministic equivalent, so even for small system it works very nicely, so here.",
            "As a result, we good dream like this."
        ],
        [
            "Look at this so it's not in my invoicing and some multiple access channel Mimo Mac so you have.",
            "You have.",
            "A base dishon We were given number of antennas and multiple users.",
            "This guy, they communicate in uplink the base station and each of them has a channel edge, one edge 2 up to HK.",
            "And this channel has statistics.",
            "There will be a Kronecker or Russian whatever.",
            "In that case I consider the Chronicle channel that means.",
            "I have an idea person between and some correlation at the transmitter transmitter and some correlation of the receiver.",
            "And what I can prove so so then I'll cases just cables, well, right?",
            "What I could prove it is that.",
            "This teaches transform of this object of this VN.",
            "Here is very close when the dimensions are kinda big too.",
            "These objects, which is totally deterministic, so I have an identity.",
            "I have my receipt correlation times the parameter Ek plow which is solution of a fixed point equation.",
            "This is here in my God, it's a function of EI itself, a function of.",
            "Eva, so it seems a bit complicated.",
            "Again, when you do that, you could truth that just take EI equals zero.",
            "You iterate what it gives you, put it back in here you're going to look like 10 times and you have the convergence.",
            "You can prove the convergence for sure, so it's kind of nice because that's a very symmetrical structure.",
            "Here you have a positive transmission.",
            "And he reports on reception you'll be asked if, where and hear that easy if we actually meet the receive side, you can isolate them somehow, although obviously the irony eyeball kind of missing the whole thing.",
            "And so I have this result.",
            "Remember now that So what in particular because of what we already.",
            "So for the CDM, in case if you look at the base station was doing MSD coding.",
            "Then you would have this MSE colder here and do the performance of these MSE pre coder will be given by the term of the diagonal of the correlation times this guy.",
            "In some sense.",
            "Kind of interesting this EI is capturing the assigner.",
            "OK, so you're saying that the output of the MSE receiver, so this weird fixed point thing is actually excited now.",
            "Hey I was OK.",
            "Skip that.",
            "It's just to improve."
        ],
        [
            "View that this can be done in a few lines, and it's not so complicated.",
            "I can find my dependency prevent something.",
            "I prove you can be found in a few lines above.",
            "So feeling."
        ],
        [
            "At this stage, but it's only one state.",
            "OK, so now remember that.",
            "Well I'm interested into the capacity that is log."
        ],
        [
            "Bad thing.",
            "Recipe for this interval of nothing is, as I mentioned, the integral of the cities transform and the cities transform.",
            "Is this thing with the fixed point equation so that you could prove you can prove you can find any tool for that.",
            "Actually it is something you do better playing with the hands which is your finger.",
            "What should be your derivate?",
            "An auction doesn't work, so you you try again today, right?",
            "So at some point it's exactly what you need, so it's not so.",
            "It's not rocket science here.",
            "Mystic, but still so well.",
            "The reason why it's not so difficult to figure is that the CDs transform is.",
            "Is a trace of an inverse so insecure it's an inverse 1 / X, so obviously what should be an issue and it should be a log of X.",
            "So that's why you figure that should be a lot of the same guide.",
            "You derivate and you obtain the trace etc.",
            "So here what I have is that.",
            "My expectation of the.",
            "Maybe maximum rate so you know in the one single user case will be this one without that hearing between education is very close to this object.",
            "Objects which doesn't seem to be so nice, or what's the point?",
            "And actually, the point is when you want to do precoding.",
            "So when now introduce this Q thing in the middle.",
            "Well, my transmit correlation becomes a translate times.",
            "Sorry my aunt in apparition at the transmission becomes an expiration times the translate correlation could be audited.",
            "Single correction.",
            "So now I jumped from T2 TPT.",
            "Go to TP OK and now the question is.",
            "As I said at the very beginning of the lecture, finding the Supreme metaphor for well known speed.",
            "Sorry, so sorry for Q of this subject is very difficult.",
            "And can you?",
            "Find instead because well, we can install this one.",
            "But can we solve this one?",
            "That is finding the P that maximizes this object?",
            "Now there is no expectation there is no X matrix.",
            "Random thing, there's only the correlation in the T correlation and these demonistic P. We find a P that maximizes that.",
            "It seems difficult because obviously.",
            "Well, he only appears in this term.",
            "So it seems easy to derivate along P. But the problem is that Ek Bar and Ek have somewhere deep inside because the fixed point.",
            "Well, it turns out something magical appears, so that's why that's why we love mathematics.",
            "Something magical appears, which tells you that.",
            "If you very late differentiator in this expression, partially along the YKK bar, it gives you 0.",
            "There are different mental reason is that if I derivate passion, you don't keep up.",
            "This guy becomes a one event race of the same thing minus one.",
            "And here I have another cable which when I do it gives me Ek.",
            "But but this one of the interesting thing here is exactly the definition of Ek.",
            "So when I do this minus UK gives me 0.",
            "OK, so when I dare made along the fixed point things, it gives me 0 all the time.",
            "So what it both times is saying is that they are very thing around.",
            "PK is equivalent to only there impartially PK.",
            "Fixing to the cake is up.",
            "Whatever in the end he's just bugs and saying we need to maximize this expression.",
            "OK, without use we've now not looking into the other two, but but that is simple.",
            "'cause this is known for a long time to be a solution of that, to be water feeling.",
            "How do you find the P that maximizes love that well?",
            "You also feel on T. OK, I'll look for this.",
            "Yes, he called water filling results for the minor system back to tower in 99.",
            "This would be this would be the solution.",
            "99 Oh yeah.",
            "And and that's what I said.",
            "Up to some small thing, which is that my water feeling has to be on tee times Ek.",
            "Quick facts, not so since Ek is a function of P itself, it's not a water feeling between iterative water filling, which is I take P equals identity.",
            "I find in cake I want to feel it gives me a new Ek.",
            "I wouldn't feel again and then I'm going to look like this.",
            "I cannot prove the convergence.",
            "Apparently I was told back to days ago that sometimes doesn't converge.",
            "But well, for me it has always worked, so they must have found something tricky."
        ],
        [
            "So, so I have a lot of cleaning solution.",
            "So what I say, but I've just stated, is that this problem I cannot solve it explicitly is kind of hard because I need to do this convex optimization thing so so the capacity of the Ebony capacity of MIMO channel forgiven distribution of age is not easy to figure, but if I approximate this thing by you deterministic equivalent, I can solve the deterministic program part.",
            "And it turns out that you can prove, obviously because of convexity of the province.",
            "Since you have a complex problem for the first one, and complex or concave plan for the first one came for the second one you found you found the maximum and on the 2nd and the two are getting close to one another.",
            "So obviously the the pre-order gets close to the other one.",
            "Which means that no, I'm back to.",
            "I get the Lucent.",
            "I'm at the Lucent.",
            "I know what other statistical the channel in my in my network.",
            "Then I can anticipate what what I should tell the users to to use a precooler so that the capacity of the network is increasing.",
            "So this is in my most setting multiple vinyl Max setting.",
            "I could do that for and we did that for broadcast Channel 4 channel with multi style channels will be interference.",
            "There's a bunch of things we can do and for instance you can say or there's something I already mentioned you using those tools you configure forgiven network topology where you should put the base stations.",
            "What should be the good precoding strategy to use, what information you should feedback.",
            "Princess in broadcast channel.",
            "If you were aware of that, there's a big issue, which is if the pre order.",
            "It is the transmitter must translate to different users on the same day and then obviously if you don't know the channel you will be eating well, you will spread.",
            "You will spread the interference to all the users because you're sending this note from before.",
            "If I sent it to users since you answer you.",
            "If I spread the message without knowing what is the channel and you will receive the message for the two, you will receive the message for the two.",
            "So you will have a big interference between broadcast.",
            "How it doesn't work like this broadcast.",
            "Each other channels feedback.",
            "She's a channels, take information and once I know that I can do this strategy that such as zero forcing which is I I make sure that recording function so that when you receive it on your channel you get your one your information and when I sent you through your channel you get all your information.",
            "And but obviously that means you have a lot of feedback, and if I move very fast then I need feedback a lot and I don't have time to transmit.",
            "So there is a question.",
            "How long should I train so that I have an imperfect channel state information and how long should I transmit so that the capacity is maximized and that is difficult again, because depending on the channel metric or under the channel distribution I don't know.",
            "I have to simulate, but here with those tools I can actually anticipate that so I can know.",
            "How long I should wait so just by taking some statistics on the channels, I can say a lot of things so I can also put the base stations at the right position I could do.",
            "Nowadays we have small cell networks that will be, you know, space station, put in there, on the lamppost, everywhere in the street.",
            "One thing that people anticipate to do is to do 3D informing.",
            "That is the story, and then that's eating which is the base station we look at you looking in One Direction or or look at least at few users somewhere while another one is also playing on the same frequency so you have interference.",
            "So how do you manage that?",
            "It's very difficult, so these tools can do that.",
            "They can tell you with basic simulation science, well, it's not convex.",
            "It's difficult to solve, but still you don't have to Monte Carlo.",
            "Simulations of all possible efforts in your network to figure what should be good.",
            "Just ready for transmission.",
            "OK. And I think, well, that's another result with the way I could do it here so that."
        ],
        [
            "New case of where the channel has.",
            "As.",
            "Uh.",
            "Line of sight component.",
            "That is, we also have resources and we have to adopt that equipment also.",
            "So many work had been done by this team."
        ],
        [
            "France.",
            "Well, we can do the same thing as I was mentioning when when instead of."
        ],
        [
            "I matrix graph.",
            "You need to remit uses, so it's useful for random informing.",
            "It's just a good smile works this way pretty from this side, and also because it's kind of."
        ],
        [
            "Funny in the sense that I have done right before I was explaining the model where W was replaced by tax ID.",
            "Now it's a rent it's unitary matrix, so random unitary in terms of this amazing equivalence.",
            "So the fundamental equations here all exactly the same, but for small addition here.",
            "So did the previous case with the one without this, and now we screwed this thing.",
            "Turning from ID to two unitary, which is totally different, gives you something that extremely equivalent in something you can optimize every color with.",
            "This structure is here, which is again.",
            "Again.",
            "Magic of mathematics.",
            "OK, and I think I will stop here and make a break if it's fine with you, I guess it will be fine with you."
        ],
        [
            "Should I?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Site, picture tutorial randomly.",
                    "label": 0
                },
                {
                    "sent": "Would like to welcome more quickly.",
                    "label": 0
                },
                {
                    "sent": "Is the nature today.",
                    "label": 0
                },
                {
                    "sent": "But I also want to welcome especially the external guests from Vienna.",
                    "label": 0
                },
                {
                    "sent": "As far as I have seen.",
                    "label": 0
                },
                {
                    "sent": "How long this is a event jointly organized by the Institute of Communications, Engineering and RF Systems, together with the IEEE Joint, Empty question chapter and together with your consent of competence.",
                    "label": 0
                },
                {
                    "sent": "Like pink around.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "The topic of today.",
                    "label": 0
                },
                {
                    "sent": "The introduction of the speaker.",
                    "label": 0
                },
                {
                    "sent": "Communications.",
                    "label": 0
                },
                {
                    "sent": "Systems Ericsson.",
                    "label": 0
                },
                {
                    "sent": "Preparing speech.",
                    "label": 0
                },
                {
                    "sent": "And he graduated from speech Team 2010 and he is currently assistant Professor Jia System Science Project Challenge.",
                    "label": 0
                },
                {
                    "sent": "Research topics, information theory, signal processing, complex system and of course, random matrix theory, which is the topic for today.",
                    "label": 0
                },
                {
                    "sent": "Just have to switch to.",
                    "label": 0
                },
                {
                    "sent": "Nice, this is recorded.",
                    "label": 0
                },
                {
                    "sent": "Can be downloaded.",
                    "label": 0
                },
                {
                    "sent": "These weeks for my language.",
                    "label": 0
                },
                {
                    "sent": "So thank you for the invitation.",
                    "label": 0
                },
                {
                    "sent": "Some people beautiful day.",
                    "label": 0
                },
                {
                    "sent": "Sorry dude.",
                    "label": 0
                },
                {
                    "sent": "Maybe I should mention that I do some short introduction of super leg so super cool one of those so called chronicled in France.",
                    "label": 0
                },
                {
                    "sent": "So kind of although it's called because the tiny school 300 students dedicated to engineering studies in electricity talk engineering related topics.",
                    "label": 0
                },
                {
                    "sent": "So in particular we have a group wanted.",
                    "label": 0
                },
                {
                    "sent": "Education senior processing.",
                    "label": 0
                },
                {
                    "sent": "Energy automatics.",
                    "label": 0
                },
                {
                    "sent": "And in particular, did my PhD within groups somewhat connected to the?",
                    "label": 0
                },
                {
                    "sent": "Communication Department which is the Alcatel Lucent shares.",
                    "label": 0
                },
                {
                    "sent": "Different entity who dis entities working with connective radios.",
                    "label": 0
                },
                {
                    "sent": "And so I did my my PSU Amanda Matrix theory full for connective radios, so the topic today will be random matrices, so I said in wireless flexible networks I should maybe say these both wireless communications an important signal processing.",
                    "label": 1
                },
                {
                    "sent": "So since I know that there are quite a few people doing.",
                    "label": 0
                },
                {
                    "sent": "Radar detection and the subspace methods will be interested in part of the talk.",
                    "label": 0
                },
                {
                    "sent": "That will be OK to signal processing, so half of it will be communication related to information theory.",
                    "label": 0
                },
                {
                    "sent": "And the other half of it will be.",
                    "label": 0
                },
                {
                    "sent": "Signal processing, so the key motivations stop that.",
                    "label": 0
                },
                {
                    "sent": "The chemo divisions for each area so that the one for information theory the question is.",
                    "label": 0
                },
                {
                    "sent": "Since nowadays we have those complicated networks where you have multiple antennas at the base stations you have multiple self interference, multiple users using the same bandwidth.",
                    "label": 0
                },
                {
                    "sent": "How can you study the performance of search networks and how can you optimize it?",
                    "label": 0
                },
                {
                    "sent": "Knowing that is inherently filled with random randomness because everyone is moving, the channels are have different probability distribution and very simplistic programs such as.",
                    "label": 0
                },
                {
                    "sent": "Just do the capacity evaluation of such networks or kind of become quickly intractable.",
                    "label": 0
                },
                {
                    "sent": "In particular when you have for multiple antennas, multiple users, and because complex in particular, if I have a very simple channel like mine, more structure where I have.",
                    "label": 0
                },
                {
                    "sent": "Minor transmission.",
                    "label": 0
                },
                {
                    "sent": "How to receive a reason and with the given number VN antennas the transmitter is Max with slow and I should call this one W, then small then.",
                    "label": 0
                },
                {
                    "sent": "Dennis and my atheism, my Mood channel, which has a given probability distribution.",
                    "label": 0
                },
                {
                    "sent": "Then we know that of interest would be the capacity of this channel, which is.",
                    "label": 0
                },
                {
                    "sent": "In the organic sense, with the Superman over the pre chorus queued.",
                    "label": 0
                },
                {
                    "sent": "Forex being Russian distributed.",
                    "label": 0
                },
                {
                    "sent": "If I called you the covariance matrix of my transferring signal, then I'm interested into this type of quantity.",
                    "label": 0
                },
                {
                    "sent": "So the expectation of load contaminants.",
                    "label": 0
                },
                {
                    "sent": "All I know is this called Ruby.",
                    "label": 0
                },
                {
                    "sent": "It's enough information.",
                    "label": 0
                },
                {
                    "sent": "It's cute.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Solving this is not is not trivial, so you cannot.",
                    "label": 0
                },
                {
                    "sent": "Actually, we cannot find it.",
                    "label": 0
                },
                {
                    "sent": "So some solution for this Q that will reach these.",
                    "label": 0
                },
                {
                    "sent": "That will reach the capacity with everything capacity of the job.",
                    "label": 0
                },
                {
                    "sent": "So what so far people note is that if you do, the problem is convex in queue, so that we should do convex optimization.",
                    "label": 0
                },
                {
                    "sent": "You can find your key given, so the expectation is obviously on the distribution on edge to edge of statistical distribution.",
                    "label": 0
                },
                {
                    "sent": "And when I want to find this capacity so far we only got so far 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "We only knew that convex optimization problems could control that.",
                    "label": 0
                },
                {
                    "sent": "And here what we will do is something different.",
                    "label": 0
                },
                {
                    "sent": "We will say that if the small end and weekend are sufficiently large, so let's say bigger than one, that's the bigger than one, then it turns out that this I for some good distributions of age, will be close to something that would pull high bar closing the center.",
                    "label": 0
                },
                {
                    "sent": "The difference goes to zero and goes.",
                    "label": 0
                },
                {
                    "sent": "You go to infinite while the ratio between big and small end is so constant, that is not trivial Sisneros, but infinite.",
                    "label": 0
                },
                {
                    "sent": "And this quantity here will have the interesting property of being teacher ministik.",
                    "label": 0
                },
                {
                    "sent": "Well, I is also deterministic, but it won't depend on an expectation of some probability distribution.",
                    "label": 0
                },
                {
                    "sent": "So this terministic object on which we can optimize the queue that maximizes the server.",
                    "label": 0
                },
                {
                    "sent": "And in this sense, we can find a close kind of closed form solution that gives us the big good approximation of the capacity.",
                    "label": 0
                },
                {
                    "sent": "So that's the motivation from the communication file from the signal processing part.",
                    "label": 0
                },
                {
                    "sent": "So in the end, the important aspect of random matrix theory is that actually allows dimensional random matrix theory.",
                    "label": 0
                },
                {
                    "sent": "Is that these?",
                    "label": 0
                },
                {
                    "sent": "Dimensions on both large and their issues.",
                    "label": 0
                },
                {
                    "sent": "Some constants.",
                    "label": 0
                },
                {
                    "sent": "That means if I look at two of the two 2 dimensions in my system, they both form kind of large, but the ratio between the no no one of the trees are dominating the duration junior Twitter account.",
                    "label": 0
                },
                {
                    "sent": "So in signal processing and that's what they will start here in signal processing.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We are interesting into the case where I have.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some I received some steam.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That all vector signals.",
                    "label": 0
                },
                {
                    "sent": "So I will call them W, one WN, etc.",
                    "label": 0
                },
                {
                    "sent": "That's all.",
                    "label": 0
                },
                {
                    "sent": "Each signals of time outside weekend.",
                    "label": 0
                },
                {
                    "sent": "And I will make small and observations of these, and that will be interesting to the case where small and is not large compared to big.",
                    "label": 0
                },
                {
                    "sent": "And so in classical signal processing would assume that you have sufficiently many observations so that lower class members and the central limit theorems comes in, and you use classical statistical properties of these lower numbers.",
                    "label": 0
                },
                {
                    "sent": "So here we will assume that both.",
                    "label": 0
                },
                {
                    "sent": "The small end is not big compared to the hand and we will do something better, right?",
                    "label": 0
                },
                {
                    "sent": "So in particular, well, that's what I'm mentioning.",
                    "label": 0
                },
                {
                    "sent": "If I have a few realizations, quite a few positions of those W Idol ID we were given covariance matrix of that.",
                    "label": 0
                },
                {
                    "sent": "I know from their local members that that this guy could WW operation, so the value is the metrics that collects all the the stacks the current vectors, so it's and then began times smaller matrix then this WW original almost surely will converge to this true covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "Now let's say so.",
                    "label": 0
                },
                {
                    "sent": "But yeah, often is the case.",
                    "label": 0
                },
                {
                    "sent": "Or more and more to do cases we cannot afford N going to Infinity, or at least we can order form.",
                    "label": 1
                },
                {
                    "sent": "And being extremely large compared to big and we should do my new radars and you have not 10 but 2030 antennas.",
                    "label": 0
                },
                {
                    "sent": "Then it becomes maybe come in some cases complicated to have sufficiently many observations.",
                    "label": 0
                },
                {
                    "sent": "So that's more than is very big compared to begin.",
                    "label": 0
                },
                {
                    "sent": "So what happens if?",
                    "label": 0
                },
                {
                    "sent": "What happens if I look at this sample covariance matrix with small end going infinite?",
                    "label": 1
                },
                {
                    "sent": "It's easy to see that every individual entry that's a large numbers for every entry.",
                    "label": 0
                },
                {
                    "sent": "Every individual entry tends to the respective entry of.",
                    "label": 1
                },
                {
                    "sent": "But since I assume it's big in Islam, the rate at which this convergence holes is.",
                    "label": 0
                },
                {
                    "sent": "Maybe so slow that on from an aggregated POV, so the whole matrix does not converge in any matrix known to the ER.",
                    "label": 1
                },
                {
                    "sent": "So in particular, let's look at the eigenvalue distribution.",
                    "label": 0
                },
                {
                    "sent": "So if all is an identity, so it's an identity matrix, I think a few observation of white.",
                    "label": 0
                },
                {
                    "sent": "Of these white signals, then I expect that with a big N, so N equals.",
                    "label": 0
                },
                {
                    "sent": "I think in the next slide, which will be 500 small end being 500, that even if we get is large, I expect that my RN will be close to an identity.",
                    "label": 0
                },
                {
                    "sent": "So if I look at the eigenvalue distribution, I expect you have a direct model.",
                    "label": 0
                },
                {
                    "sent": "This is not the case.",
                    "label": 0
                },
                {
                    "sent": "So if I didn't hear so small answer, it's 2000.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Release number, but began is kind of a big number also and if I look at the eigenvalue distribution of these RN metrics when I sample programs metrics, it's not directing one.",
                    "label": 0
                },
                {
                    "sent": "It will be distributed like this.",
                    "label": 0
                },
                {
                    "sent": "So a way to press yourself is that effectually Smalling was even that began.",
                    "label": 0
                },
                {
                    "sent": "It was bigger than small end, and you necessarily have a deficient rank metrics so necessary you have zero eigenvalues, so it cannot be directly one for sure.",
                    "label": 0
                },
                {
                    "sent": "So in the intermediate case, you'd have a distribution like this.",
                    "label": 0
                },
                {
                    "sent": "A turns out that there's some nice property that arises, which will be a kind of lower class members for endometrosis, which is that the eigenvalue distribution, although it's not directly one, will converge to re converge weakly to some given distribution.",
                    "label": 0
                },
                {
                    "sent": "When I called a matching Costolo.",
                    "label": 0
                },
                {
                    "sent": "So if I look at the eigenvalue distribution, you take those big matrixes so you can do that.",
                    "label": 0
                },
                {
                    "sent": "In simulations began small N being.",
                    "label": 0
                },
                {
                    "sent": "With Rachel 11, before you take the dimension going allows, you will observe that you have Easter and it is there closely matching matching capacity.",
                    "label": 0
                },
                {
                    "sent": "And we will use those properties.",
                    "label": 0
                },
                {
                    "sent": "So obviously depending on the ratio began over small end, the curves of the difference in part.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Either way you have small and very large compared to big and we will get back into this direction one, but you have some flexibility in the mean time in the in the middle I for different ratios an override.",
                    "label": 0
                },
                {
                    "sent": "OK, that's what I'm mentioning.",
                    "label": 0
                },
                {
                    "sent": "Here is.",
                    "label": 0
                },
                {
                    "sent": "Although every and every roll.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks for the color.",
                    "label": 0
                },
                {
                    "sent": "Will give you 1 every wartime so different color will give you a 0.",
                    "label": 0
                },
                {
                    "sent": "The Matrix will look like an identity, but it's clearly not an identity.",
                    "label": 0
                },
                {
                    "sent": "In terms of Agendar distribution at least.",
                    "label": 0
                },
                {
                    "sent": "So that was that was the main order to get to spirit.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What's happening issue?",
                    "label": 0
                },
                {
                    "sent": "Make the mistake of assuming that because small N is big, then you have close approximation of your simple programs.",
                    "label": 0
                },
                {
                    "sent": "Metrics for local trooper, expedited central programs one.",
                    "label": 0
                },
                {
                    "sent": "Let's move to what people did in random matrix theory.",
                    "label": 0
                },
                {
                    "sent": "So now that we understand that it's not so obvious the strings.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People did, so he studies actually quite awhile ago in 1955 for different type of metrics.",
                    "label": 0
                },
                {
                    "sent": "Is such was no simple programs metrics is it was our mission ID metric system.",
                    "label": 0
                },
                {
                    "sent": "Mission ID means I think the upper left upper right part of the metrics.",
                    "label": 0
                },
                {
                    "sent": "I feel it with plus or minus ones or any distribution.",
                    "label": 0
                },
                {
                    "sent": "In fact where those have ID distributions.",
                    "label": 0
                },
                {
                    "sent": "And you copy pasted below, then other seats innovation metrics.",
                    "label": 0
                },
                {
                    "sent": "So the eigenvalue distribution will be real.",
                    "label": 0
                },
                {
                    "sent": "And if you look at very large such matrices and you look at the eigenvalue distribution wiegner, so we know he was interested into that because of nuclear physics, because it's a matrix of skins.",
                    "label": 0
                },
                {
                    "sent": "I'm here with that.",
                    "label": 0
                },
                {
                    "sent": "Evilized you realize that the eigenvalue distribution will be something like this, so they.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Be negative here because it metrics is not.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And turned out to be this so called semi circular So what?",
                    "label": 0
                },
                {
                    "sent": "So what Victor did is that in back in 1950 he said, OK, how do I prove that?",
                    "label": 0
                },
                {
                    "sent": "Well, it's.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's look at the eigenvalue distribution and try to compute all the moments.",
                    "label": 0
                },
                {
                    "sent": "So the moments of the distribution, the first moment is the average of the eigenvalues, so it's nothing more than the average trace of X and metrics.",
                    "label": 0
                },
                {
                    "sent": "Then the 2nd order moment will be the squares of the eigenvalues, which are, which is nothing more than a trace of X squared.",
                    "label": 0
                },
                {
                    "sent": "So it computes the computed all the moments.",
                    "label": 0
                },
                {
                    "sent": "So now to be this cattenom numbers thing.",
                    "label": 0
                },
                {
                    "sent": "And then proving that the moments give you the distributions so that these distribution has these moments.",
                    "label": 0
                },
                {
                    "sent": "So clearly this this distribution, which is a semi circle over if the limiting distribution.",
                    "label": 0
                },
                {
                    "sent": "That's how initially it started with that.",
                    "label": 0
                },
                {
                    "sent": "The problem is that this technique, which consists of looking at all the moments, only gives you successive moments.",
                    "label": 0
                },
                {
                    "sent": "So from there, how do you figure what will be the distribution in this case?",
                    "label": 0
                },
                {
                    "sent": "It was very easy because you look at it and you say OK, looks like assuming so close I just have to do to take a distribution that looks like a screen software and check out the moments correspond.",
                    "label": 0
                },
                {
                    "sent": "But if you only have a moments and you want to figure the distribution, it usually is kind of a tough thing to do, so you need other techniques.",
                    "label": 0
                },
                {
                    "sent": "Here I'm just mentioning another one, which is the full sample.",
                    "label": 0
                },
                {
                    "sent": "Also in my metrics, and now instead of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Techniques are vision.",
                    "label": 0
                },
                {
                    "sent": "I fill it with ID entries plus minus one or Gaussian, whatever.",
                    "label": 0
                },
                {
                    "sent": "Then you can't.",
                    "label": 0
                },
                {
                    "sent": "Then I put the eigenvalues, which I'll never complex because the matrix is no longer duration and those eigenvalue oh actually distributed uniformly on the unit circle so well.",
                    "label": 0
                },
                {
                    "sent": "I need any some scaling.",
                    "label": 0
                },
                {
                    "sent": "Obviously some scaling here so that the eigenvalues don't blow up.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that was small.",
                    "label": 0
                },
                {
                    "sent": "Some some things that were initiated in the past.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The problem is that it's very nice, but when you want to move to more involved metrics models of things that will be more realistic from a signal processing point of view of communication point of view.",
                    "label": 0
                },
                {
                    "sent": "While you cannot use those techniques of looking at moments and trying to figure what will be the distribution, so you need to do something more and for that.",
                    "label": 0
                },
                {
                    "sent": "OK, for that you need you need more info methods.",
                    "label": 0
                },
                {
                    "sent": "So in the powerful mathematical tools.",
                    "label": 0
                },
                {
                    "sent": "So one of them is the free probability framework that I think I want.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Too much time on this because it's not my priority and I don't like it.",
                    "label": 0
                },
                {
                    "sent": "I tried to send my work I mean.",
                    "label": 0
                },
                {
                    "sent": "But yeah, I think it's as some intuition.",
                    "label": 0
                },
                {
                    "sent": "So I'm talking talking.",
                    "label": 0
                },
                {
                    "sent": "So I was mentioning one thing you could so.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One thing you could do is to look at the successive moments of the distribution of the of the random metrics, and sometimes it's enough.",
                    "label": 0
                },
                {
                    "sent": "Sometimes is sufficient to just consider moment, because what you want to look at some value of the trace of powers or whatever, and the question is how do you handle that if you have mattresses.",
                    "label": 0
                },
                {
                    "sent": "So that can be a product of matrices instead of a regular ID.",
                    "label": 0
                },
                {
                    "sent": "Metrics were taken metrics times of deterministic random metrics.",
                    "label": 0
                },
                {
                    "sent": "Damages to Mystic one times another elementary school, also random matrix.",
                    "label": 0
                },
                {
                    "sent": "How do you figure what is the eigenvalue distribution of the whole thing?",
                    "label": 0
                },
                {
                    "sent": "And for that we can use.",
                    "label": 0
                },
                {
                    "sent": "This is kind of interesting thing.",
                    "label": 0
                },
                {
                    "sent": "You can use a kind of classical probability theory of moments and cumulants so you know you may know that in probability theory if you have independent random variables A&B then you can compute the moments.",
                    "label": 1
                },
                {
                    "sent": "If they are.",
                    "label": 0
                },
                {
                    "sent": "I said that they are independent, you can compute the moments of the same based on the moments of the individual vials and if you turn things into Cumulus then you have this property that the components of A+B is committed.",
                    "label": 0
                },
                {
                    "sent": "Variance of a proviso.",
                    "label": 0
                },
                {
                    "sent": "Go to this, etc.",
                    "label": 1
                },
                {
                    "sent": "And there's a link between cumulants and moments.",
                    "label": 0
                },
                {
                    "sent": "The link is just well formula where you take partitions over supplies, all all possible partitions of numbers taken from one to K, so they converted from one to K. You look at all the possible partitions of this set, and while you can, you can use this formula to compute that.",
                    "label": 0
                },
                {
                    "sent": "To make a pile afterwards.",
                    "label": 0
                },
                {
                    "sent": "Problem is now building with mattress is so metrics is on have this problem that 8 * B is not be times a, so there's regular probability theory that you use in the scalar assembles like real numbers or complex numbers doesn't work any longer.",
                    "label": 1
                },
                {
                    "sent": "So you need to come up with something else and some people have a guy called vocalist who created something for lunch.",
                    "label": 0
                },
                {
                    "sent": "To the random variable so uncommitted committed for the product.",
                    "label": 1
                },
                {
                    "sent": "So which is called free probability.",
                    "label": 0
                },
                {
                    "sent": "So in these frameworks I want so in this framework.",
                    "label": 0
                },
                {
                    "sent": "Ren, now we talk about matrices.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So independence would not be enough.",
                    "label": 0
                },
                {
                    "sent": "If you take 2 random matrices that are independent, you won't have results, they have to be much more than that which will be in that case, what we call asymptotically free.",
                    "label": 1
                },
                {
                    "sent": "Which means somehow that you should look at the eigenvectors of.",
                    "label": 0
                },
                {
                    "sent": "If you take the product of A&B and the eigenvectors of a kind of isotropically distributed on the unit sphere, like regression metrics, concussion for Russian ID metrics.",
                    "label": 1
                },
                {
                    "sent": "Music playing on this site by unitary matrix.",
                    "label": 1
                },
                {
                    "sent": "You still have the same distribution, so the eigenvalue the eigenvectors on kind of turning on the space of on the unit sphere see to the end.",
                    "label": 0
                },
                {
                    "sent": "In that case, if you have this property of the eigenvalue distribution, eigenvector distributions or anything, and then the B matrix has also eigenvectors of go somewhere else, then there are some particular free.",
                    "label": 0
                },
                {
                    "sent": "That's how you you need to decorate the matrices in terms of eigenvectors.",
                    "label": 0
                },
                {
                    "sent": "And obviously there has to be independent with respect to their entries.",
                    "label": 0
                },
                {
                    "sent": "So for instance, 2 Goshen matrices are free aggression metric center deterministic metrics are free, so you can do operations on those.",
                    "label": 1
                },
                {
                    "sent": "In that case, what vocalist who came up with this theory that creates three components?",
                    "label": 0
                },
                {
                    "sent": "So the three components are something that looks like that look like the criminals respect moments, but here you don't.",
                    "label": 0
                },
                {
                    "sent": "You have a little change in the partition.",
                    "label": 0
                },
                {
                    "sent": "Thing is almost the same.",
                    "label": 0
                },
                {
                    "sent": "And you have this same thing, the same property that the components of A+B is a criminal.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the freak.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sort of a especificamente, some being so somehow if I give you so, it will be the same for the product.",
                    "label": 0
                },
                {
                    "sent": "So if I give you a gushan metrics and I do want to sorry progression metrics, deterministic one and then another Goshen metrics like credit for all of them and I can figure the eigenvalue distribution of the product base.",
                    "label": 0
                },
                {
                    "sent": "But the moments of this distribution based on the moments of every individual.",
                    "label": 0
                },
                {
                    "sent": "So it gives me some properties of how those matrices are on the 18th.",
                    "label": 0
                },
                {
                    "sent": "As I was saying, I don't like that because it's still the same problem.",
                    "label": 0
                },
                {
                    "sent": "It gives you moments, sometimes moments from letting up.",
                    "label": 0
                },
                {
                    "sent": "We want to get more information on the other distribution if you want to get the distribution itself is not sufficient.",
                    "label": 0
                },
                {
                    "sent": "OK. Just say thank you.",
                    "label": 0
                },
                {
                    "sent": "You can really have a problem between classical moments and.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Free moments.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Slight differences, you have the notion of independence, which is different, but it's called convolution and never look at the distribution of the sum of two random between dependent variables and it will be the convolution of the distributions.",
                    "label": 0
                },
                {
                    "sent": "In that case it will be some new operation that we.",
                    "label": 0
                },
                {
                    "sent": "This is based on the community.",
                    "label": 0
                },
                {
                    "sent": "So you have the same framework somehow in here.",
                    "label": 0
                },
                {
                    "sent": "Essentially Theorem becomes a convergence to a similar problem.",
                    "label": 0
                },
                {
                    "sent": "So you have a new theory of probability that has been carried from scalar case matrix case.",
                    "label": 0
                },
                {
                    "sent": "But again, that's not so much interest for us here, although I will talk a bit about that afterwards.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so the tool I like most and that's more.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or used.",
                    "label": 0
                },
                {
                    "sent": "Install the pros and it will be very useful as machine well, both in communications Anning, senior processing for reasons that will be clear both very soon.",
                    "label": 0
                },
                {
                    "sent": "OK, so let's just be very abstract.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Beginning.",
                    "label": 0
                },
                {
                    "sent": "Let's take a nap that is a distribution function like that's a cumulative distribution function.",
                    "label": 0
                },
                {
                    "sent": "And what I call this tedious transfer mode of F is this integral of one over Lambda minus ZI.",
                    "label": 1
                },
                {
                    "sent": "Pointedly, so these taken anywhere with this guy will exist.",
                    "label": 0
                },
                {
                    "sent": "On this distribution.",
                    "label": 0
                },
                {
                    "sent": "OK, so somehow just see this till just transform as a four year transform within random matrix theory.",
                    "label": 0
                },
                {
                    "sent": "We don't like for your transform.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't work that much, so we will move away from the from the distribution space to another one and this space will be the space of tedious transfer, OK?",
                    "label": 0
                },
                {
                    "sent": "And then similar to free transform, we can come back into the distribution space by by by having an inverse transform, which is that the distribution that has the for the transform MF will be given in density by this formula will take value that is on the complex space you have that you get very close to the real axis by taking why here, going to zero and gives you the.",
                    "label": 0
                },
                {
                    "sent": "In game engineering product that gives you the density.",
                    "label": 0
                },
                {
                    "sent": "Of the distribution.",
                    "label": 0
                },
                {
                    "sent": "This never purely is complex.",
                    "label": 0
                },
                {
                    "sent": "If you take the complex.",
                    "label": 0
                },
                {
                    "sent": "They have a nonzero imaginary cost and you get closer to the real axis and it will give you the density.",
                    "label": 0
                },
                {
                    "sent": "So we care about those changes transforms because, well, we just hit next night.",
                    "label": 0
                },
                {
                    "sent": "If.",
                    "label": 0
                },
                {
                    "sent": "I look at the eigenvalue distribution so my distribution function now is the eigenvalue distribution of.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Even random matrix, but I could extract then it's not difficult to see if X is our mission.",
                    "label": 1
                },
                {
                    "sent": "Sorry, that's an admission metrics that accent if you direct diagonal license then it's clear that one over any trace of this diagonal minus the minus one is exactly this son of one over eigenvalue minors.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So my message is transformed is something that looks like this trace of the inverse of this metrics and This is why I like to just transforms, because when I will play around with metric system I will have inversion lemmas, classical matrix inversion, Ms they will come up very often.",
                    "label": 0
                },
                {
                    "sent": "OK, and well, something interesting also or not so much actually is that.",
                    "label": 1
                },
                {
                    "sent": "Interesting respect to what I was saying before is the fact that this eigenvalue distribute this so studious transform is the generating function moment generating function.",
                    "label": 0
                },
                {
                    "sent": "Because you can see by just writing that one minus Lambda is over Z.",
                    "label": 0
                },
                {
                    "sent": "Is this some of the groups?",
                    "label": 0
                },
                {
                    "sent": "There's a DF of Lambda missing.",
                    "label": 0
                },
                {
                    "sent": "Here it is the sum of the Lambda over Z to the power 123 etc then.",
                    "label": 1
                },
                {
                    "sent": "Then you recognize that you have moments so well as a link between those moments in history.",
                    "label": 0
                },
                {
                    "sent": "Um, OK. OK, so thank you.",
                    "label": 0
                },
                {
                    "sent": "How are you feeling?",
                    "label": 0
                },
                {
                    "sent": "I don't want to do a mathematics for this.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Enjoy it is just for you to get the feeling that these changes.",
                    "label": 0
                },
                {
                    "sent": "Transform makes sense.",
                    "label": 0
                },
                {
                    "sent": "We want to use it so will demonstrate very quickly how you get additional professor, because again, if you look only at their moments of the distribution, while it's very nice you have all the moments.",
                    "label": 0
                },
                {
                    "sent": "But how do you figure these curves?",
                    "label": 0
                },
                {
                    "sent": "That's kind of.",
                    "label": 0
                },
                {
                    "sent": "You know it is very difficult to to fit to something to some parametric distribution, and well, doesn't work.",
                    "label": 0
                },
                {
                    "sent": "So we need another way to figure what is this distribution, and that's what machine code.",
                    "label": 0
                },
                {
                    "sent": "N + 2 approved in the 67 so.",
                    "label": 0
                },
                {
                    "sent": "Proof.",
                    "label": 0
                },
                {
                    "sent": "And what they do?",
                    "label": 0
                },
                {
                    "sent": "Following thing so we want to study.",
                    "label": 0
                },
                {
                    "sent": "This teaches transform so we take it should start with the fact that I take an extent metrics that is filled with ID entries so it doesn't need to be Russian or whatever it has just to have.",
                    "label": 0
                },
                {
                    "sent": "Independent and identically distributed entries.",
                    "label": 0
                },
                {
                    "sent": "So if.",
                    "label": 0
                },
                {
                    "sent": "They have zero mean.",
                    "label": 0
                },
                {
                    "sent": "All the entries have zero mean and variance 1 / N, so this one of our ends.",
                    "label": 0
                },
                {
                    "sent": "Just because I want to scale everything otherwise.",
                    "label": 0
                },
                {
                    "sent": "Again they can practice with this clothes.",
                    "label": 0
                },
                {
                    "sent": "And I want to look at the distribution of the eigenvalues.",
                    "label": 0
                },
                {
                    "sent": "So ESD is empirical spectrals, so the eigenvalue distribution of this guy which I know, will congressional discussion progressed.",
                    "label": 0
                },
                {
                    "sent": "So since I've been looking at stitches transformed, I will be interested into this object XX or mission wenzi today, minus to minus one.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not I do is I will take my accent and then we'll just take the first rule of it's an isolated from the rest.",
                    "label": 1
                },
                {
                    "sent": "So those two independent.",
                    "label": 0
                },
                {
                    "sent": "And then we'll start to do some matrix inversion lemma, so if I so here I'm just rewriting what's inside like this.",
                    "label": 1
                },
                {
                    "sent": "So this wire mission, multiplied by its corresponding exenteration will give me a wire mesh y -- Z because of his C and well, we have other terms and I will be interested into this first term on the left upper left part.",
                    "label": 0
                },
                {
                    "sent": "And by just using a matrix inversion MSO in particular, this display Mother tells you that for block matrix like this you have this inversion formula.",
                    "label": 0
                },
                {
                    "sent": "I only look at this guy, so the entry 11.",
                    "label": 0
                },
                {
                    "sent": "It turns out that this is given by this, which due to the.",
                    "label": 0
                },
                {
                    "sent": "Yeah, which which well do this inversion lemma will give me something which is the inverse of sum, or something that looks like this.",
                    "label": 1
                },
                {
                    "sent": "Why's it up interest?",
                    "label": 0
                },
                {
                    "sent": "Because now we start to recognize already the same structure both on the left and on the right here.",
                    "label": 0
                },
                {
                    "sent": "OK, this guy is almost the same, you just it just has one color removed.",
                    "label": 0
                },
                {
                    "sent": "But since we're going to Infinity one column less will be something like almost the same thing.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So far we don't want to have this quadratic forms for this projection of Y over these metrics we want to work to have a trace because we want this to transform, but it will turn out that we have these from dental.",
                    "label": 0
                },
                {
                    "sent": "During that I called that race in work that tells me that if I have an egg.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Vector with ID entries with various 1 / N so remember that the model over weekend or one of our small ends.",
                    "label": 0
                },
                {
                    "sent": "Kind of the same thing.",
                    "label": 0
                },
                {
                    "sent": "'cause this scale is saying.",
                    "label": 0
                },
                {
                    "sent": "Then at least I * A matrix AN that has its larger second value that cannot explode, kind of contained.",
                    "label": 0
                },
                {
                    "sent": "Then this difference between this one and the trace it goes to 0.",
                    "label": 0
                },
                {
                    "sent": "Very easy to see in expectation.",
                    "label": 0
                },
                {
                    "sent": "Should take the expectation here.",
                    "label": 0
                },
                {
                    "sent": "All the cross product disappear, so whatever is outside the diagonal of a N will disappear.",
                    "label": 0
                },
                {
                    "sent": "Now to prove it in a normal way you have to go a bit deeper, but you can prove that.",
                    "label": 0
                },
                {
                    "sent": "Can you project those independent variables on the end, it's almost that race again.",
                    "label": 0
                },
                {
                    "sent": "Bing that case what I had before here.",
                    "label": 0
                },
                {
                    "sent": "I can replace it by the trace, because why is independent of this wiring?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In life.",
                    "label": 0
                },
                {
                    "sent": "OK, because it's a it's a column that I have isolated from the rest and the entries of the matrix.",
                    "label": 1
                },
                {
                    "sent": "So independent so I can use my lemma and say that this guy will be approximately equal where approximately equal means for large dimensions.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To this to this thing, and here I recognize almost the stitches transform.",
                    "label": 0
                },
                {
                    "sent": "Well here I have access permission now where?",
                    "label": 0
                },
                {
                    "sent": "Kind of X permission X.",
                    "label": 0
                },
                {
                    "sent": "Date change, but it doesn't really matter because OK, we'll see that afterwards.",
                    "label": 0
                },
                {
                    "sent": "So do you all the difference.",
                    "label": 0
                },
                {
                    "sent": "Obviously that here is X, and here it's why.",
                    "label": 0
                },
                {
                    "sent": "But we figure that the trace of a matrix.",
                    "label": 0
                },
                {
                    "sent": "With one rank removed, one rank column removed shouldn't be much different from the same without with the with the column hide it does something that we also have.",
                    "label": 0
                },
                {
                    "sent": "We have another level that tells us that if I have a metrics B minus the minus one and I had to rank one for.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Vision, then, is almost the same and it's getting one of them.",
                    "label": 0
                },
                {
                    "sent": "So again, I can replace my wire vision, Wi-Fi Exhibition X and then I recognize these teachers transform.",
                    "label": 0
                },
                {
                    "sent": "I see the details of moving from exclamation next week, the opposite.",
                    "label": 0
                },
                {
                    "sent": "But in the end, this is the case for the entry 1 one, but since my magic is very symmetric, this I could have done for any of the entries in fact, or something you have to prove rigorously, but it makes sense that entry 1 one or two, two it's all the same and you see that these results here is independent of the choice of the entry.",
                    "label": 0
                },
                {
                    "sent": "So that if I take you some over those, so I think the trace of that and I normalize it, I should get the same reason I have the same result.",
                    "label": 0
                },
                {
                    "sent": "Which is what I say here, so hopefully this switch up, exclamation, exclamation vaccination, age.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I've had in the end that.",
                    "label": 0
                },
                {
                    "sent": "My normalized race is almost something approximately equal to 1 over, while the same thing is whether I pulled an F is in fact.",
                    "label": 0
                },
                {
                    "sent": "Why is this like this trace?",
                    "label": 0
                },
                {
                    "sent": "OK, so it's just an object, so in the end I have on the right and on the left.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same objects, but like MF almost equal to 1 over something with.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Skier that this will be a second order for the normal.",
                    "label": 0
                },
                {
                    "sent": "And then I couldn't solve it.",
                    "label": 0
                },
                {
                    "sent": "And so I have my stitches transform given exactly by this function.",
                    "label": 0
                },
                {
                    "sent": "Now since I have to do the inversion formula from this transform to the to the to the distribution, I can find the distribution and that's exactly my Russian capacitors.",
                    "label": 0
                },
                {
                    "sent": "OK, so thanks to those matrix inversion Members using this stitches transform helps me how to get to do the full distribution.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So based on that we can do much more.",
                    "label": 0
                },
                {
                    "sent": "So not only these.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "X exhibition, but now I can introduce AT metrics in between.",
                    "label": 0
                },
                {
                    "sent": "I could determine istic one.",
                    "label": 0
                },
                {
                    "sent": "And we have the same kind of results and reproduces the similar proof that, say, an we have now.",
                    "label": 0
                },
                {
                    "sent": "That so if when the dimensions go lost my matrix tiene hasn't given eigenvalue for limiting and very distribution then I can find the distribution of my BN.",
                    "label": 0
                },
                {
                    "sent": "This guy has a limit and this limit is characterized by stitches transform but unfortunately in that case I don't have an explicit solution.",
                    "label": 0
                },
                {
                    "sent": "I haven't known most will have an implicit solution, which is that this transformer.",
                    "label": 0
                },
                {
                    "sent": "F is the is the fixed point solution of this.",
                    "label": 0
                },
                {
                    "sent": "OK, so you remember before we had like these six points, this one equals one over something of this kind.",
                    "label": 0
                },
                {
                    "sent": "Well, we could pass this guy on the left.",
                    "label": 0
                },
                {
                    "sent": "Now we can.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So we know that this situation is the solution of this fixed point equation, where.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "FT Here is the eigenvalue distribution of limiting eigenvalue distribution of the T and metrics.",
                    "label": 0
                },
                {
                    "sent": "So you take your key metrics you as soon as kind of growing large because limiting distribution, then what is your limiting distribution of XTX?",
                    "label": 0
                },
                {
                    "sent": "It will be this F with stitches.",
                    "label": 0
                },
                {
                    "sent": "Transform is given by that.",
                    "label": 0
                },
                {
                    "sent": "So I will give an example.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Well, these guys many interests so back to what I was saying at the very beginning.",
                    "label": 0
                },
                {
                    "sent": "This case is exactly summarized here, so if I have, well, we'll see later, though that's positive I have edge Q edgeware, curious, deterministic.",
                    "label": 0
                },
                {
                    "sent": "Because he will be independent of age.",
                    "label": 0
                },
                {
                    "sent": "Then I have exactly this setup where I XTX so well we already see somehow the link here.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And in signal processing, well if instead of XTX I look at the contrast one, which is this one T 1/2 exhibition XT 1/2, then this is a sample covariance matrix.",
                    "label": 0
                },
                {
                    "sent": "OK of vectors.",
                    "label": 0
                },
                {
                    "sent": "So extending the metrics that correlate 61X2X3 etc that all have the same covariance Tien.",
                    "label": 0
                },
                {
                    "sent": "So now.",
                    "label": 0
                },
                {
                    "sent": "I tell you what is the covariance matrix and I can get the distribution of of the eigenvalues of the sample programs.",
                    "label": 1
                },
                {
                    "sent": "And of interest in the second part of the lecture here will be to say how do you do in France with that.",
                    "label": 0
                },
                {
                    "sent": "But now I want to do the opposite.",
                    "label": 0
                },
                {
                    "sent": "I see I'm in value.",
                    "label": 0
                },
                {
                    "sent": "This repository I see sample programs metrics.",
                    "label": 0
                },
                {
                    "sent": "What can I tell about the true programs measures?",
                    "label": 0
                },
                {
                    "sent": "But now I cannot say as before that the limiting one is the same.",
                    "label": 0
                },
                {
                    "sent": "It doesn't work in order, so I have to be able to say some things here, and that's what we're going to see the second part.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this one is very fundamentals, be improved by Silverstein, volume 95.",
                    "label": 0
                },
                {
                    "sent": "And we will come back to that very often.",
                    "label": 0
                },
                {
                    "sent": "Something I should notice here.",
                    "label": 0
                },
                {
                    "sent": "So well then no two ways to denote that first, because here if.",
                    "label": 0
                },
                {
                    "sent": "The distribution of of tea.",
                    "label": 0
                },
                {
                    "sent": "This FT is the eigenvalue solution of Tien.",
                    "label": 1
                },
                {
                    "sent": "So here T / 1 + T something is kind of a trace of TN times the inverse of tiendas.",
                    "label": 0
                },
                {
                    "sent": "And the other thing I want to mention is that.",
                    "label": 0
                },
                {
                    "sent": "OK, by doing some manipulation it's kind of clear that this could be written as vestiges transform also of teeth, so we have kind of a link between the Steelers transform of Tianda solutions to model.",
                    "label": 0
                },
                {
                    "sent": "And this is how we do statistical inference so young PC paid a bit, but well will happen is that if you had any information on the observation which will be this transfer the ETH metric, the F distribution, then what can you say about the.",
                    "label": 0
                },
                {
                    "sent": "The distribution of the teeth, so the true covariance matrix?",
                    "label": 0
                },
                {
                    "sent": "How do you have a link here?",
                    "label": 0
                },
                {
                    "sent": "The district is transformed into.",
                    "label": 0
                },
                {
                    "sent": "Will be here later.",
                    "label": 0
                },
                {
                    "sent": "Show you the.",
                    "label": 0
                },
                {
                    "sent": "Things were so I was mentioning that we have.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Given by the solution of this given by the fact that this is transforming the solution of these sticks.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How can we get F?",
                    "label": 0
                },
                {
                    "sent": "Well, exactly like I said you take this email generating part of the Seas transform when Y is very close to 0.",
                    "label": 0
                },
                {
                    "sent": "So what?",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I do.",
                    "label": 0
                },
                {
                    "sent": "I do is I. I take the X axis.",
                    "label": 0
                },
                {
                    "sent": "That will be the PDF of.",
                    "label": 0
                },
                {
                    "sent": "So what I call F of X. I take X + X + I times and this unit is very small.",
                    "label": 0
                },
                {
                    "sent": "And for each 4 inches equals experts I accident.",
                    "label": 0
                },
                {
                    "sent": "I sold this fixed point equation so this one I find the M that solve this thing.",
                    "label": 0
                },
                {
                    "sent": "You can prove that the algorithm that solves that is a very trivial and converges all the time.",
                    "label": 0
                },
                {
                    "sent": "And it will give me the first point at X = 0, then a second one further one and I go like this.",
                    "label": 0
                },
                {
                    "sent": "And it will give me my distribution.",
                    "label": 0
                },
                {
                    "sent": "OK, by taking action sufficiently small you will get something very, very close to 0 here, and that will give you the full distribution.",
                    "label": 0
                },
                {
                    "sent": "So in particular.",
                    "label": 0
                },
                {
                    "sent": "Let's say that the T matrix is a is a matrix filled with like this 1133 cakes.",
                    "label": 0
                },
                {
                    "sent": "So one 30s, once 133 one 30s case and I want to see the entire distribution about that.",
                    "label": 0
                },
                {
                    "sent": "So obviously you again if small hands the number of observations was super large.",
                    "label": 0
                },
                {
                    "sent": "What you see is 3 directs one in one 131K.",
                    "label": 0
                },
                {
                    "sent": "What do you see if both dimensions on kind of the same, it will be exactly this.",
                    "label": 0
                },
                {
                    "sent": "But you can simulate it with Matlab.",
                    "label": 0
                },
                {
                    "sent": "You will get Easter Gram and now if I sold my fixed point equation.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For every X I'll get exactly this profile.",
                    "label": 0
                },
                {
                    "sent": "So I know exactly how it will behave asymptotically.",
                    "label": 0
                },
                {
                    "sent": "So it's interesting because here I took 137.",
                    "label": 0
                },
                {
                    "sent": "You see that we generate blobs.",
                    "label": 0
                },
                {
                    "sent": "Rams those 137.",
                    "label": 0
                },
                {
                    "sent": "And one question that will have the second part of the talk will be once I see this once I see those blogs, how do I figure the 1 three at 7?",
                    "label": 0
                },
                {
                    "sent": "Something like we have, we will have in my examples on transmitters with different powers or we different distances that can be a radar system.",
                    "label": 0
                },
                {
                    "sent": "I want to identify yourself to power sources.",
                    "label": 0
                },
                {
                    "sent": "And what I see after a few samples is by looking at the eigenvalue distribution, those blocks and the question is, where is the source?",
                    "label": 0
                },
                {
                    "sent": "The source will be at a distance 7 here, but.",
                    "label": 0
                },
                {
                    "sent": "I don't know where is the 7 hidden there and if I take obviously the average over the block doesn't work, then the seven is not in the middle.",
                    "label": 0
                },
                {
                    "sent": "So we have to do something more refined and then it gets worse.",
                    "label": 0
                },
                {
                    "sent": "If you don't have enough observations or if 2 powers are very close to one another, and this is something classical numerator when you have from 2 angles very close you have this avalanche effect that semester.",
                    "label": 0
                },
                {
                    "sent": "Another makes it impossible to decide.",
                    "label": 0
                },
                {
                    "sent": "Well here you will have a kind of similar behavior that well in this.",
                    "label": 0
                },
                {
                    "sent": "How do you see that there is 2 values, so we'll see that will get into trouble in that case.",
                    "label": 0
                },
                {
                    "sent": "Um, OK. No, let's get back to communication.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why do we care which is transforming communications?",
                    "label": 0
                },
                {
                    "sent": "Well, because we have an extremely nice property that is.",
                    "label": 0
                },
                {
                    "sent": "You should take this distribution that you have to think of again as a negative value distribution.",
                    "label": 0
                },
                {
                    "sent": "Then the sum of the log of 1 + X Thunder with Mandarin treated like this.",
                    "label": 0
                },
                {
                    "sent": "He can be written as an integral for the function if you wish of the cities transformer that.",
                    "label": 0
                },
                {
                    "sent": "So once you know this, this transform of the distribution, you can get this interval form.",
                    "label": 0
                },
                {
                    "sent": "But what is this integral form?",
                    "label": 0
                },
                {
                    "sent": "If F is the distribution of the eigenvalues of a channel, etc mission, it's exactly this laggy terminum, so my capacity.",
                    "label": 1
                },
                {
                    "sent": "So once I know this is transformed, if I'm able to walk even showing not able to find an integrating for that, at least I have a numerical integral I can solve then then I have an idea on what is the dog that I seen, particularly that means for this random generated logdet thing, I could have an approximation that is deterministic and it is a function that this integral outages transform.",
                    "label": 0
                },
                {
                    "sent": "So it will be equally still true if I put an expectation from privacy.",
                    "label": 0
                },
                {
                    "sent": "So maybe I'll get back to that at the end of the first poll.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things we can do these days now.",
                    "label": 0
                },
                {
                    "sent": "Another thing, so I mentioned these sample programs metrics case we can go for.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Correlation on both sides.",
                    "label": 0
                },
                {
                    "sent": "Were they in that case for signal processing, that means they are linearly corrected curve related signal in time.",
                    "label": 0
                },
                {
                    "sent": "In wireless communications, that will be a Chronicle model for channels with my child H as a left correlation right coalition, and when I multiply right submission it gives me this edge transmission.",
                    "label": 0
                },
                {
                    "sent": "Well, I could have also some external things that's so useful.",
                    "label": 0
                },
                {
                    "sent": "The one that is useful is this one, which is an information personal as well.",
                    "label": 0
                },
                {
                    "sent": "That means you receive noise and you have some deterministic informations.",
                    "label": 0
                },
                {
                    "sent": "I again for music and this kind of thing is super useful for communication.",
                    "label": 0
                },
                {
                    "sent": "It will be a Russian channel, which is you have a line of sight component in your channel and you have the rest of its fading channel you can do.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "OK, frequency selective in cash you have K path channel multipath you consume such such channels.",
                    "label": 0
                },
                {
                    "sent": "And other things one.",
                    "label": 0
                },
                {
                    "sent": "This was the.",
                    "label": 0
                },
                {
                    "sent": "This one which is useful for multiple access channel.",
                    "label": 0
                },
                {
                    "sent": "So everyone you have key users they they all transmit to the base station and the capacity of this system will be characterized by.",
                    "label": 0
                },
                {
                    "sent": "This indicates where everyone's Chronicle model.",
                    "label": 0
                },
                {
                    "sent": "OK anyways, just send this to say that we can do a lot of things that have other models and if the X is now turned into a W or W is not an idea metrics but random unique.",
                    "label": 0
                },
                {
                    "sent": "Metrics.",
                    "label": 0
                },
                {
                    "sent": "Like when you do, we want to do random beamforming.",
                    "label": 0
                },
                {
                    "sent": "Then we can still do things about it.",
                    "label": 0
                },
                {
                    "sent": "Claire OK. You can also turn this T and all random and independent of the of the X matrix.",
                    "label": 0
                },
                {
                    "sent": "For instance, will be in a multiple access channel.",
                    "label": 0
                },
                {
                    "sent": "the T will be the distance from every of every users and like the path knows, you can have like a distribution of all the path losses so that you can figure what is the capacity of a network you know your multi cell system.",
                    "label": 0
                },
                {
                    "sent": "We configure the capacity by adding distribution of everything.",
                    "label": 0
                },
                {
                    "sent": "OK, the rest.",
                    "label": 0
                },
                {
                    "sent": "It's important.",
                    "label": 0
                },
                {
                    "sent": "So let.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just give you 2 examples.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simple, but.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the end, mission, if it's with you doing.",
                    "label": 0
                },
                {
                    "sent": "Close or maybe not so interesting is this DNA is not so big, so just just because it will be easy to understand, but I think the case of a system with random uplinks VM.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I hope it's going to be a bit more concrete.",
                    "label": 0
                },
                {
                    "sent": "So we have an uplink TDMA system, so I have a given number of users.",
                    "label": 0
                },
                {
                    "sent": "They will have a code here semacode they will take here for simplicity of the talk I will take random.",
                    "label": 0
                },
                {
                    "sent": "So that means that you take a random code for this guy, an independent random code for this guy, meaning the owners offer goal, but kind of almost.",
                    "label": 0
                },
                {
                    "sent": "But you can do the same study for oral and the other debit given single path channel.",
                    "label": 0
                },
                {
                    "sent": "Again for simplicity and a given power they will use and the question will be.",
                    "label": 0
                },
                {
                    "sent": "The question would be, for instance, how do you distribute the powers?",
                    "label": 0
                },
                {
                    "sent": "What is the optimal power allocation so that you have a maximum rate of the receiver or maximum rate?",
                    "label": 0
                },
                {
                    "sent": "So how do you study?",
                    "label": 0
                },
                {
                    "sent": "How do you see the performance of such a system?",
                    "label": 1
                },
                {
                    "sent": "Well, you have.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That the receiver so the based issue in that case as a switch that I'm saying things not so minor thing, so you have a given number of.",
                    "label": 0
                },
                {
                    "sent": "If it could last days begin.",
                    "label": 0
                },
                {
                    "sent": "And we let's assume that so the callback is quite normal and the number of users which is big K will be also quite big.",
                    "label": 0
                },
                {
                    "sent": "So what do you do?",
                    "label": 0
                },
                {
                    "sent": "PlayStation receives all the sum of over all the channels of the codes of every user multiplied by the power used for transmission and the symbol that the guy will stand up to some noise.",
                    "label": 1
                },
                {
                    "sent": "So if you actually put this WK inside the big matrix W. The HP inside diagonal matrices and you can compact all this like that, so it will be.",
                    "label": 0
                },
                {
                    "sent": "Really looking like my microchannel here.",
                    "label": 0
                },
                {
                    "sent": "OK where the matrix is this one?",
                    "label": 0
                },
                {
                    "sent": "So what what people do for in DNA at the base station?",
                    "label": 1
                },
                {
                    "sent": "If you want to decode the information?",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "User K1 way to do that is to do classical way to do that is to do linear decoding and particulare NSC decoding.",
                    "label": 0
                },
                {
                    "sent": "The MSE decoder is the one that will reach the highest sign now.",
                    "label": 0
                },
                {
                    "sent": "So an interesting thing to do is to premultiplied signal you receive by this MSE color.",
                    "label": 0
                },
                {
                    "sent": "So here's your sign now, so the discussion one or two is equivalent.",
                    "label": 0
                },
                {
                    "sent": "USA now and the problem is that your W is zaranda metrics.",
                    "label": 0
                },
                {
                    "sent": "And the P House normative mistreated powers.",
                    "label": 0
                },
                {
                    "sent": "But at least the edge channel maybe vary in time so well, that's really nice expression.",
                    "label": 0
                },
                {
                    "sent": "But how do you fear?",
                    "label": 0
                },
                {
                    "sent": "How do you do a lot of that?",
                    "label": 0
                },
                {
                    "sent": "I mean, that's how can you characterize the capacity of social systems?",
                    "label": 0
                },
                {
                    "sent": "Performance of social system, right?",
                    "label": 0
                },
                {
                    "sent": "Turns out that this system is large enough.",
                    "label": 0
                },
                {
                    "sent": "This guy can be approximated using our random matrix framework because.",
                    "label": 0
                },
                {
                    "sent": "These W. Keiser Vector that is independent of what's inside here.",
                    "label": 0
                },
                {
                    "sent": "So we can use our tracing them out and say that this old guy.",
                    "label": 0
                },
                {
                    "sent": "Is OK, I recall.",
                    "label": 0
                },
                {
                    "sent": "Trace them out.",
                    "label": 0
                },
                {
                    "sent": "This old guy is very close to so this quadratic form here is very close to the trace of what's inside.",
                    "label": 0
                },
                {
                    "sent": "But again, the tracer was inside.",
                    "label": 0
                },
                {
                    "sent": "Looks like as teachers transform because I have metrics minus well before it was minus ZI.",
                    "label": 0
                },
                {
                    "sent": "Now is suppressing a square high.",
                    "label": 0
                },
                {
                    "sent": "So I just take the minus square.",
                    "label": 0
                },
                {
                    "sent": "And so I have that.",
                    "label": 0
                },
                {
                    "sent": "Well again during contribution thing.",
                    "label": 0
                },
                {
                    "sent": "I have that my.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My original thing, which is my saying now.",
                    "label": 0
                },
                {
                    "sent": "Receiver will be very close to this tedious transform of these metrics in this position.",
                    "label": 0
                },
                {
                    "sent": "Minus is correct, but this.",
                    "label": 0
                },
                {
                    "sent": "Cities transform for this type of metrics.",
                    "label": 0
                },
                {
                    "sent": "It's an ID times the something independent and ID is something we've seen a few slides back, so I know that this disease transform is the solution of these fixed point equation and the sort of is a function of these things.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the performance of my system is very close to this when the dimensions on big.",
                    "label": 0
                },
                {
                    "sent": "Well, OK, I can recast this into sums instead of traces.",
                    "label": 0
                },
                {
                    "sent": "And so I know.",
                    "label": 0
                },
                {
                    "sent": "That might be a sign of my performance will be extremely close when the dimensional out enough to to this power of the transmitter K times and channel variance times these sausages transform.",
                    "label": 0
                },
                {
                    "sent": "Which is a deterministic object.",
                    "label": 0
                },
                {
                    "sent": "And if I want to look so well, the interest for the training for the base station will be to look at the same rate capacity with some weight capacity is the, so here it will be appearing server capacity.",
                    "label": 0
                },
                {
                    "sent": "We just say Mother loves.",
                    "label": 0
                },
                {
                    "sent": "Of one person you say now separation.",
                    "label": 0
                },
                {
                    "sent": "And this one if I have a distribution for the edge case.",
                    "label": 0
                },
                {
                    "sent": "So if this guy is a. Exponential decay really.",
                    "label": 0
                },
                {
                    "sent": "Really fitting then I know.",
                    "label": 0
                },
                {
                    "sent": "Well, using this.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so in that case it's good.",
                    "label": 0
                },
                {
                    "sent": "Israeli fading here it's clear rating then I know that this has even distribution that exponencial minus T so the capacity is exactly disturbed.",
                    "label": 0
                },
                {
                    "sent": "Which is deterministic.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So this term is much more easy to study than the sum of the love of 1 plus this only objects.",
                    "label": 0
                },
                {
                    "sent": "So in the object here.",
                    "label": 0
                },
                {
                    "sent": "OK so now in some sense.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have captured due to the fact that system.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dimensions are kind of large.",
                    "label": 0
                },
                {
                    "sent": "Using a lower those numbers on my random matrices, I have captured the Villa in my system into a very simple object which is which is this guy.",
                    "label": 0
                },
                {
                    "sent": "So here before for the case of a WGN channel meaning you have no.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No HH equals one.",
                    "label": 0
                },
                {
                    "sent": "You have something that's even more deterministic because explicit form so of interest.",
                    "label": 0
                },
                {
                    "sent": "When I get the Lucent or Orange and I want to decide what's how many base stations should I put knowing that have 10,000 users there?",
                    "label": 0
                },
                {
                    "sent": "Where do I position how many of them one question will be basically how many users per position.",
                    "label": 0
                },
                {
                    "sent": "And how many users service station is?",
                    "label": 0
                },
                {
                    "sent": "What should be K forgiven end?",
                    "label": 0
                },
                {
                    "sent": "And this K / N is my ratio of intimacy and so now that I have a deterministic expression, I can simply plot.",
                    "label": 0
                },
                {
                    "sent": "That's what I do here.",
                    "label": 0
                },
                {
                    "sent": "Here I can simply plug the evolution.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Four different seas.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_61": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What they call number?",
                    "label": 0
                },
                {
                    "sent": "I'm looking to see will be the racial came over and we just sell loading so for different recorders.",
                    "label": 1
                },
                {
                    "sent": "So here I should only NSC so the one I was talking about is this one.",
                    "label": 0
                },
                {
                    "sent": "ICD evolution as a function of the number of users per per per code.",
                    "label": 1
                },
                {
                    "sent": "So I see for instance that here my capacity is maximized.",
                    "label": 0
                },
                {
                    "sent": "I can assign Arneson of 10 DB so under an SNL attendee I know that my capacity is maximized here so I should serve.",
                    "label": 0
                },
                {
                    "sent": "As many or a bit more users than I use code length.",
                    "label": 0
                },
                {
                    "sent": "My my my cell loading will be exactly here and that's something you can find an identically instead of.",
                    "label": 0
                },
                {
                    "sent": "Before that you would do it.",
                    "label": 0
                },
                {
                    "sent": "You would have done it just by running simulation and figuring what where is the point.",
                    "label": 0
                },
                {
                    "sent": "So here instead of having 10,000 Monte Carlo simulations, I have an explicit expression that is extremely close to what's happening in your life.",
                    "label": 0
                },
                {
                    "sent": "Hopefully.",
                    "label": 0
                },
                {
                    "sent": "OK, and of interest also is.",
                    "label": 0
                },
                {
                    "sent": "Let's keep the radio case here what I did.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Instead.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I drew this simulations in.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Blue, so I did those better than multicolor simulations and I compared to the.",
                    "label": 1
                },
                {
                    "sent": "Deterministic, what I call deterministic equivalent would be.",
                    "label": 0
                },
                {
                    "sent": "But in case, and I assume that the system size is not so big, so I have 16 users, potato chips per code.",
                    "label": 1
                },
                {
                    "sent": "And I see that those curves are extremely close to this one, not so much.",
                    "label": 0
                },
                {
                    "sent": "But those two are extremely close to one another, and what I have in the works.",
                    "label": 0
                },
                {
                    "sent": "What happened here is just standard Edition, so it is clear that when the system is not in the system gets not.",
                    "label": 0
                },
                {
                    "sent": "You have a very small variance around are kind of limiting behavior, so we have a small parents and this and a central point.",
                    "label": 0
                },
                {
                    "sent": "The average is very well approximated by my Internet equipment.",
                    "label": 0
                },
                {
                    "sent": "So again, really do the key message here is they had changed this complicated random system into something that is just boils down into one log of 1 percentage is transformed and that is extremely simple to exploit and stream is simple to exploit when you want to optimize things.",
                    "label": 0
                },
                {
                    "sent": "So in particular and if I talk about that, yeah, so that would be the next part of my new system.",
                    "label": 0
                },
                {
                    "sent": "We want we will want to maximize.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find the solution.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is finding the optimal recorder for maximizing the mutual information.",
                    "label": 0
                },
                {
                    "sent": "So here minus system.",
                    "label": 0
                },
                {
                    "sent": "Same thing you have a metric that have the two dimensions and something you will tell me first is that we won't have a system with 10,000 antennas, so we're very fast from Infinity.",
                    "label": 0
                },
                {
                    "sent": "But it's also now that believe me for four by four matrices in terms of adding capacity.",
                    "label": 0
                },
                {
                    "sent": "So because of the average here.",
                    "label": 0
                },
                {
                    "sent": "I would have to be able to be extremely close to the terministic equivalent, so even for small system it works very nicely, so here.",
                    "label": 0
                },
                {
                    "sent": "As a result, we good dream like this.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Look at this so it's not in my invoicing and some multiple access channel Mimo Mac so you have.",
                    "label": 0
                },
                {
                    "sent": "You have.",
                    "label": 0
                },
                {
                    "sent": "A base dishon We were given number of antennas and multiple users.",
                    "label": 0
                },
                {
                    "sent": "This guy, they communicate in uplink the base station and each of them has a channel edge, one edge 2 up to HK.",
                    "label": 0
                },
                {
                    "sent": "And this channel has statistics.",
                    "label": 0
                },
                {
                    "sent": "There will be a Kronecker or Russian whatever.",
                    "label": 0
                },
                {
                    "sent": "In that case I consider the Chronicle channel that means.",
                    "label": 0
                },
                {
                    "sent": "I have an idea person between and some correlation at the transmitter transmitter and some correlation of the receiver.",
                    "label": 0
                },
                {
                    "sent": "And what I can prove so so then I'll cases just cables, well, right?",
                    "label": 0
                },
                {
                    "sent": "What I could prove it is that.",
                    "label": 0
                },
                {
                    "sent": "This teaches transform of this object of this VN.",
                    "label": 0
                },
                {
                    "sent": "Here is very close when the dimensions are kinda big too.",
                    "label": 0
                },
                {
                    "sent": "These objects, which is totally deterministic, so I have an identity.",
                    "label": 0
                },
                {
                    "sent": "I have my receipt correlation times the parameter Ek plow which is solution of a fixed point equation.",
                    "label": 0
                },
                {
                    "sent": "This is here in my God, it's a function of EI itself, a function of.",
                    "label": 0
                },
                {
                    "sent": "Eva, so it seems a bit complicated.",
                    "label": 0
                },
                {
                    "sent": "Again, when you do that, you could truth that just take EI equals zero.",
                    "label": 0
                },
                {
                    "sent": "You iterate what it gives you, put it back in here you're going to look like 10 times and you have the convergence.",
                    "label": 0
                },
                {
                    "sent": "You can prove the convergence for sure, so it's kind of nice because that's a very symmetrical structure.",
                    "label": 0
                },
                {
                    "sent": "Here you have a positive transmission.",
                    "label": 0
                },
                {
                    "sent": "And he reports on reception you'll be asked if, where and hear that easy if we actually meet the receive side, you can isolate them somehow, although obviously the irony eyeball kind of missing the whole thing.",
                    "label": 0
                },
                {
                    "sent": "And so I have this result.",
                    "label": 0
                },
                {
                    "sent": "Remember now that So what in particular because of what we already.",
                    "label": 0
                },
                {
                    "sent": "So for the CDM, in case if you look at the base station was doing MSD coding.",
                    "label": 1
                },
                {
                    "sent": "Then you would have this MSE colder here and do the performance of these MSE pre coder will be given by the term of the diagonal of the correlation times this guy.",
                    "label": 0
                },
                {
                    "sent": "In some sense.",
                    "label": 0
                },
                {
                    "sent": "Kind of interesting this EI is capturing the assigner.",
                    "label": 0
                },
                {
                    "sent": "OK, so you're saying that the output of the MSE receiver, so this weird fixed point thing is actually excited now.",
                    "label": 1
                },
                {
                    "sent": "Hey I was OK.",
                    "label": 0
                },
                {
                    "sent": "Skip that.",
                    "label": 0
                },
                {
                    "sent": "It's just to improve.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "View that this can be done in a few lines, and it's not so complicated.",
                    "label": 0
                },
                {
                    "sent": "I can find my dependency prevent something.",
                    "label": 0
                },
                {
                    "sent": "I prove you can be found in a few lines above.",
                    "label": 0
                },
                {
                    "sent": "So feeling.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At this stage, but it's only one state.",
                    "label": 0
                },
                {
                    "sent": "OK, so now remember that.",
                    "label": 0
                },
                {
                    "sent": "Well I'm interested into the capacity that is log.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Bad thing.",
                    "label": 0
                },
                {
                    "sent": "Recipe for this interval of nothing is, as I mentioned, the integral of the cities transform and the cities transform.",
                    "label": 0
                },
                {
                    "sent": "Is this thing with the fixed point equation so that you could prove you can prove you can find any tool for that.",
                    "label": 0
                },
                {
                    "sent": "Actually it is something you do better playing with the hands which is your finger.",
                    "label": 0
                },
                {
                    "sent": "What should be your derivate?",
                    "label": 0
                },
                {
                    "sent": "An auction doesn't work, so you you try again today, right?",
                    "label": 0
                },
                {
                    "sent": "So at some point it's exactly what you need, so it's not so.",
                    "label": 0
                },
                {
                    "sent": "It's not rocket science here.",
                    "label": 0
                },
                {
                    "sent": "Mystic, but still so well.",
                    "label": 0
                },
                {
                    "sent": "The reason why it's not so difficult to figure is that the CDs transform is.",
                    "label": 0
                },
                {
                    "sent": "Is a trace of an inverse so insecure it's an inverse 1 / X, so obviously what should be an issue and it should be a log of X.",
                    "label": 0
                },
                {
                    "sent": "So that's why you figure that should be a lot of the same guide.",
                    "label": 0
                },
                {
                    "sent": "You derivate and you obtain the trace etc.",
                    "label": 0
                },
                {
                    "sent": "So here what I have is that.",
                    "label": 0
                },
                {
                    "sent": "My expectation of the.",
                    "label": 0
                },
                {
                    "sent": "Maybe maximum rate so you know in the one single user case will be this one without that hearing between education is very close to this object.",
                    "label": 0
                },
                {
                    "sent": "Objects which doesn't seem to be so nice, or what's the point?",
                    "label": 0
                },
                {
                    "sent": "And actually, the point is when you want to do precoding.",
                    "label": 0
                },
                {
                    "sent": "So when now introduce this Q thing in the middle.",
                    "label": 0
                },
                {
                    "sent": "Well, my transmit correlation becomes a translate times.",
                    "label": 0
                },
                {
                    "sent": "Sorry my aunt in apparition at the transmission becomes an expiration times the translate correlation could be audited.",
                    "label": 0
                },
                {
                    "sent": "Single correction.",
                    "label": 0
                },
                {
                    "sent": "So now I jumped from T2 TPT.",
                    "label": 0
                },
                {
                    "sent": "Go to TP OK and now the question is.",
                    "label": 0
                },
                {
                    "sent": "As I said at the very beginning of the lecture, finding the Supreme metaphor for well known speed.",
                    "label": 0
                },
                {
                    "sent": "Sorry, so sorry for Q of this subject is very difficult.",
                    "label": 0
                },
                {
                    "sent": "And can you?",
                    "label": 0
                },
                {
                    "sent": "Find instead because well, we can install this one.",
                    "label": 0
                },
                {
                    "sent": "But can we solve this one?",
                    "label": 0
                },
                {
                    "sent": "That is finding the P that maximizes this object?",
                    "label": 0
                },
                {
                    "sent": "Now there is no expectation there is no X matrix.",
                    "label": 0
                },
                {
                    "sent": "Random thing, there's only the correlation in the T correlation and these demonistic P. We find a P that maximizes that.",
                    "label": 0
                },
                {
                    "sent": "It seems difficult because obviously.",
                    "label": 0
                },
                {
                    "sent": "Well, he only appears in this term.",
                    "label": 0
                },
                {
                    "sent": "So it seems easy to derivate along P. But the problem is that Ek Bar and Ek have somewhere deep inside because the fixed point.",
                    "label": 0
                },
                {
                    "sent": "Well, it turns out something magical appears, so that's why that's why we love mathematics.",
                    "label": 0
                },
                {
                    "sent": "Something magical appears, which tells you that.",
                    "label": 0
                },
                {
                    "sent": "If you very late differentiator in this expression, partially along the YKK bar, it gives you 0.",
                    "label": 0
                },
                {
                    "sent": "There are different mental reason is that if I derivate passion, you don't keep up.",
                    "label": 0
                },
                {
                    "sent": "This guy becomes a one event race of the same thing minus one.",
                    "label": 0
                },
                {
                    "sent": "And here I have another cable which when I do it gives me Ek.",
                    "label": 0
                },
                {
                    "sent": "But but this one of the interesting thing here is exactly the definition of Ek.",
                    "label": 0
                },
                {
                    "sent": "So when I do this minus UK gives me 0.",
                    "label": 0
                },
                {
                    "sent": "OK, so when I dare made along the fixed point things, it gives me 0 all the time.",
                    "label": 0
                },
                {
                    "sent": "So what it both times is saying is that they are very thing around.",
                    "label": 0
                },
                {
                    "sent": "PK is equivalent to only there impartially PK.",
                    "label": 0
                },
                {
                    "sent": "Fixing to the cake is up.",
                    "label": 0
                },
                {
                    "sent": "Whatever in the end he's just bugs and saying we need to maximize this expression.",
                    "label": 0
                },
                {
                    "sent": "OK, without use we've now not looking into the other two, but but that is simple.",
                    "label": 0
                },
                {
                    "sent": "'cause this is known for a long time to be a solution of that, to be water feeling.",
                    "label": 0
                },
                {
                    "sent": "How do you find the P that maximizes love that well?",
                    "label": 0
                },
                {
                    "sent": "You also feel on T. OK, I'll look for this.",
                    "label": 0
                },
                {
                    "sent": "Yes, he called water filling results for the minor system back to tower in 99.",
                    "label": 0
                },
                {
                    "sent": "This would be this would be the solution.",
                    "label": 0
                },
                {
                    "sent": "99 Oh yeah.",
                    "label": 0
                },
                {
                    "sent": "And and that's what I said.",
                    "label": 0
                },
                {
                    "sent": "Up to some small thing, which is that my water feeling has to be on tee times Ek.",
                    "label": 0
                },
                {
                    "sent": "Quick facts, not so since Ek is a function of P itself, it's not a water feeling between iterative water filling, which is I take P equals identity.",
                    "label": 0
                },
                {
                    "sent": "I find in cake I want to feel it gives me a new Ek.",
                    "label": 0
                },
                {
                    "sent": "I wouldn't feel again and then I'm going to look like this.",
                    "label": 0
                },
                {
                    "sent": "I cannot prove the convergence.",
                    "label": 0
                },
                {
                    "sent": "Apparently I was told back to days ago that sometimes doesn't converge.",
                    "label": 0
                },
                {
                    "sent": "But well, for me it has always worked, so they must have found something tricky.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, so I have a lot of cleaning solution.",
                    "label": 0
                },
                {
                    "sent": "So what I say, but I've just stated, is that this problem I cannot solve it explicitly is kind of hard because I need to do this convex optimization thing so so the capacity of the Ebony capacity of MIMO channel forgiven distribution of age is not easy to figure, but if I approximate this thing by you deterministic equivalent, I can solve the deterministic program part.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that you can prove, obviously because of convexity of the province.",
                    "label": 0
                },
                {
                    "sent": "Since you have a complex problem for the first one, and complex or concave plan for the first one came for the second one you found you found the maximum and on the 2nd and the two are getting close to one another.",
                    "label": 0
                },
                {
                    "sent": "So obviously the the pre-order gets close to the other one.",
                    "label": 0
                },
                {
                    "sent": "Which means that no, I'm back to.",
                    "label": 0
                },
                {
                    "sent": "I get the Lucent.",
                    "label": 0
                },
                {
                    "sent": "I'm at the Lucent.",
                    "label": 0
                },
                {
                    "sent": "I know what other statistical the channel in my in my network.",
                    "label": 0
                },
                {
                    "sent": "Then I can anticipate what what I should tell the users to to use a precooler so that the capacity of the network is increasing.",
                    "label": 0
                },
                {
                    "sent": "So this is in my most setting multiple vinyl Max setting.",
                    "label": 0
                },
                {
                    "sent": "I could do that for and we did that for broadcast Channel 4 channel with multi style channels will be interference.",
                    "label": 0
                },
                {
                    "sent": "There's a bunch of things we can do and for instance you can say or there's something I already mentioned you using those tools you configure forgiven network topology where you should put the base stations.",
                    "label": 0
                },
                {
                    "sent": "What should be the good precoding strategy to use, what information you should feedback.",
                    "label": 0
                },
                {
                    "sent": "Princess in broadcast channel.",
                    "label": 0
                },
                {
                    "sent": "If you were aware of that, there's a big issue, which is if the pre order.",
                    "label": 0
                },
                {
                    "sent": "It is the transmitter must translate to different users on the same day and then obviously if you don't know the channel you will be eating well, you will spread.",
                    "label": 0
                },
                {
                    "sent": "You will spread the interference to all the users because you're sending this note from before.",
                    "label": 0
                },
                {
                    "sent": "If I sent it to users since you answer you.",
                    "label": 0
                },
                {
                    "sent": "If I spread the message without knowing what is the channel and you will receive the message for the two, you will receive the message for the two.",
                    "label": 0
                },
                {
                    "sent": "So you will have a big interference between broadcast.",
                    "label": 0
                },
                {
                    "sent": "How it doesn't work like this broadcast.",
                    "label": 0
                },
                {
                    "sent": "Each other channels feedback.",
                    "label": 0
                },
                {
                    "sent": "She's a channels, take information and once I know that I can do this strategy that such as zero forcing which is I I make sure that recording function so that when you receive it on your channel you get your one your information and when I sent you through your channel you get all your information.",
                    "label": 0
                },
                {
                    "sent": "And but obviously that means you have a lot of feedback, and if I move very fast then I need feedback a lot and I don't have time to transmit.",
                    "label": 0
                },
                {
                    "sent": "So there is a question.",
                    "label": 0
                },
                {
                    "sent": "How long should I train so that I have an imperfect channel state information and how long should I transmit so that the capacity is maximized and that is difficult again, because depending on the channel metric or under the channel distribution I don't know.",
                    "label": 0
                },
                {
                    "sent": "I have to simulate, but here with those tools I can actually anticipate that so I can know.",
                    "label": 0
                },
                {
                    "sent": "How long I should wait so just by taking some statistics on the channels, I can say a lot of things so I can also put the base stations at the right position I could do.",
                    "label": 0
                },
                {
                    "sent": "Nowadays we have small cell networks that will be, you know, space station, put in there, on the lamppost, everywhere in the street.",
                    "label": 0
                },
                {
                    "sent": "One thing that people anticipate to do is to do 3D informing.",
                    "label": 0
                },
                {
                    "sent": "That is the story, and then that's eating which is the base station we look at you looking in One Direction or or look at least at few users somewhere while another one is also playing on the same frequency so you have interference.",
                    "label": 0
                },
                {
                    "sent": "So how do you manage that?",
                    "label": 0
                },
                {
                    "sent": "It's very difficult, so these tools can do that.",
                    "label": 0
                },
                {
                    "sent": "They can tell you with basic simulation science, well, it's not convex.",
                    "label": 0
                },
                {
                    "sent": "It's difficult to solve, but still you don't have to Monte Carlo.",
                    "label": 0
                },
                {
                    "sent": "Simulations of all possible efforts in your network to figure what should be good.",
                    "label": 0
                },
                {
                    "sent": "Just ready for transmission.",
                    "label": 0
                },
                {
                    "sent": "OK. And I think, well, that's another result with the way I could do it here so that.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "New case of where the channel has.",
                    "label": 0
                },
                {
                    "sent": "As.",
                    "label": 0
                },
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Line of sight component.",
                    "label": 0
                },
                {
                    "sent": "That is, we also have resources and we have to adopt that equipment also.",
                    "label": 0
                },
                {
                    "sent": "So many work had been done by this team.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "France.",
                    "label": 0
                },
                {
                    "sent": "Well, we can do the same thing as I was mentioning when when instead of.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I matrix graph.",
                    "label": 0
                },
                {
                    "sent": "You need to remit uses, so it's useful for random informing.",
                    "label": 0
                },
                {
                    "sent": "It's just a good smile works this way pretty from this side, and also because it's kind of.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Funny in the sense that I have done right before I was explaining the model where W was replaced by tax ID.",
                    "label": 0
                },
                {
                    "sent": "Now it's a rent it's unitary matrix, so random unitary in terms of this amazing equivalence.",
                    "label": 0
                },
                {
                    "sent": "So the fundamental equations here all exactly the same, but for small addition here.",
                    "label": 0
                },
                {
                    "sent": "So did the previous case with the one without this, and now we screwed this thing.",
                    "label": 0
                },
                {
                    "sent": "Turning from ID to two unitary, which is totally different, gives you something that extremely equivalent in something you can optimize every color with.",
                    "label": 0
                },
                {
                    "sent": "This structure is here, which is again.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "Magic of mathematics.",
                    "label": 0
                },
                {
                    "sent": "OK, and I think I will stop here and make a break if it's fine with you, I guess it will be fine with you.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Should I?",
                    "label": 0
                }
            ]
        }
    }
}