{
    "id": "p4cha73e3bqjtpi7yy372qwu2ulgezr2",
    "title": "Future challenges for Logistics Service Providers in the automotive industry",
    "info": {
        "author": [
            "Robert Bommers, BLG Automotive Logistics GmbH & Co.KG"
        ],
        "introducer": [
            "Jens Schumacher, Vorarlberg University of Applied Sciences"
        ],
        "published": "Dec. 9, 2010",
        "recorded": "November 2010",
        "category": [
            "Top->Business->Transportation and Logistics->Technology"
        ]
    },
    "url": "http://videolectures.net/ecitl2010_bommers_fcl/",
    "segmentation": [
        [
            "I wish us all have a good conference and I would actually like to start to invite Mr Bombers from BLG.",
            "BLG is one of the biggest logistics provider and is one of the major user would say off the of the port here, so we're really looking forward to your presentation, Mr Vollmers.",
            "I take the Liberty I have a few snapshots for you, just a few pictures which shows you or gives you an impression where our challenges are.",
            "And I thought it's more more convenient to for you to look at some pictures rather than reading what I'm presenting here faster than I can read.",
            "So I think this is more convenient.",
            "Yeah, ladies and gentlemen, the globalization is a key factor for the current economic development.",
            "The automotive industry was and is the pacemaker of the globalization process which started in the early 80s.",
            "That is also a brand mark for us.",
            "This process generally means global sourcing, global production and global selling.",
            "Most OEM's do have their own strategy in this, and those strategies are not static, but very flexible and have to adapt to market development.",
            "Just look at recent developments in China and India which underlines this.",
            "The effect of globalization has resulted in the split of jobs in split of process steps.",
            "Anwer with a few individuals assigned to each task which means that the production of trade materials and goods have to be exactly managed on a global scale and controlled the networked global economy requires systematic, reliable services.",
            "That adapt to the demands in a flexible way.",
            "Due to this, the logistic service providers which I'm representing here are required to act in a flexible way in order to meet the current and future demands.",
            "Of our clients.",
            "One key factor in the in the constantly rising demand for state of the art arty solution and its development.",
            "The customers of course expect that the logistic service provider be the cost or to build them into a flexible rates and cost structure.",
            "In addition to this, the demand for detailed information about the operational process is as surprising as well and customers preferably like to get them in real time on a global scale.",
            "Looking at some of the historical data, I think a few years ago all of us would have never dreamed the extend and influence of.",
            "IT in today's business world.",
            "Also cost wise, the reporting of the Intel."
        ],
        [
            "They are.",
            "Of the entire operational process has to be transparent, meaning that the logistics provider has to open his books and to give a transparent inside view of their logistics flows and process is auriti solutions were one of our major important elements which boosted the process of globalization for group from a mayor from or port operator to an international acting logistics provider, which today is represented in Europe.",
            "In North and South America and Asia and Africa.",
            "Within the field of contract logistics.",
            "Experience has been made in the early 18th with many global OEM's and for this the relevant IT applications have been developed, most of them in House and Taylor Mate.",
            "So the automotive industry plays for us a major role in our global activities.",
            "Our services for the industry.",
            "They range from automotive for the automotive industry include the vehicle logistics means soon as the car has wheels on an automotive logistics which is murder part sites.",
            "I think most of you have yesterday seen are totally different.",
            "Picture now High Bay Warehouse and where we do the retail function and retail logistics in the business division of BLG Auto Mobile.",
            "We provide complete supply chain solutions for automobiles from the manufacturers up to the dealer's premises.",
            "In the country of destination.",
            "Those service elements are the management of car terminals at the coasts, at large rivers and in the hinterland automobile transportation by Rd by rail, by inland waterways, as well as the management of technology centers.",
            "And last mile customizing services refurbishing of used lease returns rounds up this portfolio.",
            "The number of automobiles.",
            "Last year we handled with four point 7 million and with that we consider to rank in Europes Europeans's top range, the largest side of this network is in Bremerhaven, which itself accounted for 1.2 million vehicles.",
            "And off and on top of that we handle 340,000 vehicles which in our technical centers those services can range from simply cleaning jobs up to subvert technical up fitment of cars.",
            "Who concede, in a nutshell, that most imported cars in Europe which run through our technical centers, the option packages which are ordered from the clients are building in our centers and not at the line on a global scale."
        ],
        [
            "One big core competence of our business division Biagi contractors Automotive Logistics service include controlling of all materials, goods and data.",
            "The whole range of service includes supply chain management value added services as well as the distribution.",
            "This sector is specialized on automotive parts on production logistics, where we provide in our solutions as well as retail and distribution logistics.",
            "The part which most of you have seen last night and last but not least at least our traditional port logistics where we handle all those activities of a traditional port.",
            "Size wise they do not fit into normal ordinary containers."
        ],
        [
            "Within the automotive industry with large international OEM's at or clients like.",
            "And Mercedes BMW Kia and Hyundai.",
            "I would like to give you a few examples to clarify a little bit how we work."
        ],
        [
            "In the city of Purpling, in which is close to Stuttgart, we manage a supplier logistics center to guarantee for line feeding of the automobile production.",
            "The basis of our activity is the direct control of production material for all ranges of a model supported by flexible and transparent it tools and interfaces to the system of our clients without linked systems, this process wouldn't be possible."
        ],
        [
            "All parts and some of them are pre assembled are delivered in sequence to the line and looks very very close to Berlin.",
            "We run a similar center also for the automobile as well As for the motorcycle industry and besides that we also do handle their cleaning logistics for all the returnable packaging."
        ],
        [
            "In kilogram, which is in tooling and we run the entire logistics of an engine plant with an annual capacity of 500,000 units which are distributed through the assembly lines on a global scale."
        ],
        [
            "In Bremen, at all main logistics centers in Bremen, as well as in Bremerhaven, we do most of our logistics works volume wise.",
            "We handled the parts of 300,000 vehicles in the full CKD process.",
            "Materials are shipped on a kit base and partly pre assembled to overseas factories."
        ],
        [
            "Oh logistic center in Bremen operates part of it in industrial production system as a value added service for the overseas production.",
            "All body parts are prepared for the overseas transport as well as protected against corrosion during their journey.",
            "All assembly parts leave our premises in a special designed Creighton Box.",
            "Enologia"
        ],
        [
            "6 center in Bremerhaven we which is located next to the next to the to the container terminals we take on large quantity of finished engines from from a global production, which are then designated for European.",
            "Assembly lines those assembly lines are supplied in Taimanin sequence as well or put."
        ],
        [
            "All you're in.",
            "Bremerhaven also includes CKD services, which is.",
            "Mainly to do sample a finished car due to high import duties in the country of destination where our solution as well as our our creating makes it is beneficial for the OEM to do this process and also here our comprehensive IT solutions were the key for their success."
        ],
        [
            "This.",
            "In Brazil and India we do run on site logistics for several OEMs with up to 600 employees per site.",
            "We support every place of work in this factory, just in time and in sequence.",
            "This is just one example of how we actively try to solve challenges on a global scale for us as well As for clients.",
            "In vendor, for example, we there's a factory which produces heavy duty trucks up to across weight of 65 tons.",
            "We we do the.",
            "Just six 430 two different models as well as 10 different chassis's for for Overland coaches.",
            "When you look at the range of services which we offer to the automotive industry, we are in, six were splitted in six models.",
            "One is the worldwide production supplies CKD CKD in part by Part 2 the global production sites.",
            "So the 2nd element is storage and consolidation operational.",
            "Those centers as well as supply logistic Centers for assembly plants in sequence.",
            "The third element covers.",
            "Plant logistics handling all the material flow inside a plant from the gates of entry up to the line of the Assembly.",
            "Those projects usually come along with some stuff and equipment take over.",
            "If it is a running operation, the 4th element is vehicle handling and storage.",
            "This includes the operation of Seaport and inland terminals.",
            "The fifth element is an operation of the technical centers which I mentioned already for auto mobile, meaning that all technical services for finished vehicles, particularly PDI centers, as well as VPC's.",
            "Services are a technical centres.",
            "The entire scope can be described as last mile customizing.",
            "The 6th element is last but not least, the shipment of the finished vehicle and transport organization we we ship it by using other our own fleet of trucks or we combine it with rail and inland waterways.",
            "Although 6 modules are supported by corresponding Internet based at T solutions or clients have the choice to select just one or the full range of our services and they can look into our systems wherever they are in the world.",
            "They just need an Internet browser.",
            "To get access to their data so the information flow of for clients is extremely important.",
            "And by far those majority of our two solutions have been developed with own capacity and in house.",
            "To cater the requirements as well as the flexibility needs.",
            "We do offer customized planning and the management of logistics professors interlaced with the management of all goods and information processes."
        ],
        [
            "All customers solutions.",
            "For for the requirements of every customer always comes with the three core elements creating a process, controlling it and assuming responsibility and creating trust.",
            "When creating logistics process is we do offer the clients or know how?",
            "And logistics consulting is?",
            "The naturally a part of our service.",
            "We offer our clients full accountability and responsibility.",
            "We provide reliable contact persons and regulated teams.",
            "We invest in the field in which our client.",
            "Once our services.",
            "Logistic service providers are profiting from the modern development of OEMs.",
            "The automobile manufacturers have reduced their manufacturing debts.",
            "Outsourcing is a big part of their of their work.",
            "And their way how they work and suppliers are dealing with the parts components.",
            "Also with the development.",
            "So logistics providers are naturally specialized in doing so.",
            "One of the main drivers for outsourcing is.",
            "In our point of view, the more competitive cost structures of LSP's rather than OEM's, especially when it comes to sites in Europe.",
            "The trend of concentrating on their core business of Williams is increasing and we consider the outsourcing level is even more increasing.",
            "Welcome sight effects for them is transfer fixed costs into variable ones as well as pushing major risk components.",
            "To third parties.",
            "So this effect is, in my opinion, becoming one of the real challenges for LSP's in the future."
        ],
        [
            "Oh no Ames production capacity works.",
            "Own production capacity works also as a supplier for worldwide assembly.",
            "And these automated assembly lines supply to regional markets or worldwide ones.",
            "This trend is constantly developing.",
            "OEMs confront service providers with extremely high demands.",
            "If today a car, for example, is made out of 3000 components in the future, it may be only made from a couple of 100 pre assembled modules for the production flow itself.",
            "At the line is more efficient.",
            "Suppliers and LSP's will be in the future more responsible for the pre assembly and manufacture of those components.",
            "Then we have experienced this before.",
            "We have to organize their international assembly.",
            "They need to consider suppliers and the components used as well as the assembly lines.",
            "They involve factories as well as a sequence.",
            "It is required the speed of this process will vary according to the demand of the product.",
            "Who wants to master these logistics to this level has to work internationally on a global scale.",
            "And logistics provide us.",
            "Naturally follow their OEM's to the place of work to other continents or if.",
            "If they require modified supply chains in in case of change production marketing strategies by outsourcing manufacturers achieve higher levels of productivity and quality while having less expenditure at the same time.",
            "In it able seem to work in a more flexible way.",
            "They slim down their investment in into logistics and shipping costs, and they can convert fixed into variable costs, which is a major component for them nowadays world.",
            "Outsourcing of those logistics is their key element to lean production.",
            "Production logistics is just one of BLG services.",
            "The finished vehicles must be quickly delivered and distributed to the dealers.",
            "The shorter the period of time between order placement and delivery of the smaller capital commitment for the manufacturers.",
            "We are a part of a cutting down this timeline by enabling smart process is underlined without esolutions the logistics service provider.",
            "In our point of view manage the complete supply chain of the production plans.",
            "Even down to individual jobs within the assembly process.",
            "Practicably these these type of systems require a high level of process management as as well as I T capability there only a few LSP's on a global scale which can services and we were capable of doing so.",
            "With integrated component assembly.",
            "BGC extension of the Auto mobile workbench."
        ],
        [
            "A part of this are our systems.",
            "For example, for glued automobile parts.",
            "And or corrosion production process is of raw components here in Bremen, where we feed global assembly lines with those parts, reasons for those outsourcing of service packages are constantly increasing demands and costs.",
            "This is where we come in and we try to offer solutions for clients.",
            "You're just like service providers, cover management and control of goods and data streams.",
            "The entire value chain from sourcing to transport and value added services right down to distribution.",
            "All this is planned by.",
            "And this piece.",
            "The OEMs and the LSP create an individual value chain.",
            "Which suits him as an OEM as these services are complex a written contract.",
            "In the is the underlying element for these partnerships for years.",
            "We see that there is an upcoming tendency on the part of the customers that these contracts become shorter from a timeline and the contracts have flooded with all kinds of opening clauses for liability as well as termination that in sometimes it's a more 1 sided partnership agreement.",
            "Then a real partnership in the true sense of meaning.",
            "This fact means rising risk for us and where volumes are not committed to quantities are not assured on the part of our customers.",
            "The demands and expectations of logistics customers are constantly rising.",
            "As explained, most companies see Logistics as an important factor within the production chain.",
            "Not only quality.",
            "Also, reliability are important when it comes to this, but also the consideration of the cost impact.",
            "Logistics."
        ],
        [
            "This.",
            "Most of the time seen as lowering of costs, LSP and clients, however have different opinion how to achieve this.",
            "One of our goals, one of the goals of our clients, are, as said earlier, to change fixed costs into variable ones and the customers.",
            "Expect us to invest into centers as well as into equipment.",
            "The investments necessarily are steadily rising.",
            "Also, the cost impact of it.",
            "In addition to this, the demands the customer demands his provider to take accountability to a high extent, and sometimes this accountability.",
            "It's not possible to assign it to insurance company for a back cover.",
            "The logistics service providers needs to take influence in the volume of production into consideration by having flexible shift models as well as access to part-time workers only.",
            "Though the LSP can reduce the impact of employment liability risk.",
            "Ask the client.",
            "Is in more control we as an SP must act more flexible.",
            "Logistics services require a lot of employees.",
            "We spent nearly 60% of our costs on salaries and wages.",
            "We as another speed, we need more flexible working concepts and shift models.",
            "That is for us challenge and that we can use the workforce also in a very competitive way.",
            "Another possibility is to get into more technology to reduce the workforce and also to.",
            "To Automize process is more.",
            "Yet, this is another challenge for us.",
            "At least investment wise."
        ],
        [
            "Let me summarize in in a few in a few statements, the real challenges for us in the future.",
            "Are to cope with the increasing demand.",
            "It was and the RT development and the corresponding cost of it.",
            "To manage the high flexibel or train and competitive workforce despite the upcoming demographic changes in nowadays society and to cover upcoming risks.",
            "In the view of liability and new commitments to the client."
        ],
        [
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I wish us all have a good conference and I would actually like to start to invite Mr Bombers from BLG.",
                    "label": 0
                },
                {
                    "sent": "BLG is one of the biggest logistics provider and is one of the major user would say off the of the port here, so we're really looking forward to your presentation, Mr Vollmers.",
                    "label": 0
                },
                {
                    "sent": "I take the Liberty I have a few snapshots for you, just a few pictures which shows you or gives you an impression where our challenges are.",
                    "label": 0
                },
                {
                    "sent": "And I thought it's more more convenient to for you to look at some pictures rather than reading what I'm presenting here faster than I can read.",
                    "label": 0
                },
                {
                    "sent": "So I think this is more convenient.",
                    "label": 0
                },
                {
                    "sent": "Yeah, ladies and gentlemen, the globalization is a key factor for the current economic development.",
                    "label": 0
                },
                {
                    "sent": "The automotive industry was and is the pacemaker of the globalization process which started in the early 80s.",
                    "label": 1
                },
                {
                    "sent": "That is also a brand mark for us.",
                    "label": 0
                },
                {
                    "sent": "This process generally means global sourcing, global production and global selling.",
                    "label": 0
                },
                {
                    "sent": "Most OEM's do have their own strategy in this, and those strategies are not static, but very flexible and have to adapt to market development.",
                    "label": 0
                },
                {
                    "sent": "Just look at recent developments in China and India which underlines this.",
                    "label": 0
                },
                {
                    "sent": "The effect of globalization has resulted in the split of jobs in split of process steps.",
                    "label": 0
                },
                {
                    "sent": "Anwer with a few individuals assigned to each task which means that the production of trade materials and goods have to be exactly managed on a global scale and controlled the networked global economy requires systematic, reliable services.",
                    "label": 0
                },
                {
                    "sent": "That adapt to the demands in a flexible way.",
                    "label": 0
                },
                {
                    "sent": "Due to this, the logistic service providers which I'm representing here are required to act in a flexible way in order to meet the current and future demands.",
                    "label": 0
                },
                {
                    "sent": "Of our clients.",
                    "label": 0
                },
                {
                    "sent": "One key factor in the in the constantly rising demand for state of the art arty solution and its development.",
                    "label": 0
                },
                {
                    "sent": "The customers of course expect that the logistic service provider be the cost or to build them into a flexible rates and cost structure.",
                    "label": 0
                },
                {
                    "sent": "In addition to this, the demand for detailed information about the operational process is as surprising as well and customers preferably like to get them in real time on a global scale.",
                    "label": 0
                },
                {
                    "sent": "Looking at some of the historical data, I think a few years ago all of us would have never dreamed the extend and influence of.",
                    "label": 0
                },
                {
                    "sent": "IT in today's business world.",
                    "label": 0
                },
                {
                    "sent": "Also cost wise, the reporting of the Intel.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They are.",
                    "label": 0
                },
                {
                    "sent": "Of the entire operational process has to be transparent, meaning that the logistics provider has to open his books and to give a transparent inside view of their logistics flows and process is auriti solutions were one of our major important elements which boosted the process of globalization for group from a mayor from or port operator to an international acting logistics provider, which today is represented in Europe.",
                    "label": 0
                },
                {
                    "sent": "In North and South America and Asia and Africa.",
                    "label": 0
                },
                {
                    "sent": "Within the field of contract logistics.",
                    "label": 0
                },
                {
                    "sent": "Experience has been made in the early 18th with many global OEM's and for this the relevant IT applications have been developed, most of them in House and Taylor Mate.",
                    "label": 0
                },
                {
                    "sent": "So the automotive industry plays for us a major role in our global activities.",
                    "label": 0
                },
                {
                    "sent": "Our services for the industry.",
                    "label": 0
                },
                {
                    "sent": "They range from automotive for the automotive industry include the vehicle logistics means soon as the car has wheels on an automotive logistics which is murder part sites.",
                    "label": 0
                },
                {
                    "sent": "I think most of you have yesterday seen are totally different.",
                    "label": 0
                },
                {
                    "sent": "Picture now High Bay Warehouse and where we do the retail function and retail logistics in the business division of BLG Auto Mobile.",
                    "label": 0
                },
                {
                    "sent": "We provide complete supply chain solutions for automobiles from the manufacturers up to the dealer's premises.",
                    "label": 0
                },
                {
                    "sent": "In the country of destination.",
                    "label": 0
                },
                {
                    "sent": "Those service elements are the management of car terminals at the coasts, at large rivers and in the hinterland automobile transportation by Rd by rail, by inland waterways, as well as the management of technology centers.",
                    "label": 0
                },
                {
                    "sent": "And last mile customizing services refurbishing of used lease returns rounds up this portfolio.",
                    "label": 0
                },
                {
                    "sent": "The number of automobiles.",
                    "label": 0
                },
                {
                    "sent": "Last year we handled with four point 7 million and with that we consider to rank in Europes Europeans's top range, the largest side of this network is in Bremerhaven, which itself accounted for 1.2 million vehicles.",
                    "label": 0
                },
                {
                    "sent": "And off and on top of that we handle 340,000 vehicles which in our technical centers those services can range from simply cleaning jobs up to subvert technical up fitment of cars.",
                    "label": 0
                },
                {
                    "sent": "Who concede, in a nutshell, that most imported cars in Europe which run through our technical centers, the option packages which are ordered from the clients are building in our centers and not at the line on a global scale.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One big core competence of our business division Biagi contractors Automotive Logistics service include controlling of all materials, goods and data.",
                    "label": 1
                },
                {
                    "sent": "The whole range of service includes supply chain management value added services as well as the distribution.",
                    "label": 0
                },
                {
                    "sent": "This sector is specialized on automotive parts on production logistics, where we provide in our solutions as well as retail and distribution logistics.",
                    "label": 0
                },
                {
                    "sent": "The part which most of you have seen last night and last but not least at least our traditional port logistics where we handle all those activities of a traditional port.",
                    "label": 0
                },
                {
                    "sent": "Size wise they do not fit into normal ordinary containers.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Within the automotive industry with large international OEM's at or clients like.",
                    "label": 0
                },
                {
                    "sent": "And Mercedes BMW Kia and Hyundai.",
                    "label": 0
                },
                {
                    "sent": "I would like to give you a few examples to clarify a little bit how we work.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the city of Purpling, in which is close to Stuttgart, we manage a supplier logistics center to guarantee for line feeding of the automobile production.",
                    "label": 0
                },
                {
                    "sent": "The basis of our activity is the direct control of production material for all ranges of a model supported by flexible and transparent it tools and interfaces to the system of our clients without linked systems, this process wouldn't be possible.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All parts and some of them are pre assembled are delivered in sequence to the line and looks very very close to Berlin.",
                    "label": 0
                },
                {
                    "sent": "We run a similar center also for the automobile as well As for the motorcycle industry and besides that we also do handle their cleaning logistics for all the returnable packaging.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In kilogram, which is in tooling and we run the entire logistics of an engine plant with an annual capacity of 500,000 units which are distributed through the assembly lines on a global scale.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In Bremen, at all main logistics centers in Bremen, as well as in Bremerhaven, we do most of our logistics works volume wise.",
                    "label": 0
                },
                {
                    "sent": "We handled the parts of 300,000 vehicles in the full CKD process.",
                    "label": 0
                },
                {
                    "sent": "Materials are shipped on a kit base and partly pre assembled to overseas factories.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh logistic center in Bremen operates part of it in industrial production system as a value added service for the overseas production.",
                    "label": 1
                },
                {
                    "sent": "All body parts are prepared for the overseas transport as well as protected against corrosion during their journey.",
                    "label": 0
                },
                {
                    "sent": "All assembly parts leave our premises in a special designed Creighton Box.",
                    "label": 0
                },
                {
                    "sent": "Enologia",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "6 center in Bremerhaven we which is located next to the next to the to the container terminals we take on large quantity of finished engines from from a global production, which are then designated for European.",
                    "label": 0
                },
                {
                    "sent": "Assembly lines those assembly lines are supplied in Taimanin sequence as well or put.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All you're in.",
                    "label": 0
                },
                {
                    "sent": "Bremerhaven also includes CKD services, which is.",
                    "label": 0
                },
                {
                    "sent": "Mainly to do sample a finished car due to high import duties in the country of destination where our solution as well as our our creating makes it is beneficial for the OEM to do this process and also here our comprehensive IT solutions were the key for their success.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "In Brazil and India we do run on site logistics for several OEMs with up to 600 employees per site.",
                    "label": 0
                },
                {
                    "sent": "We support every place of work in this factory, just in time and in sequence.",
                    "label": 0
                },
                {
                    "sent": "This is just one example of how we actively try to solve challenges on a global scale for us as well As for clients.",
                    "label": 0
                },
                {
                    "sent": "In vendor, for example, we there's a factory which produces heavy duty trucks up to across weight of 65 tons.",
                    "label": 0
                },
                {
                    "sent": "We we do the.",
                    "label": 0
                },
                {
                    "sent": "Just six 430 two different models as well as 10 different chassis's for for Overland coaches.",
                    "label": 0
                },
                {
                    "sent": "When you look at the range of services which we offer to the automotive industry, we are in, six were splitted in six models.",
                    "label": 0
                },
                {
                    "sent": "One is the worldwide production supplies CKD CKD in part by Part 2 the global production sites.",
                    "label": 0
                },
                {
                    "sent": "So the 2nd element is storage and consolidation operational.",
                    "label": 0
                },
                {
                    "sent": "Those centers as well as supply logistic Centers for assembly plants in sequence.",
                    "label": 0
                },
                {
                    "sent": "The third element covers.",
                    "label": 0
                },
                {
                    "sent": "Plant logistics handling all the material flow inside a plant from the gates of entry up to the line of the Assembly.",
                    "label": 1
                },
                {
                    "sent": "Those projects usually come along with some stuff and equipment take over.",
                    "label": 0
                },
                {
                    "sent": "If it is a running operation, the 4th element is vehicle handling and storage.",
                    "label": 0
                },
                {
                    "sent": "This includes the operation of Seaport and inland terminals.",
                    "label": 0
                },
                {
                    "sent": "The fifth element is an operation of the technical centers which I mentioned already for auto mobile, meaning that all technical services for finished vehicles, particularly PDI centers, as well as VPC's.",
                    "label": 0
                },
                {
                    "sent": "Services are a technical centres.",
                    "label": 0
                },
                {
                    "sent": "The entire scope can be described as last mile customizing.",
                    "label": 0
                },
                {
                    "sent": "The 6th element is last but not least, the shipment of the finished vehicle and transport organization we we ship it by using other our own fleet of trucks or we combine it with rail and inland waterways.",
                    "label": 0
                },
                {
                    "sent": "Although 6 modules are supported by corresponding Internet based at T solutions or clients have the choice to select just one or the full range of our services and they can look into our systems wherever they are in the world.",
                    "label": 0
                },
                {
                    "sent": "They just need an Internet browser.",
                    "label": 0
                },
                {
                    "sent": "To get access to their data so the information flow of for clients is extremely important.",
                    "label": 0
                },
                {
                    "sent": "And by far those majority of our two solutions have been developed with own capacity and in house.",
                    "label": 0
                },
                {
                    "sent": "To cater the requirements as well as the flexibility needs.",
                    "label": 0
                },
                {
                    "sent": "We do offer customized planning and the management of logistics professors interlaced with the management of all goods and information processes.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All customers solutions.",
                    "label": 0
                },
                {
                    "sent": "For for the requirements of every customer always comes with the three core elements creating a process, controlling it and assuming responsibility and creating trust.",
                    "label": 0
                },
                {
                    "sent": "When creating logistics process is we do offer the clients or know how?",
                    "label": 0
                },
                {
                    "sent": "And logistics consulting is?",
                    "label": 0
                },
                {
                    "sent": "The naturally a part of our service.",
                    "label": 0
                },
                {
                    "sent": "We offer our clients full accountability and responsibility.",
                    "label": 0
                },
                {
                    "sent": "We provide reliable contact persons and regulated teams.",
                    "label": 0
                },
                {
                    "sent": "We invest in the field in which our client.",
                    "label": 0
                },
                {
                    "sent": "Once our services.",
                    "label": 0
                },
                {
                    "sent": "Logistic service providers are profiting from the modern development of OEMs.",
                    "label": 0
                },
                {
                    "sent": "The automobile manufacturers have reduced their manufacturing debts.",
                    "label": 0
                },
                {
                    "sent": "Outsourcing is a big part of their of their work.",
                    "label": 0
                },
                {
                    "sent": "And their way how they work and suppliers are dealing with the parts components.",
                    "label": 0
                },
                {
                    "sent": "Also with the development.",
                    "label": 0
                },
                {
                    "sent": "So logistics providers are naturally specialized in doing so.",
                    "label": 0
                },
                {
                    "sent": "One of the main drivers for outsourcing is.",
                    "label": 0
                },
                {
                    "sent": "In our point of view, the more competitive cost structures of LSP's rather than OEM's, especially when it comes to sites in Europe.",
                    "label": 0
                },
                {
                    "sent": "The trend of concentrating on their core business of Williams is increasing and we consider the outsourcing level is even more increasing.",
                    "label": 0
                },
                {
                    "sent": "Welcome sight effects for them is transfer fixed costs into variable ones as well as pushing major risk components.",
                    "label": 0
                },
                {
                    "sent": "To third parties.",
                    "label": 0
                },
                {
                    "sent": "So this effect is, in my opinion, becoming one of the real challenges for LSP's in the future.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh no Ames production capacity works.",
                    "label": 0
                },
                {
                    "sent": "Own production capacity works also as a supplier for worldwide assembly.",
                    "label": 0
                },
                {
                    "sent": "And these automated assembly lines supply to regional markets or worldwide ones.",
                    "label": 0
                },
                {
                    "sent": "This trend is constantly developing.",
                    "label": 0
                },
                {
                    "sent": "OEMs confront service providers with extremely high demands.",
                    "label": 0
                },
                {
                    "sent": "If today a car, for example, is made out of 3000 components in the future, it may be only made from a couple of 100 pre assembled modules for the production flow itself.",
                    "label": 0
                },
                {
                    "sent": "At the line is more efficient.",
                    "label": 0
                },
                {
                    "sent": "Suppliers and LSP's will be in the future more responsible for the pre assembly and manufacture of those components.",
                    "label": 0
                },
                {
                    "sent": "Then we have experienced this before.",
                    "label": 0
                },
                {
                    "sent": "We have to organize their international assembly.",
                    "label": 0
                },
                {
                    "sent": "They need to consider suppliers and the components used as well as the assembly lines.",
                    "label": 0
                },
                {
                    "sent": "They involve factories as well as a sequence.",
                    "label": 0
                },
                {
                    "sent": "It is required the speed of this process will vary according to the demand of the product.",
                    "label": 0
                },
                {
                    "sent": "Who wants to master these logistics to this level has to work internationally on a global scale.",
                    "label": 0
                },
                {
                    "sent": "And logistics provide us.",
                    "label": 0
                },
                {
                    "sent": "Naturally follow their OEM's to the place of work to other continents or if.",
                    "label": 0
                },
                {
                    "sent": "If they require modified supply chains in in case of change production marketing strategies by outsourcing manufacturers achieve higher levels of productivity and quality while having less expenditure at the same time.",
                    "label": 0
                },
                {
                    "sent": "In it able seem to work in a more flexible way.",
                    "label": 0
                },
                {
                    "sent": "They slim down their investment in into logistics and shipping costs, and they can convert fixed into variable costs, which is a major component for them nowadays world.",
                    "label": 0
                },
                {
                    "sent": "Outsourcing of those logistics is their key element to lean production.",
                    "label": 0
                },
                {
                    "sent": "Production logistics is just one of BLG services.",
                    "label": 0
                },
                {
                    "sent": "The finished vehicles must be quickly delivered and distributed to the dealers.",
                    "label": 0
                },
                {
                    "sent": "The shorter the period of time between order placement and delivery of the smaller capital commitment for the manufacturers.",
                    "label": 0
                },
                {
                    "sent": "We are a part of a cutting down this timeline by enabling smart process is underlined without esolutions the logistics service provider.",
                    "label": 0
                },
                {
                    "sent": "In our point of view manage the complete supply chain of the production plans.",
                    "label": 0
                },
                {
                    "sent": "Even down to individual jobs within the assembly process.",
                    "label": 0
                },
                {
                    "sent": "Practicably these these type of systems require a high level of process management as as well as I T capability there only a few LSP's on a global scale which can services and we were capable of doing so.",
                    "label": 0
                },
                {
                    "sent": "With integrated component assembly.",
                    "label": 0
                },
                {
                    "sent": "BGC extension of the Auto mobile workbench.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A part of this are our systems.",
                    "label": 0
                },
                {
                    "sent": "For example, for glued automobile parts.",
                    "label": 0
                },
                {
                    "sent": "And or corrosion production process is of raw components here in Bremen, where we feed global assembly lines with those parts, reasons for those outsourcing of service packages are constantly increasing demands and costs.",
                    "label": 0
                },
                {
                    "sent": "This is where we come in and we try to offer solutions for clients.",
                    "label": 0
                },
                {
                    "sent": "You're just like service providers, cover management and control of goods and data streams.",
                    "label": 0
                },
                {
                    "sent": "The entire value chain from sourcing to transport and value added services right down to distribution.",
                    "label": 0
                },
                {
                    "sent": "All this is planned by.",
                    "label": 0
                },
                {
                    "sent": "And this piece.",
                    "label": 0
                },
                {
                    "sent": "The OEMs and the LSP create an individual value chain.",
                    "label": 0
                },
                {
                    "sent": "Which suits him as an OEM as these services are complex a written contract.",
                    "label": 0
                },
                {
                    "sent": "In the is the underlying element for these partnerships for years.",
                    "label": 0
                },
                {
                    "sent": "We see that there is an upcoming tendency on the part of the customers that these contracts become shorter from a timeline and the contracts have flooded with all kinds of opening clauses for liability as well as termination that in sometimes it's a more 1 sided partnership agreement.",
                    "label": 0
                },
                {
                    "sent": "Then a real partnership in the true sense of meaning.",
                    "label": 0
                },
                {
                    "sent": "This fact means rising risk for us and where volumes are not committed to quantities are not assured on the part of our customers.",
                    "label": 0
                },
                {
                    "sent": "The demands and expectations of logistics customers are constantly rising.",
                    "label": 0
                },
                {
                    "sent": "As explained, most companies see Logistics as an important factor within the production chain.",
                    "label": 0
                },
                {
                    "sent": "Not only quality.",
                    "label": 0
                },
                {
                    "sent": "Also, reliability are important when it comes to this, but also the consideration of the cost impact.",
                    "label": 0
                },
                {
                    "sent": "Logistics.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Most of the time seen as lowering of costs, LSP and clients, however have different opinion how to achieve this.",
                    "label": 0
                },
                {
                    "sent": "One of our goals, one of the goals of our clients, are, as said earlier, to change fixed costs into variable ones and the customers.",
                    "label": 1
                },
                {
                    "sent": "Expect us to invest into centers as well as into equipment.",
                    "label": 0
                },
                {
                    "sent": "The investments necessarily are steadily rising.",
                    "label": 0
                },
                {
                    "sent": "Also, the cost impact of it.",
                    "label": 0
                },
                {
                    "sent": "In addition to this, the demands the customer demands his provider to take accountability to a high extent, and sometimes this accountability.",
                    "label": 0
                },
                {
                    "sent": "It's not possible to assign it to insurance company for a back cover.",
                    "label": 0
                },
                {
                    "sent": "The logistics service providers needs to take influence in the volume of production into consideration by having flexible shift models as well as access to part-time workers only.",
                    "label": 0
                },
                {
                    "sent": "Though the LSP can reduce the impact of employment liability risk.",
                    "label": 0
                },
                {
                    "sent": "Ask the client.",
                    "label": 0
                },
                {
                    "sent": "Is in more control we as an SP must act more flexible.",
                    "label": 0
                },
                {
                    "sent": "Logistics services require a lot of employees.",
                    "label": 0
                },
                {
                    "sent": "We spent nearly 60% of our costs on salaries and wages.",
                    "label": 0
                },
                {
                    "sent": "We as another speed, we need more flexible working concepts and shift models.",
                    "label": 0
                },
                {
                    "sent": "That is for us challenge and that we can use the workforce also in a very competitive way.",
                    "label": 0
                },
                {
                    "sent": "Another possibility is to get into more technology to reduce the workforce and also to.",
                    "label": 0
                },
                {
                    "sent": "To Automize process is more.",
                    "label": 0
                },
                {
                    "sent": "Yet, this is another challenge for us.",
                    "label": 0
                },
                {
                    "sent": "At least investment wise.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let me summarize in in a few in a few statements, the real challenges for us in the future.",
                    "label": 0
                },
                {
                    "sent": "Are to cope with the increasing demand.",
                    "label": 0
                },
                {
                    "sent": "It was and the RT development and the corresponding cost of it.",
                    "label": 0
                },
                {
                    "sent": "To manage the high flexibel or train and competitive workforce despite the upcoming demographic changes in nowadays society and to cover upcoming risks.",
                    "label": 0
                },
                {
                    "sent": "In the view of liability and new commitments to the client.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": []
        }
    }
}