{
    "id": "p6yaltrcbub7nf5nutlzudx4pvyumpkq",
    "title": "Multi-modal Authoring Tool for Populating a Database of Emotional Reactive Animations",
    "info": {
        "author": [
            "Alejandra Rojas García, Virtual Reality Lab, École Polytechnique Fédérale de Lausanne"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "June 2005",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/mlmi04uk_garcia_mmatp/",
    "segmentation": [
        [
            "Morning, I'm Alexandra and coming from people in Switzerland and we build a multimodality into for populating a database of emotion, attractive animations.",
            "We basically work with virtual humans in or laugh and we're orientation is to make them real.",
            "So in this talk I'm going to give you an introduction of."
        ],
        [
            "And or or motivations of the work and the related multimodal interfaces that we're get inspired on to build these two and some knowledge based systems that are for animations of virtual humans.",
            "And I will present my multimodal altering."
        ],
        [
            "OK, the introduction is since or goal Easton has a baby ability in virtual humans.",
            "We need we want him to pray and are naturally way and and have natural movements and also be able deliverable for all human beings.",
            "So we are focused now in replicas movements because they reflect movements are sometimes not considering in behavior and emotions of humans.",
            "So and when they are considered, they're repetitive sequences, or they perform robotic robotic movements so they are not very natural, so I will talk about the animation process Now an.",
            "This basically could be in different ways, and when it's key frame that we move the human in different position and record each frame and the other its motion capture that it's more natural and we put censoring one person and we get the movements of the person.",
            "So we attach these movements to the virtual human so we can get a natural movement.",
            "So using this, we're going to implement a model of animation, but with the animation process we also want to include some characteristics to or animation that we can.",
            "Uh, there is some.",
            "Variables that can help us in this case we will use personality and emotional states so we associate reflex movements to personality and emotional states because, for example is not the same.",
            "If I'm in district and somebody is playing football behind, and I'm very extroverted person.",
            "If the ball comes to me, maybe I will try to play with them or just going back the ball or something.",
            "But if I'm very nervous and are very wary of.",
            "About something they will not pay attention to the wall and maybe the world, which means so it's very different direction that we should want to target in this project.",
            "So there really."
        ],
        [
            "Active multimodal interfaces that we get inspired you maybe know the media room Bible that it consists in a large screen and using a sensor in hand when.",
            "Recognizing poster in the hand of the user and also speech recognizing so the user could point to something in the screen and can say something that he wants to do with the object that he pointed.",
            "So in our lab we we build a different tools that use this concept.",
            "The first one was a magic wand that it's a metaphor of magic.",
            "That using one he can say something like a regular and something happens.",
            "So we use speech recognize and gestures of the handset touching a sensor in one.",
            "Also we using these these magic one.",
            "We build a game that it's a new map.",
            "This Phoenix, in which the user had to target some some some things too.",
            "Gaining the to win in the game and it's.",
            "Just using this multimodal, it's also given a lot of immersive system having a large screen in.",
            "In a virtual environment to the user, it gives a very realistic immersion and it's very interesting for the users.",
            "Also we use another project that was conducted in a virtual orchestra, but where we have a virtual humans in an orchestra.",
            "Ann Lee user could fake like conductor of the orchestra by using a PDA system where the user can move the.",
            "We are to humans in some positions and also detecting the poster of the hand.",
            "He could say how fast or how how is conducting their caster an and this works like changing the tempo and dynamics in the musics.",
            "Also we use sonar old system to give the impression of immersion also."
        ],
        [
            "And another knowledge based system that are used for virtual human animation.",
            "We found that a move assistant that this system proposed to create the database with animation with some characteristic is attached at the animation.",
            "So we can pick the animations that we wanted or give some characteristics.",
            "So the animation could be useful.",
            "Other system it's a proposed rule using an emotional.",
            "As I say, they knew the presentation is very hard and expensive.",
            "It's not easy just to put record movements an that's all.",
            "It's it's more complicated, so there are some system that things.",
            "How can we reuse animation?",
            "Make some retargeting so they will be useful for anything more or less.",
            "And also we found the semantics into virtual humans that also give some semantics on meta data to the animation.",
            "So we can describe the animations as we needed or described.",
            "In this case they were told humans like better humans, has some properties, like an escalate own or could be an enable or not or.",
            "It's a lot of characteristic as well that we went or also hits female or a male, or which nationality it has so decent aladji proposed organization of the characteristics of virtual human.",
            "So we also take take into account of those systems.",
            "This the system, but nobody there.",
            "Another is the problem of populating the database of animation that it's very neat because if we want realistic animations, we need to have a large database.",
            "So because always we found that we were playing in games that are the same movements at that this is not we don't believe in.",
            "That's real.",
            "So to build a multimodal system we."
        ],
        [
            "Will bears the database and we have two here to look at some personality models and emotion models to address the to the animations.",
            "So the personality models are with phone that are more used in.",
            "Paper and for virtual humans are the fact I factor model of personality that it's all the characteristic explained.",
            "And we use give some points to each characteristic that we want to give to some animation and also for emotions we found.",
            "They also seem more OCC model that it's more for cognitive systems.",
            "That's also we consider equipments model that is for face expression and we group we found in one model that is for virtual humans that we they grew in that frame.",
            "And emotions that are more useful for body language or face expression.",
            "So we use that 6.",
            "So here is the structure of the database."
        ],
        [
            "And we have our virtual human that has personality one personality characteristic as an many.",
            "Combination of emotional states because we can have more than one emotions and these personality and emotions, it's associated to an animation.",
            "So and also the animation is associated to an event that will trigger the animation.",
            "So in under these this structure we can pick the animation that fits better to to the behavioral for character, and today event that it's going in the environment.",
            "So."
        ],
        [
            "You're a person.",
            "The scheme of the multimodal authoring tool.",
            "The it's.",
            "The main input that we found here is a motion capture system that we have an in or actor.",
            "An we use also these motion capture is our magnetic sensor that we attached to a body to a person and we use the right hand too.",
            "And the range hadn't sensor 2 to also detect the movement of the person because the person had this handheld device that it's.",
            "In this case we use a pedia, PDA and.",
            "With a menu that I will show you after that so the user can point to the large screen and select what mutual human and select an event so it will act.",
            "React to that even and we will get the movements that the that the human have in the in the with the motion capture and at the same time will it will be given the movements to the virtual humans so that we can see the virtual human reacting.",
            "So this also this data is managed by the manager system here and they we have here and 3D animation tools were all the 3DS managed and also it stores in the database the right animation with its describes.",
            "Characteristics of personality and emotions.",
            "So this is a.",
            "Technique is very much more less technical."
        ],
        [
            "Diagram so in the middle is assistant manager.",
            "How communicates we use Maya as a 3D authoring tool that it's the most common use tooling for 3D animations and also for movies.",
            "And also the PDA system."
        ],
        [
            "So here is a PDA system.",
            "First we have a screenshot that there were they human can select by pointing a virtual human in the large script.",
            "The second one is the personality that we have to sing from zero to 1.",
            "The personality of that we want to give an after the emotional state that we want to give to the virtual humans.",
            "And we also think from zero to 1.",
            "Points and finally we have this record, so it's a large button on proposed because we may be the user.",
            "It's very important to use the little pen to select or something so they just can use a finger and solid record and stop.",
            "So it's very easy.",
            "And also the play discard the discard the Save the.",
            "The animation.",
            "Here's some photos."
        ],
        [
            "Pictures of the animation process so we can see in the first one that is selecting and configuring a virtual human.",
            "The second one it's acting.",
            "And the third one it's when we record the the animation.",
            "We also recorded in.",
            "In a special file that we can reduce it in different kind of animations as we can see in the PDA it's different as in the large screen, so it allows us to use it in many many platforms.",
            "Also here we we found that sometimes the PDA was not very comfort table for the user because it was hard to decide when to start animating.",
            "If should keep the PDA that creating the hand or just leave it away or was a bit confusing.",
            "We we found that it was interesting for the user to have the large screen and he can see exactly in the moment the results that he's doing right or not the movements.",
            "And we also need to find out how to retrieve or how to get better movements about emotion emotions.",
            "So I use will show you the.",
            "What is the point here?",
            "No.",
            "I'm sorry.",
            "Just like when I."
        ],
        [
            "Ladies.",
            "It's a videos just like here.",
            "OK, these are the results that we get.",
            "By with the motion capture so.",
            "Is more or less all that we thought that could be, but still we need the something to decide which emotion we should've sink into this.",
            "So it's a heart.",
            "We found that it's very hard to decide which emotions we should I sing to each one, so we need to decide if we will use some video after of people like making some reflex or we will bring many people to use the motion, capture an test or immersive system and so.",
            "So it's still the future work that we want to do."
        ],
        [
            "So thank you for your attention.",
            "I found out what is your plans to get convincing recordings.",
            "Who users, users are these professional actors or lay people or people from your team?",
            "I mean, that's very important.",
            "Yeah, that's that's the main main problem.",
            "Now that we have, we also wanted to test the interface as it's convinced for user or not.",
            "Or we can use any videos from real people and we have to decide also.",
            "Which emotions have we are signaling to there to the video to the animations?",
            "But it's a problem that I'm sure that we have to target, but it's still where we're thinking in using some videos from May that we have in the database I guess, but I I'm not sure still, but it's it's hard to say us from single person to decide which emotions because he's not very objective to decide.",
            "Just we need a real sources, so maybe we will bring many people to 11, make some tests and have some personality also.",
            "But data basis.",
            "Or that that could be useful.",
            "Yeah.",
            "I'm sorry you need to go out.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Morning, I'm Alexandra and coming from people in Switzerland and we build a multimodality into for populating a database of emotion, attractive animations.",
                    "label": 0
                },
                {
                    "sent": "We basically work with virtual humans in or laugh and we're orientation is to make them real.",
                    "label": 0
                },
                {
                    "sent": "So in this talk I'm going to give you an introduction of.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And or or motivations of the work and the related multimodal interfaces that we're get inspired on to build these two and some knowledge based systems that are for animations of virtual humans.",
                    "label": 0
                },
                {
                    "sent": "And I will present my multimodal altering.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, the introduction is since or goal Easton has a baby ability in virtual humans.",
                    "label": 0
                },
                {
                    "sent": "We need we want him to pray and are naturally way and and have natural movements and also be able deliverable for all human beings.",
                    "label": 0
                },
                {
                    "sent": "So we are focused now in replicas movements because they reflect movements are sometimes not considering in behavior and emotions of humans.",
                    "label": 0
                },
                {
                    "sent": "So and when they are considered, they're repetitive sequences, or they perform robotic robotic movements so they are not very natural, so I will talk about the animation process Now an.",
                    "label": 0
                },
                {
                    "sent": "This basically could be in different ways, and when it's key frame that we move the human in different position and record each frame and the other its motion capture that it's more natural and we put censoring one person and we get the movements of the person.",
                    "label": 0
                },
                {
                    "sent": "So we attach these movements to the virtual human so we can get a natural movement.",
                    "label": 0
                },
                {
                    "sent": "So using this, we're going to implement a model of animation, but with the animation process we also want to include some characteristics to or animation that we can.",
                    "label": 0
                },
                {
                    "sent": "Uh, there is some.",
                    "label": 0
                },
                {
                    "sent": "Variables that can help us in this case we will use personality and emotional states so we associate reflex movements to personality and emotional states because, for example is not the same.",
                    "label": 0
                },
                {
                    "sent": "If I'm in district and somebody is playing football behind, and I'm very extroverted person.",
                    "label": 0
                },
                {
                    "sent": "If the ball comes to me, maybe I will try to play with them or just going back the ball or something.",
                    "label": 0
                },
                {
                    "sent": "But if I'm very nervous and are very wary of.",
                    "label": 0
                },
                {
                    "sent": "About something they will not pay attention to the wall and maybe the world, which means so it's very different direction that we should want to target in this project.",
                    "label": 0
                },
                {
                    "sent": "So there really.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Active multimodal interfaces that we get inspired you maybe know the media room Bible that it consists in a large screen and using a sensor in hand when.",
                    "label": 0
                },
                {
                    "sent": "Recognizing poster in the hand of the user and also speech recognizing so the user could point to something in the screen and can say something that he wants to do with the object that he pointed.",
                    "label": 1
                },
                {
                    "sent": "So in our lab we we build a different tools that use this concept.",
                    "label": 1
                },
                {
                    "sent": "The first one was a magic wand that it's a metaphor of magic.",
                    "label": 0
                },
                {
                    "sent": "That using one he can say something like a regular and something happens.",
                    "label": 1
                },
                {
                    "sent": "So we use speech recognize and gestures of the handset touching a sensor in one.",
                    "label": 0
                },
                {
                    "sent": "Also we using these these magic one.",
                    "label": 0
                },
                {
                    "sent": "We build a game that it's a new map.",
                    "label": 1
                },
                {
                    "sent": "This Phoenix, in which the user had to target some some some things too.",
                    "label": 1
                },
                {
                    "sent": "Gaining the to win in the game and it's.",
                    "label": 0
                },
                {
                    "sent": "Just using this multimodal, it's also given a lot of immersive system having a large screen in.",
                    "label": 1
                },
                {
                    "sent": "In a virtual environment to the user, it gives a very realistic immersion and it's very interesting for the users.",
                    "label": 1
                },
                {
                    "sent": "Also we use another project that was conducted in a virtual orchestra, but where we have a virtual humans in an orchestra.",
                    "label": 0
                },
                {
                    "sent": "Ann Lee user could fake like conductor of the orchestra by using a PDA system where the user can move the.",
                    "label": 0
                },
                {
                    "sent": "We are to humans in some positions and also detecting the poster of the hand.",
                    "label": 0
                },
                {
                    "sent": "He could say how fast or how how is conducting their caster an and this works like changing the tempo and dynamics in the musics.",
                    "label": 0
                },
                {
                    "sent": "Also we use sonar old system to give the impression of immersion also.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And another knowledge based system that are used for virtual human animation.",
                    "label": 0
                },
                {
                    "sent": "We found that a move assistant that this system proposed to create the database with animation with some characteristic is attached at the animation.",
                    "label": 0
                },
                {
                    "sent": "So we can pick the animations that we wanted or give some characteristics.",
                    "label": 0
                },
                {
                    "sent": "So the animation could be useful.",
                    "label": 0
                },
                {
                    "sent": "Other system it's a proposed rule using an emotional.",
                    "label": 0
                },
                {
                    "sent": "As I say, they knew the presentation is very hard and expensive.",
                    "label": 0
                },
                {
                    "sent": "It's not easy just to put record movements an that's all.",
                    "label": 0
                },
                {
                    "sent": "It's it's more complicated, so there are some system that things.",
                    "label": 0
                },
                {
                    "sent": "How can we reuse animation?",
                    "label": 0
                },
                {
                    "sent": "Make some retargeting so they will be useful for anything more or less.",
                    "label": 0
                },
                {
                    "sent": "And also we found the semantics into virtual humans that also give some semantics on meta data to the animation.",
                    "label": 0
                },
                {
                    "sent": "So we can describe the animations as we needed or described.",
                    "label": 0
                },
                {
                    "sent": "In this case they were told humans like better humans, has some properties, like an escalate own or could be an enable or not or.",
                    "label": 0
                },
                {
                    "sent": "It's a lot of characteristic as well that we went or also hits female or a male, or which nationality it has so decent aladji proposed organization of the characteristics of virtual human.",
                    "label": 0
                },
                {
                    "sent": "So we also take take into account of those systems.",
                    "label": 0
                },
                {
                    "sent": "This the system, but nobody there.",
                    "label": 0
                },
                {
                    "sent": "Another is the problem of populating the database of animation that it's very neat because if we want realistic animations, we need to have a large database.",
                    "label": 0
                },
                {
                    "sent": "So because always we found that we were playing in games that are the same movements at that this is not we don't believe in.",
                    "label": 0
                },
                {
                    "sent": "That's real.",
                    "label": 0
                },
                {
                    "sent": "So to build a multimodal system we.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will bears the database and we have two here to look at some personality models and emotion models to address the to the animations.",
                    "label": 0
                },
                {
                    "sent": "So the personality models are with phone that are more used in.",
                    "label": 0
                },
                {
                    "sent": "Paper and for virtual humans are the fact I factor model of personality that it's all the characteristic explained.",
                    "label": 0
                },
                {
                    "sent": "And we use give some points to each characteristic that we want to give to some animation and also for emotions we found.",
                    "label": 0
                },
                {
                    "sent": "They also seem more OCC model that it's more for cognitive systems.",
                    "label": 0
                },
                {
                    "sent": "That's also we consider equipments model that is for face expression and we group we found in one model that is for virtual humans that we they grew in that frame.",
                    "label": 0
                },
                {
                    "sent": "And emotions that are more useful for body language or face expression.",
                    "label": 0
                },
                {
                    "sent": "So we use that 6.",
                    "label": 0
                },
                {
                    "sent": "So here is the structure of the database.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have our virtual human that has personality one personality characteristic as an many.",
                    "label": 0
                },
                {
                    "sent": "Combination of emotional states because we can have more than one emotions and these personality and emotions, it's associated to an animation.",
                    "label": 0
                },
                {
                    "sent": "So and also the animation is associated to an event that will trigger the animation.",
                    "label": 0
                },
                {
                    "sent": "So in under these this structure we can pick the animation that fits better to to the behavioral for character, and today event that it's going in the environment.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You're a person.",
                    "label": 0
                },
                {
                    "sent": "The scheme of the multimodal authoring tool.",
                    "label": 1
                },
                {
                    "sent": "The it's.",
                    "label": 1
                },
                {
                    "sent": "The main input that we found here is a motion capture system that we have an in or actor.",
                    "label": 1
                },
                {
                    "sent": "An we use also these motion capture is our magnetic sensor that we attached to a body to a person and we use the right hand too.",
                    "label": 1
                },
                {
                    "sent": "And the range hadn't sensor 2 to also detect the movement of the person because the person had this handheld device that it's.",
                    "label": 0
                },
                {
                    "sent": "In this case we use a pedia, PDA and.",
                    "label": 0
                },
                {
                    "sent": "With a menu that I will show you after that so the user can point to the large screen and select what mutual human and select an event so it will act.",
                    "label": 1
                },
                {
                    "sent": "React to that even and we will get the movements that the that the human have in the in the with the motion capture and at the same time will it will be given the movements to the virtual humans so that we can see the virtual human reacting.",
                    "label": 0
                },
                {
                    "sent": "So this also this data is managed by the manager system here and they we have here and 3D animation tools were all the 3DS managed and also it stores in the database the right animation with its describes.",
                    "label": 0
                },
                {
                    "sent": "Characteristics of personality and emotions.",
                    "label": 0
                },
                {
                    "sent": "So this is a.",
                    "label": 0
                },
                {
                    "sent": "Technique is very much more less technical.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Diagram so in the middle is assistant manager.",
                    "label": 0
                },
                {
                    "sent": "How communicates we use Maya as a 3D authoring tool that it's the most common use tooling for 3D animations and also for movies.",
                    "label": 0
                },
                {
                    "sent": "And also the PDA system.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is a PDA system.",
                    "label": 0
                },
                {
                    "sent": "First we have a screenshot that there were they human can select by pointing a virtual human in the large script.",
                    "label": 0
                },
                {
                    "sent": "The second one is the personality that we have to sing from zero to 1.",
                    "label": 0
                },
                {
                    "sent": "The personality of that we want to give an after the emotional state that we want to give to the virtual humans.",
                    "label": 0
                },
                {
                    "sent": "And we also think from zero to 1.",
                    "label": 0
                },
                {
                    "sent": "Points and finally we have this record, so it's a large button on proposed because we may be the user.",
                    "label": 0
                },
                {
                    "sent": "It's very important to use the little pen to select or something so they just can use a finger and solid record and stop.",
                    "label": 0
                },
                {
                    "sent": "So it's very easy.",
                    "label": 0
                },
                {
                    "sent": "And also the play discard the discard the Save the.",
                    "label": 0
                },
                {
                    "sent": "The animation.",
                    "label": 0
                },
                {
                    "sent": "Here's some photos.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Pictures of the animation process so we can see in the first one that is selecting and configuring a virtual human.",
                    "label": 1
                },
                {
                    "sent": "The second one it's acting.",
                    "label": 1
                },
                {
                    "sent": "And the third one it's when we record the the animation.",
                    "label": 1
                },
                {
                    "sent": "We also recorded in.",
                    "label": 1
                },
                {
                    "sent": "In a special file that we can reduce it in different kind of animations as we can see in the PDA it's different as in the large screen, so it allows us to use it in many many platforms.",
                    "label": 1
                },
                {
                    "sent": "Also here we we found that sometimes the PDA was not very comfort table for the user because it was hard to decide when to start animating.",
                    "label": 0
                },
                {
                    "sent": "If should keep the PDA that creating the hand or just leave it away or was a bit confusing.",
                    "label": 0
                },
                {
                    "sent": "We we found that it was interesting for the user to have the large screen and he can see exactly in the moment the results that he's doing right or not the movements.",
                    "label": 0
                },
                {
                    "sent": "And we also need to find out how to retrieve or how to get better movements about emotion emotions.",
                    "label": 0
                },
                {
                    "sent": "So I use will show you the.",
                    "label": 0
                },
                {
                    "sent": "What is the point here?",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "Just like when I.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ladies.",
                    "label": 0
                },
                {
                    "sent": "It's a videos just like here.",
                    "label": 0
                },
                {
                    "sent": "OK, these are the results that we get.",
                    "label": 0
                },
                {
                    "sent": "By with the motion capture so.",
                    "label": 0
                },
                {
                    "sent": "Is more or less all that we thought that could be, but still we need the something to decide which emotion we should've sink into this.",
                    "label": 0
                },
                {
                    "sent": "So it's a heart.",
                    "label": 0
                },
                {
                    "sent": "We found that it's very hard to decide which emotions we should I sing to each one, so we need to decide if we will use some video after of people like making some reflex or we will bring many people to use the motion, capture an test or immersive system and so.",
                    "label": 0
                },
                {
                    "sent": "So it's still the future work that we want to do.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "I found out what is your plans to get convincing recordings.",
                    "label": 0
                },
                {
                    "sent": "Who users, users are these professional actors or lay people or people from your team?",
                    "label": 0
                },
                {
                    "sent": "I mean, that's very important.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's that's the main main problem.",
                    "label": 0
                },
                {
                    "sent": "Now that we have, we also wanted to test the interface as it's convinced for user or not.",
                    "label": 0
                },
                {
                    "sent": "Or we can use any videos from real people and we have to decide also.",
                    "label": 0
                },
                {
                    "sent": "Which emotions have we are signaling to there to the video to the animations?",
                    "label": 0
                },
                {
                    "sent": "But it's a problem that I'm sure that we have to target, but it's still where we're thinking in using some videos from May that we have in the database I guess, but I I'm not sure still, but it's it's hard to say us from single person to decide which emotions because he's not very objective to decide.",
                    "label": 0
                },
                {
                    "sent": "Just we need a real sources, so maybe we will bring many people to 11, make some tests and have some personality also.",
                    "label": 0
                },
                {
                    "sent": "But data basis.",
                    "label": 0
                },
                {
                    "sent": "Or that that could be useful.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry you need to go out.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}