{
    "id": "p7hmmoyemwsvjclqkn2nh3btkocbupq3",
    "title": "Programming the Semantic Web",
    "info": {
        "introducer": [
            "Fabien Gandon, INRIA Sophia Antipolis"
        ],
        "author": [
            "Steffen Staab, Institute for Web Science and Technologies (WeST), University of Koblenz-Landau"
        ],
        "published": "July 30, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/eswc2014_staab_semantic_web/",
    "segmentation": [
        [
            "So it's a great pleasure for me to introduce Steven.",
            "How can I introduce someone who no longer needs to be introduced?",
            "In fact, in this community everyone was different, so let me say that every year for me.",
            "It's getting harder and harder to confess that I defended my PhD in 2002.",
            "But already at that time.",
            "Among the most important references I was quoted while the paper called Ontology Learning.",
            "For the semantic Web by Alexander Match Ann Stephens tab.",
            "The work of Satan has been influential in general for the whole field of knowledge based information system, ontology oriented approaches, and the semantic web.",
            "Of course, but long before the Semantic Web conference, you could already meet Steven at each guy at hi at HCI at AAAI, at a cow, and pack him, and then of course as one of the author of the paper at the first Semantic Web Conference in 2002.",
            "So if you really need to be convinced.",
            "Just look at this slide.",
            "Actually my main problem designing the slide was to decide if I needed one or two slides.",
            "Because he has a huge number of book he's being involved in very prestigious prices.",
            "He received.",
            "Steven studied computer science and computational linguistics in Germany and in USA an he worked as a researcher at the University of Stuttgart, Front over and of course, through before becoming a professor at Coblentz, where he now is the director of the Institute of Websites and Technologies and Institute of for Computer Science.",
            "His first paper in 1995 at Eurospeech starts with this sentence, saying the process of understanding language requires the efficient processing of ambiguities that arise by the nature of speech.",
            "So since then, Stephens been contributing a lot to Arden's understanding and joint issues of data and text.",
            "The domain of his contribution include ontologies, Semantic web, social web, data engineering, text mining, peer to peer multimedia, HCI services, software modeling, and even programming.",
            "And actually today the talk of Steven is on this last topic programming.",
            "In fact, we will start with the hypothesis that we have not yet developed the right kind of programming paradigm to deal properly with the semantic Web data.",
            "So it is truly an honor for me to introduce a pioneer of the semantic web.",
            "And please join me in welcoming Stephens Tab for this opening keynotes.",
            "Thank you.",
            "OK, so fabulous.",
            "Thanks a lot for this lettering words and I never thought that anyone would ever in the world look up this 95 paper for any reason, right?",
            "So be aware what you write in your first paper.",
            "Before I start the talk proper, I know there are always some expectations about a keynote talk.",
            "Therefore, I thought it would give you."
        ],
        [
            "I'm warning yeah.",
            "So I cannot talk is typically to be very philosophical.",
            "Now.",
            "Luciano is the philosopher here.",
            "Give a keynote talk.",
            "So I thought I would rather go through the country and I want you.",
            "So if you don't want to see program code engineering some speculation, some opinion you may rather leave the room now without embarrassment, right?",
            "Otherwise maybe you just hang on, but please, then don't be offended about that.",
            "No."
        ],
        [
            "Semantic web.",
            "I think we have a great history.",
            "Because when you look back these 15 years we were."
        ],
        [
            "We talking about small systems, tiny systems with a few 100 facts that we're trying to pull a couple of pieces of data together.",
            "And now we talk about about billions of facts that are coming from different sources that are combined together with text together with other kind of data.",
            "So we talked really about big systems, so we achieved quite a long way in these 15 years."
        ],
        [
            "What is also very nice that some of these big systems are in everyday practice now.",
            "I mean, schema.org is one of the most I think eminent once, but you have other kind of applications at the news agencies or Reuters, New York Times.",
            "You could have a rather long list.",
            "I know from harmless, probably around somewhere, and he always maintains its nice list of applications are back there and he's always this really, really nice list of applications.",
            "So we have all reasons to be proud about this kind of practice.",
            "That's happening."
        ],
        [
            "And we also have quite some research influence, so you can see semantic Web now being discussed not only in this event, but you have it in the eye conferences you have in the database conferences.",
            "I have colleagues in programming languages who use RDF for all kinds of reasons even without me influencing them in any kind of way.",
            "So people are picking it up."
        ],
        [
            "Nevertheless, to pour some water into the wine, we still want really mainstream adoption.",
            "I mean, be serious, we are not there.",
            "That, like every computer science students, knows the semantic web right?",
            "It's not come parable to people using relational databases.",
            "And of course there are a whole bunch of reasons, but one reason that I want to approach today is that eventually we need good support for the core task of that we have in computer science and the core task in the end is software development is Pro."
        ],
        [
            "Cramming so.",
            "We need to support the developers, programmers in making their task most efficient and I try to elucidate a bit.",
            "What are the reasons that they are not as efficient as they could be if we exploit our full potential.",
            "The kind of possibilities that we have from our kind of modeling styles from our kind of engineering styles and of course my target is to make this red box or green box and providing some support and maybe.",
            "You would be a bit encouraged to help in this endeavour.",
            "No, why is this still a red box right now?",
            "So let me give First Birds Eye view and then I wanted to dig a bit deeper and even to do something stupid is showing some code in this keynote talk, right?"
        ],
        [
            "So what is first like the bird?"
        ],
        [
            "I few on this problem that we do not really have such great support for actual programming.",
            "Well."
        ],
        [
            "First, we have great stayed out there and the data, but of course comes in very different forms, which doesn't make it quite easier for the programmer, right?",
            "So we have files RDF files that we can just download.",
            "We have linked data that we can dereference where we can get the properties that ripples, so we pick one data item at a time.",
            "We have a very stable method to do that even if many of his resources are down.",
            "Quite often.",
            "We have sparcl endpoints and we do this for data alike as well As for ontologies.",
            "So that's already quite a heterogeneous field.",
            "That's even something which is not so easy to understand by the outsider, and in a way what we should do is to sort of like shield the outsider a bit from that.",
            "Even if you commit to one of these particular paradigms of getting at your data, my hypothesis."
        ],
        [
            "Is here is that when we wrote so many wet paper in the 2000?",
            "We already had this problem that what we program was very brittle.",
            "Every time the ontology changed, the code would break every time the exact location of data would change.",
            "The code might break, so already then there was this."
        ],
        [
            "Mom is on the one side.",
            "To have a lot of flexibility for your data, and I think that's fully true, we're it's very easy in our kind of semantic web approach to add further conceptual descriptions to enrich the ontology to take another ontology to map between different approaches.",
            "We have a lot of flexibility in the data engineering that we provide.",
            "But it's not good enough to only do this on the data engineering side, because if you have all this flexibility on data engineering, but you don't have the same kind of flexibility on your programming site, your code will break once you don't have this very close alignment.",
            "Of course you can try to do to consider everything to be a graph, and then you only talk about notes.",
            "But if you look at typical applications of graphs, that's not what is happening.",
            "What would be typical applications?",
            "Facebook for example.",
            "Facebook is a big graph.",
            "How much of the big graph do you really see in front end, right?",
            "Not really.",
            "That much.",
            "You see people you see friendship links.",
            "You see organizations.",
            "There's a big graph underneath and it's very useful to have such a big graph to be able to query it and to work with that kind of data.",
            "But you don't want to see it on the front, and in most cases with some I would say rather esoteric exception.",
            "Sometimes if you take the whole picture.",
            "So the graph is very useful.",
            "The graph is very flexible.",
            "The kind of ontologies that we provide are flexible and I think go quite a bit beyond what Facebook has in the background.",
            "But in the end you want to have a program that gives you the right kind of you where you don't care that there's a graph in the background.",
            "But how do you keep these two worlds synced up together?",
            "It's not such an easy task and I don't think we do a very good job right now at supporting this gap that exists there.",
            "Whoa."
        ],
        [
            "Why don't we support this gap very well?",
            "Well, on the left side we have our nice and fancy data and our ontologies and we work a lot in data management, right?",
            "If you look here at the conference papers, there are plenty of papers that deal with querying that deal with getting some data that deal with analyzing the data, and that's all great work.",
            "I really love that, so it's not something that we should discard or that we can discard this stuff that we need to do, but.",
            "I would call it here.",
            "Something like insights, data management, becausw it's a little bit of solipsistic view.",
            "We care about the data, we create it, but in the end we have a right hand side the developers and they have some sort of environment that might be a clips that might Visual Studio.",
            "They are dozens of other kind of software development environments that they use in order to build their programs, but there's quite.",
            "Some gap."
        ],
        [
            "Between this insight, then that data management where we care about our structures, our analytics, and what these kind of software development environments really need in order to help the programmer.",
            "So what do I count towards?",
            "This insight per?"
        ],
        [
            "Spectr if there is very simple stuff and it's good that we have a simple basis because we can extend that in a very robust manner, like having something simple as HTTP get for downloading files or dereference dereference in your eyes.",
            "We have query execution in our sparkle endpoints.",
            "We have even update.",
            "We do all kind of indexing to make this whole approach scale out and I think we can be proud to which extend the scalability of our approach is improved.",
            "Over the last decade.",
            "We have triple ification, let's say from a relational databases into triples.",
            "Their wonderful approaches out there.",
            "An oral from content management systems that give you a lot of data that's before was close into a very open format, and even that in a scalable manner.",
            "So you can do data integration.",
            "We deal with streaming, but this I call the inside fuel.",
            "It's maybe not very nice work.",
            "Nice work because it's mostly the few that says OK, we deal with our data, we don't care about how someone else is.",
            "Dealing with what we deliver to them.",
            "So."
        ],
        [
            "The gap here is between these two worlds.",
            "This inside data management and the development site.",
            "Whatever kind of tool you use on that development site so.",
            "My suggestion here is that."
        ],
        [
            "We need to better fill this gap by what I call here again, the term is not very nice, but I call here outside data management.",
            "What are the kind of services we need to deliver in order to support the programmer in his tasks over there?"
        ],
        [
            "So what would this outside few include?",
            "And of course, I'm speculating a bit.",
            "Yeah, and I hope that in the discussion you give me 10 more suggestions of what we should include.",
            "What do we include in this outside view?"
        ],
        [
            "Well, in the 1st place I would put their understanding by the developer.",
            "We shouldn't assume that the developer is very familiar with Sparkle with RDF axioms or with OWL.",
            "We should rather assume that uses the tools as a rather naive developer, and that's of course happening with all other kinds of technologies to.",
            "There's also happening with relational databases.",
            "A lot of the people who do the programming, let's say in the bioinformatics worlds, they are by all.",
            "A biologist, and they not necessarily are experts in how to exactly formalize a schema in relational database, so that's quite normal.",
            "The developer should.",
            "No, as little as possible from this world on the left side and still be able to accomplish not all tasks, but quite many tasks."
        ],
        [
            "And."
        ],
        [
            "Understanding of course even means very simple things like searching, encoding or browsing encoding right in the 1st place the developer over there does not know what is all hidden in this data and ontologies on the left side.",
            "And of course we have very nice search tools browsing tools, but they're not really connected to the world on the right.",
            "Yeah, you can search.",
            "You can browse, but then with current tools you would have to copy paste.",
            "That's not really a smooth process.",
            "In order to support this kind of development right in the 1st place, we really have this need that someone wants to.",
            "Let's say my running example would be about music, be able to discover what kind of concepts are offered to me about records about artists and how can I then program an interesting few on that.",
            "Maybe include this in my Facebook app or wherever.",
            "So we need some support for the developer tool to search for things to browse for things and directly use this in the code, 'cause I mean we also have we have one nice thing which is also very bad, which are your eyes.",
            "I mean, your eyes are wonderful because it gives you a globally unique identifier.",
            "There are also awful because you have these awkwardly long names right and you have to deal with them.",
            "And when you program with them, you need the right kind of support.",
            "It's sort of a very trivial thing, but even back in the 2000 when we wrote our papers, we had enormous problems with just maintaining identifiers that have very long names.",
            "Right?",
            "Because misspellings are very easy to happen, so you need to reduce this kind of friction.",
            "Some of that is really trivial, but you need to do this kind of trivial things in order to accomplish something.",
            "Um?"
        ],
        [
            "And then.",
            "Most of the development over there is happening in an object oriented way, maybe in a functional way or in a mixture of the two.",
            "It's not happening in a triple oriented programming style and I don't think a triple oriented programming style would help would be really useful, or at least I don't know one that is really useful.",
            "So maybe if you have an idea of how to do really well triple oriented programming, maybe that's the next paper you should write, But so far I have not seen that.",
            "So what we observe for existing semantic web programs is that you have this triple object mapping.",
            "And that's rather neglected.",
            "There are a few papers out there on doing this, but mostly what we deal with.",
            "This ontology alignments.",
            "We take two ontologies from our world and in a nice solipsistic approach.",
            "We map between our world in our world.",
            "But what we really need to do is we need to map between our world and the downstream world that's supposed to use our approaches.",
            "So we need to map between triples and objects, and in a way that's really supportive of what the developer wants to achieve."
        ],
        [
            "And that of course means then that we need to generate codes for him or for her.",
            "So we should not just like say OK here.",
            "Now we have the very abstract mapping police re encode this all manually.",
            "We should rather say OK, here we have some ontology and some mapping.",
            "Please generate the code and if there is some change we can help you with that because that's of course then the bigger issue that in our world where we have a lot of flexibility, we're supposed to expect change.",
            "It should not be the exception that relational table changes should be the normal way of.",
            "Doing that concept and relations change all the time.",
            "And the only way to deal with that is to have some sort of automatic approach to support the developer doing this."
        ],
        [
            "And then we have this process of Federation."
        ],
        [
            "The simplest problem, simplest in away problem there is that we have these different kinds of data will be at linked data with sparkling points with RDF dumps where we don't have a good model for how to reconcile between getting these different kinds of data."
        ],
        [
            "But it's even if you just stick with one paradigm we have don't have good support right now to say I want to have data from this and from there, and that's what I need to integrate.",
            "So we don't have these models of separation, so these are some examples of layers."
        ],
        [
            "And that would facilitate a developer's life.",
            "And now we don't have so much or that we don't have integrated in a way that's really useful for the developer.",
            "Now, should we really care about this?",
            "Why?",
            "I mean, isn't it good enough to have this wonderful SPARQL endpoint?",
            "And then people can query and do with it.",
            "Isn't that the right layer of abstraction?"
        ],
        [
            "What I tried to do here is a little bit to give you a rational, but what are the costs involved with doing only this inside approach versus also doing the outside approach?",
            "So what if you program with data?",
            "What does it cost you right?",
            "If you take the total cost?",
            "Well if you take the total cost here, the first thing you have to pay for all the tools Now, typically that's actually not so bad.",
            "'cause we're researchers, we develop tools, donate them to the outside world.",
            "So the tools.",
            "Are typically not not too expensive.",
            "It's not true for all tools there.",
            "Quite expensive commercial tools around, so that's not ask that.",
            "Of course, for each tool you have to pay a certain price, you have too many tools that contributes to the overall cost."
        ],
        [
            "Then there is a very important cost to consider, especially if you don't talk attacking our community while you more or less assume people know what you talk about, what when you target a community downstream.",
            "Who wants to develop with our kind of approaches?",
            "Because this downstream community has to learn to some extent, our approaches.",
            "And there was a very nice paper.",
            "Or is there is no very nice paper by Daniel over there he's from SAP and he reports a bit on some of the rational of not including a great new technology in the technology stack of ASAP.",
            "The reason being that you have all these many thousands of developers, and if you include something new in the technology stack.",
            "These people have to learn this technology to some extent, and that's quite enormous cost factor.",
            "Maybe you stick with the not so great technology.",
            "Just because people don't have to learn a novel technology.",
            "So if you have.",
            "A new technology.",
            "You have some costs of each technology would be T + 1, so to say, and for each developer that's concerned with this particular program, there's a cost involved for just learning it."
        ],
        [
            "Then of course we either do some data engineering or we look at some data that is engineered and we need to understand it.",
            "So either we built a data source from scratch or we look at a given data source and have to understand what's in there.",
            "That's what I hear refer to with this cost factor, where for each data source there are as many data sources.",
            "We have to understand what's in this data source, and that's a really non neglectable knowledge, so if you look into a like a large data source, and once that student was working at SFP and was there in the company and he wanted to connect something simple like people and projects and topics and all the data was available in the database, it took him two days just to find the two pieces of information where they are stored.",
            "Right, so I mean, I hope we can be a quite a bit better because our ontologies are much better guidance towards that, but still.",
            "Having today's to to find 2 pieces of information that you can correlate is quite a drastic effort to accomplish something.",
            "And then what happens quite often these people just say oh, the information is not there.",
            "Let's start a new database.",
            "We don't want that.",
            "We rather want an understanding and we need understanding to be able to program with the available data, of course."
        ],
        [
            "Once you have that understanding, we need to do this mapping.",
            "This triple object mapping and for each source you have basically have to do this.",
            "So that's another constructor."
        ],
        [
            "And of course, eventually after a long list of cost factors you actually have to develop program code.",
            "And of course for each, let's say access manipulation of data, there is a certain cost factor involved.",
            "So that's a rough estimate of what are some costs involved in the program."
        ],
        [
            "And you see some of that is on the outside part where we provide technologies to other developers and some in the inside part, and some is really both right.",
            "It's a mixture of both tools for inside also the outside world now."
        ],
        [
            "These costs, there are opportunities.",
            "There are threats, strengths, weaknesses involved, and I just want."
        ],
        [
            "To point them out here, the tool factor already mentioned is a certain weakness.",
            "We don't have that great tools.",
            "On the other hand, I don't see it as the major one, so it's."
        ],
        [
            "A minor weakness, and we could even turn it into an advantage."
        ],
        [
            "The learning factor here is really a threat.",
            "If we don't overcome this learning obstacle, we're not supposed to expect a mainstream adoption, right?",
            "So that's a certain threat we need to."
        ],
        [
            "To work with and just being as good as existing technology is not good enough, you really need to be better in order to make it worth for this technology to be picked up."
        ],
        [
            "The data engineering and understanding I think we can be quite strong becausw I think it's much more.",
            "We work at a more conceptual level than, let's say relational databases, so I think that's a strength.",
            "We are not quite as performed yet in some aspects.",
            "Sometimes we are, so it doesn't look too bad.",
            "I would."
        ],
        [
            "See."
        ],
        [
            "And then we have here these opportunities where we need to map from triples to objects where other people need to map from tables to object and where I think our community has a lot to say about performing these kind of mappings which is which."
        ],
        [
            "Could be opportunity, but currently at the point at this point in time it is not a strength, yet it's not and it's still an opportunity, and the same is true for code and I want to show you how we pursue this approach to make it an opportunity."
        ],
        [
            "When I look at this cost factor I also.",
            "I mean it's it's a quite complex formula, even though it's abstr."
        ],
        [
            "From many other things right?",
            "I want to give you an intuition of.",
            "Two ways in which we could target these cost factors to go closer to mainstream adoption."
        ],
        [
            "So.",
            "One scenario is the automated setup.",
            "Automated setup basically means we use one of these automatic mapping approaches that are around there that exists for relational database that exist for semantic web.",
            "And.",
            "Then of course the difference here is that we have the same kind of automated setup costs, but for semantic web we have this additional learning curve that we need to take care of.",
            "Then our target must be to be able to develop faster with the code.",
            "Because then we can surpass like existing technologies, and I think that's a quite reasonable assumption that we can surpass here.",
            "The total costs 'cause it's easier to program with semantic web data.",
            "And then let's say with a relational database, because we store data at a conceptual level and then programming with that should be easier."
        ],
        [
            "This applies mostly to small and so if you have little interaction with the database, if you have a lot of interaction."
        ],
        [
            "Is a database.",
            "What happens then then?",
            "The best thing is you build your perfect object model manually, because if you have a perfect object model you don't care about how the database below is connected, you just deal with this object model and then you don't care what kind of back in store you have.",
            "You must be better in the setup cost, so mapping the data source to your object model must come at a lower cost, otherwise you cannot compete because the object models just saves the work from talking to the back end."
        ],
        [
            "OK, so lessons learned from this kind of observations.",
            "It's quite a bit speculation too.",
            "It's not a proof.",
            "We need to minimize the cost for the set up to counter the learning needs.",
            "And especially the mapping is, I think are quite a good opportunity for us."
        ],
        [
            "Then we also need to minimize the costs for the core programming tasks.",
            "So."
        ],
        [
            "Let's look at some.",
            "Current way of dealing with issues and then I want to present our approach to that."
        ],
        [
            "And I have a small running example for that.",
            "You talk to bubble here in the Elodie cloud, of course, eventually we want to talk to all bubbles in the yellow D cloud or a significant subset, but right now we talked to one bubbling yellow D cloud.",
            "And it's a moderate size bubble with 1 million triples.",
            "Plus some predicates from 18 different mythologise like friend of a friend, music Ontology and others.",
            "And you have a very simple programming task.",
            "The task is to list for every music artist you find in there and jamendo the records they made well.",
            "It's really straightforward tasks, not so hard to understand.",
            "Without duplicate, build this in or not.",
            "So the question was without duplication or not.",
            "I don't even care right?",
            "So that's the fine tuning.",
            "Then I don't want to make the task to complicated."
        ],
        [
            "So what is the process that you have to initiate?",
            "Well, you start your initial data model and say I want to have something like an artist in a record so you have an initial data model design."
        ],
        [
            "Then you explore what do you have in the data source?",
            "It's an artist.",
            "It isn't.",
            "Couldn't slur.",
            "Is it a?",
            "I don't know what music, artists and."
        ],
        [
            "So really, come up with the revised data model design before you go to create your model.",
            "Actually encode.",
            "Yeah, you need to somehow declare that's my class.",
            "That's my methods and so on so forth.",
            "So you have a data model prototype.",
            "Then you go on to."
        ],
        [
            "Actually realize your queries you have to define your queries and maybe that leads."
        ],
        [
            "Due to a revision, you need to map also.",
            "Then the query result.",
            "That you get.",
            "Back into your object model, why?"
        ],
        [
            "Well, I'll show you here.",
            "Here's some code, so I promised you don't feel offended.",
            "Here's some code, there's not much that you have to recognize here.",
            "The important thing here is you have a query string.",
            "And it is what it says.",
            "It's a string.",
            "Why so you compile something?",
            "And and you have some results set and that results that comes from executing your query.",
            "And then actually you have to map back because the results it again is a string.",
            "Or a list of strings.",
            "So you do this mapping of what you have in your object model into strings.",
            "And then you do something clever, and then you again work with strings.",
            "Huh?",
            "It doesn't sound very clever, does it?",
            "But I mean that's the normal way of working these days, so it's no complaint against their efforts.",
            "Really.",
            "Great effort, Appacha Gina, so it's just like our current state of the art."
        ],
        [
            "And well, and then of course you can go over this list of strings.",
            "There are some more intricacies, so maybe that maybe then you want even to look into the kind of strings.",
            "What do they have and what do you do you?",
            "For example, you say an artist has some properties.",
            "Now you're interested in the music Ontology made property.",
            "So you code basically some part of the ontology into your program code.",
            "Now what if the property name changes?",
            "Your program code breaks.",
            "So we have here a standard approach of programming with the semantic web and every time something in your ontology changes, the code breaks and you're not warned about it.",
            "So that's not exactly what I would call robust programming.",
            "It may work for a small prototype that you run for a day and then it's over right, but if you want to maintain something, it's not really that great approach so."
        ],
        [
            "The observation is.",
            "We deal with strings when we do spark queries.",
            "The results are strings.",
            "And we have these wonderful ontologies.",
            "Why do we don't we use them?",
            "Right, you have these wonderful ontologies, but once you get back strings.",
            "You don't have ontologies.",
            "You have strings.",
            "You don't have knowledge in the background anymore when you do the programming.",
            "You have thrown away all the knowledge you had.",
            "Not so clever, I would say."
        ],
        [
            "So we lose our typing.",
            "Of course.",
            "The alternative is that you re encode your ontology in your program code, so you do the same work twice and you don't have really much to order to sort of like automatically take from the ontology to the program code."
        ],
        [
            "And of course, you really as a developer.",
            "You really need to understand very well what your classes are and what your properties are.",
            "And please memorize this well because you have this long you arise OK, you can use package names or.",
            "Abbreviations, but you have to remember very well how these names look like.",
            "Because you don't."
        ],
        [
            "The compiler that once you about it.",
            "So when we look at related work, there are some mapping approaches.",
            "There are some mapping approaches, some of them are infamous, others are done by other people where you sort of like from your ontology.",
            "You do code generation, but it's typically a one way process.",
            "You generate code once if something changes.",
            "There is no way of round tripping."
        ],
        [
            "There are some very nice approaches with scripting.",
            "I think active RDF by their team is one of the most sophisticated ones and they basically say, well, we don't do so much typing.",
            "Yeah, basically it doesn't use typing, it just uses convention like in the Ruby.",
            "And if you use a certain term it tries to find that term in the ontology on the fly.",
            "So there's not much warning.",
            "It's very nice for prototyping, not so sure it's so nice for maintainable code."
        ],
        [
            "And my criticism is what you really want to have is you want to use all the knowledge that's available in the sources for static static typing that you detect errors before you actually execute the code, or that you're warned when something changes.",
            "Small anecdote, I still suffer from this experience that 10 years ago we were participating in in a competition and we came in second cause of the misspelling of a variable.",
            "That and I, I mean, so you have one misspelled variable after six months of work, and you come only in second place.",
            "And if that variable would have not been misspelled, we would have come in first place with leaving the others way behind us.",
            "So I'm really now fan since then of static typing that gives you a warning of this kind of stuff."
        ],
        [
            "Yeah, and then of course, static types are also a form of documentation, so you offload some of the tasks away from the developer into the program code.",
            "You need less knowledge about the data source.",
            "And even the."
        ],
        [
            "Um?",
            "The development environment can be better supported by having this kind of information.",
            "OK so far for the analysis.",
            "Now I want to present a little bit."
        ],
        [
            "Our kind of approach.",
            "Which we call like you.",
            "So the task."
        ],
        [
            "Here is again we have someone we use Visual Studio and F# Sharp is quite nice language.",
            "And to interact with Jamendo here in this example and well you have to use the kind of entology for H and music artists is a subclass of that music artist makes records and there is some dozen records and some artists in there.",
            "And.",
            "The first thing that the person needs to do is to really understand what's in there.",
            "Cause for this guy here it's a black box initially, so the kind of support that we offer is browsing support so."
        ],
        [
            "You start with anywhere.",
            "Let's say you start with 4H and you could also start with RDF resource and what you then do is you just explore what's happening beneath 4th of Agent so you have an operator to move down the hierarchy and then you're offered all the choices choice like music artists, your offer and that's not happening.",
            "'cause you coded something, it's just happening 'cause you ask your ontology.",
            "Hey give me something about you.",
            "But it's happening within the development environment, so that's this.",
            "Is a screenshot.",
            "Actually.",
            "Steven Sugarman will be around for the demo session.",
            "You can show this life to you and basically just says we want to explore what kind of class we have.",
            "So the developer understands it and he does not need to understand the exact format.",
            "You just like this, it looks a bit like object oriented code.",
            "On the same."
        ],
        [
            "Of course, is that true with properties, so your let's say you have here music artists, and then you want to explore properties.",
            "So if an operator for that and you are offered the full list, or if you start typing, then there are some restrictions that you can use to say, OK, an artist made something.",
            "Again, you directly use the ontology you don't.",
            "Precoat this into the environment you just query ad hoc.",
            "What is the author logical knowledge that's provided?"
        ],
        [
            "And then of course, when you have all these concepts and you have these properties, you can also do directly querying.",
            "So you just say here if music just give me the extension of that, give me all the instances that you have.",
            "You can also have a bit restrictions to say I'm only interested in certain types of music artists.",
            "The core idea of this approach is.",
            "Two fold.",
            "One is to have rather a linear querying approach, so the idea is you write from left to right, so a you can make suggestions.",
            "So it's partly it's very hard to come up with good suggestions of what you ask next.",
            "Here you explore the graph from a root perspective and then you walk down the classes or you walk along the relation chains so you can explore the property of the graph that it's connected and that you can walk the graph.",
            "And while you walk the graph, you build a query that you can then execute."
        ],
        [
            "So by having walked along the graph, let's say from 4H music artist here that has been shortened to fit on the slide.",
            "You say give me the extension and then you have all these artists.",
            "Now it's not only that you then have all the artists, because the artist may come back as a string, but I told you already that having the artist as a string is not such a clever choice.",
            "Because I only said that of course, because because we have never been not so sure.",
            "So when you have this kind of exploration and you have asked for the ontology all the time, of course you know about the ontology you would know about the ontology as reported to you by this Parkland Point."
        ],
        [
            "So you know that if you ask for all the music artists.",
            "It's not just strings that come back, but what comes back.",
            "I are of type music artist.",
            "So you can actually use this type directly and you use this type and if you ask for a set of music artists, guess what is this the type of this?",
            "All artists there that type of that is set of music artists?",
            "So actually what, when providing a type for this kind of extensional query?",
            "You put this into the compiler and the compiler does type inference to say ah if this is.",
            "Of class music artists.",
            "This must be a set of music artists because you now talk about the whole extension.",
            "Now suddenly you could not fit some record into this all artist said."
        ],
        [
            "And then of course you can develop code with this kind of thing.",
            "I am, by the way, so sorry, I almost forgot to mention.",
            "You don't need a definition or a declaration of this type.",
            "Because why should you?",
            "You have done all this nice ontology engineering already.",
            "Why do you want to duplicate that right?",
            "So basically what we then do here is to say that we look for all the instances of that.",
            "But please give me also the ontological description.",
            "And if I have to ontological description, I can put this into my development environment, create a type and fit all these instances into that type.",
            "So when doing this typing, we don't need to define it."
        ],
        [
            "So now you do this development."
        ],
        [
            "And by the way, just to remind you when I told about extra exploring classes, exploring relations, querying for instances, or now then developing code with kinds of queries.",
            "The idea is that you have really just one language to do all this, so you have don't have switches.",
            "You don't have a browsing tool where you browse and then you copy paste the UI from one side to the other.",
            "You don't have the need to explore the classes separately from the relations you query for the instances you automatically get your types, so if you now do some code development here.",
            "I showed you already that all artists are of type set of music artists.",
            "That"
        ],
        [
            "Gets further becausw.",
            "Now you ask for artists and artists.",
            "That means this thing is now one element out of this set of music artists, so there's some music artists again, well, that's normal type inference as you do in a sophisticated programming language nowadays."
        ],
        [
            "And that of course then also applies when you develop the code, because now you know this beast is of type music artists, so you can even do suggestions.",
            "What kind of properties are around there?",
            "The developer doesn't need to remember that is false name.",
            "What is the right property and not music ontology name you can simply use the same kind of suggestion mechanism.",
            "That you had before for relations in classes.",
            "Because you drag along all this typing over your code.",
            "Everything.",
            "The question is whether we have on corporate ontologies by referencing.",
            "So there are two different ways.",
            "The preferred way is that you have sufficient topological information in your data source, and what we do here is we do sparkle queries all the time.",
            "We can compile these kind of queries that I indicated to you and then use this information in the development environment and the development environment.",
            "Also, does some ad hoc compilation so there is a compilation step but already in the interactive development environment some compilation takes.",
            "It happens and drags along some types and restricts what you can enter into your keyboard.",
            "Or give you warning if you do a mistake and that's all happening and the same isn't true for this here, so you idea cases you have a nice ontology.",
            "You take these ontology and automatically get this typing information.",
            "It happens I will come back to this later that you don't have sufficient autological information.",
            "Then you may configure this ontology separately, but that's not the preferred choice exactly so."
        ],
        [
            "Translate Ola."
        ],
        [
            "These kind of queries of this language at development time already.",
            "To copy basically your types from your ontologies into your program code.",
            "You do type inference with your compilers and you that are working in your development environment.",
            "And then you query again at runtime.",
            "Of course, if you want to query if you develop code like that, eventually this set of music artists should be fresh.",
            "You do the query against the sparkline point at runtime and get then the fresh list of music artists.",
            "And of course you are sure that you have the right typing because you have static typing here in in F# language."
        ],
        [
            "You can do a bit more in.",
            "You can use this kind of music artist class to define a new type explicitly.",
            "That's you need to do when you actually want to create your own music artist.",
            "And then to update the source, and that's what's happening here.",
            "If you create a type like this and then you create a new music artist with your own, your eye and your own name.",
            "It just updates this part of source.",
            "Because it knows that's the type that comes from the sparkle source, so I can update that.",
            "You can forbid it also, but the standard way would be to allow for updating again."
        ],
        [
            "Let's translate it into spotting queries.",
            "At development time at runtime you do the updates to have additional artists and then you have persistent.",
            "Layer for the new data that you created."
        ],
        [
            "So to summarize that approach.",
            "Basically what I presented now is how this particular language works.",
            "It does intentional queries, asking the ontology.",
            "The idea really is.",
            "Go from the left side of this internal data management and drag you ontological knowledge into your developer environment.",
            "And use that then in your development environment and to do some meta programming while you do your development but invisible to the developer."
        ],
        [
            "You do the extension of queries in order to get their hands on your data.",
            "We query for class instances and query also for property instances."
        ],
        [
            "And that is compiled to sparkle so you don't need to change this back line points.",
            "You could think also about using other paradigms, link traversal based queries for example just have a different sparkle query.",
            "And of course you may have some more variabilities in what kind of results you get."
        ],
        [
            "The how the exact shape of MPL will be, we still discuss.",
            "You can of course add dozens of operators and 100 different ways of specifying these operators, and we have still ongoing discussions about what could be the better way than what we have now, but.",
            "It already works and can be extended."
        ],
        [
            "What is find more interesting than these details for MPQL?",
            "Is that is really a part of this approach?"
        ],
        [
            "Off being implemented as part of the development invite."
        ],
        [
            "Comment and that it gives you this understanding where you don't have to remember all this autological knowledge, but you get the auto completion and you are sort of like.",
            "And notched into using deontological novels and what's happening if the ontology change well.",
            "Well, you could in the future after some warnings 'cause you can.",
            "At compile time, record what has happened and do some deltas between the two, so you have additional possibilities."
        ],
        [
            "And you do automatic typing."
        ],
        [
            "What about cost savings?",
            "Of course, that's again more speculation.",
            "I have to say it's not nothing."
        ],
        [
            "Proof well 2."
        ],
        [
            "Open source.",
            "You still have to learn something.",
            "You still need to learn how this language behaves.",
            "We have some indication that it reduces the cognitive load and people have a easier time learning that, but of course it's not final evidence."
        ],
        [
            "You still need to do your data engineering.",
            "I think the ideal way is you define your ontology and then use that in order to populate your SPARQL endpoint or populate the kind of database that you use and you understand then your data structure just from your development environment."
        ],
        [
            "You don't have to do any mappings.",
            "The mapping comes for free because you don't engineer different object models.",
            "You basically have the same kind of models on the on the two sides."
        ],
        [
            "And the actual code we did some investigation with metrics.",
            "It's a lot less than if you use dot net RDF.",
            "Of course we had to compare sharp with sharp knife shop with Java.",
            "I would guess that with Apache know you would also have similar kind of improvement.",
            "I will show you another result."
        ],
        [
            "That's maybe indicative, so here we did one experiment and looked at these metrics that try to capture how difficult it is to do a particular coding.",
            "This helps that metrics looks at things like how many operators did reduce overall how many operands that use overall, how many distinct operators and distinct operations that you use or how many operate operators did the developer has to understand, and it tries to guess some difficulty from that.",
            "Of course, these are really stable numbers 'cause it's really counting the ones down.",
            "There are more.",
            "Speculative but still well accepted in software engineering, but I would say still a bit speculative if we accept the speculation, then the conclusion would be that we waste now about 50% of our efforts when we do semantic web development because of all that what I described."
        ],
        [
            "So we could do much better on these cost curves.",
            "Becausw we well can have very small difference for learning this additional technology because you don't have to leave your environment.",
            "And the coding becomes also much easier."
        ],
        [
            "And using the ontology, I think."
        ],
        [
            "We have we have a case.",
            "We also did another comparison with a perfect object model.",
            "Perfect in the sense that we had a person.",
            "Trying to best implement an object model as possible, and then assume that this object model came for free.",
            "What happens then?",
            "You see, then, that if you have a perfect object models you need.",
            "Fewer operators and fewer operants.",
            "So the storyline of that, of course, is that if you have the perfect object model, you just don't care what's in the back end.",
            "You don't care whether it's a relational database, and I think that's also good to know, because otherwise you may say, oh, we always have a better approach, but if you have sufficiently many.",
            "Excess is a manipulations of your data.",
            "You don't care about how that's implemented because the manual object model will just dramatically improve on the situation.",
            "You still see that the difference is not quite as large as the difference between the hours current approach to semantic programming and what I suggested here."
        ],
        [
            "So.",
            "The perfect optic model Shields the developer from the database.",
            "That means these coding efforts for, let's say, relational database and semantic web efforts.",
            "They develop in parallel and the difference is only in the setup costs than in developing.",
            "Coming up with this perfect object model.",
            "So we need to work really on that BIH cause for large applications it is just not relevant whether we use the one or the other paradigm and we must be aware of this limitation.",
            "We cannot just go and say how we are so wonderful, we do so great we allow you much easier programming 'cause it's not true in general."
        ],
        [
            "OK, so."
        ],
        [
            "So there are a couple of issues.",
            "Also with their approach, the first big issue is if you look out into linked open data Cloud.",
            "Many Altisource do not have a schema, right?",
            "So what do you do if you don't have a schema?",
            "I would ask you to build 1 right?",
            "So please provide ontology.",
            "I think it really helps."
        ],
        [
            "But let me get back to to."
        ],
        [
            "That in a few."
        ],
        [
            "Yes, then.",
            "Quite often you have a somewhat useless schema, but it also happens, so actually I cheated a bit on you.",
            "Namely my running example.",
            "It's not actually that there is a music artist producing records, but rather that an agent makes something.",
            "Right now, having the knowledge that agents make something like chairs or talks or whatever or ideas is not really that helpful when you want to do the code development.",
            "So obviously what you need to do when doing this type of development, you also need to add onto logical knowledge to it.",
            "We don't have support for that right now.",
            "Right now, this scheme as it is this a bit useless you.",
            "We can provide configurations.",
            "So that when doing the development you can add this additional ontological knowledge that you then use in order to benefit from what you have.",
            "So that sense it was a little bit cheating."
        ],
        [
            "Yeah.",
            "And.",
            "We can help you with cheating like that.",
            "Because obviously what you will happen is that we have here a music artist."
        ],
        [
            "And we have your record.",
            "And we can observe that there is this major relationship between the two.",
            "So if we observe this often enough.",
            "We can suggest to you.",
            "Maybe you want to refine this major relationship a bit.",
            "You don't want to.",
            "Use only the in specific one that is between agent thing, but you may really want to use the one that's between music artists and record, and then you have this ontological knowledge so there are approaches around to schema induction that we need to use, and then we need to work on that.",
            "We need to provide and then it's not just that it's an either choice either.",
            "The information is there and you are happy with the kind of approach I presented, or it's not there and you go and do something different.",
            "There are some ways in between."
        ],
        [
            "So we need schema index.",
            "Maybe in some new kinds of schema induction."
        ],
        [
            "And we definitely need new kinds of schematics.",
            "I want to point out some work by their colleagues from branch wagtail, abolicion others.",
            "And he has done this very nice observation on schema.org that if you ask for all movies and schema.org.",
            "You only get us some very small part of it and why?",
            "Because most movies are not typed as movies in schema.org.",
            "So he observed that sometimes you have to ask for director and title.",
            "Sometimes you have to ask for actor and director.",
            "So you need all kind of property combinations to really cover the movies that you could find inschema.org.",
            "So it's not good enough for our schema induction to look only at classes and then derive something from that.",
            "You also need this kind of property based references and property based property defined classes in order to do comprehensive coverage.",
            "Of the data that you have underneath.",
            "Of course, if you just you sparkle, you have the same kind of problem, right?",
            "It's not doesn't help you to say I don't want to support the developer, I just you sparkle.",
            "You will still not be happy 'cause the quality of the data is not high enough in under many circumstances."
        ],
        [
            "So.",
            "Outlook for like you well we need to integrate schema induction.",
            "That will be one of our."
        ],
        [
            "Master next tasks.",
            "We want to program against the semantic Web as a whole.",
            "I mean right now I did everything like if semantic web was one database, that's not what we want.",
            "You want the semantic web to spend much broader, and obviously there are approaches that can use to that, like link traversal based queries or different types of federations.",
            "Even so, we still need to investigate what kind of Federation will work best such that it's also understandable by the developer.",
            "I mentioned again searching encoding, so you search you get something and you say I want to look at these two databases or these two endpoints in order to include in my development."
        ],
        [
            "Well, of course there's a lot of work to be done on the specific query language.",
            "It is less powerful than sparkle, obviously because it doesn't have a lot of nice features, but there's of course always this tradeoff like between having the full expressiveness and they understand ability of someone who's not as doesn't know it so well.",
            "And of course, if you have full sparkle, it will be basically impossible to do an accurate typing.",
            "You could still try to do approximate typing, and why not do an approximate typing for your sparkle queries?",
            "Deliver that to the developers and this I think will also provide some help."
        ],
        [
            "And well, we still want to look or I still want to look into this integrated type inference because we have our types from our RDF data source.",
            "In the future, maybe even composed types.",
            "Where we say we are only interested in.",
            "People that attended the SWC right?",
            "So these are certain type of people not not the whole world.",
            "And then we drag this type along in our programming environment where we do all kinds of fancy things with it.",
            "And as we do so, we do type inference in the host language and that may further restrict the types.",
            "Or may even generalize them so they may all kind of things happen by this kind of interaction between the logical world and the programming world.",
            "And there is not so much going on between these two words.",
            "There are a bit of efforts between databases and programming languages world, but there is not so much, let's say in our community and the programming language would happen so."
        ],
        [
            "So now I could talk about still some other stuff.",
            "But I thought I think I've exploited my time fully, so I will basically skip about that and just move very quickly to the conclusion."
        ],
        [
            "We have a lot of wonderful data out there.",
            "And now, in spite of like, that's an awful green.",
            "It's a very nice green on my right side.",
            "I think we should work to make this a wonderful green on the right side that we have a wonderful integration of the great data that we have in the semantic web and the.",
            "Development environments that normal programmers have to deal with and I try to analyze a few of the points that are missing.",
            "In this area and now I look for your feedback.",
            "What ideas you have to fill this gap or improve this gap or come up with all kind of fancy ideas?",
            "So thank you."
        ],
        [
            "The attention I just want to point out one last thing.",
            "So in this kind of work there's also my colleague Ralph Lemon involved, and also every in Vegas from Microsoft.",
            "And these are the two guys actually doing the development, so I think there's always.",
            "It's a programming for this kind of meta development that needs to be pointed out, and Steven is also here to show you the tools, so check him out.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it's a great pleasure for me to introduce Steven.",
                    "label": 0
                },
                {
                    "sent": "How can I introduce someone who no longer needs to be introduced?",
                    "label": 0
                },
                {
                    "sent": "In fact, in this community everyone was different, so let me say that every year for me.",
                    "label": 0
                },
                {
                    "sent": "It's getting harder and harder to confess that I defended my PhD in 2002.",
                    "label": 0
                },
                {
                    "sent": "But already at that time.",
                    "label": 0
                },
                {
                    "sent": "Among the most important references I was quoted while the paper called Ontology Learning.",
                    "label": 0
                },
                {
                    "sent": "For the semantic Web by Alexander Match Ann Stephens tab.",
                    "label": 1
                },
                {
                    "sent": "The work of Satan has been influential in general for the whole field of knowledge based information system, ontology oriented approaches, and the semantic web.",
                    "label": 0
                },
                {
                    "sent": "Of course, but long before the Semantic Web conference, you could already meet Steven at each guy at hi at HCI at AAAI, at a cow, and pack him, and then of course as one of the author of the paper at the first Semantic Web Conference in 2002.",
                    "label": 0
                },
                {
                    "sent": "So if you really need to be convinced.",
                    "label": 0
                },
                {
                    "sent": "Just look at this slide.",
                    "label": 0
                },
                {
                    "sent": "Actually my main problem designing the slide was to decide if I needed one or two slides.",
                    "label": 0
                },
                {
                    "sent": "Because he has a huge number of book he's being involved in very prestigious prices.",
                    "label": 0
                },
                {
                    "sent": "He received.",
                    "label": 0
                },
                {
                    "sent": "Steven studied computer science and computational linguistics in Germany and in USA an he worked as a researcher at the University of Stuttgart, Front over and of course, through before becoming a professor at Coblentz, where he now is the director of the Institute of Websites and Technologies and Institute of for Computer Science.",
                    "label": 0
                },
                {
                    "sent": "His first paper in 1995 at Eurospeech starts with this sentence, saying the process of understanding language requires the efficient processing of ambiguities that arise by the nature of speech.",
                    "label": 0
                },
                {
                    "sent": "So since then, Stephens been contributing a lot to Arden's understanding and joint issues of data and text.",
                    "label": 0
                },
                {
                    "sent": "The domain of his contribution include ontologies, Semantic web, social web, data engineering, text mining, peer to peer multimedia, HCI services, software modeling, and even programming.",
                    "label": 0
                },
                {
                    "sent": "And actually today the talk of Steven is on this last topic programming.",
                    "label": 0
                },
                {
                    "sent": "In fact, we will start with the hypothesis that we have not yet developed the right kind of programming paradigm to deal properly with the semantic Web data.",
                    "label": 0
                },
                {
                    "sent": "So it is truly an honor for me to introduce a pioneer of the semantic web.",
                    "label": 0
                },
                {
                    "sent": "And please join me in welcoming Stephens Tab for this opening keynotes.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, so fabulous.",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot for this lettering words and I never thought that anyone would ever in the world look up this 95 paper for any reason, right?",
                    "label": 0
                },
                {
                    "sent": "So be aware what you write in your first paper.",
                    "label": 0
                },
                {
                    "sent": "Before I start the talk proper, I know there are always some expectations about a keynote talk.",
                    "label": 0
                },
                {
                    "sent": "Therefore, I thought it would give you.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm warning yeah.",
                    "label": 0
                },
                {
                    "sent": "So I cannot talk is typically to be very philosophical.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "Luciano is the philosopher here.",
                    "label": 0
                },
                {
                    "sent": "Give a keynote talk.",
                    "label": 0
                },
                {
                    "sent": "So I thought I would rather go through the country and I want you.",
                    "label": 0
                },
                {
                    "sent": "So if you don't want to see program code engineering some speculation, some opinion you may rather leave the room now without embarrassment, right?",
                    "label": 1
                },
                {
                    "sent": "Otherwise maybe you just hang on, but please, then don't be offended about that.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Semantic web.",
                    "label": 0
                },
                {
                    "sent": "I think we have a great history.",
                    "label": 0
                },
                {
                    "sent": "Because when you look back these 15 years we were.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We talking about small systems, tiny systems with a few 100 facts that we're trying to pull a couple of pieces of data together.",
                    "label": 0
                },
                {
                    "sent": "And now we talk about about billions of facts that are coming from different sources that are combined together with text together with other kind of data.",
                    "label": 0
                },
                {
                    "sent": "So we talked really about big systems, so we achieved quite a long way in these 15 years.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is also very nice that some of these big systems are in everyday practice now.",
                    "label": 1
                },
                {
                    "sent": "I mean, schema.org is one of the most I think eminent once, but you have other kind of applications at the news agencies or Reuters, New York Times.",
                    "label": 0
                },
                {
                    "sent": "You could have a rather long list.",
                    "label": 0
                },
                {
                    "sent": "I know from harmless, probably around somewhere, and he always maintains its nice list of applications are back there and he's always this really, really nice list of applications.",
                    "label": 0
                },
                {
                    "sent": "So we have all reasons to be proud about this kind of practice.",
                    "label": 0
                },
                {
                    "sent": "That's happening.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also have quite some research influence, so you can see semantic Web now being discussed not only in this event, but you have it in the eye conferences you have in the database conferences.",
                    "label": 0
                },
                {
                    "sent": "I have colleagues in programming languages who use RDF for all kinds of reasons even without me influencing them in any kind of way.",
                    "label": 0
                },
                {
                    "sent": "So people are picking it up.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nevertheless, to pour some water into the wine, we still want really mainstream adoption.",
                    "label": 1
                },
                {
                    "sent": "I mean, be serious, we are not there.",
                    "label": 0
                },
                {
                    "sent": "That, like every computer science students, knows the semantic web right?",
                    "label": 0
                },
                {
                    "sent": "It's not come parable to people using relational databases.",
                    "label": 0
                },
                {
                    "sent": "And of course there are a whole bunch of reasons, but one reason that I want to approach today is that eventually we need good support for the core task of that we have in computer science and the core task in the end is software development is Pro.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cramming so.",
                    "label": 0
                },
                {
                    "sent": "We need to support the developers, programmers in making their task most efficient and I try to elucidate a bit.",
                    "label": 0
                },
                {
                    "sent": "What are the reasons that they are not as efficient as they could be if we exploit our full potential.",
                    "label": 0
                },
                {
                    "sent": "The kind of possibilities that we have from our kind of modeling styles from our kind of engineering styles and of course my target is to make this red box or green box and providing some support and maybe.",
                    "label": 0
                },
                {
                    "sent": "You would be a bit encouraged to help in this endeavour.",
                    "label": 0
                },
                {
                    "sent": "No, why is this still a red box right now?",
                    "label": 0
                },
                {
                    "sent": "So let me give First Birds Eye view and then I wanted to dig a bit deeper and even to do something stupid is showing some code in this keynote talk, right?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is first like the bird?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I few on this problem that we do not really have such great support for actual programming.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, we have great stayed out there and the data, but of course comes in very different forms, which doesn't make it quite easier for the programmer, right?",
                    "label": 0
                },
                {
                    "sent": "So we have files RDF files that we can just download.",
                    "label": 0
                },
                {
                    "sent": "We have linked data that we can dereference where we can get the properties that ripples, so we pick one data item at a time.",
                    "label": 1
                },
                {
                    "sent": "We have a very stable method to do that even if many of his resources are down.",
                    "label": 0
                },
                {
                    "sent": "Quite often.",
                    "label": 0
                },
                {
                    "sent": "We have sparcl endpoints and we do this for data alike as well As for ontologies.",
                    "label": 0
                },
                {
                    "sent": "So that's already quite a heterogeneous field.",
                    "label": 0
                },
                {
                    "sent": "That's even something which is not so easy to understand by the outsider, and in a way what we should do is to sort of like shield the outsider a bit from that.",
                    "label": 0
                },
                {
                    "sent": "Even if you commit to one of these particular paradigms of getting at your data, my hypothesis.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is here is that when we wrote so many wet paper in the 2000?",
                    "label": 0
                },
                {
                    "sent": "We already had this problem that what we program was very brittle.",
                    "label": 0
                },
                {
                    "sent": "Every time the ontology changed, the code would break every time the exact location of data would change.",
                    "label": 0
                },
                {
                    "sent": "The code might break, so already then there was this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mom is on the one side.",
                    "label": 0
                },
                {
                    "sent": "To have a lot of flexibility for your data, and I think that's fully true, we're it's very easy in our kind of semantic web approach to add further conceptual descriptions to enrich the ontology to take another ontology to map between different approaches.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of flexibility in the data engineering that we provide.",
                    "label": 0
                },
                {
                    "sent": "But it's not good enough to only do this on the data engineering side, because if you have all this flexibility on data engineering, but you don't have the same kind of flexibility on your programming site, your code will break once you don't have this very close alignment.",
                    "label": 0
                },
                {
                    "sent": "Of course you can try to do to consider everything to be a graph, and then you only talk about notes.",
                    "label": 0
                },
                {
                    "sent": "But if you look at typical applications of graphs, that's not what is happening.",
                    "label": 0
                },
                {
                    "sent": "What would be typical applications?",
                    "label": 0
                },
                {
                    "sent": "Facebook for example.",
                    "label": 0
                },
                {
                    "sent": "Facebook is a big graph.",
                    "label": 0
                },
                {
                    "sent": "How much of the big graph do you really see in front end, right?",
                    "label": 0
                },
                {
                    "sent": "Not really.",
                    "label": 0
                },
                {
                    "sent": "That much.",
                    "label": 0
                },
                {
                    "sent": "You see people you see friendship links.",
                    "label": 0
                },
                {
                    "sent": "You see organizations.",
                    "label": 0
                },
                {
                    "sent": "There's a big graph underneath and it's very useful to have such a big graph to be able to query it and to work with that kind of data.",
                    "label": 0
                },
                {
                    "sent": "But you don't want to see it on the front, and in most cases with some I would say rather esoteric exception.",
                    "label": 0
                },
                {
                    "sent": "Sometimes if you take the whole picture.",
                    "label": 0
                },
                {
                    "sent": "So the graph is very useful.",
                    "label": 0
                },
                {
                    "sent": "The graph is very flexible.",
                    "label": 0
                },
                {
                    "sent": "The kind of ontologies that we provide are flexible and I think go quite a bit beyond what Facebook has in the background.",
                    "label": 0
                },
                {
                    "sent": "But in the end you want to have a program that gives you the right kind of you where you don't care that there's a graph in the background.",
                    "label": 0
                },
                {
                    "sent": "But how do you keep these two worlds synced up together?",
                    "label": 0
                },
                {
                    "sent": "It's not such an easy task and I don't think we do a very good job right now at supporting this gap that exists there.",
                    "label": 0
                },
                {
                    "sent": "Whoa.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why don't we support this gap very well?",
                    "label": 0
                },
                {
                    "sent": "Well, on the left side we have our nice and fancy data and our ontologies and we work a lot in data management, right?",
                    "label": 0
                },
                {
                    "sent": "If you look here at the conference papers, there are plenty of papers that deal with querying that deal with getting some data that deal with analyzing the data, and that's all great work.",
                    "label": 0
                },
                {
                    "sent": "I really love that, so it's not something that we should discard or that we can discard this stuff that we need to do, but.",
                    "label": 0
                },
                {
                    "sent": "I would call it here.",
                    "label": 0
                },
                {
                    "sent": "Something like insights, data management, becausw it's a little bit of solipsistic view.",
                    "label": 0
                },
                {
                    "sent": "We care about the data, we create it, but in the end we have a right hand side the developers and they have some sort of environment that might be a clips that might Visual Studio.",
                    "label": 0
                },
                {
                    "sent": "They are dozens of other kind of software development environments that they use in order to build their programs, but there's quite.",
                    "label": 0
                },
                {
                    "sent": "Some gap.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Between this insight, then that data management where we care about our structures, our analytics, and what these kind of software development environments really need in order to help the programmer.",
                    "label": 0
                },
                {
                    "sent": "So what do I count towards?",
                    "label": 0
                },
                {
                    "sent": "This insight per?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Spectr if there is very simple stuff and it's good that we have a simple basis because we can extend that in a very robust manner, like having something simple as HTTP get for downloading files or dereference dereference in your eyes.",
                    "label": 0
                },
                {
                    "sent": "We have query execution in our sparkle endpoints.",
                    "label": 1
                },
                {
                    "sent": "We have even update.",
                    "label": 0
                },
                {
                    "sent": "We do all kind of indexing to make this whole approach scale out and I think we can be proud to which extend the scalability of our approach is improved.",
                    "label": 0
                },
                {
                    "sent": "Over the last decade.",
                    "label": 0
                },
                {
                    "sent": "We have triple ification, let's say from a relational databases into triples.",
                    "label": 0
                },
                {
                    "sent": "Their wonderful approaches out there.",
                    "label": 0
                },
                {
                    "sent": "An oral from content management systems that give you a lot of data that's before was close into a very open format, and even that in a scalable manner.",
                    "label": 0
                },
                {
                    "sent": "So you can do data integration.",
                    "label": 0
                },
                {
                    "sent": "We deal with streaming, but this I call the inside fuel.",
                    "label": 0
                },
                {
                    "sent": "It's maybe not very nice work.",
                    "label": 0
                },
                {
                    "sent": "Nice work because it's mostly the few that says OK, we deal with our data, we don't care about how someone else is.",
                    "label": 0
                },
                {
                    "sent": "Dealing with what we deliver to them.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The gap here is between these two worlds.",
                    "label": 1
                },
                {
                    "sent": "This inside data management and the development site.",
                    "label": 0
                },
                {
                    "sent": "Whatever kind of tool you use on that development site so.",
                    "label": 0
                },
                {
                    "sent": "My suggestion here is that.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need to better fill this gap by what I call here again, the term is not very nice, but I call here outside data management.",
                    "label": 0
                },
                {
                    "sent": "What are the kind of services we need to deliver in order to support the programmer in his tasks over there?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what would this outside few include?",
                    "label": 0
                },
                {
                    "sent": "And of course, I'm speculating a bit.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and I hope that in the discussion you give me 10 more suggestions of what we should include.",
                    "label": 0
                },
                {
                    "sent": "What do we include in this outside view?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, in the 1st place I would put their understanding by the developer.",
                    "label": 1
                },
                {
                    "sent": "We shouldn't assume that the developer is very familiar with Sparkle with RDF axioms or with OWL.",
                    "label": 0
                },
                {
                    "sent": "We should rather assume that uses the tools as a rather naive developer, and that's of course happening with all other kinds of technologies to.",
                    "label": 0
                },
                {
                    "sent": "There's also happening with relational databases.",
                    "label": 0
                },
                {
                    "sent": "A lot of the people who do the programming, let's say in the bioinformatics worlds, they are by all.",
                    "label": 0
                },
                {
                    "sent": "A biologist, and they not necessarily are experts in how to exactly formalize a schema in relational database, so that's quite normal.",
                    "label": 0
                },
                {
                    "sent": "The developer should.",
                    "label": 0
                },
                {
                    "sent": "No, as little as possible from this world on the left side and still be able to accomplish not all tasks, but quite many tasks.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Understanding of course even means very simple things like searching, encoding or browsing encoding right in the 1st place the developer over there does not know what is all hidden in this data and ontologies on the left side.",
                    "label": 0
                },
                {
                    "sent": "And of course we have very nice search tools browsing tools, but they're not really connected to the world on the right.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you can search.",
                    "label": 0
                },
                {
                    "sent": "You can browse, but then with current tools you would have to copy paste.",
                    "label": 0
                },
                {
                    "sent": "That's not really a smooth process.",
                    "label": 0
                },
                {
                    "sent": "In order to support this kind of development right in the 1st place, we really have this need that someone wants to.",
                    "label": 0
                },
                {
                    "sent": "Let's say my running example would be about music, be able to discover what kind of concepts are offered to me about records about artists and how can I then program an interesting few on that.",
                    "label": 0
                },
                {
                    "sent": "Maybe include this in my Facebook app or wherever.",
                    "label": 0
                },
                {
                    "sent": "So we need some support for the developer tool to search for things to browse for things and directly use this in the code, 'cause I mean we also have we have one nice thing which is also very bad, which are your eyes.",
                    "label": 0
                },
                {
                    "sent": "I mean, your eyes are wonderful because it gives you a globally unique identifier.",
                    "label": 0
                },
                {
                    "sent": "There are also awful because you have these awkwardly long names right and you have to deal with them.",
                    "label": 0
                },
                {
                    "sent": "And when you program with them, you need the right kind of support.",
                    "label": 0
                },
                {
                    "sent": "It's sort of a very trivial thing, but even back in the 2000 when we wrote our papers, we had enormous problems with just maintaining identifiers that have very long names.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Because misspellings are very easy to happen, so you need to reduce this kind of friction.",
                    "label": 0
                },
                {
                    "sent": "Some of that is really trivial, but you need to do this kind of trivial things in order to accomplish something.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then.",
                    "label": 0
                },
                {
                    "sent": "Most of the development over there is happening in an object oriented way, maybe in a functional way or in a mixture of the two.",
                    "label": 0
                },
                {
                    "sent": "It's not happening in a triple oriented programming style and I don't think a triple oriented programming style would help would be really useful, or at least I don't know one that is really useful.",
                    "label": 0
                },
                {
                    "sent": "So maybe if you have an idea of how to do really well triple oriented programming, maybe that's the next paper you should write, But so far I have not seen that.",
                    "label": 0
                },
                {
                    "sent": "So what we observe for existing semantic web programs is that you have this triple object mapping.",
                    "label": 0
                },
                {
                    "sent": "And that's rather neglected.",
                    "label": 0
                },
                {
                    "sent": "There are a few papers out there on doing this, but mostly what we deal with.",
                    "label": 0
                },
                {
                    "sent": "This ontology alignments.",
                    "label": 0
                },
                {
                    "sent": "We take two ontologies from our world and in a nice solipsistic approach.",
                    "label": 0
                },
                {
                    "sent": "We map between our world in our world.",
                    "label": 0
                },
                {
                    "sent": "But what we really need to do is we need to map between our world and the downstream world that's supposed to use our approaches.",
                    "label": 0
                },
                {
                    "sent": "So we need to map between triples and objects, and in a way that's really supportive of what the developer wants to achieve.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that of course means then that we need to generate codes for him or for her.",
                    "label": 0
                },
                {
                    "sent": "So we should not just like say OK here.",
                    "label": 0
                },
                {
                    "sent": "Now we have the very abstract mapping police re encode this all manually.",
                    "label": 0
                },
                {
                    "sent": "We should rather say OK, here we have some ontology and some mapping.",
                    "label": 0
                },
                {
                    "sent": "Please generate the code and if there is some change we can help you with that because that's of course then the bigger issue that in our world where we have a lot of flexibility, we're supposed to expect change.",
                    "label": 0
                },
                {
                    "sent": "It should not be the exception that relational table changes should be the normal way of.",
                    "label": 0
                },
                {
                    "sent": "Doing that concept and relations change all the time.",
                    "label": 0
                },
                {
                    "sent": "And the only way to deal with that is to have some sort of automatic approach to support the developer doing this.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we have this process of Federation.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The simplest problem, simplest in away problem there is that we have these different kinds of data will be at linked data with sparkling points with RDF dumps where we don't have a good model for how to reconcile between getting these different kinds of data.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it's even if you just stick with one paradigm we have don't have good support right now to say I want to have data from this and from there, and that's what I need to integrate.",
                    "label": 0
                },
                {
                    "sent": "So we don't have these models of separation, so these are some examples of layers.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that would facilitate a developer's life.",
                    "label": 0
                },
                {
                    "sent": "And now we don't have so much or that we don't have integrated in a way that's really useful for the developer.",
                    "label": 0
                },
                {
                    "sent": "Now, should we really care about this?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "I mean, isn't it good enough to have this wonderful SPARQL endpoint?",
                    "label": 0
                },
                {
                    "sent": "And then people can query and do with it.",
                    "label": 0
                },
                {
                    "sent": "Isn't that the right layer of abstraction?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What I tried to do here is a little bit to give you a rational, but what are the costs involved with doing only this inside approach versus also doing the outside approach?",
                    "label": 0
                },
                {
                    "sent": "So what if you program with data?",
                    "label": 0
                },
                {
                    "sent": "What does it cost you right?",
                    "label": 0
                },
                {
                    "sent": "If you take the total cost?",
                    "label": 0
                },
                {
                    "sent": "Well if you take the total cost here, the first thing you have to pay for all the tools Now, typically that's actually not so bad.",
                    "label": 0
                },
                {
                    "sent": "'cause we're researchers, we develop tools, donate them to the outside world.",
                    "label": 0
                },
                {
                    "sent": "So the tools.",
                    "label": 0
                },
                {
                    "sent": "Are typically not not too expensive.",
                    "label": 0
                },
                {
                    "sent": "It's not true for all tools there.",
                    "label": 0
                },
                {
                    "sent": "Quite expensive commercial tools around, so that's not ask that.",
                    "label": 0
                },
                {
                    "sent": "Of course, for each tool you have to pay a certain price, you have too many tools that contributes to the overall cost.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then there is a very important cost to consider, especially if you don't talk attacking our community while you more or less assume people know what you talk about, what when you target a community downstream.",
                    "label": 0
                },
                {
                    "sent": "Who wants to develop with our kind of approaches?",
                    "label": 0
                },
                {
                    "sent": "Because this downstream community has to learn to some extent, our approaches.",
                    "label": 0
                },
                {
                    "sent": "And there was a very nice paper.",
                    "label": 0
                },
                {
                    "sent": "Or is there is no very nice paper by Daniel over there he's from SAP and he reports a bit on some of the rational of not including a great new technology in the technology stack of ASAP.",
                    "label": 0
                },
                {
                    "sent": "The reason being that you have all these many thousands of developers, and if you include something new in the technology stack.",
                    "label": 0
                },
                {
                    "sent": "These people have to learn this technology to some extent, and that's quite enormous cost factor.",
                    "label": 0
                },
                {
                    "sent": "Maybe you stick with the not so great technology.",
                    "label": 0
                },
                {
                    "sent": "Just because people don't have to learn a novel technology.",
                    "label": 0
                },
                {
                    "sent": "So if you have.",
                    "label": 0
                },
                {
                    "sent": "A new technology.",
                    "label": 0
                },
                {
                    "sent": "You have some costs of each technology would be T + 1, so to say, and for each developer that's concerned with this particular program, there's a cost involved for just learning it.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then of course we either do some data engineering or we look at some data that is engineered and we need to understand it.",
                    "label": 0
                },
                {
                    "sent": "So either we built a data source from scratch or we look at a given data source and have to understand what's in there.",
                    "label": 0
                },
                {
                    "sent": "That's what I hear refer to with this cost factor, where for each data source there are as many data sources.",
                    "label": 0
                },
                {
                    "sent": "We have to understand what's in this data source, and that's a really non neglectable knowledge, so if you look into a like a large data source, and once that student was working at SFP and was there in the company and he wanted to connect something simple like people and projects and topics and all the data was available in the database, it took him two days just to find the two pieces of information where they are stored.",
                    "label": 0
                },
                {
                    "sent": "Right, so I mean, I hope we can be a quite a bit better because our ontologies are much better guidance towards that, but still.",
                    "label": 0
                },
                {
                    "sent": "Having today's to to find 2 pieces of information that you can correlate is quite a drastic effort to accomplish something.",
                    "label": 0
                },
                {
                    "sent": "And then what happens quite often these people just say oh, the information is not there.",
                    "label": 0
                },
                {
                    "sent": "Let's start a new database.",
                    "label": 0
                },
                {
                    "sent": "We don't want that.",
                    "label": 0
                },
                {
                    "sent": "We rather want an understanding and we need understanding to be able to program with the available data, of course.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once you have that understanding, we need to do this mapping.",
                    "label": 0
                },
                {
                    "sent": "This triple object mapping and for each source you have basically have to do this.",
                    "label": 0
                },
                {
                    "sent": "So that's another constructor.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, eventually after a long list of cost factors you actually have to develop program code.",
                    "label": 0
                },
                {
                    "sent": "And of course for each, let's say access manipulation of data, there is a certain cost factor involved.",
                    "label": 0
                },
                {
                    "sent": "So that's a rough estimate of what are some costs involved in the program.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you see some of that is on the outside part where we provide technologies to other developers and some in the inside part, and some is really both right.",
                    "label": 0
                },
                {
                    "sent": "It's a mixture of both tools for inside also the outside world now.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These costs, there are opportunities.",
                    "label": 0
                },
                {
                    "sent": "There are threats, strengths, weaknesses involved, and I just want.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To point them out here, the tool factor already mentioned is a certain weakness.",
                    "label": 0
                },
                {
                    "sent": "We don't have that great tools.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, I don't see it as the major one, so it's.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A minor weakness, and we could even turn it into an advantage.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The learning factor here is really a threat.",
                    "label": 0
                },
                {
                    "sent": "If we don't overcome this learning obstacle, we're not supposed to expect a mainstream adoption, right?",
                    "label": 0
                },
                {
                    "sent": "So that's a certain threat we need to.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To work with and just being as good as existing technology is not good enough, you really need to be better in order to make it worth for this technology to be picked up.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The data engineering and understanding I think we can be quite strong becausw I think it's much more.",
                    "label": 0
                },
                {
                    "sent": "We work at a more conceptual level than, let's say relational databases, so I think that's a strength.",
                    "label": 0
                },
                {
                    "sent": "We are not quite as performed yet in some aspects.",
                    "label": 0
                },
                {
                    "sent": "Sometimes we are, so it doesn't look too bad.",
                    "label": 0
                },
                {
                    "sent": "I would.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we have here these opportunities where we need to map from triples to objects where other people need to map from tables to object and where I think our community has a lot to say about performing these kind of mappings which is which.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Could be opportunity, but currently at the point at this point in time it is not a strength, yet it's not and it's still an opportunity, and the same is true for code and I want to show you how we pursue this approach to make it an opportunity.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When I look at this cost factor I also.",
                    "label": 0
                },
                {
                    "sent": "I mean it's it's a quite complex formula, even though it's abstr.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From many other things right?",
                    "label": 0
                },
                {
                    "sent": "I want to give you an intuition of.",
                    "label": 0
                },
                {
                    "sent": "Two ways in which we could target these cost factors to go closer to mainstream adoption.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "One scenario is the automated setup.",
                    "label": 0
                },
                {
                    "sent": "Automated setup basically means we use one of these automatic mapping approaches that are around there that exists for relational database that exist for semantic web.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Then of course the difference here is that we have the same kind of automated setup costs, but for semantic web we have this additional learning curve that we need to take care of.",
                    "label": 0
                },
                {
                    "sent": "Then our target must be to be able to develop faster with the code.",
                    "label": 0
                },
                {
                    "sent": "Because then we can surpass like existing technologies, and I think that's a quite reasonable assumption that we can surpass here.",
                    "label": 0
                },
                {
                    "sent": "The total costs 'cause it's easier to program with semantic web data.",
                    "label": 0
                },
                {
                    "sent": "And then let's say with a relational database, because we store data at a conceptual level and then programming with that should be easier.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This applies mostly to small and so if you have little interaction with the database, if you have a lot of interaction.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a database.",
                    "label": 0
                },
                {
                    "sent": "What happens then then?",
                    "label": 0
                },
                {
                    "sent": "The best thing is you build your perfect object model manually, because if you have a perfect object model you don't care about how the database below is connected, you just deal with this object model and then you don't care what kind of back in store you have.",
                    "label": 1
                },
                {
                    "sent": "You must be better in the setup cost, so mapping the data source to your object model must come at a lower cost, otherwise you cannot compete because the object models just saves the work from talking to the back end.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so lessons learned from this kind of observations.",
                    "label": 0
                },
                {
                    "sent": "It's quite a bit speculation too.",
                    "label": 0
                },
                {
                    "sent": "It's not a proof.",
                    "label": 0
                },
                {
                    "sent": "We need to minimize the cost for the set up to counter the learning needs.",
                    "label": 0
                },
                {
                    "sent": "And especially the mapping is, I think are quite a good opportunity for us.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we also need to minimize the costs for the core programming tasks.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's look at some.",
                    "label": 0
                },
                {
                    "sent": "Current way of dealing with issues and then I want to present our approach to that.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I have a small running example for that.",
                    "label": 0
                },
                {
                    "sent": "You talk to bubble here in the Elodie cloud, of course, eventually we want to talk to all bubbles in the yellow D cloud or a significant subset, but right now we talked to one bubbling yellow D cloud.",
                    "label": 0
                },
                {
                    "sent": "And it's a moderate size bubble with 1 million triples.",
                    "label": 0
                },
                {
                    "sent": "Plus some predicates from 18 different mythologise like friend of a friend, music Ontology and others.",
                    "label": 1
                },
                {
                    "sent": "And you have a very simple programming task.",
                    "label": 0
                },
                {
                    "sent": "The task is to list for every music artist you find in there and jamendo the records they made well.",
                    "label": 1
                },
                {
                    "sent": "It's really straightforward tasks, not so hard to understand.",
                    "label": 0
                },
                {
                    "sent": "Without duplicate, build this in or not.",
                    "label": 0
                },
                {
                    "sent": "So the question was without duplication or not.",
                    "label": 0
                },
                {
                    "sent": "I don't even care right?",
                    "label": 0
                },
                {
                    "sent": "So that's the fine tuning.",
                    "label": 0
                },
                {
                    "sent": "Then I don't want to make the task to complicated.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is the process that you have to initiate?",
                    "label": 0
                },
                {
                    "sent": "Well, you start your initial data model and say I want to have something like an artist in a record so you have an initial data model design.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then you explore what do you have in the data source?",
                    "label": 1
                },
                {
                    "sent": "It's an artist.",
                    "label": 0
                },
                {
                    "sent": "It isn't.",
                    "label": 0
                },
                {
                    "sent": "Couldn't slur.",
                    "label": 0
                },
                {
                    "sent": "Is it a?",
                    "label": 0
                },
                {
                    "sent": "I don't know what music, artists and.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So really, come up with the revised data model design before you go to create your model.",
                    "label": 1
                },
                {
                    "sent": "Actually encode.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you need to somehow declare that's my class.",
                    "label": 0
                },
                {
                    "sent": "That's my methods and so on so forth.",
                    "label": 1
                },
                {
                    "sent": "So you have a data model prototype.",
                    "label": 0
                },
                {
                    "sent": "Then you go on to.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually realize your queries you have to define your queries and maybe that leads.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Due to a revision, you need to map also.",
                    "label": 0
                },
                {
                    "sent": "Then the query result.",
                    "label": 0
                },
                {
                    "sent": "That you get.",
                    "label": 0
                },
                {
                    "sent": "Back into your object model, why?",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, I'll show you here.",
                    "label": 0
                },
                {
                    "sent": "Here's some code, so I promised you don't feel offended.",
                    "label": 0
                },
                {
                    "sent": "Here's some code, there's not much that you have to recognize here.",
                    "label": 0
                },
                {
                    "sent": "The important thing here is you have a query string.",
                    "label": 0
                },
                {
                    "sent": "And it is what it says.",
                    "label": 0
                },
                {
                    "sent": "It's a string.",
                    "label": 0
                },
                {
                    "sent": "Why so you compile something?",
                    "label": 0
                },
                {
                    "sent": "And and you have some results set and that results that comes from executing your query.",
                    "label": 0
                },
                {
                    "sent": "And then actually you have to map back because the results it again is a string.",
                    "label": 0
                },
                {
                    "sent": "Or a list of strings.",
                    "label": 0
                },
                {
                    "sent": "So you do this mapping of what you have in your object model into strings.",
                    "label": 0
                },
                {
                    "sent": "And then you do something clever, and then you again work with strings.",
                    "label": 0
                },
                {
                    "sent": "Huh?",
                    "label": 0
                },
                {
                    "sent": "It doesn't sound very clever, does it?",
                    "label": 0
                },
                {
                    "sent": "But I mean that's the normal way of working these days, so it's no complaint against their efforts.",
                    "label": 0
                },
                {
                    "sent": "Really.",
                    "label": 0
                },
                {
                    "sent": "Great effort, Appacha Gina, so it's just like our current state of the art.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And well, and then of course you can go over this list of strings.",
                    "label": 0
                },
                {
                    "sent": "There are some more intricacies, so maybe that maybe then you want even to look into the kind of strings.",
                    "label": 0
                },
                {
                    "sent": "What do they have and what do you do you?",
                    "label": 0
                },
                {
                    "sent": "For example, you say an artist has some properties.",
                    "label": 0
                },
                {
                    "sent": "Now you're interested in the music Ontology made property.",
                    "label": 0
                },
                {
                    "sent": "So you code basically some part of the ontology into your program code.",
                    "label": 0
                },
                {
                    "sent": "Now what if the property name changes?",
                    "label": 0
                },
                {
                    "sent": "Your program code breaks.",
                    "label": 0
                },
                {
                    "sent": "So we have here a standard approach of programming with the semantic web and every time something in your ontology changes, the code breaks and you're not warned about it.",
                    "label": 0
                },
                {
                    "sent": "So that's not exactly what I would call robust programming.",
                    "label": 0
                },
                {
                    "sent": "It may work for a small prototype that you run for a day and then it's over right, but if you want to maintain something, it's not really that great approach so.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The observation is.",
                    "label": 0
                },
                {
                    "sent": "We deal with strings when we do spark queries.",
                    "label": 0
                },
                {
                    "sent": "The results are strings.",
                    "label": 0
                },
                {
                    "sent": "And we have these wonderful ontologies.",
                    "label": 0
                },
                {
                    "sent": "Why do we don't we use them?",
                    "label": 0
                },
                {
                    "sent": "Right, you have these wonderful ontologies, but once you get back strings.",
                    "label": 0
                },
                {
                    "sent": "You don't have ontologies.",
                    "label": 0
                },
                {
                    "sent": "You have strings.",
                    "label": 0
                },
                {
                    "sent": "You don't have knowledge in the background anymore when you do the programming.",
                    "label": 0
                },
                {
                    "sent": "You have thrown away all the knowledge you had.",
                    "label": 0
                },
                {
                    "sent": "Not so clever, I would say.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we lose our typing.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                },
                {
                    "sent": "The alternative is that you re encode your ontology in your program code, so you do the same work twice and you don't have really much to order to sort of like automatically take from the ontology to the program code.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, you really as a developer.",
                    "label": 0
                },
                {
                    "sent": "You really need to understand very well what your classes are and what your properties are.",
                    "label": 0
                },
                {
                    "sent": "And please memorize this well because you have this long you arise OK, you can use package names or.",
                    "label": 0
                },
                {
                    "sent": "Abbreviations, but you have to remember very well how these names look like.",
                    "label": 0
                },
                {
                    "sent": "Because you don't.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The compiler that once you about it.",
                    "label": 0
                },
                {
                    "sent": "So when we look at related work, there are some mapping approaches.",
                    "label": 0
                },
                {
                    "sent": "There are some mapping approaches, some of them are infamous, others are done by other people where you sort of like from your ontology.",
                    "label": 0
                },
                {
                    "sent": "You do code generation, but it's typically a one way process.",
                    "label": 1
                },
                {
                    "sent": "You generate code once if something changes.",
                    "label": 0
                },
                {
                    "sent": "There is no way of round tripping.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are some very nice approaches with scripting.",
                    "label": 0
                },
                {
                    "sent": "I think active RDF by their team is one of the most sophisticated ones and they basically say, well, we don't do so much typing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, basically it doesn't use typing, it just uses convention like in the Ruby.",
                    "label": 0
                },
                {
                    "sent": "And if you use a certain term it tries to find that term in the ontology on the fly.",
                    "label": 0
                },
                {
                    "sent": "So there's not much warning.",
                    "label": 0
                },
                {
                    "sent": "It's very nice for prototyping, not so sure it's so nice for maintainable code.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And my criticism is what you really want to have is you want to use all the knowledge that's available in the sources for static static typing that you detect errors before you actually execute the code, or that you're warned when something changes.",
                    "label": 0
                },
                {
                    "sent": "Small anecdote, I still suffer from this experience that 10 years ago we were participating in in a competition and we came in second cause of the misspelling of a variable.",
                    "label": 0
                },
                {
                    "sent": "That and I, I mean, so you have one misspelled variable after six months of work, and you come only in second place.",
                    "label": 0
                },
                {
                    "sent": "And if that variable would have not been misspelled, we would have come in first place with leaving the others way behind us.",
                    "label": 0
                },
                {
                    "sent": "So I'm really now fan since then of static typing that gives you a warning of this kind of stuff.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, and then of course, static types are also a form of documentation, so you offload some of the tasks away from the developer into the program code.",
                    "label": 1
                },
                {
                    "sent": "You need less knowledge about the data source.",
                    "label": 0
                },
                {
                    "sent": "And even the.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "The development environment can be better supported by having this kind of information.",
                    "label": 0
                },
                {
                    "sent": "OK so far for the analysis.",
                    "label": 0
                },
                {
                    "sent": "Now I want to present a little bit.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our kind of approach.",
                    "label": 0
                },
                {
                    "sent": "Which we call like you.",
                    "label": 0
                },
                {
                    "sent": "So the task.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is again we have someone we use Visual Studio and F# Sharp is quite nice language.",
                    "label": 0
                },
                {
                    "sent": "And to interact with Jamendo here in this example and well you have to use the kind of entology for H and music artists is a subclass of that music artist makes records and there is some dozen records and some artists in there.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The first thing that the person needs to do is to really understand what's in there.",
                    "label": 0
                },
                {
                    "sent": "Cause for this guy here it's a black box initially, so the kind of support that we offer is browsing support so.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You start with anywhere.",
                    "label": 0
                },
                {
                    "sent": "Let's say you start with 4H and you could also start with RDF resource and what you then do is you just explore what's happening beneath 4th of Agent so you have an operator to move down the hierarchy and then you're offered all the choices choice like music artists, your offer and that's not happening.",
                    "label": 0
                },
                {
                    "sent": "'cause you coded something, it's just happening 'cause you ask your ontology.",
                    "label": 0
                },
                {
                    "sent": "Hey give me something about you.",
                    "label": 0
                },
                {
                    "sent": "But it's happening within the development environment, so that's this.",
                    "label": 0
                },
                {
                    "sent": "Is a screenshot.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "Steven Sugarman will be around for the demo session.",
                    "label": 0
                },
                {
                    "sent": "You can show this life to you and basically just says we want to explore what kind of class we have.",
                    "label": 0
                },
                {
                    "sent": "So the developer understands it and he does not need to understand the exact format.",
                    "label": 0
                },
                {
                    "sent": "You just like this, it looks a bit like object oriented code.",
                    "label": 0
                },
                {
                    "sent": "On the same.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, is that true with properties, so your let's say you have here music artists, and then you want to explore properties.",
                    "label": 0
                },
                {
                    "sent": "So if an operator for that and you are offered the full list, or if you start typing, then there are some restrictions that you can use to say, OK, an artist made something.",
                    "label": 0
                },
                {
                    "sent": "Again, you directly use the ontology you don't.",
                    "label": 0
                },
                {
                    "sent": "Precoat this into the environment you just query ad hoc.",
                    "label": 0
                },
                {
                    "sent": "What is the author logical knowledge that's provided?",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then of course, when you have all these concepts and you have these properties, you can also do directly querying.",
                    "label": 0
                },
                {
                    "sent": "So you just say here if music just give me the extension of that, give me all the instances that you have.",
                    "label": 0
                },
                {
                    "sent": "You can also have a bit restrictions to say I'm only interested in certain types of music artists.",
                    "label": 0
                },
                {
                    "sent": "The core idea of this approach is.",
                    "label": 0
                },
                {
                    "sent": "Two fold.",
                    "label": 0
                },
                {
                    "sent": "One is to have rather a linear querying approach, so the idea is you write from left to right, so a you can make suggestions.",
                    "label": 0
                },
                {
                    "sent": "So it's partly it's very hard to come up with good suggestions of what you ask next.",
                    "label": 0
                },
                {
                    "sent": "Here you explore the graph from a root perspective and then you walk down the classes or you walk along the relation chains so you can explore the property of the graph that it's connected and that you can walk the graph.",
                    "label": 0
                },
                {
                    "sent": "And while you walk the graph, you build a query that you can then execute.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So by having walked along the graph, let's say from 4H music artist here that has been shortened to fit on the slide.",
                    "label": 0
                },
                {
                    "sent": "You say give me the extension and then you have all these artists.",
                    "label": 0
                },
                {
                    "sent": "Now it's not only that you then have all the artists, because the artist may come back as a string, but I told you already that having the artist as a string is not such a clever choice.",
                    "label": 0
                },
                {
                    "sent": "Because I only said that of course, because because we have never been not so sure.",
                    "label": 0
                },
                {
                    "sent": "So when you have this kind of exploration and you have asked for the ontology all the time, of course you know about the ontology you would know about the ontology as reported to you by this Parkland Point.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you know that if you ask for all the music artists.",
                    "label": 0
                },
                {
                    "sent": "It's not just strings that come back, but what comes back.",
                    "label": 0
                },
                {
                    "sent": "I are of type music artist.",
                    "label": 0
                },
                {
                    "sent": "So you can actually use this type directly and you use this type and if you ask for a set of music artists, guess what is this the type of this?",
                    "label": 0
                },
                {
                    "sent": "All artists there that type of that is set of music artists?",
                    "label": 1
                },
                {
                    "sent": "So actually what, when providing a type for this kind of extensional query?",
                    "label": 0
                },
                {
                    "sent": "You put this into the compiler and the compiler does type inference to say ah if this is.",
                    "label": 0
                },
                {
                    "sent": "Of class music artists.",
                    "label": 0
                },
                {
                    "sent": "This must be a set of music artists because you now talk about the whole extension.",
                    "label": 0
                },
                {
                    "sent": "Now suddenly you could not fit some record into this all artist said.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then of course you can develop code with this kind of thing.",
                    "label": 0
                },
                {
                    "sent": "I am, by the way, so sorry, I almost forgot to mention.",
                    "label": 0
                },
                {
                    "sent": "You don't need a definition or a declaration of this type.",
                    "label": 1
                },
                {
                    "sent": "Because why should you?",
                    "label": 0
                },
                {
                    "sent": "You have done all this nice ontology engineering already.",
                    "label": 0
                },
                {
                    "sent": "Why do you want to duplicate that right?",
                    "label": 0
                },
                {
                    "sent": "So basically what we then do here is to say that we look for all the instances of that.",
                    "label": 0
                },
                {
                    "sent": "But please give me also the ontological description.",
                    "label": 0
                },
                {
                    "sent": "And if I have to ontological description, I can put this into my development environment, create a type and fit all these instances into that type.",
                    "label": 0
                },
                {
                    "sent": "So when doing this typing, we don't need to define it.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now you do this development.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And by the way, just to remind you when I told about extra exploring classes, exploring relations, querying for instances, or now then developing code with kinds of queries.",
                    "label": 1
                },
                {
                    "sent": "The idea is that you have really just one language to do all this, so you have don't have switches.",
                    "label": 0
                },
                {
                    "sent": "You don't have a browsing tool where you browse and then you copy paste the UI from one side to the other.",
                    "label": 0
                },
                {
                    "sent": "You don't have the need to explore the classes separately from the relations you query for the instances you automatically get your types, so if you now do some code development here.",
                    "label": 0
                },
                {
                    "sent": "I showed you already that all artists are of type set of music artists.",
                    "label": 0
                },
                {
                    "sent": "That",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gets further becausw.",
                    "label": 0
                },
                {
                    "sent": "Now you ask for artists and artists.",
                    "label": 0
                },
                {
                    "sent": "That means this thing is now one element out of this set of music artists, so there's some music artists again, well, that's normal type inference as you do in a sophisticated programming language nowadays.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that of course then also applies when you develop the code, because now you know this beast is of type music artists, so you can even do suggestions.",
                    "label": 0
                },
                {
                    "sent": "What kind of properties are around there?",
                    "label": 0
                },
                {
                    "sent": "The developer doesn't need to remember that is false name.",
                    "label": 0
                },
                {
                    "sent": "What is the right property and not music ontology name you can simply use the same kind of suggestion mechanism.",
                    "label": 0
                },
                {
                    "sent": "That you had before for relations in classes.",
                    "label": 0
                },
                {
                    "sent": "Because you drag along all this typing over your code.",
                    "label": 0
                },
                {
                    "sent": "Everything.",
                    "label": 0
                },
                {
                    "sent": "The question is whether we have on corporate ontologies by referencing.",
                    "label": 0
                },
                {
                    "sent": "So there are two different ways.",
                    "label": 0
                },
                {
                    "sent": "The preferred way is that you have sufficient topological information in your data source, and what we do here is we do sparkle queries all the time.",
                    "label": 0
                },
                {
                    "sent": "We can compile these kind of queries that I indicated to you and then use this information in the development environment and the development environment.",
                    "label": 0
                },
                {
                    "sent": "Also, does some ad hoc compilation so there is a compilation step but already in the interactive development environment some compilation takes.",
                    "label": 0
                },
                {
                    "sent": "It happens and drags along some types and restricts what you can enter into your keyboard.",
                    "label": 0
                },
                {
                    "sent": "Or give you warning if you do a mistake and that's all happening and the same isn't true for this here, so you idea cases you have a nice ontology.",
                    "label": 0
                },
                {
                    "sent": "You take these ontology and automatically get this typing information.",
                    "label": 0
                },
                {
                    "sent": "It happens I will come back to this later that you don't have sufficient autological information.",
                    "label": 0
                },
                {
                    "sent": "Then you may configure this ontology separately, but that's not the preferred choice exactly so.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Translate Ola.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These kind of queries of this language at development time already.",
                    "label": 1
                },
                {
                    "sent": "To copy basically your types from your ontologies into your program code.",
                    "label": 1
                },
                {
                    "sent": "You do type inference with your compilers and you that are working in your development environment.",
                    "label": 1
                },
                {
                    "sent": "And then you query again at runtime.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you want to query if you develop code like that, eventually this set of music artists should be fresh.",
                    "label": 0
                },
                {
                    "sent": "You do the query against the sparkline point at runtime and get then the fresh list of music artists.",
                    "label": 0
                },
                {
                    "sent": "And of course you are sure that you have the right typing because you have static typing here in in F# language.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can do a bit more in.",
                    "label": 0
                },
                {
                    "sent": "You can use this kind of music artist class to define a new type explicitly.",
                    "label": 0
                },
                {
                    "sent": "That's you need to do when you actually want to create your own music artist.",
                    "label": 0
                },
                {
                    "sent": "And then to update the source, and that's what's happening here.",
                    "label": 0
                },
                {
                    "sent": "If you create a type like this and then you create a new music artist with your own, your eye and your own name.",
                    "label": 0
                },
                {
                    "sent": "It just updates this part of source.",
                    "label": 0
                },
                {
                    "sent": "Because it knows that's the type that comes from the sparkle source, so I can update that.",
                    "label": 0
                },
                {
                    "sent": "You can forbid it also, but the standard way would be to allow for updating again.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's translate it into spotting queries.",
                    "label": 0
                },
                {
                    "sent": "At development time at runtime you do the updates to have additional artists and then you have persistent.",
                    "label": 1
                },
                {
                    "sent": "Layer for the new data that you created.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to summarize that approach.",
                    "label": 0
                },
                {
                    "sent": "Basically what I presented now is how this particular language works.",
                    "label": 0
                },
                {
                    "sent": "It does intentional queries, asking the ontology.",
                    "label": 0
                },
                {
                    "sent": "The idea really is.",
                    "label": 0
                },
                {
                    "sent": "Go from the left side of this internal data management and drag you ontological knowledge into your developer environment.",
                    "label": 0
                },
                {
                    "sent": "And use that then in your development environment and to do some meta programming while you do your development but invisible to the developer.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You do the extension of queries in order to get their hands on your data.",
                    "label": 0
                },
                {
                    "sent": "We query for class instances and query also for property instances.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that is compiled to sparkle so you don't need to change this back line points.",
                    "label": 0
                },
                {
                    "sent": "You could think also about using other paradigms, link traversal based queries for example just have a different sparkle query.",
                    "label": 0
                },
                {
                    "sent": "And of course you may have some more variabilities in what kind of results you get.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The how the exact shape of MPL will be, we still discuss.",
                    "label": 0
                },
                {
                    "sent": "You can of course add dozens of operators and 100 different ways of specifying these operators, and we have still ongoing discussions about what could be the better way than what we have now, but.",
                    "label": 0
                },
                {
                    "sent": "It already works and can be extended.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is find more interesting than these details for MPQL?",
                    "label": 0
                },
                {
                    "sent": "Is that is really a part of this approach?",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Off being implemented as part of the development invite.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Comment and that it gives you this understanding where you don't have to remember all this autological knowledge, but you get the auto completion and you are sort of like.",
                    "label": 0
                },
                {
                    "sent": "And notched into using deontological novels and what's happening if the ontology change well.",
                    "label": 0
                },
                {
                    "sent": "Well, you could in the future after some warnings 'cause you can.",
                    "label": 0
                },
                {
                    "sent": "At compile time, record what has happened and do some deltas between the two, so you have additional possibilities.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you do automatic typing.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What about cost savings?",
                    "label": 0
                },
                {
                    "sent": "Of course, that's again more speculation.",
                    "label": 0
                },
                {
                    "sent": "I have to say it's not nothing.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Proof well 2.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Open source.",
                    "label": 0
                },
                {
                    "sent": "You still have to learn something.",
                    "label": 0
                },
                {
                    "sent": "You still need to learn how this language behaves.",
                    "label": 0
                },
                {
                    "sent": "We have some indication that it reduces the cognitive load and people have a easier time learning that, but of course it's not final evidence.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You still need to do your data engineering.",
                    "label": 0
                },
                {
                    "sent": "I think the ideal way is you define your ontology and then use that in order to populate your SPARQL endpoint or populate the kind of database that you use and you understand then your data structure just from your development environment.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You don't have to do any mappings.",
                    "label": 0
                },
                {
                    "sent": "The mapping comes for free because you don't engineer different object models.",
                    "label": 0
                },
                {
                    "sent": "You basically have the same kind of models on the on the two sides.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the actual code we did some investigation with metrics.",
                    "label": 0
                },
                {
                    "sent": "It's a lot less than if you use dot net RDF.",
                    "label": 1
                },
                {
                    "sent": "Of course we had to compare sharp with sharp knife shop with Java.",
                    "label": 0
                },
                {
                    "sent": "I would guess that with Apache know you would also have similar kind of improvement.",
                    "label": 0
                },
                {
                    "sent": "I will show you another result.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's maybe indicative, so here we did one experiment and looked at these metrics that try to capture how difficult it is to do a particular coding.",
                    "label": 0
                },
                {
                    "sent": "This helps that metrics looks at things like how many operators did reduce overall how many operands that use overall, how many distinct operators and distinct operations that you use or how many operate operators did the developer has to understand, and it tries to guess some difficulty from that.",
                    "label": 0
                },
                {
                    "sent": "Of course, these are really stable numbers 'cause it's really counting the ones down.",
                    "label": 0
                },
                {
                    "sent": "There are more.",
                    "label": 0
                },
                {
                    "sent": "Speculative but still well accepted in software engineering, but I would say still a bit speculative if we accept the speculation, then the conclusion would be that we waste now about 50% of our efforts when we do semantic web development because of all that what I described.",
                    "label": 1
                }
            ]
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we could do much better on these cost curves.",
                    "label": 0
                },
                {
                    "sent": "Becausw we well can have very small difference for learning this additional technology because you don't have to leave your environment.",
                    "label": 0
                },
                {
                    "sent": "And the coding becomes also much easier.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And using the ontology, I think.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have we have a case.",
                    "label": 0
                },
                {
                    "sent": "We also did another comparison with a perfect object model.",
                    "label": 1
                },
                {
                    "sent": "Perfect in the sense that we had a person.",
                    "label": 1
                },
                {
                    "sent": "Trying to best implement an object model as possible, and then assume that this object model came for free.",
                    "label": 0
                },
                {
                    "sent": "What happens then?",
                    "label": 0
                },
                {
                    "sent": "You see, then, that if you have a perfect object models you need.",
                    "label": 0
                },
                {
                    "sent": "Fewer operators and fewer operants.",
                    "label": 0
                },
                {
                    "sent": "So the storyline of that, of course, is that if you have the perfect object model, you just don't care what's in the back end.",
                    "label": 0
                },
                {
                    "sent": "You don't care whether it's a relational database, and I think that's also good to know, because otherwise you may say, oh, we always have a better approach, but if you have sufficiently many.",
                    "label": 1
                },
                {
                    "sent": "Excess is a manipulations of your data.",
                    "label": 0
                },
                {
                    "sent": "You don't care about how that's implemented because the manual object model will just dramatically improve on the situation.",
                    "label": 0
                },
                {
                    "sent": "You still see that the difference is not quite as large as the difference between the hours current approach to semantic programming and what I suggested here.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The perfect optic model Shields the developer from the database.",
                    "label": 1
                },
                {
                    "sent": "That means these coding efforts for, let's say, relational database and semantic web efforts.",
                    "label": 0
                },
                {
                    "sent": "They develop in parallel and the difference is only in the setup costs than in developing.",
                    "label": 0
                },
                {
                    "sent": "Coming up with this perfect object model.",
                    "label": 1
                },
                {
                    "sent": "So we need to work really on that BIH cause for large applications it is just not relevant whether we use the one or the other paradigm and we must be aware of this limitation.",
                    "label": 0
                },
                {
                    "sent": "We cannot just go and say how we are so wonderful, we do so great we allow you much easier programming 'cause it's not true in general.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there are a couple of issues.",
                    "label": 0
                },
                {
                    "sent": "Also with their approach, the first big issue is if you look out into linked open data Cloud.",
                    "label": 0
                },
                {
                    "sent": "Many Altisource do not have a schema, right?",
                    "label": 1
                },
                {
                    "sent": "So what do you do if you don't have a schema?",
                    "label": 0
                },
                {
                    "sent": "I would ask you to build 1 right?",
                    "label": 0
                },
                {
                    "sent": "So please provide ontology.",
                    "label": 0
                },
                {
                    "sent": "I think it really helps.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But let me get back to to.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That in a few.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, then.",
                    "label": 0
                },
                {
                    "sent": "Quite often you have a somewhat useless schema, but it also happens, so actually I cheated a bit on you.",
                    "label": 1
                },
                {
                    "sent": "Namely my running example.",
                    "label": 0
                },
                {
                    "sent": "It's not actually that there is a music artist producing records, but rather that an agent makes something.",
                    "label": 0
                },
                {
                    "sent": "Right now, having the knowledge that agents make something like chairs or talks or whatever or ideas is not really that helpful when you want to do the code development.",
                    "label": 0
                },
                {
                    "sent": "So obviously what you need to do when doing this type of development, you also need to add onto logical knowledge to it.",
                    "label": 0
                },
                {
                    "sent": "We don't have support for that right now.",
                    "label": 0
                },
                {
                    "sent": "Right now, this scheme as it is this a bit useless you.",
                    "label": 0
                },
                {
                    "sent": "We can provide configurations.",
                    "label": 0
                },
                {
                    "sent": "So that when doing the development you can add this additional ontological knowledge that you then use in order to benefit from what you have.",
                    "label": 0
                },
                {
                    "sent": "So that sense it was a little bit cheating.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We can help you with cheating like that.",
                    "label": 0
                },
                {
                    "sent": "Because obviously what you will happen is that we have here a music artist.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we have your record.",
                    "label": 0
                },
                {
                    "sent": "And we can observe that there is this major relationship between the two.",
                    "label": 0
                },
                {
                    "sent": "So if we observe this often enough.",
                    "label": 0
                },
                {
                    "sent": "We can suggest to you.",
                    "label": 0
                },
                {
                    "sent": "Maybe you want to refine this major relationship a bit.",
                    "label": 0
                },
                {
                    "sent": "You don't want to.",
                    "label": 0
                },
                {
                    "sent": "Use only the in specific one that is between agent thing, but you may really want to use the one that's between music artists and record, and then you have this ontological knowledge so there are approaches around to schema induction that we need to use, and then we need to work on that.",
                    "label": 0
                },
                {
                    "sent": "We need to provide and then it's not just that it's an either choice either.",
                    "label": 0
                },
                {
                    "sent": "The information is there and you are happy with the kind of approach I presented, or it's not there and you go and do something different.",
                    "label": 0
                },
                {
                    "sent": "There are some ways in between.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we need schema index.",
                    "label": 0
                },
                {
                    "sent": "Maybe in some new kinds of schema induction.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we definitely need new kinds of schematics.",
                    "label": 0
                },
                {
                    "sent": "I want to point out some work by their colleagues from branch wagtail, abolicion others.",
                    "label": 0
                },
                {
                    "sent": "And he has done this very nice observation on schema.org that if you ask for all movies and schema.org.",
                    "label": 1
                },
                {
                    "sent": "You only get us some very small part of it and why?",
                    "label": 0
                },
                {
                    "sent": "Because most movies are not typed as movies in schema.org.",
                    "label": 0
                },
                {
                    "sent": "So he observed that sometimes you have to ask for director and title.",
                    "label": 0
                },
                {
                    "sent": "Sometimes you have to ask for actor and director.",
                    "label": 1
                },
                {
                    "sent": "So you need all kind of property combinations to really cover the movies that you could find inschema.org.",
                    "label": 0
                },
                {
                    "sent": "So it's not good enough for our schema induction to look only at classes and then derive something from that.",
                    "label": 0
                },
                {
                    "sent": "You also need this kind of property based references and property based property defined classes in order to do comprehensive coverage.",
                    "label": 0
                },
                {
                    "sent": "Of the data that you have underneath.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you just you sparkle, you have the same kind of problem, right?",
                    "label": 0
                },
                {
                    "sent": "It's not doesn't help you to say I don't want to support the developer, I just you sparkle.",
                    "label": 0
                },
                {
                    "sent": "You will still not be happy 'cause the quality of the data is not high enough in under many circumstances.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Outlook for like you well we need to integrate schema induction.",
                    "label": 1
                },
                {
                    "sent": "That will be one of our.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Master next tasks.",
                    "label": 0
                },
                {
                    "sent": "We want to program against the semantic Web as a whole.",
                    "label": 1
                },
                {
                    "sent": "I mean right now I did everything like if semantic web was one database, that's not what we want.",
                    "label": 0
                },
                {
                    "sent": "You want the semantic web to spend much broader, and obviously there are approaches that can use to that, like link traversal based queries or different types of federations.",
                    "label": 0
                },
                {
                    "sent": "Even so, we still need to investigate what kind of Federation will work best such that it's also understandable by the developer.",
                    "label": 0
                },
                {
                    "sent": "I mentioned again searching encoding, so you search you get something and you say I want to look at these two databases or these two endpoints in order to include in my development.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, of course there's a lot of work to be done on the specific query language.",
                    "label": 0
                },
                {
                    "sent": "It is less powerful than sparkle, obviously because it doesn't have a lot of nice features, but there's of course always this tradeoff like between having the full expressiveness and they understand ability of someone who's not as doesn't know it so well.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you have full sparkle, it will be basically impossible to do an accurate typing.",
                    "label": 0
                },
                {
                    "sent": "You could still try to do approximate typing, and why not do an approximate typing for your sparkle queries?",
                    "label": 0
                },
                {
                    "sent": "Deliver that to the developers and this I think will also provide some help.",
                    "label": 0
                }
            ]
        },
        "clip_115": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And well, we still want to look or I still want to look into this integrated type inference because we have our types from our RDF data source.",
                    "label": 1
                },
                {
                    "sent": "In the future, maybe even composed types.",
                    "label": 0
                },
                {
                    "sent": "Where we say we are only interested in.",
                    "label": 0
                },
                {
                    "sent": "People that attended the SWC right?",
                    "label": 0
                },
                {
                    "sent": "So these are certain type of people not not the whole world.",
                    "label": 0
                },
                {
                    "sent": "And then we drag this type along in our programming environment where we do all kinds of fancy things with it.",
                    "label": 1
                },
                {
                    "sent": "And as we do so, we do type inference in the host language and that may further restrict the types.",
                    "label": 0
                },
                {
                    "sent": "Or may even generalize them so they may all kind of things happen by this kind of interaction between the logical world and the programming world.",
                    "label": 0
                },
                {
                    "sent": "And there is not so much going on between these two words.",
                    "label": 0
                },
                {
                    "sent": "There are a bit of efforts between databases and programming languages world, but there is not so much, let's say in our community and the programming language would happen so.",
                    "label": 0
                }
            ]
        },
        "clip_116": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now I could talk about still some other stuff.",
                    "label": 0
                },
                {
                    "sent": "But I thought I think I've exploited my time fully, so I will basically skip about that and just move very quickly to the conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_117": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_118": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a lot of wonderful data out there.",
                    "label": 0
                },
                {
                    "sent": "And now, in spite of like, that's an awful green.",
                    "label": 0
                },
                {
                    "sent": "It's a very nice green on my right side.",
                    "label": 0
                },
                {
                    "sent": "I think we should work to make this a wonderful green on the right side that we have a wonderful integration of the great data that we have in the semantic web and the.",
                    "label": 0
                },
                {
                    "sent": "Development environments that normal programmers have to deal with and I try to analyze a few of the points that are missing.",
                    "label": 0
                },
                {
                    "sent": "In this area and now I look for your feedback.",
                    "label": 0
                },
                {
                    "sent": "What ideas you have to fill this gap or improve this gap or come up with all kind of fancy ideas?",
                    "label": 0
                },
                {
                    "sent": "So thank you.",
                    "label": 0
                }
            ]
        },
        "clip_119": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The attention I just want to point out one last thing.",
                    "label": 0
                },
                {
                    "sent": "So in this kind of work there's also my colleague Ralph Lemon involved, and also every in Vegas from Microsoft.",
                    "label": 0
                },
                {
                    "sent": "And these are the two guys actually doing the development, so I think there's always.",
                    "label": 0
                },
                {
                    "sent": "It's a programming for this kind of meta development that needs to be pointed out, and Steven is also here to show you the tools, so check him out.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}