{
    "id": "pazu6mo3sindrrthdnhinyef7fgr6tgw",
    "title": "Smart Objects Innovation Lab: Theory and practice - hand in hand",
    "info": {
        "author": [
            "Sebastian Kropp, RWTH Aachen University"
        ],
        "published": "Nov. 24, 2010",
        "recorded": "October 2010",
        "category": [
            "Top->Technology->Innovation"
        ]
    },
    "url": "http://videolectures.net/coinactivess2010_kropp_sol/",
    "segmentation": [
        [
            "Good day, ladies and gentlemen.",
            "As already mentioned, my name is Sebastian Crop and I'm working here for almost a year at the FIR and I will present you today.",
            "The Smart Object innovation app.",
            "It's one of our free innovation labs at our WTH campus.",
            "And yeah."
        ],
        [
            "Our innovation lab is the only one that wasn't that is not already going alive.",
            "It's actually building it up and we will go live in February next year.",
            "So today I'll give you overview over the context in which this lab works, its Internet of Things and smart objects.",
            "And there I will give you.",
            "Kind of definition about smart objects and what our understanding of smart objects is.",
            "Next will be the smart Object innovation lab.",
            "Here will give you all of you what kind of research questions we try to answer in that lap.",
            "Next point is the startup case.",
            "There was gripe.",
            "What kind of case we will show in February and last but not least, are the use cases we want to develop further when the level is actually here or.",
            "The new building at Milliton."
        ],
        [
            "What's the motivation?",
            "Logistic system is comprised of all elements in the global network, from material information flow between the enterprises and information and material flows between the single workspaces of a manufacturing area, and all these workplaces, there are kind of events that are generating information.",
            "Another question is what do we do with that information?"
        ],
        [
            "That leads us to some unanswered questions.",
            "The overall question is what are the benefits of smart objects in the supply chain and production?",
            "Here for I'll describe what we understand under smart objects few slides later.",
            "Next question is how can events be integrated into planning systems on different levels?",
            "In an enterprise.",
            "And how much information transparence do we need?",
            "And which of them are even quantifiable here is very important.",
            "We can generate many information, but it's important to have the right information at the right time in the right place.",
            "Actually, the problem is that events are processed not frequently enough.",
            "They are not detailed enough and they are a process too slow to have.",
            "Real time draft them events real time in your IT systems.",
            "Last thing is that the events are not integrated into the different levels of planning for close up loop control to sum up.",
            "There's actually insufficient integration between the physical world and the information systems."
        ],
        [
            "On the other hand, the gap between.",
            "The data input costs are decreasing in the last years.",
            "Actually we started up with bar codes and RFID and are actually faced with Zen zone networks and that leads us that we can match them to the real to the physical world and then it's possible to have to integrate the event processing and the application of smart objects.",
            "Now question is, what are smart objects in our under?"
        ],
        [
            "Ending.",
            "Principle you see different kind of business objects that are affecting the different levels of the system.",
            "There's ones tools or machinery and equipment.",
            "Also containers, goods, articles.",
            "Zoes flee documents, employees, customers and energy.",
            "But these are just objects are not smart objects, but what we have to do to make all of them smart is."
        ],
        [
            "To um, combine them with information technology.",
            "So here for example, you have actuators, you have sensor systems, some kind of identification, localization, information processing and or communication, and to have for example, here is like a container.",
            "If you put a kind of sensor system into a container that perhaps measures the temperature and.",
            "Put also RFID tech M for identification.",
            "Then it becomes a smart object.",
            "That's our kind of understanding smart objects."
        ],
        [
            "Now, what what can we do with that kind of?",
            "What can we do with smart objects?",
            "It's if you, for example, think of machinery or maintenance.",
            "There is possible to have to have documented the whole life cycle of the service and together with the tool management where it's possible to have at the tool.",
            "Kind of instructions how to use that tool and kind of authorization so that just the right work.",
            "You can use these tools to do maintenance on the special machinery.",
            "Therefore you can optimize your whole maintenance process.",
            "On other examples are like on employees and customers.",
            "What you have already today is kind of something like that.",
            "It's for RFID tech.",
            "It's like access control.",
            "We also have that here and you'll see it in many, many companies that is already in use.",
            "You also can do kind of.",
            "On kind of lifecycle service with your customers that you know when you are at the customer, what is the history of that customer?",
            "Also in that context of maintenance and what are the problems that this customer has had had in the past and well, what document and you already have the documents of these customers with you?",
            "I'm in energy management is just a two buzzwords.",
            "Let me mention it's one smart metering.",
            "An demand side management with smart metering, you need to think a little further.",
            "You might need information with your energy.",
            "Otherwise a smart meter won't work."
        ],
        [
            "Next point on this smart object innovation lab.",
            "Arm."
        ],
        [
            "Like I tried to.",
            "To make you clear, is.",
            "Yeah, small objects track and evaluate the stages and event information on business objects in real time or can develop them in real time and they close or they help to close the gap between RT systems and the flow of objects.",
            "And therefore, at our innovation left the smart Objects Innovation Lab we worked together with companies and other leading institutes of the R WTH and we try to find out at the beginning.",
            "We try to answer questions in two different fields.",
            "The one is technology, scouting and application, the other one is information, logistics and standardization.",
            "The first one technology scouting and application.",
            "There are three questions that we try to answer in the next few years.",
            "One is which future Anki technologies enable intelligent objects?",
            "How do these technologies develop in short and medium term and which logistic application scenarios are economically feasible?",
            "And last but not least, what is the contribution of smart objects to solving logistics challenges and?",
            "That goes very close with the economical view on the things to see on the one side, what and what does smart objects enable us to do?",
            "And on the other side, is it worth it?",
            "Does it?",
            "Does it on economically?",
            "Few gives give us some opportunities in our before our processes.",
            "The other one is the information logistics and standardization.",
            "Here we are trying to find out how to design the data acquisition and processing against the background of increased data traffic and what contribution of standards to provide.",
            "For interoperability, interoperability of intelligent objects, in which standards are required in the future to have a example of what is meant.",
            "With that we have for which future key technologies enable intelligent objects I have."
        ],
        [
            "Kind of example, it's not already finished, but it's the idea how to to work with that.",
            "It's a technology Roda.",
            "And here we can see you have different technologies that are important in the context of smart objects like actuator sensor, systems identification and so on.",
            "And you can see one view on that kind of radar what.",
            "What different kind of technologies are available and which majority degree they have?",
            "On"
        ],
        [
            "Now I'll come to what is our startup case that we want to show or realize in the smart objects lab when we go live in February."
        ],
        [
            "Therefore we have two.",
            "We have 3 levels that we try to do show level one.",
            "You just have application of bar code, so we have in the in the small object that we have.",
            "Kind of four different companies, but it says three different companies, but one is a is a wholesaler that have a front door on the back store.",
            "And on the first level, we would show that supply chain just with application of bar codes and there we have no vertical and horizontal integration on the second level.",
            "We have intra organizational process improvement without ID specially RFID.",
            "And on the third level we have horizontal integration where the ERP systems with automated ADR integrated over the supply chain over these four or three steps.",
            "And what we want to show with that lab startup is our experience and the difference in real time integration that we have today."
        ],
        [
            "That is, the layout of our lab.",
            "The lab will be just one floor under that and room 203, two or three and.",
            "Yeah, here you see the producer, the wholesaler and retailer with front and back store.",
            "And yeah, the case is generated is together with the.",
            "Gary Weber and it's in the context of clothing of the clothing industry.",
            "That's the reason why we have here a retailer with front and back store, not two different companies.",
            "First, we have the producer and the activities we want to show at the with producers first to print the labels and then apply the goods with the labels and scan them for delivery and the potential we want to show here between the 1st and the third level.",
            "Is first tracking and tracing of the production and logistics process 2nd.",
            "Potential is to avoid errors through manual data input and 3rd is easy and fast logging.",
            "Of outgoing goods.",
            "The next step is the wholesaler.",
            "He gets the."
        ],
        [
            "Um?",
            "He gets the goods from the from the producer and here we showed activities to receive the goods, picking them and deliver them to the retailer and the potentials between the free levels.",
            "First as simple goods received when it just goes with RFID tech through the gate.",
            "And we have real time inventory data and optimize automized picking of the hearing that examples T shirts.",
            "An from the wholesaler.",
            "The T shirts are products.",
            "Go in the."
        ],
        [
            "Star of the retailer.",
            "And here we try to show how they receive the goods, how they storage EM, and then we want to show a demand driven stock removal to the front store.",
            "And the potentials between that, especially the demand driven stock removal between RFID and barcode solution that you see the potentials like.",
            "You are wide out of stock situations.",
            "You have real time information on the inventory, same as at the wholesaler and you have already a simple simple receipt of goods.",
            "From the back store of the retailer."
        ],
        [
            "You get them dim and driven to the front store.",
            "And.",
            "The front store you have customer have the possibility.",
            "Or yeah, you have the possibility to go to a kind of intelligent mirror where with RFID tech they show you some details about the T shirt.",
            "In that case like what different other clothes are fitting with that or what shoes are in stock that you can use with that and so on.",
            "Next thing is then you go to or you can go with that to the intelligent cache point and.",
            "There we have automatically paying.",
            "And then it's out of the of the system.",
            "Guys, kind of that.",
            "Yeah, and when the insured is sold, you're automatically get fill up that stock behind there from the back store."
        ],
        [
            "Yep, that is the case.",
            "We want to or we actually building up.",
            "For the for the start in February, but we already planned some further use cases because this case is just to show something and but we want to work with that and that's that will do in further use cases, especially if you think about the different size.",
            "Now we have something about 30 square meters on space when we move from here to the campus in to the new rooms there we have about 300 square meters just for our lab.",
            "The other apps already also have 300 square meters and we have a production line with thousand square meters, so we are able to show some more.",
            "Cases with much more complexity."
        ],
        [
            "And then we have one too.",
            "Specially you show two things.",
            "One is the vertical integration.",
            "And therefore we want to increase the data resolution of ERP systems.",
            "And there we try to close the gap between the virtual and the real world and.",
            "We are trying to get the frequent tech data reading and complex event processing to have these real time mapping of stocks and object flows.",
            "Yeah technologies, we are planning to work with this RFID or auto ID, big bidder sensors and complex event processing in that case and specialist we had don't want to work the.",
            "Free Innovation labs with everyone on its own.",
            "We planning to integrate them and so in that case we're working together with the ERP innovation lab that we think.",
            "Open which will present later an here.",
            "In that case we want to work close together with them to get the the.",
            "To get the data from from the smart object in the production line up in the different ERP systems."
        ],
        [
            "Other direction is between horizontal integration between the different.",
            "The different companies and if we try to improve and harmonize the data exchange fraud well you Jane.",
            "Also with Auto ID and EDI standards and the lab is kind of part of the value chain and it has RV gates and you can you can see over the over different ERP systems where in the supply chain is my object or are my objects or products actually?",
            "Yeah, this is the kind of tracking and tracing along the supply chain and here we want to test or also invent new inventory management strategies.",
            "Here we work together also with the European Innovation Lab, but also with the service Science Innovation Lab that will be the next presentation of my colleague.",
            "Mr. Fabre.",
            "Technologies are the same like in the use case before."
        ],
        [
            "And the second or third case we want to take care is maintenance and maintenance with smart object without ID and with mobile solutions.",
            "And here our goal is to increase the efficiency of maintenance process and like I mentioned before when I described the smart object.",
            "We want to take the machinery and the equipment.",
            "To get the process more eficiency.",
            "Um?",
            "Yeah, we also we use where we here we want to.",
            "Also we want also to use mobile technologies specially because in maintenance background it's it might be important to have.",
            "I have a kind of mobile readers and all this stuff with you, specially if it's not.",
            "If the maintenance is not in your in your production online, but it's at custom or something like that.",
            "And here we also will work together with the smart Object Innovation Lab with the Service Science Innovation Lab.",
            "And.",
            "A bit with the European ivation left, but the.",
            "The integration with the Service science innovation.",
            "It will be much more stronger in that context."
        ],
        [
            "Yep.",
            "There was my short presentation of small objects innovation lab.",
            "I'm afraid I'm not.",
            "I cannot present you more than that, but we're actually in building up that that lap, but I think.",
            "The colleagues after that will have to show you much more than that because their level apps are already working.",
            "Thanks.",
            "Are there any questions?",
            "Or maybe it might be a good idea.",
            "Questions.",
            "You consider going further than smart objects to intelligent objects.",
            "Logic.",
            "Being able to decide upon.",
            "Yeah.",
            "Out there.",
            "Now we actually thinking of kind of research project where we want to work on that on that question on kind of.",
            "Also, what algorithms do you need when you have small objects?",
            "Also with the sensor systems and they are organizing their own way through the production, so there's more objects are communicating with the machinery and there is no central.",
            "Planning and controlling.",
            "But is all these central that's also.",
            "We also want to to take care of that in the future in our lab.",
            "If.",
            "Implementing scammer with description of the process.",
            "The travels and maybe help the object take decisions based on that.",
            "Second question, what you got was.",
            "You intend to use other approaches besides the outdoor anti approach.",
            "For example, the Japanese version of you code.",
            "UID how we actually in the first cases we're just using.",
            "Also ID but in further cases we are open to all other technologies.",
            "That's one reason why we set our first goals is to do something like technology, scouting and to see what is important in that in that field for us and then see what in which directions we trying to intense our research.",
            "Comment could also be that as these labs are directed and.",
            "Heavily.",
            "Contributed by the industry as well.",
            "So they are looking into real case, which you can immediately bring it within the region.",
            "So we our primary focus is to support German industry and although the companies that we're dealing with are multinationals but they have some image it needs which are geared towards solutions which could be rapidly provided.",
            "Or integrated into their current running businesses and processes, so that's why they just limited it to this level.",
            "Probably special we are launching this lab in January, February on the 1st and the 2nd February we have.",
            "Kind of Congress here.",
            "The partner information management.",
            "Congress and they are in that context.",
            "We try to to start smart objects left is first in the 2nd of February next year.",
            "So it might be a good idea to mention that there are some.",
            "Industrial Partners which are not only for manufacturing or retail, but they are also from software technology providers are developers.",
            "They are also part of it.",
            "As ERP system is also as it will be integrated and hardware as you already saw that you know RFID tagging would be there as well and we have sensoric sensor systems with.",
            "When is, it is anticipated in two years or three years time for the larger established two years, I think.",
            "This idea is coming to life and your focus on industry and field application of that.",
            "So that was the question.",
            "The UID.",
            "I did some research about this domain and I found this Japanese version or the verified coding based systems and during the ICT 2010 in Brussels I was surprised to see that they came.",
            "Stand where they presented the technology and they were also implemented in Vermont, implementing it in.",
            "Cities from Japan and they were working on new systems for museums or also for shops.",
            "Technologies to identify shop.",
            "So they had a device and durable walking on the street and you could receive information about shops about prices, about products and so on, using different kinds of media from modified E2.",
            "Wireless, Bluetooth and even barcode identification.",
            "Be nice if you could kindly send me the name of the company.",
            "Yes, maybe.",
            "Yeah, it would be nice.",
            "If there are no further questions then.",
            "We will have an informal 15 minutes break before we head down to the service Science Innovation Lab.",
            "Thank you so much once again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good day, ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "As already mentioned, my name is Sebastian Crop and I'm working here for almost a year at the FIR and I will present you today.",
                    "label": 0
                },
                {
                    "sent": "The Smart Object innovation app.",
                    "label": 0
                },
                {
                    "sent": "It's one of our free innovation labs at our WTH campus.",
                    "label": 0
                },
                {
                    "sent": "And yeah.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our innovation lab is the only one that wasn't that is not already going alive.",
                    "label": 0
                },
                {
                    "sent": "It's actually building it up and we will go live in February next year.",
                    "label": 0
                },
                {
                    "sent": "So today I'll give you overview over the context in which this lab works, its Internet of Things and smart objects.",
                    "label": 1
                },
                {
                    "sent": "And there I will give you.",
                    "label": 0
                },
                {
                    "sent": "Kind of definition about smart objects and what our understanding of smart objects is.",
                    "label": 0
                },
                {
                    "sent": "Next will be the smart Object innovation lab.",
                    "label": 0
                },
                {
                    "sent": "Here will give you all of you what kind of research questions we try to answer in that lap.",
                    "label": 0
                },
                {
                    "sent": "Next point is the startup case.",
                    "label": 0
                },
                {
                    "sent": "There was gripe.",
                    "label": 0
                },
                {
                    "sent": "What kind of case we will show in February and last but not least, are the use cases we want to develop further when the level is actually here or.",
                    "label": 0
                },
                {
                    "sent": "The new building at Milliton.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What's the motivation?",
                    "label": 0
                },
                {
                    "sent": "Logistic system is comprised of all elements in the global network, from material information flow between the enterprises and information and material flows between the single workspaces of a manufacturing area, and all these workplaces, there are kind of events that are generating information.",
                    "label": 1
                },
                {
                    "sent": "Another question is what do we do with that information?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That leads us to some unanswered questions.",
                    "label": 0
                },
                {
                    "sent": "The overall question is what are the benefits of smart objects in the supply chain and production?",
                    "label": 1
                },
                {
                    "sent": "Here for I'll describe what we understand under smart objects few slides later.",
                    "label": 0
                },
                {
                    "sent": "Next question is how can events be integrated into planning systems on different levels?",
                    "label": 1
                },
                {
                    "sent": "In an enterprise.",
                    "label": 1
                },
                {
                    "sent": "And how much information transparence do we need?",
                    "label": 0
                },
                {
                    "sent": "And which of them are even quantifiable here is very important.",
                    "label": 0
                },
                {
                    "sent": "We can generate many information, but it's important to have the right information at the right time in the right place.",
                    "label": 0
                },
                {
                    "sent": "Actually, the problem is that events are processed not frequently enough.",
                    "label": 0
                },
                {
                    "sent": "They are not detailed enough and they are a process too slow to have.",
                    "label": 1
                },
                {
                    "sent": "Real time draft them events real time in your IT systems.",
                    "label": 0
                },
                {
                    "sent": "Last thing is that the events are not integrated into the different levels of planning for close up loop control to sum up.",
                    "label": 0
                },
                {
                    "sent": "There's actually insufficient integration between the physical world and the information systems.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the other hand, the gap between.",
                    "label": 1
                },
                {
                    "sent": "The data input costs are decreasing in the last years.",
                    "label": 0
                },
                {
                    "sent": "Actually we started up with bar codes and RFID and are actually faced with Zen zone networks and that leads us that we can match them to the real to the physical world and then it's possible to have to integrate the event processing and the application of smart objects.",
                    "label": 1
                },
                {
                    "sent": "Now question is, what are smart objects in our under?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ending.",
                    "label": 0
                },
                {
                    "sent": "Principle you see different kind of business objects that are affecting the different levels of the system.",
                    "label": 1
                },
                {
                    "sent": "There's ones tools or machinery and equipment.",
                    "label": 0
                },
                {
                    "sent": "Also containers, goods, articles.",
                    "label": 1
                },
                {
                    "sent": "Zoes flee documents, employees, customers and energy.",
                    "label": 1
                },
                {
                    "sent": "But these are just objects are not smart objects, but what we have to do to make all of them smart is.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To um, combine them with information technology.",
                    "label": 1
                },
                {
                    "sent": "So here for example, you have actuators, you have sensor systems, some kind of identification, localization, information processing and or communication, and to have for example, here is like a container.",
                    "label": 1
                },
                {
                    "sent": "If you put a kind of sensor system into a container that perhaps measures the temperature and.",
                    "label": 0
                },
                {
                    "sent": "Put also RFID tech M for identification.",
                    "label": 1
                },
                {
                    "sent": "Then it becomes a smart object.",
                    "label": 0
                },
                {
                    "sent": "That's our kind of understanding smart objects.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now, what what can we do with that kind of?",
                    "label": 0
                },
                {
                    "sent": "What can we do with smart objects?",
                    "label": 1
                },
                {
                    "sent": "It's if you, for example, think of machinery or maintenance.",
                    "label": 0
                },
                {
                    "sent": "There is possible to have to have documented the whole life cycle of the service and together with the tool management where it's possible to have at the tool.",
                    "label": 0
                },
                {
                    "sent": "Kind of instructions how to use that tool and kind of authorization so that just the right work.",
                    "label": 0
                },
                {
                    "sent": "You can use these tools to do maintenance on the special machinery.",
                    "label": 0
                },
                {
                    "sent": "Therefore you can optimize your whole maintenance process.",
                    "label": 0
                },
                {
                    "sent": "On other examples are like on employees and customers.",
                    "label": 0
                },
                {
                    "sent": "What you have already today is kind of something like that.",
                    "label": 0
                },
                {
                    "sent": "It's for RFID tech.",
                    "label": 0
                },
                {
                    "sent": "It's like access control.",
                    "label": 0
                },
                {
                    "sent": "We also have that here and you'll see it in many, many companies that is already in use.",
                    "label": 0
                },
                {
                    "sent": "You also can do kind of.",
                    "label": 0
                },
                {
                    "sent": "On kind of lifecycle service with your customers that you know when you are at the customer, what is the history of that customer?",
                    "label": 0
                },
                {
                    "sent": "Also in that context of maintenance and what are the problems that this customer has had had in the past and well, what document and you already have the documents of these customers with you?",
                    "label": 1
                },
                {
                    "sent": "I'm in energy management is just a two buzzwords.",
                    "label": 0
                },
                {
                    "sent": "Let me mention it's one smart metering.",
                    "label": 0
                },
                {
                    "sent": "An demand side management with smart metering, you need to think a little further.",
                    "label": 1
                },
                {
                    "sent": "You might need information with your energy.",
                    "label": 0
                },
                {
                    "sent": "Otherwise a smart meter won't work.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Next point on this smart object innovation lab.",
                    "label": 0
                },
                {
                    "sent": "Arm.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like I tried to.",
                    "label": 0
                },
                {
                    "sent": "To make you clear, is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, small objects track and evaluate the stages and event information on business objects in real time or can develop them in real time and they close or they help to close the gap between RT systems and the flow of objects.",
                    "label": 1
                },
                {
                    "sent": "And therefore, at our innovation left the smart Objects Innovation Lab we worked together with companies and other leading institutes of the R WTH and we try to find out at the beginning.",
                    "label": 0
                },
                {
                    "sent": "We try to answer questions in two different fields.",
                    "label": 0
                },
                {
                    "sent": "The one is technology, scouting and application, the other one is information, logistics and standardization.",
                    "label": 1
                },
                {
                    "sent": "The first one technology scouting and application.",
                    "label": 0
                },
                {
                    "sent": "There are three questions that we try to answer in the next few years.",
                    "label": 1
                },
                {
                    "sent": "One is which future Anki technologies enable intelligent objects?",
                    "label": 1
                },
                {
                    "sent": "How do these technologies develop in short and medium term and which logistic application scenarios are economically feasible?",
                    "label": 1
                },
                {
                    "sent": "And last but not least, what is the contribution of smart objects to solving logistics challenges and?",
                    "label": 0
                },
                {
                    "sent": "That goes very close with the economical view on the things to see on the one side, what and what does smart objects enable us to do?",
                    "label": 0
                },
                {
                    "sent": "And on the other side, is it worth it?",
                    "label": 0
                },
                {
                    "sent": "Does it?",
                    "label": 0
                },
                {
                    "sent": "Does it on economically?",
                    "label": 0
                },
                {
                    "sent": "Few gives give us some opportunities in our before our processes.",
                    "label": 0
                },
                {
                    "sent": "The other one is the information logistics and standardization.",
                    "label": 1
                },
                {
                    "sent": "Here we are trying to find out how to design the data acquisition and processing against the background of increased data traffic and what contribution of standards to provide.",
                    "label": 0
                },
                {
                    "sent": "For interoperability, interoperability of intelligent objects, in which standards are required in the future to have a example of what is meant.",
                    "label": 0
                },
                {
                    "sent": "With that we have for which future key technologies enable intelligent objects I have.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kind of example, it's not already finished, but it's the idea how to to work with that.",
                    "label": 0
                },
                {
                    "sent": "It's a technology Roda.",
                    "label": 0
                },
                {
                    "sent": "And here we can see you have different technologies that are important in the context of smart objects like actuator sensor, systems identification and so on.",
                    "label": 0
                },
                {
                    "sent": "And you can see one view on that kind of radar what.",
                    "label": 0
                },
                {
                    "sent": "What different kind of technologies are available and which majority degree they have?",
                    "label": 0
                },
                {
                    "sent": "On",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now I'll come to what is our startup case that we want to show or realize in the smart objects lab when we go live in February.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Therefore we have two.",
                    "label": 0
                },
                {
                    "sent": "We have 3 levels that we try to do show level one.",
                    "label": 0
                },
                {
                    "sent": "You just have application of bar code, so we have in the in the small object that we have.",
                    "label": 0
                },
                {
                    "sent": "Kind of four different companies, but it says three different companies, but one is a is a wholesaler that have a front door on the back store.",
                    "label": 0
                },
                {
                    "sent": "And on the first level, we would show that supply chain just with application of bar codes and there we have no vertical and horizontal integration on the second level.",
                    "label": 1
                },
                {
                    "sent": "We have intra organizational process improvement without ID specially RFID.",
                    "label": 1
                },
                {
                    "sent": "And on the third level we have horizontal integration where the ERP systems with automated ADR integrated over the supply chain over these four or three steps.",
                    "label": 0
                },
                {
                    "sent": "And what we want to show with that lab startup is our experience and the difference in real time integration that we have today.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That is, the layout of our lab.",
                    "label": 0
                },
                {
                    "sent": "The lab will be just one floor under that and room 203, two or three and.",
                    "label": 0
                },
                {
                    "sent": "Yeah, here you see the producer, the wholesaler and retailer with front and back store.",
                    "label": 0
                },
                {
                    "sent": "And yeah, the case is generated is together with the.",
                    "label": 0
                },
                {
                    "sent": "Gary Weber and it's in the context of clothing of the clothing industry.",
                    "label": 0
                },
                {
                    "sent": "That's the reason why we have here a retailer with front and back store, not two different companies.",
                    "label": 0
                },
                {
                    "sent": "First, we have the producer and the activities we want to show at the with producers first to print the labels and then apply the goods with the labels and scan them for delivery and the potential we want to show here between the 1st and the third level.",
                    "label": 0
                },
                {
                    "sent": "Is first tracking and tracing of the production and logistics process 2nd.",
                    "label": 1
                },
                {
                    "sent": "Potential is to avoid errors through manual data input and 3rd is easy and fast logging.",
                    "label": 1
                },
                {
                    "sent": "Of outgoing goods.",
                    "label": 0
                },
                {
                    "sent": "The next step is the wholesaler.",
                    "label": 0
                },
                {
                    "sent": "He gets the.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "He gets the goods from the from the producer and here we showed activities to receive the goods, picking them and deliver them to the retailer and the potentials between the free levels.",
                    "label": 0
                },
                {
                    "sent": "First as simple goods received when it just goes with RFID tech through the gate.",
                    "label": 0
                },
                {
                    "sent": "And we have real time inventory data and optimize automized picking of the hearing that examples T shirts.",
                    "label": 1
                },
                {
                    "sent": "An from the wholesaler.",
                    "label": 0
                },
                {
                    "sent": "The T shirts are products.",
                    "label": 0
                },
                {
                    "sent": "Go in the.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Star of the retailer.",
                    "label": 0
                },
                {
                    "sent": "And here we try to show how they receive the goods, how they storage EM, and then we want to show a demand driven stock removal to the front store.",
                    "label": 1
                },
                {
                    "sent": "And the potentials between that, especially the demand driven stock removal between RFID and barcode solution that you see the potentials like.",
                    "label": 0
                },
                {
                    "sent": "You are wide out of stock situations.",
                    "label": 1
                },
                {
                    "sent": "You have real time information on the inventory, same as at the wholesaler and you have already a simple simple receipt of goods.",
                    "label": 0
                },
                {
                    "sent": "From the back store of the retailer.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You get them dim and driven to the front store.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The front store you have customer have the possibility.",
                    "label": 0
                },
                {
                    "sent": "Or yeah, you have the possibility to go to a kind of intelligent mirror where with RFID tech they show you some details about the T shirt.",
                    "label": 0
                },
                {
                    "sent": "In that case like what different other clothes are fitting with that or what shoes are in stock that you can use with that and so on.",
                    "label": 0
                },
                {
                    "sent": "Next thing is then you go to or you can go with that to the intelligent cache point and.",
                    "label": 0
                },
                {
                    "sent": "There we have automatically paying.",
                    "label": 0
                },
                {
                    "sent": "And then it's out of the of the system.",
                    "label": 0
                },
                {
                    "sent": "Guys, kind of that.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and when the insured is sold, you're automatically get fill up that stock behind there from the back store.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yep, that is the case.",
                    "label": 0
                },
                {
                    "sent": "We want to or we actually building up.",
                    "label": 0
                },
                {
                    "sent": "For the for the start in February, but we already planned some further use cases because this case is just to show something and but we want to work with that and that's that will do in further use cases, especially if you think about the different size.",
                    "label": 0
                },
                {
                    "sent": "Now we have something about 30 square meters on space when we move from here to the campus in to the new rooms there we have about 300 square meters just for our lab.",
                    "label": 0
                },
                {
                    "sent": "The other apps already also have 300 square meters and we have a production line with thousand square meters, so we are able to show some more.",
                    "label": 0
                },
                {
                    "sent": "Cases with much more complexity.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we have one too.",
                    "label": 0
                },
                {
                    "sent": "Specially you show two things.",
                    "label": 0
                },
                {
                    "sent": "One is the vertical integration.",
                    "label": 0
                },
                {
                    "sent": "And therefore we want to increase the data resolution of ERP systems.",
                    "label": 1
                },
                {
                    "sent": "And there we try to close the gap between the virtual and the real world and.",
                    "label": 0
                },
                {
                    "sent": "We are trying to get the frequent tech data reading and complex event processing to have these real time mapping of stocks and object flows.",
                    "label": 1
                },
                {
                    "sent": "Yeah technologies, we are planning to work with this RFID or auto ID, big bidder sensors and complex event processing in that case and specialist we had don't want to work the.",
                    "label": 0
                },
                {
                    "sent": "Free Innovation labs with everyone on its own.",
                    "label": 0
                },
                {
                    "sent": "We planning to integrate them and so in that case we're working together with the ERP innovation lab that we think.",
                    "label": 0
                },
                {
                    "sent": "Open which will present later an here.",
                    "label": 0
                },
                {
                    "sent": "In that case we want to work close together with them to get the the.",
                    "label": 0
                },
                {
                    "sent": "To get the data from from the smart object in the production line up in the different ERP systems.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other direction is between horizontal integration between the different.",
                    "label": 0
                },
                {
                    "sent": "The different companies and if we try to improve and harmonize the data exchange fraud well you Jane.",
                    "label": 0
                },
                {
                    "sent": "Also with Auto ID and EDI standards and the lab is kind of part of the value chain and it has RV gates and you can you can see over the over different ERP systems where in the supply chain is my object or are my objects or products actually?",
                    "label": 1
                },
                {
                    "sent": "Yeah, this is the kind of tracking and tracing along the supply chain and here we want to test or also invent new inventory management strategies.",
                    "label": 0
                },
                {
                    "sent": "Here we work together also with the European Innovation Lab, but also with the service Science Innovation Lab that will be the next presentation of my colleague.",
                    "label": 0
                },
                {
                    "sent": "Mr. Fabre.",
                    "label": 0
                },
                {
                    "sent": "Technologies are the same like in the use case before.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the second or third case we want to take care is maintenance and maintenance with smart object without ID and with mobile solutions.",
                    "label": 0
                },
                {
                    "sent": "And here our goal is to increase the efficiency of maintenance process and like I mentioned before when I described the smart object.",
                    "label": 0
                },
                {
                    "sent": "We want to take the machinery and the equipment.",
                    "label": 0
                },
                {
                    "sent": "To get the process more eficiency.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah, we also we use where we here we want to.",
                    "label": 0
                },
                {
                    "sent": "Also we want also to use mobile technologies specially because in maintenance background it's it might be important to have.",
                    "label": 0
                },
                {
                    "sent": "I have a kind of mobile readers and all this stuff with you, specially if it's not.",
                    "label": 0
                },
                {
                    "sent": "If the maintenance is not in your in your production online, but it's at custom or something like that.",
                    "label": 0
                },
                {
                    "sent": "And here we also will work together with the smart Object Innovation Lab with the Service Science Innovation Lab.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "A bit with the European ivation left, but the.",
                    "label": 0
                },
                {
                    "sent": "The integration with the Service science innovation.",
                    "label": 0
                },
                {
                    "sent": "It will be much more stronger in that context.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "There was my short presentation of small objects innovation lab.",
                    "label": 0
                },
                {
                    "sent": "I'm afraid I'm not.",
                    "label": 0
                },
                {
                    "sent": "I cannot present you more than that, but we're actually in building up that that lap, but I think.",
                    "label": 0
                },
                {
                    "sent": "The colleagues after that will have to show you much more than that because their level apps are already working.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Are there any questions?",
                    "label": 0
                },
                {
                    "sent": "Or maybe it might be a good idea.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "You consider going further than smart objects to intelligent objects.",
                    "label": 0
                },
                {
                    "sent": "Logic.",
                    "label": 0
                },
                {
                    "sent": "Being able to decide upon.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Out there.",
                    "label": 0
                },
                {
                    "sent": "Now we actually thinking of kind of research project where we want to work on that on that question on kind of.",
                    "label": 0
                },
                {
                    "sent": "Also, what algorithms do you need when you have small objects?",
                    "label": 0
                },
                {
                    "sent": "Also with the sensor systems and they are organizing their own way through the production, so there's more objects are communicating with the machinery and there is no central.",
                    "label": 0
                },
                {
                    "sent": "Planning and controlling.",
                    "label": 0
                },
                {
                    "sent": "But is all these central that's also.",
                    "label": 0
                },
                {
                    "sent": "We also want to to take care of that in the future in our lab.",
                    "label": 0
                },
                {
                    "sent": "If.",
                    "label": 0
                },
                {
                    "sent": "Implementing scammer with description of the process.",
                    "label": 0
                },
                {
                    "sent": "The travels and maybe help the object take decisions based on that.",
                    "label": 0
                },
                {
                    "sent": "Second question, what you got was.",
                    "label": 0
                },
                {
                    "sent": "You intend to use other approaches besides the outdoor anti approach.",
                    "label": 0
                },
                {
                    "sent": "For example, the Japanese version of you code.",
                    "label": 0
                },
                {
                    "sent": "UID how we actually in the first cases we're just using.",
                    "label": 0
                },
                {
                    "sent": "Also ID but in further cases we are open to all other technologies.",
                    "label": 0
                },
                {
                    "sent": "That's one reason why we set our first goals is to do something like technology, scouting and to see what is important in that in that field for us and then see what in which directions we trying to intense our research.",
                    "label": 0
                },
                {
                    "sent": "Comment could also be that as these labs are directed and.",
                    "label": 0
                },
                {
                    "sent": "Heavily.",
                    "label": 0
                },
                {
                    "sent": "Contributed by the industry as well.",
                    "label": 0
                },
                {
                    "sent": "So they are looking into real case, which you can immediately bring it within the region.",
                    "label": 0
                },
                {
                    "sent": "So we our primary focus is to support German industry and although the companies that we're dealing with are multinationals but they have some image it needs which are geared towards solutions which could be rapidly provided.",
                    "label": 0
                },
                {
                    "sent": "Or integrated into their current running businesses and processes, so that's why they just limited it to this level.",
                    "label": 0
                },
                {
                    "sent": "Probably special we are launching this lab in January, February on the 1st and the 2nd February we have.",
                    "label": 0
                },
                {
                    "sent": "Kind of Congress here.",
                    "label": 0
                },
                {
                    "sent": "The partner information management.",
                    "label": 0
                },
                {
                    "sent": "Congress and they are in that context.",
                    "label": 0
                },
                {
                    "sent": "We try to to start smart objects left is first in the 2nd of February next year.",
                    "label": 0
                },
                {
                    "sent": "So it might be a good idea to mention that there are some.",
                    "label": 0
                },
                {
                    "sent": "Industrial Partners which are not only for manufacturing or retail, but they are also from software technology providers are developers.",
                    "label": 0
                },
                {
                    "sent": "They are also part of it.",
                    "label": 0
                },
                {
                    "sent": "As ERP system is also as it will be integrated and hardware as you already saw that you know RFID tagging would be there as well and we have sensoric sensor systems with.",
                    "label": 0
                },
                {
                    "sent": "When is, it is anticipated in two years or three years time for the larger established two years, I think.",
                    "label": 0
                },
                {
                    "sent": "This idea is coming to life and your focus on industry and field application of that.",
                    "label": 0
                },
                {
                    "sent": "So that was the question.",
                    "label": 0
                },
                {
                    "sent": "The UID.",
                    "label": 0
                },
                {
                    "sent": "I did some research about this domain and I found this Japanese version or the verified coding based systems and during the ICT 2010 in Brussels I was surprised to see that they came.",
                    "label": 0
                },
                {
                    "sent": "Stand where they presented the technology and they were also implemented in Vermont, implementing it in.",
                    "label": 0
                },
                {
                    "sent": "Cities from Japan and they were working on new systems for museums or also for shops.",
                    "label": 0
                },
                {
                    "sent": "Technologies to identify shop.",
                    "label": 0
                },
                {
                    "sent": "So they had a device and durable walking on the street and you could receive information about shops about prices, about products and so on, using different kinds of media from modified E2.",
                    "label": 0
                },
                {
                    "sent": "Wireless, Bluetooth and even barcode identification.",
                    "label": 0
                },
                {
                    "sent": "Be nice if you could kindly send me the name of the company.",
                    "label": 0
                },
                {
                    "sent": "Yes, maybe.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it would be nice.",
                    "label": 0
                },
                {
                    "sent": "If there are no further questions then.",
                    "label": 0
                },
                {
                    "sent": "We will have an informal 15 minutes break before we head down to the service Science Innovation Lab.",
                    "label": 0
                },
                {
                    "sent": "Thank you so much once again.",
                    "label": 0
                }
            ]
        }
    }
}