{
    "id": "pgukv25pdntj5sex56zqsottqnr5k4ow",
    "title": "Community structure in graphs",
    "info": {
        "author": [
            "Santo Fortunato, School of Science, Aalto University"
        ],
        "published": "Oct. 15, 2008",
        "recorded": "September 2008",
        "category": [
            "Top->Computer Science->Network Analysis"
        ]
    },
    "url": "http://videolectures.net/ephdcs08_fortunato_csig/",
    "segmentation": [
        [
            "So what kind of problem is this?",
            "And I'll show you mean it's very simple."
        ],
        [
            "Fine, it's a new defined problem.",
            "In fact, that's probably why it's so simple to define.",
            "And.",
            "Which is the reason why it's so easy to do stuff about this.",
            "So let's take a network like this 112 nodes.",
            "This is very schematic example of how real networks look like.",
            "I mean, in this case you see three groups of nodes.",
            "With many more connections between them then between each other these groups are called communities.",
            "See the network is connected.",
            "There is a path between each pair of nodes, but they are clearly identifiable in this case at least structures.",
            "So there are more links inside and outside, so keep this in mind.",
            "This is the way some how we think about communities on graphs.",
            "Graphs are sparse, so everything I would say we refer to so called sparse graph, which means with graph to graph that have a number of links which is not much larger than a number of nodes.",
            "OK, otherwise a lot of these methods cannot be applied at all."
        ],
        [
            "So why is this problem so interesting?",
            "It is interesting because it finds applications in many different types of graphs.",
            "Metabolic networks, for instance, in which identifying groups of nodes which are connected to each other makes possible identificational metabolic pathways or protein protein interaction networks in which finding groups or proteins which interact each other mainly to the identification of functional modules.",
            "Social networks like this one famous karate club of Zachary.",
            "Which little dent ification of communities of friends, their common interests or economical networks like this one which is a network of.",
            "And companies economics are companies in Germany.",
            "And in which in this case, I mean, you can highlight the partnership within them."
        ],
        [
            "So this is the outline is going to be a guided tour to this problem.",
            "The ingredients of this problem and the description of the most fundamental algorithm.",
            "Although there are thousands of arguments, so this would be enough for a full course and they have only one hour please.",
            "So I would start with some elements of Community detection, trying to define the problem and the things you need to know in order to start working on this.",
            "And then I will say something about the past of this problem, because this is a very old problem.",
            "It's almost 40 years old.",
            "The oldest ancestor this problem was the graph partitioning problem of computer science produced at the end of the 60s even.",
            "And almost the same time following a parallel path.",
            "The social Sciences, especially, but then I mean spread everywhere else now is very common in biology and so on.",
            "Also, the technique of hierarchical clustering at some importance to address this problem still now.",
            "And then at some point something happened in 2002.",
            "This paper, I mean the paper with the given human was was published with introduction of an algorithm which tried to introduce some changes in the way of thinking about this problem and I will tell you what changes they are starting from them.",
            "Then Phyllis instruction to get interested in this problem and many, many new algorithms introduced by phases may not only basis were introduced and we say something about those.",
            "And finally, we conclude with the issue of testing algorithms save which are going to include or not and to compare are going to each other.",
            "The three main questions.",
            "In this case R. What is a community?",
            "What is a partition of a graph in communities and what is a good partition?",
            "OK."
        ],
        [
            "So these are the three main questions.",
            "I start from the first one.",
            "There are many definitions."
        ],
        [
            "Communities there are many criteria to define communities starting already from social network analysis.",
            "Their local criteria in which you just focus on the group of nodes.",
            "They say OK, if this group or noses some property which can be anything you like, this this group or knows the community regardless of the rest of the graphs.",
            "They're global criteria instead, in which a group of nodes is a community with respect to the rest of the net.",
            "And finally.",
            "You can say that nodes belong to communities.",
            "They are similar to each other.",
            "So in this case the criteria criterion can be local or global because it according to your criteria similarity.",
            "And that's why I mean, doesn't really enter the first 2 classes, but I won't say anything about this.",
            "I want any specific definition because what happens in general is the fact that communities are indirectly defined by the particular algorithm that you use.",
            "So sometimes you don't even define this.",
            "You have some idea because you have this concept of having more links inside and outside.",
            "And then you apply your algorithm then OK, whatever I find here, these pieces are communities.",
            "This is actually part of the problem because you know, it's a conceptual kind of back.",
            "Of most algorithm.",
            "So."
        ],
        [
            "What is a partition is that if you read the definition from my dictionary, for instance, you see that the partition is subdivision of graphing groups of vertices.",
            "Such that each vertex is assigned to one group.",
            "OK to one group.",
            "However, this definition is number of problems when you try to.",
            "To find meaningful partitions in real graphs.",
            "Two orders of problems.",
            "The problem is that in rayographs communities overlap, especially in social networks.",
            "There are people.",
            "For instance, in this case, notes of these graphs which do not belong to one community, would belong to several communities, because for instance, I'm here.",
            "For instance, the community of people attending this conference, but they also work colleagues.",
            "I also play soccer with some other people, and so, but I'm the same guy.",
            "The other problem is the problem of hierarchical structure.",
            "Organizations of these communities communities inside our community.",
            "So let me highlight this point.",
            "So little bit better."
        ],
        [
            "So I already told you what overlapping communities are this very schematic diagram.",
            "This network doesn't correspond to anything.",
            "And you see that this Violet notes here are shared between at least two communities.",
            "OK, in this case they really overlap, so we understand that if the problem itself without overlap is very difficult already, this complication of overlap makes it enormously more complicated, so we're really happy about this.",
            "Maybe work for many years to come.",
            "This is the first paper published in Nature in 2005.",
            "In which this this problem was addressed for the first time.",
            "Hope they have enough time.",
            "If I switch is off.",
            "So balance and even developed a software is called scifinder that you can download and apply."
        ],
        [
            "Silly.",
            "The problem of hierarchies is like I said, that there may be groups containing other groups.",
            "Points like in this case is a network of 512 nodes.",
            "Which is a clear identification for big groups or 128.",
            "This ones that you see in each of this group is again if you look closely if further subdivision in four groups of 32.",
            "So in this case you say what is the best partition?",
            "There are two partition.",
            "There are two levels organization.",
            "There is an organization for macro groups.",
            "There is an organization in 16 micro groups.",
            "This is a recent paper just appeared in nature because they more in human, in which this problem was kind of addressed.",
            "By using statistical inference, it's a period of time."
        ],
        [
            "Speak about this, but important thing is to give the key concepts here.",
            "Third and last question, which is the most important, what is a good partition?",
            "There are infinite partition.",
            "In fact even for very small graph the number of partitions grows faster than exponentially with the number of nodes, because because you can divide it into three groups.",
            "So if you try to divide a network in pieces."
        ],
        [
            "You may wonder what the difference is between partitions.",
            "Which one is better?",
            "Which one is the best?",
            "If there is 1?",
            "For instance in this case.",
            "I would like to know for the very same network that you see here whether the great point here the Gray node belong to the Community, to the left or to the right.",
            "Often an OK, but I'm making comparison about this in general I don't know.",
            "Because in order to address this, I must define a criterion for quality.",
            "I must define the quality or partition must have a number of function.",
            "We just called quality function and they indicated with Q."
        ],
        [
            "Which gives you a number for each partition, and once you have numbers you can just compare numbers.",
            "So for instance in the case before partitions P1 and P2, which one is the best?",
            "If I have a function that gives me a number for each partition for any partition of the graph so well defined function then I can just compare Q or P1 or with Q, P2 the one which is larger correspond to the best partition.",
            "This is by far the most popular quality function.",
            "The modularity by."
        ],
        [
            "And given that this in 2004, it's a very important function because it generated itself the most popular method of partitioning graph so far.",
            "Which is a number of problems, and so I will discuss about this.",
            "So this definition let me define these objects very simple as you see.",
            "So this is the function.",
            "QL is the total number of links of the graph.",
            "So you count 'em in.",
            "Yeah, just stay out there.",
            "This admission.",
            "So it's a summation of terms.",
            "Each of these pair corresponds to one group, so we have a partition in North groups.",
            "OK, any partition.",
            "For each group you count, you calculate this difference.",
            "Which is the difference between the actual number of links inside the group Li?",
            "Which means the number of links connecting pairs of nodes or the same group.",
            "Minus this ratio here where L is again the total number of links and the I is the total degree of the nodes of the Community.",
            "I totally agree means that you take really the degree which nodes are number of connections, the number of neighbors, no matter if they are inside or outside the community in some over the group you get this big guy squared divided by 4 L. The concept behind this, I don't have time to address it, which is again if it in a sense, because a very simple demonstration.",
            "Is that one has to compare the total number of links which have inside the group.",
            "With the expected number of links that this graph would have if it were a random graph with the same degrees for the nodes.",
            "OK, the idea is that the random graph does not have community structure.",
            "You don't expect to find communities in a random graph is not completely true, But again, this is very tricky.",
            "Issue starts to be technical, is not the case address here.",
            "So you compare the graph.",
            "The real graph with a copy of it, which is random, which keeps the same degree for the nodes.",
            "So it really has a lot in common with the other one, but in which you attach these links arbitrarily.",
            "In this class, so graph.",
            "This is the expected number of links you would find in module I.",
            "So if L is bigger than this one, then this group knows it's a community.",
            "The larger this difference, the more me, the stronger this community."
        ],
        [
            "So this is somehow some quick answer to the three main questions, which would take really much longer because some of them are not even properly defined.",
            "Now, let me tell you something about the history of this problem, 1970s, the problem graph partitioning appears in computer science.",
            "It was really very technical answer to very technical problem, but then it became it generated the so called clustering problem.",
            "And it's still use.",
            "I mean, it's still very important problem so far.",
            "At the same time, more or less are in fact the same in this again.",
            "You start to see the first dendrograms.",
            "Which is the hierarchical trees.",
            "I would show one before I mean soon in social Sciences.",
            "Which is this technique of organizing hierarchically communities.",
            "I wish I would describe these things, then suddenly 2002 this paper was published.",
            "Which is like by now, but for under citations.",
            "It's very cited paper which kind of generated and I will tell you why this paper is important.",
            "We kinda novelty it introduced to the field.",
            "And starting from this date, it's just zero year.",
            "There are methods of new generation device, mostly by phases, but not only.",
            "Which are more refined, which are more demanding?",
            "Which want to tell you as much as possible with the least possible number of inputs.",
            "This is basically the novelty."
        ],
        [
            "Let me start with graph partitioning.",
            "This is the definition of repetition and I want to divide the graph in end parts.",
            "Such that the number of links between them, which is called cat size, is minimal.",
            "OK.",
            "The number of links connecting nodes or one group, not with the other group.",
            "If you some or all of them.",
            "This is called cut size.",
            "You must minimize this number.",
            "But if I define it just like this without adding anything else, this is a bit different.",
            "It's not a well defined problem.",
            "Becausw the number N in this case is left free.",
            "OK, so if I say if I divide the network in one group so if I don't divide it at all, the cut size is 0 and the smallest one that I can get for a connected graph.",
            "So this is not a well defined problem.",
            "I need to specify at least how many groups I have.",
            "OK.",
            "But I will say to say how big they are, because in this case you can make one of the paths arbitrary small in the limit 0.",
            "Even if you say how many parts there must be such that the graph size, the Cup size is minimized.",
            "So when you define this problem is to say in how many pieces you want to break the graph and how big these pieces must be.",
            "How many nodes must be in this in this piece?",
            "That's why the simplest formulation of this prob."
        ],
        [
            "Which is already by itself.",
            "NP complete so it cannot be solved in optimal way is a so-called problem of partition.",
            "You divide the graph in two parts, which are exactly the same size.",
            "OK. And of course the minimum cut size.",
            "For instance in this case in this example, this is a solution of the partition by partitioning problem for this network.",
            "Here is a network of 40 nodes, 7 to the left, 7 to the right, and you have a cut size of four 1234.",
            "Because there are only four links connecting into parts.",
            "There is no plus.",
            "It's not possible in this case to find.",
            "A partition with a smaller cut size in this in fact is the only solution of this problem."
        ],
        [
            "It was designed by hand, right?",
            "There are several ways of addressing it.",
            "One of the most popular and one of the earliest ones were introduced already in the 70s is the technique of spectral partitioning, which uses the property.",
            "The very special properties of the Laplacian matrix.",
            "There are some metrics.",
            "Is the object here, which looks weird in the little bit is.",
            "But this is very simple to define.",
            "It is a matrix.",
            "In which you have on the diagonal.",
            "On each diagonal element, the degree of node I.",
            "So on the Princess and the first element or the diagonal have the degree of the first node in the second degree of the 2nd, and so on, and all the other elements are the elements of the adjacency matrix.",
            "With the - they just symmetric system.",
            "At this it tells you.",
            "If you have I&J, which are two nodes, of course if they are connected or not, so AIJ is 1 if I&J have a link connecting them, otherwise it's 0.",
            "We just met with the - and that's it.",
            "And you add this diagonal mean on the diagonal.",
            "The degrees.",
            "This is della pressure mattress is one of the definitions, also normalized Laplacian."
        ],
        [
            "But then.",
            "The funny thing is that this is a very interesting matches.",
            "A lot of properties were studied for many years.",
            "It is applied in many many different environments like in synchronization so.",
            "All eigenvalues of this matrix are not negative.",
            "OK. Interestingly enough.",
            "There is at least 1 zero eigenvalue.",
            "There is only one ON value.",
            "If the graph is connected.",
            "So if there is a path between any pair of nodes, But if it's divided in G groups, there are exactly 0 eigenvalues and all the others are positive.",
            "That's why if G is equal to 1, which means if the graph is connected, there is actually 10 eigenvalue.",
            "In this case, so if the graph is really divided in G groups, you can rearrange the nodes, just renaming them OK, just making a permutation.",
            "And the Laplacian matrix will just look like this in block diagonal form.",
            "The matrix is OK or like OK, assuming the sense that yeah, I'm considering here and directed undirected graph.",
            "This is a very good point.",
            "So yeah, so the matrix is symmetric because the graph is undirected.",
            "Which means there is.",
            "You can go from A to B if they are connected, but it also can go from B to a.",
            "That's why you have the two elements.",
            "Yeah, otherwise there are problems, of course from the spectral composition.",
            "That's a good point, right?",
            "Yeah, this is symmetric matrix, which you can write.",
            "In this case we can rearrange the nodes and you have this squares here.",
            "Each of them corresponds to one of the Jeep parts of the graph.",
            "Which means basically they are connected between each other, but there is no connection between one square and the other one.",
            "That's why here you have zero.",
            "And here you have non zero elements.",
            "This is the."
        ],
        [
            "Party which is using graph partition inspector partition in this case.",
            "Suppose that the network is connected.",
            "But that is divided into communities which are weakly connected to each other.",
            "OK, so it's connected, which means there is only 1 zero in value.",
            "An you cannot find this block diagonal decomposition, but if you try to you can certainly try to arrange so to order to rename the nodes such that you get the kind of block diagonal form with very few nonzero elements off the diagonal of the squares.",
            "And.",
            "It's possible to show that in this case.",
            "The minimal cut size.",
            "This object that I want to minimize so they cut size can be expressed in terms of the second smallest eigenvalue of Laplacian matrix, which is called Fiedler Vector.",
            "OK so I have a connected graph so there is only 1 zero again value.",
            "The second eigenvalue is positive.",
            "The second smallest must be positive.",
            "Its eigenvector is called Fiedler Vector.",
            "And it has positive and negative components.",
            "It must be like this because the sum of the elements of each eigenvector or present matrix is 0.",
            "Since we show it, I don't know it OK?",
            "Is basically due to the fact that there is one trivial eigenvector corresponding to the eigenvalue zero and they're all orthogonal.",
            "So if you make the product and this summer anyway, so believe me so this vector, once you calculate it, which you can do with well defined methods for matices, you derive the second vector, say this some of these elements are positive, some of them are negative.",
            "OK, because their son must be 0.",
            "So at the end, once you calculate this this object here.",
            "Everything you need to do if you want to break a graph in two parts is to order the components of this vector.",
            "From the smallest from the largest positive to the smallest negative.",
            "And if we want to divide it into N1 and N2 which is equal to N -- 1.",
            "Nodes.",
            "Then you just take the first N1 elements.",
            "OK, you can do it in two ways.",
            "Of course, because you can start from the top from the bottom.",
            "The two ways correspond to two different cut sizes.",
            "You take the smaller one because of course you want to minimize the cut size.",
            "OK, so if I want to divide the graph into in a very simple way, this is not an optimal solution because the problem is NP complete.",
            "I told you OK, it's suboptimal, so you can improve over this solution with other heuristic methods.",
            "You calculate the filler vector.",
            "You order is components from the largest positive, the smallest negative.",
            "If you want to cut it into equal parts, you just divide this vector in tool.",
            "Just put the separation in the middle and they say OK. All nodes whose components are in the first half are in one group and the other nodes are in the other group.",
            "OK, this gives already very small cut size."
        ],
        [
            "But it's not an optimal solution.",
            "One way to improve it is this trick, which is called and it's an algorithm, its own algorithm by canonly conditional in which was introduced in 1971 when I was born.",
            "So it seems splitting into groups, then the network into groups.",
            "So you start from a partition into groups at each step.",
            "What you do is take a note from one group and not from the other group and just swap them.",
            "You just switched their sides OK.",
            "But you do it in order to decrease the cut size.",
            "So if after you make this change after you put one note the other the other group and vice versa, you have a lower cut size.",
            "Then you accept the move.",
            "That's a basic version, which is of course greedy.",
            "There is no stochastic element, there is no noise here.",
            "OK, and it's not very efficient.",
            "One way to make it efficiency sometimes to allow moves which even if they increase the cut size.",
            "They can let you escape local minima that you can have.",
            "OK, in this case, at the end you get a much better result.",
            "So you always try to diminish the cut size, but from time to time you accept moves that increase discuss side just by swapping pairs of nodes.",
            "At some point you see that you cannot improve anymore.",
            "That's the final result.",
            "This is a technique which is used very often.",
            "If you have a good voice about what a partition the partition of the graph could be, you start from that one please.",
            "Well, when after you can say that you fixed like, I don't say I don't handle moves and none of these moves diminishes the cut size OK?",
            "It's you Ristic necessarily.",
            "Well, you can never be sure about this.",
            "At the end you end up in a local minima anyway.",
            "The only thing that is.",
            "Sorry, yeah yeah, so you will know when it's not an optimal algorithm of course, but it gives you a good improvement over solutions.",
            "That other argument gives you the idea way.",
            "For instance you start from spectral partitioning.",
            "You get the partition I said before from the Fiedler vector, which is well defined.",
            "And starting from that one you keep swapping person nodes to reduce the cut size even further, but there is no guarantee that you're coming very close to minimum, of course.",
            "Yeah.",
            "Yeah, yeah, right.",
            "Everybody if I temperature but also the cycle to jumpstart welcome anymore or well, I mean this kind of thing corresponds introducing a temperature right?",
            "Because it makes you.",
            "I mean, it makes you make move that you wouldn't do because they would increase the cut size.",
            "They would not decrease, it's similar.",
            "And of course, in this case we come much closer to the real solution, but since it's an NP complete problem, this is very difficult to reach.",
            "So this is."
        ],
        [
            "Please.",
            "So it works.",
            "Is it can be beautiful.",
            "Is there is there?",
            "I don't think we can really prove how good it is.",
            "I mean it really depends case by case.",
            "It depends on the state on the initial condition.",
            "Leaving the feelings of George.",
            "Very young, yeah.",
            "Maybe it's better.",
            "Cody driving distance.",
            "Yeah, of course.",
            "I mean, the more operations you do they usually the battery is a result, but there's always a compromise between if your network is not so small, then I mean the number of moves is really infinite.",
            "So you want to get an answer in a reasonable time.",
            "So we have to find a compromise.",
            "Is a good compromise.",
            "You start with a good guess about a possible bipartition which you can get, for instance from spectrum by partitioning and then you improve over it with this algorithm.",
            "OK, but it's not the only way there other ways only I don't have time to speak about this right now, so let me move over to the hierarchical clustering which is very complete.",
            "I also prefer this way like to get the questions on the way.",
            "Not too rough.",
            "45, right?",
            "That's a very good question.",
            "I mean, right now, I guess focus on by partitioning, because of course is by far the simplest version.",
            "There is an additional problem there because if you do this thing here, what you do is that you consider each of the group that you find from the previous iteration as an individual community.",
            "Then you keep dividing it so it's kind of hierarchical process and that again can take you very far away from area minimum.",
            "Because already the guests can be local minimum.",
            "The first yes and then on top of this you assume that this is the real partition and then you keep dividing it.",
            "And this is a bad thing, of course.",
            "So very good question.",
            "So there are clear clustering instead is very common in social network analysis and in biology and sociology.",
            "What is it?",
            "The idea is that, of course, if I, I mean nodes must be similar to be put in the same community must be associated.",
            "They must like each other more than.",
            "They like the other nodes OK. More less like people.",
            "So introduce a criterion measure which tells you how similar any two nodes are is a matrix which is called similarity matrix.",
            "You can define it in infinite ways.",
            "Of course this arbitrary.",
            "I call it X. I start from the individual nodes so.",
            "Then the starting point.",
            "This is an agglomerative process.",
            "Starting point point is that I have a network with nodes, each of them is a community.",
            "The first move I do, I put together the two nodes which are most similar to each other.",
            "So I look for the maximum maximum element of this matrix.",
            "OK.",
            "Suppose there are three and seven of the greater similarity, and then I joined them with one link.",
            "Then now from now on there will be a community of two.",
            "And then I do the same thing iteratively.",
            "Now I have N -- 1 communities, just a second, and then I keep joining them until I put everything together.",
            "Basically the end I put all the networks, so all those together please OK. Properties like topological properties, so if it's a weight.",
            "For instance, they can be structurally equivalent, yeah?",
            "So.",
            "Common neighbors, why would they be sorry if there?",
            "First of all, I didn't define any similarity criterion here, and that one will be a bad one just for the reason that you're saying.",
            "But for instance, a way to define this could be like correlation.",
            "Yep.",
            "Yeah, for instance.",
            "I mean you can calculate the person coefficient between rows or the adjacency matrix.",
            "This is a way to create the correlation matrix from pure topology, because in this case you assume that you don't have an additional information like weights, although in principle we can introduce it.",
            "OK, there is structural equivalence.",
            "You can say two nodes are.",
            "Something that would make them similar even though they are not in the same right, but in this case, but in this case I mean.",
            "You know?",
            "You all you would get like something like bipartition, multi partitioning.",
            "Sorry multipath cities which means groups which have a lot of connection between them and very few connections between nodes which are inside a single which is just the opposite.",
            "Or the anti communities.",
            "There are many kinds of structures that you can you can define but their criterion if you wanted invite communities that there must be a lot of links inside and very filling Southside.",
            "If you do the opposite you will get an interesting structure but it's not community anymore.",
            "It's not the clustering.",
            "So how does he?"
        ],
        [
            "At work, what you get at the end is this thing here, which is called a dendrogram.",
            "This is the first move.",
            "I start from the bottom.",
            "Everybody is on his own.",
            "At the beginning everybody is isolated.",
            "Then I decide when I check the similarity metrics.",
            "This is the biggest similarity and say OK these two are together.",
            "And then I tried to say OK, these two now are together.",
            "You see I just progress to the top.",
            "These two are together.",
            "And then this one is similar to this group.",
            "There are ways to define how groups are similar.",
            "Groups are starting from the similarity matrixes.",
            "But there is not one single way there is, for instance, the so-called single linkage simple linkage scheme.",
            "There is average linkage scheme.",
            "There's a complete language scheme, basically everything.",
            "OK there, different ways of defining our similar groups are starting from the similarity matrix.",
            "For instance, I can say the two groups are similar, so the similarity of two groups is the.",
            "Largest similarity between each pair of nodes.",
            "OK, of the groups.",
            "This is the so-called complete linkage.",
            "It's a way to define a distance between groups.",
            "I need to define this because otherwise I don't know how to compare similarities between communities after the first step at the beginning each, everybody is independent.",
            "Afterwards they form already groups and I have to compare groups and decide whether they are similar enough to be joined or not OK, and this can be done in different ways according to different schemes.",
            "And I can, of course, if you're interested, I can tell you more about."
        ],
        [
            "Is offline.",
            "Now let me tell you why we're not happy about this method.",
            "At least somebody was not happy about this method years ago.",
            "In a sense, I thought you already in the in the case of the graph partitioning, one is to specify the number and the size of the clusters, and if you give a network I never seen in my life, I might have no clue about how many pieces there are and I will pick the must be.",
            "Usually this is the case.",
            "In the case of accurate clustering, if you cut your tree, your hackel tree at any level, you get a good partition.",
            "But you get N -- 1 partitions.",
            "Which one is the best?",
            "Can I take them all if the network is 1 million nodes?",
            "I cannot take 1 million partitions obviously.",
            "So I must find an additional criterion to say which partition is the best.",
            "This is usually defined arbitrary, necessary because it must be independent on the procedure that you use to get there.",
            "Quick lasting so independent of the similarity.",
            "Ideally so in the land of dreams you would like to have a method that can predict the number and the size of the partition and indicate a group of good partitions.",
            "Without telling without that I mean you telling anything to the algorithm.",
            "Is it possible?",
            "This was already a step in this direction.",
            "In 2002, like I said, this paper was published.",
            "Proposing a method which in principle is very similar to existing methods, because it is."
        ],
        [
            "Based on the hockey core clustering.",
            "Although this is a divisive method, so you start from the top from all the nodes together in the network and then you start to cut links in order to split these groups artificially.",
            "So you got the first link and then another one.",
            "At some point the graph and connected becomes disconnected into pieces and then in three pieces and then in four pieces until all the nodes and you delete all links and all the nodes are isolated.",
            "So you just the reverse operation.",
            "Then what you've seen before?",
            "Sorry.",
            "And just yeah, let me tell you where I'm going through this, OK?",
            "The idea is that.",
            "Which nodes, so which links to like up?",
            "If these are the communities.",
            "There are links which connects nodes, a different community settings, connecting nodes of the same community.",
            "Ideally, if I know if I have good eyes and I see these guys here, if I cut these three I get my communities OK.",
            "So the question is to identify good property.",
            "Quantity property of these links so that you can spot them.",
            "The property that was proposed by given a Newman in this paper was his property circles."
        ],
        [
            "Edge between us.",
            "Or link between us OK?",
            "Is a measure is derived from a well known measure from social network analysis.",
            "It was introduced in 1977 by Freeman, a sociologist.",
            "And tells you basically how many shortest paths between each pair of nodes or the network use this link.",
            "In the past, as a piece of the path.",
            "OK, so in this case you see that this link here is the one which is the highest betweenness, because if you try to go from any of these nodes to any of the other nodes.",
            "You must use this link, otherwise you cannot go there OK.",
            "Whereas any of these links here is not so much used because for instance, any of these notes here.",
            "If you want to go through a shortest path for it's 123 is a shortest path, but also 123 is a shortest path.",
            "In this case, you wouldn't use this one, but we would always use this one.",
            "OK.",
            "So you can compute this.",
            "You can do it in a time which goes like the square of the sides of the network on a sparse graph.",
            "Once you identify, so each node edge at the end gets a number.",
            "You take the largest number.",
            "And you cut that edge.",
            "This is the procedure.",
            "You calculated between us Holdings.",
            "You start from the complete network.",
            "And you cut the edge with the largest between us.",
            "OK, then you."
        ],
        [
            "Erica, you remove it like I said so you re calculated between us on the remaining edges.",
            "You must do this.",
            "You must do this recalculation steps which makes you lose a lot of time in fact.",
            "Because you have to do it for each edge at your cutting.",
            "Because whenever you remove an edge, the structure of your network changes and therefore the importance of the edges is kind of reshuffled.",
            "OK. And it was seen anyway in the same paper that if you don't make this recalculations that there is also much worse.",
            "So you must do this recalculation step and you repeat from 2.",
            "So you remove the one the largest between us you re calculated between us and you can remove it.",
            "Eureka, I mean you remove it and so on until there are no links."
        ],
        [
            "At the end you have a diagram like the one we've seen before, so you have minus one partitions, which can be very large number if N is large.",
            "If the number of nodes and is large, which one is the best?",
            "The same problem that we had before because this is a hierarchical technique.",
            "The idea of given human in this paper here was to introduce the quality function that I showed you before.",
            "Modularity which we can calculate for each partition.",
            "And to take the partition with the largest value Q.",
            "This is the best partition OK. Is you know it's a postulate, so it's not that you can say I like it or not, and this is how they decided to proceed, OK?",
            "But it is a slow algorithm, you know it was 2002, that time you know.",
            "It was still reasonable.",
            "It's not going, which runs in a time which goes like the cube or the number of nodes.",
            "On his past graph.",
            "So when the number of links M is more or less like the number of nodes OK 3 four times and I mean 10 times this peak, but not much bigger.",
            "Or to the ioncube miss it already?",
            "If you have a network of 10,000 nodes it's a problem.",
            "To split it in groups according to this procedure can take ages."
        ],
        [
            "But starting from this one, people got curious.",
            "For instance, right after that I started work on the problem.",
            "Just because you know, I kinda like the idea and so on, and I thought that I could use what I knew from statistical physics to analyze and to find the groups.",
            "And there was a whole.",
            "You know wealth or methods.",
            "Every day there is a new method.",
            "Even now I mean.",
            "To try to optimize on this result.",
            "To get better groups and faster, 'cause that's what you want to do.",
            "Better groups and faster.",
            "Specially if you want a nice network with millions of nodes, you cannot have a complexity and three for a network, million or not, even square wouldn't be enough.",
            "You will need something which goes close to linear or N log NN locks parent.",
            "This is a classification that I put here.",
            "On how to know divides this algorithm groups divisive algorithm like the one I've given you money which identify a criterion for the edges that you want to remove, you cut them.",
            "And you keep proceeding.",
            "There are many others like the algorithm by radicated it.",
            "I was supposed to talk about, but I don't think I'm going to do this.",
            "Then there is more light optimization, which is the one I'm going to talk instead.",
            "Spectral method dynamic methods, clique, percolation, statistical inference.",
            "Each of these classes, like in 1015 hundred algorithm.",
            "OK, so of course you understand that cannot speak about this right now.",
            "But I can tell you something about."
        ],
        [
            "The light optimization is the function that we defined before I told you the meaning of the single terms.",
            "Here we want to make this number as big as possible.",
            "So instead of using it as a quality index.",
            "Together with other algorithms, why don't we try to optimize this number directly?",
            "Is a well defined problem.",
            "You have a partition.",
            "Each partition corresponds to a number.",
            "You want to find the partition which corresponds to the largest number.",
            "So a different problem unfortunately is NP complete problem.",
            "So you cannot do it in optimal way unless you know it won't invest your lifetime.",
            "On this.",
            "So the goal is to find a maximum of Q over all possible partitions.",
            "It's NP complete.",
            "You can only do it in a suboptimal way.",
            "These are possible ways of doing it.",
            "Each of them corresponds to one or more papers which use this technique.",
            "You can do it with greedy algorithm.",
            "I'm going to describe one greedy algorithm.",
            "You can do it with simulated annealing, which is a classic way to optimize cost functions.",
            "You can do it with stream optimization with the paper introduced by written by local airiness, 2005.",
            "Spectre optimization technique introduced by Newman 2006.",
            "All these ways are."
        ],
        [
            "Kind of efficient.",
            "The greedy algorithm was.",
            "The first one was the paper.",
            "In fact, in which Newman said, OK, let's try to optimize modularity and forget about everything else, because if I find the largest value this one, maybe I really found the optimal division of the networking groups.",
            "This is the paper where it was introduced 2004 starting from that day, people stepped in to try, you know, fancy ways of optimizing modularity, but really hundreds of accurate just on this.",
            "So if you're interested, you can take a look at this paper.",
            "This is how it works.",
            "You start from.",
            "The basic configuration in which each node is isolated.",
            "And you put together.",
            "Is kind of similar to archical clustering you put together those nodes.",
            "And at the beginning individual nodes, but afterwards groups of nodes which produce the largest increase in modularity.",
            "If you take that partition.",
            "OK, so you compute all the Delta Q's.",
            "They move corresponding to the largest FQ.",
            "Is the one that you will finally accept you repeat this procedure until everything is together.",
            "They sense it added in tell you.",
            "But I can do it now.",
            "The modularity of the partition in which the network is just one piece is 0.",
            "OK, because in this case this sum is only one term.",
            "Li is just LBL.",
            "The eye is twice.",
            "L2L becausw is the sum of the degrees of all nodes of the network and the sum of the degrees of the all nodes of the network is the double of the number, so twice the number of the links.",
            "So if you make the square here, you get four L ^2 / 4 elegant LL minus L is 0.",
            "So by definition, the modularity of the partitioning.",
            "Which network is a piece is zero.",
            "OK, the maximum modularity is always more than one.",
            "The minimum is negative.",
            "Depends.",
            "In fact, finding the minimum modularity will let you find these things that I was telling faltered before.",
            "So the anti communities.",
            "Groups are not in which there is less as possible connections inside and as many as possible outside, because it's just the other side of the problem and the community in this case is called multiple parties.",
            "OK, so let me get.",
            "You can also enforce this condition when you will make the optimization.",
            "I don't need to do anything here, this is this is nothing you don't need to tell how many groups you have.",
            "You want to have it with value.",
            "Number in size of the groups.",
            "So in this respect is very predictive, but there are of course issues.",
            "Six group no.",
            "Yeah, usually they're not, yeah.",
            "There is no guarantee.",
            "Depends on it topology of the network.",
            "So like I said, you start combining groups or nodes.",
            "You combine the two groups that give you the largest increase in Delta Q.",
            "For that partition and you keep doing this.",
            "The procedure takes a time on square, so it's much faster than a given human algorithm by an order of complexity in North.",
            "With this are going to can already analyze system with 50,000 nodes.",
            "100,000 nodes or those that still gets low, it depends.",
            "In fact, there is a fast version of this run which scales like, which does exactly the same job.",
            "We're using better data structure which case like North Lock Square North.",
            "A version of the algorithm of this algorithm which makes you analyze systems with millions of nodes.",
            "There's some Japanese right 200 millions of nodes.",
            "By doing these things.",
            "So we take a piece of the web and divide it in communities in this way.",
            "Cute paper small.",
            "Yeah, I'm coming to that right?",
            "I mean in a second.",
            "In fact, there is a problem.",
            "For this measure.",
            "I mean you know."
        ],
        [
            "I found this problem.",
            "In this paper here."
        ],
        [
            "Two years ago there is a problem because I mean it's a technical thing to discuss and we don't have time for this.",
            "I just it's just a caveat for you.",
            "For the young guys who want to speak, you know, want to spend some time about this.",
            "The problem is that there is a scale that you don't see because it's very well concealed in the definition of modularity.",
            "And if you take groups scale in the number of links.",
            "So if you take the number of links L and you take the square root of this, if you have group or nodes which have less links inside then this number more or less of course.",
            "Modularity.",
            "We tried to put them together in larger groups because it's more convenient for the optimization.",
            "So even if you have small groups which are just connected by single link.",
            "Which would make them really strongly identifiable.",
            "At least intuitively you say, OK, there is only the smallest possible connection 11 link.",
            "Modulite would put them together if they're small enough.",
            "So because of this, in fact we also worked on these and other people.",
            "Now you know, people are trying to somehow to take with care about these two.",
            "To use alternative methods.",
            "So for instance, this diagram here says that if you have if we apply model itemization, you get the partition you take.",
            "You consider the pieces of this partition.",
            "The communities which are smaller than this, you don't know a priority.",
            "If these pieces are like this, so real communities or like this.",
            "Groups or communities, because for model it is exactly the same, but I do always put systematically small groups together.",
            "Because it gives you the largest possible increase.",
            "If you want to look if you want to go for the maximum, which is what we want to do in this case.",
            "Of course, by definition, then you risk to to find less communities that you're supposed to find.",
            "If you want to know more details, of course you can read this paper.",
            "Talk to me later, no problem.",
            "It's just you know, a warning like.",
            "So I mean so interesting thing, of course is full of properties.",
            "Many."
        ],
        [
            "I don't know what I could tell you so far.",
            "But you know, but we must be careful.",
            "You might have surprised.",
            "You may have surprises at some point.",
            "The nanny galgen.",
            "It's not that I'm going to use this things which are very familiar to exist like most of us.",
            "For instance, Potts model, so spin models using kind of monetization properties of spins on a network, or synchronization.",
            "Put it in, put oscillators on the nodes.",
            "And try to look at the synchronization properties.",
            "See how fast this group and if there are groups with many links.",
            "Of course there is synchronized faster than other parts and so on.",
            "So by drawing a diagram waiting for the global synchronization, you can identify different time scales which correspond to different groups and structures.",
            "You can use random walks.",
            "If you have a random walk, of course what you would expect.",
            "Is that a Walker?",
            "We start to move?",
            "In a community we spend a lot of time inside the community because there are many links inside the very few outside to escape.",
            "So starting from this simple idea, you can calculate probabilities, first passage time in this kind of things.",
            "To see.",
            "Which links are really inside groups in which are outside, but I won't tell you about this is just kind of overview.",
            "Of course, if you want to know more, I would tell you there is a place where you can find more clickbait collation is.",
            "One of the biggest."
        ],
        [
            "Alternative to modularity because it's really.",
            "Modularity independent doesn't care about modularity at all.",
            "It was introduced in this paper that already mentioned before, and it was the 1st paper in which people explicitly took into account the problem of overlapping communities.",
            "As you can see here.",
            "These things here means that these groups F nodes in common, these two groups of three nodes in common.",
            "These two have one node in common.",
            "These two are independent.",
            "These two are independent.",
            "I don't know how much time I have.",
            "You can tell me probably.",
            "Oh I see.",
            "OK.",
            "So basically the idea here is that if you have a lot of links inside, you will also have a lot of motives like triangles.",
            "OK.",
            "But if you try to make a triangle to roll a triangle within this, for instance by.",
            "Turning it's making it roll over one of these sites.",
            "Inside the group you will see that in this kind of structure, for instance, will not go out for one community to get into the other.",
            "It will get trapped inside the group.",
            "So basically the whole procedure is based on making these motives.",
            "So for instance triangles or complete graphs with K nodes like decagons.",
            "So for nodes and six links to make them move inside these groups, because the idea is that if the group I will identify with very few links outside this piece is here will not get out, we get trapped inside.",
            "And you can identify which nodes are spanned by each other thing.",
            "This is the idea if you want to know more.",
            "Again you can ask me.",
            "Only just sent it, but I mean there's just one more algorithms.",
            "Of course, it's important.",
            "You can even download the software to make it work, but for me it's more important to close this thing by."
        ],
        [
            "Dressing.",
            "What I consider a very crucial issue, which is usually under estimated the issue of testing.",
            "I show you many algorithm.",
            "Which one is the best?",
            "Is there a good, mistaken idea algorithm?",
            "How do you see?",
            "How do you verify if what you've done?",
            "If your method is good or not?",
            "If you can use it and when.",
            "What you do usually you just use.",
            "Networks with the circle well defined Community structure networks would say OK, these are the groups.",
            "If a method finds it, it's good.",
            "If it doesn't find it is not so good and then I can compare the performance.",
            "There are two classes of graphs that you can consider in this case.",
            "Of course you can build them with the computer artificial networks and I will talk a little more about this.",
            "Or you can use real networks which are very few in which you know for some reasons, because you have specific information about this specific system that there are well defined groups which.",
            "Which makes sense and try to find those.",
            "This is so far."
        ],
        [
            "Most popular benchmark was introduced in the same paper.",
            "These 2002 nuts by given in Yuma.",
            "Can you see three possible configurations there?",
            "Of course, many C Class with.",
            "With many networks.",
            "It's a network with 128 nodes divided in four groups of 32.",
            "Which identified by the colors here.",
            "In which each each node is basically the same degree 16.",
            "So each node S 16 friends.",
            "OK, supposing that this is a.",
            "Social net and there is a parameter.",
            "Which tells you what is the probability that these friends are inside my group versus the other groups.",
            "Which is called.",
            "In this case K out OK.",
            "So K is a total degree, which is 16 of each node.",
            "K Out is how many friends I have outside.",
            "For instance, for this node here, how many friends are Violet grey and yellow or?",
            "Or blue here.",
            "Since the sum is 16, of course you have one parameter K in is just K -- K out, obviously.",
            "What you do here you tune this number, and by doing this you go from configurations like this in which you see that there is a big density inside the groups.",
            "And the very few links between the groups to a mixed configuration like this to the total mass.",
            "And you ask that you are going to find the four colors tells you which color is each node?",
            "OK, here is easy.",
            "Yes, not so easy.",
            "Yes, probably impossible.",
            "Obviously not only because you don't see it, but really because difficult.",
            "This is one of the plus which is which are used in this case.",
            "Is comparing two algorithms to make an objective test.",
            "Testing this argument on the very same class of objects which are these objects by varying K out create?",
            "So each way out to create 100 networks?",
            "You apply your technique there and you compare the partition you find with your method with the real partition uniform.",
            "There are ways to do this.",
            "Here, for instance, they used the so called fraction of correctly classified nodes, which is a secretary and that Newman introduced at the time when he used this benchmark for the first time.",
            "Now there are more reliable techniques, taking, for instance from information theory, the so called normalized mutual information, which, given two partitions give you numbers, tells you how much information you get on the petition B if you partition A.",
            "So it's one if they are identical.",
            "Is 0 if they're completely different.",
            "OK, that's why you see that there's a scale from 1 to 0 here.",
            "As you can see here this algorithm, which are modularity, optimization and the given human method, perform very well up to some level here, which means they always find the right community structure.",
            "The four groups each node is assigned to his community.",
            "Then of course, when the situation starts to become like this, they start to make mistakes, of course, because it's really difficult.",
            "And then of course they fail miserably, because at some point there is no more community structure, so we do not expect it to find.",
            "So whatever you find is nothing to do with what you.",
            "Put originally.",
            "And what is this problem?",
            "Specific product is supposed to show to you.",
            "Is that this method with the square?",
            "So the present method of this paper is present because of course it was taken by paper is better than the other one because you know it resists a little more and then of course it bends down as compared to the game.",
            "And it's also much faster.",
            "But there are problems with this."
        ],
        [
            "I mean, I like to find promising this stuff.",
            "All these nodes are the notes of this.",
            "This benchmark at the same size as the same degree 16, but it can be any number, so they're all the same, same number of friends and all communities are equal size.",
            "Therefore groups of 32.",
            "This of course.",
            "Not so much the case for real systems.",
            "In real systems the degrees can be very different.",
            "In fact, they usually are very different, this one which speaks.",
            "About scale free distributions because you have many nodes with few links.",
            "A few nodes with a lot of links, but also the sizes are very different.",
            "There are communities which are very small, coexisting with communities which are very big in the very same system.",
            "To avoid this, we introduced."
        ],
        [
            "Few months ago and your benchmark in this paper that you find here.",
            "Online and you can also download the software so there is a link there to the software that you can download to use it.",
            "It's very easy to use.",
            "In which you introduce these two realistic ingredients.",
            "So you create a cluster graphs in which the nodes have escaped three degree distribution with exponent that you put you decide at the beginning is one of the inputs.",
            "And the communities the Community sites are distributed according to a power law.",
            "With another exponent, again, because an input at the beginning of the process.",
            "OK. Then you have a mixing parameter mu, which tells you how many links there inside versus outside versus inside is the analogous of this K out as seen before.",
            "OK.",
            "This is possible realization as compared to the one I've seen before.",
            "It's a little blurred.",
            "But you see, there's more groups coexisting with big groups.",
            "There are not so many links there coexisting with nodes with few links.",
            "This is what real systems look like.",
            "Not like the one before, so if you want to test an algorithm, use this one OK.",
            "This is what you get if you apply."
        ],
        [
            "The light optimization to some of these of these graphs.",
            "Different colors correspond to different average degrees, because here you can fix it.",
            "I mean, say, one of the parameters of the system before it was 16.",
            "Couldn't change anything here.",
            "You can decide average degree fifteen 2025 and four different choices for this points gamma, which tells you the slope or the degree distribution and beta.",
            "We stayed through the slope or the community size distribution.",
            "You fix these things.",
            "You get your graphs, you apply your method.",
            "And you verify again the real partition versus the partition found by your methods.",
            "In this case we use the normalized mutual information.",
            "This number taken from information theory I told you before.",
            "Which cannot exceed one, just to show and you see already that is compared to the previous plot that here the algorithm problems already for very well defined communities.",
            "So it's much more difficult to find communities here, although this is what you're supposed to do because these systems are simulations of real systems.",
            "Much more than the original benchmark, given a Newman.",
            "And then you can see there is some systematic method performs best.",
            "The more links there are, so the higher the average.",
            "Did you see their systematic?",
            "The green curve always slice into.",
            "This is for 1000 nodes for 5000 node."
        ],
        [
            "Everything else being the same, you see that there is a worsening of their performance.",
            "The scale is the same, so you see the cursor moving down.",
            "And 5000 nodes is a very small network.",
            "Still, especially now you're considering really networks, so that makes you think that probably the performance in real system is very bad even when communities are very well identified.",
            "So it's much more difficult to crack this benchmark than the existing benchmark.",
            "One more reasons to use it also because everything is reasonable here.",
            "Realnetworks is lost."
        ],
        [
            "I want to show you.",
            "I already showed you this graph.",
            "This is a network of 34 friends which were members of the Karate Club in a University in Washington.",
            "This was the administrator and this was one of the teacher.",
            "At some point these two guys didn't agree with each other.",
            "They had an issue about money problem.",
            "So this guy Zachary was a sociologist.",
            "Follow these guys like now for three months, six months and observation times in counted how many times these guys had interactions.",
            "In fact, each of these edge as a number.",
            "But for the purposes of this algorithm, usually you consider the unweighted version which actually correspond to wait one OK.",
            "But you can put the edges.",
            "They are well known there, measure their measured by Zachary.",
            "OK, so this default and then they decide.",
            "OK, I don't want to stay with you anymore.",
            "And they split the club in two.",
            "The Friends of the teacher went without each other friends with that of the Ministrator went with administrator.",
            "These are correspond to the squares and circles here.",
            "And your algorithm is a good algorithm to find the squares and circles.",
            "The colors that you see here correspond to the partition with the largest modularity.",
            "So today really maximum modularity that you find for this system.",
            "And if you see moduli defines if you don't give the weights.",
            "So if you just consider the unweighted version.",
            "This is a combination of four groups and not top two, although there is some consistency as you see.",
            "None of the groups contain squares and circles together.",
            "Their other squares or circles, so it's basically a subdivision of the real partition, but it's not the repetition."
        ],
        [
            "So open problems overlapping communities or what?",
            "Most of what I told you applies to the standard version of the problem, which is already very difficult, but you have to consider that in real communities overlap.",
            "So you have to account for this ingredient hierarchies yet to find if there are communities inside their communities.",
            "Which is usually the case directed graph so far, like I told you, I just focus on undirected graphs because you know, but they are going about directed graphs, they don't use application because in this case it wouldn't make sense as we were saying before.",
            "But there are ways of doing this.",
            "Say it again.",
            "Oh yeah, right of course, yeah, but also moderate optimization is a straightforward application.",
            "I'm generalization to the director case into the weighted case, because also in this case I didn't consider weights.",
            "Weights are additional information.",
            "If you have this information, of course it should help you to identify Community cannot be a problem.",
            "Should be help.",
            "So you should take them properly into account and then of course the computational complexity.",
            "People once analyze system with 1 million 10,000,000 nodes, 100 million nodes.",
            "Any outgoing, the idea argument should be linear in complexity, cannot be can go like N square and square means that 100,000 notes, and you already know.",
            "Right, of course.",
            "It really depends.",
            "Yeah, right of course, I just give you some, you know some bounds reasonable by this by orders of magnitude.",
            "Of course, because it depends on the number of links you know.",
            "You can have a system with hundred thousands of very few links, which you can immediately decompose in groups, and you can have a system with 10,000 nodes in many much higher density which will take ages to perform.",
            "Because I just give you some indication.",
            "But then of course the issue of testing.",
            "We divide this new class of benchmark graphs.",
            "Maybe more can be done in this direction if you want to know more about this."
        ],
        [
            "Last year we wrote this review article that you can find on the on the arcade where you see where you can read most of the things that they said.",
            "In fact, all of them and much more.",
            "For the rest, I'm here so you can ask me everything you want.",
            "Thank you very much.",
            "Been in.",
            "See that.",
            "Pricing this in in in your business process with you.",
            "Hello, degrees is not surprising that the other reason.",
            "Perfect diction since before.",
            "In principle.",
            "So from the plots that I showed you, which refer to modulate optimization, I will say you wouldn't expect it to fail when the groups are not mixed.",
            "Because, you know, in this case, that kind of identity, easily identifiable local method and local method which just looks at what happens really there.",
            "Whereas moderate optimization is a global method, tries to find the perfect number for the whole partition.",
            "Would be able to do much better job there at the beginning of the curve.",
            "Then of course everything is supposed to fail anyway.",
            "But The thing is that I mean not in the case of modularity, you really find the maximum only the maximum does not correspond to the real partition for the reason that I said, because modularity tries to combine small groups.",
            "So this is really algorithm ossific problem.",
            "But in general you would expect.",
            "A good algorithm, at least to catch very well the partition.",
            "Also, you see that there is a dependence on the size of the from 1000 to 5000 already because we're moving down considerably.",
            "So the question is that we didn't make tests for 50,000 because it took so long to apply the algorithm.",
            "We can create.",
            "By the way, the complexity of our are going to create the benchmark is linear with the number of links, so you can easily create system with millions of nodes only if your algorithm is slow to crack it into communities.",
            "This low of courses.",
            "Useless.",
            "That's why we were forced to consider this very, very small graphs.",
            "But in this case, that's what happens, so even the maximum when you find it because you have good clue that this is really a maximum is that's not correspond to their community or their community corresponds to value modularity, which is smaller than the actual machine.",
            "So you already found higher values, so it's wrong really by default in this case.",
            "In fact, this class system allows you to see this.",
            "Whereas the previous benchmark did not allowed to see it because the computers were all the same.",
            "And you know there were so actually one more reason to prefer this class of algorithm to the previous one.",
            "That's a good question.",
            "Forecast.",
            "You really have one, how?",
            "Networks net data.",
            "Well, basically adjacency matrix who is connected to whom.",
            "You can also have weights.",
            "Like I said before, but I mean in many cases you can use this weights.",
            "Modularity can be easily standard to the case of weighted graphs.",
            "Network if you have that, have split or that you could follow some bolting pattern and then see how things go.",
            "I mean like the real community structure like the exactly very few.",
            "In fact I showed this one because it's always a nice story to tell, not the fact that two guys fault and then effective formulas aquatic class.",
            "So it was really bitter fight.",
            "And they said.",
            "How can you tell that the community that you have is Israel?",
            "Maybe the division into four subgroups is because you have his inner circle of friends on this outer circle of friends and additives in a way, right?",
            "That's why, that's why I usually, that's why I usually show this slide.",
            "It actually showed the same time here.",
            "Which is really the beginning of everything, which is what they call a new iPod.",
            "This community detection will test you.",
            "You make an act of faith, and you say the topology allow you allows you to reduce the real groups.",
            "But it's a strong assumption in many cases.",
            "Maybe the real division in groups cannot be infer simply by topology, because the other information that you don't know that you cannot see from the topology of the graph, like weights or anything else.",
            "That give you more indications about which nodes are really associated.",
            "So if you assume this, everything else which I said is kind of consequences so you can do it.",
            "You make this active phase and then you just forget about this, but then of course you have to strongly believe in this.",
            "And like you said, is not always the case and we are in real systems, OK?",
            "It's going to."
        ],
        [
            "Direction of taking real graphs like yeah, it's going in this direction.",
            "It's going this direction, but like I said I mean.",
            "I got scared people do part of speech tagging, yeah?",
            "And then you try and find the denounce the world.",
            "You have a pretty fine clustering at 5.",
            "Two detected by night.",
            "Yeah, but then in general and like I said, I mean I didn't want to give the wrong impression.",
            "Didn't give the impression that it is a closed story that we're nearing the end or anything.",
            "We're in the middle of a process with many more open problems, then satisfactory solutions.",
            "In fact, even the problem of graph partitioning, which is 40 years old, is still not completely resolved.",
            "So you know, you want to do it first in a systematic way before moving to these things.",
            "Of course, it's important to include ways, especially in the kind of data that you may have in mind from economic correlation.",
            "So very often my friend.",
            "So Montania asked me, why don't you?",
            "Split this thing because we can do it only with minimum spanning trees, which is what they usually do.",
            "Perhaps not standard minimum spanning trees, special kind of trees, but always you know, kind of standard techniques from before.",
            "And The thing is that you know this is this is really complicated problem because their networks for the correlations between financial data are full, so complete matrices are not sparse graphs right here, so there's no concept of having more links inside and outside.",
            "You can do the same things for weights, but it doesn't work so well because usually weights are not so very different from each other.",
            "Do not mention this linguistic.",
            "And it split.",
            "You can split yeah, so by this you said that in OB, so probably can tell me more.",
            "Yeah, so I mean I didn't know about this set, so probably can tell me more about this.",
            "The answer to your question was we have at the moment.",
            "As far as I know.",
            "But like I say, I'm happy to be wrong.",
            "Three sets.",
            "Try to do is send some script so wondered if you measure performed.",
            "If you would use it.",
            "OK so yeah.",
            "Our biggest is graph.",
            "1,000,000.",
            "5,000,000 not.",
            "Which means.",
            "Yeah right to start with, so that's what I also believe, but also because I don't think there is an idea quality function and that the answer in generally depends on the system.",
            "This is also another direction where the field is moving to.",
            "Right now people are so ambitious and say, OK, I find the perfect algorithm works in any Case No matter what.",
            "But this is just a wrong.",
            "It's a wrong attitude.",
            "Clearly, but you know it's not so clear how it will evolve.",
            "It's lunchtime here.",
            "Thanks to you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what kind of problem is this?",
                    "label": 0
                },
                {
                    "sent": "And I'll show you mean it's very simple.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fine, it's a new defined problem.",
                    "label": 0
                },
                {
                    "sent": "In fact, that's probably why it's so simple to define.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Which is the reason why it's so easy to do stuff about this.",
                    "label": 0
                },
                {
                    "sent": "So let's take a network like this 112 nodes.",
                    "label": 0
                },
                {
                    "sent": "This is very schematic example of how real networks look like.",
                    "label": 0
                },
                {
                    "sent": "I mean, in this case you see three groups of nodes.",
                    "label": 0
                },
                {
                    "sent": "With many more connections between them then between each other these groups are called communities.",
                    "label": 0
                },
                {
                    "sent": "See the network is connected.",
                    "label": 0
                },
                {
                    "sent": "There is a path between each pair of nodes, but they are clearly identifiable in this case at least structures.",
                    "label": 0
                },
                {
                    "sent": "So there are more links inside and outside, so keep this in mind.",
                    "label": 1
                },
                {
                    "sent": "This is the way some how we think about communities on graphs.",
                    "label": 0
                },
                {
                    "sent": "Graphs are sparse, so everything I would say we refer to so called sparse graph, which means with graph to graph that have a number of links which is not much larger than a number of nodes.",
                    "label": 0
                },
                {
                    "sent": "OK, otherwise a lot of these methods cannot be applied at all.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So why is this problem so interesting?",
                    "label": 0
                },
                {
                    "sent": "It is interesting because it finds applications in many different types of graphs.",
                    "label": 0
                },
                {
                    "sent": "Metabolic networks, for instance, in which identifying groups of nodes which are connected to each other makes possible identificational metabolic pathways or protein protein interaction networks in which finding groups or proteins which interact each other mainly to the identification of functional modules.",
                    "label": 0
                },
                {
                    "sent": "Social networks like this one famous karate club of Zachary.",
                    "label": 0
                },
                {
                    "sent": "Which little dent ification of communities of friends, their common interests or economical networks like this one which is a network of.",
                    "label": 0
                },
                {
                    "sent": "And companies economics are companies in Germany.",
                    "label": 0
                },
                {
                    "sent": "And in which in this case, I mean, you can highlight the partnership within them.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is the outline is going to be a guided tour to this problem.",
                    "label": 0
                },
                {
                    "sent": "The ingredients of this problem and the description of the most fundamental algorithm.",
                    "label": 0
                },
                {
                    "sent": "Although there are thousands of arguments, so this would be enough for a full course and they have only one hour please.",
                    "label": 0
                },
                {
                    "sent": "So I would start with some elements of Community detection, trying to define the problem and the things you need to know in order to start working on this.",
                    "label": 1
                },
                {
                    "sent": "And then I will say something about the past of this problem, because this is a very old problem.",
                    "label": 0
                },
                {
                    "sent": "It's almost 40 years old.",
                    "label": 0
                },
                {
                    "sent": "The oldest ancestor this problem was the graph partitioning problem of computer science produced at the end of the 60s even.",
                    "label": 0
                },
                {
                    "sent": "And almost the same time following a parallel path.",
                    "label": 0
                },
                {
                    "sent": "The social Sciences, especially, but then I mean spread everywhere else now is very common in biology and so on.",
                    "label": 0
                },
                {
                    "sent": "Also, the technique of hierarchical clustering at some importance to address this problem still now.",
                    "label": 0
                },
                {
                    "sent": "And then at some point something happened in 2002.",
                    "label": 0
                },
                {
                    "sent": "This paper, I mean the paper with the given human was was published with introduction of an algorithm which tried to introduce some changes in the way of thinking about this problem and I will tell you what changes they are starting from them.",
                    "label": 0
                },
                {
                    "sent": "Then Phyllis instruction to get interested in this problem and many, many new algorithms introduced by phases may not only basis were introduced and we say something about those.",
                    "label": 0
                },
                {
                    "sent": "And finally, we conclude with the issue of testing algorithms save which are going to include or not and to compare are going to each other.",
                    "label": 0
                },
                {
                    "sent": "The three main questions.",
                    "label": 0
                },
                {
                    "sent": "In this case R. What is a community?",
                    "label": 0
                },
                {
                    "sent": "What is a partition of a graph in communities and what is a good partition?",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So these are the three main questions.",
                    "label": 0
                },
                {
                    "sent": "I start from the first one.",
                    "label": 0
                },
                {
                    "sent": "There are many definitions.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Communities there are many criteria to define communities starting already from social network analysis.",
                    "label": 0
                },
                {
                    "sent": "Their local criteria in which you just focus on the group of nodes.",
                    "label": 0
                },
                {
                    "sent": "They say OK, if this group or noses some property which can be anything you like, this this group or knows the community regardless of the rest of the graphs.",
                    "label": 0
                },
                {
                    "sent": "They're global criteria instead, in which a group of nodes is a community with respect to the rest of the net.",
                    "label": 0
                },
                {
                    "sent": "And finally.",
                    "label": 0
                },
                {
                    "sent": "You can say that nodes belong to communities.",
                    "label": 0
                },
                {
                    "sent": "They are similar to each other.",
                    "label": 0
                },
                {
                    "sent": "So in this case the criteria criterion can be local or global because it according to your criteria similarity.",
                    "label": 0
                },
                {
                    "sent": "And that's why I mean, doesn't really enter the first 2 classes, but I won't say anything about this.",
                    "label": 0
                },
                {
                    "sent": "I want any specific definition because what happens in general is the fact that communities are indirectly defined by the particular algorithm that you use.",
                    "label": 1
                },
                {
                    "sent": "So sometimes you don't even define this.",
                    "label": 0
                },
                {
                    "sent": "You have some idea because you have this concept of having more links inside and outside.",
                    "label": 0
                },
                {
                    "sent": "And then you apply your algorithm then OK, whatever I find here, these pieces are communities.",
                    "label": 0
                },
                {
                    "sent": "This is actually part of the problem because you know, it's a conceptual kind of back.",
                    "label": 0
                },
                {
                    "sent": "Of most algorithm.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is a partition is that if you read the definition from my dictionary, for instance, you see that the partition is subdivision of graphing groups of vertices.",
                    "label": 1
                },
                {
                    "sent": "Such that each vertex is assigned to one group.",
                    "label": 1
                },
                {
                    "sent": "OK to one group.",
                    "label": 0
                },
                {
                    "sent": "However, this definition is number of problems when you try to.",
                    "label": 0
                },
                {
                    "sent": "To find meaningful partitions in real graphs.",
                    "label": 0
                },
                {
                    "sent": "Two orders of problems.",
                    "label": 0
                },
                {
                    "sent": "The problem is that in rayographs communities overlap, especially in social networks.",
                    "label": 0
                },
                {
                    "sent": "There are people.",
                    "label": 0
                },
                {
                    "sent": "For instance, in this case, notes of these graphs which do not belong to one community, would belong to several communities, because for instance, I'm here.",
                    "label": 0
                },
                {
                    "sent": "For instance, the community of people attending this conference, but they also work colleagues.",
                    "label": 0
                },
                {
                    "sent": "I also play soccer with some other people, and so, but I'm the same guy.",
                    "label": 0
                },
                {
                    "sent": "The other problem is the problem of hierarchical structure.",
                    "label": 0
                },
                {
                    "sent": "Organizations of these communities communities inside our community.",
                    "label": 0
                },
                {
                    "sent": "So let me highlight this point.",
                    "label": 0
                },
                {
                    "sent": "So little bit better.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I already told you what overlapping communities are this very schematic diagram.",
                    "label": 1
                },
                {
                    "sent": "This network doesn't correspond to anything.",
                    "label": 0
                },
                {
                    "sent": "And you see that this Violet notes here are shared between at least two communities.",
                    "label": 0
                },
                {
                    "sent": "OK, in this case they really overlap, so we understand that if the problem itself without overlap is very difficult already, this complication of overlap makes it enormously more complicated, so we're really happy about this.",
                    "label": 0
                },
                {
                    "sent": "Maybe work for many years to come.",
                    "label": 0
                },
                {
                    "sent": "This is the first paper published in Nature in 2005.",
                    "label": 0
                },
                {
                    "sent": "In which this this problem was addressed for the first time.",
                    "label": 0
                },
                {
                    "sent": "Hope they have enough time.",
                    "label": 0
                },
                {
                    "sent": "If I switch is off.",
                    "label": 0
                },
                {
                    "sent": "So balance and even developed a software is called scifinder that you can download and apply.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Silly.",
                    "label": 0
                },
                {
                    "sent": "The problem of hierarchies is like I said, that there may be groups containing other groups.",
                    "label": 0
                },
                {
                    "sent": "Points like in this case is a network of 512 nodes.",
                    "label": 0
                },
                {
                    "sent": "Which is a clear identification for big groups or 128.",
                    "label": 0
                },
                {
                    "sent": "This ones that you see in each of this group is again if you look closely if further subdivision in four groups of 32.",
                    "label": 0
                },
                {
                    "sent": "So in this case you say what is the best partition?",
                    "label": 0
                },
                {
                    "sent": "There are two partition.",
                    "label": 0
                },
                {
                    "sent": "There are two levels organization.",
                    "label": 0
                },
                {
                    "sent": "There is an organization for macro groups.",
                    "label": 0
                },
                {
                    "sent": "There is an organization in 16 micro groups.",
                    "label": 0
                },
                {
                    "sent": "This is a recent paper just appeared in nature because they more in human, in which this problem was kind of addressed.",
                    "label": 0
                },
                {
                    "sent": "By using statistical inference, it's a period of time.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Speak about this, but important thing is to give the key concepts here.",
                    "label": 0
                },
                {
                    "sent": "Third and last question, which is the most important, what is a good partition?",
                    "label": 1
                },
                {
                    "sent": "There are infinite partition.",
                    "label": 0
                },
                {
                    "sent": "In fact even for very small graph the number of partitions grows faster than exponentially with the number of nodes, because because you can divide it into three groups.",
                    "label": 0
                },
                {
                    "sent": "So if you try to divide a network in pieces.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You may wonder what the difference is between partitions.",
                    "label": 0
                },
                {
                    "sent": "Which one is better?",
                    "label": 0
                },
                {
                    "sent": "Which one is the best?",
                    "label": 0
                },
                {
                    "sent": "If there is 1?",
                    "label": 0
                },
                {
                    "sent": "For instance in this case.",
                    "label": 0
                },
                {
                    "sent": "I would like to know for the very same network that you see here whether the great point here the Gray node belong to the Community, to the left or to the right.",
                    "label": 0
                },
                {
                    "sent": "Often an OK, but I'm making comparison about this in general I don't know.",
                    "label": 0
                },
                {
                    "sent": "Because in order to address this, I must define a criterion for quality.",
                    "label": 0
                },
                {
                    "sent": "I must define the quality or partition must have a number of function.",
                    "label": 0
                },
                {
                    "sent": "We just called quality function and they indicated with Q.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which gives you a number for each partition, and once you have numbers you can just compare numbers.",
                    "label": 0
                },
                {
                    "sent": "So for instance in the case before partitions P1 and P2, which one is the best?",
                    "label": 1
                },
                {
                    "sent": "If I have a function that gives me a number for each partition for any partition of the graph so well defined function then I can just compare Q or P1 or with Q, P2 the one which is larger correspond to the best partition.",
                    "label": 0
                },
                {
                    "sent": "This is by far the most popular quality function.",
                    "label": 0
                },
                {
                    "sent": "The modularity by.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And given that this in 2004, it's a very important function because it generated itself the most popular method of partitioning graph so far.",
                    "label": 0
                },
                {
                    "sent": "Which is a number of problems, and so I will discuss about this.",
                    "label": 0
                },
                {
                    "sent": "So this definition let me define these objects very simple as you see.",
                    "label": 0
                },
                {
                    "sent": "So this is the function.",
                    "label": 0
                },
                {
                    "sent": "QL is the total number of links of the graph.",
                    "label": 0
                },
                {
                    "sent": "So you count 'em in.",
                    "label": 0
                },
                {
                    "sent": "Yeah, just stay out there.",
                    "label": 0
                },
                {
                    "sent": "This admission.",
                    "label": 0
                },
                {
                    "sent": "So it's a summation of terms.",
                    "label": 0
                },
                {
                    "sent": "Each of these pair corresponds to one group, so we have a partition in North groups.",
                    "label": 0
                },
                {
                    "sent": "OK, any partition.",
                    "label": 0
                },
                {
                    "sent": "For each group you count, you calculate this difference.",
                    "label": 0
                },
                {
                    "sent": "Which is the difference between the actual number of links inside the group Li?",
                    "label": 0
                },
                {
                    "sent": "Which means the number of links connecting pairs of nodes or the same group.",
                    "label": 0
                },
                {
                    "sent": "Minus this ratio here where L is again the total number of links and the I is the total degree of the nodes of the Community.",
                    "label": 0
                },
                {
                    "sent": "I totally agree means that you take really the degree which nodes are number of connections, the number of neighbors, no matter if they are inside or outside the community in some over the group you get this big guy squared divided by 4 L. The concept behind this, I don't have time to address it, which is again if it in a sense, because a very simple demonstration.",
                    "label": 0
                },
                {
                    "sent": "Is that one has to compare the total number of links which have inside the group.",
                    "label": 0
                },
                {
                    "sent": "With the expected number of links that this graph would have if it were a random graph with the same degrees for the nodes.",
                    "label": 0
                },
                {
                    "sent": "OK, the idea is that the random graph does not have community structure.",
                    "label": 0
                },
                {
                    "sent": "You don't expect to find communities in a random graph is not completely true, But again, this is very tricky.",
                    "label": 0
                },
                {
                    "sent": "Issue starts to be technical, is not the case address here.",
                    "label": 0
                },
                {
                    "sent": "So you compare the graph.",
                    "label": 0
                },
                {
                    "sent": "The real graph with a copy of it, which is random, which keeps the same degree for the nodes.",
                    "label": 0
                },
                {
                    "sent": "So it really has a lot in common with the other one, but in which you attach these links arbitrarily.",
                    "label": 0
                },
                {
                    "sent": "In this class, so graph.",
                    "label": 0
                },
                {
                    "sent": "This is the expected number of links you would find in module I.",
                    "label": 1
                },
                {
                    "sent": "So if L is bigger than this one, then this group knows it's a community.",
                    "label": 0
                },
                {
                    "sent": "The larger this difference, the more me, the stronger this community.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is somehow some quick answer to the three main questions, which would take really much longer because some of them are not even properly defined.",
                    "label": 0
                },
                {
                    "sent": "Now, let me tell you something about the history of this problem, 1970s, the problem graph partitioning appears in computer science.",
                    "label": 0
                },
                {
                    "sent": "It was really very technical answer to very technical problem, but then it became it generated the so called clustering problem.",
                    "label": 0
                },
                {
                    "sent": "And it's still use.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's still very important problem so far.",
                    "label": 0
                },
                {
                    "sent": "At the same time, more or less are in fact the same in this again.",
                    "label": 0
                },
                {
                    "sent": "You start to see the first dendrograms.",
                    "label": 0
                },
                {
                    "sent": "Which is the hierarchical trees.",
                    "label": 0
                },
                {
                    "sent": "I would show one before I mean soon in social Sciences.",
                    "label": 1
                },
                {
                    "sent": "Which is this technique of organizing hierarchically communities.",
                    "label": 0
                },
                {
                    "sent": "I wish I would describe these things, then suddenly 2002 this paper was published.",
                    "label": 0
                },
                {
                    "sent": "Which is like by now, but for under citations.",
                    "label": 0
                },
                {
                    "sent": "It's very cited paper which kind of generated and I will tell you why this paper is important.",
                    "label": 0
                },
                {
                    "sent": "We kinda novelty it introduced to the field.",
                    "label": 0
                },
                {
                    "sent": "And starting from this date, it's just zero year.",
                    "label": 0
                },
                {
                    "sent": "There are methods of new generation device, mostly by phases, but not only.",
                    "label": 1
                },
                {
                    "sent": "Which are more refined, which are more demanding?",
                    "label": 0
                },
                {
                    "sent": "Which want to tell you as much as possible with the least possible number of inputs.",
                    "label": 0
                },
                {
                    "sent": "This is basically the novelty.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me start with graph partitioning.",
                    "label": 0
                },
                {
                    "sent": "This is the definition of repetition and I want to divide the graph in end parts.",
                    "label": 0
                },
                {
                    "sent": "Such that the number of links between them, which is called cat size, is minimal.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "The number of links connecting nodes or one group, not with the other group.",
                    "label": 0
                },
                {
                    "sent": "If you some or all of them.",
                    "label": 0
                },
                {
                    "sent": "This is called cut size.",
                    "label": 0
                },
                {
                    "sent": "You must minimize this number.",
                    "label": 0
                },
                {
                    "sent": "But if I define it just like this without adding anything else, this is a bit different.",
                    "label": 0
                },
                {
                    "sent": "It's not a well defined problem.",
                    "label": 0
                },
                {
                    "sent": "Becausw the number N in this case is left free.",
                    "label": 0
                },
                {
                    "sent": "OK, so if I say if I divide the network in one group so if I don't divide it at all, the cut size is 0 and the smallest one that I can get for a connected graph.",
                    "label": 0
                },
                {
                    "sent": "So this is not a well defined problem.",
                    "label": 0
                },
                {
                    "sent": "I need to specify at least how many groups I have.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But I will say to say how big they are, because in this case you can make one of the paths arbitrary small in the limit 0.",
                    "label": 0
                },
                {
                    "sent": "Even if you say how many parts there must be such that the graph size, the Cup size is minimized.",
                    "label": 0
                },
                {
                    "sent": "So when you define this problem is to say in how many pieces you want to break the graph and how big these pieces must be.",
                    "label": 0
                },
                {
                    "sent": "How many nodes must be in this in this piece?",
                    "label": 0
                },
                {
                    "sent": "That's why the simplest formulation of this prob.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is already by itself.",
                    "label": 0
                },
                {
                    "sent": "NP complete so it cannot be solved in optimal way is a so-called problem of partition.",
                    "label": 0
                },
                {
                    "sent": "You divide the graph in two parts, which are exactly the same size.",
                    "label": 1
                },
                {
                    "sent": "OK. And of course the minimum cut size.",
                    "label": 0
                },
                {
                    "sent": "For instance in this case in this example, this is a solution of the partition by partitioning problem for this network.",
                    "label": 0
                },
                {
                    "sent": "Here is a network of 40 nodes, 7 to the left, 7 to the right, and you have a cut size of four 1234.",
                    "label": 0
                },
                {
                    "sent": "Because there are only four links connecting into parts.",
                    "label": 0
                },
                {
                    "sent": "There is no plus.",
                    "label": 0
                },
                {
                    "sent": "It's not possible in this case to find.",
                    "label": 1
                },
                {
                    "sent": "A partition with a smaller cut size in this in fact is the only solution of this problem.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It was designed by hand, right?",
                    "label": 0
                },
                {
                    "sent": "There are several ways of addressing it.",
                    "label": 0
                },
                {
                    "sent": "One of the most popular and one of the earliest ones were introduced already in the 70s is the technique of spectral partitioning, which uses the property.",
                    "label": 0
                },
                {
                    "sent": "The very special properties of the Laplacian matrix.",
                    "label": 1
                },
                {
                    "sent": "There are some metrics.",
                    "label": 0
                },
                {
                    "sent": "Is the object here, which looks weird in the little bit is.",
                    "label": 0
                },
                {
                    "sent": "But this is very simple to define.",
                    "label": 0
                },
                {
                    "sent": "It is a matrix.",
                    "label": 0
                },
                {
                    "sent": "In which you have on the diagonal.",
                    "label": 0
                },
                {
                    "sent": "On each diagonal element, the degree of node I.",
                    "label": 0
                },
                {
                    "sent": "So on the Princess and the first element or the diagonal have the degree of the first node in the second degree of the 2nd, and so on, and all the other elements are the elements of the adjacency matrix.",
                    "label": 0
                },
                {
                    "sent": "With the - they just symmetric system.",
                    "label": 0
                },
                {
                    "sent": "At this it tells you.",
                    "label": 0
                },
                {
                    "sent": "If you have I&J, which are two nodes, of course if they are connected or not, so AIJ is 1 if I&J have a link connecting them, otherwise it's 0.",
                    "label": 0
                },
                {
                    "sent": "We just met with the - and that's it.",
                    "label": 0
                },
                {
                    "sent": "And you add this diagonal mean on the diagonal.",
                    "label": 0
                },
                {
                    "sent": "The degrees.",
                    "label": 0
                },
                {
                    "sent": "This is della pressure mattress is one of the definitions, also normalized Laplacian.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But then.",
                    "label": 0
                },
                {
                    "sent": "The funny thing is that this is a very interesting matches.",
                    "label": 0
                },
                {
                    "sent": "A lot of properties were studied for many years.",
                    "label": 0
                },
                {
                    "sent": "It is applied in many many different environments like in synchronization so.",
                    "label": 0
                },
                {
                    "sent": "All eigenvalues of this matrix are not negative.",
                    "label": 0
                },
                {
                    "sent": "OK. Interestingly enough.",
                    "label": 0
                },
                {
                    "sent": "There is at least 1 zero eigenvalue.",
                    "label": 0
                },
                {
                    "sent": "There is only one ON value.",
                    "label": 0
                },
                {
                    "sent": "If the graph is connected.",
                    "label": 0
                },
                {
                    "sent": "So if there is a path between any pair of nodes, But if it's divided in G groups, there are exactly 0 eigenvalues and all the others are positive.",
                    "label": 0
                },
                {
                    "sent": "That's why if G is equal to 1, which means if the graph is connected, there is actually 10 eigenvalue.",
                    "label": 0
                },
                {
                    "sent": "In this case, so if the graph is really divided in G groups, you can rearrange the nodes, just renaming them OK, just making a permutation.",
                    "label": 1
                },
                {
                    "sent": "And the Laplacian matrix will just look like this in block diagonal form.",
                    "label": 0
                },
                {
                    "sent": "The matrix is OK or like OK, assuming the sense that yeah, I'm considering here and directed undirected graph.",
                    "label": 0
                },
                {
                    "sent": "This is a very good point.",
                    "label": 0
                },
                {
                    "sent": "So yeah, so the matrix is symmetric because the graph is undirected.",
                    "label": 0
                },
                {
                    "sent": "Which means there is.",
                    "label": 0
                },
                {
                    "sent": "You can go from A to B if they are connected, but it also can go from B to a.",
                    "label": 0
                },
                {
                    "sent": "That's why you have the two elements.",
                    "label": 0
                },
                {
                    "sent": "Yeah, otherwise there are problems, of course from the spectral composition.",
                    "label": 0
                },
                {
                    "sent": "That's a good point, right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is symmetric matrix, which you can write.",
                    "label": 0
                },
                {
                    "sent": "In this case we can rearrange the nodes and you have this squares here.",
                    "label": 0
                },
                {
                    "sent": "Each of them corresponds to one of the Jeep parts of the graph.",
                    "label": 0
                },
                {
                    "sent": "Which means basically they are connected between each other, but there is no connection between one square and the other one.",
                    "label": 0
                },
                {
                    "sent": "That's why here you have zero.",
                    "label": 0
                },
                {
                    "sent": "And here you have non zero elements.",
                    "label": 0
                },
                {
                    "sent": "This is the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Party which is using graph partition inspector partition in this case.",
                    "label": 0
                },
                {
                    "sent": "Suppose that the network is connected.",
                    "label": 1
                },
                {
                    "sent": "But that is divided into communities which are weakly connected to each other.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's connected, which means there is only 1 zero in value.",
                    "label": 0
                },
                {
                    "sent": "An you cannot find this block diagonal decomposition, but if you try to you can certainly try to arrange so to order to rename the nodes such that you get the kind of block diagonal form with very few nonzero elements off the diagonal of the squares.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "It's possible to show that in this case.",
                    "label": 0
                },
                {
                    "sent": "The minimal cut size.",
                    "label": 0
                },
                {
                    "sent": "This object that I want to minimize so they cut size can be expressed in terms of the second smallest eigenvalue of Laplacian matrix, which is called Fiedler Vector.",
                    "label": 1
                },
                {
                    "sent": "OK so I have a connected graph so there is only 1 zero again value.",
                    "label": 1
                },
                {
                    "sent": "The second eigenvalue is positive.",
                    "label": 0
                },
                {
                    "sent": "The second smallest must be positive.",
                    "label": 1
                },
                {
                    "sent": "Its eigenvector is called Fiedler Vector.",
                    "label": 0
                },
                {
                    "sent": "And it has positive and negative components.",
                    "label": 0
                },
                {
                    "sent": "It must be like this because the sum of the elements of each eigenvector or present matrix is 0.",
                    "label": 0
                },
                {
                    "sent": "Since we show it, I don't know it OK?",
                    "label": 1
                },
                {
                    "sent": "Is basically due to the fact that there is one trivial eigenvector corresponding to the eigenvalue zero and they're all orthogonal.",
                    "label": 0
                },
                {
                    "sent": "So if you make the product and this summer anyway, so believe me so this vector, once you calculate it, which you can do with well defined methods for matices, you derive the second vector, say this some of these elements are positive, some of them are negative.",
                    "label": 0
                },
                {
                    "sent": "OK, because their son must be 0.",
                    "label": 0
                },
                {
                    "sent": "So at the end, once you calculate this this object here.",
                    "label": 0
                },
                {
                    "sent": "Everything you need to do if you want to break a graph in two parts is to order the components of this vector.",
                    "label": 0
                },
                {
                    "sent": "From the smallest from the largest positive to the smallest negative.",
                    "label": 0
                },
                {
                    "sent": "And if we want to divide it into N1 and N2 which is equal to N -- 1.",
                    "label": 0
                },
                {
                    "sent": "Nodes.",
                    "label": 0
                },
                {
                    "sent": "Then you just take the first N1 elements.",
                    "label": 0
                },
                {
                    "sent": "OK, you can do it in two ways.",
                    "label": 0
                },
                {
                    "sent": "Of course, because you can start from the top from the bottom.",
                    "label": 0
                },
                {
                    "sent": "The two ways correspond to two different cut sizes.",
                    "label": 0
                },
                {
                    "sent": "You take the smaller one because of course you want to minimize the cut size.",
                    "label": 0
                },
                {
                    "sent": "OK, so if I want to divide the graph into in a very simple way, this is not an optimal solution because the problem is NP complete.",
                    "label": 0
                },
                {
                    "sent": "I told you OK, it's suboptimal, so you can improve over this solution with other heuristic methods.",
                    "label": 0
                },
                {
                    "sent": "You calculate the filler vector.",
                    "label": 0
                },
                {
                    "sent": "You order is components from the largest positive, the smallest negative.",
                    "label": 0
                },
                {
                    "sent": "If you want to cut it into equal parts, you just divide this vector in tool.",
                    "label": 0
                },
                {
                    "sent": "Just put the separation in the middle and they say OK. All nodes whose components are in the first half are in one group and the other nodes are in the other group.",
                    "label": 0
                },
                {
                    "sent": "OK, this gives already very small cut size.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But it's not an optimal solution.",
                    "label": 0
                },
                {
                    "sent": "One way to improve it is this trick, which is called and it's an algorithm, its own algorithm by canonly conditional in which was introduced in 1971 when I was born.",
                    "label": 0
                },
                {
                    "sent": "So it seems splitting into groups, then the network into groups.",
                    "label": 0
                },
                {
                    "sent": "So you start from a partition into groups at each step.",
                    "label": 1
                },
                {
                    "sent": "What you do is take a note from one group and not from the other group and just swap them.",
                    "label": 0
                },
                {
                    "sent": "You just switched their sides OK.",
                    "label": 0
                },
                {
                    "sent": "But you do it in order to decrease the cut size.",
                    "label": 1
                },
                {
                    "sent": "So if after you make this change after you put one note the other the other group and vice versa, you have a lower cut size.",
                    "label": 0
                },
                {
                    "sent": "Then you accept the move.",
                    "label": 0
                },
                {
                    "sent": "That's a basic version, which is of course greedy.",
                    "label": 0
                },
                {
                    "sent": "There is no stochastic element, there is no noise here.",
                    "label": 1
                },
                {
                    "sent": "OK, and it's not very efficient.",
                    "label": 0
                },
                {
                    "sent": "One way to make it efficiency sometimes to allow moves which even if they increase the cut size.",
                    "label": 0
                },
                {
                    "sent": "They can let you escape local minima that you can have.",
                    "label": 0
                },
                {
                    "sent": "OK, in this case, at the end you get a much better result.",
                    "label": 0
                },
                {
                    "sent": "So you always try to diminish the cut size, but from time to time you accept moves that increase discuss side just by swapping pairs of nodes.",
                    "label": 0
                },
                {
                    "sent": "At some point you see that you cannot improve anymore.",
                    "label": 0
                },
                {
                    "sent": "That's the final result.",
                    "label": 0
                },
                {
                    "sent": "This is a technique which is used very often.",
                    "label": 0
                },
                {
                    "sent": "If you have a good voice about what a partition the partition of the graph could be, you start from that one please.",
                    "label": 0
                },
                {
                    "sent": "Well, when after you can say that you fixed like, I don't say I don't handle moves and none of these moves diminishes the cut size OK?",
                    "label": 0
                },
                {
                    "sent": "It's you Ristic necessarily.",
                    "label": 0
                },
                {
                    "sent": "Well, you can never be sure about this.",
                    "label": 0
                },
                {
                    "sent": "At the end you end up in a local minima anyway.",
                    "label": 0
                },
                {
                    "sent": "The only thing that is.",
                    "label": 0
                },
                {
                    "sent": "Sorry, yeah yeah, so you will know when it's not an optimal algorithm of course, but it gives you a good improvement over solutions.",
                    "label": 0
                },
                {
                    "sent": "That other argument gives you the idea way.",
                    "label": 0
                },
                {
                    "sent": "For instance you start from spectral partitioning.",
                    "label": 0
                },
                {
                    "sent": "You get the partition I said before from the Fiedler vector, which is well defined.",
                    "label": 0
                },
                {
                    "sent": "And starting from that one you keep swapping person nodes to reduce the cut size even further, but there is no guarantee that you're coming very close to minimum, of course.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, right.",
                    "label": 0
                },
                {
                    "sent": "Everybody if I temperature but also the cycle to jumpstart welcome anymore or well, I mean this kind of thing corresponds introducing a temperature right?",
                    "label": 0
                },
                {
                    "sent": "Because it makes you.",
                    "label": 0
                },
                {
                    "sent": "I mean, it makes you make move that you wouldn't do because they would increase the cut size.",
                    "label": 0
                },
                {
                    "sent": "They would not decrease, it's similar.",
                    "label": 0
                },
                {
                    "sent": "And of course, in this case we come much closer to the real solution, but since it's an NP complete problem, this is very difficult to reach.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Please.",
                    "label": 0
                },
                {
                    "sent": "So it works.",
                    "label": 0
                },
                {
                    "sent": "Is it can be beautiful.",
                    "label": 0
                },
                {
                    "sent": "Is there is there?",
                    "label": 0
                },
                {
                    "sent": "I don't think we can really prove how good it is.",
                    "label": 0
                },
                {
                    "sent": "I mean it really depends case by case.",
                    "label": 0
                },
                {
                    "sent": "It depends on the state on the initial condition.",
                    "label": 0
                },
                {
                    "sent": "Leaving the feelings of George.",
                    "label": 0
                },
                {
                    "sent": "Very young, yeah.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's better.",
                    "label": 0
                },
                {
                    "sent": "Cody driving distance.",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course.",
                    "label": 0
                },
                {
                    "sent": "I mean, the more operations you do they usually the battery is a result, but there's always a compromise between if your network is not so small, then I mean the number of moves is really infinite.",
                    "label": 0
                },
                {
                    "sent": "So you want to get an answer in a reasonable time.",
                    "label": 0
                },
                {
                    "sent": "So we have to find a compromise.",
                    "label": 0
                },
                {
                    "sent": "Is a good compromise.",
                    "label": 0
                },
                {
                    "sent": "You start with a good guess about a possible bipartition which you can get, for instance from spectrum by partitioning and then you improve over it with this algorithm.",
                    "label": 0
                },
                {
                    "sent": "OK, but it's not the only way there other ways only I don't have time to speak about this right now, so let me move over to the hierarchical clustering which is very complete.",
                    "label": 0
                },
                {
                    "sent": "I also prefer this way like to get the questions on the way.",
                    "label": 0
                },
                {
                    "sent": "Not too rough.",
                    "label": 0
                },
                {
                    "sent": "45, right?",
                    "label": 0
                },
                {
                    "sent": "That's a very good question.",
                    "label": 0
                },
                {
                    "sent": "I mean, right now, I guess focus on by partitioning, because of course is by far the simplest version.",
                    "label": 0
                },
                {
                    "sent": "There is an additional problem there because if you do this thing here, what you do is that you consider each of the group that you find from the previous iteration as an individual community.",
                    "label": 0
                },
                {
                    "sent": "Then you keep dividing it so it's kind of hierarchical process and that again can take you very far away from area minimum.",
                    "label": 0
                },
                {
                    "sent": "Because already the guests can be local minimum.",
                    "label": 0
                },
                {
                    "sent": "The first yes and then on top of this you assume that this is the real partition and then you keep dividing it.",
                    "label": 0
                },
                {
                    "sent": "And this is a bad thing, of course.",
                    "label": 0
                },
                {
                    "sent": "So very good question.",
                    "label": 0
                },
                {
                    "sent": "So there are clear clustering instead is very common in social network analysis and in biology and sociology.",
                    "label": 1
                },
                {
                    "sent": "What is it?",
                    "label": 0
                },
                {
                    "sent": "The idea is that, of course, if I, I mean nodes must be similar to be put in the same community must be associated.",
                    "label": 0
                },
                {
                    "sent": "They must like each other more than.",
                    "label": 0
                },
                {
                    "sent": "They like the other nodes OK. More less like people.",
                    "label": 0
                },
                {
                    "sent": "So introduce a criterion measure which tells you how similar any two nodes are is a matrix which is called similarity matrix.",
                    "label": 0
                },
                {
                    "sent": "You can define it in infinite ways.",
                    "label": 0
                },
                {
                    "sent": "Of course this arbitrary.",
                    "label": 1
                },
                {
                    "sent": "I call it X. I start from the individual nodes so.",
                    "label": 0
                },
                {
                    "sent": "Then the starting point.",
                    "label": 0
                },
                {
                    "sent": "This is an agglomerative process.",
                    "label": 0
                },
                {
                    "sent": "Starting point point is that I have a network with nodes, each of them is a community.",
                    "label": 0
                },
                {
                    "sent": "The first move I do, I put together the two nodes which are most similar to each other.",
                    "label": 0
                },
                {
                    "sent": "So I look for the maximum maximum element of this matrix.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Suppose there are three and seven of the greater similarity, and then I joined them with one link.",
                    "label": 0
                },
                {
                    "sent": "Then now from now on there will be a community of two.",
                    "label": 0
                },
                {
                    "sent": "And then I do the same thing iteratively.",
                    "label": 0
                },
                {
                    "sent": "Now I have N -- 1 communities, just a second, and then I keep joining them until I put everything together.",
                    "label": 0
                },
                {
                    "sent": "Basically the end I put all the networks, so all those together please OK. Properties like topological properties, so if it's a weight.",
                    "label": 0
                },
                {
                    "sent": "For instance, they can be structurally equivalent, yeah?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Common neighbors, why would they be sorry if there?",
                    "label": 0
                },
                {
                    "sent": "First of all, I didn't define any similarity criterion here, and that one will be a bad one just for the reason that you're saying.",
                    "label": 0
                },
                {
                    "sent": "But for instance, a way to define this could be like correlation.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for instance.",
                    "label": 0
                },
                {
                    "sent": "I mean you can calculate the person coefficient between rows or the adjacency matrix.",
                    "label": 0
                },
                {
                    "sent": "This is a way to create the correlation matrix from pure topology, because in this case you assume that you don't have an additional information like weights, although in principle we can introduce it.",
                    "label": 0
                },
                {
                    "sent": "OK, there is structural equivalence.",
                    "label": 0
                },
                {
                    "sent": "You can say two nodes are.",
                    "label": 0
                },
                {
                    "sent": "Something that would make them similar even though they are not in the same right, but in this case, but in this case I mean.",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "You all you would get like something like bipartition, multi partitioning.",
                    "label": 0
                },
                {
                    "sent": "Sorry multipath cities which means groups which have a lot of connection between them and very few connections between nodes which are inside a single which is just the opposite.",
                    "label": 0
                },
                {
                    "sent": "Or the anti communities.",
                    "label": 0
                },
                {
                    "sent": "There are many kinds of structures that you can you can define but their criterion if you wanted invite communities that there must be a lot of links inside and very filling Southside.",
                    "label": 0
                },
                {
                    "sent": "If you do the opposite you will get an interesting structure but it's not community anymore.",
                    "label": 0
                },
                {
                    "sent": "It's not the clustering.",
                    "label": 0
                },
                {
                    "sent": "So how does he?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At work, what you get at the end is this thing here, which is called a dendrogram.",
                    "label": 0
                },
                {
                    "sent": "This is the first move.",
                    "label": 0
                },
                {
                    "sent": "I start from the bottom.",
                    "label": 0
                },
                {
                    "sent": "Everybody is on his own.",
                    "label": 0
                },
                {
                    "sent": "At the beginning everybody is isolated.",
                    "label": 0
                },
                {
                    "sent": "Then I decide when I check the similarity metrics.",
                    "label": 0
                },
                {
                    "sent": "This is the biggest similarity and say OK these two are together.",
                    "label": 0
                },
                {
                    "sent": "And then I tried to say OK, these two now are together.",
                    "label": 0
                },
                {
                    "sent": "You see I just progress to the top.",
                    "label": 0
                },
                {
                    "sent": "These two are together.",
                    "label": 0
                },
                {
                    "sent": "And then this one is similar to this group.",
                    "label": 0
                },
                {
                    "sent": "There are ways to define how groups are similar.",
                    "label": 0
                },
                {
                    "sent": "Groups are starting from the similarity matrixes.",
                    "label": 0
                },
                {
                    "sent": "But there is not one single way there is, for instance, the so-called single linkage simple linkage scheme.",
                    "label": 0
                },
                {
                    "sent": "There is average linkage scheme.",
                    "label": 0
                },
                {
                    "sent": "There's a complete language scheme, basically everything.",
                    "label": 0
                },
                {
                    "sent": "OK there, different ways of defining our similar groups are starting from the similarity matrix.",
                    "label": 0
                },
                {
                    "sent": "For instance, I can say the two groups are similar, so the similarity of two groups is the.",
                    "label": 0
                },
                {
                    "sent": "Largest similarity between each pair of nodes.",
                    "label": 0
                },
                {
                    "sent": "OK, of the groups.",
                    "label": 0
                },
                {
                    "sent": "This is the so-called complete linkage.",
                    "label": 0
                },
                {
                    "sent": "It's a way to define a distance between groups.",
                    "label": 0
                },
                {
                    "sent": "I need to define this because otherwise I don't know how to compare similarities between communities after the first step at the beginning each, everybody is independent.",
                    "label": 0
                },
                {
                    "sent": "Afterwards they form already groups and I have to compare groups and decide whether they are similar enough to be joined or not OK, and this can be done in different ways according to different schemes.",
                    "label": 0
                },
                {
                    "sent": "And I can, of course, if you're interested, I can tell you more about.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is offline.",
                    "label": 0
                },
                {
                    "sent": "Now let me tell you why we're not happy about this method.",
                    "label": 0
                },
                {
                    "sent": "At least somebody was not happy about this method years ago.",
                    "label": 0
                },
                {
                    "sent": "In a sense, I thought you already in the in the case of the graph partitioning, one is to specify the number and the size of the clusters, and if you give a network I never seen in my life, I might have no clue about how many pieces there are and I will pick the must be.",
                    "label": 0
                },
                {
                    "sent": "Usually this is the case.",
                    "label": 0
                },
                {
                    "sent": "In the case of accurate clustering, if you cut your tree, your hackel tree at any level, you get a good partition.",
                    "label": 0
                },
                {
                    "sent": "But you get N -- 1 partitions.",
                    "label": 0
                },
                {
                    "sent": "Which one is the best?",
                    "label": 1
                },
                {
                    "sent": "Can I take them all if the network is 1 million nodes?",
                    "label": 0
                },
                {
                    "sent": "I cannot take 1 million partitions obviously.",
                    "label": 0
                },
                {
                    "sent": "So I must find an additional criterion to say which partition is the best.",
                    "label": 0
                },
                {
                    "sent": "This is usually defined arbitrary, necessary because it must be independent on the procedure that you use to get there.",
                    "label": 0
                },
                {
                    "sent": "Quick lasting so independent of the similarity.",
                    "label": 0
                },
                {
                    "sent": "Ideally so in the land of dreams you would like to have a method that can predict the number and the size of the partition and indicate a group of good partitions.",
                    "label": 1
                },
                {
                    "sent": "Without telling without that I mean you telling anything to the algorithm.",
                    "label": 0
                },
                {
                    "sent": "Is it possible?",
                    "label": 0
                },
                {
                    "sent": "This was already a step in this direction.",
                    "label": 0
                },
                {
                    "sent": "In 2002, like I said, this paper was published.",
                    "label": 0
                },
                {
                    "sent": "Proposing a method which in principle is very similar to existing methods, because it is.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Based on the hockey core clustering.",
                    "label": 0
                },
                {
                    "sent": "Although this is a divisive method, so you start from the top from all the nodes together in the network and then you start to cut links in order to split these groups artificially.",
                    "label": 1
                },
                {
                    "sent": "So you got the first link and then another one.",
                    "label": 0
                },
                {
                    "sent": "At some point the graph and connected becomes disconnected into pieces and then in three pieces and then in four pieces until all the nodes and you delete all links and all the nodes are isolated.",
                    "label": 0
                },
                {
                    "sent": "So you just the reverse operation.",
                    "label": 0
                },
                {
                    "sent": "Then what you've seen before?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "And just yeah, let me tell you where I'm going through this, OK?",
                    "label": 0
                },
                {
                    "sent": "The idea is that.",
                    "label": 0
                },
                {
                    "sent": "Which nodes, so which links to like up?",
                    "label": 0
                },
                {
                    "sent": "If these are the communities.",
                    "label": 0
                },
                {
                    "sent": "There are links which connects nodes, a different community settings, connecting nodes of the same community.",
                    "label": 0
                },
                {
                    "sent": "Ideally, if I know if I have good eyes and I see these guys here, if I cut these three I get my communities OK.",
                    "label": 0
                },
                {
                    "sent": "So the question is to identify good property.",
                    "label": 1
                },
                {
                    "sent": "Quantity property of these links so that you can spot them.",
                    "label": 0
                },
                {
                    "sent": "The property that was proposed by given a Newman in this paper was his property circles.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Edge between us.",
                    "label": 0
                },
                {
                    "sent": "Or link between us OK?",
                    "label": 0
                },
                {
                    "sent": "Is a measure is derived from a well known measure from social network analysis.",
                    "label": 0
                },
                {
                    "sent": "It was introduced in 1977 by Freeman, a sociologist.",
                    "label": 0
                },
                {
                    "sent": "And tells you basically how many shortest paths between each pair of nodes or the network use this link.",
                    "label": 1
                },
                {
                    "sent": "In the past, as a piece of the path.",
                    "label": 0
                },
                {
                    "sent": "OK, so in this case you see that this link here is the one which is the highest betweenness, because if you try to go from any of these nodes to any of the other nodes.",
                    "label": 0
                },
                {
                    "sent": "You must use this link, otherwise you cannot go there OK.",
                    "label": 0
                },
                {
                    "sent": "Whereas any of these links here is not so much used because for instance, any of these notes here.",
                    "label": 0
                },
                {
                    "sent": "If you want to go through a shortest path for it's 123 is a shortest path, but also 123 is a shortest path.",
                    "label": 0
                },
                {
                    "sent": "In this case, you wouldn't use this one, but we would always use this one.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So you can compute this.",
                    "label": 0
                },
                {
                    "sent": "You can do it in a time which goes like the square of the sides of the network on a sparse graph.",
                    "label": 0
                },
                {
                    "sent": "Once you identify, so each node edge at the end gets a number.",
                    "label": 0
                },
                {
                    "sent": "You take the largest number.",
                    "label": 0
                },
                {
                    "sent": "And you cut that edge.",
                    "label": 0
                },
                {
                    "sent": "This is the procedure.",
                    "label": 0
                },
                {
                    "sent": "You calculated between us Holdings.",
                    "label": 0
                },
                {
                    "sent": "You start from the complete network.",
                    "label": 0
                },
                {
                    "sent": "And you cut the edge with the largest between us.",
                    "label": 0
                },
                {
                    "sent": "OK, then you.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Erica, you remove it like I said so you re calculated between us on the remaining edges.",
                    "label": 1
                },
                {
                    "sent": "You must do this.",
                    "label": 0
                },
                {
                    "sent": "You must do this recalculation steps which makes you lose a lot of time in fact.",
                    "label": 0
                },
                {
                    "sent": "Because you have to do it for each edge at your cutting.",
                    "label": 0
                },
                {
                    "sent": "Because whenever you remove an edge, the structure of your network changes and therefore the importance of the edges is kind of reshuffled.",
                    "label": 0
                },
                {
                    "sent": "OK. And it was seen anyway in the same paper that if you don't make this recalculations that there is also much worse.",
                    "label": 1
                },
                {
                    "sent": "So you must do this recalculation step and you repeat from 2.",
                    "label": 1
                },
                {
                    "sent": "So you remove the one the largest between us you re calculated between us and you can remove it.",
                    "label": 0
                },
                {
                    "sent": "Eureka, I mean you remove it and so on until there are no links.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At the end you have a diagram like the one we've seen before, so you have minus one partitions, which can be very large number if N is large.",
                    "label": 0
                },
                {
                    "sent": "If the number of nodes and is large, which one is the best?",
                    "label": 1
                },
                {
                    "sent": "The same problem that we had before because this is a hierarchical technique.",
                    "label": 0
                },
                {
                    "sent": "The idea of given human in this paper here was to introduce the quality function that I showed you before.",
                    "label": 0
                },
                {
                    "sent": "Modularity which we can calculate for each partition.",
                    "label": 0
                },
                {
                    "sent": "And to take the partition with the largest value Q.",
                    "label": 0
                },
                {
                    "sent": "This is the best partition OK. Is you know it's a postulate, so it's not that you can say I like it or not, and this is how they decided to proceed, OK?",
                    "label": 0
                },
                {
                    "sent": "But it is a slow algorithm, you know it was 2002, that time you know.",
                    "label": 0
                },
                {
                    "sent": "It was still reasonable.",
                    "label": 1
                },
                {
                    "sent": "It's not going, which runs in a time which goes like the cube or the number of nodes.",
                    "label": 0
                },
                {
                    "sent": "On his past graph.",
                    "label": 1
                },
                {
                    "sent": "So when the number of links M is more or less like the number of nodes OK 3 four times and I mean 10 times this peak, but not much bigger.",
                    "label": 0
                },
                {
                    "sent": "Or to the ioncube miss it already?",
                    "label": 0
                },
                {
                    "sent": "If you have a network of 10,000 nodes it's a problem.",
                    "label": 0
                },
                {
                    "sent": "To split it in groups according to this procedure can take ages.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But starting from this one, people got curious.",
                    "label": 0
                },
                {
                    "sent": "For instance, right after that I started work on the problem.",
                    "label": 0
                },
                {
                    "sent": "Just because you know, I kinda like the idea and so on, and I thought that I could use what I knew from statistical physics to analyze and to find the groups.",
                    "label": 0
                },
                {
                    "sent": "And there was a whole.",
                    "label": 0
                },
                {
                    "sent": "You know wealth or methods.",
                    "label": 0
                },
                {
                    "sent": "Every day there is a new method.",
                    "label": 0
                },
                {
                    "sent": "Even now I mean.",
                    "label": 0
                },
                {
                    "sent": "To try to optimize on this result.",
                    "label": 0
                },
                {
                    "sent": "To get better groups and faster, 'cause that's what you want to do.",
                    "label": 0
                },
                {
                    "sent": "Better groups and faster.",
                    "label": 0
                },
                {
                    "sent": "Specially if you want a nice network with millions of nodes, you cannot have a complexity and three for a network, million or not, even square wouldn't be enough.",
                    "label": 0
                },
                {
                    "sent": "You will need something which goes close to linear or N log NN locks parent.",
                    "label": 0
                },
                {
                    "sent": "This is a classification that I put here.",
                    "label": 0
                },
                {
                    "sent": "On how to know divides this algorithm groups divisive algorithm like the one I've given you money which identify a criterion for the edges that you want to remove, you cut them.",
                    "label": 0
                },
                {
                    "sent": "And you keep proceeding.",
                    "label": 0
                },
                {
                    "sent": "There are many others like the algorithm by radicated it.",
                    "label": 0
                },
                {
                    "sent": "I was supposed to talk about, but I don't think I'm going to do this.",
                    "label": 0
                },
                {
                    "sent": "Then there is more light optimization, which is the one I'm going to talk instead.",
                    "label": 0
                },
                {
                    "sent": "Spectral method dynamic methods, clique, percolation, statistical inference.",
                    "label": 1
                },
                {
                    "sent": "Each of these classes, like in 1015 hundred algorithm.",
                    "label": 0
                },
                {
                    "sent": "OK, so of course you understand that cannot speak about this right now.",
                    "label": 0
                },
                {
                    "sent": "But I can tell you something about.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The light optimization is the function that we defined before I told you the meaning of the single terms.",
                    "label": 0
                },
                {
                    "sent": "Here we want to make this number as big as possible.",
                    "label": 0
                },
                {
                    "sent": "So instead of using it as a quality index.",
                    "label": 0
                },
                {
                    "sent": "Together with other algorithms, why don't we try to optimize this number directly?",
                    "label": 0
                },
                {
                    "sent": "Is a well defined problem.",
                    "label": 0
                },
                {
                    "sent": "You have a partition.",
                    "label": 0
                },
                {
                    "sent": "Each partition corresponds to a number.",
                    "label": 0
                },
                {
                    "sent": "You want to find the partition which corresponds to the largest number.",
                    "label": 0
                },
                {
                    "sent": "So a different problem unfortunately is NP complete problem.",
                    "label": 0
                },
                {
                    "sent": "So you cannot do it in optimal way unless you know it won't invest your lifetime.",
                    "label": 0
                },
                {
                    "sent": "On this.",
                    "label": 0
                },
                {
                    "sent": "So the goal is to find a maximum of Q over all possible partitions.",
                    "label": 1
                },
                {
                    "sent": "It's NP complete.",
                    "label": 0
                },
                {
                    "sent": "You can only do it in a suboptimal way.",
                    "label": 0
                },
                {
                    "sent": "These are possible ways of doing it.",
                    "label": 0
                },
                {
                    "sent": "Each of them corresponds to one or more papers which use this technique.",
                    "label": 0
                },
                {
                    "sent": "You can do it with greedy algorithm.",
                    "label": 0
                },
                {
                    "sent": "I'm going to describe one greedy algorithm.",
                    "label": 0
                },
                {
                    "sent": "You can do it with simulated annealing, which is a classic way to optimize cost functions.",
                    "label": 0
                },
                {
                    "sent": "You can do it with stream optimization with the paper introduced by written by local airiness, 2005.",
                    "label": 0
                },
                {
                    "sent": "Spectre optimization technique introduced by Newman 2006.",
                    "label": 0
                },
                {
                    "sent": "All these ways are.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Kind of efficient.",
                    "label": 0
                },
                {
                    "sent": "The greedy algorithm was.",
                    "label": 0
                },
                {
                    "sent": "The first one was the paper.",
                    "label": 0
                },
                {
                    "sent": "In fact, in which Newman said, OK, let's try to optimize modularity and forget about everything else, because if I find the largest value this one, maybe I really found the optimal division of the networking groups.",
                    "label": 0
                },
                {
                    "sent": "This is the paper where it was introduced 2004 starting from that day, people stepped in to try, you know, fancy ways of optimizing modularity, but really hundreds of accurate just on this.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested, you can take a look at this paper.",
                    "label": 0
                },
                {
                    "sent": "This is how it works.",
                    "label": 0
                },
                {
                    "sent": "You start from.",
                    "label": 0
                },
                {
                    "sent": "The basic configuration in which each node is isolated.",
                    "label": 0
                },
                {
                    "sent": "And you put together.",
                    "label": 0
                },
                {
                    "sent": "Is kind of similar to archical clustering you put together those nodes.",
                    "label": 0
                },
                {
                    "sent": "And at the beginning individual nodes, but afterwards groups of nodes which produce the largest increase in modularity.",
                    "label": 1
                },
                {
                    "sent": "If you take that partition.",
                    "label": 0
                },
                {
                    "sent": "OK, so you compute all the Delta Q's.",
                    "label": 0
                },
                {
                    "sent": "They move corresponding to the largest FQ.",
                    "label": 0
                },
                {
                    "sent": "Is the one that you will finally accept you repeat this procedure until everything is together.",
                    "label": 0
                },
                {
                    "sent": "They sense it added in tell you.",
                    "label": 0
                },
                {
                    "sent": "But I can do it now.",
                    "label": 1
                },
                {
                    "sent": "The modularity of the partition in which the network is just one piece is 0.",
                    "label": 0
                },
                {
                    "sent": "OK, because in this case this sum is only one term.",
                    "label": 0
                },
                {
                    "sent": "Li is just LBL.",
                    "label": 0
                },
                {
                    "sent": "The eye is twice.",
                    "label": 0
                },
                {
                    "sent": "L2L becausw is the sum of the degrees of all nodes of the network and the sum of the degrees of the all nodes of the network is the double of the number, so twice the number of the links.",
                    "label": 0
                },
                {
                    "sent": "So if you make the square here, you get four L ^2 / 4 elegant LL minus L is 0.",
                    "label": 0
                },
                {
                    "sent": "So by definition, the modularity of the partitioning.",
                    "label": 0
                },
                {
                    "sent": "Which network is a piece is zero.",
                    "label": 0
                },
                {
                    "sent": "OK, the maximum modularity is always more than one.",
                    "label": 0
                },
                {
                    "sent": "The minimum is negative.",
                    "label": 0
                },
                {
                    "sent": "Depends.",
                    "label": 0
                },
                {
                    "sent": "In fact, finding the minimum modularity will let you find these things that I was telling faltered before.",
                    "label": 0
                },
                {
                    "sent": "So the anti communities.",
                    "label": 0
                },
                {
                    "sent": "Groups are not in which there is less as possible connections inside and as many as possible outside, because it's just the other side of the problem and the community in this case is called multiple parties.",
                    "label": 0
                },
                {
                    "sent": "OK, so let me get.",
                    "label": 0
                },
                {
                    "sent": "You can also enforce this condition when you will make the optimization.",
                    "label": 0
                },
                {
                    "sent": "I don't need to do anything here, this is this is nothing you don't need to tell how many groups you have.",
                    "label": 0
                },
                {
                    "sent": "You want to have it with value.",
                    "label": 0
                },
                {
                    "sent": "Number in size of the groups.",
                    "label": 0
                },
                {
                    "sent": "So in this respect is very predictive, but there are of course issues.",
                    "label": 0
                },
                {
                    "sent": "Six group no.",
                    "label": 0
                },
                {
                    "sent": "Yeah, usually they're not, yeah.",
                    "label": 0
                },
                {
                    "sent": "There is no guarantee.",
                    "label": 0
                },
                {
                    "sent": "Depends on it topology of the network.",
                    "label": 0
                },
                {
                    "sent": "So like I said, you start combining groups or nodes.",
                    "label": 0
                },
                {
                    "sent": "You combine the two groups that give you the largest increase in Delta Q.",
                    "label": 0
                },
                {
                    "sent": "For that partition and you keep doing this.",
                    "label": 0
                },
                {
                    "sent": "The procedure takes a time on square, so it's much faster than a given human algorithm by an order of complexity in North.",
                    "label": 0
                },
                {
                    "sent": "With this are going to can already analyze system with 50,000 nodes.",
                    "label": 1
                },
                {
                    "sent": "100,000 nodes or those that still gets low, it depends.",
                    "label": 0
                },
                {
                    "sent": "In fact, there is a fast version of this run which scales like, which does exactly the same job.",
                    "label": 0
                },
                {
                    "sent": "We're using better data structure which case like North Lock Square North.",
                    "label": 0
                },
                {
                    "sent": "A version of the algorithm of this algorithm which makes you analyze systems with millions of nodes.",
                    "label": 0
                },
                {
                    "sent": "There's some Japanese right 200 millions of nodes.",
                    "label": 0
                },
                {
                    "sent": "By doing these things.",
                    "label": 0
                },
                {
                    "sent": "So we take a piece of the web and divide it in communities in this way.",
                    "label": 0
                },
                {
                    "sent": "Cute paper small.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'm coming to that right?",
                    "label": 0
                },
                {
                    "sent": "I mean in a second.",
                    "label": 0
                },
                {
                    "sent": "In fact, there is a problem.",
                    "label": 0
                },
                {
                    "sent": "For this measure.",
                    "label": 0
                },
                {
                    "sent": "I mean you know.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I found this problem.",
                    "label": 0
                },
                {
                    "sent": "In this paper here.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two years ago there is a problem because I mean it's a technical thing to discuss and we don't have time for this.",
                    "label": 0
                },
                {
                    "sent": "I just it's just a caveat for you.",
                    "label": 0
                },
                {
                    "sent": "For the young guys who want to speak, you know, want to spend some time about this.",
                    "label": 0
                },
                {
                    "sent": "The problem is that there is a scale that you don't see because it's very well concealed in the definition of modularity.",
                    "label": 0
                },
                {
                    "sent": "And if you take groups scale in the number of links.",
                    "label": 0
                },
                {
                    "sent": "So if you take the number of links L and you take the square root of this, if you have group or nodes which have less links inside then this number more or less of course.",
                    "label": 0
                },
                {
                    "sent": "Modularity.",
                    "label": 0
                },
                {
                    "sent": "We tried to put them together in larger groups because it's more convenient for the optimization.",
                    "label": 0
                },
                {
                    "sent": "So even if you have small groups which are just connected by single link.",
                    "label": 0
                },
                {
                    "sent": "Which would make them really strongly identifiable.",
                    "label": 0
                },
                {
                    "sent": "At least intuitively you say, OK, there is only the smallest possible connection 11 link.",
                    "label": 0
                },
                {
                    "sent": "Modulite would put them together if they're small enough.",
                    "label": 0
                },
                {
                    "sent": "So because of this, in fact we also worked on these and other people.",
                    "label": 0
                },
                {
                    "sent": "Now you know, people are trying to somehow to take with care about these two.",
                    "label": 0
                },
                {
                    "sent": "To use alternative methods.",
                    "label": 0
                },
                {
                    "sent": "So for instance, this diagram here says that if you have if we apply model itemization, you get the partition you take.",
                    "label": 0
                },
                {
                    "sent": "You consider the pieces of this partition.",
                    "label": 0
                },
                {
                    "sent": "The communities which are smaller than this, you don't know a priority.",
                    "label": 0
                },
                {
                    "sent": "If these pieces are like this, so real communities or like this.",
                    "label": 0
                },
                {
                    "sent": "Groups or communities, because for model it is exactly the same, but I do always put systematically small groups together.",
                    "label": 0
                },
                {
                    "sent": "Because it gives you the largest possible increase.",
                    "label": 0
                },
                {
                    "sent": "If you want to look if you want to go for the maximum, which is what we want to do in this case.",
                    "label": 0
                },
                {
                    "sent": "Of course, by definition, then you risk to to find less communities that you're supposed to find.",
                    "label": 0
                },
                {
                    "sent": "If you want to know more details, of course you can read this paper.",
                    "label": 0
                },
                {
                    "sent": "Talk to me later, no problem.",
                    "label": 0
                },
                {
                    "sent": "It's just you know, a warning like.",
                    "label": 0
                },
                {
                    "sent": "So I mean so interesting thing, of course is full of properties.",
                    "label": 0
                },
                {
                    "sent": "Many.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I don't know what I could tell you so far.",
                    "label": 0
                },
                {
                    "sent": "But you know, but we must be careful.",
                    "label": 0
                },
                {
                    "sent": "You might have surprised.",
                    "label": 0
                },
                {
                    "sent": "You may have surprises at some point.",
                    "label": 0
                },
                {
                    "sent": "The nanny galgen.",
                    "label": 0
                },
                {
                    "sent": "It's not that I'm going to use this things which are very familiar to exist like most of us.",
                    "label": 0
                },
                {
                    "sent": "For instance, Potts model, so spin models using kind of monetization properties of spins on a network, or synchronization.",
                    "label": 0
                },
                {
                    "sent": "Put it in, put oscillators on the nodes.",
                    "label": 0
                },
                {
                    "sent": "And try to look at the synchronization properties.",
                    "label": 0
                },
                {
                    "sent": "See how fast this group and if there are groups with many links.",
                    "label": 0
                },
                {
                    "sent": "Of course there is synchronized faster than other parts and so on.",
                    "label": 0
                },
                {
                    "sent": "So by drawing a diagram waiting for the global synchronization, you can identify different time scales which correspond to different groups and structures.",
                    "label": 0
                },
                {
                    "sent": "You can use random walks.",
                    "label": 1
                },
                {
                    "sent": "If you have a random walk, of course what you would expect.",
                    "label": 0
                },
                {
                    "sent": "Is that a Walker?",
                    "label": 0
                },
                {
                    "sent": "We start to move?",
                    "label": 0
                },
                {
                    "sent": "In a community we spend a lot of time inside the community because there are many links inside the very few outside to escape.",
                    "label": 0
                },
                {
                    "sent": "So starting from this simple idea, you can calculate probabilities, first passage time in this kind of things.",
                    "label": 0
                },
                {
                    "sent": "To see.",
                    "label": 0
                },
                {
                    "sent": "Which links are really inside groups in which are outside, but I won't tell you about this is just kind of overview.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you want to know more, I would tell you there is a place where you can find more clickbait collation is.",
                    "label": 0
                },
                {
                    "sent": "One of the biggest.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alternative to modularity because it's really.",
                    "label": 0
                },
                {
                    "sent": "Modularity independent doesn't care about modularity at all.",
                    "label": 0
                },
                {
                    "sent": "It was introduced in this paper that already mentioned before, and it was the 1st paper in which people explicitly took into account the problem of overlapping communities.",
                    "label": 0
                },
                {
                    "sent": "As you can see here.",
                    "label": 0
                },
                {
                    "sent": "These things here means that these groups F nodes in common, these two groups of three nodes in common.",
                    "label": 0
                },
                {
                    "sent": "These two have one node in common.",
                    "label": 0
                },
                {
                    "sent": "These two are independent.",
                    "label": 0
                },
                {
                    "sent": "These two are independent.",
                    "label": 0
                },
                {
                    "sent": "I don't know how much time I have.",
                    "label": 0
                },
                {
                    "sent": "You can tell me probably.",
                    "label": 0
                },
                {
                    "sent": "Oh I see.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So basically the idea here is that if you have a lot of links inside, you will also have a lot of motives like triangles.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But if you try to make a triangle to roll a triangle within this, for instance by.",
                    "label": 0
                },
                {
                    "sent": "Turning it's making it roll over one of these sites.",
                    "label": 0
                },
                {
                    "sent": "Inside the group you will see that in this kind of structure, for instance, will not go out for one community to get into the other.",
                    "label": 0
                },
                {
                    "sent": "It will get trapped inside the group.",
                    "label": 0
                },
                {
                    "sent": "So basically the whole procedure is based on making these motives.",
                    "label": 0
                },
                {
                    "sent": "So for instance triangles or complete graphs with K nodes like decagons.",
                    "label": 0
                },
                {
                    "sent": "So for nodes and six links to make them move inside these groups, because the idea is that if the group I will identify with very few links outside this piece is here will not get out, we get trapped inside.",
                    "label": 0
                },
                {
                    "sent": "And you can identify which nodes are spanned by each other thing.",
                    "label": 0
                },
                {
                    "sent": "This is the idea if you want to know more.",
                    "label": 0
                },
                {
                    "sent": "Again you can ask me.",
                    "label": 0
                },
                {
                    "sent": "Only just sent it, but I mean there's just one more algorithms.",
                    "label": 0
                },
                {
                    "sent": "Of course, it's important.",
                    "label": 0
                },
                {
                    "sent": "You can even download the software to make it work, but for me it's more important to close this thing by.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Dressing.",
                    "label": 0
                },
                {
                    "sent": "What I consider a very crucial issue, which is usually under estimated the issue of testing.",
                    "label": 0
                },
                {
                    "sent": "I show you many algorithm.",
                    "label": 0
                },
                {
                    "sent": "Which one is the best?",
                    "label": 0
                },
                {
                    "sent": "Is there a good, mistaken idea algorithm?",
                    "label": 0
                },
                {
                    "sent": "How do you see?",
                    "label": 0
                },
                {
                    "sent": "How do you verify if what you've done?",
                    "label": 0
                },
                {
                    "sent": "If your method is good or not?",
                    "label": 0
                },
                {
                    "sent": "If you can use it and when.",
                    "label": 0
                },
                {
                    "sent": "What you do usually you just use.",
                    "label": 0
                },
                {
                    "sent": "Networks with the circle well defined Community structure networks would say OK, these are the groups.",
                    "label": 1
                },
                {
                    "sent": "If a method finds it, it's good.",
                    "label": 0
                },
                {
                    "sent": "If it doesn't find it is not so good and then I can compare the performance.",
                    "label": 0
                },
                {
                    "sent": "There are two classes of graphs that you can consider in this case.",
                    "label": 0
                },
                {
                    "sent": "Of course you can build them with the computer artificial networks and I will talk a little more about this.",
                    "label": 0
                },
                {
                    "sent": "Or you can use real networks which are very few in which you know for some reasons, because you have specific information about this specific system that there are well defined groups which.",
                    "label": 0
                },
                {
                    "sent": "Which makes sense and try to find those.",
                    "label": 0
                },
                {
                    "sent": "This is so far.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most popular benchmark was introduced in the same paper.",
                    "label": 0
                },
                {
                    "sent": "These 2002 nuts by given in Yuma.",
                    "label": 0
                },
                {
                    "sent": "Can you see three possible configurations there?",
                    "label": 0
                },
                {
                    "sent": "Of course, many C Class with.",
                    "label": 0
                },
                {
                    "sent": "With many networks.",
                    "label": 0
                },
                {
                    "sent": "It's a network with 128 nodes divided in four groups of 32.",
                    "label": 0
                },
                {
                    "sent": "Which identified by the colors here.",
                    "label": 0
                },
                {
                    "sent": "In which each each node is basically the same degree 16.",
                    "label": 0
                },
                {
                    "sent": "So each node S 16 friends.",
                    "label": 0
                },
                {
                    "sent": "OK, supposing that this is a.",
                    "label": 0
                },
                {
                    "sent": "Social net and there is a parameter.",
                    "label": 0
                },
                {
                    "sent": "Which tells you what is the probability that these friends are inside my group versus the other groups.",
                    "label": 0
                },
                {
                    "sent": "Which is called.",
                    "label": 0
                },
                {
                    "sent": "In this case K out OK.",
                    "label": 0
                },
                {
                    "sent": "So K is a total degree, which is 16 of each node.",
                    "label": 0
                },
                {
                    "sent": "K Out is how many friends I have outside.",
                    "label": 0
                },
                {
                    "sent": "For instance, for this node here, how many friends are Violet grey and yellow or?",
                    "label": 0
                },
                {
                    "sent": "Or blue here.",
                    "label": 0
                },
                {
                    "sent": "Since the sum is 16, of course you have one parameter K in is just K -- K out, obviously.",
                    "label": 0
                },
                {
                    "sent": "What you do here you tune this number, and by doing this you go from configurations like this in which you see that there is a big density inside the groups.",
                    "label": 0
                },
                {
                    "sent": "And the very few links between the groups to a mixed configuration like this to the total mass.",
                    "label": 0
                },
                {
                    "sent": "And you ask that you are going to find the four colors tells you which color is each node?",
                    "label": 0
                },
                {
                    "sent": "OK, here is easy.",
                    "label": 0
                },
                {
                    "sent": "Yes, not so easy.",
                    "label": 0
                },
                {
                    "sent": "Yes, probably impossible.",
                    "label": 0
                },
                {
                    "sent": "Obviously not only because you don't see it, but really because difficult.",
                    "label": 0
                },
                {
                    "sent": "This is one of the plus which is which are used in this case.",
                    "label": 0
                },
                {
                    "sent": "Is comparing two algorithms to make an objective test.",
                    "label": 0
                },
                {
                    "sent": "Testing this argument on the very same class of objects which are these objects by varying K out create?",
                    "label": 0
                },
                {
                    "sent": "So each way out to create 100 networks?",
                    "label": 0
                },
                {
                    "sent": "You apply your technique there and you compare the partition you find with your method with the real partition uniform.",
                    "label": 0
                },
                {
                    "sent": "There are ways to do this.",
                    "label": 0
                },
                {
                    "sent": "Here, for instance, they used the so called fraction of correctly classified nodes, which is a secretary and that Newman introduced at the time when he used this benchmark for the first time.",
                    "label": 0
                },
                {
                    "sent": "Now there are more reliable techniques, taking, for instance from information theory, the so called normalized mutual information, which, given two partitions give you numbers, tells you how much information you get on the petition B if you partition A.",
                    "label": 0
                },
                {
                    "sent": "So it's one if they are identical.",
                    "label": 0
                },
                {
                    "sent": "Is 0 if they're completely different.",
                    "label": 0
                },
                {
                    "sent": "OK, that's why you see that there's a scale from 1 to 0 here.",
                    "label": 0
                },
                {
                    "sent": "As you can see here this algorithm, which are modularity, optimization and the given human method, perform very well up to some level here, which means they always find the right community structure.",
                    "label": 0
                },
                {
                    "sent": "The four groups each node is assigned to his community.",
                    "label": 0
                },
                {
                    "sent": "Then of course, when the situation starts to become like this, they start to make mistakes, of course, because it's really difficult.",
                    "label": 0
                },
                {
                    "sent": "And then of course they fail miserably, because at some point there is no more community structure, so we do not expect it to find.",
                    "label": 0
                },
                {
                    "sent": "So whatever you find is nothing to do with what you.",
                    "label": 0
                },
                {
                    "sent": "Put originally.",
                    "label": 0
                },
                {
                    "sent": "And what is this problem?",
                    "label": 0
                },
                {
                    "sent": "Specific product is supposed to show to you.",
                    "label": 0
                },
                {
                    "sent": "Is that this method with the square?",
                    "label": 0
                },
                {
                    "sent": "So the present method of this paper is present because of course it was taken by paper is better than the other one because you know it resists a little more and then of course it bends down as compared to the game.",
                    "label": 0
                },
                {
                    "sent": "And it's also much faster.",
                    "label": 0
                },
                {
                    "sent": "But there are problems with this.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I mean, I like to find promising this stuff.",
                    "label": 0
                },
                {
                    "sent": "All these nodes are the notes of this.",
                    "label": 0
                },
                {
                    "sent": "This benchmark at the same size as the same degree 16, but it can be any number, so they're all the same, same number of friends and all communities are equal size.",
                    "label": 1
                },
                {
                    "sent": "Therefore groups of 32.",
                    "label": 0
                },
                {
                    "sent": "This of course.",
                    "label": 0
                },
                {
                    "sent": "Not so much the case for real systems.",
                    "label": 1
                },
                {
                    "sent": "In real systems the degrees can be very different.",
                    "label": 0
                },
                {
                    "sent": "In fact, they usually are very different, this one which speaks.",
                    "label": 0
                },
                {
                    "sent": "About scale free distributions because you have many nodes with few links.",
                    "label": 0
                },
                {
                    "sent": "A few nodes with a lot of links, but also the sizes are very different.",
                    "label": 0
                },
                {
                    "sent": "There are communities which are very small, coexisting with communities which are very big in the very same system.",
                    "label": 0
                },
                {
                    "sent": "To avoid this, we introduced.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Few months ago and your benchmark in this paper that you find here.",
                    "label": 0
                },
                {
                    "sent": "Online and you can also download the software so there is a link there to the software that you can download to use it.",
                    "label": 0
                },
                {
                    "sent": "It's very easy to use.",
                    "label": 0
                },
                {
                    "sent": "In which you introduce these two realistic ingredients.",
                    "label": 0
                },
                {
                    "sent": "So you create a cluster graphs in which the nodes have escaped three degree distribution with exponent that you put you decide at the beginning is one of the inputs.",
                    "label": 0
                },
                {
                    "sent": "And the communities the Community sites are distributed according to a power law.",
                    "label": 1
                },
                {
                    "sent": "With another exponent, again, because an input at the beginning of the process.",
                    "label": 0
                },
                {
                    "sent": "OK. Then you have a mixing parameter mu, which tells you how many links there inside versus outside versus inside is the analogous of this K out as seen before.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "This is possible realization as compared to the one I've seen before.",
                    "label": 0
                },
                {
                    "sent": "It's a little blurred.",
                    "label": 0
                },
                {
                    "sent": "But you see, there's more groups coexisting with big groups.",
                    "label": 0
                },
                {
                    "sent": "There are not so many links there coexisting with nodes with few links.",
                    "label": 0
                },
                {
                    "sent": "This is what real systems look like.",
                    "label": 0
                },
                {
                    "sent": "Not like the one before, so if you want to test an algorithm, use this one OK.",
                    "label": 0
                },
                {
                    "sent": "This is what you get if you apply.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The light optimization to some of these of these graphs.",
                    "label": 0
                },
                {
                    "sent": "Different colors correspond to different average degrees, because here you can fix it.",
                    "label": 0
                },
                {
                    "sent": "I mean, say, one of the parameters of the system before it was 16.",
                    "label": 0
                },
                {
                    "sent": "Couldn't change anything here.",
                    "label": 0
                },
                {
                    "sent": "You can decide average degree fifteen 2025 and four different choices for this points gamma, which tells you the slope or the degree distribution and beta.",
                    "label": 0
                },
                {
                    "sent": "We stayed through the slope or the community size distribution.",
                    "label": 0
                },
                {
                    "sent": "You fix these things.",
                    "label": 0
                },
                {
                    "sent": "You get your graphs, you apply your method.",
                    "label": 0
                },
                {
                    "sent": "And you verify again the real partition versus the partition found by your methods.",
                    "label": 0
                },
                {
                    "sent": "In this case we use the normalized mutual information.",
                    "label": 0
                },
                {
                    "sent": "This number taken from information theory I told you before.",
                    "label": 0
                },
                {
                    "sent": "Which cannot exceed one, just to show and you see already that is compared to the previous plot that here the algorithm problems already for very well defined communities.",
                    "label": 0
                },
                {
                    "sent": "So it's much more difficult to find communities here, although this is what you're supposed to do because these systems are simulations of real systems.",
                    "label": 0
                },
                {
                    "sent": "Much more than the original benchmark, given a Newman.",
                    "label": 0
                },
                {
                    "sent": "And then you can see there is some systematic method performs best.",
                    "label": 0
                },
                {
                    "sent": "The more links there are, so the higher the average.",
                    "label": 0
                },
                {
                    "sent": "Did you see their systematic?",
                    "label": 0
                },
                {
                    "sent": "The green curve always slice into.",
                    "label": 0
                },
                {
                    "sent": "This is for 1000 nodes for 5000 node.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Everything else being the same, you see that there is a worsening of their performance.",
                    "label": 0
                },
                {
                    "sent": "The scale is the same, so you see the cursor moving down.",
                    "label": 0
                },
                {
                    "sent": "And 5000 nodes is a very small network.",
                    "label": 0
                },
                {
                    "sent": "Still, especially now you're considering really networks, so that makes you think that probably the performance in real system is very bad even when communities are very well identified.",
                    "label": 0
                },
                {
                    "sent": "So it's much more difficult to crack this benchmark than the existing benchmark.",
                    "label": 0
                },
                {
                    "sent": "One more reasons to use it also because everything is reasonable here.",
                    "label": 0
                },
                {
                    "sent": "Realnetworks is lost.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I want to show you.",
                    "label": 0
                },
                {
                    "sent": "I already showed you this graph.",
                    "label": 0
                },
                {
                    "sent": "This is a network of 34 friends which were members of the Karate Club in a University in Washington.",
                    "label": 0
                },
                {
                    "sent": "This was the administrator and this was one of the teacher.",
                    "label": 0
                },
                {
                    "sent": "At some point these two guys didn't agree with each other.",
                    "label": 0
                },
                {
                    "sent": "They had an issue about money problem.",
                    "label": 0
                },
                {
                    "sent": "So this guy Zachary was a sociologist.",
                    "label": 0
                },
                {
                    "sent": "Follow these guys like now for three months, six months and observation times in counted how many times these guys had interactions.",
                    "label": 0
                },
                {
                    "sent": "In fact, each of these edge as a number.",
                    "label": 0
                },
                {
                    "sent": "But for the purposes of this algorithm, usually you consider the unweighted version which actually correspond to wait one OK.",
                    "label": 0
                },
                {
                    "sent": "But you can put the edges.",
                    "label": 0
                },
                {
                    "sent": "They are well known there, measure their measured by Zachary.",
                    "label": 0
                },
                {
                    "sent": "OK, so this default and then they decide.",
                    "label": 0
                },
                {
                    "sent": "OK, I don't want to stay with you anymore.",
                    "label": 0
                },
                {
                    "sent": "And they split the club in two.",
                    "label": 0
                },
                {
                    "sent": "The Friends of the teacher went without each other friends with that of the Ministrator went with administrator.",
                    "label": 0
                },
                {
                    "sent": "These are correspond to the squares and circles here.",
                    "label": 0
                },
                {
                    "sent": "And your algorithm is a good algorithm to find the squares and circles.",
                    "label": 0
                },
                {
                    "sent": "The colors that you see here correspond to the partition with the largest modularity.",
                    "label": 0
                },
                {
                    "sent": "So today really maximum modularity that you find for this system.",
                    "label": 0
                },
                {
                    "sent": "And if you see moduli defines if you don't give the weights.",
                    "label": 0
                },
                {
                    "sent": "So if you just consider the unweighted version.",
                    "label": 0
                },
                {
                    "sent": "This is a combination of four groups and not top two, although there is some consistency as you see.",
                    "label": 0
                },
                {
                    "sent": "None of the groups contain squares and circles together.",
                    "label": 0
                },
                {
                    "sent": "Their other squares or circles, so it's basically a subdivision of the real partition, but it's not the repetition.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So open problems overlapping communities or what?",
                    "label": 1
                },
                {
                    "sent": "Most of what I told you applies to the standard version of the problem, which is already very difficult, but you have to consider that in real communities overlap.",
                    "label": 0
                },
                {
                    "sent": "So you have to account for this ingredient hierarchies yet to find if there are communities inside their communities.",
                    "label": 0
                },
                {
                    "sent": "Which is usually the case directed graph so far, like I told you, I just focus on undirected graphs because you know, but they are going about directed graphs, they don't use application because in this case it wouldn't make sense as we were saying before.",
                    "label": 0
                },
                {
                    "sent": "But there are ways of doing this.",
                    "label": 0
                },
                {
                    "sent": "Say it again.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, right of course, yeah, but also moderate optimization is a straightforward application.",
                    "label": 0
                },
                {
                    "sent": "I'm generalization to the director case into the weighted case, because also in this case I didn't consider weights.",
                    "label": 0
                },
                {
                    "sent": "Weights are additional information.",
                    "label": 0
                },
                {
                    "sent": "If you have this information, of course it should help you to identify Community cannot be a problem.",
                    "label": 0
                },
                {
                    "sent": "Should be help.",
                    "label": 0
                },
                {
                    "sent": "So you should take them properly into account and then of course the computational complexity.",
                    "label": 0
                },
                {
                    "sent": "People once analyze system with 1 million 10,000,000 nodes, 100 million nodes.",
                    "label": 0
                },
                {
                    "sent": "Any outgoing, the idea argument should be linear in complexity, cannot be can go like N square and square means that 100,000 notes, and you already know.",
                    "label": 0
                },
                {
                    "sent": "Right, of course.",
                    "label": 0
                },
                {
                    "sent": "It really depends.",
                    "label": 0
                },
                {
                    "sent": "Yeah, right of course, I just give you some, you know some bounds reasonable by this by orders of magnitude.",
                    "label": 0
                },
                {
                    "sent": "Of course, because it depends on the number of links you know.",
                    "label": 0
                },
                {
                    "sent": "You can have a system with hundred thousands of very few links, which you can immediately decompose in groups, and you can have a system with 10,000 nodes in many much higher density which will take ages to perform.",
                    "label": 0
                },
                {
                    "sent": "Because I just give you some indication.",
                    "label": 0
                },
                {
                    "sent": "But then of course the issue of testing.",
                    "label": 0
                },
                {
                    "sent": "We divide this new class of benchmark graphs.",
                    "label": 0
                },
                {
                    "sent": "Maybe more can be done in this direction if you want to know more about this.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Last year we wrote this review article that you can find on the on the arcade where you see where you can read most of the things that they said.",
                    "label": 0
                },
                {
                    "sent": "In fact, all of them and much more.",
                    "label": 0
                },
                {
                    "sent": "For the rest, I'm here so you can ask me everything you want.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Been in.",
                    "label": 0
                },
                {
                    "sent": "See that.",
                    "label": 0
                },
                {
                    "sent": "Pricing this in in in your business process with you.",
                    "label": 0
                },
                {
                    "sent": "Hello, degrees is not surprising that the other reason.",
                    "label": 0
                },
                {
                    "sent": "Perfect diction since before.",
                    "label": 0
                },
                {
                    "sent": "In principle.",
                    "label": 0
                },
                {
                    "sent": "So from the plots that I showed you, which refer to modulate optimization, I will say you wouldn't expect it to fail when the groups are not mixed.",
                    "label": 0
                },
                {
                    "sent": "Because, you know, in this case, that kind of identity, easily identifiable local method and local method which just looks at what happens really there.",
                    "label": 0
                },
                {
                    "sent": "Whereas moderate optimization is a global method, tries to find the perfect number for the whole partition.",
                    "label": 0
                },
                {
                    "sent": "Would be able to do much better job there at the beginning of the curve.",
                    "label": 0
                },
                {
                    "sent": "Then of course everything is supposed to fail anyway.",
                    "label": 0
                },
                {
                    "sent": "But The thing is that I mean not in the case of modularity, you really find the maximum only the maximum does not correspond to the real partition for the reason that I said, because modularity tries to combine small groups.",
                    "label": 0
                },
                {
                    "sent": "So this is really algorithm ossific problem.",
                    "label": 0
                },
                {
                    "sent": "But in general you would expect.",
                    "label": 0
                },
                {
                    "sent": "A good algorithm, at least to catch very well the partition.",
                    "label": 0
                },
                {
                    "sent": "Also, you see that there is a dependence on the size of the from 1000 to 5000 already because we're moving down considerably.",
                    "label": 0
                },
                {
                    "sent": "So the question is that we didn't make tests for 50,000 because it took so long to apply the algorithm.",
                    "label": 0
                },
                {
                    "sent": "We can create.",
                    "label": 0
                },
                {
                    "sent": "By the way, the complexity of our are going to create the benchmark is linear with the number of links, so you can easily create system with millions of nodes only if your algorithm is slow to crack it into communities.",
                    "label": 0
                },
                {
                    "sent": "This low of courses.",
                    "label": 0
                },
                {
                    "sent": "Useless.",
                    "label": 0
                },
                {
                    "sent": "That's why we were forced to consider this very, very small graphs.",
                    "label": 0
                },
                {
                    "sent": "But in this case, that's what happens, so even the maximum when you find it because you have good clue that this is really a maximum is that's not correspond to their community or their community corresponds to value modularity, which is smaller than the actual machine.",
                    "label": 0
                },
                {
                    "sent": "So you already found higher values, so it's wrong really by default in this case.",
                    "label": 0
                },
                {
                    "sent": "In fact, this class system allows you to see this.",
                    "label": 0
                },
                {
                    "sent": "Whereas the previous benchmark did not allowed to see it because the computers were all the same.",
                    "label": 0
                },
                {
                    "sent": "And you know there were so actually one more reason to prefer this class of algorithm to the previous one.",
                    "label": 0
                },
                {
                    "sent": "That's a good question.",
                    "label": 0
                },
                {
                    "sent": "Forecast.",
                    "label": 0
                },
                {
                    "sent": "You really have one, how?",
                    "label": 0
                },
                {
                    "sent": "Networks net data.",
                    "label": 0
                },
                {
                    "sent": "Well, basically adjacency matrix who is connected to whom.",
                    "label": 0
                },
                {
                    "sent": "You can also have weights.",
                    "label": 0
                },
                {
                    "sent": "Like I said before, but I mean in many cases you can use this weights.",
                    "label": 0
                },
                {
                    "sent": "Modularity can be easily standard to the case of weighted graphs.",
                    "label": 0
                },
                {
                    "sent": "Network if you have that, have split or that you could follow some bolting pattern and then see how things go.",
                    "label": 0
                },
                {
                    "sent": "I mean like the real community structure like the exactly very few.",
                    "label": 0
                },
                {
                    "sent": "In fact I showed this one because it's always a nice story to tell, not the fact that two guys fault and then effective formulas aquatic class.",
                    "label": 0
                },
                {
                    "sent": "So it was really bitter fight.",
                    "label": 0
                },
                {
                    "sent": "And they said.",
                    "label": 0
                },
                {
                    "sent": "How can you tell that the community that you have is Israel?",
                    "label": 0
                },
                {
                    "sent": "Maybe the division into four subgroups is because you have his inner circle of friends on this outer circle of friends and additives in a way, right?",
                    "label": 0
                },
                {
                    "sent": "That's why, that's why I usually, that's why I usually show this slide.",
                    "label": 0
                },
                {
                    "sent": "It actually showed the same time here.",
                    "label": 0
                },
                {
                    "sent": "Which is really the beginning of everything, which is what they call a new iPod.",
                    "label": 0
                },
                {
                    "sent": "This community detection will test you.",
                    "label": 0
                },
                {
                    "sent": "You make an act of faith, and you say the topology allow you allows you to reduce the real groups.",
                    "label": 0
                },
                {
                    "sent": "But it's a strong assumption in many cases.",
                    "label": 0
                },
                {
                    "sent": "Maybe the real division in groups cannot be infer simply by topology, because the other information that you don't know that you cannot see from the topology of the graph, like weights or anything else.",
                    "label": 0
                },
                {
                    "sent": "That give you more indications about which nodes are really associated.",
                    "label": 0
                },
                {
                    "sent": "So if you assume this, everything else which I said is kind of consequences so you can do it.",
                    "label": 0
                },
                {
                    "sent": "You make this active phase and then you just forget about this, but then of course you have to strongly believe in this.",
                    "label": 0
                },
                {
                    "sent": "And like you said, is not always the case and we are in real systems, OK?",
                    "label": 0
                },
                {
                    "sent": "It's going to.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Direction of taking real graphs like yeah, it's going in this direction.",
                    "label": 0
                },
                {
                    "sent": "It's going this direction, but like I said I mean.",
                    "label": 0
                },
                {
                    "sent": "I got scared people do part of speech tagging, yeah?",
                    "label": 0
                },
                {
                    "sent": "And then you try and find the denounce the world.",
                    "label": 0
                },
                {
                    "sent": "You have a pretty fine clustering at 5.",
                    "label": 0
                },
                {
                    "sent": "Two detected by night.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but then in general and like I said, I mean I didn't want to give the wrong impression.",
                    "label": 0
                },
                {
                    "sent": "Didn't give the impression that it is a closed story that we're nearing the end or anything.",
                    "label": 0
                },
                {
                    "sent": "We're in the middle of a process with many more open problems, then satisfactory solutions.",
                    "label": 0
                },
                {
                    "sent": "In fact, even the problem of graph partitioning, which is 40 years old, is still not completely resolved.",
                    "label": 0
                },
                {
                    "sent": "So you know, you want to do it first in a systematic way before moving to these things.",
                    "label": 0
                },
                {
                    "sent": "Of course, it's important to include ways, especially in the kind of data that you may have in mind from economic correlation.",
                    "label": 0
                },
                {
                    "sent": "So very often my friend.",
                    "label": 0
                },
                {
                    "sent": "So Montania asked me, why don't you?",
                    "label": 0
                },
                {
                    "sent": "Split this thing because we can do it only with minimum spanning trees, which is what they usually do.",
                    "label": 0
                },
                {
                    "sent": "Perhaps not standard minimum spanning trees, special kind of trees, but always you know, kind of standard techniques from before.",
                    "label": 0
                },
                {
                    "sent": "And The thing is that you know this is this is really complicated problem because their networks for the correlations between financial data are full, so complete matrices are not sparse graphs right here, so there's no concept of having more links inside and outside.",
                    "label": 0
                },
                {
                    "sent": "You can do the same things for weights, but it doesn't work so well because usually weights are not so very different from each other.",
                    "label": 0
                },
                {
                    "sent": "Do not mention this linguistic.",
                    "label": 0
                },
                {
                    "sent": "And it split.",
                    "label": 0
                },
                {
                    "sent": "You can split yeah, so by this you said that in OB, so probably can tell me more.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I mean I didn't know about this set, so probably can tell me more about this.",
                    "label": 0
                },
                {
                    "sent": "The answer to your question was we have at the moment.",
                    "label": 0
                },
                {
                    "sent": "As far as I know.",
                    "label": 0
                },
                {
                    "sent": "But like I say, I'm happy to be wrong.",
                    "label": 0
                },
                {
                    "sent": "Three sets.",
                    "label": 0
                },
                {
                    "sent": "Try to do is send some script so wondered if you measure performed.",
                    "label": 0
                },
                {
                    "sent": "If you would use it.",
                    "label": 0
                },
                {
                    "sent": "OK so yeah.",
                    "label": 0
                },
                {
                    "sent": "Our biggest is graph.",
                    "label": 0
                },
                {
                    "sent": "1,000,000.",
                    "label": 0
                },
                {
                    "sent": "5,000,000 not.",
                    "label": 0
                },
                {
                    "sent": "Which means.",
                    "label": 0
                },
                {
                    "sent": "Yeah right to start with, so that's what I also believe, but also because I don't think there is an idea quality function and that the answer in generally depends on the system.",
                    "label": 0
                },
                {
                    "sent": "This is also another direction where the field is moving to.",
                    "label": 0
                },
                {
                    "sent": "Right now people are so ambitious and say, OK, I find the perfect algorithm works in any Case No matter what.",
                    "label": 0
                },
                {
                    "sent": "But this is just a wrong.",
                    "label": 0
                },
                {
                    "sent": "It's a wrong attitude.",
                    "label": 0
                },
                {
                    "sent": "Clearly, but you know it's not so clear how it will evolve.",
                    "label": 0
                },
                {
                    "sent": "It's lunchtime here.",
                    "label": 0
                },
                {
                    "sent": "Thanks to you.",
                    "label": 0
                }
            ]
        }
    }
}