{
    "id": "pi5owrcg54resmguvn5xxo4q6vly2gdb",
    "title": "Towards Evaluating Interactive Ontology Matching Tools",
    "info": {
        "author": [
            "Dominique Ritze, School of Business Informatics and Mathematics, University of Mannheim"
        ],
        "published": "July 8, 2013",
        "recorded": "May 2013",
        "category": [
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/eswc2013_ritze_interactive_ontology/",
    "segmentation": [
        [
            "Welcome everybody to my presentation today.",
            "The title is towards evaluating interactive Ontology matching tools an it's work together with power haiku.",
            "Paul Heyman's panhandling.",
            "Of course."
        ],
        [
            "Our first goal bit into ontology matching, but we had a very good introduction and a good overview about the existing techniques, but too shortly introduce it again.",
            "We have two ontologies and the goal of ontology matching.",
            "Specially now the automatic ontology matching is to measure ontologies.",
            "So we have the entities in both ontologies and we want to know which entity one counts autology corresponds to which entity in the other one.",
            "And so it's of course very time consuming task if a human performs it, that's why.",
            "Nice ontology matching systems have been developed.",
            "They are mostly automatic and they just take the two ontologies as input and the result is a alignment.",
            "Like shown here and the ontology matching systems use very different techniques.",
            "As we already heard in the last presentation.",
            "And the resulting alignment consists of the correspondences.",
            "We just say which entity corresponds to which entity, and there is a relation.",
            "So usually we have equivalence, but I can also be, for example, subsumption and then the correspondence also has a confidence value and this confidence value indicates how likely it is that this correspondence holds.",
            "Let's the situation."
        ],
        [
            "Um?",
            "So.",
            "When we now have another ontology matching system, the system can create another alignment containing other correspondence is of course some of them can be correct, some of them can be incorrect, and it's quite hard to decide which matching system is the best for certain task.",
            "So of course we have several evaluations, especially the ontology Alignment Evaluation Initiative, and we might have an idea which measure performs very good on certain tasks, but we.",
            "If you have a new task, it's quite hard to really decide which ones the best end.",
            "Now to make it even more complicated, what's about matching system that involve the user so their interactive matching systems outlook, also called semi automatic matching systems.",
            "And of course now is the question if the matching system involves the user, then it might be that the system can create a better alignment, better quality.",
            "But of course the human expert or a domain expert has some workload and how to evaluate this.",
            "How to deal with that?",
            "And this was exactly the question we faced.",
            "So the first question we had was does this interaction with a human or the main expert really improve the results of our ontology matching system?",
            "And of course, how can we evaluate this?",
            "In which measure should we take if there were several ones using or including a user interaction component, then which one is the best and the user interaction can differ in many ways.",
            "For example, much I can require.",
            "Certain correspondence is in the beginning of the matching process and then autonomously matches the ontologies.",
            "Other matching systems really include the user during the whole matching process and constantly ask the user.",
            "For example, for validation of correspondences and of course, the third possibility is that the user afterwards just correct the alignment.",
            "In this case, the matching system that not does not get the results of the user correction.",
            "So this was our motivation.",
            "What about this interaction in ontology matching?"
        ],
        [
            "So today I'm father talking about the semi automatic ontology matching, so a bit more former than the evaluation measure.",
            "So we introduced one evaluation measure which takes into account the user interaction as well as the quality of the resulting alignment.",
            "Then we implemented evaluation framework with this framework it should be possible to automatically evaluate such interactive tools, so we don't need the domain expert really to evaluate.",
            "The tourists can use it.",
            "With this we can use this framework and I'm sure some experiments and results, so the experiments are more.",
            "Until direction of use cases, so where can interactive ontology matching tools be used and where they are useful?"
        ],
        [
            "There are different types of user interactions.",
            "So the most common one is to ask the user for validation of a correspondence, so the ontology metric creates correspondence and just ask if this correspondence is correct or incorrect.",
            "And based on this information, the algorithm can try to learn of the information.",
            "Another interaction might be to ask for the definition of a relation between two entities.",
            "How much I might be quite sure that there is a relation between two entities, but it's not sure if it's really equivalent relation of its just assumption.",
            "So then another user interaction might be to just ask the user says equivalence relation is a subsumption and another possible type might be to complete.",
            "The correspondence, so if you know there must be left the match, I know there must be a corresponding entity Indiana Ontology an ask the user.",
            "Please provide me this entity and then again learns based on this decision.",
            "But we are facing now is a validation so then gets the most common one and we focus on that.",
            "But our experiments and especially our framework is not restricted on that before 1st.",
            "Experiments we focus on this one."
        ],
        [
            "So the semi automatic ontology matching most of you might know the ontology matching picture here.",
            "So we have the matching system gets us input to ontologies and optionally a first initial alignment.",
            "So, and as I repair meters that might be adapted by user person configuration files and we usually have some resources like external resources can be word, net or other.",
            "Resources and now what's new.",
            "In our end it returns the final alignment at the end after the matching process, but we now.",
            "Edit to have a semi automatic ontology matching is this part, so we have a domain expert and the domain expert gets from the matching system an alignment, so the alignment was just the hyper thesis of the alignment.",
            "This can contain one or more correspondence.",
            "Is then the user validates the correspondences and returns corrected alignment to matching system.",
            "And of course this can be a continuous process.",
            "During the whole matching process itself.",
            "So that's a semi automatic ontology matching."
        ],
        [
            "For the evaluation of such systems, we already heard that are several measures from information which we've like precision, recall, and F measure zero position 2.",
            "Each other the correctness and recall the completeness and F measure the combination of both, but of course they do not take the experts word load into account.",
            "They just said something about the quality of the resulting alignment.",
            "So in this case, if we face interactive ontology matching systems, we need to measure that really represents this trade off.",
            "The tradeoff between the quality of the resulting alignment and the amount of user interaction.",
            "What we did is to assign costs to each action.",
            "In this case, costs can be, for example money.",
            "So money for the.",
            "The money you pay for the domain expert.",
            "Of course, the time that I'm the domain expert needs also money.",
            "In case of you have a crowdsourcing algorithm or something like that where you can really measure how many money action costs for automatic evaluation you can also use whites.",
            "So this means we have just for each interaction you have a different white.",
            "That's just the simplification for the costs.",
            "Or if you have.",
            "Different costs and you need to compare the different matching systems.",
            "We also use why it's just 4.",
            "Simplification."
        ],
        [
            "So we introduced the special measure which can be used to compare the interactive Ontology matching systems.",
            "It is inspired by the Machine learning area, especially by active learning, where the learning curve is very important and so we plot the learning curve of the Earth measure relative to the costs that are consumed, and we assume that after each user interaction, the measure can give us the preliminary alignment.",
            "So the best alignment the match I've found so far.",
            "And then we can just plot the curve and we use normalized area under this curve as a measure and we normalize it so we can.",
            "Also we have a measure between zero and one.",
            "And altogether, if we have a high area under the learning curve, we can say that we have a high overall F measure and this is achieved by only a few user interactions.",
            "So we have a high F measure and only yeah, under the number of user interactions is low and that's what we thought might be a good measure."
        ],
        [
            "For this.",
            "Evaluation that's an example learning curve.",
            "We use the logarithmic scale for the costs because the costs of course often quite high and we want to reward systems that we quickly converge towards their highest F measure towards the file F measure in the of the alignment, and we have the F measure.",
            "And so this point means we have a F measure of F1 after the first user interaction with cost C1 and based on this we can of course computer area under this curve."
        ],
        [
            "So now we have a measure and we can directly compare matching systems.",
            "This measure of course it does not by now it does not take into account the different user interactions, we just focus on the validation.",
            "But we evaluated.",
            "We implemented a framework.",
            "So again it's a picture of the matching system and now we have an automatic Oracle.",
            "So we replaced the domain expert by automatic Oracle just because we would like to have an.",
            "Automatic evaluation and we can use an automatic Oracle whenever we have a reference alignment.",
            "So reference a line containing all the correct correspondences.",
            "And with this reference alignment to automatic or worker can respond to the matching system and kind of cause sandwich correspondences in the hypo thesis alignment are true and which ones are incorrect.",
            "And then to our Echo tells our evaluation system how many user interactions have been performed and the evaluation system also gets the final alignment as well as the preliminary alignments.",
            "If you if the user if the meter does not deliver any preliminary alignments, then we assume that the preliminary alignments are empty until the final alignment created.",
            "And of course, then we can apply evaluation quality measures like our area under the curve measure."
        ],
        [
            "The experience we performed.",
            "So it's not really a comparison of different interactive teologi matching system.",
            "He rather like to show where on where the semi automatic ontology matching can improve through sales.",
            "So it's a was our motivation and so of course we used our framework to evaluate us.",
            "So we show that our framework works and we have two experiments.",
            "First measure selection and setting the measure parametrization.",
            "So in both experiments, the idea was that both our task for user, which can be quite hard.",
            "So much selection means we have a specific task and we have a lot of matching systems and we just want to pick the matching system which is best for this task.",
            "Because if you do not have a quite big knowledge about the matching system can be hard to decide and the second demetra parametrisation so bit similar, we have an ontology matchup and the ontology measure has some configuration.",
            "And the user can set this configuration.",
            "And of course, if you do not have.",
            "If you're not experienced using this measure, this can be quite hard for certain tasks to decide which parameters are the best.",
            "So."
        ],
        [
            "So for the metal selection, the idea was that we let the user verify correspond correspondence is and exactly these correspondences, which are found by at least one now, but not by all matching system, because these are usually correspondences that are the critical ones that decide whether the alignment qualities will be high or low.",
            "And based on this verification, we can create a ranking so we can rank each measure.",
            "And we use the measure which has the highest rank 2, then match our ontologies for the ranking.",
            "We decided to try out two possibilities because we're not quite sure which one might be the best one is too.",
            "Compute to F measure.",
            "On the correspondence is to user verified, so for one measure the user might worry, have verified 5 correspondences, and then we compute partial F measure on this alignment consisting of five correspondences and the second possibility is to use scoring.",
            "So measure gets one point for correspondence is correct and minus one point if it's incorrect.",
            "And again we use the API conference track so the AI match us for the first experiment used three match us, so code you lock map on Optima because they perform quite good at this conference track and they're quite different.",
            "For example Cody.",
            "Defines the matching problem as optimization problem.",
            "And, um.",
            "Yeah, optimal uses whether traditional matching techniques."
        ],
        [
            "The results I hope it's possible to see, so we have a average F measure on the Y axis and the number of interactions.",
            "So again, this is the number of logarithmic scale as we introduce it.",
            "In this case we do not have the costs because we only have one type of interaction and we say this type of interaction has the cost one.",
            "That's why we have the number of interactions and we have three baselines for baselines.",
            "The first is the F human.",
            "So this means it's just the F measure of the alignment you get when you just take the correspondences to user evaluated.",
            "So of course I measure should be about this baseline, otherwise the match is not able to really exploit the information from the user.",
            "The second one is the worst selection, so if we always take the worst measure for this case and we have the best and then the average, less our baselines.",
            "And again, the task is to find the measure which is the best one for the certain task.",
            "And if we have a look, we have the interactive selection yrf measure and the interactive section.",
            "Why are scores was quite nice.",
            "After two interactions, we can beat the average baseline, so we only need two interactions and we know better which matter or we know quite good which measure is better.",
            "And of course, if we quote increase the number of interactions.",
            "We get very close to this best selection, so we only need a user to ask the user to verify the enter the correspondences and then we get a very good.",
            "Idea which match are really to take for a certain task and in this case the user does not need to know about matching system.",
            "The user just verifies the correspondences and then gets to know which matches the best.",
            "We also expanded this to."
        ],
        [
            "Sing Systems participating at the conference.",
            "Back in this case, 18 matching system.",
            "Of course, now there are some matching systems among them jar not quite good, or which return an alignment containing many incorrect correspondences.",
            "That's of course, why.",
            "Now, whether more number of interactions because we have more correspondences to verify in this case, and now we see.",
            "The interactive selection via F measure is now has now a similar curve an at the end it's very close to the best selection, but the selection bias scores is not that cold.",
            "Can even be outperformed by the F human baseline.",
            "So this means that the score approach is not the best one.",
            "And so the reason is just if a metric just provides an alignment with only a few correspondences that are truly correct.",
            "Then the match I might get a very high score, but other metrics trying to together high recall and containing having alignment containing many incorrect correspondence getting a lower score, and that's why.",
            "The selection where scores is not suitable in this case, that were the results for the Metro selection, but for us it was quite nice to see that only a few user interactions are necessary to really get a good decision which matches the best one for certain task."
        ],
        [
            "The match up Homer translation.",
            "So we try to determine optimal parimeter by letting again the user verify correspondences.",
            "And here we just use the threshold.",
            "The threshold is one of the most common para meter where you cut off the alignment.",
            "So you say correspondence is with the confidence value above.",
            "Below the threshold are not included in the final alignment which returned.",
            "And again we present the mappings to user and we have a certain search window W around this were short and it's somehow like a binary search.",
            "So we start with zero 0.5 and one and then we use the search window.",
            "So we use the for example if the search window is one, we take the closest.",
            "Cause the correspondence with the closest fresh with the closest confidence value to the threshold, and then we see is 0 zero point 5 or 1.5 one .1 the best threshold.",
            "Then we take this threshold and we continue with this threshold and take the intervals between the threshold to further work on and we used to measure easy.",
            "Just have an adjustable threshold where we could very good.",
            "Perform this test and again the conference track."
        ],
        [
            "This results.",
            "What we saw was that again, we can use this to really find an optimal para meter for arthritis or optimal threshold.",
            "So we have again the the the F human.",
            "We have a default threshold with this given by the developers and the best threshold.",
            "And as you can see we have window size of 1, so if we only take the correspondence with the closest confidence value and that this can correspondence be evaluated by the user, then OK, there might be some.",
            "Some incorrect results because it's only the closest one.",
            "If we take five of them, we get a very good overview, which is really the best, but of course there are a lot of more interactions necessary.",
            "As you can see here, but at the end they are all close to the Best Western.",
            "Also, with this method we again can use or can apply the user interaction.",
            "We can let the user verify the correspondence is to find the optimal pyramid."
        ],
        [
            "So.",
            "As a conclusion, as we know, there was no evaluation for Intellij Interactive Ontology measure, so in this case an automatic evaluation of this tools the measures which are used for ontology measures, do not consider the trade opportunity quality and the amount of user interaction.",
            "That's why we introduced the area and the learning curve.",
            "Measure our framework really fully automatically evaluates.",
            "Such systems, as long as, of course we have a reference alignment and Metro selection.",
            "Much appreciation.",
            "Our use cases where we show that the interactive matching can improve the results, and we can use the interactive matching for this task."
        ],
        [
            "And just for future work, so we are hopefully planning OEI Interactive Evolution Track where we really perform this evaluation with level interactive matching tools.",
            "Of course we can think about other user interactions, especially if we think about complex correspondences with more than two entities involved.",
            "We go further, we need to write for different interactions.",
            "For example, some interaction might be harder for domain experts, another one.",
            "And there might be possibilities to to further improve the user interactions.",
            "So for example, user just evaluates correspondences with the same entities, so they only have to look in the ontology for this entity.",
            "And can get better or solve the problem faster.",
            "And of course we are not measuring any user experience so far.",
            "There might be a difference in the user experience, but we are not considering that right now so."
        ],
        [
            "Oh, thank you.",
            "Thank you for the talk.",
            "I had a question about rather clarification.",
            "You mentioned that you want to normalize the area under curve.",
            "What do you would you?",
            "Would you take to do the normalization if you compare different matching systems then we would take the highest amount of interactions.",
            "No.",
            "Well, the point.",
            "The point is that so it will be contextual.",
            "So from one year to another you will not be able to to compare.",
            "And Moreover, you've got two ways of doing what you say, which is to normalize by the best at each time.",
            "Are the best overall the best area under curve that you obtain?",
            "OK, OK and then if you take the best at each time then you are creating an artificial area number curve.",
            "You will never know one will have one.",
            "And so for all these reasons, an unless you have some more precise reason to do this, I think the the best way to do this is to normalize by by one at each step.",
            "But it's a big curve because it is stable.",
            "You will never beat it and also.",
            "OK. You know if it if your result depends on the number of interaction that you have.",
            "If you want to compare stuff that are cut at different moments.",
            "Then it will be compared with a full square each time.",
            "That's a suggestion.",
            "Yeah, thank you for market for you.",
            "Will you evaluating the matching systems?",
            "We of course have to we think this normalization.",
            "Additional questions.",
            "Nobody's waving.",
            "So maybe I can ask just a question that you were planning to add this to.",
            "This ontology Alignment evaluation initiative you have any any plans of the details of how you would set that up?",
            "Yes.",
            "So we hopefully we try to implement it using the Seals client, so it's currently used to evaluate the automatic system and we hope we can extend this client so the measure implements just an interface and we can communicate with a measure based on this interface and then it's yeah I hope then it's quite easy and we can get all the information we need an it's also easy for the.",
            "Developers.",
            "Anyone else thought of a question?",
            "Yes, OK at the bank.",
            "2013 would be an accurate his hijacking the question.",
            "Thank you very much for your nice talk.",
            "I'm not quite sure about how do you use the feedback for the experiment and in your presentation you mentioned about 3 systems are the how do you use the feedback for this this systems?",
            "So we had a feedback can be used.",
            "By the systems as they like so.",
            "They can implement several methods based on this feedback.",
            "For example, learning methods.",
            "And so, of course, then we can see which method is also the best one, or which yeah, which is, which is quite good for the user interaction to learn of.",
            "K while we have maybe final question or comment, the last presenter may make his way forward.",
            "Any last question, yeah.",
            "Hello, maybe you're facing the question because the ontology matching is still quite new to me.",
            "So my question will be very basic.",
            "What is the advantages and disadvantages of using interactive ontology matching instead of the Atom?",
            "The fully automatic one?",
            "Oh can I don't understand it because of what?",
            "What are the advantages and disadvantages of using the interactive ontology matching instead of the maybe fully automatic Internet facing?",
            "So we think that the fully automatic approaches just have an upper bound, so there somehow.",
            "You can't get a better quality of the alignments and with the help of the domain experts so you can get it to achieve a better quality.",
            "So that's exactly what you faced before.",
            "So if you all, if it's possible to achieve 100.",
            "Percent of correct 1/2.",
            "So if it's always if you can get the best one and we think that if you include the user, you can even make better than adjust fully automatic approach.",
            "I think he's asking for advantages.",
            "These disadvantages disadvantages of course you have to include the user and that's the workload of the domain expert.",
            "Yep, OK. OK, let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Welcome everybody to my presentation today.",
                    "label": 0
                },
                {
                    "sent": "The title is towards evaluating interactive Ontology matching tools an it's work together with power haiku.",
                    "label": 1
                },
                {
                    "sent": "Paul Heyman's panhandling.",
                    "label": 0
                },
                {
                    "sent": "Of course.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our first goal bit into ontology matching, but we had a very good introduction and a good overview about the existing techniques, but too shortly introduce it again.",
                    "label": 0
                },
                {
                    "sent": "We have two ontologies and the goal of ontology matching.",
                    "label": 0
                },
                {
                    "sent": "Specially now the automatic ontology matching is to measure ontologies.",
                    "label": 1
                },
                {
                    "sent": "So we have the entities in both ontologies and we want to know which entity one counts autology corresponds to which entity in the other one.",
                    "label": 0
                },
                {
                    "sent": "And so it's of course very time consuming task if a human performs it, that's why.",
                    "label": 0
                },
                {
                    "sent": "Nice ontology matching systems have been developed.",
                    "label": 0
                },
                {
                    "sent": "They are mostly automatic and they just take the two ontologies as input and the result is a alignment.",
                    "label": 0
                },
                {
                    "sent": "Like shown here and the ontology matching systems use very different techniques.",
                    "label": 0
                },
                {
                    "sent": "As we already heard in the last presentation.",
                    "label": 0
                },
                {
                    "sent": "And the resulting alignment consists of the correspondences.",
                    "label": 0
                },
                {
                    "sent": "We just say which entity corresponds to which entity, and there is a relation.",
                    "label": 0
                },
                {
                    "sent": "So usually we have equivalence, but I can also be, for example, subsumption and then the correspondence also has a confidence value and this confidence value indicates how likely it is that this correspondence holds.",
                    "label": 0
                },
                {
                    "sent": "Let's the situation.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When we now have another ontology matching system, the system can create another alignment containing other correspondence is of course some of them can be correct, some of them can be incorrect, and it's quite hard to decide which matching system is the best for certain task.",
                    "label": 0
                },
                {
                    "sent": "So of course we have several evaluations, especially the ontology Alignment Evaluation Initiative, and we might have an idea which measure performs very good on certain tasks, but we.",
                    "label": 0
                },
                {
                    "sent": "If you have a new task, it's quite hard to really decide which ones the best end.",
                    "label": 0
                },
                {
                    "sent": "Now to make it even more complicated, what's about matching system that involve the user so their interactive matching systems outlook, also called semi automatic matching systems.",
                    "label": 0
                },
                {
                    "sent": "And of course now is the question if the matching system involves the user, then it might be that the system can create a better alignment, better quality.",
                    "label": 0
                },
                {
                    "sent": "But of course the human expert or a domain expert has some workload and how to evaluate this.",
                    "label": 0
                },
                {
                    "sent": "How to deal with that?",
                    "label": 0
                },
                {
                    "sent": "And this was exactly the question we faced.",
                    "label": 0
                },
                {
                    "sent": "So the first question we had was does this interaction with a human or the main expert really improve the results of our ontology matching system?",
                    "label": 0
                },
                {
                    "sent": "And of course, how can we evaluate this?",
                    "label": 0
                },
                {
                    "sent": "In which measure should we take if there were several ones using or including a user interaction component, then which one is the best and the user interaction can differ in many ways.",
                    "label": 0
                },
                {
                    "sent": "For example, much I can require.",
                    "label": 0
                },
                {
                    "sent": "Certain correspondence is in the beginning of the matching process and then autonomously matches the ontologies.",
                    "label": 0
                },
                {
                    "sent": "Other matching systems really include the user during the whole matching process and constantly ask the user.",
                    "label": 0
                },
                {
                    "sent": "For example, for validation of correspondences and of course, the third possibility is that the user afterwards just correct the alignment.",
                    "label": 0
                },
                {
                    "sent": "In this case, the matching system that not does not get the results of the user correction.",
                    "label": 0
                },
                {
                    "sent": "So this was our motivation.",
                    "label": 0
                },
                {
                    "sent": "What about this interaction in ontology matching?",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So today I'm father talking about the semi automatic ontology matching, so a bit more former than the evaluation measure.",
                    "label": 1
                },
                {
                    "sent": "So we introduced one evaluation measure which takes into account the user interaction as well as the quality of the resulting alignment.",
                    "label": 0
                },
                {
                    "sent": "Then we implemented evaluation framework with this framework it should be possible to automatically evaluate such interactive tools, so we don't need the domain expert really to evaluate.",
                    "label": 0
                },
                {
                    "sent": "The tourists can use it.",
                    "label": 0
                },
                {
                    "sent": "With this we can use this framework and I'm sure some experiments and results, so the experiments are more.",
                    "label": 1
                },
                {
                    "sent": "Until direction of use cases, so where can interactive ontology matching tools be used and where they are useful?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are different types of user interactions.",
                    "label": 0
                },
                {
                    "sent": "So the most common one is to ask the user for validation of a correspondence, so the ontology metric creates correspondence and just ask if this correspondence is correct or incorrect.",
                    "label": 1
                },
                {
                    "sent": "And based on this information, the algorithm can try to learn of the information.",
                    "label": 0
                },
                {
                    "sent": "Another interaction might be to ask for the definition of a relation between two entities.",
                    "label": 0
                },
                {
                    "sent": "How much I might be quite sure that there is a relation between two entities, but it's not sure if it's really equivalent relation of its just assumption.",
                    "label": 0
                },
                {
                    "sent": "So then another user interaction might be to just ask the user says equivalence relation is a subsumption and another possible type might be to complete.",
                    "label": 0
                },
                {
                    "sent": "The correspondence, so if you know there must be left the match, I know there must be a corresponding entity Indiana Ontology an ask the user.",
                    "label": 0
                },
                {
                    "sent": "Please provide me this entity and then again learns based on this decision.",
                    "label": 0
                },
                {
                    "sent": "But we are facing now is a validation so then gets the most common one and we focus on that.",
                    "label": 0
                },
                {
                    "sent": "But our experiments and especially our framework is not restricted on that before 1st.",
                    "label": 0
                },
                {
                    "sent": "Experiments we focus on this one.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the semi automatic ontology matching most of you might know the ontology matching picture here.",
                    "label": 1
                },
                {
                    "sent": "So we have the matching system gets us input to ontologies and optionally a first initial alignment.",
                    "label": 0
                },
                {
                    "sent": "So, and as I repair meters that might be adapted by user person configuration files and we usually have some resources like external resources can be word, net or other.",
                    "label": 0
                },
                {
                    "sent": "Resources and now what's new.",
                    "label": 0
                },
                {
                    "sent": "In our end it returns the final alignment at the end after the matching process, but we now.",
                    "label": 0
                },
                {
                    "sent": "Edit to have a semi automatic ontology matching is this part, so we have a domain expert and the domain expert gets from the matching system an alignment, so the alignment was just the hyper thesis of the alignment.",
                    "label": 0
                },
                {
                    "sent": "This can contain one or more correspondence.",
                    "label": 0
                },
                {
                    "sent": "Is then the user validates the correspondences and returns corrected alignment to matching system.",
                    "label": 0
                },
                {
                    "sent": "And of course this can be a continuous process.",
                    "label": 0
                },
                {
                    "sent": "During the whole matching process itself.",
                    "label": 0
                },
                {
                    "sent": "So that's a semi automatic ontology matching.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the evaluation of such systems, we already heard that are several measures from information which we've like precision, recall, and F measure zero position 2.",
                    "label": 0
                },
                {
                    "sent": "Each other the correctness and recall the completeness and F measure the combination of both, but of course they do not take the experts word load into account.",
                    "label": 1
                },
                {
                    "sent": "They just said something about the quality of the resulting alignment.",
                    "label": 0
                },
                {
                    "sent": "So in this case, if we face interactive ontology matching systems, we need to measure that really represents this trade off.",
                    "label": 0
                },
                {
                    "sent": "The tradeoff between the quality of the resulting alignment and the amount of user interaction.",
                    "label": 1
                },
                {
                    "sent": "What we did is to assign costs to each action.",
                    "label": 0
                },
                {
                    "sent": "In this case, costs can be, for example money.",
                    "label": 0
                },
                {
                    "sent": "So money for the.",
                    "label": 0
                },
                {
                    "sent": "The money you pay for the domain expert.",
                    "label": 0
                },
                {
                    "sent": "Of course, the time that I'm the domain expert needs also money.",
                    "label": 0
                },
                {
                    "sent": "In case of you have a crowdsourcing algorithm or something like that where you can really measure how many money action costs for automatic evaluation you can also use whites.",
                    "label": 0
                },
                {
                    "sent": "So this means we have just for each interaction you have a different white.",
                    "label": 0
                },
                {
                    "sent": "That's just the simplification for the costs.",
                    "label": 0
                },
                {
                    "sent": "Or if you have.",
                    "label": 0
                },
                {
                    "sent": "Different costs and you need to compare the different matching systems.",
                    "label": 0
                },
                {
                    "sent": "We also use why it's just 4.",
                    "label": 0
                },
                {
                    "sent": "Simplification.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we introduced the special measure which can be used to compare the interactive Ontology matching systems.",
                    "label": 0
                },
                {
                    "sent": "It is inspired by the Machine learning area, especially by active learning, where the learning curve is very important and so we plot the learning curve of the Earth measure relative to the costs that are consumed, and we assume that after each user interaction, the measure can give us the preliminary alignment.",
                    "label": 1
                },
                {
                    "sent": "So the best alignment the match I've found so far.",
                    "label": 0
                },
                {
                    "sent": "And then we can just plot the curve and we use normalized area under this curve as a measure and we normalize it so we can.",
                    "label": 0
                },
                {
                    "sent": "Also we have a measure between zero and one.",
                    "label": 0
                },
                {
                    "sent": "And altogether, if we have a high area under the learning curve, we can say that we have a high overall F measure and this is achieved by only a few user interactions.",
                    "label": 1
                },
                {
                    "sent": "So we have a high F measure and only yeah, under the number of user interactions is low and that's what we thought might be a good measure.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For this.",
                    "label": 0
                },
                {
                    "sent": "Evaluation that's an example learning curve.",
                    "label": 1
                },
                {
                    "sent": "We use the logarithmic scale for the costs because the costs of course often quite high and we want to reward systems that we quickly converge towards their highest F measure towards the file F measure in the of the alignment, and we have the F measure.",
                    "label": 0
                },
                {
                    "sent": "And so this point means we have a F measure of F1 after the first user interaction with cost C1 and based on this we can of course computer area under this curve.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we have a measure and we can directly compare matching systems.",
                    "label": 0
                },
                {
                    "sent": "This measure of course it does not by now it does not take into account the different user interactions, we just focus on the validation.",
                    "label": 0
                },
                {
                    "sent": "But we evaluated.",
                    "label": 0
                },
                {
                    "sent": "We implemented a framework.",
                    "label": 0
                },
                {
                    "sent": "So again it's a picture of the matching system and now we have an automatic Oracle.",
                    "label": 0
                },
                {
                    "sent": "So we replaced the domain expert by automatic Oracle just because we would like to have an.",
                    "label": 0
                },
                {
                    "sent": "Automatic evaluation and we can use an automatic Oracle whenever we have a reference alignment.",
                    "label": 0
                },
                {
                    "sent": "So reference a line containing all the correct correspondences.",
                    "label": 0
                },
                {
                    "sent": "And with this reference alignment to automatic or worker can respond to the matching system and kind of cause sandwich correspondences in the hypo thesis alignment are true and which ones are incorrect.",
                    "label": 0
                },
                {
                    "sent": "And then to our Echo tells our evaluation system how many user interactions have been performed and the evaluation system also gets the final alignment as well as the preliminary alignments.",
                    "label": 0
                },
                {
                    "sent": "If you if the user if the meter does not deliver any preliminary alignments, then we assume that the preliminary alignments are empty until the final alignment created.",
                    "label": 0
                },
                {
                    "sent": "And of course, then we can apply evaluation quality measures like our area under the curve measure.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The experience we performed.",
                    "label": 0
                },
                {
                    "sent": "So it's not really a comparison of different interactive teologi matching system.",
                    "label": 0
                },
                {
                    "sent": "He rather like to show where on where the semi automatic ontology matching can improve through sales.",
                    "label": 0
                },
                {
                    "sent": "So it's a was our motivation and so of course we used our framework to evaluate us.",
                    "label": 0
                },
                {
                    "sent": "So we show that our framework works and we have two experiments.",
                    "label": 0
                },
                {
                    "sent": "First measure selection and setting the measure parametrization.",
                    "label": 0
                },
                {
                    "sent": "So in both experiments, the idea was that both our task for user, which can be quite hard.",
                    "label": 0
                },
                {
                    "sent": "So much selection means we have a specific task and we have a lot of matching systems and we just want to pick the matching system which is best for this task.",
                    "label": 0
                },
                {
                    "sent": "Because if you do not have a quite big knowledge about the matching system can be hard to decide and the second demetra parametrisation so bit similar, we have an ontology matchup and the ontology measure has some configuration.",
                    "label": 0
                },
                {
                    "sent": "And the user can set this configuration.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you do not have.",
                    "label": 0
                },
                {
                    "sent": "If you're not experienced using this measure, this can be quite hard for certain tasks to decide which parameters are the best.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for the metal selection, the idea was that we let the user verify correspond correspondence is and exactly these correspondences, which are found by at least one now, but not by all matching system, because these are usually correspondences that are the critical ones that decide whether the alignment qualities will be high or low.",
                    "label": 1
                },
                {
                    "sent": "And based on this verification, we can create a ranking so we can rank each measure.",
                    "label": 0
                },
                {
                    "sent": "And we use the measure which has the highest rank 2, then match our ontologies for the ranking.",
                    "label": 0
                },
                {
                    "sent": "We decided to try out two possibilities because we're not quite sure which one might be the best one is too.",
                    "label": 0
                },
                {
                    "sent": "Compute to F measure.",
                    "label": 0
                },
                {
                    "sent": "On the correspondence is to user verified, so for one measure the user might worry, have verified 5 correspondences, and then we compute partial F measure on this alignment consisting of five correspondences and the second possibility is to use scoring.",
                    "label": 0
                },
                {
                    "sent": "So measure gets one point for correspondence is correct and minus one point if it's incorrect.",
                    "label": 0
                },
                {
                    "sent": "And again we use the API conference track so the AI match us for the first experiment used three match us, so code you lock map on Optima because they perform quite good at this conference track and they're quite different.",
                    "label": 0
                },
                {
                    "sent": "For example Cody.",
                    "label": 0
                },
                {
                    "sent": "Defines the matching problem as optimization problem.",
                    "label": 0
                },
                {
                    "sent": "And, um.",
                    "label": 0
                },
                {
                    "sent": "Yeah, optimal uses whether traditional matching techniques.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The results I hope it's possible to see, so we have a average F measure on the Y axis and the number of interactions.",
                    "label": 0
                },
                {
                    "sent": "So again, this is the number of logarithmic scale as we introduce it.",
                    "label": 0
                },
                {
                    "sent": "In this case we do not have the costs because we only have one type of interaction and we say this type of interaction has the cost one.",
                    "label": 0
                },
                {
                    "sent": "That's why we have the number of interactions and we have three baselines for baselines.",
                    "label": 0
                },
                {
                    "sent": "The first is the F human.",
                    "label": 0
                },
                {
                    "sent": "So this means it's just the F measure of the alignment you get when you just take the correspondences to user evaluated.",
                    "label": 0
                },
                {
                    "sent": "So of course I measure should be about this baseline, otherwise the match is not able to really exploit the information from the user.",
                    "label": 0
                },
                {
                    "sent": "The second one is the worst selection, so if we always take the worst measure for this case and we have the best and then the average, less our baselines.",
                    "label": 0
                },
                {
                    "sent": "And again, the task is to find the measure which is the best one for the certain task.",
                    "label": 0
                },
                {
                    "sent": "And if we have a look, we have the interactive selection yrf measure and the interactive section.",
                    "label": 0
                },
                {
                    "sent": "Why are scores was quite nice.",
                    "label": 0
                },
                {
                    "sent": "After two interactions, we can beat the average baseline, so we only need two interactions and we know better which matter or we know quite good which measure is better.",
                    "label": 0
                },
                {
                    "sent": "And of course, if we quote increase the number of interactions.",
                    "label": 0
                },
                {
                    "sent": "We get very close to this best selection, so we only need a user to ask the user to verify the enter the correspondences and then we get a very good.",
                    "label": 0
                },
                {
                    "sent": "Idea which match are really to take for a certain task and in this case the user does not need to know about matching system.",
                    "label": 0
                },
                {
                    "sent": "The user just verifies the correspondences and then gets to know which matches the best.",
                    "label": 0
                },
                {
                    "sent": "We also expanded this to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sing Systems participating at the conference.",
                    "label": 0
                },
                {
                    "sent": "Back in this case, 18 matching system.",
                    "label": 0
                },
                {
                    "sent": "Of course, now there are some matching systems among them jar not quite good, or which return an alignment containing many incorrect correspondences.",
                    "label": 0
                },
                {
                    "sent": "That's of course, why.",
                    "label": 0
                },
                {
                    "sent": "Now, whether more number of interactions because we have more correspondences to verify in this case, and now we see.",
                    "label": 0
                },
                {
                    "sent": "The interactive selection via F measure is now has now a similar curve an at the end it's very close to the best selection, but the selection bias scores is not that cold.",
                    "label": 0
                },
                {
                    "sent": "Can even be outperformed by the F human baseline.",
                    "label": 0
                },
                {
                    "sent": "So this means that the score approach is not the best one.",
                    "label": 0
                },
                {
                    "sent": "And so the reason is just if a metric just provides an alignment with only a few correspondences that are truly correct.",
                    "label": 0
                },
                {
                    "sent": "Then the match I might get a very high score, but other metrics trying to together high recall and containing having alignment containing many incorrect correspondence getting a lower score, and that's why.",
                    "label": 0
                },
                {
                    "sent": "The selection where scores is not suitable in this case, that were the results for the Metro selection, but for us it was quite nice to see that only a few user interactions are necessary to really get a good decision which matches the best one for certain task.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The match up Homer translation.",
                    "label": 0
                },
                {
                    "sent": "So we try to determine optimal parimeter by letting again the user verify correspondences.",
                    "label": 1
                },
                {
                    "sent": "And here we just use the threshold.",
                    "label": 0
                },
                {
                    "sent": "The threshold is one of the most common para meter where you cut off the alignment.",
                    "label": 0
                },
                {
                    "sent": "So you say correspondence is with the confidence value above.",
                    "label": 0
                },
                {
                    "sent": "Below the threshold are not included in the final alignment which returned.",
                    "label": 0
                },
                {
                    "sent": "And again we present the mappings to user and we have a certain search window W around this were short and it's somehow like a binary search.",
                    "label": 1
                },
                {
                    "sent": "So we start with zero 0.5 and one and then we use the search window.",
                    "label": 0
                },
                {
                    "sent": "So we use the for example if the search window is one, we take the closest.",
                    "label": 1
                },
                {
                    "sent": "Cause the correspondence with the closest fresh with the closest confidence value to the threshold, and then we see is 0 zero point 5 or 1.5 one .1 the best threshold.",
                    "label": 1
                },
                {
                    "sent": "Then we take this threshold and we continue with this threshold and take the intervals between the threshold to further work on and we used to measure easy.",
                    "label": 0
                },
                {
                    "sent": "Just have an adjustable threshold where we could very good.",
                    "label": 0
                },
                {
                    "sent": "Perform this test and again the conference track.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This results.",
                    "label": 0
                },
                {
                    "sent": "What we saw was that again, we can use this to really find an optimal para meter for arthritis or optimal threshold.",
                    "label": 0
                },
                {
                    "sent": "So we have again the the the F human.",
                    "label": 0
                },
                {
                    "sent": "We have a default threshold with this given by the developers and the best threshold.",
                    "label": 0
                },
                {
                    "sent": "And as you can see we have window size of 1, so if we only take the correspondence with the closest confidence value and that this can correspondence be evaluated by the user, then OK, there might be some.",
                    "label": 0
                },
                {
                    "sent": "Some incorrect results because it's only the closest one.",
                    "label": 0
                },
                {
                    "sent": "If we take five of them, we get a very good overview, which is really the best, but of course there are a lot of more interactions necessary.",
                    "label": 0
                },
                {
                    "sent": "As you can see here, but at the end they are all close to the Best Western.",
                    "label": 0
                },
                {
                    "sent": "Also, with this method we again can use or can apply the user interaction.",
                    "label": 0
                },
                {
                    "sent": "We can let the user verify the correspondence is to find the optimal pyramid.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "As a conclusion, as we know, there was no evaluation for Intellij Interactive Ontology measure, so in this case an automatic evaluation of this tools the measures which are used for ontology measures, do not consider the trade opportunity quality and the amount of user interaction.",
                    "label": 1
                },
                {
                    "sent": "That's why we introduced the area and the learning curve.",
                    "label": 0
                },
                {
                    "sent": "Measure our framework really fully automatically evaluates.",
                    "label": 0
                },
                {
                    "sent": "Such systems, as long as, of course we have a reference alignment and Metro selection.",
                    "label": 0
                },
                {
                    "sent": "Much appreciation.",
                    "label": 0
                },
                {
                    "sent": "Our use cases where we show that the interactive matching can improve the results, and we can use the interactive matching for this task.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And just for future work, so we are hopefully planning OEI Interactive Evolution Track where we really perform this evaluation with level interactive matching tools.",
                    "label": 0
                },
                {
                    "sent": "Of course we can think about other user interactions, especially if we think about complex correspondences with more than two entities involved.",
                    "label": 0
                },
                {
                    "sent": "We go further, we need to write for different interactions.",
                    "label": 1
                },
                {
                    "sent": "For example, some interaction might be harder for domain experts, another one.",
                    "label": 1
                },
                {
                    "sent": "And there might be possibilities to to further improve the user interactions.",
                    "label": 1
                },
                {
                    "sent": "So for example, user just evaluates correspondences with the same entities, so they only have to look in the ontology for this entity.",
                    "label": 0
                },
                {
                    "sent": "And can get better or solve the problem faster.",
                    "label": 0
                },
                {
                    "sent": "And of course we are not measuring any user experience so far.",
                    "label": 0
                },
                {
                    "sent": "There might be a difference in the user experience, but we are not considering that right now so.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh, thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you for the talk.",
                    "label": 1
                },
                {
                    "sent": "I had a question about rather clarification.",
                    "label": 0
                },
                {
                    "sent": "You mentioned that you want to normalize the area under curve.",
                    "label": 0
                },
                {
                    "sent": "What do you would you?",
                    "label": 0
                },
                {
                    "sent": "Would you take to do the normalization if you compare different matching systems then we would take the highest amount of interactions.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Well, the point.",
                    "label": 0
                },
                {
                    "sent": "The point is that so it will be contextual.",
                    "label": 0
                },
                {
                    "sent": "So from one year to another you will not be able to to compare.",
                    "label": 0
                },
                {
                    "sent": "And Moreover, you've got two ways of doing what you say, which is to normalize by the best at each time.",
                    "label": 0
                },
                {
                    "sent": "Are the best overall the best area under curve that you obtain?",
                    "label": 0
                },
                {
                    "sent": "OK, OK and then if you take the best at each time then you are creating an artificial area number curve.",
                    "label": 0
                },
                {
                    "sent": "You will never know one will have one.",
                    "label": 0
                },
                {
                    "sent": "And so for all these reasons, an unless you have some more precise reason to do this, I think the the best way to do this is to normalize by by one at each step.",
                    "label": 0
                },
                {
                    "sent": "But it's a big curve because it is stable.",
                    "label": 0
                },
                {
                    "sent": "You will never beat it and also.",
                    "label": 0
                },
                {
                    "sent": "OK. You know if it if your result depends on the number of interaction that you have.",
                    "label": 0
                },
                {
                    "sent": "If you want to compare stuff that are cut at different moments.",
                    "label": 0
                },
                {
                    "sent": "Then it will be compared with a full square each time.",
                    "label": 0
                },
                {
                    "sent": "That's a suggestion.",
                    "label": 0
                },
                {
                    "sent": "Yeah, thank you for market for you.",
                    "label": 0
                },
                {
                    "sent": "Will you evaluating the matching systems?",
                    "label": 0
                },
                {
                    "sent": "We of course have to we think this normalization.",
                    "label": 0
                },
                {
                    "sent": "Additional questions.",
                    "label": 0
                },
                {
                    "sent": "Nobody's waving.",
                    "label": 0
                },
                {
                    "sent": "So maybe I can ask just a question that you were planning to add this to.",
                    "label": 0
                },
                {
                    "sent": "This ontology Alignment evaluation initiative you have any any plans of the details of how you would set that up?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "So we hopefully we try to implement it using the Seals client, so it's currently used to evaluate the automatic system and we hope we can extend this client so the measure implements just an interface and we can communicate with a measure based on this interface and then it's yeah I hope then it's quite easy and we can get all the information we need an it's also easy for the.",
                    "label": 0
                },
                {
                    "sent": "Developers.",
                    "label": 0
                },
                {
                    "sent": "Anyone else thought of a question?",
                    "label": 0
                },
                {
                    "sent": "Yes, OK at the bank.",
                    "label": 0
                },
                {
                    "sent": "2013 would be an accurate his hijacking the question.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for your nice talk.",
                    "label": 0
                },
                {
                    "sent": "I'm not quite sure about how do you use the feedback for the experiment and in your presentation you mentioned about 3 systems are the how do you use the feedback for this this systems?",
                    "label": 0
                },
                {
                    "sent": "So we had a feedback can be used.",
                    "label": 0
                },
                {
                    "sent": "By the systems as they like so.",
                    "label": 0
                },
                {
                    "sent": "They can implement several methods based on this feedback.",
                    "label": 0
                },
                {
                    "sent": "For example, learning methods.",
                    "label": 0
                },
                {
                    "sent": "And so, of course, then we can see which method is also the best one, or which yeah, which is, which is quite good for the user interaction to learn of.",
                    "label": 0
                },
                {
                    "sent": "K while we have maybe final question or comment, the last presenter may make his way forward.",
                    "label": 0
                },
                {
                    "sent": "Any last question, yeah.",
                    "label": 0
                },
                {
                    "sent": "Hello, maybe you're facing the question because the ontology matching is still quite new to me.",
                    "label": 0
                },
                {
                    "sent": "So my question will be very basic.",
                    "label": 0
                },
                {
                    "sent": "What is the advantages and disadvantages of using interactive ontology matching instead of the Atom?",
                    "label": 0
                },
                {
                    "sent": "The fully automatic one?",
                    "label": 0
                },
                {
                    "sent": "Oh can I don't understand it because of what?",
                    "label": 0
                },
                {
                    "sent": "What are the advantages and disadvantages of using the interactive ontology matching instead of the maybe fully automatic Internet facing?",
                    "label": 0
                },
                {
                    "sent": "So we think that the fully automatic approaches just have an upper bound, so there somehow.",
                    "label": 0
                },
                {
                    "sent": "You can't get a better quality of the alignments and with the help of the domain experts so you can get it to achieve a better quality.",
                    "label": 0
                },
                {
                    "sent": "So that's exactly what you faced before.",
                    "label": 0
                },
                {
                    "sent": "So if you all, if it's possible to achieve 100.",
                    "label": 0
                },
                {
                    "sent": "Percent of correct 1/2.",
                    "label": 0
                },
                {
                    "sent": "So if it's always if you can get the best one and we think that if you include the user, you can even make better than adjust fully automatic approach.",
                    "label": 0
                },
                {
                    "sent": "I think he's asking for advantages.",
                    "label": 0
                },
                {
                    "sent": "These disadvantages disadvantages of course you have to include the user and that's the workload of the domain expert.",
                    "label": 0
                },
                {
                    "sent": "Yep, OK. OK, let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}