{
    "id": "poctwf3rsbu2u3g53hvm562jnhpw6ghj",
    "title": "Fluid dynamics models for low rank discriminant analysis",
    "info": {
        "author": [
            "Yung-Kyun Noh, Seoul National University"
        ],
        "published": "June 3, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/aistats2010_noh_fdmfl/",
    "segmentation": [
        [
            "When you are given high dimensional data having levels, typical procedure for classification is to protect the data onto a low dimensional space and disconnecting this space.",
            "So finding a space where the projected data easy to be discriminated is a important problem in machine learning.",
            "One simple Canonical example is the."
        ],
        [
            "Fisher discriminant analysis.",
            "The FD, which tries to find the subspace that maximizes the variance between means and minimized variance within crisis.",
            "And surely there the more sophisticated problems and FDA and in general they are interchangeable or not easy to optimize.",
            "So here's what we do.",
            "We specially we specifically focus on one more sophisticated problem.",
            "After that idea on this, which is having the FDA edges special case and this problem is not easy to optimize and there is no known method, they can find the glue optimum of this problem in general.",
            "So we take an allergy for me.",
            "Pretty semantic, we say.",
            "For it matters we consider distribution says Chris one for it pushes the other fruit wisdom phosphate and we create the induced emotion.",
            "To the low dimensional subspace edger reject we come to find an eigenvalue problem that approximates the passenger solution of the potential analysis and next we will extend our problem, extend our methods to the classification problem to implement generation processes and we will provide some interpretation.",
            "What is the optimal filter that can be used for classification of two Gaussian processes?",
            "We"
        ],
        [
            "Going to start by defining the discriminant analysis when their data in hydrogen space, they can be predicted using some projection matrix W on the subspace where the distributions are most effective or on the on the subspace where they're not.",
            "These comments on their 60 plus to the subspace data predicted data more separated for classification and for basic education.",
            "The function should be the base error in the projective space, and we want to find the subspace where the base error in using the projective distance minimized.",
            "But this problem is entitled because of the objective function is injectable because of being function in the Internet so."
        ],
        [
            "People use instead of the integration of the sound of the main function and the good thing is that this is integral for two Gaussians, so people usually use this objective function to find the subspace.",
            "So this is the potential analysis."
        ],
        [
            "And there are several characteristic of this material analysis.",
            "The first one on the left.",
            "Tattoo.",
            "And distributions in 2 dimensional space.",
            "We can put them to 1 dimensional subspace which is parameterized by the anger better.",
            "And then we can scan all the directions and calculate the integrated particular bound and the base data.",
            "Showed window right here and we can see the integrated battalion bound and basterra.",
            "According to Angus data shows some similar shape and is specially the minimum point.",
            "Appears very near point however on foot.",
            "Unfortunately the integrate Airbound is nonconvex, having many local minima.",
            "And this is the."
        ],
        [
            "Second one.",
            "Previously, forever on United this problem, very rare and found two Spitter Regents.",
            "This problem can be solved with an eigenvalue problem.",
            "The first case is dead.",
            "2 means are very close and the 2nd is the one to means a very far away.",
            "The only function composed of two terms and went to Mr very close then the first time can be ignored in the evening and the second time he comes to be dominant, with the Magister difference.",
            "To put it in variances and went to means a very far.",
            "Then the first time becomes to be dominant and the solution is becomes becomes the solution of the FDA solution which maximizes the main difference.",
            "At the same time in my interview with in reading class parents and these two cases are the two cases that you should remember for the rest of this talk, so went to means a very close.",
            "It is the focus equal mean.",
            "Case inventum insulated far, then this is the case of the FDA."
        ],
        [
            "Then how about the other regions?",
            "Play Mr Bean difference in the vertical line is this is the optimal direction.",
            "Then if we move, the means mean differs from zero to Infinity.",
            "Then the optimization shows a transition from the Fukunaga sequence solution to the FDA solution.",
            "So this is for typically happens.",
            "I."
        ],
        [
            "To summarize, the practical nurses this is some good appreciation of the base of command.",
            "So space and this is unlikely integral for Gaussians.",
            "However, this is non convex having many local minima.",
            "Moreover, the placement is W cannot be optimized by optimizing the columns independently, so deflation method cannot be applied here.",
            "So we want to address these problems."
        ],
        [
            "The proof of the proposed method is safely dynamics model."
        ],
        [
            "We consider.",
            "The TV channels in high dimensional space flow one and flow two and we got these two distributions as the message distribution of the freeze and we set the potential function.",
            "I still integrated bound in terms of lower glued to the projected distributions.",
            "This time his sister distribution in the hydrangea space, and then we induce the motion by applying various constraints.",
            "If your play DoH had constant motion, becomes very simple, and if we operate Elista constant then the motion becomes more complex, so later we will see how this is induced.",
            "Motion is related to the solution of the pathogenesis.",
            "Chase the key we used."
        ],
        [
            "Occasional continued key.",
            "We just takes the conservation of mass, which says the divergences equal to the flow inside an equal to the difference.",
            "Our flow inside and the flow.",
            "How side with this equation of continuity along with the potential function?"
        ],
        [
            "You have to force feed from Class 1 to Class 2 or from this we can also deal with the force from Class 1 to Class 2, which is the functional vector composed of low Naruto and if we look at the figures on the left.",
            "Photo Gaussians if you look at the force field from Class 1 to Class 2 then this is basically a repulsive force to increase the separation between two places and if you look at on the right figure when one distribution is on top of the other than the phosphate is a force pushing insight instead of pushing outside because.",
            "In this case, our station, the other distribution is the case is the way to decrease the overlap so.",
            "The right figure is still one day distinguishes our model too.",
            "To the previous model using some force field for this client analysis.",
            "Envy operated some."
        ],
        [
            "This contains and see how the motion is likely to move an company.",
            "We applied loading constant and the motion will automatically select directions to subspace.",
            "The fluid is likely to move.",
            "To induce tamotia today."
        ],
        [
            "Motion we used housekeeper list constant, which we.",
            "Minimize this functional and this.",
            "This is for this function is to minimize the sum of the forces from the constant.",
            "OK Christopher St."
        ],
        [
            "And 1st we apply some very hard constraint, so we assume that the fluid is a rigid body having just uniform translation movement in the case.",
            "Direction to the fluid chose to move is the same Mr. Fisher discount on any direction and so went to miss.",
            "Went to places are part of.",
            "This is the feature different direction and when to miss at the same then it does not give anything like that just Fisher discriminant analysis.",
            "Now we."
        ],
        [
            "Relax the constraint or little bit so that the motion can help lower rank of emotion which is reconnect this so there the double matrix W matrix is a rolling chromatics have having very to shape and in this case the solution is the eigenvector of this symmetric matrix which is having the force onto crazy and location.",
            "Up each point so the every, every operator and so with this.",
            "Acacia we can show that when 2 means available far then the solution is the same as the FDA solution and went to Mr very close and the solution of course mates fanatical mean solution.",
            "So this is this is the.",
            "I would assume that we propose for the discount on anything instead of potential analysis.",
            "So what about the?"
        ],
        [
            "Other cases so.",
            "Other than two special cases doubling line Alfred model approximates the bacteria optimization algorithm based meditation Baylor and on the right figure.",
            "Even though there are some jump on the petition and facial recognition.",
            "Our model our mother approximates traditions where.",
            "Kill at the end."
        ],
        [
            "The Freedom matter increase or really big, whichever is higher than the FDA and finance equipment case.",
            "This is the performance."
        ],
        [
            "And.",
            "We think our method to destination of the implementation process is an for inflammation causing processes.",
            "The load images space is some filter foot in a product with some samples.",
            "We give some.",
            "Various stages will be used for classification.",
            "Edison for example."
        ],
        [
            "We should we consider a random sample generator.",
            "According separate infant images impress according this update rule.",
            "Having panic post iPod and input, be an the epsilon the noise issue.",
            "If the noise issue is a Gaussian distribution, then the simplest are the process is having mean at your function of B and quivalence function of location exciting and stay at your function of Alpha and distance between excited state."
        ],
        [
            "We consider two different Gaussian process is having eye, and two different B1 and B2 which is shaped like the two figures and.",
            "Swedish fish be input.",
            "We will have the mean, which is the blue line on the low figures, which is like this and the generators in place will be red and blue."
        ],
        [
            "This."
        ],
        [
            "This and this.",
            "A given you sample we want to disconnect weather December ease from cashing places.",
            "One for caution, phase two."
        ],
        [
            "So if you look at it.",
            "Let's go then.",
            "This shows the true means of two calcium processes, which is flat to flex, and it shows several samples.",
            "Red and blue Ann.",
            "In this video we can.",
            "I really think that the main difference would be some good filter that disconnect too simplistic 'cause there are some differentiation in operating blue in the region.",
            "Their main difference is here.",
            "Be cause for two distributions.",
            "iPad at the same Anne.",
            "In this case, took over to covariance functions are the same, so this is the case study to covariance matrix at the same.",
            "So in this case the everyday solution is the ultimate solution, not domain difference, which is shaped like the right figure which shaped like something comparable form of the input function and this basically measures the difference between the.",
            "Capture input and end of the output.",
            "If you put it in the same place onto this FDA filter, then we can see the blue and red on the upper figure, which which is to reject being mean difference is maximized and reading class variance is minimized.",
            "And if we predict the same person, the main difference in the future.",
            "The figure color green which just tried to maximize the mean difference.",
            "So."
        ],
        [
            "Please stay up to my filter for two arbitrary Gaussian process is not just the FDA case.",
            "First, first we received to focus equally in case for caution processes.",
            "To coerce Medicis tessellation invariant so 2000 processes, share the eigenvectors which are the three most, and so forth.",
            "Caution process is the optimal filter is today mode, that is, having the maximum for the questions difference, right and then to function is equivalent.",
            "Then the solution is the FTS region, which is the most important input.",
            "And you see Windows PSPS light then?",
            "What is the?",
            "What is the future for arbitrary to caution these divisions?",
            "The Ultimate Fighter for arbitrary to kacian process is the combination of the frame most and the combo input, which is like this."
        ],
        [
            "For arbitrary two Gaussian processes.",
            "This pic and this picture shows the FDA solution and this over the shape shows the combination of the flame was so this is interesting thing 'cause this shape is something like some win difference but.",
            "Go F dissolution touching that contribute to the shape.",
            "This is just the sum of the food in most.",
            "OK, 50, so we presented."
        ],
        [
            "We spend about the battery on your system and we apply some.",
            "Free space model and found the problem to approximate the battery on a solution and we extended our method to the classification of interventional caution processes.",
            "Thank you for your attention."
        ],
        [
            "Questions."
        ],
        [
            "John.",
            "Can you go back to slide 1449?",
            "Yes, that's the one.",
            "You got an acceleration there.",
            "He says something about the gas principle.",
            "That's right."
        ],
        [
            "Detroit quite seeing that in the physics I see I explained this a little bit more.",
            "Actually.",
            "The equation in the peristalsis.",
            "The steps are forced from the constant because there is a force and there is exploration and the difference is the force from the constraint.",
            "Putting accelerations team.",
            "How do you solve things moving?",
            "Yeah, I see actually.",
            "Yeah, actually this is dynamics, but we do not use the dynamics so we just want to want to have the direction that it's important for the situation at the moment so we do not consider after some time.",
            "Any other question?",
            "OK from Shelby.",
            "Thank you speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you are given high dimensional data having levels, typical procedure for classification is to protect the data onto a low dimensional space and disconnecting this space.",
                    "label": 0
                },
                {
                    "sent": "So finding a space where the projected data easy to be discriminated is a important problem in machine learning.",
                    "label": 0
                },
                {
                    "sent": "One simple Canonical example is the.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fisher discriminant analysis.",
                    "label": 0
                },
                {
                    "sent": "The FD, which tries to find the subspace that maximizes the variance between means and minimized variance within crisis.",
                    "label": 0
                },
                {
                    "sent": "And surely there the more sophisticated problems and FDA and in general they are interchangeable or not easy to optimize.",
                    "label": 0
                },
                {
                    "sent": "So here's what we do.",
                    "label": 0
                },
                {
                    "sent": "We specially we specifically focus on one more sophisticated problem.",
                    "label": 0
                },
                {
                    "sent": "After that idea on this, which is having the FDA edges special case and this problem is not easy to optimize and there is no known method, they can find the glue optimum of this problem in general.",
                    "label": 0
                },
                {
                    "sent": "So we take an allergy for me.",
                    "label": 0
                },
                {
                    "sent": "Pretty semantic, we say.",
                    "label": 0
                },
                {
                    "sent": "For it matters we consider distribution says Chris one for it pushes the other fruit wisdom phosphate and we create the induced emotion.",
                    "label": 0
                },
                {
                    "sent": "To the low dimensional subspace edger reject we come to find an eigenvalue problem that approximates the passenger solution of the potential analysis and next we will extend our problem, extend our methods to the classification problem to implement generation processes and we will provide some interpretation.",
                    "label": 0
                },
                {
                    "sent": "What is the optimal filter that can be used for classification of two Gaussian processes?",
                    "label": 1
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going to start by defining the discriminant analysis when their data in hydrogen space, they can be predicted using some projection matrix W on the subspace where the distributions are most effective or on the on the subspace where they're not.",
                    "label": 0
                },
                {
                    "sent": "These comments on their 60 plus to the subspace data predicted data more separated for classification and for basic education.",
                    "label": 0
                },
                {
                    "sent": "The function should be the base error in the projective space, and we want to find the subspace where the base error in using the projective distance minimized.",
                    "label": 0
                },
                {
                    "sent": "But this problem is entitled because of the objective function is injectable because of being function in the Internet so.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People use instead of the integration of the sound of the main function and the good thing is that this is integral for two Gaussians, so people usually use this objective function to find the subspace.",
                    "label": 0
                },
                {
                    "sent": "So this is the potential analysis.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there are several characteristic of this material analysis.",
                    "label": 0
                },
                {
                    "sent": "The first one on the left.",
                    "label": 0
                },
                {
                    "sent": "Tattoo.",
                    "label": 0
                },
                {
                    "sent": "And distributions in 2 dimensional space.",
                    "label": 0
                },
                {
                    "sent": "We can put them to 1 dimensional subspace which is parameterized by the anger better.",
                    "label": 0
                },
                {
                    "sent": "And then we can scan all the directions and calculate the integrated particular bound and the base data.",
                    "label": 0
                },
                {
                    "sent": "Showed window right here and we can see the integrated battalion bound and basterra.",
                    "label": 0
                },
                {
                    "sent": "According to Angus data shows some similar shape and is specially the minimum point.",
                    "label": 0
                },
                {
                    "sent": "Appears very near point however on foot.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately the integrate Airbound is nonconvex, having many local minima.",
                    "label": 0
                },
                {
                    "sent": "And this is the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Second one.",
                    "label": 0
                },
                {
                    "sent": "Previously, forever on United this problem, very rare and found two Spitter Regents.",
                    "label": 0
                },
                {
                    "sent": "This problem can be solved with an eigenvalue problem.",
                    "label": 0
                },
                {
                    "sent": "The first case is dead.",
                    "label": 0
                },
                {
                    "sent": "2 means are very close and the 2nd is the one to means a very far away.",
                    "label": 0
                },
                {
                    "sent": "The only function composed of two terms and went to Mr very close then the first time can be ignored in the evening and the second time he comes to be dominant, with the Magister difference.",
                    "label": 0
                },
                {
                    "sent": "To put it in variances and went to means a very far.",
                    "label": 0
                },
                {
                    "sent": "Then the first time becomes to be dominant and the solution is becomes becomes the solution of the FDA solution which maximizes the main difference.",
                    "label": 0
                },
                {
                    "sent": "At the same time in my interview with in reading class parents and these two cases are the two cases that you should remember for the rest of this talk, so went to means a very close.",
                    "label": 0
                },
                {
                    "sent": "It is the focus equal mean.",
                    "label": 0
                },
                {
                    "sent": "Case inventum insulated far, then this is the case of the FDA.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then how about the other regions?",
                    "label": 0
                },
                {
                    "sent": "Play Mr Bean difference in the vertical line is this is the optimal direction.",
                    "label": 1
                },
                {
                    "sent": "Then if we move, the means mean differs from zero to Infinity.",
                    "label": 0
                },
                {
                    "sent": "Then the optimization shows a transition from the Fukunaga sequence solution to the FDA solution.",
                    "label": 0
                },
                {
                    "sent": "So this is for typically happens.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To summarize, the practical nurses this is some good appreciation of the base of command.",
                    "label": 0
                },
                {
                    "sent": "So space and this is unlikely integral for Gaussians.",
                    "label": 0
                },
                {
                    "sent": "However, this is non convex having many local minima.",
                    "label": 1
                },
                {
                    "sent": "Moreover, the placement is W cannot be optimized by optimizing the columns independently, so deflation method cannot be applied here.",
                    "label": 1
                },
                {
                    "sent": "So we want to address these problems.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The proof of the proposed method is safely dynamics model.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We consider.",
                    "label": 0
                },
                {
                    "sent": "The TV channels in high dimensional space flow one and flow two and we got these two distributions as the message distribution of the freeze and we set the potential function.",
                    "label": 1
                },
                {
                    "sent": "I still integrated bound in terms of lower glued to the projected distributions.",
                    "label": 1
                },
                {
                    "sent": "This time his sister distribution in the hydrangea space, and then we induce the motion by applying various constraints.",
                    "label": 0
                },
                {
                    "sent": "If your play DoH had constant motion, becomes very simple, and if we operate Elista constant then the motion becomes more complex, so later we will see how this is induced.",
                    "label": 0
                },
                {
                    "sent": "Motion is related to the solution of the pathogenesis.",
                    "label": 0
                },
                {
                    "sent": "Chase the key we used.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Occasional continued key.",
                    "label": 0
                },
                {
                    "sent": "We just takes the conservation of mass, which says the divergences equal to the flow inside an equal to the difference.",
                    "label": 1
                },
                {
                    "sent": "Our flow inside and the flow.",
                    "label": 0
                },
                {
                    "sent": "How side with this equation of continuity along with the potential function?",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You have to force feed from Class 1 to Class 2 or from this we can also deal with the force from Class 1 to Class 2, which is the functional vector composed of low Naruto and if we look at the figures on the left.",
                    "label": 0
                },
                {
                    "sent": "Photo Gaussians if you look at the force field from Class 1 to Class 2 then this is basically a repulsive force to increase the separation between two places and if you look at on the right figure when one distribution is on top of the other than the phosphate is a force pushing insight instead of pushing outside because.",
                    "label": 0
                },
                {
                    "sent": "In this case, our station, the other distribution is the case is the way to decrease the overlap so.",
                    "label": 0
                },
                {
                    "sent": "The right figure is still one day distinguishes our model too.",
                    "label": 0
                },
                {
                    "sent": "To the previous model using some force field for this client analysis.",
                    "label": 1
                },
                {
                    "sent": "Envy operated some.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This contains and see how the motion is likely to move an company.",
                    "label": 0
                },
                {
                    "sent": "We applied loading constant and the motion will automatically select directions to subspace.",
                    "label": 0
                },
                {
                    "sent": "The fluid is likely to move.",
                    "label": 0
                },
                {
                    "sent": "To induce tamotia today.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Motion we used housekeeper list constant, which we.",
                    "label": 0
                },
                {
                    "sent": "Minimize this functional and this.",
                    "label": 0
                },
                {
                    "sent": "This is for this function is to minimize the sum of the forces from the constant.",
                    "label": 0
                },
                {
                    "sent": "OK Christopher St.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And 1st we apply some very hard constraint, so we assume that the fluid is a rigid body having just uniform translation movement in the case.",
                    "label": 0
                },
                {
                    "sent": "Direction to the fluid chose to move is the same Mr. Fisher discount on any direction and so went to miss.",
                    "label": 0
                },
                {
                    "sent": "Went to places are part of.",
                    "label": 0
                },
                {
                    "sent": "This is the feature different direction and when to miss at the same then it does not give anything like that just Fisher discriminant analysis.",
                    "label": 0
                },
                {
                    "sent": "Now we.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Relax the constraint or little bit so that the motion can help lower rank of emotion which is reconnect this so there the double matrix W matrix is a rolling chromatics have having very to shape and in this case the solution is the eigenvector of this symmetric matrix which is having the force onto crazy and location.",
                    "label": 0
                },
                {
                    "sent": "Up each point so the every, every operator and so with this.",
                    "label": 0
                },
                {
                    "sent": "Acacia we can show that when 2 means available far then the solution is the same as the FDA solution and went to Mr very close and the solution of course mates fanatical mean solution.",
                    "label": 0
                },
                {
                    "sent": "So this is this is the.",
                    "label": 0
                },
                {
                    "sent": "I would assume that we propose for the discount on anything instead of potential analysis.",
                    "label": 0
                },
                {
                    "sent": "So what about the?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other cases so.",
                    "label": 0
                },
                {
                    "sent": "Other than two special cases doubling line Alfred model approximates the bacteria optimization algorithm based meditation Baylor and on the right figure.",
                    "label": 0
                },
                {
                    "sent": "Even though there are some jump on the petition and facial recognition.",
                    "label": 0
                },
                {
                    "sent": "Our model our mother approximates traditions where.",
                    "label": 0
                },
                {
                    "sent": "Kill at the end.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The Freedom matter increase or really big, whichever is higher than the FDA and finance equipment case.",
                    "label": 0
                },
                {
                    "sent": "This is the performance.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We think our method to destination of the implementation process is an for inflammation causing processes.",
                    "label": 0
                },
                {
                    "sent": "The load images space is some filter foot in a product with some samples.",
                    "label": 0
                },
                {
                    "sent": "We give some.",
                    "label": 0
                },
                {
                    "sent": "Various stages will be used for classification.",
                    "label": 0
                },
                {
                    "sent": "Edison for example.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We should we consider a random sample generator.",
                    "label": 0
                },
                {
                    "sent": "According separate infant images impress according this update rule.",
                    "label": 0
                },
                {
                    "sent": "Having panic post iPod and input, be an the epsilon the noise issue.",
                    "label": 0
                },
                {
                    "sent": "If the noise issue is a Gaussian distribution, then the simplest are the process is having mean at your function of B and quivalence function of location exciting and stay at your function of Alpha and distance between excited state.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We consider two different Gaussian process is having eye, and two different B1 and B2 which is shaped like the two figures and.",
                    "label": 0
                },
                {
                    "sent": "Swedish fish be input.",
                    "label": 0
                },
                {
                    "sent": "We will have the mean, which is the blue line on the low figures, which is like this and the generators in place will be red and blue.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This and this.",
                    "label": 0
                },
                {
                    "sent": "A given you sample we want to disconnect weather December ease from cashing places.",
                    "label": 0
                },
                {
                    "sent": "One for caution, phase two.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you look at it.",
                    "label": 0
                },
                {
                    "sent": "Let's go then.",
                    "label": 0
                },
                {
                    "sent": "This shows the true means of two calcium processes, which is flat to flex, and it shows several samples.",
                    "label": 0
                },
                {
                    "sent": "Red and blue Ann.",
                    "label": 0
                },
                {
                    "sent": "In this video we can.",
                    "label": 0
                },
                {
                    "sent": "I really think that the main difference would be some good filter that disconnect too simplistic 'cause there are some differentiation in operating blue in the region.",
                    "label": 0
                },
                {
                    "sent": "Their main difference is here.",
                    "label": 0
                },
                {
                    "sent": "Be cause for two distributions.",
                    "label": 0
                },
                {
                    "sent": "iPad at the same Anne.",
                    "label": 0
                },
                {
                    "sent": "In this case, took over to covariance functions are the same, so this is the case study to covariance matrix at the same.",
                    "label": 0
                },
                {
                    "sent": "So in this case the everyday solution is the ultimate solution, not domain difference, which is shaped like the right figure which shaped like something comparable form of the input function and this basically measures the difference between the.",
                    "label": 0
                },
                {
                    "sent": "Capture input and end of the output.",
                    "label": 0
                },
                {
                    "sent": "If you put it in the same place onto this FDA filter, then we can see the blue and red on the upper figure, which which is to reject being mean difference is maximized and reading class variance is minimized.",
                    "label": 0
                },
                {
                    "sent": "And if we predict the same person, the main difference in the future.",
                    "label": 0
                },
                {
                    "sent": "The figure color green which just tried to maximize the mean difference.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Please stay up to my filter for two arbitrary Gaussian process is not just the FDA case.",
                    "label": 1
                },
                {
                    "sent": "First, first we received to focus equally in case for caution processes.",
                    "label": 0
                },
                {
                    "sent": "To coerce Medicis tessellation invariant so 2000 processes, share the eigenvectors which are the three most, and so forth.",
                    "label": 0
                },
                {
                    "sent": "Caution process is the optimal filter is today mode, that is, having the maximum for the questions difference, right and then to function is equivalent.",
                    "label": 0
                },
                {
                    "sent": "Then the solution is the FTS region, which is the most important input.",
                    "label": 0
                },
                {
                    "sent": "And you see Windows PSPS light then?",
                    "label": 0
                },
                {
                    "sent": "What is the?",
                    "label": 0
                },
                {
                    "sent": "What is the future for arbitrary to caution these divisions?",
                    "label": 0
                },
                {
                    "sent": "The Ultimate Fighter for arbitrary to kacian process is the combination of the frame most and the combo input, which is like this.",
                    "label": 1
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For arbitrary two Gaussian processes.",
                    "label": 0
                },
                {
                    "sent": "This pic and this picture shows the FDA solution and this over the shape shows the combination of the flame was so this is interesting thing 'cause this shape is something like some win difference but.",
                    "label": 0
                },
                {
                    "sent": "Go F dissolution touching that contribute to the shape.",
                    "label": 0
                },
                {
                    "sent": "This is just the sum of the food in most.",
                    "label": 0
                },
                {
                    "sent": "OK, 50, so we presented.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We spend about the battery on your system and we apply some.",
                    "label": 0
                },
                {
                    "sent": "Free space model and found the problem to approximate the battery on a solution and we extended our method to the classification of interventional caution processes.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Questions.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "John.",
                    "label": 0
                },
                {
                    "sent": "Can you go back to slide 1449?",
                    "label": 0
                },
                {
                    "sent": "Yes, that's the one.",
                    "label": 0
                },
                {
                    "sent": "You got an acceleration there.",
                    "label": 0
                },
                {
                    "sent": "He says something about the gas principle.",
                    "label": 0
                },
                {
                    "sent": "That's right.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Detroit quite seeing that in the physics I see I explained this a little bit more.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "The equation in the peristalsis.",
                    "label": 0
                },
                {
                    "sent": "The steps are forced from the constant because there is a force and there is exploration and the difference is the force from the constraint.",
                    "label": 0
                },
                {
                    "sent": "Putting accelerations team.",
                    "label": 0
                },
                {
                    "sent": "How do you solve things moving?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I see actually.",
                    "label": 0
                },
                {
                    "sent": "Yeah, actually this is dynamics, but we do not use the dynamics so we just want to want to have the direction that it's important for the situation at the moment so we do not consider after some time.",
                    "label": 0
                },
                {
                    "sent": "Any other question?",
                    "label": 0
                },
                {
                    "sent": "OK from Shelby.",
                    "label": 0
                },
                {
                    "sent": "Thank you speaker again.",
                    "label": 0
                }
            ]
        }
    }
}