{
    "id": "pojnt4wovjn5uo7vv2ndbl5p6u33f7de",
    "title": "Real-time Population of Knowledge Bases: Opportunities and Challenges",
    "info": {
        "author": [
            "Ndapandula Nakashole, Max Planck Institute for Informatics, Max Planck Institute"
        ],
        "recorded by": [
            "AKBC-WEKEX"
        ],
        "published": "July 13, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Information Extraction",
            "Top->Computer Science->Natural Language Processing",
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Text Mining"
        ]
    },
    "url": "http://videolectures.net/akbcwekex2012_nakashole_knowledge_bases/",
    "segmentation": [
        [
            "I'm definitely sure from the Max Planck Institute.",
            "Yeah, and I'm going to be talking about populating knowledge bases in.",
            "In in a way that we can handle real time data.",
            "Essentially we want to populate knowledge bases with data from rapidly updated data sources.",
            "Example of this kind."
        ],
        [
            "Are these articles and social media?",
            "So this would be?",
            "So this would be.",
            "For example, what you get from Google News and also social numbers.",
            "Yeah, so this kind of data.",
            "The implicit question is because, really, what's happening right now.",
            "Yeah, so in order that is also created in a way that snaps the receptors that I think is no reason apart or.",
            "Why do an extra guys actually use for an extractor and?",
            "And several weeks later, another snapshot is visually.",
            "No snapshot specially generated to external factors.",
            "I cannot answer this one happening right now question because the resulting knowledge has gas in it and also potentially sale.",
            "On the other hand, news aggregators presented timely big picture of what's happening right now.",
            "For example, what Google New stars.",
            "But we present this information in the form of headlines and text limits as opposed to relational fact, and So what would like to do with the idea of real time knowledge is population."
        ],
        [
            "Is essentially a timely fact.",
            "Extraction from rapidly updated data sources.",
            "And so, in this manner we are looking at nailing a fine grained exploration of the big picture as it emerges.",
            "And when using social media media, essentially the big picture is serious events and stories, and these stories and events are made up of the fact that we are looking to extract and so this is what you're looking."
        ],
        [
            "Not to mention we have bunch of news articles and we apply effect extractor as soon as the data becomes available and we consolidate these facts into prom events.",
            "Able to get to this point, though, entails a number of challenges.",
            "First one is that information discovery so."
        ],
        [
            "We do not know before hand what relation to participate in the creation of the fact that you later create events and so we need to discover and maintain an open set of relations which goes beyond accommodations such as warning, echoed and so on.",
            "And same time.",
            "The relations we extract needs to be semantically meaningful and so we have to discard any sort of noise that we likely to encounter.",
            "The challenge is that of dynamic entity discovery.",
            "Here we are aiming for us."
        ],
        [
            "Click on system facts so we would like to map non phrases to entities in a knowledge base off.",
            "For example the non phrase Jeff team can mean the Google engineer or their opposition.",
            "And so here are the issues that the noises that are right now are not complete.",
            "Yeah, so for example Jeff did a Google engineer doesn't have a Wikipedia page, and so he's missing in Wikipedia editor access knowledge base, and this feature is even more pronounced in using social media and so would like to.",
            "Essentially, recognize and Kendall out of knowledge based entities, but still would like to recognize them and not only as noun phrases, but treat them as something more with the semantics an the last round of let's talk about."
        ],
        [
            "Time constraint aspect.",
            "Here we would like our structure to work in such a way that it can produce facts.",
            "In a way that it can keep up with the production rates of the data sources.",
            "So I would not like to produce that fact from today's news few weeks down the line, but like rather few weeks few hours later.",
            "So here too."
        ],
        [
            "Switch gears a little bit and talk about how we approach each other times I've just described.",
            "Or relation discovery we?"
        ],
        [
            "Developed a method for identifying semantically meaningful relations.",
            "We can refer to as syntactic.",
            "Syntactic lexical ontological planets soln put the syntactic lexical part refers to the server's words and power.",
            "Speech tags were asking a logical dimension personally use of semantic classes as placeholders for entities.",
            "This would be things like singer scientists, person and so and so each button has the type signature which essentially specifies the types of entities that can stand in the relation expressed by an example.",
            "Patents would be convenient party person or musician Rd Kids songs for another person and so.",
            "And in fact we applied this method for mining as a little pardons for several kopera.",
            "We were able to mind not only common relations about several other interesting ones that were not able to find in current resources.",
            "Thing that we did with the little patterns was to group them into synonyms in the summer."
        ],
        [
            "Subfunctions in the sense that?",
            "Some relations are more specific.",
            "Then basically their relation can be specific.",
            "Sensation of another relation examples would be wife of is more specific and spouse or an intern as possible is more specifically notes.",
            "We actually applied.",
            "Wikipedia.",
            "20,000 such buttons, normal subfunctions and synonyms, and you can actually download these and for the logical detail you can have a look at our paper at this years like Gemini.",
            "Or would you end?"
        ],
        [
            "Are these what you propose to do is to infer types of new entities from the patterns of people growing, so we had fun size that were given partition expensive picture.",
            "We can simply say that's the entity.",
            "That across the continent in size, but the NCS off the correct side.",
            "So for example impacting released album.",
            "Any occurrence extremist Y means that X is a singer.",
            "And why is an album?",
            "But this actually not always the case to the festival.",
            "For listening syntax, there could be another pattern with this music band released.",
            "A song or music band release an album, and so suddenly acts can be of two different types which may not be compatible in that they cannot coexist for the same into the same time.",
            "And the second reason why these sort of simple hypothesis doesn't work out of the box is due to incorrect side dependencies.",
            "Because two entities in a sentence does not always necessarily mean that the entities standing is subject object relationship.",
            "And so several errors can also stand for.",
            "But still, if you actually take into account multiple sentences across different documents, we can approximate likely first offense from departments to your curves.",
            "And I finally."
        ],
        [
            "We got to the time constraints we propose to trace the data sources as a stream with Dolphins in the end, defined in times like this century.",
            "In times where we have accumulated documents and then apply the extractor at the end of the time and in in such time we also define a target report which essentially we can use to determine how many documents we need to process.",
            "Because we do not necessarily need to process.",
            "All this is due to redundancy and so this time slice and target before parameters can actually give us a handle or can't control the start time constrain aspect while keeping up with their production rate near Peterson.",
            "Yeah, that's it will be, of course."
        ],
        [
            "Or any questions?",
            "Thank you.",
            "Mission.",
            "So if you have a relation like like I just released music album and then you say X is a singer, then wouldn't you often match things like the quote like the singer?",
            "Because the singer is an odd phrase, but that doesn't mean that the singer is actually a natural singer has a name that you want to add.",
            "Like every kind of problem, basically your brain to try to serve many parties and intensity and which one is it?",
            "What's an entity versus?",
            "Oh, and entity would potentially be an instance after class.",
            "For example, if you see this sooner.",
            "You have certain rules in German Watson into for example, where you have using capital letters to stop or names of actual entities.",
            "Yeah, for classes.",
            "You would definitely not always find find instances of classes with the patterns that you usually find with.",
            "With the instances for example, so that would want to and.",
            "Yeah, who will classes actually did?",
            "You think you could find the singer?",
            "For example here, what we're looking to do is actually use knowledge base is to determine what supplies.",
            "So if you know that it's a singer, is the time, then you actually talk about that?",
            "So how, how accurate is your system at protecting whether things are entities or classes?",
            "Um, right now.",
            "We have restricted so far we have restricted entities to be those already involved faces the.",
            "Are these the type of the type of detecting work is still underway, so we haven't actually.",
            "Whether or not we do pick up classes I sent.",
            "Poster."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm definitely sure from the Max Planck Institute.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and I'm going to be talking about populating knowledge bases in.",
                    "label": 1
                },
                {
                    "sent": "In in a way that we can handle real time data.",
                    "label": 0
                },
                {
                    "sent": "Essentially we want to populate knowledge bases with data from rapidly updated data sources.",
                    "label": 0
                },
                {
                    "sent": "Example of this kind.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are these articles and social media?",
                    "label": 1
                },
                {
                    "sent": "So this would be?",
                    "label": 0
                },
                {
                    "sent": "So this would be.",
                    "label": 0
                },
                {
                    "sent": "For example, what you get from Google News and also social numbers.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this kind of data.",
                    "label": 1
                },
                {
                    "sent": "The implicit question is because, really, what's happening right now.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so in order that is also created in a way that snaps the receptors that I think is no reason apart or.",
                    "label": 0
                },
                {
                    "sent": "Why do an extra guys actually use for an extractor and?",
                    "label": 0
                },
                {
                    "sent": "And several weeks later, another snapshot is visually.",
                    "label": 0
                },
                {
                    "sent": "No snapshot specially generated to external factors.",
                    "label": 0
                },
                {
                    "sent": "I cannot answer this one happening right now question because the resulting knowledge has gas in it and also potentially sale.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, news aggregators presented timely big picture of what's happening right now.",
                    "label": 1
                },
                {
                    "sent": "For example, what Google New stars.",
                    "label": 0
                },
                {
                    "sent": "But we present this information in the form of headlines and text limits as opposed to relational fact, and So what would like to do with the idea of real time knowledge is population.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is essentially a timely fact.",
                    "label": 0
                },
                {
                    "sent": "Extraction from rapidly updated data sources.",
                    "label": 0
                },
                {
                    "sent": "And so, in this manner we are looking at nailing a fine grained exploration of the big picture as it emerges.",
                    "label": 1
                },
                {
                    "sent": "And when using social media media, essentially the big picture is serious events and stories, and these stories and events are made up of the fact that we are looking to extract and so this is what you're looking.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not to mention we have bunch of news articles and we apply effect extractor as soon as the data becomes available and we consolidate these facts into prom events.",
                    "label": 0
                },
                {
                    "sent": "Able to get to this point, though, entails a number of challenges.",
                    "label": 0
                },
                {
                    "sent": "First one is that information discovery so.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We do not know before hand what relation to participate in the creation of the fact that you later create events and so we need to discover and maintain an open set of relations which goes beyond accommodations such as warning, echoed and so on.",
                    "label": 1
                },
                {
                    "sent": "And same time.",
                    "label": 0
                },
                {
                    "sent": "The relations we extract needs to be semantically meaningful and so we have to discard any sort of noise that we likely to encounter.",
                    "label": 0
                },
                {
                    "sent": "The challenge is that of dynamic entity discovery.",
                    "label": 0
                },
                {
                    "sent": "Here we are aiming for us.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Click on system facts so we would like to map non phrases to entities in a knowledge base off.",
                    "label": 1
                },
                {
                    "sent": "For example the non phrase Jeff team can mean the Google engineer or their opposition.",
                    "label": 0
                },
                {
                    "sent": "And so here are the issues that the noises that are right now are not complete.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so for example Jeff did a Google engineer doesn't have a Wikipedia page, and so he's missing in Wikipedia editor access knowledge base, and this feature is even more pronounced in using social media and so would like to.",
                    "label": 1
                },
                {
                    "sent": "Essentially, recognize and Kendall out of knowledge based entities, but still would like to recognize them and not only as noun phrases, but treat them as something more with the semantics an the last round of let's talk about.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Time constraint aspect.",
                    "label": 0
                },
                {
                    "sent": "Here we would like our structure to work in such a way that it can produce facts.",
                    "label": 1
                },
                {
                    "sent": "In a way that it can keep up with the production rates of the data sources.",
                    "label": 0
                },
                {
                    "sent": "So I would not like to produce that fact from today's news few weeks down the line, but like rather few weeks few hours later.",
                    "label": 1
                },
                {
                    "sent": "So here too.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Switch gears a little bit and talk about how we approach each other times I've just described.",
                    "label": 0
                },
                {
                    "sent": "Or relation discovery we?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Developed a method for identifying semantically meaningful relations.",
                    "label": 1
                },
                {
                    "sent": "We can refer to as syntactic.",
                    "label": 0
                },
                {
                    "sent": "Syntactic lexical ontological planets soln put the syntactic lexical part refers to the server's words and power.",
                    "label": 0
                },
                {
                    "sent": "Speech tags were asking a logical dimension personally use of semantic classes as placeholders for entities.",
                    "label": 1
                },
                {
                    "sent": "This would be things like singer scientists, person and so and so each button has the type signature which essentially specifies the types of entities that can stand in the relation expressed by an example.",
                    "label": 0
                },
                {
                    "sent": "Patents would be convenient party person or musician Rd Kids songs for another person and so.",
                    "label": 0
                },
                {
                    "sent": "And in fact we applied this method for mining as a little pardons for several kopera.",
                    "label": 0
                },
                {
                    "sent": "We were able to mind not only common relations about several other interesting ones that were not able to find in current resources.",
                    "label": 0
                },
                {
                    "sent": "Thing that we did with the little patterns was to group them into synonyms in the summer.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Subfunctions in the sense that?",
                    "label": 0
                },
                {
                    "sent": "Some relations are more specific.",
                    "label": 0
                },
                {
                    "sent": "Then basically their relation can be specific.",
                    "label": 0
                },
                {
                    "sent": "Sensation of another relation examples would be wife of is more specific and spouse or an intern as possible is more specifically notes.",
                    "label": 0
                },
                {
                    "sent": "We actually applied.",
                    "label": 0
                },
                {
                    "sent": "Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "20,000 such buttons, normal subfunctions and synonyms, and you can actually download these and for the logical detail you can have a look at our paper at this years like Gemini.",
                    "label": 0
                },
                {
                    "sent": "Or would you end?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are these what you propose to do is to infer types of new entities from the patterns of people growing, so we had fun size that were given partition expensive picture.",
                    "label": 1
                },
                {
                    "sent": "We can simply say that's the entity.",
                    "label": 0
                },
                {
                    "sent": "That across the continent in size, but the NCS off the correct side.",
                    "label": 0
                },
                {
                    "sent": "So for example impacting released album.",
                    "label": 1
                },
                {
                    "sent": "Any occurrence extremist Y means that X is a singer.",
                    "label": 0
                },
                {
                    "sent": "And why is an album?",
                    "label": 1
                },
                {
                    "sent": "But this actually not always the case to the festival.",
                    "label": 0
                },
                {
                    "sent": "For listening syntax, there could be another pattern with this music band released.",
                    "label": 0
                },
                {
                    "sent": "A song or music band release an album, and so suddenly acts can be of two different types which may not be compatible in that they cannot coexist for the same into the same time.",
                    "label": 0
                },
                {
                    "sent": "And the second reason why these sort of simple hypothesis doesn't work out of the box is due to incorrect side dependencies.",
                    "label": 1
                },
                {
                    "sent": "Because two entities in a sentence does not always necessarily mean that the entities standing is subject object relationship.",
                    "label": 0
                },
                {
                    "sent": "And so several errors can also stand for.",
                    "label": 0
                },
                {
                    "sent": "But still, if you actually take into account multiple sentences across different documents, we can approximate likely first offense from departments to your curves.",
                    "label": 1
                },
                {
                    "sent": "And I finally.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We got to the time constraints we propose to trace the data sources as a stream with Dolphins in the end, defined in times like this century.",
                    "label": 0
                },
                {
                    "sent": "In times where we have accumulated documents and then apply the extractor at the end of the time and in in such time we also define a target report which essentially we can use to determine how many documents we need to process.",
                    "label": 0
                },
                {
                    "sent": "Because we do not necessarily need to process.",
                    "label": 0
                },
                {
                    "sent": "All this is due to redundancy and so this time slice and target before parameters can actually give us a handle or can't control the start time constrain aspect while keeping up with their production rate near Peterson.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's it will be, of course.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or any questions?",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Mission.",
                    "label": 0
                },
                {
                    "sent": "So if you have a relation like like I just released music album and then you say X is a singer, then wouldn't you often match things like the quote like the singer?",
                    "label": 0
                },
                {
                    "sent": "Because the singer is an odd phrase, but that doesn't mean that the singer is actually a natural singer has a name that you want to add.",
                    "label": 0
                },
                {
                    "sent": "Like every kind of problem, basically your brain to try to serve many parties and intensity and which one is it?",
                    "label": 0
                },
                {
                    "sent": "What's an entity versus?",
                    "label": 0
                },
                {
                    "sent": "Oh, and entity would potentially be an instance after class.",
                    "label": 0
                },
                {
                    "sent": "For example, if you see this sooner.",
                    "label": 0
                },
                {
                    "sent": "You have certain rules in German Watson into for example, where you have using capital letters to stop or names of actual entities.",
                    "label": 0
                },
                {
                    "sent": "Yeah, for classes.",
                    "label": 0
                },
                {
                    "sent": "You would definitely not always find find instances of classes with the patterns that you usually find with.",
                    "label": 0
                },
                {
                    "sent": "With the instances for example, so that would want to and.",
                    "label": 0
                },
                {
                    "sent": "Yeah, who will classes actually did?",
                    "label": 0
                },
                {
                    "sent": "You think you could find the singer?",
                    "label": 0
                },
                {
                    "sent": "For example here, what we're looking to do is actually use knowledge base is to determine what supplies.",
                    "label": 0
                },
                {
                    "sent": "So if you know that it's a singer, is the time, then you actually talk about that?",
                    "label": 0
                },
                {
                    "sent": "So how, how accurate is your system at protecting whether things are entities or classes?",
                    "label": 0
                },
                {
                    "sent": "Um, right now.",
                    "label": 0
                },
                {
                    "sent": "We have restricted so far we have restricted entities to be those already involved faces the.",
                    "label": 0
                },
                {
                    "sent": "Are these the type of the type of detecting work is still underway, so we haven't actually.",
                    "label": 0
                },
                {
                    "sent": "Whether or not we do pick up classes I sent.",
                    "label": 0
                },
                {
                    "sent": "Poster.",
                    "label": 0
                }
            ]
        }
    }
}