{
    "id": "ppw6heeosbgvpegknlkahfoiwsjsqf6l",
    "title": "Introduction to the Semantic Web",
    "info": {
        "author": [
            "Jim Hendler, Rensselaer Polytechnic Institute",
            "Sean Bechhofer, School of Computer Science, University of Manchester",
            "Asunción Gómez-Pérez, Technical University of Madrid",
            "Aldo Gangemi, Institute of Cognitive Sciences and Technologies (ISTC)"
        ],
        "published": "Nov. 24, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc08_hendler_ittsw/",
    "segmentation": [
        [
            "Contag I now have three different microphones, each of which is in a different setting, so no matter where I stand in the room, we will either have feedback, shadows, bounces until these guys fix it.",
            "We hope that will get taken care of, and I'm hoping of course they will cut that out of the webcast, but will say so every every time we've done this either here or several of the times at the summer school itself.",
            "I have had the privilege to be the person who gives the talk, which is the introduction to.",
            "The introduction to this semantic Web tutorial and I guess I used to think it was very flattering until I realized it was just that I was the oldest one, had been doing it the longest, so they figured get him upfront, quickly and out of the way, but this thing we've been calling the semantic web.",
            "Ann has various different."
        ],
        [
            "Aspects and comes back and forth at various times.",
            "Has since been set.",
            "Do you have a copy of the slides I handed out?",
            "I gotta make sure this is the same Thursday.",
            "Is this the same slide you have in your hand out now?",
            "I sent John two or three different things.",
            "I want to make sure we all are on the using the same stack.",
            "They can tell.",
            "No, that's the one.",
            "Sorry, give me one minute.",
            "So the only difference between this slide deck and what you've been handed out is this one should have the title introduction to the introduction to a newer should.",
            "I'll just say introduction to.",
            "If I if I start showing slides, that anyone who's trying to follow that has I made worried by the fact that John said you all have copies of the slides and everyone nodded.",
            "But when I asked if this was the same slides, no one has responded.",
            "Do you have copies of our slides?",
            "You got electronic ones OK.",
            "Does anyone actually have them open or you all reading email, email?",
            "OK?",
            "Well then then it won't matter because then you won't be able to tell.",
            "If I gave you the same ones or not.",
            "So then I'm fine so.",
            "We we tend to teach this course.",
            "From the point of view of something called ontologies, which we will get into a little bit.",
            "In this talk a lot in some later talks and what I want to do is sort of set up a little bit the.",
            "The picture of how these things are being used on the web, because there really are several different ways things are being used and it's important to understand some of that.",
            "The talk I gave that I started talking about this was called the Fellowship of the Semantic Web.",
            "The two towers and I call it the two towers and you will see in the talk why that is.",
            "But it's essentially say there's really.",
            "If, if we're careful, there are many different views of ontology, but you will see today things that really arise from 2.",
            "Two different views of the same technology, and it's important sometimes to understand those views so that when the presenters show you things you."
        ],
        [
            "And try to make sure you're seeing it from the right point of view so.",
            "The way I like to describe this lately is that we have this very funny ontological conundrum as I call it, which is that.",
            "One of the things that has hurt adoption of the semantic web for awhile.",
            "It's now going quite well as I'll show you, but one of the things that was a problem was two different viewpoints.",
            "So what would happen is somebody would hear a talk and say, oh, I get it.",
            "This is what I need for my company and then they go to a different talk and hear something we said no, no everything you learned at that other talk was wrong.",
            "You need this other thing and they say, wait wait, wait, Now I'm confused, Ann.",
            "Very often that was hurting people's adoption and what has started to change now is it's becoming easier to find tools and techniques and tutorials, but still pretty much anyone you take will be from one point of view or another, and this one you'll get today.",
            "You're actually going to see both points of view as we go."
        ],
        [
            "Long an part of the reason this is important is that both of these are ways that people are using this technology, one which looks more like a traditional AI technology and one which looks more like a traditional web technology.",
            "So it's not so much surprising that a technology that wants to really come from the perspective of artificial intelligence on the web is going to have a tension between those two very different things.",
            "So one of the.",
            "Towers I talk about is the tower of Expressive Ontology and some of the talks here today are about ontology engineering an getting your ontology.",
            "Write an I like to think of that as Saurons Tower from Lord of the Rings.",
            "It's a tremendous amount of power but you gotta have a lot of artworks around the outside who guarded because if a little Hobbit gets in you know he can drop your wing ring in the crack of Doom and the whole thing can collapse.",
            "I'm assuming you know the story.",
            "By now, if you don't know this story, I don't know where you've been living for the past 20 years, but roughly speaking, right.",
            "Very very powerful, but needs a lot of can."
        ],
        [
            "Trollan in reality there are a lot of views of ontologies.",
            "I can actually put a number of different names up there, but that come from this point of view, which says we want to make the information very, very explicit and very very carefully engineered using some very powerful tools.",
            "But we have to also make sure that the information is correct and this is a technical sense of correct, so inconsistencies coming into a logic based system in less they are carefully controlled.",
            "Can destroy the logic in a traditional logic system that was just if we tried to use pure logic to do almost any kind of reasoning.",
            "If one.",
            "If you have a way you can prove X and you have a way you can prove the inverse of X, then you have a rule that says anything that causes you to believe X and not X must be wrong.",
            "So given that if I was to go out on the web and say, hey, this website wants Obama to win the presidency and this website wants McCain to win the presidency in the US and the.",
            "Fact is that those are not the same person then.",
            "There's a contradiction in a sense.",
            "If one of them, or let's say it says he will be the next president and he will be the next president.",
            "Those both can't be true, so it follows from that inconsistency that you owe me a lot of money.",
            "Right, so first of all, feel free to put it in a box by the door as you leave today I'll happily take your contributions, but clearly as humans you would say something is very broken in the system, which if you can cause it to make a mistake, will make every will in a sense, make every possible mistake in a technical sense now their way."
        ],
        [
            "As we can control it.",
            "So again, in this approach, the big problem is that you must keep things consistent, and that's often very hard.",
            "And there's a lot of tools out there now to help you.",
            "So, for example, this is a tool which was originally written by.",
            "Someone named Aditya Colin Por who's now at IBM, which was the 1st just a couple years ago, was taking a tool for building ontologies and said you know when you get a mistake, the current tools just say you have a mistake but they couldn't show you where the mistake was.",
            "That kind of reasoning is a very different kind of reasoning and so his doctoral thesis now it's built into a number of the tools out there was a technique for finding out.",
            "But just this just give us a good example of the problem I'm talking about.",
            "This was built by the US NASA, actually by the Jet Propulsion Laboratory.",
            "They wanted to use this ontology to manage the information from, you know, things coming back from Mars in the moon and doing a lot of very expensive things.",
            "But there was a problem.",
            "Everybody knew there was an inconsistency in this.",
            "Everyone knew this ontology was formally broken.",
            "No one could figure out what the bug was.",
            "An event because it has roughly, roughly speaking, there are 15137 different classes.",
            "Each one has assertions about it, so you've got about four or 5000 different axioms, any of which could be causing the problem paired with any other axiom.",
            "So you have at least 25 million possible ways that pairwise the problems can come.",
            "And of course it's not going to be in this case, it was a dozen axiom, so you do the math.",
            "It's a very, very scary big number, because essentially what turned out to be the problem in this ontology is a very important logical inconsistency.",
            "The number 2 is not the same as the number 3.",
            "Right now, nowhere in this ontology is that assertion may what actually was made was that the same thing was both the surface of the land and the surface of the water because it was the place where those two things meant an the person who had put in information about the ocean had been thinking in three dimensions.",
            "So he said everything was a volume, and the person who is thinking about the land was think of everything as an area, so they gave it 2 dimensions.",
            "And so the exact if you work through all those axioms, what they really say is this thing has 2 dimensions through that piece of reasoning.",
            "This thing has three dimensions through this other piece of reasoning, and nothing can have have both only two or only three dimensions.",
            "You have those.",
            "That's an inconsistency, so a very complex problem coming through literally a dozen different of the assertions had to be found.",
            "And again, it was typically the case that these systems, if you made an assertion, it would say, oh, you just made a mistake so you would fix it.",
            "You would sort of debug, but now the problem is people wanted to take things made by different people in different places, put them together, get them consistent, and we needed a whole new."
        ],
        [
            "Set of tools so, but what's exciting about this kind of ontology is there's a lot of problems where.",
            "Having a good reasoner is a very important thing.",
            "So when we talk about ontology engineering, it often comes from this perspective of the world, which is that we want to get the right answers.",
            "Right and you will hear.",
            "I mean, I still have this fight today with many people.",
            "About half of them are at this conference and I will be spending the next four days having this conversation over and over and over again about well.",
            "But if you had something that could get you all the ants, the correct answers, wouldn't that be good?",
            "So let's start with why it would be good, right?",
            "And the reason it would be good is there's a lot of very powerful things you can do with a strong model that can analyze your data.",
            "So one of the sort of AI approach to the semantic web is the web makes it easier to find the data, pull it together where a reasoner can look at it, and then the reasoner can do powerful things.",
            "Here's one of the classic kind of examples.",
            "So in a drug company.",
            "They now do what's called combinatorial chemistry.",
            "So in the old days what you did is he said I have this thing and I have this chemical and if I do, you know put it through these sets of tubes and heat this this way and do this stuff.",
            "Then I can see if the water turns blue.",
            "Nowadays what they do is they take a chip and put and essentially have the equivalent of a middle of 1000 or a million different reagents here, and then they put it through something and then they develop it all simultaneously using these very complex things.",
            "So in a couple of hours they can get millions of test results, each of which with a human looks at it takes a long time for the human to figure out what's going on, and is that good or bad.",
            "So they can generate in an hour something that will keep a trained human busy for a year, and they must do that every hour because what a drug company succeeds or fails by nowadays is do they find the right ones of these.",
            "So I am I have a hypothesis that to cure this particular thing I need something that will it's called binding in this particular place.",
            "And something that binds in this particular place I know must not like water.",
            "Must like oxygen, must have three covalent.",
            "Again these complex expressions.",
            "So what I do is using an ontology language.",
            "I can build this very complex set of things which says anything that has this property can't possibly have that property.",
            "Everything must have one of these four properties.",
            "Nothing can have more than two of these properties.",
            "If you have one of these properties, you must also have one of those properties.",
            "Alot of complex statements like that.",
            "So essentially I'm creating a model or theory of the domain.",
            "Now we have techniques and description logic.",
            "It's called realization where I can take that data.",
            "It takes a long time.",
            "In these cases many of these things run on very very large computers for weeks or months, but they grab a whole lot of that data and what they come up with is answers.",
            "So you say which of these?",
            "Which of these cases could possibly be revealing a hydrophilic Arabic?",
            "But all the things I said before hates water, loves oxygen, has two bound, etc OK, and then let's say it comes up with 20 or 30 of them.",
            "Well, then those are the 20 or 30 of them.",
            "You want to test because now instead of testing a million, you only have to test 20 or 30.",
            "Now any extra ones the machine gets that.",
            "Shouldn't have been there, so if you had added one more piece of knowledge that could have made ten of those go away.",
            "That saves a lot of money because each of these you look at is very expensive.",
            "More importantly, if you put in something wrong that causes one of these things not to be looked at, you could miss a drug that could be the difference between whether your company lives or dies.",
            "Literally these the research labs of drug companies have to predict at a level of about one and 40.",
            "So if one of one in every 40 things they try.",
            "Works your Pfizer?",
            "If one in less than 40 of the things you try works, you're out of business.",
            "Right, so it really turns out and again I'm simplifying.",
            "Obviously it's really a multipart process, but again, the idea is you want a lot of data pulled together.",
            "A very complex reasoner, and the whole thing to work together well.",
            "So the important thing in this model, which is very traditional AI model it, was the model that expert systems were built around.",
            "So in a sense, this is think of it as expert systems on the web was built as round the fact that bad or missed answers or money."
        ],
        [
            "On the drain.",
            "OK, now there's another view.",
            "Of this ontology stuff.",
            "Which is to heck with all that.",
            "What ontologies are really are is just ways of letting us find the right data at the right time and then we can use these very data intensive tools to do things.",
            "Again, I'm exact just as I exaggerated the first few.",
            "I'm exaggerating the second view little so in a sense this view says we're going to build the semantic web by simply building a lot of these little ontologies that solve little problems, and then we'll link them up together.",
            "I happen to be, you know, one of the well known proponents of that view.",
            "Well, that view has its own problem.",
            "Right, I mean, who would ever think that if you just link up a lot of different stuff, there could be a problem and you know 2000 years ago?"
        ],
        [
            "Or so.",
            "Somebody stated that you know the best way.",
            "If you have a bunch of people who are trying to build a tower, the best way to make it fall down is make them all speak different languages, right?",
            "That's the biblical explanation of why we all speak.",
            "Why some of you speak German and I speak English and other people speak other languages.",
            "But again, the idea was that intuitively these guys were trying to build a tower and by making it so they couldn't communicate correctly.",
            "They couldn't really solve the problem.",
            "So long ago, AI people said this can't be a good approach.",
            "But what's happened?"
        ],
        [
            "The web is a realization that in this approach you know there's something inherent about the web.",
            "Right, the web is.",
            "You don't get to judge whether all the other pages on the web or good or bad to other, I mean by some abstract notion of good or bad.",
            "You just when you create your web page linked to the things that you know about and that you want to talk about.",
            "OK, and those people do the same thing and eventually you get now according to the latest numbers I've looked at, there's now a little more than a dozen web pages for each and every person on Earth.",
            "That doesn't mean describing each memory, that's just and that's just the open web that doesn't include stuff behind firewalls and big so there are now an order of magnitude more web pages than there are people and web pages is increasing considerably faster than people.",
            "OK, so essentially the amount of information out there just is growing very very fast.",
            "So in a certain sense an uncontrolled growth thing Roseanne.",
            "Then how do we tell wats good information once bad information we use our human reasoning powers, not the machine to do that.",
            "So you Google for something.",
            "Google gives you some suggestions using an algorithm you look at the pages it gave you when you say I like this one.",
            "This one doesn't sound right to me.",
            "Who the heck is this guy?",
            "Oh, this is one of my friends.",
            "I really trust that things like that.",
            "So you use a lot of your human flavor on top of what an algorithm gives you every single day on the web.",
            "So this approach says, could we take that same idea?",
            "So supposing we have a whole lot of different data spaces, and I'm actually going to talk about this later in the afternoon.",
            "An we link these things together, right?",
            "So just as an example, the one up top called Musicbrainz has a lot of information about musical systems.",
            "The one over here called DB Pedia is a representation of the link space of Wikipedia.",
            "Which things in Wikipedia talk about which other things in Wikipedia?",
            "Geonames tells you about places, so you can intuitively see that if somehow you could put together those three datasets without boundaries without them using different representations, or find some way to work between their different data.",
            "Approaches, then you could answer a question like, oh, I'm looking at a musician who grew up near where I did who else, what other musicians grew up near where I did and he would do something like you'd use Musicbrainz to figure out who musicians are.",
            "Then you go to DB Pedia to figure out which of who they are and where they grew up.",
            "And then you go over to Geonames to see which of those places are similar or close to what I want to say.",
            "You know what famous musician grew up near where I did?",
            "We now have the data set to do it, but of course.",
            "There's lots and lots of data there.",
            "How do we find it's back to the problem?",
            "So now we've put the human back in touch with the data.",
            "So in this view, the idea is that we breakdown the barriers between lots of different stuff.",
            "The way we broke it down in the web, and then our hope is that we can somehow use that same stuff of the web to."
        ],
        [
            "Put it back together so in this view.",
            "There's a lot of excitement because now we're talking about something that looks like the web.",
            "OK, now we're talking about something that scales like the web.",
            "So the notion is there's lots and lots of data out there and there's very little semantics out there.",
            "So if you could just add a little bit of semantics to sort of find the right stuff at the right time.",
            "You would have a big win and again I say find I don't necessarily mean search it, it's answer queries.",
            "It's find the right kind of papers for this for the problem you're trying to solve.",
            "Things like that.",
            "So the idea is you want to declare very simple little relations that can be inferred.",
            "Apply these at scale heuristically, perhaps to a very, very large data set.",
            "So again, I have lots of information I can grab from different places about different people, so I see somebody named John Domnick here, and I see somebody with a similar name here, and I see.",
            "Somebody with a similar name there.",
            "There's lots of people in the world with that name.",
            "Right, but if I can start saying hey, but you know, these four are actually the same one, that can be very powerful.",
            "So this guy who's blogging this at live Journal.",
            "I have a reason to believe is the same person who is being described at this Wikipedia page.",
            "Who's the same person who came up in this Google hit?",
            "Who's the same person who?",
            "As at this University, now suddenly I can answer some very powerful queries that I couldn't have answered from those individual datasets, so I needed to do some fairly simple inferencing.",
            "Maybe the inferences if two people have the same email address.",
            "Consider that maybe they're the same person, or you risk quickly assume they're the same person.",
            "Will it be correct?",
            "Not 100% of the time, but if you're doing 8090%, that's something the size of the web you're doing very well, but the key thing here is that.",
            "Now, completeness is no longer necessarily.",
            "Not only is it necessarily not what you're looking for, but not only is it not necessarily what you're looking for.",
            "It's necessarily not what you're looking for.",
            "What I mean by that is remember, time is money, so I saw a talk at an internal Google thing.",
            "This was eight or nine years ago when they were first really getting it up, so I can't really prove that this is today's math, but they said at that time.",
            "If they could get Google results 10 times better, but it would take 2 seconds to answer a query, Google would go out of business right?",
            "So if when you hit Google you had to wait two seconds but you got a better result.",
            "People wouldn't wait.",
            "Furthermore, if they could get it 100 times as good in five seconds, it wouldn't keep them in business.",
            "They'd become a niche business.",
            "They become the specialized search business.",
            "So again on the web, what you want to get is so."
        ],
        [
            "My answers test here's my favorite example of that.",
            "This is from a website called twine made by a company called Radar Networks.",
            "It was just announced yesterday that Wine has come out of beta, so all of you can go join twine and start using it.",
            "So wonder it's a cool site because it adds on top of social networking.",
            "Alittle bit of semantic organization but most importantly what it does is it lets you.",
            "I go out on the web, I find something and I say hey this is something other people doing semantic web research would be interested in.",
            "I can, you know with one one or two clicks of my mouse, put it somewhere where all those people who I share that information we will see it.",
            "So in a sense we can create a sort of magic overlay Journal for web pages for blog entries, for YouTube videos, and where the semantics comes in as if I pull something from YouTube.",
            "They can say, well, now I know that's a video, so I know where the description is and I know what kind of object it is.",
            "And I know know what some of the principles video so I can display it better.",
            "So really, they're not using a lot of semantics, and now they're starting to do a little bit of.",
            "Let's try to make interesting recommendations for people for other people they might want to meet, so they try to find about 5:00.",
            "So first of all, there's no proof of logical correctness for the kind of rules they're using anyway.",
            "Second, long they've got at the time that I last made this slide, which was back in March.",
            "They had over 10 billion relationships between people, so they had, I think, 30 or 40,000 people there.",
            "Now up about 100,000.",
            "An all of what did they belong to?",
            "Who were they friends with?",
            "Things like that?",
            "Facebook has 24 million actually net by now.",
            "It must be 40 or 50 million people in it of that same thing.",
            "So so these are huge amounts of information and I want to pick from all the possible people I could recommend to you who's a couple good ones.",
            "So it's a recommender system, but it's not trying to do a mathematical recommendation is trying to do something interesting.",
            "So here's the top five.",
            "It showed me.",
            "Now I happen to know the top two an.",
            "I took a quick I the second and third one are people who you know I had them edit things or had seen this looked very interesting to me.",
            "This is someone named Trisha who describes herself as the arbiter of style in San Francisco, CA.",
            "Do I look like someone who the arbiter of style from San Francisco, CA would be a good person to friend with?",
            "Guess which of these five so I clicked on right?",
            "People I sorta knew and they were sort of like me or this interesting one.",
            "So I clicked on this interesting one and what I found is we had a lot of common interests in a lot of common friends, so the system had actually picked a good answer.",
            "So in the top five very quickly it had found someone who was interesting to me, so that's why I keep going back to that site, not because it found all the people I already knew, but because it found some interesting new people.",
            "So again, now if I had used the sound and complete algorithm over a set of inference rules, it's very unclear.",
            "First of all, how if I have to wait the you know before I was saying 5 seconds, 10 seconds, this could be ours.",
            "This could be days.",
            "OK, so in the drug discovery I don't care how long it takes if it can get a million things down to 40, that saves me so much time and so much money I can run that calculation for two weeks.",
            "Here I'm hitting on something on the web, it's showing up and I want to see what those answers are an I'm impatient.",
            "eHarmony has has a published figure that says 20 seconds is the most they can get.",
            "Anyone to wait?",
            "OK now, eHarmony is a dating site.",
            "eHarmony is about finding your.",
            "The person you're going to spend the rest of your life with, and when you click it on the web, you want to wait 20 seconds or you're going somewhere else.",
            "That's the average.",
            "Most people won't even wait that long.",
            "OK, so again, you know it's a very different world than the traditional AI world, which says I don't care how long it takes to get me the right answers.",
            "This is I need an answer fast or even more importantly, I need some answers fast and even prefer it.",
            "If I saw some different answers.",
            "So, for example, if you go to Google Now.",
            "You'll notice Google works very hard to in the top ten give you different things, so in a few years ago, if you typed my name to Google, I would be 17 of the top 20 hits.",
            "Now if you type my name to Google, what you will find is 20.",
            "I think 14 different people and I'm only two of them.",
            "Right, so it's so it's using lots and lots of touristics and guesses and rules, and so it's not using semantics to do that.",
            "It's using the fact that it has just a Brazilian piece of information and algorithms that can kind of cluster things into different parts and tries to pull from different things.",
            "But again, same story.",
            "It's they found it's better if they can get a range of answers.",
            "So if you type something very narrow and they can only find a bunch of stuff in the same space, that's what you see.",
            "If you see something that they know a lot about.",
            "They try to have the algorithm as it pulls things together.",
            "Prefer set for different than same things so it's all done by indexing.",
            "OK, so again I want something fast.",
            "I wanted to give me some good answers and if it does so now if I look at these five and I think they're all stupid.",
            "I'm also not going to spend much time on this site.",
            "For the rest, you know tomorrow I'm not coming back, right?",
            "So if Facebook everybody if Facebook didn't let you pick your friends if it just told you, here's 10 people I think are your favorite friends and it did a bad job.",
            "They won't have a lot of users today, right?",
            "So again, the idea is that on the web, something that can help."
        ],
        [
            "Let's get to the right place, can be very important.",
            "OK, so again these are the kind of tensions you see.",
            "So the traditional ontology engineering view can ask of the simple view.",
            "But wait a minute, what about presence?",
            "So here's flickering for protein.",
            "Here's this semantic website Fujitsu built back in 2004 that was managing their information through a bunch of services about proteins.",
            "Right, which one would you rather your doctor is trying to look at or medical researchers looking at something where protein is just so you want them Googling for the information or you want them to using something that has a good expressive thing?",
            "The drug company doesn't want?",
            "A few good suggestions.",
            "Right, some of which are cute.",
            "It wants as many as possible of the correct stuff.",
            "These other things want to very different things, so again, you have these very different parts of the world.",
            "Now there's a lot of problems which live in the middle.",
            "In fact, that's where a lot of the promise of the semantic web is.",
            "So if you were building a military system that was going to put bombs on your enemies, you really don't want it doing this kind of guessing.",
            "On the other hand, if it takes 3 days to tell you where you should, you know who you should attack an hour from now.",
            "That's also useless, so you need something.",
            "I hate using that example is just one that was funded a lot of times in the past and has never really worked again because it's hard or.",
            "You're taking some kind of statistically classified natural language, and you're trying to use meaning to somehow link link those things up so one of the big exciting areas you'll hear about in semantic web is what's called semantic search.",
            "Enhance the ability of search engines by using some kind of semantic model.",
            "Well, that's really nice power set the first company to actually do a pretty good job Vic.",
            "I bought by Microsoft for 100 million dollars, right?",
            "That's a lot of money even in today's economy.",
            "I think it's about 14 euros, but the that was a joke."
        ],
        [
            "Ontology mapping.",
            "You'll hear a lot about mapping and merging of ontologies when you're taking these very complex, very expensive, extensive formal models, this is very."
        ],
        [
            "Hard when you're taking something like this.",
            "This was, by the way somebody was showing how they taught their seven year old to use the semantic Web.",
            "I saw an even better example last night, or a lassala who's another early semantic web?",
            "Bring his daughter?",
            "He sort of showed her what relationships are and he she came back later and sort of put on a piece of paper.",
            "You know I am a girl and my sister is a girl and we live here things like that.",
            "So the notion of you know, kind of representing the world is a set of relationships.",
            "Isn't that hard until you learn it is.",
            "Right, it's only when people start telling you no no, you have to get it right that the problem comes in.",
            "It's actually pretty easy, so this was a bunch of stuff about Star Wars and this was a little Star Wars ontology.",
            "Somebody built this as an example, supposing you want to link those two up, well, we got Darth Vader there and Darth Vader there.",
            "What's the chances that they're different?",
            "Darth Vader's only one in that whole universe.",
            "It's easy, so you can put in a same as link, and now suddenly these two ontologies can share information and you have more information.",
            "You can't do that with these big classical ontologies.",
            "Because if you say two things are logically equivalent and there really aren't, you're adding and you're adding an inconsistency here, and adding and incorrectness.",
            "So again, some of it is is do you want to get your results?",
            "Alot of them fast or some of them fast?",
            "Or do you want to get all of them right?",
            "So again, we see that tension again and again throughout."
        ],
        [
            "All these things that happen.",
            "One of the problems with my research Group One of the things you'll see here at this conference a lot is that.",
            "So this was the description, so there's a counter.",
            "The Semantic web challenge.",
            "This year we added a new category called the Billion Triple Challenge and the idea of the billion Triple Challenge was not.",
            "You had to find a billion triples and show us what you could do.",
            "We got a lot of submissions that said, oh look, I got a billion things that are bio, you know our data from a chemistry thing.",
            "Let me show you what I can do and we said no, you have to use the billion triples we gave you, and those billion triples were created by Yahoo scraping websites.",
            "Us going to lots and lots of different people with different semantic web projects saying give us a chunk of stuff.",
            "So some of these trips, some of these things and down in the graph have complex ontologies describing them.",
            "Some have no ontologies describing him, some are very high quality data, some are very low quality data and the challenge was very simple.",
            "What can you do with this?",
            "Right, so the best best way I've seen of sort of describing this problem.",
            "There's a project you'll probably hear about over the next few days, somewhere you'll run into Lark.",
            "Save the Large Knowledge Collider.",
            "I believe the PII is Frank van Harmelen and deter offenses involving several other people, and their slogan is current reasoning systems do not scale to the requirements of their hottest applications.",
            "And that's really what it's all about.",
            "Is.",
            "We know a lot of stuff about reasoning, and we know a lot of the stuff about scaling, but putting those together is hard, and most of the work that's gone on today and semantic web circles has focused on a lot of data, a little reasoning or a lot of reasoning, but not a lot of web use, in other words."
        ],
        [
            "Not giving up the the Lexus of control.",
            "OK, if you can understand your data when you have a model when you're doing expressive ontologies, there's a lot you can do.",
            "So again, the old AI slogan, knowledge is power is correct and on the web it's also correct.",
            "But the problem is if I limit the domain to one thing that I know a lot about, I know all there is to know about this kind of drug.",
            "You know, I got 50,000 classes of description of some particular cancer thing.",
            "That's very, very powerful.",
            "As long as what you care about is that particular cancer thing.",
            "But it's not very powerful when you go to Facebook.",
            "OK, in less the only thing you're looking for on Facebook as people have exactly that kind of cancer and who have had somehow in their Facebook profiles, decided to describe, describe at the molecular level what their DNA is like.",
            "There aren't a lot of those that you will find, so again, the more you know about something, the more you can do with it.",
            "The less you know about something, the harder it is, and there's a lot of space in the middle and."
        ],
        [
            "I think I'm coming close and so so the.",
            "Semantic web world.",
            "You'll see a lot of different diagrams.",
            "There's the famous layer cake diagram.",
            "There's also things.",
            "One I.",
            "This is when I actually put up around 2002 and said, you know, a problem.",
            "We're going to have in this field is all of these different languages were playing with we call ontology languages, but they really have very different things.",
            "They're doing.",
            "Some of them are just modeling simple relationships, some of them are modeling very complex information.",
            "And we're going to confuse the outside world, which comes to us.",
            "So you come to a meeting like this and you learn about ontology engineering.",
            "And some of the people who are going to present today are primarily going to be talking about stuff at this end this year we added actually a new talk to talk a little bit more about what's going down down.",
            "At this end, I'll be giving that one again later."
        ],
        [
            "So.",
            "These things are very."
        ],
        [
            "Different and it's important to understand and this matters a lot, because if you're trying to do research in the space, if you're trying to do.",
            "You know, make a company in the space.",
            "They are very different things and they have different concerns.",
            "So one of these views what you're primarily work worried about is your ontology creation and modeling and expressivity an the other view you'll hear a lot of talks at this conference about triplestores about scaling about the language sparkle.",
            "A way to think about it is if you go back to early database literature, the semantic Web is a lot like the database world was 2530 years ago.",
            "Clearly a very powerful technology that clearly fits an important niche, the niche being the web.",
            "And a lot of people trying to figure out how to use it in different models, and so there's research you can find back.",
            "Then paper is still to this day papers about data languages and data calculi and data reasoning, as it were an other papers about how do I keep the thing fast?",
            "How do I make it so it doesn't pages often as you go around this conference as you look at the posters as you look at the papers you will see people talking about how do I add?",
            "How do I keep the system consistent if I want to have information?",
            "That you can have five fingers on a hand, but only one of them can be a thumb qualified cardinality restrictions or an you have other people who are saying if you use a bitmap representation, you can get a 50 million triples into a 11 GB online memory.",
            "And the reason you're seeing both those things at the same conference is coming from the fact that the eventual thing that puts them together is really important, and that we're exploring innocence from several different."
        ],
        [
            "And and this talk today."
        ],
        [
            "So this is just another way of saying what I just said.",
            "This is one of my favorite projects.",
            "I'm on the Advisory Board of the project going on at the Cleveland Clinic.",
            "Cleveland Clinic is the largest heart research organization in the whole world, so these are if you have a heart attack, the best place you can end up is at the Cleveland Clinic.",
            "There are more people there.",
            "They do more procedures.",
            "They have the best doctors but they have a whole team of researchers.",
            "They group.",
            "We're working with there.",
            "Has I think 6 faculty, 6 senior researchers and they publish approximately 150 papers a year, some of which are the most cited papers in medicine.",
            "OK, very powerful group an their promise.",
            "They gotta bring a lot of information from all over the hospital and one end.",
            "So it sounds very much like that low end semantic web problem and they gotta put it together with inferencing about what heart, what kind of operations have what kind of things, 'cause what they're trying to solve these problems like.",
            "If we do this thing before we do that thing, do we get a better result?",
            "But the problem is we did these two different things to patients at different times.",
            "They were positive and one may have come in through his primary doctor in one may have come in through a specialist, so we have to realize this was the same person and that it was that they had been treated.",
            "These two different ways, things that so they have to go back through their old data to find situations.",
            "So they're putting together an RDF project that was being done too.",
            "Rationalize their whole data system and psych, which is a very big knowledge representation system.",
            "Being the inference engine and it sort of worked by they were funding each of them to do something a little different and the guy who runs runs.",
            "This project looked at them and said, that's great.",
            "I want you to put those two together.",
            "Of course, both sets of researchers say that's impossible.",
            "He said OK. Then give me back the money and I'll find someone who can do it.",
            "And of course, they said when we said impossible what we meant is easy.",
            "And we'll be happy to do it.",
            "Just keep our money going so they were really forced to work together an what's interesting is this is the RDF view of the world and you'll notice the very very top.",
            "There's something in the corner that says and then you go off to psych and this is the side view of the world which says you do all this stuff and then sort it down.",
            "At the bottom is sparkled in a semantic web database, but these important thing is these diagrams hook up and in fact over the past year they've been forced to really make this thing work.",
            "And they're doing some spectacular things.",
            "They're doing complex inferencing over very large datasets and they do it by finding a sort of middle level of expressivity site can express queries at that level.",
            "Those break that those are then taken by a different system to find the right data.",
            "Those things process that data and pull it back at that level of description, and then site takes it up to much more complex inferencing and algorithms.",
            "And the reason it works so nicely.",
            "As you've got a filtering happening in the middle.",
            "So the database is returning only things that could could possibly be correct.",
            "Answers to that question.",
            "It's not necessarily giving all the answers, and some of the things that gives may not be.",
            "The psych system is now doing complex reasoning, but only on the 100 or 200 things that came back, not the 200 million things that are in the native database, so again."
        ],
        [
            "A lot of excitement there, so today what you're going to be hearing about in the rest of this symposium.",
            "Tutorial An in fact in the next 5 days what you'll be hearing about or for whatever over the whole conference is really.",
            "These two different views of the world coming together, different people working on different aspects of it an A whole vocabulary that as you master it, you need to understand that all of this is going on.",
            "So we're going to teach you about the Owl Language, Ontology engineering and ontology design.",
            "So how to do the modeling?",
            "It doesn't matter whether you're building a small one or a big one, you want to get it right.",
            "OK, or at least you want to understand what it says, but then some aspects of it may be much more important if what you're going after is powerful reasoning and some other aspects of it might be more important if what you're going after a scalable reasoning.",
            "So we're also going to talk about some principles of using it, interoperability, and the use in web services.",
            "And then we're also going to have some talks on using these semantics so applications and we're going to talk about some of these things.",
            "I've been mentioning semantic search linked data.",
            "And web app so you can get a feel for what are the kind of space of these different kind of applications out there at both sides and to a certain degree in the middle, by the way, Now that I've given this talk a lot, you'll hear lots of people trying to claim what they do is in the middle.",
            "Be sceptical.",
            "There's a lot of space in that middle.",
            "Unfortunately, right?",
            "So a lot of web stuff with a little semantics says look how how much semantics we're using and.",
            "You know the AI guy walks in and says boy, that's not much.",
            "And then this guy says look how much data we're using.",
            "We have 100 million things in our database and the Semantic Web guide us 100 million.",
            "When are you going to try something big, right?",
            "So again, very different worlds and they're coming together and there's a lot of excitement.",
            "And as you go through the conference, what we hope we will give you is enough of the different views and the sort of vocabulary you need to be able to go through it.",
            "So I'm going to stop there.",
            "I.",
            "Turning it over too soon next.",
            "OK so."
        ],
        [
            "Oh, there we go.",
            "So the.",
            "So now we're going to go on to the show.",
            "I'm going to have to disappear for a little while this morning.",
            "I'll probably be back around lunchtime and I'll be.",
            "I'll be back after lunch to give another talk and I'll be happy to take your questions offline.",
            "Last year we tried to let me answer questions now and those of you who know me know why that didn't work very well because each question got about a 10 minute answer.",
            "And by the time we were finished, John was like an the last speaker of the day.",
            "So I'll take your questions what I wanted a later time coming up."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Contag I now have three different microphones, each of which is in a different setting, so no matter where I stand in the room, we will either have feedback, shadows, bounces until these guys fix it.",
                    "label": 0
                },
                {
                    "sent": "We hope that will get taken care of, and I'm hoping of course they will cut that out of the webcast, but will say so every every time we've done this either here or several of the times at the summer school itself.",
                    "label": 0
                },
                {
                    "sent": "I have had the privilege to be the person who gives the talk, which is the introduction to.",
                    "label": 0
                },
                {
                    "sent": "The introduction to this semantic Web tutorial and I guess I used to think it was very flattering until I realized it was just that I was the oldest one, had been doing it the longest, so they figured get him upfront, quickly and out of the way, but this thing we've been calling the semantic web.",
                    "label": 1
                },
                {
                    "sent": "Ann has various different.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aspects and comes back and forth at various times.",
                    "label": 0
                },
                {
                    "sent": "Has since been set.",
                    "label": 0
                },
                {
                    "sent": "Do you have a copy of the slides I handed out?",
                    "label": 0
                },
                {
                    "sent": "I gotta make sure this is the same Thursday.",
                    "label": 0
                },
                {
                    "sent": "Is this the same slide you have in your hand out now?",
                    "label": 0
                },
                {
                    "sent": "I sent John two or three different things.",
                    "label": 0
                },
                {
                    "sent": "I want to make sure we all are on the using the same stack.",
                    "label": 0
                },
                {
                    "sent": "They can tell.",
                    "label": 0
                },
                {
                    "sent": "No, that's the one.",
                    "label": 0
                },
                {
                    "sent": "Sorry, give me one minute.",
                    "label": 0
                },
                {
                    "sent": "So the only difference between this slide deck and what you've been handed out is this one should have the title introduction to the introduction to a newer should.",
                    "label": 0
                },
                {
                    "sent": "I'll just say introduction to.",
                    "label": 0
                },
                {
                    "sent": "If I if I start showing slides, that anyone who's trying to follow that has I made worried by the fact that John said you all have copies of the slides and everyone nodded.",
                    "label": 0
                },
                {
                    "sent": "But when I asked if this was the same slides, no one has responded.",
                    "label": 0
                },
                {
                    "sent": "Do you have copies of our slides?",
                    "label": 0
                },
                {
                    "sent": "You got electronic ones OK.",
                    "label": 0
                },
                {
                    "sent": "Does anyone actually have them open or you all reading email, email?",
                    "label": 0
                },
                {
                    "sent": "OK?",
                    "label": 0
                },
                {
                    "sent": "Well then then it won't matter because then you won't be able to tell.",
                    "label": 0
                },
                {
                    "sent": "If I gave you the same ones or not.",
                    "label": 0
                },
                {
                    "sent": "So then I'm fine so.",
                    "label": 0
                },
                {
                    "sent": "We we tend to teach this course.",
                    "label": 0
                },
                {
                    "sent": "From the point of view of something called ontologies, which we will get into a little bit.",
                    "label": 0
                },
                {
                    "sent": "In this talk a lot in some later talks and what I want to do is sort of set up a little bit the.",
                    "label": 0
                },
                {
                    "sent": "The picture of how these things are being used on the web, because there really are several different ways things are being used and it's important to understand some of that.",
                    "label": 0
                },
                {
                    "sent": "The talk I gave that I started talking about this was called the Fellowship of the Semantic Web.",
                    "label": 0
                },
                {
                    "sent": "The two towers and I call it the two towers and you will see in the talk why that is.",
                    "label": 0
                },
                {
                    "sent": "But it's essentially say there's really.",
                    "label": 0
                },
                {
                    "sent": "If, if we're careful, there are many different views of ontology, but you will see today things that really arise from 2.",
                    "label": 0
                },
                {
                    "sent": "Two different views of the same technology, and it's important sometimes to understand those views so that when the presenters show you things you.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And try to make sure you're seeing it from the right point of view so.",
                    "label": 0
                },
                {
                    "sent": "The way I like to describe this lately is that we have this very funny ontological conundrum as I call it, which is that.",
                    "label": 0
                },
                {
                    "sent": "One of the things that has hurt adoption of the semantic web for awhile.",
                    "label": 1
                },
                {
                    "sent": "It's now going quite well as I'll show you, but one of the things that was a problem was two different viewpoints.",
                    "label": 0
                },
                {
                    "sent": "So what would happen is somebody would hear a talk and say, oh, I get it.",
                    "label": 0
                },
                {
                    "sent": "This is what I need for my company and then they go to a different talk and hear something we said no, no everything you learned at that other talk was wrong.",
                    "label": 0
                },
                {
                    "sent": "You need this other thing and they say, wait wait, wait, Now I'm confused, Ann.",
                    "label": 0
                },
                {
                    "sent": "Very often that was hurting people's adoption and what has started to change now is it's becoming easier to find tools and techniques and tutorials, but still pretty much anyone you take will be from one point of view or another, and this one you'll get today.",
                    "label": 0
                },
                {
                    "sent": "You're actually going to see both points of view as we go.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Long an part of the reason this is important is that both of these are ways that people are using this technology, one which looks more like a traditional AI technology and one which looks more like a traditional web technology.",
                    "label": 0
                },
                {
                    "sent": "So it's not so much surprising that a technology that wants to really come from the perspective of artificial intelligence on the web is going to have a tension between those two very different things.",
                    "label": 0
                },
                {
                    "sent": "So one of the.",
                    "label": 0
                },
                {
                    "sent": "Towers I talk about is the tower of Expressive Ontology and some of the talks here today are about ontology engineering an getting your ontology.",
                    "label": 0
                },
                {
                    "sent": "Write an I like to think of that as Saurons Tower from Lord of the Rings.",
                    "label": 0
                },
                {
                    "sent": "It's a tremendous amount of power but you gotta have a lot of artworks around the outside who guarded because if a little Hobbit gets in you know he can drop your wing ring in the crack of Doom and the whole thing can collapse.",
                    "label": 0
                },
                {
                    "sent": "I'm assuming you know the story.",
                    "label": 0
                },
                {
                    "sent": "By now, if you don't know this story, I don't know where you've been living for the past 20 years, but roughly speaking, right.",
                    "label": 0
                },
                {
                    "sent": "Very very powerful, but needs a lot of can.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Trollan in reality there are a lot of views of ontologies.",
                    "label": 0
                },
                {
                    "sent": "I can actually put a number of different names up there, but that come from this point of view, which says we want to make the information very, very explicit and very very carefully engineered using some very powerful tools.",
                    "label": 0
                },
                {
                    "sent": "But we have to also make sure that the information is correct and this is a technical sense of correct, so inconsistencies coming into a logic based system in less they are carefully controlled.",
                    "label": 0
                },
                {
                    "sent": "Can destroy the logic in a traditional logic system that was just if we tried to use pure logic to do almost any kind of reasoning.",
                    "label": 0
                },
                {
                    "sent": "If one.",
                    "label": 0
                },
                {
                    "sent": "If you have a way you can prove X and you have a way you can prove the inverse of X, then you have a rule that says anything that causes you to believe X and not X must be wrong.",
                    "label": 0
                },
                {
                    "sent": "So given that if I was to go out on the web and say, hey, this website wants Obama to win the presidency and this website wants McCain to win the presidency in the US and the.",
                    "label": 0
                },
                {
                    "sent": "Fact is that those are not the same person then.",
                    "label": 0
                },
                {
                    "sent": "There's a contradiction in a sense.",
                    "label": 0
                },
                {
                    "sent": "If one of them, or let's say it says he will be the next president and he will be the next president.",
                    "label": 0
                },
                {
                    "sent": "Those both can't be true, so it follows from that inconsistency that you owe me a lot of money.",
                    "label": 0
                },
                {
                    "sent": "Right, so first of all, feel free to put it in a box by the door as you leave today I'll happily take your contributions, but clearly as humans you would say something is very broken in the system, which if you can cause it to make a mistake, will make every will in a sense, make every possible mistake in a technical sense now their way.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we can control it.",
                    "label": 0
                },
                {
                    "sent": "So again, in this approach, the big problem is that you must keep things consistent, and that's often very hard.",
                    "label": 0
                },
                {
                    "sent": "And there's a lot of tools out there now to help you.",
                    "label": 0
                },
                {
                    "sent": "So, for example, this is a tool which was originally written by.",
                    "label": 0
                },
                {
                    "sent": "Someone named Aditya Colin Por who's now at IBM, which was the 1st just a couple years ago, was taking a tool for building ontologies and said you know when you get a mistake, the current tools just say you have a mistake but they couldn't show you where the mistake was.",
                    "label": 0
                },
                {
                    "sent": "That kind of reasoning is a very different kind of reasoning and so his doctoral thesis now it's built into a number of the tools out there was a technique for finding out.",
                    "label": 0
                },
                {
                    "sent": "But just this just give us a good example of the problem I'm talking about.",
                    "label": 0
                },
                {
                    "sent": "This was built by the US NASA, actually by the Jet Propulsion Laboratory.",
                    "label": 0
                },
                {
                    "sent": "They wanted to use this ontology to manage the information from, you know, things coming back from Mars in the moon and doing a lot of very expensive things.",
                    "label": 0
                },
                {
                    "sent": "But there was a problem.",
                    "label": 0
                },
                {
                    "sent": "Everybody knew there was an inconsistency in this.",
                    "label": 0
                },
                {
                    "sent": "Everyone knew this ontology was formally broken.",
                    "label": 0
                },
                {
                    "sent": "No one could figure out what the bug was.",
                    "label": 0
                },
                {
                    "sent": "An event because it has roughly, roughly speaking, there are 15137 different classes.",
                    "label": 0
                },
                {
                    "sent": "Each one has assertions about it, so you've got about four or 5000 different axioms, any of which could be causing the problem paired with any other axiom.",
                    "label": 0
                },
                {
                    "sent": "So you have at least 25 million possible ways that pairwise the problems can come.",
                    "label": 0
                },
                {
                    "sent": "And of course it's not going to be in this case, it was a dozen axiom, so you do the math.",
                    "label": 0
                },
                {
                    "sent": "It's a very, very scary big number, because essentially what turned out to be the problem in this ontology is a very important logical inconsistency.",
                    "label": 0
                },
                {
                    "sent": "The number 2 is not the same as the number 3.",
                    "label": 0
                },
                {
                    "sent": "Right now, nowhere in this ontology is that assertion may what actually was made was that the same thing was both the surface of the land and the surface of the water because it was the place where those two things meant an the person who had put in information about the ocean had been thinking in three dimensions.",
                    "label": 0
                },
                {
                    "sent": "So he said everything was a volume, and the person who is thinking about the land was think of everything as an area, so they gave it 2 dimensions.",
                    "label": 0
                },
                {
                    "sent": "And so the exact if you work through all those axioms, what they really say is this thing has 2 dimensions through that piece of reasoning.",
                    "label": 0
                },
                {
                    "sent": "This thing has three dimensions through this other piece of reasoning, and nothing can have have both only two or only three dimensions.",
                    "label": 0
                },
                {
                    "sent": "You have those.",
                    "label": 0
                },
                {
                    "sent": "That's an inconsistency, so a very complex problem coming through literally a dozen different of the assertions had to be found.",
                    "label": 0
                },
                {
                    "sent": "And again, it was typically the case that these systems, if you made an assertion, it would say, oh, you just made a mistake so you would fix it.",
                    "label": 0
                },
                {
                    "sent": "You would sort of debug, but now the problem is people wanted to take things made by different people in different places, put them together, get them consistent, and we needed a whole new.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Set of tools so, but what's exciting about this kind of ontology is there's a lot of problems where.",
                    "label": 0
                },
                {
                    "sent": "Having a good reasoner is a very important thing.",
                    "label": 0
                },
                {
                    "sent": "So when we talk about ontology engineering, it often comes from this perspective of the world, which is that we want to get the right answers.",
                    "label": 0
                },
                {
                    "sent": "Right and you will hear.",
                    "label": 0
                },
                {
                    "sent": "I mean, I still have this fight today with many people.",
                    "label": 0
                },
                {
                    "sent": "About half of them are at this conference and I will be spending the next four days having this conversation over and over and over again about well.",
                    "label": 0
                },
                {
                    "sent": "But if you had something that could get you all the ants, the correct answers, wouldn't that be good?",
                    "label": 0
                },
                {
                    "sent": "So let's start with why it would be good, right?",
                    "label": 0
                },
                {
                    "sent": "And the reason it would be good is there's a lot of very powerful things you can do with a strong model that can analyze your data.",
                    "label": 0
                },
                {
                    "sent": "So one of the sort of AI approach to the semantic web is the web makes it easier to find the data, pull it together where a reasoner can look at it, and then the reasoner can do powerful things.",
                    "label": 1
                },
                {
                    "sent": "Here's one of the classic kind of examples.",
                    "label": 0
                },
                {
                    "sent": "So in a drug company.",
                    "label": 0
                },
                {
                    "sent": "They now do what's called combinatorial chemistry.",
                    "label": 0
                },
                {
                    "sent": "So in the old days what you did is he said I have this thing and I have this chemical and if I do, you know put it through these sets of tubes and heat this this way and do this stuff.",
                    "label": 0
                },
                {
                    "sent": "Then I can see if the water turns blue.",
                    "label": 0
                },
                {
                    "sent": "Nowadays what they do is they take a chip and put and essentially have the equivalent of a middle of 1000 or a million different reagents here, and then they put it through something and then they develop it all simultaneously using these very complex things.",
                    "label": 0
                },
                {
                    "sent": "So in a couple of hours they can get millions of test results, each of which with a human looks at it takes a long time for the human to figure out what's going on, and is that good or bad.",
                    "label": 0
                },
                {
                    "sent": "So they can generate in an hour something that will keep a trained human busy for a year, and they must do that every hour because what a drug company succeeds or fails by nowadays is do they find the right ones of these.",
                    "label": 0
                },
                {
                    "sent": "So I am I have a hypothesis that to cure this particular thing I need something that will it's called binding in this particular place.",
                    "label": 0
                },
                {
                    "sent": "And something that binds in this particular place I know must not like water.",
                    "label": 0
                },
                {
                    "sent": "Must like oxygen, must have three covalent.",
                    "label": 0
                },
                {
                    "sent": "Again these complex expressions.",
                    "label": 0
                },
                {
                    "sent": "So what I do is using an ontology language.",
                    "label": 0
                },
                {
                    "sent": "I can build this very complex set of things which says anything that has this property can't possibly have that property.",
                    "label": 0
                },
                {
                    "sent": "Everything must have one of these four properties.",
                    "label": 0
                },
                {
                    "sent": "Nothing can have more than two of these properties.",
                    "label": 0
                },
                {
                    "sent": "If you have one of these properties, you must also have one of those properties.",
                    "label": 0
                },
                {
                    "sent": "Alot of complex statements like that.",
                    "label": 0
                },
                {
                    "sent": "So essentially I'm creating a model or theory of the domain.",
                    "label": 0
                },
                {
                    "sent": "Now we have techniques and description logic.",
                    "label": 0
                },
                {
                    "sent": "It's called realization where I can take that data.",
                    "label": 0
                },
                {
                    "sent": "It takes a long time.",
                    "label": 0
                },
                {
                    "sent": "In these cases many of these things run on very very large computers for weeks or months, but they grab a whole lot of that data and what they come up with is answers.",
                    "label": 0
                },
                {
                    "sent": "So you say which of these?",
                    "label": 0
                },
                {
                    "sent": "Which of these cases could possibly be revealing a hydrophilic Arabic?",
                    "label": 0
                },
                {
                    "sent": "But all the things I said before hates water, loves oxygen, has two bound, etc OK, and then let's say it comes up with 20 or 30 of them.",
                    "label": 0
                },
                {
                    "sent": "Well, then those are the 20 or 30 of them.",
                    "label": 0
                },
                {
                    "sent": "You want to test because now instead of testing a million, you only have to test 20 or 30.",
                    "label": 0
                },
                {
                    "sent": "Now any extra ones the machine gets that.",
                    "label": 0
                },
                {
                    "sent": "Shouldn't have been there, so if you had added one more piece of knowledge that could have made ten of those go away.",
                    "label": 0
                },
                {
                    "sent": "That saves a lot of money because each of these you look at is very expensive.",
                    "label": 0
                },
                {
                    "sent": "More importantly, if you put in something wrong that causes one of these things not to be looked at, you could miss a drug that could be the difference between whether your company lives or dies.",
                    "label": 0
                },
                {
                    "sent": "Literally these the research labs of drug companies have to predict at a level of about one and 40.",
                    "label": 0
                },
                {
                    "sent": "So if one of one in every 40 things they try.",
                    "label": 0
                },
                {
                    "sent": "Works your Pfizer?",
                    "label": 0
                },
                {
                    "sent": "If one in less than 40 of the things you try works, you're out of business.",
                    "label": 0
                },
                {
                    "sent": "Right, so it really turns out and again I'm simplifying.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's really a multipart process, but again, the idea is you want a lot of data pulled together.",
                    "label": 0
                },
                {
                    "sent": "A very complex reasoner, and the whole thing to work together well.",
                    "label": 0
                },
                {
                    "sent": "So the important thing in this model, which is very traditional AI model it, was the model that expert systems were built around.",
                    "label": 0
                },
                {
                    "sent": "So in a sense, this is think of it as expert systems on the web was built as round the fact that bad or missed answers or money.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On the drain.",
                    "label": 0
                },
                {
                    "sent": "OK, now there's another view.",
                    "label": 0
                },
                {
                    "sent": "Of this ontology stuff.",
                    "label": 0
                },
                {
                    "sent": "Which is to heck with all that.",
                    "label": 0
                },
                {
                    "sent": "What ontologies are really are is just ways of letting us find the right data at the right time and then we can use these very data intensive tools to do things.",
                    "label": 0
                },
                {
                    "sent": "Again, I'm exact just as I exaggerated the first few.",
                    "label": 0
                },
                {
                    "sent": "I'm exaggerating the second view little so in a sense this view says we're going to build the semantic web by simply building a lot of these little ontologies that solve little problems, and then we'll link them up together.",
                    "label": 1
                },
                {
                    "sent": "I happen to be, you know, one of the well known proponents of that view.",
                    "label": 0
                },
                {
                    "sent": "Well, that view has its own problem.",
                    "label": 0
                },
                {
                    "sent": "Right, I mean, who would ever think that if you just link up a lot of different stuff, there could be a problem and you know 2000 years ago?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or so.",
                    "label": 0
                },
                {
                    "sent": "Somebody stated that you know the best way.",
                    "label": 0
                },
                {
                    "sent": "If you have a bunch of people who are trying to build a tower, the best way to make it fall down is make them all speak different languages, right?",
                    "label": 0
                },
                {
                    "sent": "That's the biblical explanation of why we all speak.",
                    "label": 0
                },
                {
                    "sent": "Why some of you speak German and I speak English and other people speak other languages.",
                    "label": 0
                },
                {
                    "sent": "But again, the idea was that intuitively these guys were trying to build a tower and by making it so they couldn't communicate correctly.",
                    "label": 0
                },
                {
                    "sent": "They couldn't really solve the problem.",
                    "label": 0
                },
                {
                    "sent": "So long ago, AI people said this can't be a good approach.",
                    "label": 0
                },
                {
                    "sent": "But what's happened?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The web is a realization that in this approach you know there's something inherent about the web.",
                    "label": 0
                },
                {
                    "sent": "Right, the web is.",
                    "label": 0
                },
                {
                    "sent": "You don't get to judge whether all the other pages on the web or good or bad to other, I mean by some abstract notion of good or bad.",
                    "label": 0
                },
                {
                    "sent": "You just when you create your web page linked to the things that you know about and that you want to talk about.",
                    "label": 0
                },
                {
                    "sent": "OK, and those people do the same thing and eventually you get now according to the latest numbers I've looked at, there's now a little more than a dozen web pages for each and every person on Earth.",
                    "label": 0
                },
                {
                    "sent": "That doesn't mean describing each memory, that's just and that's just the open web that doesn't include stuff behind firewalls and big so there are now an order of magnitude more web pages than there are people and web pages is increasing considerably faster than people.",
                    "label": 0
                },
                {
                    "sent": "OK, so essentially the amount of information out there just is growing very very fast.",
                    "label": 0
                },
                {
                    "sent": "So in a certain sense an uncontrolled growth thing Roseanne.",
                    "label": 0
                },
                {
                    "sent": "Then how do we tell wats good information once bad information we use our human reasoning powers, not the machine to do that.",
                    "label": 0
                },
                {
                    "sent": "So you Google for something.",
                    "label": 0
                },
                {
                    "sent": "Google gives you some suggestions using an algorithm you look at the pages it gave you when you say I like this one.",
                    "label": 0
                },
                {
                    "sent": "This one doesn't sound right to me.",
                    "label": 0
                },
                {
                    "sent": "Who the heck is this guy?",
                    "label": 0
                },
                {
                    "sent": "Oh, this is one of my friends.",
                    "label": 0
                },
                {
                    "sent": "I really trust that things like that.",
                    "label": 0
                },
                {
                    "sent": "So you use a lot of your human flavor on top of what an algorithm gives you every single day on the web.",
                    "label": 0
                },
                {
                    "sent": "So this approach says, could we take that same idea?",
                    "label": 0
                },
                {
                    "sent": "So supposing we have a whole lot of different data spaces, and I'm actually going to talk about this later in the afternoon.",
                    "label": 0
                },
                {
                    "sent": "An we link these things together, right?",
                    "label": 0
                },
                {
                    "sent": "So just as an example, the one up top called Musicbrainz has a lot of information about musical systems.",
                    "label": 0
                },
                {
                    "sent": "The one over here called DB Pedia is a representation of the link space of Wikipedia.",
                    "label": 0
                },
                {
                    "sent": "Which things in Wikipedia talk about which other things in Wikipedia?",
                    "label": 0
                },
                {
                    "sent": "Geonames tells you about places, so you can intuitively see that if somehow you could put together those three datasets without boundaries without them using different representations, or find some way to work between their different data.",
                    "label": 0
                },
                {
                    "sent": "Approaches, then you could answer a question like, oh, I'm looking at a musician who grew up near where I did who else, what other musicians grew up near where I did and he would do something like you'd use Musicbrainz to figure out who musicians are.",
                    "label": 0
                },
                {
                    "sent": "Then you go to DB Pedia to figure out which of who they are and where they grew up.",
                    "label": 0
                },
                {
                    "sent": "And then you go over to Geonames to see which of those places are similar or close to what I want to say.",
                    "label": 0
                },
                {
                    "sent": "You know what famous musician grew up near where I did?",
                    "label": 0
                },
                {
                    "sent": "We now have the data set to do it, but of course.",
                    "label": 0
                },
                {
                    "sent": "There's lots and lots of data there.",
                    "label": 0
                },
                {
                    "sent": "How do we find it's back to the problem?",
                    "label": 0
                },
                {
                    "sent": "So now we've put the human back in touch with the data.",
                    "label": 0
                },
                {
                    "sent": "So in this view, the idea is that we breakdown the barriers between lots of different stuff.",
                    "label": 0
                },
                {
                    "sent": "The way we broke it down in the web, and then our hope is that we can somehow use that same stuff of the web to.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Put it back together so in this view.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of excitement because now we're talking about something that looks like the web.",
                    "label": 0
                },
                {
                    "sent": "OK, now we're talking about something that scales like the web.",
                    "label": 0
                },
                {
                    "sent": "So the notion is there's lots and lots of data out there and there's very little semantics out there.",
                    "label": 0
                },
                {
                    "sent": "So if you could just add a little bit of semantics to sort of find the right stuff at the right time.",
                    "label": 0
                },
                {
                    "sent": "You would have a big win and again I say find I don't necessarily mean search it, it's answer queries.",
                    "label": 0
                },
                {
                    "sent": "It's find the right kind of papers for this for the problem you're trying to solve.",
                    "label": 0
                },
                {
                    "sent": "Things like that.",
                    "label": 0
                },
                {
                    "sent": "So the idea is you want to declare very simple little relations that can be inferred.",
                    "label": 0
                },
                {
                    "sent": "Apply these at scale heuristically, perhaps to a very, very large data set.",
                    "label": 0
                },
                {
                    "sent": "So again, I have lots of information I can grab from different places about different people, so I see somebody named John Domnick here, and I see somebody with a similar name here, and I see.",
                    "label": 0
                },
                {
                    "sent": "Somebody with a similar name there.",
                    "label": 0
                },
                {
                    "sent": "There's lots of people in the world with that name.",
                    "label": 0
                },
                {
                    "sent": "Right, but if I can start saying hey, but you know, these four are actually the same one, that can be very powerful.",
                    "label": 0
                },
                {
                    "sent": "So this guy who's blogging this at live Journal.",
                    "label": 0
                },
                {
                    "sent": "I have a reason to believe is the same person who is being described at this Wikipedia page.",
                    "label": 0
                },
                {
                    "sent": "Who's the same person who came up in this Google hit?",
                    "label": 0
                },
                {
                    "sent": "Who's the same person who?",
                    "label": 0
                },
                {
                    "sent": "As at this University, now suddenly I can answer some very powerful queries that I couldn't have answered from those individual datasets, so I needed to do some fairly simple inferencing.",
                    "label": 0
                },
                {
                    "sent": "Maybe the inferences if two people have the same email address.",
                    "label": 0
                },
                {
                    "sent": "Consider that maybe they're the same person, or you risk quickly assume they're the same person.",
                    "label": 0
                },
                {
                    "sent": "Will it be correct?",
                    "label": 0
                },
                {
                    "sent": "Not 100% of the time, but if you're doing 8090%, that's something the size of the web you're doing very well, but the key thing here is that.",
                    "label": 0
                },
                {
                    "sent": "Now, completeness is no longer necessarily.",
                    "label": 0
                },
                {
                    "sent": "Not only is it necessarily not what you're looking for, but not only is it not necessarily what you're looking for.",
                    "label": 0
                },
                {
                    "sent": "It's necessarily not what you're looking for.",
                    "label": 0
                },
                {
                    "sent": "What I mean by that is remember, time is money, so I saw a talk at an internal Google thing.",
                    "label": 0
                },
                {
                    "sent": "This was eight or nine years ago when they were first really getting it up, so I can't really prove that this is today's math, but they said at that time.",
                    "label": 0
                },
                {
                    "sent": "If they could get Google results 10 times better, but it would take 2 seconds to answer a query, Google would go out of business right?",
                    "label": 0
                },
                {
                    "sent": "So if when you hit Google you had to wait two seconds but you got a better result.",
                    "label": 0
                },
                {
                    "sent": "People wouldn't wait.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, if they could get it 100 times as good in five seconds, it wouldn't keep them in business.",
                    "label": 0
                },
                {
                    "sent": "They'd become a niche business.",
                    "label": 0
                },
                {
                    "sent": "They become the specialized search business.",
                    "label": 0
                },
                {
                    "sent": "So again on the web, what you want to get is so.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My answers test here's my favorite example of that.",
                    "label": 0
                },
                {
                    "sent": "This is from a website called twine made by a company called Radar Networks.",
                    "label": 0
                },
                {
                    "sent": "It was just announced yesterday that Wine has come out of beta, so all of you can go join twine and start using it.",
                    "label": 0
                },
                {
                    "sent": "So wonder it's a cool site because it adds on top of social networking.",
                    "label": 0
                },
                {
                    "sent": "Alittle bit of semantic organization but most importantly what it does is it lets you.",
                    "label": 0
                },
                {
                    "sent": "I go out on the web, I find something and I say hey this is something other people doing semantic web research would be interested in.",
                    "label": 0
                },
                {
                    "sent": "I can, you know with one one or two clicks of my mouse, put it somewhere where all those people who I share that information we will see it.",
                    "label": 0
                },
                {
                    "sent": "So in a sense we can create a sort of magic overlay Journal for web pages for blog entries, for YouTube videos, and where the semantics comes in as if I pull something from YouTube.",
                    "label": 0
                },
                {
                    "sent": "They can say, well, now I know that's a video, so I know where the description is and I know what kind of object it is.",
                    "label": 0
                },
                {
                    "sent": "And I know know what some of the principles video so I can display it better.",
                    "label": 0
                },
                {
                    "sent": "So really, they're not using a lot of semantics, and now they're starting to do a little bit of.",
                    "label": 0
                },
                {
                    "sent": "Let's try to make interesting recommendations for people for other people they might want to meet, so they try to find about 5:00.",
                    "label": 0
                },
                {
                    "sent": "So first of all, there's no proof of logical correctness for the kind of rules they're using anyway.",
                    "label": 0
                },
                {
                    "sent": "Second, long they've got at the time that I last made this slide, which was back in March.",
                    "label": 0
                },
                {
                    "sent": "They had over 10 billion relationships between people, so they had, I think, 30 or 40,000 people there.",
                    "label": 0
                },
                {
                    "sent": "Now up about 100,000.",
                    "label": 0
                },
                {
                    "sent": "An all of what did they belong to?",
                    "label": 0
                },
                {
                    "sent": "Who were they friends with?",
                    "label": 0
                },
                {
                    "sent": "Things like that?",
                    "label": 0
                },
                {
                    "sent": "Facebook has 24 million actually net by now.",
                    "label": 0
                },
                {
                    "sent": "It must be 40 or 50 million people in it of that same thing.",
                    "label": 0
                },
                {
                    "sent": "So so these are huge amounts of information and I want to pick from all the possible people I could recommend to you who's a couple good ones.",
                    "label": 0
                },
                {
                    "sent": "So it's a recommender system, but it's not trying to do a mathematical recommendation is trying to do something interesting.",
                    "label": 0
                },
                {
                    "sent": "So here's the top five.",
                    "label": 0
                },
                {
                    "sent": "It showed me.",
                    "label": 0
                },
                {
                    "sent": "Now I happen to know the top two an.",
                    "label": 0
                },
                {
                    "sent": "I took a quick I the second and third one are people who you know I had them edit things or had seen this looked very interesting to me.",
                    "label": 0
                },
                {
                    "sent": "This is someone named Trisha who describes herself as the arbiter of style in San Francisco, CA.",
                    "label": 0
                },
                {
                    "sent": "Do I look like someone who the arbiter of style from San Francisco, CA would be a good person to friend with?",
                    "label": 0
                },
                {
                    "sent": "Guess which of these five so I clicked on right?",
                    "label": 0
                },
                {
                    "sent": "People I sorta knew and they were sort of like me or this interesting one.",
                    "label": 0
                },
                {
                    "sent": "So I clicked on this interesting one and what I found is we had a lot of common interests in a lot of common friends, so the system had actually picked a good answer.",
                    "label": 0
                },
                {
                    "sent": "So in the top five very quickly it had found someone who was interesting to me, so that's why I keep going back to that site, not because it found all the people I already knew, but because it found some interesting new people.",
                    "label": 0
                },
                {
                    "sent": "So again, now if I had used the sound and complete algorithm over a set of inference rules, it's very unclear.",
                    "label": 0
                },
                {
                    "sent": "First of all, how if I have to wait the you know before I was saying 5 seconds, 10 seconds, this could be ours.",
                    "label": 0
                },
                {
                    "sent": "This could be days.",
                    "label": 0
                },
                {
                    "sent": "OK, so in the drug discovery I don't care how long it takes if it can get a million things down to 40, that saves me so much time and so much money I can run that calculation for two weeks.",
                    "label": 0
                },
                {
                    "sent": "Here I'm hitting on something on the web, it's showing up and I want to see what those answers are an I'm impatient.",
                    "label": 0
                },
                {
                    "sent": "eHarmony has has a published figure that says 20 seconds is the most they can get.",
                    "label": 0
                },
                {
                    "sent": "Anyone to wait?",
                    "label": 0
                },
                {
                    "sent": "OK now, eHarmony is a dating site.",
                    "label": 0
                },
                {
                    "sent": "eHarmony is about finding your.",
                    "label": 0
                },
                {
                    "sent": "The person you're going to spend the rest of your life with, and when you click it on the web, you want to wait 20 seconds or you're going somewhere else.",
                    "label": 0
                },
                {
                    "sent": "That's the average.",
                    "label": 0
                },
                {
                    "sent": "Most people won't even wait that long.",
                    "label": 0
                },
                {
                    "sent": "OK, so again, you know it's a very different world than the traditional AI world, which says I don't care how long it takes to get me the right answers.",
                    "label": 0
                },
                {
                    "sent": "This is I need an answer fast or even more importantly, I need some answers fast and even prefer it.",
                    "label": 0
                },
                {
                    "sent": "If I saw some different answers.",
                    "label": 0
                },
                {
                    "sent": "So, for example, if you go to Google Now.",
                    "label": 0
                },
                {
                    "sent": "You'll notice Google works very hard to in the top ten give you different things, so in a few years ago, if you typed my name to Google, I would be 17 of the top 20 hits.",
                    "label": 0
                },
                {
                    "sent": "Now if you type my name to Google, what you will find is 20.",
                    "label": 0
                },
                {
                    "sent": "I think 14 different people and I'm only two of them.",
                    "label": 0
                },
                {
                    "sent": "Right, so it's so it's using lots and lots of touristics and guesses and rules, and so it's not using semantics to do that.",
                    "label": 0
                },
                {
                    "sent": "It's using the fact that it has just a Brazilian piece of information and algorithms that can kind of cluster things into different parts and tries to pull from different things.",
                    "label": 0
                },
                {
                    "sent": "But again, same story.",
                    "label": 0
                },
                {
                    "sent": "It's they found it's better if they can get a range of answers.",
                    "label": 0
                },
                {
                    "sent": "So if you type something very narrow and they can only find a bunch of stuff in the same space, that's what you see.",
                    "label": 0
                },
                {
                    "sent": "If you see something that they know a lot about.",
                    "label": 0
                },
                {
                    "sent": "They try to have the algorithm as it pulls things together.",
                    "label": 0
                },
                {
                    "sent": "Prefer set for different than same things so it's all done by indexing.",
                    "label": 0
                },
                {
                    "sent": "OK, so again I want something fast.",
                    "label": 0
                },
                {
                    "sent": "I wanted to give me some good answers and if it does so now if I look at these five and I think they're all stupid.",
                    "label": 0
                },
                {
                    "sent": "I'm also not going to spend much time on this site.",
                    "label": 0
                },
                {
                    "sent": "For the rest, you know tomorrow I'm not coming back, right?",
                    "label": 0
                },
                {
                    "sent": "So if Facebook everybody if Facebook didn't let you pick your friends if it just told you, here's 10 people I think are your favorite friends and it did a bad job.",
                    "label": 0
                },
                {
                    "sent": "They won't have a lot of users today, right?",
                    "label": 0
                },
                {
                    "sent": "So again, the idea is that on the web, something that can help.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's get to the right place, can be very important.",
                    "label": 1
                },
                {
                    "sent": "OK, so again these are the kind of tensions you see.",
                    "label": 0
                },
                {
                    "sent": "So the traditional ontology engineering view can ask of the simple view.",
                    "label": 0
                },
                {
                    "sent": "But wait a minute, what about presence?",
                    "label": 0
                },
                {
                    "sent": "So here's flickering for protein.",
                    "label": 0
                },
                {
                    "sent": "Here's this semantic website Fujitsu built back in 2004 that was managing their information through a bunch of services about proteins.",
                    "label": 0
                },
                {
                    "sent": "Right, which one would you rather your doctor is trying to look at or medical researchers looking at something where protein is just so you want them Googling for the information or you want them to using something that has a good expressive thing?",
                    "label": 0
                },
                {
                    "sent": "The drug company doesn't want?",
                    "label": 0
                },
                {
                    "sent": "A few good suggestions.",
                    "label": 0
                },
                {
                    "sent": "Right, some of which are cute.",
                    "label": 0
                },
                {
                    "sent": "It wants as many as possible of the correct stuff.",
                    "label": 0
                },
                {
                    "sent": "These other things want to very different things, so again, you have these very different parts of the world.",
                    "label": 0
                },
                {
                    "sent": "Now there's a lot of problems which live in the middle.",
                    "label": 0
                },
                {
                    "sent": "In fact, that's where a lot of the promise of the semantic web is.",
                    "label": 1
                },
                {
                    "sent": "So if you were building a military system that was going to put bombs on your enemies, you really don't want it doing this kind of guessing.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if it takes 3 days to tell you where you should, you know who you should attack an hour from now.",
                    "label": 0
                },
                {
                    "sent": "That's also useless, so you need something.",
                    "label": 0
                },
                {
                    "sent": "I hate using that example is just one that was funded a lot of times in the past and has never really worked again because it's hard or.",
                    "label": 0
                },
                {
                    "sent": "You're taking some kind of statistically classified natural language, and you're trying to use meaning to somehow link link those things up so one of the big exciting areas you'll hear about in semantic web is what's called semantic search.",
                    "label": 0
                },
                {
                    "sent": "Enhance the ability of search engines by using some kind of semantic model.",
                    "label": 0
                },
                {
                    "sent": "Well, that's really nice power set the first company to actually do a pretty good job Vic.",
                    "label": 0
                },
                {
                    "sent": "I bought by Microsoft for 100 million dollars, right?",
                    "label": 0
                },
                {
                    "sent": "That's a lot of money even in today's economy.",
                    "label": 0
                },
                {
                    "sent": "I think it's about 14 euros, but the that was a joke.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ontology mapping.",
                    "label": 0
                },
                {
                    "sent": "You'll hear a lot about mapping and merging of ontologies when you're taking these very complex, very expensive, extensive formal models, this is very.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hard when you're taking something like this.",
                    "label": 0
                },
                {
                    "sent": "This was, by the way somebody was showing how they taught their seven year old to use the semantic Web.",
                    "label": 1
                },
                {
                    "sent": "I saw an even better example last night, or a lassala who's another early semantic web?",
                    "label": 0
                },
                {
                    "sent": "Bring his daughter?",
                    "label": 0
                },
                {
                    "sent": "He sort of showed her what relationships are and he she came back later and sort of put on a piece of paper.",
                    "label": 0
                },
                {
                    "sent": "You know I am a girl and my sister is a girl and we live here things like that.",
                    "label": 0
                },
                {
                    "sent": "So the notion of you know, kind of representing the world is a set of relationships.",
                    "label": 0
                },
                {
                    "sent": "Isn't that hard until you learn it is.",
                    "label": 0
                },
                {
                    "sent": "Right, it's only when people start telling you no no, you have to get it right that the problem comes in.",
                    "label": 0
                },
                {
                    "sent": "It's actually pretty easy, so this was a bunch of stuff about Star Wars and this was a little Star Wars ontology.",
                    "label": 0
                },
                {
                    "sent": "Somebody built this as an example, supposing you want to link those two up, well, we got Darth Vader there and Darth Vader there.",
                    "label": 0
                },
                {
                    "sent": "What's the chances that they're different?",
                    "label": 0
                },
                {
                    "sent": "Darth Vader's only one in that whole universe.",
                    "label": 0
                },
                {
                    "sent": "It's easy, so you can put in a same as link, and now suddenly these two ontologies can share information and you have more information.",
                    "label": 0
                },
                {
                    "sent": "You can't do that with these big classical ontologies.",
                    "label": 0
                },
                {
                    "sent": "Because if you say two things are logically equivalent and there really aren't, you're adding and you're adding an inconsistency here, and adding and incorrectness.",
                    "label": 0
                },
                {
                    "sent": "So again, some of it is is do you want to get your results?",
                    "label": 0
                },
                {
                    "sent": "Alot of them fast or some of them fast?",
                    "label": 0
                },
                {
                    "sent": "Or do you want to get all of them right?",
                    "label": 0
                },
                {
                    "sent": "So again, we see that tension again and again throughout.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All these things that happen.",
                    "label": 0
                },
                {
                    "sent": "One of the problems with my research Group One of the things you'll see here at this conference a lot is that.",
                    "label": 0
                },
                {
                    "sent": "So this was the description, so there's a counter.",
                    "label": 0
                },
                {
                    "sent": "The Semantic web challenge.",
                    "label": 0
                },
                {
                    "sent": "This year we added a new category called the Billion Triple Challenge and the idea of the billion Triple Challenge was not.",
                    "label": 0
                },
                {
                    "sent": "You had to find a billion triples and show us what you could do.",
                    "label": 0
                },
                {
                    "sent": "We got a lot of submissions that said, oh look, I got a billion things that are bio, you know our data from a chemistry thing.",
                    "label": 0
                },
                {
                    "sent": "Let me show you what I can do and we said no, you have to use the billion triples we gave you, and those billion triples were created by Yahoo scraping websites.",
                    "label": 0
                },
                {
                    "sent": "Us going to lots and lots of different people with different semantic web projects saying give us a chunk of stuff.",
                    "label": 0
                },
                {
                    "sent": "So some of these trips, some of these things and down in the graph have complex ontologies describing them.",
                    "label": 0
                },
                {
                    "sent": "Some have no ontologies describing him, some are very high quality data, some are very low quality data and the challenge was very simple.",
                    "label": 0
                },
                {
                    "sent": "What can you do with this?",
                    "label": 0
                },
                {
                    "sent": "Right, so the best best way I've seen of sort of describing this problem.",
                    "label": 0
                },
                {
                    "sent": "There's a project you'll probably hear about over the next few days, somewhere you'll run into Lark.",
                    "label": 0
                },
                {
                    "sent": "Save the Large Knowledge Collider.",
                    "label": 0
                },
                {
                    "sent": "I believe the PII is Frank van Harmelen and deter offenses involving several other people, and their slogan is current reasoning systems do not scale to the requirements of their hottest applications.",
                    "label": 0
                },
                {
                    "sent": "And that's really what it's all about.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "We know a lot of stuff about reasoning, and we know a lot of the stuff about scaling, but putting those together is hard, and most of the work that's gone on today and semantic web circles has focused on a lot of data, a little reasoning or a lot of reasoning, but not a lot of web use, in other words.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not giving up the the Lexus of control.",
                    "label": 0
                },
                {
                    "sent": "OK, if you can understand your data when you have a model when you're doing expressive ontologies, there's a lot you can do.",
                    "label": 0
                },
                {
                    "sent": "So again, the old AI slogan, knowledge is power is correct and on the web it's also correct.",
                    "label": 0
                },
                {
                    "sent": "But the problem is if I limit the domain to one thing that I know a lot about, I know all there is to know about this kind of drug.",
                    "label": 0
                },
                {
                    "sent": "You know, I got 50,000 classes of description of some particular cancer thing.",
                    "label": 0
                },
                {
                    "sent": "That's very, very powerful.",
                    "label": 0
                },
                {
                    "sent": "As long as what you care about is that particular cancer thing.",
                    "label": 0
                },
                {
                    "sent": "But it's not very powerful when you go to Facebook.",
                    "label": 0
                },
                {
                    "sent": "OK, in less the only thing you're looking for on Facebook as people have exactly that kind of cancer and who have had somehow in their Facebook profiles, decided to describe, describe at the molecular level what their DNA is like.",
                    "label": 0
                },
                {
                    "sent": "There aren't a lot of those that you will find, so again, the more you know about something, the more you can do with it.",
                    "label": 0
                },
                {
                    "sent": "The less you know about something, the harder it is, and there's a lot of space in the middle and.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think I'm coming close and so so the.",
                    "label": 0
                },
                {
                    "sent": "Semantic web world.",
                    "label": 0
                },
                {
                    "sent": "You'll see a lot of different diagrams.",
                    "label": 0
                },
                {
                    "sent": "There's the famous layer cake diagram.",
                    "label": 0
                },
                {
                    "sent": "There's also things.",
                    "label": 0
                },
                {
                    "sent": "One I.",
                    "label": 0
                },
                {
                    "sent": "This is when I actually put up around 2002 and said, you know, a problem.",
                    "label": 0
                },
                {
                    "sent": "We're going to have in this field is all of these different languages were playing with we call ontology languages, but they really have very different things.",
                    "label": 0
                },
                {
                    "sent": "They're doing.",
                    "label": 0
                },
                {
                    "sent": "Some of them are just modeling simple relationships, some of them are modeling very complex information.",
                    "label": 0
                },
                {
                    "sent": "And we're going to confuse the outside world, which comes to us.",
                    "label": 0
                },
                {
                    "sent": "So you come to a meeting like this and you learn about ontology engineering.",
                    "label": 0
                },
                {
                    "sent": "And some of the people who are going to present today are primarily going to be talking about stuff at this end this year we added actually a new talk to talk a little bit more about what's going down down.",
                    "label": 0
                },
                {
                    "sent": "At this end, I'll be giving that one again later.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "These things are very.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different and it's important to understand and this matters a lot, because if you're trying to do research in the space, if you're trying to do.",
                    "label": 0
                },
                {
                    "sent": "You know, make a company in the space.",
                    "label": 0
                },
                {
                    "sent": "They are very different things and they have different concerns.",
                    "label": 0
                },
                {
                    "sent": "So one of these views what you're primarily work worried about is your ontology creation and modeling and expressivity an the other view you'll hear a lot of talks at this conference about triplestores about scaling about the language sparkle.",
                    "label": 0
                },
                {
                    "sent": "A way to think about it is if you go back to early database literature, the semantic Web is a lot like the database world was 2530 years ago.",
                    "label": 0
                },
                {
                    "sent": "Clearly a very powerful technology that clearly fits an important niche, the niche being the web.",
                    "label": 0
                },
                {
                    "sent": "And a lot of people trying to figure out how to use it in different models, and so there's research you can find back.",
                    "label": 0
                },
                {
                    "sent": "Then paper is still to this day papers about data languages and data calculi and data reasoning, as it were an other papers about how do I keep the thing fast?",
                    "label": 0
                },
                {
                    "sent": "How do I make it so it doesn't pages often as you go around this conference as you look at the posters as you look at the papers you will see people talking about how do I add?",
                    "label": 0
                },
                {
                    "sent": "How do I keep the system consistent if I want to have information?",
                    "label": 0
                },
                {
                    "sent": "That you can have five fingers on a hand, but only one of them can be a thumb qualified cardinality restrictions or an you have other people who are saying if you use a bitmap representation, you can get a 50 million triples into a 11 GB online memory.",
                    "label": 0
                },
                {
                    "sent": "And the reason you're seeing both those things at the same conference is coming from the fact that the eventual thing that puts them together is really important, and that we're exploring innocence from several different.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And and this talk today.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just another way of saying what I just said.",
                    "label": 0
                },
                {
                    "sent": "This is one of my favorite projects.",
                    "label": 0
                },
                {
                    "sent": "I'm on the Advisory Board of the project going on at the Cleveland Clinic.",
                    "label": 0
                },
                {
                    "sent": "Cleveland Clinic is the largest heart research organization in the whole world, so these are if you have a heart attack, the best place you can end up is at the Cleveland Clinic.",
                    "label": 0
                },
                {
                    "sent": "There are more people there.",
                    "label": 0
                },
                {
                    "sent": "They do more procedures.",
                    "label": 0
                },
                {
                    "sent": "They have the best doctors but they have a whole team of researchers.",
                    "label": 0
                },
                {
                    "sent": "They group.",
                    "label": 0
                },
                {
                    "sent": "We're working with there.",
                    "label": 0
                },
                {
                    "sent": "Has I think 6 faculty, 6 senior researchers and they publish approximately 150 papers a year, some of which are the most cited papers in medicine.",
                    "label": 0
                },
                {
                    "sent": "OK, very powerful group an their promise.",
                    "label": 0
                },
                {
                    "sent": "They gotta bring a lot of information from all over the hospital and one end.",
                    "label": 0
                },
                {
                    "sent": "So it sounds very much like that low end semantic web problem and they gotta put it together with inferencing about what heart, what kind of operations have what kind of things, 'cause what they're trying to solve these problems like.",
                    "label": 0
                },
                {
                    "sent": "If we do this thing before we do that thing, do we get a better result?",
                    "label": 0
                },
                {
                    "sent": "But the problem is we did these two different things to patients at different times.",
                    "label": 0
                },
                {
                    "sent": "They were positive and one may have come in through his primary doctor in one may have come in through a specialist, so we have to realize this was the same person and that it was that they had been treated.",
                    "label": 0
                },
                {
                    "sent": "These two different ways, things that so they have to go back through their old data to find situations.",
                    "label": 0
                },
                {
                    "sent": "So they're putting together an RDF project that was being done too.",
                    "label": 0
                },
                {
                    "sent": "Rationalize their whole data system and psych, which is a very big knowledge representation system.",
                    "label": 0
                },
                {
                    "sent": "Being the inference engine and it sort of worked by they were funding each of them to do something a little different and the guy who runs runs.",
                    "label": 0
                },
                {
                    "sent": "This project looked at them and said, that's great.",
                    "label": 0
                },
                {
                    "sent": "I want you to put those two together.",
                    "label": 0
                },
                {
                    "sent": "Of course, both sets of researchers say that's impossible.",
                    "label": 0
                },
                {
                    "sent": "He said OK. Then give me back the money and I'll find someone who can do it.",
                    "label": 0
                },
                {
                    "sent": "And of course, they said when we said impossible what we meant is easy.",
                    "label": 0
                },
                {
                    "sent": "And we'll be happy to do it.",
                    "label": 0
                },
                {
                    "sent": "Just keep our money going so they were really forced to work together an what's interesting is this is the RDF view of the world and you'll notice the very very top.",
                    "label": 0
                },
                {
                    "sent": "There's something in the corner that says and then you go off to psych and this is the side view of the world which says you do all this stuff and then sort it down.",
                    "label": 0
                },
                {
                    "sent": "At the bottom is sparkled in a semantic web database, but these important thing is these diagrams hook up and in fact over the past year they've been forced to really make this thing work.",
                    "label": 0
                },
                {
                    "sent": "And they're doing some spectacular things.",
                    "label": 0
                },
                {
                    "sent": "They're doing complex inferencing over very large datasets and they do it by finding a sort of middle level of expressivity site can express queries at that level.",
                    "label": 0
                },
                {
                    "sent": "Those break that those are then taken by a different system to find the right data.",
                    "label": 0
                },
                {
                    "sent": "Those things process that data and pull it back at that level of description, and then site takes it up to much more complex inferencing and algorithms.",
                    "label": 0
                },
                {
                    "sent": "And the reason it works so nicely.",
                    "label": 0
                },
                {
                    "sent": "As you've got a filtering happening in the middle.",
                    "label": 0
                },
                {
                    "sent": "So the database is returning only things that could could possibly be correct.",
                    "label": 0
                },
                {
                    "sent": "Answers to that question.",
                    "label": 0
                },
                {
                    "sent": "It's not necessarily giving all the answers, and some of the things that gives may not be.",
                    "label": 0
                },
                {
                    "sent": "The psych system is now doing complex reasoning, but only on the 100 or 200 things that came back, not the 200 million things that are in the native database, so again.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of excitement there, so today what you're going to be hearing about in the rest of this symposium.",
                    "label": 0
                },
                {
                    "sent": "Tutorial An in fact in the next 5 days what you'll be hearing about or for whatever over the whole conference is really.",
                    "label": 0
                },
                {
                    "sent": "These two different views of the world coming together, different people working on different aspects of it an A whole vocabulary that as you master it, you need to understand that all of this is going on.",
                    "label": 0
                },
                {
                    "sent": "So we're going to teach you about the Owl Language, Ontology engineering and ontology design.",
                    "label": 0
                },
                {
                    "sent": "So how to do the modeling?",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter whether you're building a small one or a big one, you want to get it right.",
                    "label": 0
                },
                {
                    "sent": "OK, or at least you want to understand what it says, but then some aspects of it may be much more important if what you're going after is powerful reasoning and some other aspects of it might be more important if what you're going after a scalable reasoning.",
                    "label": 0
                },
                {
                    "sent": "So we're also going to talk about some principles of using it, interoperability, and the use in web services.",
                    "label": 0
                },
                {
                    "sent": "And then we're also going to have some talks on using these semantics so applications and we're going to talk about some of these things.",
                    "label": 0
                },
                {
                    "sent": "I've been mentioning semantic search linked data.",
                    "label": 0
                },
                {
                    "sent": "And web app so you can get a feel for what are the kind of space of these different kind of applications out there at both sides and to a certain degree in the middle, by the way, Now that I've given this talk a lot, you'll hear lots of people trying to claim what they do is in the middle.",
                    "label": 0
                },
                {
                    "sent": "Be sceptical.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of space in that middle.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, right?",
                    "label": 0
                },
                {
                    "sent": "So a lot of web stuff with a little semantics says look how how much semantics we're using and.",
                    "label": 0
                },
                {
                    "sent": "You know the AI guy walks in and says boy, that's not much.",
                    "label": 0
                },
                {
                    "sent": "And then this guy says look how much data we're using.",
                    "label": 0
                },
                {
                    "sent": "We have 100 million things in our database and the Semantic Web guide us 100 million.",
                    "label": 1
                },
                {
                    "sent": "When are you going to try something big, right?",
                    "label": 0
                },
                {
                    "sent": "So again, very different worlds and they're coming together and there's a lot of excitement.",
                    "label": 0
                },
                {
                    "sent": "And as you go through the conference, what we hope we will give you is enough of the different views and the sort of vocabulary you need to be able to go through it.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to stop there.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                },
                {
                    "sent": "Turning it over too soon next.",
                    "label": 0
                },
                {
                    "sent": "OK so.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh, there we go.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "So now we're going to go on to the show.",
                    "label": 0
                },
                {
                    "sent": "I'm going to have to disappear for a little while this morning.",
                    "label": 0
                },
                {
                    "sent": "I'll probably be back around lunchtime and I'll be.",
                    "label": 0
                },
                {
                    "sent": "I'll be back after lunch to give another talk and I'll be happy to take your questions offline.",
                    "label": 0
                },
                {
                    "sent": "Last year we tried to let me answer questions now and those of you who know me know why that didn't work very well because each question got about a 10 minute answer.",
                    "label": 0
                },
                {
                    "sent": "And by the time we were finished, John was like an the last speaker of the day.",
                    "label": 0
                },
                {
                    "sent": "So I'll take your questions what I wanted a later time coming up.",
                    "label": 0
                }
            ]
        }
    }
}