{
    "id": "pqifi3ohsu7ylkmw4hvurszr67zdpwgs",
    "title": "Web Spam Detection",
    "info": {
        "author": [
            "Marcin Sydow, Department of Intelligent Systems, Web Mining Lab, Polish-Japanese Institute of Information Technology",
            "Carlos Castillo, Sapienza University of Rome"
        ],
        "published": "Nov. 28, 2007",
        "recorded": "October 2007",
        "category": [
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/mmdss07_sydow_wsd/",
    "segmentation": [
        [
            "OK, good afternoon.",
            "I think it's time to start.",
            "We are going to present presentation about Fighting web spam and the presentation is will be divided into 3 parts.",
            "First part is about 40 minutes, then about 5 minutes break, then about 40 minutes for the second part and the last very short part.",
            "Can everybody hear me in the room?"
        ],
        [
            "OK, so.",
            "OK, so this is a.",
            "This is our team.",
            "We prepared a presentation for people.",
            "Carlos Castillo from Yahoo Research, Barcelona, Spain, March instead of its May actually published Japanese Institute of Information Technology in Warsaw, Poland.",
            "Yahoo Piskorski Joint Research Centre, Italy and Device Falls Line University of Technology."
        ],
        [
            "Poland.",
            "So as I said to learn with three parts, I will make the first part and this is because the presentation concerns the web spamming.",
            "It is very important to very well to understand very well what search engines are and how they work is.",
            "So the first part is devoted mostly to introduction to search engines and I don't assume any any any knowledge, so it is introductory level and then Carlos Castillo from Yahoo Research we present.",
            "Reference corpus for for research about webspam?",
            "Detection and then our very short part about new preliminary."
        ],
        [
            "Experimental results.",
            "OK."
        ],
        [
            "So."
        ],
        [
            "The first part about search engines.",
            "So maybe let's say a few words about the web today.",
            "Maybe it is very maybe you are familiar with these figures, but."
        ],
        [
            "What is the size about the web?",
            "Today?",
            "It is at least 10 billion."
        ],
        [
            "Documents and some estimates are even higher.",
            "There is even a site you can go to the site and track.",
            "What is the estimated number of documents in the web today.",
            "So it is over 20 billion documents into up-to-date.",
            "And also there is a work devoted to computing counting the number of indexable document.",
            "So the documents which which makes sense to be indexed it is tin tin."
        ],
        [
            "Billion documents?",
            "What about the size of the volume of the content of the web it is?"
        ],
        [
            "The.",
            "It is over 100 terabytes of textual data and of course we don't count multimedia here.",
            "So what about the water?"
        ],
        [
            "Of the population."
        ],
        [
            "The web.",
            "There are different figures, but definitely it is few 100 million users of the web.",
            "So all this makes the web is the largest source of information."
        ],
        [
            "Of course everybody knows it, but this is also important for this farm.",
            "Searching information in the web is among the top activities today.",
            "And I would like to ask."
        ],
        [
            "If you know what are the three most popular websites, so they in general so.",
            "Does anybody know?"
        ],
        [
            "Yeah, there are three major search focus portals.",
            "I don't mean the order order is different.",
            "But I I just mean that."
        ],
        [
            "These three search focus portals are the three most popular sites in general today.",
            "So it means that searching is really important activity of web use."
        ],
        [
            "Today why search engines are so important?",
            "Of course, because without search engines we couldn't use this information in any way.",
            "It is absolutely outside of possibilities of any of any human, so this is."
        ],
        [
            "So search engines are just the main gate to the information in the web."
        ],
        [
            "Day.",
            "And also have some facts.",
            "For example, 256 million people used Internet in UK in 206 in December 206.",
            "So this means that the search."
        ],
        [
            "Changes are heavily used.",
            "Some available statistics about number of queries daily.",
            "They are not new, of course they are from two years ago and I think maybe you have some newer statistics but it is 200, so five it was assessed by Google for being.",
            "Put being 500 mil."
        ],
        [
            "Queries daily and shares of the three majors.",
            "Three major search engines were like like this, almost half or Google about for Yahoo and MSN."
        ],
        [
            "It is the third search engine and what it means in practice.",
            "So for a global search engine, it means that it must process.",
            "50,000 queries daily, which means about 3000 queries per second over say 100 or 8 or 80 terabyte corpus, takes to all corpus, so this is really massive operation.",
            "Each query must be served under second under one second.",
            "If it does not search under one second the users they use."
        ],
        [
            "Can just change the search engine.",
            "It is a phrase used by I heard it once.",
            "The computers are one click away.",
            "So if you are not, if you cannot serve query fast enough or if the if the result is not is not relevant enough, you can just change the search engine.",
            "So this is very aggressive competition."
        ],
        [
            "So maybe let's say a few words about the general search engine architecture in the task of search engine is seemingly simple, so it is to return documents containing as well because of the volume of data and intensivity of usage.",
            "It is very complex information system, so on the one hand we have we have web with documents without documents.",
            "It is here on the other end we have a customer or user of the system and user poses a query and.",
            "Before the user gets.",
            "Get the result the documents are crawled by a crawler, which is a very special.",
            "Distributed network system to collect documents efficiently.",
            "Then documents are stored in so called repository.",
            "Then documents are indexed offline of course.",
            "And they are kept in a very special system of data structures, which are called index.",
            "And then the index income is consulted during the query time, so so this is very important part of search engine is the ranking system which is the part of the search engine which is consulted during the generating results.",
            "And this is the part which decides of the about the order of the return results.",
            "So this is very important part of search engine will say."
        ],
        [
            "More."
        ],
        [
            "About this model edge.",
            "So just summary crawler.",
            "Follow links.",
            "And collect the documents efficiently.",
            "It is usually quite big and complex system repository should enable.",
            "Should make it possible to access documents in at least two special modes.",
            "First mode is for indexing, so it is streaming access.",
            "Second mode is during the querying, so it should be very fast.",
            "Random read operation.",
            "Let's say index is a data structure for storing information.",
            "Which word.",
            "It is stored in which document also about the context.",
            "If it is in content or in a title or in the URL or in anchor text and so on.",
            "Then ranking system which documents are important and which documents are relevant for the particular query for a particular query.",
            "So.",
            "This is quite complex system.",
            "Of course we don't have time to get into details search engines, but this is all.",
            "Important to understand the motivation of website."
        ],
        [
            "And mechanism of web spamming?",
            "So this is just example of architecture over large scale crawler.",
            "I don't want to spend much time on this picture, but there is a complex distributed priority queue, let's say which stores the URLs to be crawled.",
            "And then there is some section of models to serve DNS requests efficiently.",
            "Usually you need a special custom asynchronous DNS client for large scale closures, and there are some other systems to monitor the operation and to compute some some statistics for the for the next growth and so on."
        ],
        [
            "The.",
            "So now let's get to ranking system, which is possibly the most important part of the search engine.",
            "The facts are that the for average query you can easily get millions of answers, millions of documents which contain the specified keywords.",
            "Every human capital capability is to see just to inspect the team document 10 documents or or 20.",
            "So usually very few very few very few users go behind behind the first page of results.",
            "So the main problem is how to select the few few most relevant documents out of thousands or millions documents which contain.",
            "The keywords and this is the primary issue of search engines, let's say and so.",
            "And.",
            "And the model, which is which is which is responsible for this task, is the ranking system.",
            "Uh, so it plays a central role of the search engine, and in fact ranking system is the one of the.",
            "One of the two parts which are exposed to attacks of spammers so web farm is a misleading ranking system will say more about this later.",
            "And the ranking system existed before in so-called information retrieval systems.",
            "It was in 60s.",
            "It started at 60 set it concerns systems to retrieve information stored in controlled corpuses of textual documents inside corporations for example.",
            "So it were not web web documents but just textual documents stored electronically and some some information retrieval, some.",
            "Some ranking systems existed.",
            "In those systems, but.",
            "But what we do have some specific features which make it necessary to adapt ranking algorithms to the web.",
            "1998 they were introduced some.",
            "Some new, let's say, let's say dimension of computing ranking.",
            "It was a introducing link analysis."
        ],
        [
            "Oh So what is the task of the of the ranking system?",
            "It is for each computer.",
            "For each document it computes score and.",
            "While returning the documents, it's sort of the documents in an increasing order and their manufacturers used for computing this ranking.",
            "So first of all, it's the text analysis, so the textual content of the document are analyzed.",
            "There also there's also an Kotex anchor.",
            "Text is a text which is part of the link from other documents, so between the a HTML tags.",
            "So this is called anchor text and it's also very, very very valuable source of information.",
            "For computing the ranking, link analysis will spend some time on this and also Carlos will say much about link analysis.",
            "Query log analysis.",
            "You can also analyze the previous queries and you can infer some useful knowledge about the popularity of subdocuments or popularity of some queries, and so on.",
            "You can also use the traffic and difficulties, but this is not easy to collect traffic data.",
            "And you can also use a history of previous queries of particular user if you have information of the of about the identity."
        ],
        [
            "Of the user.",
            "So maybe let's say few words about text to all the textual factors.",
            "So the most basic variant is to use with a vector representation of textual document.",
            "So which document is represented as a vector and dimensions are tokens usually and on each dimension you have some some statistic.",
            "For example example of static is so so called TF.",
            "Idea if we just time frequency inverted, inverted dark frequency then frequency is a statistic which is increasing and increasing function of number of terms in a document.",
            "An inverted document frequency is a non increasing function of the number of documents containing the keywords.",
            "The intuition behind this statistic is that the more often term occurs in a document, the more relevant document is for this term and the intuition behind the IDF factor is that the less document contains the keyword, the more.",
            "Informative, the keyword is, so this is just very basic statistic and usually you compute for for example a product of these two statistics.",
            "But of course there are many variants of the statistics.",
            "And then if you translate documents into vectors, you can also translate the query into a vector and then you can apply any vector similarity measures.",
            "Of course there are many problems like problems.",
            "That query is usually very short and document is usually very long and you have synonyms.",
            "So there are some other techniques applied.",
            "For example, you can use some some dimensionality reduction techniques like singular.",
            "Decomposition or or some other mathematical operations.",
            "And in general this this factor works very well for many years for textual.",
            "Controlled corpora inside in."
        ],
        [
            "At corporations.",
            "But there are some web specific issues which should be addressed when we compute the ranking of a document.",
            "So first of all, in contrast to classical information retrieval task in the web we have document of low quality mix with documents with of high quality and also there is extreme diversity between the documents.",
            "So there are for example hundreds of languages.",
            "There are 10s of file formats.",
            "10s of encodings and so on, so this is extremely diverse.",
            "There's also so called's self description problem when septic system problem it could be explained examples.",
            "The classical example is for example when you are.",
            "Posing a query like Japanese car manufacturers of for example, you are thinking about Toyota, but it may happen that the main site of the Toyota doesn't contain this particular term, so this is called subjects self description problem.",
            "And also we have quite much noise in the web.",
            "You have many errors and also some adversarial aspects which were not present."
        ],
        [
            "In controlled collections.",
            "And now what can we do about this?",
            "So one of remedy is a link analysis of the web graph.",
            "So you can represent a web as a graph.",
            "When, for example, each document is a note of this graph and each link between documents is an edge is a direct edge of this graph.",
            "Link analysis is the branch of Sciences of analyzing this graph.",
            "The basic assumption which lies behind this is that a single link could be interpreted as a positive judgement.",
            "Of the outer of the linking document about the linked document.",
            "Of course it is not true about every single link, but it happens that it works in math.",
            "So if you analyze the whole graph of the web, you can infer very useful knowledge about importance of documents.",
            "Up and of course example very famous link based ranking algorithm page rank.",
            "They will say few words."
        ],
        [
            "About Pedro.",
            "So of course, before they were there.",
            "So there were some some very simple ideas of computing of using link analysis to compute importance of documents.",
            "For example, could compute the number of links to a particular document.",
            "So Justin Ling counter.",
            "But this is too simple and it is easy to be spammed, so nobody uses it nowadays is slightly more elaborate's idea is.",
            "Not count to not only count the links, but also to check who links to particular document so so it could be explained like this that each page has some authority.",
            "Each page distributes its authority equally through links to the documents it links to.",
            "And the authority of of each page is a total authority coming to this page.",
            "So this is like a flow to the whole graph of the web.",
            "Of course, some of the authority is bounded.",
            "Usually it is 1."
        ],
        [
            "Up it could be also, of course it's expressed in the form of some equations.",
            "It could be also expressed in terms of so called random server.",
            "And I think the simplest description is just in the matrix language.",
            "That page rank is just.",
            "Is the.",
            "Eigenvector of corresponding to eigenvalue one of the adjacency of the adjacency matrix of the web graph.",
            "In fact, this adjacency matrix should be slightly.",
            "Should be slightly corrected, let's say because of some problem.",
            "So here what I said at the beginning is the first equation.",
            "Is this so called simplified page rank when you just?",
            "Good.",
            "Take into accounts in links.",
            "The original links in the web graph, but there are some problems like so called.",
            "Sinks.",
            "So if you have a set of nodes which have no outbound links, they can absorb the whole authority, so we can do some technical tricks to make a page rank."
        ],
        [
            "Practical, let's say in the case of of the web graph.",
            "So summary page rank introducing Google in 98 is now.",
            "A patient algorithm in USA, but I think that most search engines now use some algorithm which is similar to page rank or base to it or somehow related.",
            "Properties of the patron cards.",
            "It was one of the first pioneer.",
            "It was one of the first successful link based ranking algorithm.",
            "Also hits is the sum link based algorithm and it also was introduced in 98.",
            "Page rank is quite immune to spanning compared to other pure link based algorithms.",
            "And it was, and patron gave birth to many other algorithms.",
            "For example, personalized page rank.",
            "When you can set some vector personalization vector to boost some some nodes of the graph there.",
            "There's also very interesting.",
            "Variant which is called topic sensitive Pagerank.",
            "When you make a page rank sensitive to Aquarius, so the idea is to compute 1616.",
            "The paper it was in the paper it was just 16.",
            "Drinks for different for different.",
            "Terms for the and then you compute something like a combination in the context of the given query.",
            "Trust market, antitrust rank.",
            "There are algorithms used for fighting spam.",
            "And also there are some extensions of the random server model and many many."
        ],
        [
            "Other extensions, so now after this short introduction to the search."
        ],
        [
            "This will say what is a web spam?",
            "So first of all, what?",
            "What makes web web search engines exist?",
            "Why?",
            "Why they they survive?",
            "They have quite."
        ],
        [
            "Hard job, let's say so.",
            "The factor which makes search engine exists search based advertising.",
            "So there are some opinions that the most of revenues of search engines are.",
            "Because of search based advertising.",
            "And main types of search based advertising are also called sponsor links.",
            "When you put some.",
            "Some links assigned the search results, so they are paid and of course this sponsored links should fit to the query.",
            "Another group of or another variant of.",
            "Of search based adverts is.",
            "Textual ads.",
            "So when you place advertisement on the web page so the customer owns the web page and you and you place some parts on the on the websites."
        ],
        [
            "So my bullets say something about the fibers, so Internet advertising this is the data from USA from 206.",
            "I don't have data from Europe unfortunately.",
            "What we can see that Internet advertising which is not only search based advertising is about 70 billion dollars this.",
            "And these are desirable diesel revenues, so this is quite hight #17 billion dollars in 206.",
            "And it is seventh position in there."
        ],
        [
            "Our market.",
            "And it happens that the search based advert asks.",
            "Constitute a major part of this of this market, so there's about 40% percent for searching for service based advertisements, so it is about 6 1/2 billion dollars.",
            "Of revenues in 206.",
            "Yes, but this is 205.",
            "Yes, this is 205 so we can see the small drop in the figure, but it is not much and it is.",
            "It is usually.",
            "So in the 204, I think it was like 39%.",
            "So it is about 40%.",
            "United States.",
            "So.",
            "So this is quite much money, in fact, so this is of course what I'm going to tell next is that this money is the target of."
        ],
        [
            "Web spammers, so somehow.",
            "So now let's explain the basic mechanism of spam motivation.",
            "What is this power motivation?",
            "So as we said search engine ranking.",
            "Affects web page visibility.",
            "If you have high ranking you are well visible in the web.",
            "And now if your web page or website is well visible, you have much traffic to this page and then if you have much traffic you can have, you can have much incomes because traffic means incomes because of the contextual arts programs.",
            "If you have high traffic you can just use some part of your website to part advertisements so.",
            "It is very incentive today.",
            "Too high to highly rank on search engines, and this is the main motivation of webspam."
        ],
        [
            "What about the definition of this problem?",
            "In fact, there is no clear definition of webspam.",
            "But one of the definitions, web spam, is any any manipulation of the of the web documents or websites in order to mislead search engine ranking system.",
            "To obtain understood undeservedly high ranking without improving the real information quality of the document.",
            "So this one there is also an extreme version of this definition.",
            "Webform is anything which is done because search engines exist.",
            "If search engine wouldn't exist.",
            "So of course this is not very precise definition, but.",
            "But these are some definitions are found.",
            "And we can say that Webstorm is highly motivated economically because of this of this, revenues of of advertisement.",
            "It is over 6 and half billion dollars annually in United States."
        ],
        [
            "Um?",
            "So spam is destructive and it affects the web community because."
        ],
        [
            "Because it undermines search engines business and search engines are used every day.",
            "Bye bye everybody."
        ],
        [
            "And also it deteriorates information quality becausw.",
            "We are using search engines and we see webspam."
        ],
        [
            "In the search results, so combating web spam is a primary issue not only for search engines but also for web users, so this is."
        ],
        [
            "I would come on it.",
            "It concerns the whole web web community.",
            "Of course, there's also some Gray area between.",
            "The webspam and so called search optimization or search engine optimization techniques?",
            "There's a big market nowadays, so search engine optimization is a business when you when you pay for making your website better, visible.",
            "And of course it is very difficult to say where is the border, where the techniques applied to make your document better visible is.",
            "Is a Whitehead technique and wait when is it?",
            "Undeserved the high ranking is undeserved, but you can always refer to a terms of service of each search engine and this is you can search engine publishes some guidelines and if you follow the guidelines you may be sure that you are not regarded as a spammer if you improve."
        ],
        [
            "The visibility of your website.",
            "So first of all, so maybe let's say something about spam taxonomy now."
        ],
        [
            "Not two groups of techniques applied by."
        ],
        [
            "Farmers and we can divide them into hiding techniques and boosting techniques and hiding techniques are techniques aimed at making web spam detection more difficult.",
            "And both in techniques are techniques based on making your ranking higher.",
            "So these are two kinds of."
        ],
        [
            "If it is.",
            "And of course Webspam can be also divided with with with with regards to which factor of ranking system is."
        ],
        [
            "Target.",
            "So.",
            "I'm sorry, so of course because we use content based statistics to compute document ranking.",
            "Content based techniques can try to explore.",
            "This factor is used in in rankings.",
            "They also link based techniques which are aimed at misleading.",
            "A link based factors using computing ranking and some."
        ],
        [
            "Other techniques we will leave them.",
            "So for the content based techniques, there are some very old techniques like hidden text.",
            "When you have a text of a very small size, or of having the same color as the background, so they are invisible for the people who are looking at the page, but they are visible by the crawler and indexer.",
            "So these are very old techniques and they have these are very easy to be detected.",
            "There's also repetition.",
            "Repetition means that you pass many, many popular terms on on the website or web document in order to boost TF statistics.",
            "So term frequency statistics.",
            "But this is also very simple and quite easy to be detected.",
            "Slightly more elaborated countered based techniques like keyword stuffing or dilution or weaving.",
            "It means just that too, instead of instead of parting rapidly.",
            "Instead of putting repeated words.",
            "For example part, the bigger fragments of text which are statistically more more more difficult to be detected that are artificially part in the page and don't have anything in common with the topic of the of the rest of the page."
        ],
        [
            "Uh.",
            "Also link based techniques so it wasn't funny.",
            "Part is when you have many pages which are seemingly normal, but all they have some some hidden links too.",
            "To a target page which is a page which is the target page, means that the ranking of this page should be boosted and anchor text spam when you part many pages and to add some special keywords in anchor tags and all these all these links link to a target page.",
            "Block Spam is a very important group of spam techniques.",
            "It is a phenomenon where because in blocks you can part the.",
            "So your documents and you could you can put links to any document.",
            "So so you have a control of the of the links, but the block itself is not is hosted by, sometimes by by some.",
            "A host of high importance, so leaking link exchanges is when many nodes of exchange link in order to totally accumulate higher page rank or higher.",
            "Other web based link based statistics expired domains link farms, expired domains and then you can populate.",
            "Expired domains with documents with spamming with."
        ],
        [
            "Sperm count.",
            "Up and some other techniques are cloaking and to direction.",
            "They are not targeted at the ranking system but rather at a crawler or at a.",
            "So maybe I will explain this."
        ],
        [
            "Techniques later I will have a slide, so there's some examples of spamming pages.",
            "This is just putting some popular keywords on the page and this is very easy to detect it automatically that this page is not very very very valuable.",
            "For human."
        ],
        [
            "Hello.",
            "Here we have a hidden text, so the text is in.",
            "Color of background.",
            "So the possibly the author of this webpage trying to do both that the F statistic of this web."
        ],
        [
            "Payment.",
            "Here we have a page which has some content, possibly kopite, from some other normal webpages, but also there are some some contextual ads part on this website, so it it is aimed at accumulated some automating some traffic and then.",
            "Make some.",
            "To make some some revenues from from advertisements."
        ],
        [
            "So here is a example of.",
            "Search engine so you can ask a query to this search engine.",
            "For example sports book.",
            "You receive some results and it looks quite OK, but."
        ],
        [
            "It happens that if you ask another query, it doesn't make any sense.",
            "You also get some results, so this is a fake search engine and this is another example of spam."
        ],
        [
            "Here's a example link farm.",
            "When you have almost normal content and.",
            "This is a part of a bigger structure with links to other documents, so this is a part of a group of web documents aimed to boost a link based static."
        ],
        [
            "So what is the cloaking cloaking is is a technique.",
            "And could be explained like like this one.",
            "When when when I crawler visits Web page to collect the documents?",
            "Different document is is returned and 1 browser.",
            "And when a browser.",
            "Requests this document and other content is shown, so this is a different showing different content to a crawl."
        ],
        [
            "Different content to browser.",
            "And the direction is when.",
            "So there are three possible groups of redirection techniques for, so it is that when you try to see the web when when a user tries to see the web document which is for example returned by search results.",
            "The user is is is directed to another document so the crawler sees the first document and the users is another document.",
            "So this is a hiding technique similar to clocking in some way, but.",
            "But other means are used to achieve the same goal, and the three kinds of redirection first is, for example you can server can can return an directions status as a group of HTT HTTP errors, three hundreds and something.",
            "The second possible technique is to.",
            "When you can use a meta tag.",
            "And the third technique may be the most interesting and recently.",
            "My."
        ],
        [
            "Are present in web spamming technique.",
            "Is JavaScript direct?",
            "We have few examples of JavaScript redirects so some of them are very simple and they are easily detected by static analysis of the code of the document.",
            "The second one, some more elaborate analysis, is needed to understand.",
            "This document will be redirected that this will be a direction, and of course this should be done before indexing the document, so."
        ],
        [
            "This is the problem.",
            "And here we have even more complex example when.",
            "We use the eval function of JavaScript, so the.",
            "Window location.",
            "Is constructed during the execution, so only dynamic analysis of this code could detect.",
            "This kind of technique there are even more elaborated.",
            "For example, combine."
        ],
        [
            "Such a technique with encoding encoding scripts, for example, here we have an encoded name of.",
            "Of instruction, so this is this drink encodes the possibly some JavaScript.",
            "Instruction."
        ],
        [
            "So from the search engine side there are few the countermeasures there are few.",
            "Groups of activities first avoid this education so search engines publish their guidelines how to make documents to be not to be not treated as a spammer.",
            "Second, the spam spam detection techniques and in the second part."
        ],
        [
            "Spam detection techniques will be."
        ],
        [
            "Explain more in more detail."
        ],
        [
            "And a few groups as we say.",
            "So text based link based."
        ],
        [
            "The language model based.",
            "And also search engines maintain some blacklist.",
            "So lists of such pictures hosts which are regarded as spam host and very recently machine learning approach was applied to D."
        ],
        [
            "Webspam?",
            "Also, many search engines maintain some spam reporting interface, so when a user sees that some document is a spam, they can report."
        ],
        [
            "The document of course it could be used in adversarial wires, so it should be used with care.",
            "Finally, punishment is a finite resource, so the search engine can exclude some document or host from indexing as a punishment for being."
        ],
        [
            "For spamming and for researchers, this is very interesting.",
            "Application of data mining and information retrieval.",
            "So this is now very intensively studied."
        ],
        [
            "Field.",
            "Hope research.",
            "Struggle between spammers and search engines gets harder because there are a lot of factors used to compute the ranking.",
            "We just mentioned a few, but in fact in practice in search engines the formulas for computing the ranking could be quite complex.",
            "And could include many factors and 2nd.",
            "Is that it is a real arms race between?"
        ],
        [
            "Plumbers in search engine so spammers can apply some new technique and then search engines could detect."
        ],
        [
            "This technique can supply some countermeasures against this."
        ],
        [
            "But then spammers spammers realized that this technique is not not not successful at not any longer successful.",
            "So spam."
        ],
        [
            "Supply new deceptive technique and search engines detect this technique, improve the ranks and so on.",
            "So this is kind of arms race and this two factors make.",
            "Is this problem hard and this is?"
        ],
        [
            "Why recently machine learning approach was applied to help to fight and detect web spamming?",
            "Because you should adapt very quickly to the changing techniques and conditions and the second part of the presentation will be devoted to.",
            "To machine learning approach.",
            "Two detecting web."
        ],
        [
            "Spamming so.",
            "Thank you for the first part of your questions.",
            "Yes, I think it is better because the parts are different and quite long.",
            "So maybe maybe just three short questions.",
            "We will have also another partial question at the very end.",
            "How difficult in general to detect a crawler from a regular user and if it's not so difficult, why didn't the search engines really try to harm their crawlers?",
            "Very good question, so of course it works only if a crawler behaves.",
            "In a proper way, so large search engines usually introduced themselves as being search engines.",
            "But of course if it's if it pretends to be a browser, you cannot detect it.",
            "So so this is.",
            "I want to mention one other type of spam that I've seen all the time to go with language models from the web and I've stumbled across some strange combinations of words and that find that there are many pages that are automatic translations of of these types of.",
            "So there are some pages in English and then translated into extensions in AltaVista.",
            "And so you get messy stuff in there.",
            "So the question is how to detect that this is a translation or.",
            "Yeah, how can you?",
            "R. Sorry so.",
            "Oh, I don't understand the question.",
            "Oh, OK, thank you.",
            "So can I respond to you in reaction to your previous answer about the browsers and the.",
            "Crawlers can occur or really effectively masquerade as a user.",
            "Would seem like it would have to make itself far too slow to be effective, if in fact you have a link farm with lots and lots of links on.",
            "Yes.",
            "Very good question, I the problem is that we don't have enough time to explain how how colors work.",
            "You cannot if you launch big crawler, you cannot just collect documents in a very high pace because you have to respect the you have to respect the resources of the of the host being called.",
            "So in practice you make breaks between between requests.",
            "Usually it is 1 second or five seconds, so you can easily make it long enough to.",
            "To pretend browser in fact, maybe not easily, but it is possible, so it's not like crawler collects the whole host at the moment and then gets to another host, because because it would consume all the resources of the crowd host so.",
            "Sort of adverse aerial learning problem because you know, I mean, if you're looking across a web link farm, you know if it's too regular, then it's probably yes, yes, exactly.",
            "Yeah, so This is why machine learning approach was recently applied to detecting web spam.",
            "I think it's just the beginning of the story.",
            "I think it is much to be done in this area and Carlos will say something about about machine learning approach in the next part.",
            "OK, so I think there's a time for the second part."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, good afternoon.",
                    "label": 0
                },
                {
                    "sent": "I think it's time to start.",
                    "label": 0
                },
                {
                    "sent": "We are going to present presentation about Fighting web spam and the presentation is will be divided into 3 parts.",
                    "label": 0
                },
                {
                    "sent": "First part is about 40 minutes, then about 5 minutes break, then about 40 minutes for the second part and the last very short part.",
                    "label": 0
                },
                {
                    "sent": "Can everybody hear me in the room?",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is a.",
                    "label": 0
                },
                {
                    "sent": "This is our team.",
                    "label": 0
                },
                {
                    "sent": "We prepared a presentation for people.",
                    "label": 0
                },
                {
                    "sent": "Carlos Castillo from Yahoo Research, Barcelona, Spain, March instead of its May actually published Japanese Institute of Information Technology in Warsaw, Poland.",
                    "label": 1
                },
                {
                    "sent": "Yahoo Piskorski Joint Research Centre, Italy and Device Falls Line University of Technology.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Poland.",
                    "label": 0
                },
                {
                    "sent": "So as I said to learn with three parts, I will make the first part and this is because the presentation concerns the web spamming.",
                    "label": 0
                },
                {
                    "sent": "It is very important to very well to understand very well what search engines are and how they work is.",
                    "label": 0
                },
                {
                    "sent": "So the first part is devoted mostly to introduction to search engines and I don't assume any any any knowledge, so it is introductory level and then Carlos Castillo from Yahoo Research we present.",
                    "label": 0
                },
                {
                    "sent": "Reference corpus for for research about webspam?",
                    "label": 0
                },
                {
                    "sent": "Detection and then our very short part about new preliminary.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Experimental results.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first part about search engines.",
                    "label": 0
                },
                {
                    "sent": "So maybe let's say a few words about the web today.",
                    "label": 0
                },
                {
                    "sent": "Maybe it is very maybe you are familiar with these figures, but.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is the size about the web?",
                    "label": 0
                },
                {
                    "sent": "Today?",
                    "label": 0
                },
                {
                    "sent": "It is at least 10 billion.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Documents and some estimates are even higher.",
                    "label": 0
                },
                {
                    "sent": "There is even a site you can go to the site and track.",
                    "label": 0
                },
                {
                    "sent": "What is the estimated number of documents in the web today.",
                    "label": 1
                },
                {
                    "sent": "So it is over 20 billion documents into up-to-date.",
                    "label": 0
                },
                {
                    "sent": "And also there is a work devoted to computing counting the number of indexable document.",
                    "label": 0
                },
                {
                    "sent": "So the documents which which makes sense to be indexed it is tin tin.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Billion documents?",
                    "label": 0
                },
                {
                    "sent": "What about the size of the volume of the content of the web it is?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "It is over 100 terabytes of textual data and of course we don't count multimedia here.",
                    "label": 0
                },
                {
                    "sent": "So what about the water?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the population.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The web.",
                    "label": 0
                },
                {
                    "sent": "There are different figures, but definitely it is few 100 million users of the web.",
                    "label": 0
                },
                {
                    "sent": "So all this makes the web is the largest source of information.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course everybody knows it, but this is also important for this farm.",
                    "label": 0
                },
                {
                    "sent": "Searching information in the web is among the top activities today.",
                    "label": 0
                },
                {
                    "sent": "And I would like to ask.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you know what are the three most popular websites, so they in general so.",
                    "label": 0
                },
                {
                    "sent": "Does anybody know?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, there are three major search focus portals.",
                    "label": 0
                },
                {
                    "sent": "I don't mean the order order is different.",
                    "label": 0
                },
                {
                    "sent": "But I I just mean that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These three search focus portals are the three most popular sites in general today.",
                    "label": 0
                },
                {
                    "sent": "So it means that searching is really important activity of web use.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Today why search engines are so important?",
                    "label": 0
                },
                {
                    "sent": "Of course, because without search engines we couldn't use this information in any way.",
                    "label": 0
                },
                {
                    "sent": "It is absolutely outside of possibilities of any of any human, so this is.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So search engines are just the main gate to the information in the web.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Day.",
                    "label": 0
                },
                {
                    "sent": "And also have some facts.",
                    "label": 0
                },
                {
                    "sent": "For example, 256 million people used Internet in UK in 206 in December 206.",
                    "label": 0
                },
                {
                    "sent": "So this means that the search.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Changes are heavily used.",
                    "label": 0
                },
                {
                    "sent": "Some available statistics about number of queries daily.",
                    "label": 0
                },
                {
                    "sent": "They are not new, of course they are from two years ago and I think maybe you have some newer statistics but it is 200, so five it was assessed by Google for being.",
                    "label": 0
                },
                {
                    "sent": "Put being 500 mil.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Queries daily and shares of the three majors.",
                    "label": 0
                },
                {
                    "sent": "Three major search engines were like like this, almost half or Google about for Yahoo and MSN.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is the third search engine and what it means in practice.",
                    "label": 0
                },
                {
                    "sent": "So for a global search engine, it means that it must process.",
                    "label": 1
                },
                {
                    "sent": "50,000 queries daily, which means about 3000 queries per second over say 100 or 8 or 80 terabyte corpus, takes to all corpus, so this is really massive operation.",
                    "label": 0
                },
                {
                    "sent": "Each query must be served under second under one second.",
                    "label": 1
                },
                {
                    "sent": "If it does not search under one second the users they use.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can just change the search engine.",
                    "label": 1
                },
                {
                    "sent": "It is a phrase used by I heard it once.",
                    "label": 0
                },
                {
                    "sent": "The computers are one click away.",
                    "label": 0
                },
                {
                    "sent": "So if you are not, if you cannot serve query fast enough or if the if the result is not is not relevant enough, you can just change the search engine.",
                    "label": 0
                },
                {
                    "sent": "So this is very aggressive competition.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So maybe let's say a few words about the general search engine architecture in the task of search engine is seemingly simple, so it is to return documents containing as well because of the volume of data and intensivity of usage.",
                    "label": 0
                },
                {
                    "sent": "It is very complex information system, so on the one hand we have we have web with documents without documents.",
                    "label": 0
                },
                {
                    "sent": "It is here on the other end we have a customer or user of the system and user poses a query and.",
                    "label": 0
                },
                {
                    "sent": "Before the user gets.",
                    "label": 0
                },
                {
                    "sent": "Get the result the documents are crawled by a crawler, which is a very special.",
                    "label": 0
                },
                {
                    "sent": "Distributed network system to collect documents efficiently.",
                    "label": 0
                },
                {
                    "sent": "Then documents are stored in so called repository.",
                    "label": 0
                },
                {
                    "sent": "Then documents are indexed offline of course.",
                    "label": 0
                },
                {
                    "sent": "And they are kept in a very special system of data structures, which are called index.",
                    "label": 0
                },
                {
                    "sent": "And then the index income is consulted during the query time, so so this is very important part of search engine is the ranking system which is the part of the search engine which is consulted during the generating results.",
                    "label": 0
                },
                {
                    "sent": "And this is the part which decides of the about the order of the return results.",
                    "label": 0
                },
                {
                    "sent": "So this is very important part of search engine will say.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About this model edge.",
                    "label": 0
                },
                {
                    "sent": "So just summary crawler.",
                    "label": 0
                },
                {
                    "sent": "Follow links.",
                    "label": 0
                },
                {
                    "sent": "And collect the documents efficiently.",
                    "label": 1
                },
                {
                    "sent": "It is usually quite big and complex system repository should enable.",
                    "label": 0
                },
                {
                    "sent": "Should make it possible to access documents in at least two special modes.",
                    "label": 0
                },
                {
                    "sent": "First mode is for indexing, so it is streaming access.",
                    "label": 0
                },
                {
                    "sent": "Second mode is during the querying, so it should be very fast.",
                    "label": 0
                },
                {
                    "sent": "Random read operation.",
                    "label": 0
                },
                {
                    "sent": "Let's say index is a data structure for storing information.",
                    "label": 0
                },
                {
                    "sent": "Which word.",
                    "label": 0
                },
                {
                    "sent": "It is stored in which document also about the context.",
                    "label": 1
                },
                {
                    "sent": "If it is in content or in a title or in the URL or in anchor text and so on.",
                    "label": 1
                },
                {
                    "sent": "Then ranking system which documents are important and which documents are relevant for the particular query for a particular query.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is quite complex system.",
                    "label": 0
                },
                {
                    "sent": "Of course we don't have time to get into details search engines, but this is all.",
                    "label": 0
                },
                {
                    "sent": "Important to understand the motivation of website.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And mechanism of web spamming?",
                    "label": 0
                },
                {
                    "sent": "So this is just example of architecture over large scale crawler.",
                    "label": 0
                },
                {
                    "sent": "I don't want to spend much time on this picture, but there is a complex distributed priority queue, let's say which stores the URLs to be crawled.",
                    "label": 0
                },
                {
                    "sent": "And then there is some section of models to serve DNS requests efficiently.",
                    "label": 0
                },
                {
                    "sent": "Usually you need a special custom asynchronous DNS client for large scale closures, and there are some other systems to monitor the operation and to compute some some statistics for the for the next growth and so on.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "So now let's get to ranking system, which is possibly the most important part of the search engine.",
                    "label": 0
                },
                {
                    "sent": "The facts are that the for average query you can easily get millions of answers, millions of documents which contain the specified keywords.",
                    "label": 0
                },
                {
                    "sent": "Every human capital capability is to see just to inspect the team document 10 documents or or 20.",
                    "label": 0
                },
                {
                    "sent": "So usually very few very few very few users go behind behind the first page of results.",
                    "label": 0
                },
                {
                    "sent": "So the main problem is how to select the few few most relevant documents out of thousands or millions documents which contain.",
                    "label": 1
                },
                {
                    "sent": "The keywords and this is the primary issue of search engines, let's say and so.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And the model, which is which is which is responsible for this task, is the ranking system.",
                    "label": 0
                },
                {
                    "sent": "Uh, so it plays a central role of the search engine, and in fact ranking system is the one of the.",
                    "label": 1
                },
                {
                    "sent": "One of the two parts which are exposed to attacks of spammers so web farm is a misleading ranking system will say more about this later.",
                    "label": 0
                },
                {
                    "sent": "And the ranking system existed before in so-called information retrieval systems.",
                    "label": 0
                },
                {
                    "sent": "It was in 60s.",
                    "label": 0
                },
                {
                    "sent": "It started at 60 set it concerns systems to retrieve information stored in controlled corpuses of textual documents inside corporations for example.",
                    "label": 0
                },
                {
                    "sent": "So it were not web web documents but just textual documents stored electronically and some some information retrieval, some.",
                    "label": 0
                },
                {
                    "sent": "Some ranking systems existed.",
                    "label": 0
                },
                {
                    "sent": "In those systems, but.",
                    "label": 0
                },
                {
                    "sent": "But what we do have some specific features which make it necessary to adapt ranking algorithms to the web.",
                    "label": 0
                },
                {
                    "sent": "1998 they were introduced some.",
                    "label": 0
                },
                {
                    "sent": "Some new, let's say, let's say dimension of computing ranking.",
                    "label": 0
                },
                {
                    "sent": "It was a introducing link analysis.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh So what is the task of the of the ranking system?",
                    "label": 0
                },
                {
                    "sent": "It is for each computer.",
                    "label": 0
                },
                {
                    "sent": "For each document it computes score and.",
                    "label": 0
                },
                {
                    "sent": "While returning the documents, it's sort of the documents in an increasing order and their manufacturers used for computing this ranking.",
                    "label": 0
                },
                {
                    "sent": "So first of all, it's the text analysis, so the textual content of the document are analyzed.",
                    "label": 0
                },
                {
                    "sent": "There also there's also an Kotex anchor.",
                    "label": 0
                },
                {
                    "sent": "Text is a text which is part of the link from other documents, so between the a HTML tags.",
                    "label": 0
                },
                {
                    "sent": "So this is called anchor text and it's also very, very very valuable source of information.",
                    "label": 0
                },
                {
                    "sent": "For computing the ranking, link analysis will spend some time on this and also Carlos will say much about link analysis.",
                    "label": 1
                },
                {
                    "sent": "Query log analysis.",
                    "label": 0
                },
                {
                    "sent": "You can also analyze the previous queries and you can infer some useful knowledge about the popularity of subdocuments or popularity of some queries, and so on.",
                    "label": 0
                },
                {
                    "sent": "You can also use the traffic and difficulties, but this is not easy to collect traffic data.",
                    "label": 0
                },
                {
                    "sent": "And you can also use a history of previous queries of particular user if you have information of the of about the identity.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the user.",
                    "label": 0
                },
                {
                    "sent": "So maybe let's say few words about text to all the textual factors.",
                    "label": 0
                },
                {
                    "sent": "So the most basic variant is to use with a vector representation of textual document.",
                    "label": 1
                },
                {
                    "sent": "So which document is represented as a vector and dimensions are tokens usually and on each dimension you have some some statistic.",
                    "label": 0
                },
                {
                    "sent": "For example example of static is so so called TF.",
                    "label": 0
                },
                {
                    "sent": "Idea if we just time frequency inverted, inverted dark frequency then frequency is a statistic which is increasing and increasing function of number of terms in a document.",
                    "label": 0
                },
                {
                    "sent": "An inverted document frequency is a non increasing function of the number of documents containing the keywords.",
                    "label": 0
                },
                {
                    "sent": "The intuition behind this statistic is that the more often term occurs in a document, the more relevant document is for this term and the intuition behind the IDF factor is that the less document contains the keyword, the more.",
                    "label": 0
                },
                {
                    "sent": "Informative, the keyword is, so this is just very basic statistic and usually you compute for for example a product of these two statistics.",
                    "label": 0
                },
                {
                    "sent": "But of course there are many variants of the statistics.",
                    "label": 0
                },
                {
                    "sent": "And then if you translate documents into vectors, you can also translate the query into a vector and then you can apply any vector similarity measures.",
                    "label": 0
                },
                {
                    "sent": "Of course there are many problems like problems.",
                    "label": 1
                },
                {
                    "sent": "That query is usually very short and document is usually very long and you have synonyms.",
                    "label": 0
                },
                {
                    "sent": "So there are some other techniques applied.",
                    "label": 1
                },
                {
                    "sent": "For example, you can use some some dimensionality reduction techniques like singular.",
                    "label": 1
                },
                {
                    "sent": "Decomposition or or some other mathematical operations.",
                    "label": 0
                },
                {
                    "sent": "And in general this this factor works very well for many years for textual.",
                    "label": 0
                },
                {
                    "sent": "Controlled corpora inside in.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At corporations.",
                    "label": 0
                },
                {
                    "sent": "But there are some web specific issues which should be addressed when we compute the ranking of a document.",
                    "label": 0
                },
                {
                    "sent": "So first of all, in contrast to classical information retrieval task in the web we have document of low quality mix with documents with of high quality and also there is extreme diversity between the documents.",
                    "label": 1
                },
                {
                    "sent": "So there are for example hundreds of languages.",
                    "label": 0
                },
                {
                    "sent": "There are 10s of file formats.",
                    "label": 0
                },
                {
                    "sent": "10s of encodings and so on, so this is extremely diverse.",
                    "label": 0
                },
                {
                    "sent": "There's also so called's self description problem when septic system problem it could be explained examples.",
                    "label": 0
                },
                {
                    "sent": "The classical example is for example when you are.",
                    "label": 0
                },
                {
                    "sent": "Posing a query like Japanese car manufacturers of for example, you are thinking about Toyota, but it may happen that the main site of the Toyota doesn't contain this particular term, so this is called subjects self description problem.",
                    "label": 0
                },
                {
                    "sent": "And also we have quite much noise in the web.",
                    "label": 1
                },
                {
                    "sent": "You have many errors and also some adversarial aspects which were not present.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In controlled collections.",
                    "label": 0
                },
                {
                    "sent": "And now what can we do about this?",
                    "label": 0
                },
                {
                    "sent": "So one of remedy is a link analysis of the web graph.",
                    "label": 1
                },
                {
                    "sent": "So you can represent a web as a graph.",
                    "label": 0
                },
                {
                    "sent": "When, for example, each document is a note of this graph and each link between documents is an edge is a direct edge of this graph.",
                    "label": 0
                },
                {
                    "sent": "Link analysis is the branch of Sciences of analyzing this graph.",
                    "label": 1
                },
                {
                    "sent": "The basic assumption which lies behind this is that a single link could be interpreted as a positive judgement.",
                    "label": 0
                },
                {
                    "sent": "Of the outer of the linking document about the linked document.",
                    "label": 1
                },
                {
                    "sent": "Of course it is not true about every single link, but it happens that it works in math.",
                    "label": 0
                },
                {
                    "sent": "So if you analyze the whole graph of the web, you can infer very useful knowledge about importance of documents.",
                    "label": 0
                },
                {
                    "sent": "Up and of course example very famous link based ranking algorithm page rank.",
                    "label": 0
                },
                {
                    "sent": "They will say few words.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About Pedro.",
                    "label": 0
                },
                {
                    "sent": "So of course, before they were there.",
                    "label": 0
                },
                {
                    "sent": "So there were some some very simple ideas of computing of using link analysis to compute importance of documents.",
                    "label": 0
                },
                {
                    "sent": "For example, could compute the number of links to a particular document.",
                    "label": 0
                },
                {
                    "sent": "So Justin Ling counter.",
                    "label": 0
                },
                {
                    "sent": "But this is too simple and it is easy to be spammed, so nobody uses it nowadays is slightly more elaborate's idea is.",
                    "label": 0
                },
                {
                    "sent": "Not count to not only count the links, but also to check who links to particular document so so it could be explained like this that each page has some authority.",
                    "label": 0
                },
                {
                    "sent": "Each page distributes its authority equally through links to the documents it links to.",
                    "label": 1
                },
                {
                    "sent": "And the authority of of each page is a total authority coming to this page.",
                    "label": 0
                },
                {
                    "sent": "So this is like a flow to the whole graph of the web.",
                    "label": 0
                },
                {
                    "sent": "Of course, some of the authority is bounded.",
                    "label": 0
                },
                {
                    "sent": "Usually it is 1.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Up it could be also, of course it's expressed in the form of some equations.",
                    "label": 0
                },
                {
                    "sent": "It could be also expressed in terms of so called random server.",
                    "label": 0
                },
                {
                    "sent": "And I think the simplest description is just in the matrix language.",
                    "label": 0
                },
                {
                    "sent": "That page rank is just.",
                    "label": 0
                },
                {
                    "sent": "Is the.",
                    "label": 0
                },
                {
                    "sent": "Eigenvector of corresponding to eigenvalue one of the adjacency of the adjacency matrix of the web graph.",
                    "label": 0
                },
                {
                    "sent": "In fact, this adjacency matrix should be slightly.",
                    "label": 0
                },
                {
                    "sent": "Should be slightly corrected, let's say because of some problem.",
                    "label": 0
                },
                {
                    "sent": "So here what I said at the beginning is the first equation.",
                    "label": 0
                },
                {
                    "sent": "Is this so called simplified page rank when you just?",
                    "label": 0
                },
                {
                    "sent": "Good.",
                    "label": 0
                },
                {
                    "sent": "Take into accounts in links.",
                    "label": 0
                },
                {
                    "sent": "The original links in the web graph, but there are some problems like so called.",
                    "label": 0
                },
                {
                    "sent": "Sinks.",
                    "label": 0
                },
                {
                    "sent": "So if you have a set of nodes which have no outbound links, they can absorb the whole authority, so we can do some technical tricks to make a page rank.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Practical, let's say in the case of of the web graph.",
                    "label": 0
                },
                {
                    "sent": "So summary page rank introducing Google in 98 is now.",
                    "label": 0
                },
                {
                    "sent": "A patient algorithm in USA, but I think that most search engines now use some algorithm which is similar to page rank or base to it or somehow related.",
                    "label": 1
                },
                {
                    "sent": "Properties of the patron cards.",
                    "label": 0
                },
                {
                    "sent": "It was one of the first pioneer.",
                    "label": 1
                },
                {
                    "sent": "It was one of the first successful link based ranking algorithm.",
                    "label": 0
                },
                {
                    "sent": "Also hits is the sum link based algorithm and it also was introduced in 98.",
                    "label": 0
                },
                {
                    "sent": "Page rank is quite immune to spanning compared to other pure link based algorithms.",
                    "label": 0
                },
                {
                    "sent": "And it was, and patron gave birth to many other algorithms.",
                    "label": 0
                },
                {
                    "sent": "For example, personalized page rank.",
                    "label": 0
                },
                {
                    "sent": "When you can set some vector personalization vector to boost some some nodes of the graph there.",
                    "label": 0
                },
                {
                    "sent": "There's also very interesting.",
                    "label": 0
                },
                {
                    "sent": "Variant which is called topic sensitive Pagerank.",
                    "label": 0
                },
                {
                    "sent": "When you make a page rank sensitive to Aquarius, so the idea is to compute 1616.",
                    "label": 0
                },
                {
                    "sent": "The paper it was in the paper it was just 16.",
                    "label": 0
                },
                {
                    "sent": "Drinks for different for different.",
                    "label": 0
                },
                {
                    "sent": "Terms for the and then you compute something like a combination in the context of the given query.",
                    "label": 0
                },
                {
                    "sent": "Trust market, antitrust rank.",
                    "label": 0
                },
                {
                    "sent": "There are algorithms used for fighting spam.",
                    "label": 0
                },
                {
                    "sent": "And also there are some extensions of the random server model and many many.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other extensions, so now after this short introduction to the search.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This will say what is a web spam?",
                    "label": 0
                },
                {
                    "sent": "So first of all, what?",
                    "label": 0
                },
                {
                    "sent": "What makes web web search engines exist?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Why they they survive?",
                    "label": 0
                },
                {
                    "sent": "They have quite.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hard job, let's say so.",
                    "label": 0
                },
                {
                    "sent": "The factor which makes search engine exists search based advertising.",
                    "label": 1
                },
                {
                    "sent": "So there are some opinions that the most of revenues of search engines are.",
                    "label": 0
                },
                {
                    "sent": "Because of search based advertising.",
                    "label": 1
                },
                {
                    "sent": "And main types of search based advertising are also called sponsor links.",
                    "label": 0
                },
                {
                    "sent": "When you put some.",
                    "label": 0
                },
                {
                    "sent": "Some links assigned the search results, so they are paid and of course this sponsored links should fit to the query.",
                    "label": 1
                },
                {
                    "sent": "Another group of or another variant of.",
                    "label": 0
                },
                {
                    "sent": "Of search based adverts is.",
                    "label": 0
                },
                {
                    "sent": "Textual ads.",
                    "label": 0
                },
                {
                    "sent": "So when you place advertisement on the web page so the customer owns the web page and you and you place some parts on the on the websites.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my bullets say something about the fibers, so Internet advertising this is the data from USA from 206.",
                    "label": 0
                },
                {
                    "sent": "I don't have data from Europe unfortunately.",
                    "label": 0
                },
                {
                    "sent": "What we can see that Internet advertising which is not only search based advertising is about 70 billion dollars this.",
                    "label": 0
                },
                {
                    "sent": "And these are desirable diesel revenues, so this is quite hight #17 billion dollars in 206.",
                    "label": 0
                },
                {
                    "sent": "And it is seventh position in there.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our market.",
                    "label": 0
                },
                {
                    "sent": "And it happens that the search based advert asks.",
                    "label": 0
                },
                {
                    "sent": "Constitute a major part of this of this market, so there's about 40% percent for searching for service based advertisements, so it is about 6 1/2 billion dollars.",
                    "label": 0
                },
                {
                    "sent": "Of revenues in 206.",
                    "label": 0
                },
                {
                    "sent": "Yes, but this is 205.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is 205 so we can see the small drop in the figure, but it is not much and it is.",
                    "label": 0
                },
                {
                    "sent": "It is usually.",
                    "label": 0
                },
                {
                    "sent": "So in the 204, I think it was like 39%.",
                    "label": 0
                },
                {
                    "sent": "So it is about 40%.",
                    "label": 0
                },
                {
                    "sent": "United States.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So this is quite much money, in fact, so this is of course what I'm going to tell next is that this money is the target of.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Web spammers, so somehow.",
                    "label": 0
                },
                {
                    "sent": "So now let's explain the basic mechanism of spam motivation.",
                    "label": 0
                },
                {
                    "sent": "What is this power motivation?",
                    "label": 0
                },
                {
                    "sent": "So as we said search engine ranking.",
                    "label": 1
                },
                {
                    "sent": "Affects web page visibility.",
                    "label": 0
                },
                {
                    "sent": "If you have high ranking you are well visible in the web.",
                    "label": 0
                },
                {
                    "sent": "And now if your web page or website is well visible, you have much traffic to this page and then if you have much traffic you can have, you can have much incomes because traffic means incomes because of the contextual arts programs.",
                    "label": 0
                },
                {
                    "sent": "If you have high traffic you can just use some part of your website to part advertisements so.",
                    "label": 1
                },
                {
                    "sent": "It is very incentive today.",
                    "label": 1
                },
                {
                    "sent": "Too high to highly rank on search engines, and this is the main motivation of webspam.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What about the definition of this problem?",
                    "label": 0
                },
                {
                    "sent": "In fact, there is no clear definition of webspam.",
                    "label": 0
                },
                {
                    "sent": "But one of the definitions, web spam, is any any manipulation of the of the web documents or websites in order to mislead search engine ranking system.",
                    "label": 1
                },
                {
                    "sent": "To obtain understood undeservedly high ranking without improving the real information quality of the document.",
                    "label": 1
                },
                {
                    "sent": "So this one there is also an extreme version of this definition.",
                    "label": 0
                },
                {
                    "sent": "Webform is anything which is done because search engines exist.",
                    "label": 0
                },
                {
                    "sent": "If search engine wouldn't exist.",
                    "label": 0
                },
                {
                    "sent": "So of course this is not very precise definition, but.",
                    "label": 0
                },
                {
                    "sent": "But these are some definitions are found.",
                    "label": 0
                },
                {
                    "sent": "And we can say that Webstorm is highly motivated economically because of this of this, revenues of of advertisement.",
                    "label": 0
                },
                {
                    "sent": "It is over 6 and half billion dollars annually in United States.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So spam is destructive and it affects the web community because.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because it undermines search engines business and search engines are used every day.",
                    "label": 0
                },
                {
                    "sent": "Bye bye everybody.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also it deteriorates information quality becausw.",
                    "label": 0
                },
                {
                    "sent": "We are using search engines and we see webspam.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the search results, so combating web spam is a primary issue not only for search engines but also for web users, so this is.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would come on it.",
                    "label": 0
                },
                {
                    "sent": "It concerns the whole web web community.",
                    "label": 0
                },
                {
                    "sent": "Of course, there's also some Gray area between.",
                    "label": 0
                },
                {
                    "sent": "The webspam and so called search optimization or search engine optimization techniques?",
                    "label": 0
                },
                {
                    "sent": "There's a big market nowadays, so search engine optimization is a business when you when you pay for making your website better, visible.",
                    "label": 0
                },
                {
                    "sent": "And of course it is very difficult to say where is the border, where the techniques applied to make your document better visible is.",
                    "label": 0
                },
                {
                    "sent": "Is a Whitehead technique and wait when is it?",
                    "label": 0
                },
                {
                    "sent": "Undeserved the high ranking is undeserved, but you can always refer to a terms of service of each search engine and this is you can search engine publishes some guidelines and if you follow the guidelines you may be sure that you are not regarded as a spammer if you improve.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The visibility of your website.",
                    "label": 0
                },
                {
                    "sent": "So first of all, so maybe let's say something about spam taxonomy now.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not two groups of techniques applied by.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Farmers and we can divide them into hiding techniques and boosting techniques and hiding techniques are techniques aimed at making web spam detection more difficult.",
                    "label": 1
                },
                {
                    "sent": "And both in techniques are techniques based on making your ranking higher.",
                    "label": 0
                },
                {
                    "sent": "So these are two kinds of.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If it is.",
                    "label": 0
                },
                {
                    "sent": "And of course Webspam can be also divided with with with with regards to which factor of ranking system is.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Target.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry, so of course because we use content based statistics to compute document ranking.",
                    "label": 0
                },
                {
                    "sent": "Content based techniques can try to explore.",
                    "label": 0
                },
                {
                    "sent": "This factor is used in in rankings.",
                    "label": 1
                },
                {
                    "sent": "They also link based techniques which are aimed at misleading.",
                    "label": 0
                },
                {
                    "sent": "A link based factors using computing ranking and some.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Other techniques we will leave them.",
                    "label": 0
                },
                {
                    "sent": "So for the content based techniques, there are some very old techniques like hidden text.",
                    "label": 1
                },
                {
                    "sent": "When you have a text of a very small size, or of having the same color as the background, so they are invisible for the people who are looking at the page, but they are visible by the crawler and indexer.",
                    "label": 0
                },
                {
                    "sent": "So these are very old techniques and they have these are very easy to be detected.",
                    "label": 0
                },
                {
                    "sent": "There's also repetition.",
                    "label": 0
                },
                {
                    "sent": "Repetition means that you pass many, many popular terms on on the website or web document in order to boost TF statistics.",
                    "label": 0
                },
                {
                    "sent": "So term frequency statistics.",
                    "label": 0
                },
                {
                    "sent": "But this is also very simple and quite easy to be detected.",
                    "label": 0
                },
                {
                    "sent": "Slightly more elaborated countered based techniques like keyword stuffing or dilution or weaving.",
                    "label": 0
                },
                {
                    "sent": "It means just that too, instead of instead of parting rapidly.",
                    "label": 0
                },
                {
                    "sent": "Instead of putting repeated words.",
                    "label": 0
                },
                {
                    "sent": "For example part, the bigger fragments of text which are statistically more more more difficult to be detected that are artificially part in the page and don't have anything in common with the topic of the of the rest of the page.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uh.",
                    "label": 0
                },
                {
                    "sent": "Also link based techniques so it wasn't funny.",
                    "label": 0
                },
                {
                    "sent": "Part is when you have many pages which are seemingly normal, but all they have some some hidden links too.",
                    "label": 0
                },
                {
                    "sent": "To a target page which is a page which is the target page, means that the ranking of this page should be boosted and anchor text spam when you part many pages and to add some special keywords in anchor tags and all these all these links link to a target page.",
                    "label": 0
                },
                {
                    "sent": "Block Spam is a very important group of spam techniques.",
                    "label": 1
                },
                {
                    "sent": "It is a phenomenon where because in blocks you can part the.",
                    "label": 0
                },
                {
                    "sent": "So your documents and you could you can put links to any document.",
                    "label": 0
                },
                {
                    "sent": "So so you have a control of the of the links, but the block itself is not is hosted by, sometimes by by some.",
                    "label": 0
                },
                {
                    "sent": "A host of high importance, so leaking link exchanges is when many nodes of exchange link in order to totally accumulate higher page rank or higher.",
                    "label": 0
                },
                {
                    "sent": "Other web based link based statistics expired domains link farms, expired domains and then you can populate.",
                    "label": 1
                },
                {
                    "sent": "Expired domains with documents with spamming with.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sperm count.",
                    "label": 0
                },
                {
                    "sent": "Up and some other techniques are cloaking and to direction.",
                    "label": 0
                },
                {
                    "sent": "They are not targeted at the ranking system but rather at a crawler or at a.",
                    "label": 0
                },
                {
                    "sent": "So maybe I will explain this.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Techniques later I will have a slide, so there's some examples of spamming pages.",
                    "label": 0
                },
                {
                    "sent": "This is just putting some popular keywords on the page and this is very easy to detect it automatically that this page is not very very very valuable.",
                    "label": 0
                },
                {
                    "sent": "For human.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Here we have a hidden text, so the text is in.",
                    "label": 0
                },
                {
                    "sent": "Color of background.",
                    "label": 0
                },
                {
                    "sent": "So the possibly the author of this webpage trying to do both that the F statistic of this web.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Payment.",
                    "label": 0
                },
                {
                    "sent": "Here we have a page which has some content, possibly kopite, from some other normal webpages, but also there are some some contextual ads part on this website, so it it is aimed at accumulated some automating some traffic and then.",
                    "label": 0
                },
                {
                    "sent": "Make some.",
                    "label": 0
                },
                {
                    "sent": "To make some some revenues from from advertisements.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is a example of.",
                    "label": 0
                },
                {
                    "sent": "Search engine so you can ask a query to this search engine.",
                    "label": 1
                },
                {
                    "sent": "For example sports book.",
                    "label": 0
                },
                {
                    "sent": "You receive some results and it looks quite OK, but.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It happens that if you ask another query, it doesn't make any sense.",
                    "label": 0
                },
                {
                    "sent": "You also get some results, so this is a fake search engine and this is another example of spam.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's a example link farm.",
                    "label": 0
                },
                {
                    "sent": "When you have almost normal content and.",
                    "label": 1
                },
                {
                    "sent": "This is a part of a bigger structure with links to other documents, so this is a part of a group of web documents aimed to boost a link based static.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is the cloaking cloaking is is a technique.",
                    "label": 0
                },
                {
                    "sent": "And could be explained like like this one.",
                    "label": 0
                },
                {
                    "sent": "When when when I crawler visits Web page to collect the documents?",
                    "label": 0
                },
                {
                    "sent": "Different document is is returned and 1 browser.",
                    "label": 0
                },
                {
                    "sent": "And when a browser.",
                    "label": 0
                },
                {
                    "sent": "Requests this document and other content is shown, so this is a different showing different content to a crawl.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different content to browser.",
                    "label": 0
                },
                {
                    "sent": "And the direction is when.",
                    "label": 0
                },
                {
                    "sent": "So there are three possible groups of redirection techniques for, so it is that when you try to see the web when when a user tries to see the web document which is for example returned by search results.",
                    "label": 0
                },
                {
                    "sent": "The user is is is directed to another document so the crawler sees the first document and the users is another document.",
                    "label": 0
                },
                {
                    "sent": "So this is a hiding technique similar to clocking in some way, but.",
                    "label": 0
                },
                {
                    "sent": "But other means are used to achieve the same goal, and the three kinds of redirection first is, for example you can server can can return an directions status as a group of HTT HTTP errors, three hundreds and something.",
                    "label": 0
                },
                {
                    "sent": "The second possible technique is to.",
                    "label": 0
                },
                {
                    "sent": "When you can use a meta tag.",
                    "label": 0
                },
                {
                    "sent": "And the third technique may be the most interesting and recently.",
                    "label": 0
                },
                {
                    "sent": "My.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are present in web spamming technique.",
                    "label": 0
                },
                {
                    "sent": "Is JavaScript direct?",
                    "label": 0
                },
                {
                    "sent": "We have few examples of JavaScript redirects so some of them are very simple and they are easily detected by static analysis of the code of the document.",
                    "label": 0
                },
                {
                    "sent": "The second one, some more elaborate analysis, is needed to understand.",
                    "label": 0
                },
                {
                    "sent": "This document will be redirected that this will be a direction, and of course this should be done before indexing the document, so.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the problem.",
                    "label": 0
                },
                {
                    "sent": "And here we have even more complex example when.",
                    "label": 0
                },
                {
                    "sent": "We use the eval function of JavaScript, so the.",
                    "label": 0
                },
                {
                    "sent": "Window location.",
                    "label": 0
                },
                {
                    "sent": "Is constructed during the execution, so only dynamic analysis of this code could detect.",
                    "label": 0
                },
                {
                    "sent": "This kind of technique there are even more elaborated.",
                    "label": 0
                },
                {
                    "sent": "For example, combine.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Such a technique with encoding encoding scripts, for example, here we have an encoded name of.",
                    "label": 0
                },
                {
                    "sent": "Of instruction, so this is this drink encodes the possibly some JavaScript.",
                    "label": 0
                },
                {
                    "sent": "Instruction.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So from the search engine side there are few the countermeasures there are few.",
                    "label": 1
                },
                {
                    "sent": "Groups of activities first avoid this education so search engines publish their guidelines how to make documents to be not to be not treated as a spammer.",
                    "label": 0
                },
                {
                    "sent": "Second, the spam spam detection techniques and in the second part.",
                    "label": 1
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spam detection techniques will be.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Explain more in more detail.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And a few groups as we say.",
                    "label": 0
                },
                {
                    "sent": "So text based link based.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The language model based.",
                    "label": 0
                },
                {
                    "sent": "And also search engines maintain some blacklist.",
                    "label": 0
                },
                {
                    "sent": "So lists of such pictures hosts which are regarded as spam host and very recently machine learning approach was applied to D.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Webspam?",
                    "label": 0
                },
                {
                    "sent": "Also, many search engines maintain some spam reporting interface, so when a user sees that some document is a spam, they can report.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The document of course it could be used in adversarial wires, so it should be used with care.",
                    "label": 0
                },
                {
                    "sent": "Finally, punishment is a finite resource, so the search engine can exclude some document or host from indexing as a punishment for being.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For spamming and for researchers, this is very interesting.",
                    "label": 0
                },
                {
                    "sent": "Application of data mining and information retrieval.",
                    "label": 0
                },
                {
                    "sent": "So this is now very intensively studied.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Field.",
                    "label": 0
                },
                {
                    "sent": "Hope research.",
                    "label": 0
                },
                {
                    "sent": "Struggle between spammers and search engines gets harder because there are a lot of factors used to compute the ranking.",
                    "label": 1
                },
                {
                    "sent": "We just mentioned a few, but in fact in practice in search engines the formulas for computing the ranking could be quite complex.",
                    "label": 0
                },
                {
                    "sent": "And could include many factors and 2nd.",
                    "label": 0
                },
                {
                    "sent": "Is that it is a real arms race between?",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Plumbers in search engine so spammers can apply some new technique and then search engines could detect.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This technique can supply some countermeasures against this.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then spammers spammers realized that this technique is not not not successful at not any longer successful.",
                    "label": 0
                },
                {
                    "sent": "So spam.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Supply new deceptive technique and search engines detect this technique, improve the ranks and so on.",
                    "label": 1
                },
                {
                    "sent": "So this is kind of arms race and this two factors make.",
                    "label": 0
                },
                {
                    "sent": "Is this problem hard and this is?",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why recently machine learning approach was applied to help to fight and detect web spamming?",
                    "label": 1
                },
                {
                    "sent": "Because you should adapt very quickly to the changing techniques and conditions and the second part of the presentation will be devoted to.",
                    "label": 0
                },
                {
                    "sent": "To machine learning approach.",
                    "label": 0
                },
                {
                    "sent": "Two detecting web.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Spamming so.",
                    "label": 0
                },
                {
                    "sent": "Thank you for the first part of your questions.",
                    "label": 0
                },
                {
                    "sent": "Yes, I think it is better because the parts are different and quite long.",
                    "label": 0
                },
                {
                    "sent": "So maybe maybe just three short questions.",
                    "label": 0
                },
                {
                    "sent": "We will have also another partial question at the very end.",
                    "label": 0
                },
                {
                    "sent": "How difficult in general to detect a crawler from a regular user and if it's not so difficult, why didn't the search engines really try to harm their crawlers?",
                    "label": 0
                },
                {
                    "sent": "Very good question, so of course it works only if a crawler behaves.",
                    "label": 0
                },
                {
                    "sent": "In a proper way, so large search engines usually introduced themselves as being search engines.",
                    "label": 0
                },
                {
                    "sent": "But of course if it's if it pretends to be a browser, you cannot detect it.",
                    "label": 0
                },
                {
                    "sent": "So so this is.",
                    "label": 0
                },
                {
                    "sent": "I want to mention one other type of spam that I've seen all the time to go with language models from the web and I've stumbled across some strange combinations of words and that find that there are many pages that are automatic translations of of these types of.",
                    "label": 0
                },
                {
                    "sent": "So there are some pages in English and then translated into extensions in AltaVista.",
                    "label": 0
                },
                {
                    "sent": "And so you get messy stuff in there.",
                    "label": 0
                },
                {
                    "sent": "So the question is how to detect that this is a translation or.",
                    "label": 0
                },
                {
                    "sent": "Yeah, how can you?",
                    "label": 0
                },
                {
                    "sent": "R. Sorry so.",
                    "label": 0
                },
                {
                    "sent": "Oh, I don't understand the question.",
                    "label": 0
                },
                {
                    "sent": "Oh, OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "So can I respond to you in reaction to your previous answer about the browsers and the.",
                    "label": 0
                },
                {
                    "sent": "Crawlers can occur or really effectively masquerade as a user.",
                    "label": 0
                },
                {
                    "sent": "Would seem like it would have to make itself far too slow to be effective, if in fact you have a link farm with lots and lots of links on.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Very good question, I the problem is that we don't have enough time to explain how how colors work.",
                    "label": 0
                },
                {
                    "sent": "You cannot if you launch big crawler, you cannot just collect documents in a very high pace because you have to respect the you have to respect the resources of the of the host being called.",
                    "label": 0
                },
                {
                    "sent": "So in practice you make breaks between between requests.",
                    "label": 0
                },
                {
                    "sent": "Usually it is 1 second or five seconds, so you can easily make it long enough to.",
                    "label": 0
                },
                {
                    "sent": "To pretend browser in fact, maybe not easily, but it is possible, so it's not like crawler collects the whole host at the moment and then gets to another host, because because it would consume all the resources of the crowd host so.",
                    "label": 0
                },
                {
                    "sent": "Sort of adverse aerial learning problem because you know, I mean, if you're looking across a web link farm, you know if it's too regular, then it's probably yes, yes, exactly.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so This is why machine learning approach was recently applied to detecting web spam.",
                    "label": 0
                },
                {
                    "sent": "I think it's just the beginning of the story.",
                    "label": 0
                },
                {
                    "sent": "I think it is much to be done in this area and Carlos will say something about about machine learning approach in the next part.",
                    "label": 0
                },
                {
                    "sent": "OK, so I think there's a time for the second part.",
                    "label": 0
                }
            ]
        }
    }
}