{
    "id": "pu2x7jisj6fv4suahippdcfhxvujipvi",
    "title": "TELIX: An RDF-based Model for Linguistic Annotation",
    "info": {
        "author": [
            "Emilio Rubiera Azcona, CTIC Foundation"
        ],
        "published": "July 4, 2012",
        "recorded": "May 2012",
        "category": [
            "Top->Computer Science->Semantic Web->RDF - Resource Description Framework",
            "Top->Computer Science->Semantic Web",
            "Top->Computer Science->Computational Linguistics",
            "Top->Computer Science->Semantic Web->Annotation",
            "Top->Computer Science->Semantic Web->OWL - Web Ontology Language"
        ]
    },
    "url": "http://videolectures.net/eswc2012_rubiera_azcona_telix/",
    "segmentation": [
        [
            "What is this?",
            "Will will be the presentation for our paper about Alex a relic system?",
            "Vocabulary a model that provides a means to represent linguistic knowledge and also."
        ],
        [
            "So text annotations are RDF graphs.",
            "A with telix, is it possible to?",
            "To represent syntax trees, discourse units feature extra tours, even phonetic traits, or a number of different linguistic annotations.",
            "Eh, here you are.",
            "My outline of the presentation.",
            "I will start by."
        ],
        [
            "Giving a short background about linguistic and text annotations and justifying the use of RDF for represent them nowadays.",
            "Secondly, I will introduce Telix itself.",
            "Showing some some of the most representative features of telling a for the end.",
            "The third part will be a short use case.",
            "Not, not demo, but.",
            "Some screencaptures about about the other more we made with our DFA.",
            "And finally, I will put television context with comments on related work, San and the conclusions.",
            "1st."
        ],
        [
            "I will give you some tips about text annotations.",
            "Text annotations have been around for a long time.",
            "There's an example here.",
            "We have a code is Codex of the Middle Ages with some kind of annotations that amongst did around the text, we have two clear examples about.",
            "We have a word definition there and on the other hand we have here some kind of part of speech annotations.",
            "Because text where in Latin.",
            "In that age, almost death language as well.",
            "So Herman notes an almost really need needed to have some common understanding about texts.",
            "But but nowadays."
        ],
        [
            "Linguistics, linguistics are science have evolved alot.",
            "Ann we have.",
            "Those linguistic annotations made carried out by by automatic tools, specially from the natural language processing domain and all that we have.",
            "For instance, gate from the University of Sheffield or Free Link from the Universitat Politecnica de Catalunya and also another one like open open Calais from the function and Reuters.",
            "But there are still some problems to solve.",
            "In that sense, we need.",
            "Usually we have tools that are in charge of some specific layer of annotations, for instance, just for the syntax layer or the phonetic layer and all that.",
            "And there are an added problem for that, which is the interoperability problems between the different tools.",
            "For that we think that RDF is the most aidoneus."
        ],
        [
            "Choice to represent linguistic annotations a becausw first RDF allows us to integrate multiple annotation layers.",
            "We can have in our same.",
            "Text annotations about syntax, phonetics or whatever we can think.",
            "Also RDF.",
            "It allows us to have that annotations stored not in one given file, but elsewhere or anywhere in the in the web of that, a with the ability to give a name to graphs we have, we can retrieve and easily find information about about the about the those annotations, for instance.",
            "Also ur eyes make it possible to link linguistic resources.",
            "Across multiple RDF graphs, we can make a cross reference between all the all the.",
            "Annotations.",
            "Last but not least, we can counter with that to the web of data, of course.",
            "Here I wanted to show you 3."
        ],
        [
            "Three of the levels that Telix provides when when making those linguistic annotations as there are the resources, we can reduce easily other vocabularies that precede italics.",
            "For instance, we have reduced some Dublin core properties and classes for that.",
            "For instance to take charge of the.",
            "Corporate descriptions we have this type text or this type collections for that.",
            "Inspiring in laf.",
            "We reduced the segment.",
            "Which is a fragment of choice or in natural language production, not only in a text but also audio or whatever.",
            "And finally we have the level of text, not only the first one was for corpora second one, just for natural language in general, and we have here specific textual units to annotate text as well.",
            "Token war, sentence, paragraph, section.",
            "Here we have a."
        ],
        [
            "An example of segments as resources in this sentence, this factory produces superb maraging steel.",
            "We can use intellex.",
            "We can specify that there are two tokens interesting for US marriage.",
            "In the first one and still the second one.",
            "And we can.",
            "We can also annotate a sentence here and the sentence we will be using Telix sentence an the whole sentence.",
            "We can as well relate."
        ],
        [
            "Segments we can easily say.",
            "Say that one token precedes another one, or even that one contains another one.",
            "This is the case of margin is still here.",
            "And."
        ],
        [
            "Other optional a.",
            "Feature of Telix is that we can easily locate a given segment.",
            "This is not really necessary intelligence because we provide a specific Uri.",
            "Into fires for each one, but this would be also possible using that Alex offset property."
        ],
        [
            "And then a.",
            "Regarding words and sensors in RDF we have made here kind of interpersonal interpretation of the domain.",
            "For that we have used score score, score, score of vocabulary, especially for the level of concept of the idea.",
            "That level if we have that sentence, Bronze, an alloy of copper and tin, was the first allowed discovered.",
            "We have their alloy price.",
            "A for that we first of all to define what is an alloy.",
            "We use the score score.",
            "A concept for that concept is a long.",
            "It's not anchored in in a given language or in a given text.",
            "It's belongs to the world of ideas and then we have used the Discourse XL label to identify like Sam's Alex.",
            "It's related to one specific language, but again, it's it belongs as well to the world of ideas and is not used in it's not text dependent.",
            "And finally we have selected word occurrence as the decision to to to attack given terms in a text we have here.",
            "As you can see allow you wanan allow you to.",
            "For us work for us.",
            "Words belongs to both two language.",
            "Has it's anchored also in the language and also in the in the text.",
            "In this case we have here better explained our decision."
        ],
        [
            "Jerry, using this car for instance.",
            "The first we can say in this course correct that some resource, some literal is synonym of another one, so for that we reduced exelan our own properties for that.",
            "So we left scores Koreto concept we reduced.",
            "Scores XL label to use it for lexemes and finally we introduced some specific properties to capture the lexical relations like synonyms, homonyms, hipper names and all that we have here.",
            "An example.",
            "A re using again that sentence."
        ],
        [
            "Of the presentation we have here that we have two alloys.",
            "For us, for some people that would be only one word.",
            "For us is 2 words.",
            "Word occurrence in fact, and the way to relate.",
            "To attach meaning to both words, an occurrence is the property sense for that we have here and then we can use to disambiguate terms.",
            "We can use resources.",
            "External resources like DB pedia and all that.",
            "Another thing we can do with relics."
        ],
        [
            "Is the represent feature extra tools which are parvalux recursive structures that describe linguistic information we have here a simple, really simple example, but it's really illustrative because we can, we can translate more or less in a simply manner all the all the things described in the AVM representation.",
            "AVM stands for attribute value metrics and we have a noun.",
            "Anne.",
            "Yes, this is a linear translation using tactics of the alloy.",
            "More complex we can see here sentence."
        ],
        [
            "Sentence.",
            "An alloy is a metallic solid solution and this is as well AVM representation of that sentence and where they use numbers.",
            "Those are links to.",
            "To refer to the same things, but using techniques as your eyes are are the identifiers that would be just the same UI for that."
        ],
        [
            "Telix also provides annotation support annotations are they are refiled as RDF resource.",
            "We can describe or add metadata to those annotations.",
            "We can say who's the author of a given annotation, which is the source date, whatever.",
            "Also, they can be amalgamated in multilayer structures.",
            "We can we can have.",
            "The.",
            "Different authors annotating a given text, and we can easily retrieve them and identify who was the author for that.",
            "Annotations can also be a contradictory even in for the same author as we can.",
            "Here."
        ],
        [
            "This is the second part of the presentation we are presenting here.",
            "Use case that more or less using RDF A to illustrate the capabilities of talex.",
            "We have we have here a whole paragraph and using RDF ayant Alex."
        ],
        [
            "We can say that this is a span.",
            "We have a sentence and we can identify or tack which sentence it is."
        ],
        [
            "Here you have a more complex example with lots of tax.",
            "Here we have sentences, paragraphs, even position of their resources annotated.",
            "And this will.",
            "This can be watched more clearly in a browser here."
        ],
        [
            "Using a plugin for Firefox called RDF, a developer, we can hear those marks.",
            "This is exactly the same example here, but showed in a in a better way and we can.",
            "We can see there all the tokens, the offset of some of the things annotated in the text.",
            "And finally."
        ],
        [
            "Here are some some comments about related work.",
            "Concomitant toot Alex, I decided to split the related work in two groups.",
            "First, those which are annotation frameworks, and then the linguistic models.",
            "The first ones are.",
            "Station frameworks there are a number of them which are XX XML based, so they are different from telix.",
            "In that sense, we are exploiting the capabilities of RDF an.",
            "There is also some differences about what can you, what you can annotate using them.",
            "Some of them are more syntax focused, other more, lexical focused and finally the last one.",
            "And IF shares the same principles stellicks the exploits as well, RDF as the language preferred and they also have different underlying ontologies.",
            "Is the family of Olea ontologies here.",
            "The second group of related work is more link."
        ],
        [
            "Stick models here.",
            "All of them are available in all that Alex one.",
            "There are a couple of the two first goal and earlier really similar to Alex and even goal goes beyond of Telex adding some phonetic things that Alex still do.",
            "And then we have the lemon model as well, which is only focused on concept words and multi language.",
            "They they may they make a lot of effort to.",
            "To represent the multi language of the in that sense, but they don't use discussed Alex.",
            "For instance, we have worn.",
            "It's only focused on concept works as well.",
            "And finally we have polar here so stay tuned for the next presentation.",
            "That will be the one.",
            "A."
        ],
        [
            "The ongoing work we are doing.",
            "We are preparing a W3C member submission with Alex an.",
            "I've just signed up in the W 3C Group ontology lexica.",
            "I'm really new by there but I will try to contribute in that group with things learned with Alex.",
            "And we plan to extend techniques to capture other linguistic materialization's as well, especially their phonetics and the.",
            "Visual representation of glyphs and all that in the future.",
            "And my last words."
        ],
        [
            "Experience yourself telix.",
            "You can find the ontology there in that URL and you can find the full technical report including a lot of more.",
            "A lot of I mean the full things you can represent using tactics.",
            "Obviously in the paper we were not able to show all, but here you have the full technical report."
        ],
        [
            "That's all, thank you.",
            "Thanks for them for their presentation.",
            "So you mentioned in the NIV in the Ridge work which is studying as really similar.",
            "I'm not sure about which nice you're talking about, because then if 2.0 is pretty different from the previous version, it's now based on the SSO introduces structured sentence Ontology and I was really wondering what's the pro and cons.",
            "Going through your extension of scores Excel or going through simply the.",
            "Restricted sentence ontology 'cause they are different in terms of modeling.",
            "While the advantage I'm seeing is within.",
            "If you have a lot of tools that implement it now.",
            "So what's the stages of implementations you have and things like this we have?",
            "Unfortunately we can we we were not able to show you the implementation because of question of.",
            "Of privacy because some of the tools used were developed by IBM and they are really tough.",
            "Concerning copyrights and all that, that's really a problem, but we hope that in the next future we will be able to show telix induce with specific tools for that.",
            "And sorry for that.",
            "There are more questions.",
            "Let me ask.",
            "I was wondering and evaluation.",
            "You showed like an illustrative example.",
            "But did you think about or did you try to see one thing is how the users would react, how happy they are or.",
            "If they would compare to some alternative, or how well is it, I don't know.",
            "Did you have some like someone which is not you giving you?",
            "You mentioned something is preparatory, so how is we not yet really we we haven't thought about that for the moment.",
            "Yes, that's a good question, but not for the moment we have.",
            "I mean, we are aware that it's a difficult domain and also Texas abit complex for final users, but that would be a good idea for the future.",
            "A question about the use of our FA.",
            "How do you represent discontinuous segments?",
            "And do you that at all?",
            "I think it's not clear here, but.",
            "A. I don't know if you are familiar with our DFA, but it's really hard to to use all the tax for that, and it's not really easy to you really need lots of big code structures to take that, but.",
            "For instance, do you have any example or or there or can you see?",
            "In English, there's something that's called preposition stranding.",
            "That's nothing I have ever dealt with with that.",
            "This is 1 preposition, but it's distributed across the whole sentence.",
            "And you mean how to represent that using RDF A?",
            "That's a good.",
            "I'm not sure of that.",
            "I'm not really sure this was just an example.",
            "We are not planning to use our DFA for that, but that was used just for the mean for the sake of illustration here.",
            "But that's a good point to represent different things.",
            "But could you just sit down and I'll take both parts and appointed the same you arrive?",
            "Yes, probably this is.",
            "I think it's for sure fishable, but yes, we need to have a thought about that.",
            "Speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is this?",
                    "label": 0
                },
                {
                    "sent": "Will will be the presentation for our paper about Alex a relic system?",
                    "label": 0
                },
                {
                    "sent": "Vocabulary a model that provides a means to represent linguistic knowledge and also.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So text annotations are RDF graphs.",
                    "label": 1
                },
                {
                    "sent": "A with telix, is it possible to?",
                    "label": 0
                },
                {
                    "sent": "To represent syntax trees, discourse units feature extra tours, even phonetic traits, or a number of different linguistic annotations.",
                    "label": 0
                },
                {
                    "sent": "Eh, here you are.",
                    "label": 0
                },
                {
                    "sent": "My outline of the presentation.",
                    "label": 0
                },
                {
                    "sent": "I will start by.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Giving a short background about linguistic and text annotations and justifying the use of RDF for represent them nowadays.",
                    "label": 0
                },
                {
                    "sent": "Secondly, I will introduce Telix itself.",
                    "label": 0
                },
                {
                    "sent": "Showing some some of the most representative features of telling a for the end.",
                    "label": 0
                },
                {
                    "sent": "The third part will be a short use case.",
                    "label": 0
                },
                {
                    "sent": "Not, not demo, but.",
                    "label": 0
                },
                {
                    "sent": "Some screencaptures about about the other more we made with our DFA.",
                    "label": 0
                },
                {
                    "sent": "And finally, I will put television context with comments on related work, San and the conclusions.",
                    "label": 0
                },
                {
                    "sent": "1st.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I will give you some tips about text annotations.",
                    "label": 1
                },
                {
                    "sent": "Text annotations have been around for a long time.",
                    "label": 0
                },
                {
                    "sent": "There's an example here.",
                    "label": 0
                },
                {
                    "sent": "We have a code is Codex of the Middle Ages with some kind of annotations that amongst did around the text, we have two clear examples about.",
                    "label": 1
                },
                {
                    "sent": "We have a word definition there and on the other hand we have here some kind of part of speech annotations.",
                    "label": 0
                },
                {
                    "sent": "Because text where in Latin.",
                    "label": 0
                },
                {
                    "sent": "In that age, almost death language as well.",
                    "label": 0
                },
                {
                    "sent": "So Herman notes an almost really need needed to have some common understanding about texts.",
                    "label": 0
                },
                {
                    "sent": "But but nowadays.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Linguistics, linguistics are science have evolved alot.",
                    "label": 0
                },
                {
                    "sent": "Ann we have.",
                    "label": 0
                },
                {
                    "sent": "Those linguistic annotations made carried out by by automatic tools, specially from the natural language processing domain and all that we have.",
                    "label": 0
                },
                {
                    "sent": "For instance, gate from the University of Sheffield or Free Link from the Universitat Politecnica de Catalunya and also another one like open open Calais from the function and Reuters.",
                    "label": 0
                },
                {
                    "sent": "But there are still some problems to solve.",
                    "label": 1
                },
                {
                    "sent": "In that sense, we need.",
                    "label": 0
                },
                {
                    "sent": "Usually we have tools that are in charge of some specific layer of annotations, for instance, just for the syntax layer or the phonetic layer and all that.",
                    "label": 0
                },
                {
                    "sent": "And there are an added problem for that, which is the interoperability problems between the different tools.",
                    "label": 0
                },
                {
                    "sent": "For that we think that RDF is the most aidoneus.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Choice to represent linguistic annotations a becausw first RDF allows us to integrate multiple annotation layers.",
                    "label": 0
                },
                {
                    "sent": "We can have in our same.",
                    "label": 0
                },
                {
                    "sent": "Text annotations about syntax, phonetics or whatever we can think.",
                    "label": 0
                },
                {
                    "sent": "Also RDF.",
                    "label": 0
                },
                {
                    "sent": "It allows us to have that annotations stored not in one given file, but elsewhere or anywhere in the in the web of that, a with the ability to give a name to graphs we have, we can retrieve and easily find information about about the about the those annotations, for instance.",
                    "label": 0
                },
                {
                    "sent": "Also ur eyes make it possible to link linguistic resources.",
                    "label": 1
                },
                {
                    "sent": "Across multiple RDF graphs, we can make a cross reference between all the all the.",
                    "label": 0
                },
                {
                    "sent": "Annotations.",
                    "label": 0
                },
                {
                    "sent": "Last but not least, we can counter with that to the web of data, of course.",
                    "label": 0
                },
                {
                    "sent": "Here I wanted to show you 3.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Three of the levels that Telix provides when when making those linguistic annotations as there are the resources, we can reduce easily other vocabularies that precede italics.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have reduced some Dublin core properties and classes for that.",
                    "label": 0
                },
                {
                    "sent": "For instance to take charge of the.",
                    "label": 0
                },
                {
                    "sent": "Corporate descriptions we have this type text or this type collections for that.",
                    "label": 0
                },
                {
                    "sent": "Inspiring in laf.",
                    "label": 0
                },
                {
                    "sent": "We reduced the segment.",
                    "label": 0
                },
                {
                    "sent": "Which is a fragment of choice or in natural language production, not only in a text but also audio or whatever.",
                    "label": 1
                },
                {
                    "sent": "And finally we have the level of text, not only the first one was for corpora second one, just for natural language in general, and we have here specific textual units to annotate text as well.",
                    "label": 1
                },
                {
                    "sent": "Token war, sentence, paragraph, section.",
                    "label": 0
                },
                {
                    "sent": "Here we have a.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An example of segments as resources in this sentence, this factory produces superb maraging steel.",
                    "label": 1
                },
                {
                    "sent": "We can use intellex.",
                    "label": 0
                },
                {
                    "sent": "We can specify that there are two tokens interesting for US marriage.",
                    "label": 0
                },
                {
                    "sent": "In the first one and still the second one.",
                    "label": 0
                },
                {
                    "sent": "And we can.",
                    "label": 0
                },
                {
                    "sent": "We can also annotate a sentence here and the sentence we will be using Telix sentence an the whole sentence.",
                    "label": 0
                },
                {
                    "sent": "We can as well relate.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Segments we can easily say.",
                    "label": 0
                },
                {
                    "sent": "Say that one token precedes another one, or even that one contains another one.",
                    "label": 0
                },
                {
                    "sent": "This is the case of margin is still here.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other optional a.",
                    "label": 0
                },
                {
                    "sent": "Feature of Telix is that we can easily locate a given segment.",
                    "label": 0
                },
                {
                    "sent": "This is not really necessary intelligence because we provide a specific Uri.",
                    "label": 0
                },
                {
                    "sent": "Into fires for each one, but this would be also possible using that Alex offset property.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then a.",
                    "label": 0
                },
                {
                    "sent": "Regarding words and sensors in RDF we have made here kind of interpersonal interpretation of the domain.",
                    "label": 0
                },
                {
                    "sent": "For that we have used score score, score, score of vocabulary, especially for the level of concept of the idea.",
                    "label": 0
                },
                {
                    "sent": "That level if we have that sentence, Bronze, an alloy of copper and tin, was the first allowed discovered.",
                    "label": 1
                },
                {
                    "sent": "We have their alloy price.",
                    "label": 0
                },
                {
                    "sent": "A for that we first of all to define what is an alloy.",
                    "label": 0
                },
                {
                    "sent": "We use the score score.",
                    "label": 0
                },
                {
                    "sent": "A concept for that concept is a long.",
                    "label": 0
                },
                {
                    "sent": "It's not anchored in in a given language or in a given text.",
                    "label": 0
                },
                {
                    "sent": "It's belongs to the world of ideas and then we have used the Discourse XL label to identify like Sam's Alex.",
                    "label": 0
                },
                {
                    "sent": "It's related to one specific language, but again, it's it belongs as well to the world of ideas and is not used in it's not text dependent.",
                    "label": 0
                },
                {
                    "sent": "And finally we have selected word occurrence as the decision to to to attack given terms in a text we have here.",
                    "label": 0
                },
                {
                    "sent": "As you can see allow you wanan allow you to.",
                    "label": 0
                },
                {
                    "sent": "For us work for us.",
                    "label": 0
                },
                {
                    "sent": "Words belongs to both two language.",
                    "label": 0
                },
                {
                    "sent": "Has it's anchored also in the language and also in the in the text.",
                    "label": 0
                },
                {
                    "sent": "In this case we have here better explained our decision.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Jerry, using this car for instance.",
                    "label": 0
                },
                {
                    "sent": "The first we can say in this course correct that some resource, some literal is synonym of another one, so for that we reduced exelan our own properties for that.",
                    "label": 0
                },
                {
                    "sent": "So we left scores Koreto concept we reduced.",
                    "label": 0
                },
                {
                    "sent": "Scores XL label to use it for lexemes and finally we introduced some specific properties to capture the lexical relations like synonyms, homonyms, hipper names and all that we have here.",
                    "label": 1
                },
                {
                    "sent": "An example.",
                    "label": 0
                },
                {
                    "sent": "A re using again that sentence.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of the presentation we have here that we have two alloys.",
                    "label": 0
                },
                {
                    "sent": "For us, for some people that would be only one word.",
                    "label": 0
                },
                {
                    "sent": "For us is 2 words.",
                    "label": 0
                },
                {
                    "sent": "Word occurrence in fact, and the way to relate.",
                    "label": 0
                },
                {
                    "sent": "To attach meaning to both words, an occurrence is the property sense for that we have here and then we can use to disambiguate terms.",
                    "label": 0
                },
                {
                    "sent": "We can use resources.",
                    "label": 0
                },
                {
                    "sent": "External resources like DB pedia and all that.",
                    "label": 0
                },
                {
                    "sent": "Another thing we can do with relics.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is the represent feature extra tools which are parvalux recursive structures that describe linguistic information we have here a simple, really simple example, but it's really illustrative because we can, we can translate more or less in a simply manner all the all the things described in the AVM representation.",
                    "label": 1
                },
                {
                    "sent": "AVM stands for attribute value metrics and we have a noun.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is a linear translation using tactics of the alloy.",
                    "label": 0
                },
                {
                    "sent": "More complex we can see here sentence.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sentence.",
                    "label": 0
                },
                {
                    "sent": "An alloy is a metallic solid solution and this is as well AVM representation of that sentence and where they use numbers.",
                    "label": 0
                },
                {
                    "sent": "Those are links to.",
                    "label": 0
                },
                {
                    "sent": "To refer to the same things, but using techniques as your eyes are are the identifiers that would be just the same UI for that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Telix also provides annotation support annotations are they are refiled as RDF resource.",
                    "label": 1
                },
                {
                    "sent": "We can describe or add metadata to those annotations.",
                    "label": 0
                },
                {
                    "sent": "We can say who's the author of a given annotation, which is the source date, whatever.",
                    "label": 1
                },
                {
                    "sent": "Also, they can be amalgamated in multilayer structures.",
                    "label": 0
                },
                {
                    "sent": "We can we can have.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 1
                },
                {
                    "sent": "Different authors annotating a given text, and we can easily retrieve them and identify who was the author for that.",
                    "label": 0
                },
                {
                    "sent": "Annotations can also be a contradictory even in for the same author as we can.",
                    "label": 0
                },
                {
                    "sent": "Here.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the second part of the presentation we are presenting here.",
                    "label": 0
                },
                {
                    "sent": "Use case that more or less using RDF A to illustrate the capabilities of talex.",
                    "label": 0
                },
                {
                    "sent": "We have we have here a whole paragraph and using RDF ayant Alex.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can say that this is a span.",
                    "label": 0
                },
                {
                    "sent": "We have a sentence and we can identify or tack which sentence it is.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here you have a more complex example with lots of tax.",
                    "label": 1
                },
                {
                    "sent": "Here we have sentences, paragraphs, even position of their resources annotated.",
                    "label": 0
                },
                {
                    "sent": "And this will.",
                    "label": 0
                },
                {
                    "sent": "This can be watched more clearly in a browser here.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using a plugin for Firefox called RDF, a developer, we can hear those marks.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the same example here, but showed in a in a better way and we can.",
                    "label": 0
                },
                {
                    "sent": "We can see there all the tokens, the offset of some of the things annotated in the text.",
                    "label": 0
                },
                {
                    "sent": "And finally.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here are some some comments about related work.",
                    "label": 1
                },
                {
                    "sent": "Concomitant toot Alex, I decided to split the related work in two groups.",
                    "label": 1
                },
                {
                    "sent": "First, those which are annotation frameworks, and then the linguistic models.",
                    "label": 0
                },
                {
                    "sent": "The first ones are.",
                    "label": 0
                },
                {
                    "sent": "Station frameworks there are a number of them which are XX XML based, so they are different from telix.",
                    "label": 0
                },
                {
                    "sent": "In that sense, we are exploiting the capabilities of RDF an.",
                    "label": 0
                },
                {
                    "sent": "There is also some differences about what can you, what you can annotate using them.",
                    "label": 0
                },
                {
                    "sent": "Some of them are more syntax focused, other more, lexical focused and finally the last one.",
                    "label": 0
                },
                {
                    "sent": "And IF shares the same principles stellicks the exploits as well, RDF as the language preferred and they also have different underlying ontologies.",
                    "label": 1
                },
                {
                    "sent": "Is the family of Olea ontologies here.",
                    "label": 0
                },
                {
                    "sent": "The second group of related work is more link.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stick models here.",
                    "label": 0
                },
                {
                    "sent": "All of them are available in all that Alex one.",
                    "label": 1
                },
                {
                    "sent": "There are a couple of the two first goal and earlier really similar to Alex and even goal goes beyond of Telex adding some phonetic things that Alex still do.",
                    "label": 1
                },
                {
                    "sent": "And then we have the lemon model as well, which is only focused on concept words and multi language.",
                    "label": 0
                },
                {
                    "sent": "They they may they make a lot of effort to.",
                    "label": 0
                },
                {
                    "sent": "To represent the multi language of the in that sense, but they don't use discussed Alex.",
                    "label": 0
                },
                {
                    "sent": "For instance, we have worn.",
                    "label": 1
                },
                {
                    "sent": "It's only focused on concept works as well.",
                    "label": 0
                },
                {
                    "sent": "And finally we have polar here so stay tuned for the next presentation.",
                    "label": 1
                },
                {
                    "sent": "That will be the one.",
                    "label": 0
                },
                {
                    "sent": "A.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The ongoing work we are doing.",
                    "label": 0
                },
                {
                    "sent": "We are preparing a W3C member submission with Alex an.",
                    "label": 0
                },
                {
                    "sent": "I've just signed up in the W 3C Group ontology lexica.",
                    "label": 1
                },
                {
                    "sent": "I'm really new by there but I will try to contribute in that group with things learned with Alex.",
                    "label": 0
                },
                {
                    "sent": "And we plan to extend techniques to capture other linguistic materialization's as well, especially their phonetics and the.",
                    "label": 1
                },
                {
                    "sent": "Visual representation of glyphs and all that in the future.",
                    "label": 0
                },
                {
                    "sent": "And my last words.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Experience yourself telix.",
                    "label": 0
                },
                {
                    "sent": "You can find the ontology there in that URL and you can find the full technical report including a lot of more.",
                    "label": 0
                },
                {
                    "sent": "A lot of I mean the full things you can represent using tactics.",
                    "label": 0
                },
                {
                    "sent": "Obviously in the paper we were not able to show all, but here you have the full technical report.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's all, thank you.",
                    "label": 0
                },
                {
                    "sent": "Thanks for them for their presentation.",
                    "label": 0
                },
                {
                    "sent": "So you mentioned in the NIV in the Ridge work which is studying as really similar.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure about which nice you're talking about, because then if 2.0 is pretty different from the previous version, it's now based on the SSO introduces structured sentence Ontology and I was really wondering what's the pro and cons.",
                    "label": 0
                },
                {
                    "sent": "Going through your extension of scores Excel or going through simply the.",
                    "label": 0
                },
                {
                    "sent": "Restricted sentence ontology 'cause they are different in terms of modeling.",
                    "label": 0
                },
                {
                    "sent": "While the advantage I'm seeing is within.",
                    "label": 0
                },
                {
                    "sent": "If you have a lot of tools that implement it now.",
                    "label": 0
                },
                {
                    "sent": "So what's the stages of implementations you have and things like this we have?",
                    "label": 0
                },
                {
                    "sent": "Unfortunately we can we we were not able to show you the implementation because of question of.",
                    "label": 0
                },
                {
                    "sent": "Of privacy because some of the tools used were developed by IBM and they are really tough.",
                    "label": 0
                },
                {
                    "sent": "Concerning copyrights and all that, that's really a problem, but we hope that in the next future we will be able to show telix induce with specific tools for that.",
                    "label": 0
                },
                {
                    "sent": "And sorry for that.",
                    "label": 0
                },
                {
                    "sent": "There are more questions.",
                    "label": 0
                },
                {
                    "sent": "Let me ask.",
                    "label": 0
                },
                {
                    "sent": "I was wondering and evaluation.",
                    "label": 0
                },
                {
                    "sent": "You showed like an illustrative example.",
                    "label": 0
                },
                {
                    "sent": "But did you think about or did you try to see one thing is how the users would react, how happy they are or.",
                    "label": 0
                },
                {
                    "sent": "If they would compare to some alternative, or how well is it, I don't know.",
                    "label": 0
                },
                {
                    "sent": "Did you have some like someone which is not you giving you?",
                    "label": 0
                },
                {
                    "sent": "You mentioned something is preparatory, so how is we not yet really we we haven't thought about that for the moment.",
                    "label": 0
                },
                {
                    "sent": "Yes, that's a good question, but not for the moment we have.",
                    "label": 0
                },
                {
                    "sent": "I mean, we are aware that it's a difficult domain and also Texas abit complex for final users, but that would be a good idea for the future.",
                    "label": 0
                },
                {
                    "sent": "A question about the use of our FA.",
                    "label": 0
                },
                {
                    "sent": "How do you represent discontinuous segments?",
                    "label": 0
                },
                {
                    "sent": "And do you that at all?",
                    "label": 0
                },
                {
                    "sent": "I think it's not clear here, but.",
                    "label": 0
                },
                {
                    "sent": "A. I don't know if you are familiar with our DFA, but it's really hard to to use all the tax for that, and it's not really easy to you really need lots of big code structures to take that, but.",
                    "label": 0
                },
                {
                    "sent": "For instance, do you have any example or or there or can you see?",
                    "label": 0
                },
                {
                    "sent": "In English, there's something that's called preposition stranding.",
                    "label": 0
                },
                {
                    "sent": "That's nothing I have ever dealt with with that.",
                    "label": 0
                },
                {
                    "sent": "This is 1 preposition, but it's distributed across the whole sentence.",
                    "label": 0
                },
                {
                    "sent": "And you mean how to represent that using RDF A?",
                    "label": 0
                },
                {
                    "sent": "That's a good.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure of that.",
                    "label": 0
                },
                {
                    "sent": "I'm not really sure this was just an example.",
                    "label": 0
                },
                {
                    "sent": "We are not planning to use our DFA for that, but that was used just for the mean for the sake of illustration here.",
                    "label": 0
                },
                {
                    "sent": "But that's a good point to represent different things.",
                    "label": 0
                },
                {
                    "sent": "But could you just sit down and I'll take both parts and appointed the same you arrive?",
                    "label": 0
                },
                {
                    "sent": "Yes, probably this is.",
                    "label": 0
                },
                {
                    "sent": "I think it's for sure fishable, but yes, we need to have a thought about that.",
                    "label": 0
                },
                {
                    "sent": "Speaker again.",
                    "label": 0
                }
            ]
        }
    }
}