{
    "id": "q7du5umwwokbb6z7x3exc3mhgconaefu",
    "title": "The Pirated \"I\" or How Privacy Can't Exist on a Lawless Semantic Web",
    "info": {
        "author": [
            "Abraham B. Hsuan, Irwin & Hsuan LLP"
        ],
        "introducer": [
            "Marko Grobelnik, Artificial Intelligence Laboratory, Jožef Stefan Institute"
        ],
        "published": "July 7, 2011",
        "recorded": "June 2011",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2011_hsuan_privacy/",
    "segmentation": [
        [
            "So you are.",
            "Having now the last invited talks, so we'll conclude, conclude the spectrum of topics for invited talks for this conference with.",
            "Legal area, so we started with like.",
            "Proper semantic web talk by Jim that we continued with social media, so with Facebook.",
            "We continued with HCI, so it's another video toggle topic, then startup technology.",
            "How startup is being built out of this technology.",
            "Then today in the morning we heard the talk on scale large scale analytics.",
            "Network analysis and so on and so.",
            "At the end, we'll have the talk from the legal side, so this is always very challenging.",
            "So how to make first know how to make a?",
            "How do we find the speaker which would talk on legal issues in a fun way?",
            "And still be informative.",
            "So for this purpose I think ape.",
            "So on is the right person.",
            "A pass, well, pretty long history in on both sides.",
            "I would say on the site as him being a lawyer, New York and also being intrapreneur in Itworks so he has a couple of startups.",
            "04 Last 1015 years, right.",
            "And so he's really experienced in most of the aspects one would want to be talking.",
            "Being kind of both sides so legal and technological.",
            "So this talk.",
            "This talk is.",
            "As you see, the title is the pirated I or how privacy can't exist on Alola Semantica so.",
            "A couple of very interesting thoughts.",
            "Disease, which April.",
            "Give us and I guess this type of talk is very good also for open discussion.",
            "Maybe if during apes talk everybody has anybody has any comments of this?",
            "Interrupts with a comment.",
            "A please, OK thank you Marco.",
            "Thank you for inviting me to here to speak.",
            "Privacy very hot topic these days.",
            "Just examples of."
        ],
        [
            "Some of the head."
        ],
        [
            "Lines have been hitting to."
        ],
        [
            "Where is Justin?"
        ],
        [
            "It's two months, right?",
            "Everybody's heard about the Sony issues to Apple issues, location tracking Congress in the United States has been asking Apple all the different parties to come and appear before it to attend hearings.",
            "And, you know, get ready now for a whole lot of legislation."
        ],
        [
            "Just to come in reaction to it, it's not just."
        ],
        [
            "In legislation in and US that in the EU as well, this past week, according to the Directive, 27 countries should have passed a lot of transposed the directive into law about cookies.",
            "And of course, every time there is a breach."
        ],
        [
            "Are lawsuits many many lawsuit."
        ],
        [
            "Lot of debate as to what could work and what can't work and there's just."
        ],
        [
            "Great deal of posturing and talk.",
            "So what is it all about?",
            "This talk."
        ],
        [
            "Is going to take a fairly general view about privacy and the reason why it's going to take a general viewing parties because privacy is a very amorphis.",
            "Concept is slippery every time you talk about privacy you know you mean.",
            "On one hand, you're right to control and store information about yourself and to share that information based on your own willingness to share it.",
            "And you know there's that economic properties, sense of privacy.",
            "That's usually where people begin, but immediately to visceral feelings come out when you start talking about surveillance and trespass, and whether or not somebody has a right to actually take your information from you, with or without your knowing.",
            "And so there is a privacy.",
            "There's a trespass aspect of privacy.",
            "And then there's also this idea that privacy is about your ability to make choices in your own.",
            "Safety of knowing that if you make the choice, there won't be somebody who is going to catch you later.",
            "Who is going to call you out?",
            "Who is going to improperly influence you?",
            "Who's going to use that information?",
            "Right, and so privacy is also about the freedom, you know, an individual freedom, and because it's so slippery, it's very difficult to discuss.",
            "And with each one of these ways of looking about their privacy, there's also kind of a counter interest that is at play.",
            "So when you talk about an economic property, right, you have to also talk about the fact that much of this world's media these days is supported by advertising.",
            "And is there an interest in free media to be supported?",
            "And dude, are you making a trade for that?",
            "You know?",
            "What about the cloud?",
            "But what about the fact that the cloud is a much more economically viable alternative to everybody buying their own infrastructure?",
            "And what about the security costs?",
            "Are people actually paying the money you know to to secure the data that you've shared with them and you have to talk about in cases of trespass, civil defense, law enforcement?",
            "Terrorism is clearly something that every nation is worried about.",
            "And they want to be able to monitor things.",
            "You have to talk about.",
            "In the case of freedom of choice that you know your ability to buy things is usually going to in some way be protected by DRM and DRM usually intersects with privacy issues because there's some personal ID associated with, you know, a digital rights management and you want to talk about open government and to what extent is somebody who is a public figure you know deserving of privacy at the same level.",
            "Somebody who's not.",
            "So it's it's.",
            "Horrible."
        ],
        [
            "You end up with this cognitive dissonance constantly.",
            "You know when you're talking about the issue of privacy in the United States.",
            "Most discussions about privacy begin with these words.",
            "And they recognize that recent inventions and business methods do affect.",
            "How we perceive our ability to be protected as a person right?",
            "And that really at the end of the day.",
            "Maybe it's just about a right to be, let alone.",
            "While these words are written."
        ],
        [
            "1890 in response to the invention of the Snapshot camera.",
            "The snapshot camera.",
            "Introduced to the general population, ability to take photos of people in public."
        ],
        [
            "Right, and if you actually look at sort of how this concept, which was authored in 1990 by Brandeis and Warren, you know sort of grew up over the course of the last century, you start seeing using the Google Ngram Viewer, which is a wonderful tool, and if you search for the unigrams privacy and secrecy secrecy being a very similar concept, and you compare that to you, find that privacy, which is the blue line sort of spikes up over that over the course of the century."
        ],
        [
            "Alright, and if you actually match it to the technologies that were introduced, it matches pretty well in terms of how the awareness or the concerns or discussion discourse about privacy started growing.",
            "As each of these subsequent inventions started making its way into the commercial realm.",
            "So with the invention of the camera back in 1890, you know the modern concept of privacy was invented.",
            "You know, then you have to telephone the mainframe computers which led to database marketing.",
            "The personal PC computer.",
            "Obviously the mobile phone, the web and in fact surveillance cameras on every street posting these days so."
        ],
        [
            "So.",
            "Now, what Brandeis and Warren recognized was, it wasn't just the technology, right?",
            "There's also a pairing with a business method.",
            "And in the case of the Snapshot camera, the business method was the newspaper industry.",
            "Now newspapers ever since to the invention of printing presses second handle the kind of mass printing that would lead to a newspaper industry.",
            "You know, it was 50 years or so when the camera was invented.",
            "In eighteen 1550 years or so that Denise papers have been around, but it was only in 1880s that newspapers and cameras intersected in 1880.",
            "The idea of a halftone, the ability to actually publish a photograph.",
            "In a newspaper was invented.",
            "Right and so over the course of the 10 years subsequent and once the snapshot cameras event in 1888, suddenly newspapers became the transmission medium for the privacy invasion that the camera could capture, right?",
            "And so it was.",
            "It was Brandeis and Warren.",
            "I think that was really the first to recognize that it wasn't just the technology, it wasn't just that the actual activity, it was the fact that.",
            "What used to be something that was very local?",
            "You know something that was only known by a few neighbors could suddenly be called from the housetops.",
            "As they say, proclaimed from the Housetops.",
            "What was known by only a few people in the 1880s by the 1900s might be known by millions of people.",
            "And you see on the right here, that's the number of daily newspapers that grew over the course of that period of time."
        ],
        [
            "It's worth noting as aside, just to put it further in context, when the camera was invented.",
            "Yeah, there was this belief that was a magical box that could steal a soul.",
            "And even as late as 1920, you know James Fraser, who wrote probably the definitive book, still are magic and religion commented that in many places in Europe people still felt this was the case.",
            "I think it's important to note that because a lot of what?"
        ],
        [
            "A lot of what law is about is adjusting to ideas and understandings of society about some things.",
            "So here's a here's a story about a dog and what's relevant about the dog is.",
            "This dog was brought by its owner onto the Seoul Metropolitan Transit Subway system and while on one ride the dog decided to his business on the floor of the subway train.",
            "The woman was very embarrassed.",
            "One of the bystanders gave her a tissue she preceded to use the tissue to clean up the dog, but not clean up the mess.",
            "Now this enraged people on the train people started telling her you need to clean up this mess.",
            "This is your responsibility.",
            "She.",
            "Fairly embarrassed by the situation, kept talking to her dog, saying things like what's wrong.",
            "You've not done this before.",
            "An at the next stop."
        ],
        [
            "She got off.",
            "Now, one of the people on that train on that subway train had a camera, so she took the camera out and started taking these photos.",
            "And.",
            "Once the people got together after she left and somebody actually did clean up the mess, she decided to take it upon herself to go and publish those photos.",
            "In a local soul website.",
            "An write up her experience, probably only a personal blog to the few people that she wanted to share this.",
            "This this experience with.",
            "Well within a few days.",
            "The picture became the most searched photo on a local search portals.",
            "From there, it grew into more and more of a.",
            "Controversy online.",
            "So."
        ],
        [
            "That by the time.",
            "Within a few while she started being called a name online, referred to as Dog Poop Girl.",
            "People online decided that the social networks were replaced to punish this woman, so some of the people crowdsourced her identity.",
            "Publish your personal information on.",
            "And found out that she was associated with the University.",
            "The university's website actually crashed because it started receiving millions of emails from concerned citizens telling that University that if she were a student there, she should be expelled.",
            "The University publishes statement saying no, no no, no no.",
            "She's no longer a student here.",
            "Right and completely dissociate themselves with her.",
            "What followed on top of that was false, reports false reports that she was expelled by University false reports that she had dropped out false reports that that she had in some ways not even been a University student in there for of the kind of character and personality would allow something like this to happen, right?",
            "Her family got identified and her family started receiving online threats and emails.",
            "Now, in the meantime, backlash happened.",
            "Some people said hey, she was in public transit.",
            "She has no right of privacy here.",
            "Other people, on the other hand, said no, this is vigilanteism.",
            "Words like Cyber Posse started being used.",
            "People talk about the Internet witch hunt.",
            "And there became a debate over whether or not it was acceptable, appropriate for Miss Kim, which I.",
            "Noted a second go is in quotation marks because it's a screen name.",
            "Should have actually published photos.",
            "Maybe blocking her face out.",
            "Given her some privacy, respect right?",
            "There were other people who said no, no, no, no, no, you know, it's OK to publish the pictures, but it was, uh, not OK to identifier and publish a personal information."
        ],
        [
            "This was probably the verdict that ended up being the prevailing verdict, which is.",
            "And then people's minds.",
            "It didn't matter whether she was in a subway car with only a dozen people.",
            "Or she was known to have done this by only 100 people.",
            "Or whether she was in front of a million people.",
            "And if you're interested in reading more about this, Daniel Salo was a wonderful legal theorist in the area as written a wonderful narrative, and he was actually involved in some of those bloggings."
        ],
        [
            "Now, what's absolutely incredible.",
            "And worth noting here from my point of view, is.",
            "This is about technology, right?",
            "This is about the fact that at the time this happened, which was about 2005 I believe.",
            "You know this became.",
            "Taken from something that was a private sharing on a personal blog.",
            "Viewed by 100 people maybe.",
            "Thank you, Rodney.",
            "Actually says that on average blogs are read by only six people.",
            "So let's assume 100 for arguments sake.",
            "It's suddenly bad picked up by those through some sort of viral activity and got seen by 10,000 people, by which point social networks started crowdsourcing our identity.",
            "The South Korean mainstream press picked up on it because it was no longer a story about a dog.",
            "Having done is Doo Doo on the subway.",
            "It was about Internet vigilanteism and whether or not the social net was a proper place to Kangaroo court an individual and then it got picked up by millions of people.",
            "A Korean American who knew about this decided to block on his blog in the US about it.",
            "It got picked up by Boy boy.",
            "With 7 million uniques.",
            "At which point the Washington Post decided it was news.",
            "And published it there.",
            "And all of a sudden you're talking about 10s of millions of people.",
            "We know this story.",
            "And all the people who are involved other than this woman.",
            "Were known by their screen names.",
            "Miss Kim.",
            "The previous comment are anonymous.",
            "It's very interesting that in some ways you know what is happening.",
            "Here is the technology that we are talking about here and how his intersect with privacy is histotechnology.",
            "It's an invention of social networks is the invention of social media and the business model to use the Warren and Brandeis framework is this crowd sourcing."
        ],
        [
            "So here's what she wrote.",
            "I'm not going to read the whole thing."
        ],
        [
            "The relevant portion in my mind is this.",
            "When she felt helpless.",
            "To stop this, she invoked the law.",
            "She said if you keep putting me down on the Internet, I'll Sue all the people."
        ],
        [
            "It's a very this girl feeling this sense of powerlessness.",
            "It's what drives us normally to invoke the law.",
            "People say I will Sue you because they're angry and they feel like there's no other recourse that they could turn to.",
            "Alright, so it's not hard when you start seeing it from her point of view how this could happen to any of us on a bad day.",
            "And so as a as a.",
            "As a story about privacy introduced some of the concepts of privacy.",
            "It actually is archetypal because just so many other examples that are similar to this in the US, Their business is suing customers who write bad reviews on Yelp about their businesses.",
            "They are actually suffering economic loss when those customers right to bad reviews.",
            "Right there are.",
            "You know Facebook is being used as evidence in 2/3 of the divorce cases.",
            "According to a study by the matrimonial lawyers.",
            "Loyola University actually did a study, and they attribute one out of five divorces.",
            "To Facebook now.",
            "So the.",
            "It's it's social media has really had an effect.",
            "And it's translated often into legal proceedings."
        ],
        [
            "But the problem is, the law is not always as sympathetic, so would like it to be.",
            "Idea of a right of privacy is pretty clear, right?",
            "And this is from the United Nations, adopted by the General Assembly in the mid part of last century.",
            "And it says very clearly we should be protected against.",
            "Interference in attacks."
        ],
        [
            "But the operative word here is the word arbitrary.",
            "Write an arbitrary is defined by soul silence.",
            "Is defined by."
        ],
        [
            "I you know, what is it?",
            "That we as a as a society believe.",
            "Is not arbitrary, right?",
            "What is it that if you look at the legal definition of arbitrary, it's not based on reason or judgment?",
            "It's with regard without regard to rules or standards is founded on prejudice.",
            "Right, it's anonymous, possibly with tyranny."
        ],
        [
            "Law generally.",
            "Happens in 2 paces, right?",
            "There's the kneejerk pace that happens immediately anytime there's a new technology.",
            "There's a sudden rush of new laws to try to protect against the harm to injury, to change that's happening, right?",
            "The boundaries that get broken down by whatever this new technology is.",
            "And then there is the law that actually follows more than natural law, right?",
            "The Universal law allow that comes into place that starts.",
            "Adjusting to what happens once the technology is actually, you know, been adopted and accepted and learn.",
            "We learn how to use that technology.",
            "If you look at the boundaries here, for example, in the subway, you know it's very much all of these boundaries were suddenly gone for this woman.",
            "What happened in the physical world of the subway train car suddenly became something that was occurring in the virtual world that she had no control over what she thought was a private matter between her and her dog turned into a public matter.",
            "The Internet vigilanteism is really a question about where the lines between what is a government and what is in our government right?",
            "What is state and non state?",
            "You know the fact that her her life with the University got brought in and eventually also her employment?",
            "You know suddenly she found out boundaries between work and personal life are broken down.",
            "Yeah, social media turn into published media.",
            "What is actually is a Blogger or journalist, you know, did it really become news when it was published in his soul papers and walked in Washington Post?",
            "Or was it actually protected in some way as to source back when it was published under blogs by the anonymous posters local Versus Global?",
            "Something that happened in Seoul suddenly is being reported in Washington Post and the Shades will start.",
            "The residences will start becoming clear.",
            "Two things that are happening.",
            "In the Arab countries right now, when you start looking at authoritarian, you know boundaries versus Democratic boundaries, right?",
            "I won't get into that right now, but."
        ],
        [
            "The result is you start thinking Oh my gosh with all these boundaries slipping is like the block.",
            "This is a movie that was American moving in 1950s about a blob that would just consume things and it was remade in 1999.",
            "I would argue 10 years too soon."
        ],
        [
            "So why is this all important for this audience?",
            "Well, because we've got a new invention.",
            "Semantic web or from calling adventure?",
            "Right, and I think just being covered in a few of the talks.",
            "You know, just what is the business model of the semantic Web and to what extent is the semantic Web Part of the world that we live in, right?"
        ],
        [
            "And I."
        ],
        [
            "I would say that it's very much right here now.",
            "We have finally in the last year or two discovered the business model to semantic web.",
            "People refer to it as big Data.",
            "And we also have to take notice as an aside that alive Vance, Munts in knowledge discovery and data mining technologies in the past half decade also contribute as inventions to his news or a boundary that privacy needs to."
        ],
        [
            "Joy.",
            "So the the unprecedented amount of data is changing our view.",
            "Of how to actually conduct science?",
            "Even Wired magazine went so far as to say science is over.",
            "It's just about data.",
            "Now.",
            "And there are people out there who are claiming that the more data you have.",
            "You don't even need the algorithms anymore, right?"
        ],
        [
            "Explosion in data is clear.",
            "Everybody in this room knows about these types of of predictions."
        ],
        [
            "And.",
            "But ultimately it's really about cost.",
            "In fact there is.",
            "The world is getting cheaper and cheaper for all of you to do what you all need to do and want to do right.",
            "Costa memories dropped dramatically over the last decade across the processing powers are just dropped right?",
            "It's gotten to a point where.",
            "The home page for world's business leaders, forbes.com, would publish an article that says, here's how to build a data startup."
        ],
        [
            "In case you couldn't read the fine print, you need a hustler, a designer and a proton ear.",
            "Our assumed a prod and ear is referring to all of you.",
            "You need somebody who can do the engineering with the data."
        ],
        [
            "Now it's quite a sharp contrast to what was last century.",
            "It took deleting database marketing companies half a decade to take a census data that was produced in 1970 census in the US and actually be able to match and match it with enough data to understand the demographics of 50% of the households.",
            "That's it.",
            "Alright, so?"
        ],
        [
            "So now with PC's and mobile devices in amount of streaming data that's created."
        ],
        [
            "Now we're talking about lots of stars being able to be born fairly quickly, and audience science has been around for awhile.",
            "They used to be called revenue science, and they're much more over traditional database marketing type firm that tries to segment you according to what you read on line just starting."
        ],
        [
            "But right behind it now just in the last couple of years we've got clear site Interactive, their matching demographic data to IP address is 200."
        ],
        [
            "In plus of them you've got blue Cava who's matching data to unique device ID's under 25,000,000.",
            "That I could find him short of growing."
        ],
        [
            "Play you got Blue Kai, who's matching shopping activity of a particular user with that same users media consumption?",
            "So if any of you are surfing news sites right now is still seeing ads for a vacation in Greece.",
            "There are partly responsible, right?",
            "If you saw a handbag in a store and he keeps you that same handbag advertised to you.",
            "You know two days later at the newyorktimes.com."
        ],
        [
            "Responsible for that.",
            "Epsilon Abacus.",
            "They just recently had a huge data breach with their email database.",
            "They're matching the online information with the offline information.",
            "Alright, so it's beginning to traverse boundaries on."
        ],
        [
            "Online, offline, right?",
            "And then you've got people like targets.",
            "Also matching offline data."
        ],
        [
            "Online presence you've got people like Brillig.",
            "They'll who are trying to create platforms which they say we're open to anybody's day to just bring it to us will help you.",
            "Just mash it up and will help you meet other people who might want to.",
            "You know, exchange your date."
        ],
        [
            "With you.",
            "Alright, you've got sense.",
            "Networks which indexes real-world habits."
        ],
        [
            "Um, he got people now looking at other types of data and privacy issues become more and more pronounced, right?",
            "So you've got ingenic switches looking at prescription drug history and trying to match that to health Ben."
        ],
        [
            "Fence.",
            "Any got facial recognition technology which starts pre staging the world that Spielberg showed in minor report.",
            "You know walking into a shopping mall and having the advertising speak directly to you based on recognizing it so the privacy issues."
        ],
        [
            "Becoming a little more clear, you know this is the world online today, right of where advertisers and publishers are."
        ],
        [
            "And this is where they're getting all their data."
        ],
        [
            "Now today.",
            "The legislators have focused on personally identifiable information.",
            "Right, and they've kind of touched upon tracking.",
            "It's enough to make your head spin so much that they're just holding on to something that they can actually legislate about.",
            "That's understandable because their technology is gone way ahead and they can't keep up right.",
            "But the laws have largely talked about privacy from an economic rights point of view, and all of those startups or illustrate that right?",
            "Those are the companies they seem to want to regulate.",
            "But when we talk about privacy and the harm, we really talk about in terms of a trespass, right?",
            "So there's this dissonance that's going on right now."
        ],
        [
            "And when you actually get courts looking at whether the laws that have been enacted should be enforced, they really have a trouble doing it.",
            "You know, because oftentimes they can't find the economic injury.",
            "So here specific media was sued by a class action that was claiming its use of flash cookies, or some people call them zombie cookies because they were able to survive deletions of cookie deletions and browsers.",
            "Caused economic injury, right?",
            "That was what the plaintiffs claim.",
            "But the judge couldn't find it.",
            "And the plane's couldn't articulate an injury sufficiently well that the judge bought into it.",
            "In fact, the judge went so far as to say you guys even having even met on an aggregate basis, we're talking bout a class action, which theoretically would be every single users as encounter specific media ad online, that all of you guys probably couldn't add up to more than five grand of injury.",
            "So you're through to KSA.",
            "Now security breaches like the Sony breach and everything else that the courts have been able to understand, and they have been able to enforce that because again, it touches upon something that we feel in terms of privacy, right?"
        ],
        [
            "So what's happened is some of the legal theorists have started moving, pushing the boundaries, pushing, pushing the theory that you know what this is not about personally identifiable information.",
            "This is not just about economic rights.",
            "This is really about protecting people against not PII, but PE.",
            "I personally embarrassing information, right?",
            "They point to things like the data Valdez is right playing on the Exxon Valdez moniker.",
            "You know, they talk about how.",
            "Companies will set up, you know, wonderful offerings and then change their business terms.",
            "You know, in order to be able to capitalize and exploit on on the data they've collected, they point to DND anonymization of data sets, right?",
            "And ultimately they they talk about things like a database of Doom.",
            "They paint this picture that somehow out there there is PR people who hold on to data.",
            "They are so sensitive that they could destroy your life if the wrong people learned of those things.",
            "So they're not talking about economic loss anymore, not so much as they're talking about.",
            "You know this right to be left alone, and that's how we're beginning to frame it.",
            "And they're scaring the legislatures.",
            "Yeah, and that's the reason why we start having all of these these laws that are taking what one professor is called the privacy precautionary principle.",
            "It's like a proactive approach.",
            "It's not a reactive approach anymore.",
            "Right?"
        ],
        [
            "And so you had this.",
            "You have course that will say you know what we're going to enforce.",
            "Against a California retailer, you know the fact that they ask for a zip code?",
            "So williams-sonoma.",
            "Whenever you go up in this and they sell kitchen type products whenever you go up and buy something, he's a credit card just just to store clinical asking what's your zip code?",
            "And under California law stores are not allowed to ask for personally personally identifiable information.",
            "And what the lawyers have been able to convince this California Court was a ZIP code is personally identifiable information.",
            "Now, of course matched with name on the credit card.",
            "It can be.",
            "It can lead you to find the address, and certainly it is something that that that is arguably personally identifiable information by inference, right?",
            "So by matching.",
            "But here you know, it's into what's interesting is the lawyers are painting the picture of discomfort that people feel when they are asked to zip code information.",
            "Well, that's that's, that's really the harm that you're protecting against."
        ],
        [
            "And so in in a leading paper, has become very influential, called the broken promise of privacy.",
            "Palome, who actually coined the database of Doom or anchor, you know, has sought legislators to take this approach.",
            "To take this precautionary propose, and what he does is he actually points to three easy re identification suitcases that probably a lot of you know about already.",
            "You know the AOL situation and I'll talk about all three of them just briefly.",
            "As evidence of why this is necessary, why it isn't legislatures need to actually force companies to regulate private information?",
            "Personally identifiable information just as much as they have to regulate non personally identifiable."
        ],
        [
            "Nation alright so."
        ],
        [
            "AOL, the first case released search histories.",
            "Now what's really important?",
            "Point out here is it was to embrace the vision of open research.",
            "That's something that must touch the heart of every person in this room, right?",
            "So AOL in 2006.",
            "Publicly posted 20,000,000 search queries.",
            "Sample 650,000 users covering about three months of activity.",
            "They deleted everything that they thought was personally identifiable information.",
            "Now at the time under US law, IP addresses wouldn't be considered PII, but they deleted PIA.",
            "the IP addresses as well."
        ],
        [
            "These are some of the search histories our store.",
            "These are the kinds of examples are used by Paula Home and others.",
            "How do you tell your family you're a victim of incest?",
            "How to kill your wife?",
            "Depression medical leave.",
            "You know, clearly sensitive subject matters that people are searching for."
        ],
        [
            "What happened was a couple of very resourceful New York Times reporters were very quickly able to track down one of the users.",
            "They found Thelma Arnold, 62 years old widow from Georgia.",
            "And when they confronted her with what they believed to be her search results, you said, yes, you're right.",
            "These are my search results.",
            "Numb fingers 60 single men dog that urinates on everything that became the caption for many many stories about this.",
            "Now here this is being raised as an example of the failure of."
        ],
        [
            "Anonymisation just move on to the next one.",
            "Carnegie Mellon Montana Sweeney did a study at the 1990 census data.",
            "And she found that there's a fair amount of sparsity if you actually only look at gender birthday in a 5 digit zip code to zip code is the provincial code in the US.",
            "So she found that 87% of the US population could be identified uniquely by these three pieces of information.",
            "In 2005, another study was done also on the 1990 census data that she used as well as the 2000 census data didn't quite get 87% that she got was still pretty interesting.",
            "An insignificant number."
        ],
        [
            "She wanted Illustrator points so she picked an example.",
            "The math is Massachusetts Group Insurance Commission.",
            "This is the group health Plan of Massachusetts government employees decided to release state employees records.",
            "Again, I'm going to call out for research purposes.",
            "They removed names, addresses, Social Security numbers, explicit identifiers, but they kept the zip code to gender and the birthday.",
            "Right after this release, Governor Weld came out and said publicly don't worry, we've taken all the precautionary steps and of course with."
        ],
        [
            "That challenge Sweeney went to work.",
            "She purchased some voter rolls and was actually able to match back and find the governor's own medical records.",
            "And with that disclosed to the public, in fact, I think she only sent you to the office.",
            "She didn't disclose it in public, but she just goes to prove that she did send to the office his diagnosis and prescription medicine.",
            "So clearly very personal information, something that is should be covered by privacy law.",
            "But again, you know this is being used as an example for failure of animals anonymous."
        ],
        [
            "Session last example.",
            "Netflix did Netflix challenge.",
            "So this has led to, I think, a bounty of learning in the data mining field.",
            "They released 100 million records covering 500,000 users spanning a few years.",
            "All they released with movie titles and ratings.",
            "That's it.",
            "And today to ratings.",
            "So today today."
        ],
        [
            "Point only took two University professors 2 weeks.",
            "To actually match.",
            "That database back to two individuals and what they did was they just matched the ratings of particular movies.",
            "Watched two ratings that those same individuals posted up at IMDb, which was a public data set that they scraped."
        ],
        [
            "Now what was interesting was in this very very huge data set and I might point out it would have to be a very large data set.",
            "They did find that 99% of subscribers can be uniquely identified by knowing only eight movie ratings.",
            "And the dates of those ratings."
        ],
        [
            "We're actually impressed me more was the next point that they found, which is 84% of subscribers can be uniquely identified by their long tail movie habits, right?",
            "So these are the movies that are not within the top 500, right?",
            "You get a lesser percent of identification if you go with only the top 100.",
            "But still, it's impressive.",
            "So this would actually scare me.",
            "I look at this and say, Gee, we've got lots and lots of cookies out there tracking my media consumption.",
            "What I read online.",
            "An If I could be matched back."
        ],
        [
            "That is, that's very concerning.",
            "And of course, if you look at the current day, these are all historical examples.",
            "There's still with us, right?",
            "The Netflix suit is actually only comedy trial.",
            "There's a class action about that release.",
            "It's only come to trial in November of this year.",
            "And you've got a federal grand jury investigation Pandora?",
            "Why?",
            "Because they shared birthday, gender and GPS, which of course could be wind too.",
            "Probably home location with advertising companies.",
            "Anna, you objected to Yahoo changing their search data retention periods and they really slammed all three of the big US search engines about not meeting the deanonymization requirements.",
            "Alright, and Netflix as I said, was was sued on the class action there, but it's also been sued recently for retaining movie viewing and rental habits.",
            "And ratings even after somebody cancels their subscription.",
            "Now the question though is these.",
            "Are these are very real.",
            "World cases and there are laws out there that are being invoked that actually support these cases were active actions, but how real order harms?"
        ],
        [
            "And in fact there are quite powerful animalization.",
            "Techniques out there.",
            "They are available if they are used correctly.",
            "I mean, in in the first 2 examples one would argue that it wasn't an issue of.",
            "A threat of easy you know re identification.",
            "It was a fact that the anonymization was actually applied incorrectly, and Sweeney certainly based on having done that study, was able to develop Takei anonymity out of it.",
            "So there was a benefit that came out of that exercise.",
            "So I'm not going to go into these, but I'd like to.",
            "I'd like to."
        ],
        [
            "Sort of moved into kind of the message.",
            "I would like to bring to this group.",
            "The reason I titled the talk to pirated I was because in my mind I was trying to find a conceptual relationship between the regulation of the Internet with what I thought was to close this analogy though, which is the regulation in the high seas right?",
            "The oceans?",
            "The ones that really and what we're talking about is we're talking about this area here, right?",
            "International waters, there really exists beyond the governance of any particular jurisdiction, any particular country."
        ],
        [
            "And when I went back and looked at how the laws around piracy for grew up and and then I found that the history of it leads to this guy.",
            "He will grow tedious.",
            "And what's ironic is he was a lawyer that was hired by the then newly formed Dutch East India Company.",
            "Which was looking to establish trade with the Asian Asian countries.",
            "And and he was hired because on one of their trips.",
            "They actually captured a Portuguese merchant galleon and more merchant ship.",
            "And that was at a time when Spain and Portugal were monopolizing Asian trade.",
            "So Gradius was hired essentially to write a polemic.",
            "He was hired to write something that said and this is what he came up with.",
            "The Law of nations really dictates the navigation should be free.",
            "To all persons whatsoever, that every nation should be able to use the waters of the Earth which to trade."
        ],
        [
            "And he came up with an argument for this freedom of seas.",
            "It's best syllogistic, but it works."
        ],
        [
            "And I felt that in some ways this echoed what many of us feel, or many people feel about the web.",
            "Alright."
        ],
        [
            "That an here's somebody who feels very strongly about it wanted to Co founders, Electronic Frontier Foundation John Perry Barlow.",
            "His words actually very much resonating.",
            "Shared the same tone as Brody's words about the oceans.",
            "Right cyberspace consists of transactions relationships, thought, you know we should all be allowed to enter.",
            "Right, we should be able to do so without being coerced into silence without being coerced into conformity.",
            "This is about the right of choice, right?",
            "We should be able to inform that there is an ethic and enlightened self interest as foreign to develop.",
            "Lessig talks about how the code is ultimately going to prevail as the legal regime within the Internet space.",
            "Alright."
        ],
        [
            "And that and so separate governance from the kinds of governance that countries develop will come into being.",
            "Now this was very much in the news recently with the G8.",
            "So you have.",
            "Here you have Sarkozy and Merkel meeting with Maurice Levy, chief executive of Publicis.",
            "And you course recognized Zuckerberg.",
            "I'm sure an Eric Schmidt.",
            "Alright, and Sarkozy set up the GA, which is being kind of referred to as the ECJ.",
            "As a place to deal with the Internet because his feeling is is so much part of public life, it needs to be regulated."
        ],
        [
            "Any invited all the leaders of the leading businesses to come and speak, and they went with the mission.",
            "And their mission was very simple.",
            "Their mission was to say no.",
            "Keep it open.",
            "If you start regulating the Internet, you're going to stifle innovation.",
            "You're going to stifle discourse.",
            "And Mark Zuckerberg refers to, you know, speaks here about the fact that you know Facebook has had a great instrumental.",
            "I don't know how much cause and effect, but certainly a a role in the Arab uprisings.",
            "And you can't have both.",
            "This was his messages.",
            "Yeah, this is this correct cognitive dissonance coming in for that."
        ],
        [
            "In and the question then is, who's really the pirate here?",
            "Right?",
            "And what are Pirates all about?"
        ],
        [
            "Because when you go back to this chart this this slide and you think about the fact that we live in a world with all these verses.",
            "And the problem in part is those verses are disappearing and the seamlessness is creating this kind of cognitive dissonance.",
            "Maybe the best."
        ],
        [
            "Way to think about things is uncharted."
        ],
        [
            "Right, and the question would be to what extent?",
            "To keep punning on the piracy.",
            "Should we be battening down the hatches?",
            "Should we really be battening down the hatches?",
            "Does it help anything to discredit anonymization?",
            "Now do we want to advocate a total opt in?",
            "Consent model of privacy precautionary principle should that really leave?",
            "Should we be challenging these kinds of uses?",
            "Right and large has an example of how to use Facebook data to track flu.",
            "This is revolutionary.",
            "But the only way that this can work is if they use the data of everybody.",
            "Who searches for flu in Google?",
            "They can't just seem right.",
            "It has to be everybody.",
            "So you can't have an opt in.",
            "And still be able to have these kinds of tools and find these kinds of tools so you know the kind of problem is where does it end if you start pursuing these privacy precautionary approaches, you know, and as a kind of start ironically feeling like if you're trying to protect privacy really ending up with more of an Orwellian world.",
            "Hell."
        ],
        [
            "An you think about privacy and censorship or fairly related concepts?",
            "You know you start thinking about places like China where they can so easily shut down anybody.",
            "Right, who tweets?"
        ],
        [
            "And when?",
            "The user stay one step ahead and they start tweeting about the empty Chan instead of actually using Lu's name."
        ],
        [
            "Alright.",
            "They start airbrushing the empty chair out of the photos.",
            "In eliminating from the search engines.",
            "And I feel like this in some ways is analogous to the same kinds that this is the possible end in effect of the same kind of censorship of data that might happen if we impose overly strict privacy regulations."
        ],
        [
            "So the problem really is that the greatest victim of privacy regulation is probably not Facebook and Google or any of those startup businesses.",
            "I showed you before.",
            "It may in fact be science.",
            "And this is probably the biggest concern.",
            "That the legal theorists should be debating at this time.",
            "Thankfully there are few law professors out there.",
            "We're focusing on it.",
            "Jane Jackovitz, who's with Brooklyn Law School, just wrote a paper two months ago.",
            "You know, I was in Ghana and I gave a very similar presentation and this in the presentation I gave in Ghana was much more slanted too.",
            "Here's what you should be afraid of, right?",
            "You have an opportunity in Ghana to kind of start the Internet and create a structure that might work and be open.",
            "But be afraid that you have to protect against these things and I walked away.",
            "And I thought, Gee, you know, was that the right message and one of the professors that was in the audience asked me so with all of these very fearful things, you've shown us, you know what should we do?",
            "And my answer to him was ignore me because what you should do is you should embrace the data because only through learning from the data will you actually figure out what the future of the Internet in Ghana is.",
            "Alright, I'm here to tell you.",
            "Sorry, cautionary tales.",
            "And so she was sensitized to what could happen to individuals where we are freedoms can be impinged where where but.",
            "Really from your.",
            "Purpose where you come from, what you should do is pursue the science.",
            "With Jane Jackovitz, you know worries about is that as these privacy regulations come down and all of the fear gets created.",
            "We will end up with the tragedy of data comments.",
            "'cause every individual who is offered the opportunity to opt in is going to say love reading this article.",
            "This newspaper.",
            "Love using Facebook?",
            "Love hooking up with my friends, but I'm going to opt out.",
            "And as a result, we're going to actually.",
            "We generate that this sort of collective benefit that we could get from the data is going to generate overtime, a classic tragedy Commons issue."
        ],
        [
            "And so.",
            "You know, I don't think we've seen the end of science.",
            "And you know where we really are is with that kind of the costs coming down and the access to data being so available.",
            "You know we're at a place where we can actually create a new age, right?",
            "A new age of science.",
            "And what we worry about is we don't want.",
            "The legs get ahead of the body."
        ],
        [
            "OK and so out.",
            "The last words I'll leave you with or from Eric Schmidt.",
            "Who says?",
            "Technology will move faster than governments.",
            "Don't legislate before you understand the consequences."
        ],
        [
            "In the last slide, I'll leave you with properly, I hope is Tim Berners Lee's statement that they will build privacy into semantic web."
        ],
        [
            "Thank you.",
            "So I had an interesting experience with a classroom full of college students recently where I presented to them much about the amount of information Google has on them.",
            "How it works.",
            "You know, little video that someone had made, which was kind of a humorous version of Google, will own the world data wise an ask them to write a little, you know, one pager on it.",
            "An 29 out of 30 of them said I don't care the service they offered me.",
            "Exceeds the value of my personal information.",
            "Now I don't know if that's just 'cause they're young and don't understand yet, or that's a general national thing to literature.",
            "Is full of that question, but an interesting question that comes up is the legal framework really isn't about tradeoffs in that sense very easily.",
            "And how do you see us kind of playing?",
            "The technology game into that sort of world where there's considered a value for.",
            "The service and the payment is the data you've been doing lots of startup step in trying to create this idea of hiking.",
            "Barter my personal information right and in every transaction I can use it like a credit card and I think there will be some startups that will actually succeed.",
            "Esther Dyson was just recently on a panel where that's what she's excited about and she's investing.",
            "She's a very successful Angel investor an she is investing in startups are exactly doing that.",
            "How do I give this technology so that the individual user now has the power?",
            "To be able to control how their information use and it starts with understanding, you know, once being used for.",
            "So there's some transparency that needs to come into place and but really, the problem ultimately is that the Internet is created out of network effect.",
            "And these startups, as much as they go out with good ideas and good intentions, often fail.",
            "Because it's just so much easier to grow so much more quickly when you can actually just get data from all over and cross and comingle data from different people, right?",
            "And so it's I think it's only a matter of time before the technology gets better enough you know well, so that you can.",
            "Actually when you go to a site, say you know from some plugin in your browser.",
            "This is what's going on.",
            "This began to happen.",
            "And when people start getting used to know, seeing that little window, you know things like Ghostory as a plugin for Firefox and start seeing that window and then go St takes that next step.",
            "Now they've got the adoption and say here this is what your choices are.",
            "Then we start getting into a place where I think a true barter economy can work.",
            "Now the course have been very quick to pick up on that, right?",
            "So they didn't they didn't.",
            "They threw out the specific media case right?",
            "But they did allow the case against Rock You Rock You is one of these social networks where you give personal information and then they give you the ability to share media with other people and Rock You frankly didn't spend enough money, didn't actually put the right by security in place to protect that information, and the court was very quick to say.",
            "You know what?",
            "You broke the bargain and also you know once those kinds of laws start getting sorted out.",
            "I do think there is an opening for that kind of approach.",
            "I don't know that that was much of a devil's advocate question.",
            "Yeah.",
            "Thank you for your talk.",
            "It's really a very good talk.",
            "And what I was thinking that there are all these kind of self controlling mechanisms in the Internet, for example Reddit where you can.",
            "Rate also, for example, read it.",
            "Then you can just rate the new stuff and people actually can control and see if somebody is actually advocating their own thing and can control against that.",
            "So do you think and using those sub controlling mechanisms that we could also contribute you to privacy and fairness on the Internet?",
            "Yes, I'm sorry.",
            "So do you?",
            "Do you?",
            "What do you think about that?",
            "Do you think that could work to make the Internet more secure?",
            "More like I respect privacy.",
            "You know this talk.",
            "This talk was about privacy.",
            "There are other issues that are sort of peripheral to privacy that actually worrying me more right?",
            "I worry more that if you don't have enough of the kinds of services like read it, right?",
            "The hat.",
            "Google, Facebook and Microsoft and Apple basically control all user data going forward about your media consumption.",
            "Oh, right, so there's something called.",
            "There's a book out there called the Master Switch by a professor named Tim Wu.",
            "And he talks about the history of media and how it becomes monopolies.",
            "Right, and so you know, I love services like reading because it empowers the individual.",
            "But ironically, Reddit is owned by Conde Nast, wanted a leading magazine groups.",
            "Yeah, also to what extent you know is that a worry that we should have.",
            "The other thing that I don't talk about is the filter bubble right?",
            "There's a book that just recently got published and there was a very famous Ted Talk that's been traveling all over the Internet about how personalization tools have caused you to more and more narrowly perceive the web.",
            "Because we only get to see beyond what the web is delivering to you.",
            "I recommend that Ted Talk where it's too much time to talk about it here, but those are.",
            "Those are directly linked to privacy as well as their go to right of choice.",
            "Know who you are.",
            "Will have to stand up so we see each other.",
            "Thank you baby for the great talk.",
            "But at the end of it, I feel confused.",
            "You mentioned the great very visible case of the dark dark poop girl, Internet vigilantism and then it seemed like you were going to be telling us how to prevent the next ones.",
            "And then it seemed like you were telling us that we really shouldn't do anything yet at least.",
            "But would you have suggestions for how to perhaps prevent such next cases?",
            "Or if not, why?",
            "The reason why I went through the subway narrative was because I wanted to actually translate privacies issues into something you could feel all the dimensions of it.",
            "My.",
            "Anne and the title of the talk.",
            "If I might go back up to the top, the title of the talk is how privacy can't exist on a law.",
            "Less semantic web 'cause I do believe there is a place for laws right?",
            "The place for laws is to honor bargains, to actually protect individuals against, you know, vigilanteism like that, the place where laws is to is to actually protect a security Sony with its breach.",
            "the Canadian Commissioner came out and said we're going to find the.",
            "Dickens added these people because if we don't find them, they're not going to pay attention to the fact that they're holding on to precious information.",
            "So that is an appropriate place where laws should be applied.",
            "Now when I am worried about is more prescriptive and prophylactic approaches that basically say you know what is dangerous, it's almost like.",
            "We're worried about all of the gossip in the yellow journalism back in the early 1900s, so we're going to outlaw cameras.",
            "The law should actually go to the intent in use of the technology.",
            "Or the failure to uphold a bargain about how the technology is offered, not about the technology itself itself.",
            "And that's where I hope to end up.",
            "Thank you, that was before experiences on publishing open content on the Internet, such as Creative Commons media or Open Source Software's Entourage was saying yesterday the bad guys are coming to the link data soon or later from a lower point of view.",
            "What can we learn from the previous experiences on?",
            "Sorry I'm having a little trouble hearing you if you hold the Michael closer just the last part.",
            "She was saying yesterday that the bad guys are coming through the link data soon or later.",
            "I mean by spamming it or by changing the content by.",
            "Why are you saying sooner or later the data is just going to get out here refers to the discussion yesterday when the Doctor was saying that bad guys are coming.",
            "Also to the link data.",
            "So to the structured part, well, that goes back to you know you do need to have strict laws to deal with people who are actually.",
            "We're actually misusing the data.",
            "When the when when bin Laden was was killed by the Seal six group, the Navy SEAL Six team photos were taken and the Obama administration debated back and forth as to whether or not to publish those photos and he decided out of I thought, very dignified reasons, not to publish the photos.",
            "What was interesting is that the argument on the other side was those photos are going to get out.",
            "Eventually they will get out.",
            "So why not be in control of the publication rather than deal with it on a reactionary basis when they get out?",
            "I think to actually think about to always be worried and think about a future where the bad will happen.",
            "Is exactly the kind of fears that some of these legal theorists are trying to pose, which is there are bad guys out there, right?",
            "There are the underground networks of credit cards and they will actually go and hack through systems.",
            "So it's better if we say to Sony you're not allowed to collect credit cards.",
            "The use actually examining and considering whether or not Sony A is collected more personal information they should have.",
            "I don't think that's the way to go.",
            "I don't know if that answers your question because I'm still not sure I followed it fully.",
            "But OK, we have to finish now just for the sake of time because we are a little bit over.",
            "Thanks.",
            "Shape.",
            "Again, I think was a great talk."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you are.",
                    "label": 0
                },
                {
                    "sent": "Having now the last invited talks, so we'll conclude, conclude the spectrum of topics for invited talks for this conference with.",
                    "label": 0
                },
                {
                    "sent": "Legal area, so we started with like.",
                    "label": 0
                },
                {
                    "sent": "Proper semantic web talk by Jim that we continued with social media, so with Facebook.",
                    "label": 0
                },
                {
                    "sent": "We continued with HCI, so it's another video toggle topic, then startup technology.",
                    "label": 0
                },
                {
                    "sent": "How startup is being built out of this technology.",
                    "label": 0
                },
                {
                    "sent": "Then today in the morning we heard the talk on scale large scale analytics.",
                    "label": 0
                },
                {
                    "sent": "Network analysis and so on and so.",
                    "label": 0
                },
                {
                    "sent": "At the end, we'll have the talk from the legal side, so this is always very challenging.",
                    "label": 0
                },
                {
                    "sent": "So how to make first know how to make a?",
                    "label": 0
                },
                {
                    "sent": "How do we find the speaker which would talk on legal issues in a fun way?",
                    "label": 0
                },
                {
                    "sent": "And still be informative.",
                    "label": 0
                },
                {
                    "sent": "So for this purpose I think ape.",
                    "label": 0
                },
                {
                    "sent": "So on is the right person.",
                    "label": 0
                },
                {
                    "sent": "A pass, well, pretty long history in on both sides.",
                    "label": 0
                },
                {
                    "sent": "I would say on the site as him being a lawyer, New York and also being intrapreneur in Itworks so he has a couple of startups.",
                    "label": 0
                },
                {
                    "sent": "04 Last 1015 years, right.",
                    "label": 0
                },
                {
                    "sent": "And so he's really experienced in most of the aspects one would want to be talking.",
                    "label": 0
                },
                {
                    "sent": "Being kind of both sides so legal and technological.",
                    "label": 0
                },
                {
                    "sent": "So this talk.",
                    "label": 0
                },
                {
                    "sent": "This talk is.",
                    "label": 0
                },
                {
                    "sent": "As you see, the title is the pirated I or how privacy can't exist on Alola Semantica so.",
                    "label": 1
                },
                {
                    "sent": "A couple of very interesting thoughts.",
                    "label": 0
                },
                {
                    "sent": "Disease, which April.",
                    "label": 0
                },
                {
                    "sent": "Give us and I guess this type of talk is very good also for open discussion.",
                    "label": 0
                },
                {
                    "sent": "Maybe if during apes talk everybody has anybody has any comments of this?",
                    "label": 0
                },
                {
                    "sent": "Interrupts with a comment.",
                    "label": 0
                },
                {
                    "sent": "A please, OK thank you Marco.",
                    "label": 0
                },
                {
                    "sent": "Thank you for inviting me to here to speak.",
                    "label": 0
                },
                {
                    "sent": "Privacy very hot topic these days.",
                    "label": 0
                },
                {
                    "sent": "Just examples of.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some of the head.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lines have been hitting to.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where is Justin?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's two months, right?",
                    "label": 0
                },
                {
                    "sent": "Everybody's heard about the Sony issues to Apple issues, location tracking Congress in the United States has been asking Apple all the different parties to come and appear before it to attend hearings.",
                    "label": 0
                },
                {
                    "sent": "And, you know, get ready now for a whole lot of legislation.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to come in reaction to it, it's not just.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In legislation in and US that in the EU as well, this past week, according to the Directive, 27 countries should have passed a lot of transposed the directive into law about cookies.",
                    "label": 0
                },
                {
                    "sent": "And of course, every time there is a breach.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are lawsuits many many lawsuit.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lot of debate as to what could work and what can't work and there's just.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Great deal of posturing and talk.",
                    "label": 0
                },
                {
                    "sent": "So what is it all about?",
                    "label": 0
                },
                {
                    "sent": "This talk.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is going to take a fairly general view about privacy and the reason why it's going to take a general viewing parties because privacy is a very amorphis.",
                    "label": 0
                },
                {
                    "sent": "Concept is slippery every time you talk about privacy you know you mean.",
                    "label": 0
                },
                {
                    "sent": "On one hand, you're right to control and store information about yourself and to share that information based on your own willingness to share it.",
                    "label": 0
                },
                {
                    "sent": "And you know there's that economic properties, sense of privacy.",
                    "label": 0
                },
                {
                    "sent": "That's usually where people begin, but immediately to visceral feelings come out when you start talking about surveillance and trespass, and whether or not somebody has a right to actually take your information from you, with or without your knowing.",
                    "label": 0
                },
                {
                    "sent": "And so there is a privacy.",
                    "label": 0
                },
                {
                    "sent": "There's a trespass aspect of privacy.",
                    "label": 0
                },
                {
                    "sent": "And then there's also this idea that privacy is about your ability to make choices in your own.",
                    "label": 0
                },
                {
                    "sent": "Safety of knowing that if you make the choice, there won't be somebody who is going to catch you later.",
                    "label": 0
                },
                {
                    "sent": "Who is going to call you out?",
                    "label": 0
                },
                {
                    "sent": "Who is going to improperly influence you?",
                    "label": 0
                },
                {
                    "sent": "Who's going to use that information?",
                    "label": 0
                },
                {
                    "sent": "Right, and so privacy is also about the freedom, you know, an individual freedom, and because it's so slippery, it's very difficult to discuss.",
                    "label": 0
                },
                {
                    "sent": "And with each one of these ways of looking about their privacy, there's also kind of a counter interest that is at play.",
                    "label": 0
                },
                {
                    "sent": "So when you talk about an economic property, right, you have to also talk about the fact that much of this world's media these days is supported by advertising.",
                    "label": 0
                },
                {
                    "sent": "And is there an interest in free media to be supported?",
                    "label": 0
                },
                {
                    "sent": "And dude, are you making a trade for that?",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "What about the cloud?",
                    "label": 0
                },
                {
                    "sent": "But what about the fact that the cloud is a much more economically viable alternative to everybody buying their own infrastructure?",
                    "label": 0
                },
                {
                    "sent": "And what about the security costs?",
                    "label": 0
                },
                {
                    "sent": "Are people actually paying the money you know to to secure the data that you've shared with them and you have to talk about in cases of trespass, civil defense, law enforcement?",
                    "label": 0
                },
                {
                    "sent": "Terrorism is clearly something that every nation is worried about.",
                    "label": 0
                },
                {
                    "sent": "And they want to be able to monitor things.",
                    "label": 0
                },
                {
                    "sent": "You have to talk about.",
                    "label": 0
                },
                {
                    "sent": "In the case of freedom of choice that you know your ability to buy things is usually going to in some way be protected by DRM and DRM usually intersects with privacy issues because there's some personal ID associated with, you know, a digital rights management and you want to talk about open government and to what extent is somebody who is a public figure you know deserving of privacy at the same level.",
                    "label": 0
                },
                {
                    "sent": "Somebody who's not.",
                    "label": 0
                },
                {
                    "sent": "So it's it's.",
                    "label": 0
                },
                {
                    "sent": "Horrible.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You end up with this cognitive dissonance constantly.",
                    "label": 0
                },
                {
                    "sent": "You know when you're talking about the issue of privacy in the United States.",
                    "label": 0
                },
                {
                    "sent": "Most discussions about privacy begin with these words.",
                    "label": 0
                },
                {
                    "sent": "And they recognize that recent inventions and business methods do affect.",
                    "label": 0
                },
                {
                    "sent": "How we perceive our ability to be protected as a person right?",
                    "label": 0
                },
                {
                    "sent": "And that really at the end of the day.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's just about a right to be, let alone.",
                    "label": 0
                },
                {
                    "sent": "While these words are written.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1890 in response to the invention of the Snapshot camera.",
                    "label": 1
                },
                {
                    "sent": "The snapshot camera.",
                    "label": 1
                },
                {
                    "sent": "Introduced to the general population, ability to take photos of people in public.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, and if you actually look at sort of how this concept, which was authored in 1990 by Brandeis and Warren, you know sort of grew up over the course of the last century, you start seeing using the Google Ngram Viewer, which is a wonderful tool, and if you search for the unigrams privacy and secrecy secrecy being a very similar concept, and you compare that to you, find that privacy, which is the blue line sort of spikes up over that over the course of the century.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, and if you actually match it to the technologies that were introduced, it matches pretty well in terms of how the awareness or the concerns or discussion discourse about privacy started growing.",
                    "label": 0
                },
                {
                    "sent": "As each of these subsequent inventions started making its way into the commercial realm.",
                    "label": 0
                },
                {
                    "sent": "So with the invention of the camera back in 1890, you know the modern concept of privacy was invented.",
                    "label": 1
                },
                {
                    "sent": "You know, then you have to telephone the mainframe computers which led to database marketing.",
                    "label": 0
                },
                {
                    "sent": "The personal PC computer.",
                    "label": 0
                },
                {
                    "sent": "Obviously the mobile phone, the web and in fact surveillance cameras on every street posting these days so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Now, what Brandeis and Warren recognized was, it wasn't just the technology, right?",
                    "label": 0
                },
                {
                    "sent": "There's also a pairing with a business method.",
                    "label": 0
                },
                {
                    "sent": "And in the case of the Snapshot camera, the business method was the newspaper industry.",
                    "label": 0
                },
                {
                    "sent": "Now newspapers ever since to the invention of printing presses second handle the kind of mass printing that would lead to a newspaper industry.",
                    "label": 0
                },
                {
                    "sent": "You know, it was 50 years or so when the camera was invented.",
                    "label": 0
                },
                {
                    "sent": "In eighteen 1550 years or so that Denise papers have been around, but it was only in 1880s that newspapers and cameras intersected in 1880.",
                    "label": 0
                },
                {
                    "sent": "The idea of a halftone, the ability to actually publish a photograph.",
                    "label": 0
                },
                {
                    "sent": "In a newspaper was invented.",
                    "label": 0
                },
                {
                    "sent": "Right and so over the course of the 10 years subsequent and once the snapshot cameras event in 1888, suddenly newspapers became the transmission medium for the privacy invasion that the camera could capture, right?",
                    "label": 0
                },
                {
                    "sent": "And so it was.",
                    "label": 0
                },
                {
                    "sent": "It was Brandeis and Warren.",
                    "label": 0
                },
                {
                    "sent": "I think that was really the first to recognize that it wasn't just the technology, it wasn't just that the actual activity, it was the fact that.",
                    "label": 0
                },
                {
                    "sent": "What used to be something that was very local?",
                    "label": 0
                },
                {
                    "sent": "You know something that was only known by a few neighbors could suddenly be called from the housetops.",
                    "label": 0
                },
                {
                    "sent": "As they say, proclaimed from the Housetops.",
                    "label": 0
                },
                {
                    "sent": "What was known by only a few people in the 1880s by the 1900s might be known by millions of people.",
                    "label": 0
                },
                {
                    "sent": "And you see on the right here, that's the number of daily newspapers that grew over the course of that period of time.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's worth noting as aside, just to put it further in context, when the camera was invented.",
                    "label": 0
                },
                {
                    "sent": "Yeah, there was this belief that was a magical box that could steal a soul.",
                    "label": 0
                },
                {
                    "sent": "And even as late as 1920, you know James Fraser, who wrote probably the definitive book, still are magic and religion commented that in many places in Europe people still felt this was the case.",
                    "label": 1
                },
                {
                    "sent": "I think it's important to note that because a lot of what?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot of what law is about is adjusting to ideas and understandings of society about some things.",
                    "label": 0
                },
                {
                    "sent": "So here's a here's a story about a dog and what's relevant about the dog is.",
                    "label": 0
                },
                {
                    "sent": "This dog was brought by its owner onto the Seoul Metropolitan Transit Subway system and while on one ride the dog decided to his business on the floor of the subway train.",
                    "label": 0
                },
                {
                    "sent": "The woman was very embarrassed.",
                    "label": 0
                },
                {
                    "sent": "One of the bystanders gave her a tissue she preceded to use the tissue to clean up the dog, but not clean up the mess.",
                    "label": 0
                },
                {
                    "sent": "Now this enraged people on the train people started telling her you need to clean up this mess.",
                    "label": 0
                },
                {
                    "sent": "This is your responsibility.",
                    "label": 0
                },
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "Fairly embarrassed by the situation, kept talking to her dog, saying things like what's wrong.",
                    "label": 0
                },
                {
                    "sent": "You've not done this before.",
                    "label": 0
                },
                {
                    "sent": "An at the next stop.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She got off.",
                    "label": 0
                },
                {
                    "sent": "Now, one of the people on that train on that subway train had a camera, so she took the camera out and started taking these photos.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Once the people got together after she left and somebody actually did clean up the mess, she decided to take it upon herself to go and publish those photos.",
                    "label": 0
                },
                {
                    "sent": "In a local soul website.",
                    "label": 0
                },
                {
                    "sent": "An write up her experience, probably only a personal blog to the few people that she wanted to share this.",
                    "label": 0
                },
                {
                    "sent": "This this experience with.",
                    "label": 0
                },
                {
                    "sent": "Well within a few days.",
                    "label": 0
                },
                {
                    "sent": "The picture became the most searched photo on a local search portals.",
                    "label": 0
                },
                {
                    "sent": "From there, it grew into more and more of a.",
                    "label": 0
                },
                {
                    "sent": "Controversy online.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That by the time.",
                    "label": 0
                },
                {
                    "sent": "Within a few while she started being called a name online, referred to as Dog Poop Girl.",
                    "label": 0
                },
                {
                    "sent": "People online decided that the social networks were replaced to punish this woman, so some of the people crowdsourced her identity.",
                    "label": 0
                },
                {
                    "sent": "Publish your personal information on.",
                    "label": 0
                },
                {
                    "sent": "And found out that she was associated with the University.",
                    "label": 0
                },
                {
                    "sent": "The university's website actually crashed because it started receiving millions of emails from concerned citizens telling that University that if she were a student there, she should be expelled.",
                    "label": 0
                },
                {
                    "sent": "The University publishes statement saying no, no no, no no.",
                    "label": 0
                },
                {
                    "sent": "She's no longer a student here.",
                    "label": 0
                },
                {
                    "sent": "Right and completely dissociate themselves with her.",
                    "label": 0
                },
                {
                    "sent": "What followed on top of that was false, reports false reports that she was expelled by University false reports that she had dropped out false reports that that she had in some ways not even been a University student in there for of the kind of character and personality would allow something like this to happen, right?",
                    "label": 0
                },
                {
                    "sent": "Her family got identified and her family started receiving online threats and emails.",
                    "label": 0
                },
                {
                    "sent": "Now, in the meantime, backlash happened.",
                    "label": 0
                },
                {
                    "sent": "Some people said hey, she was in public transit.",
                    "label": 1
                },
                {
                    "sent": "She has no right of privacy here.",
                    "label": 0
                },
                {
                    "sent": "Other people, on the other hand, said no, this is vigilanteism.",
                    "label": 0
                },
                {
                    "sent": "Words like Cyber Posse started being used.",
                    "label": 0
                },
                {
                    "sent": "People talk about the Internet witch hunt.",
                    "label": 1
                },
                {
                    "sent": "And there became a debate over whether or not it was acceptable, appropriate for Miss Kim, which I.",
                    "label": 0
                },
                {
                    "sent": "Noted a second go is in quotation marks because it's a screen name.",
                    "label": 0
                },
                {
                    "sent": "Should have actually published photos.",
                    "label": 0
                },
                {
                    "sent": "Maybe blocking her face out.",
                    "label": 0
                },
                {
                    "sent": "Given her some privacy, respect right?",
                    "label": 0
                },
                {
                    "sent": "There were other people who said no, no, no, no, no, you know, it's OK to publish the pictures, but it was, uh, not OK to identifier and publish a personal information.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was probably the verdict that ended up being the prevailing verdict, which is.",
                    "label": 0
                },
                {
                    "sent": "And then people's minds.",
                    "label": 0
                },
                {
                    "sent": "It didn't matter whether she was in a subway car with only a dozen people.",
                    "label": 0
                },
                {
                    "sent": "Or she was known to have done this by only 100 people.",
                    "label": 0
                },
                {
                    "sent": "Or whether she was in front of a million people.",
                    "label": 0
                },
                {
                    "sent": "And if you're interested in reading more about this, Daniel Salo was a wonderful legal theorist in the area as written a wonderful narrative, and he was actually involved in some of those bloggings.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, what's absolutely incredible.",
                    "label": 0
                },
                {
                    "sent": "And worth noting here from my point of view, is.",
                    "label": 0
                },
                {
                    "sent": "This is about technology, right?",
                    "label": 0
                },
                {
                    "sent": "This is about the fact that at the time this happened, which was about 2005 I believe.",
                    "label": 0
                },
                {
                    "sent": "You know this became.",
                    "label": 0
                },
                {
                    "sent": "Taken from something that was a private sharing on a personal blog.",
                    "label": 0
                },
                {
                    "sent": "Viewed by 100 people maybe.",
                    "label": 0
                },
                {
                    "sent": "Thank you, Rodney.",
                    "label": 0
                },
                {
                    "sent": "Actually says that on average blogs are read by only six people.",
                    "label": 0
                },
                {
                    "sent": "So let's assume 100 for arguments sake.",
                    "label": 0
                },
                {
                    "sent": "It's suddenly bad picked up by those through some sort of viral activity and got seen by 10,000 people, by which point social networks started crowdsourcing our identity.",
                    "label": 0
                },
                {
                    "sent": "The South Korean mainstream press picked up on it because it was no longer a story about a dog.",
                    "label": 0
                },
                {
                    "sent": "Having done is Doo Doo on the subway.",
                    "label": 0
                },
                {
                    "sent": "It was about Internet vigilanteism and whether or not the social net was a proper place to Kangaroo court an individual and then it got picked up by millions of people.",
                    "label": 0
                },
                {
                    "sent": "A Korean American who knew about this decided to block on his blog in the US about it.",
                    "label": 0
                },
                {
                    "sent": "It got picked up by Boy boy.",
                    "label": 0
                },
                {
                    "sent": "With 7 million uniques.",
                    "label": 0
                },
                {
                    "sent": "At which point the Washington Post decided it was news.",
                    "label": 0
                },
                {
                    "sent": "And published it there.",
                    "label": 0
                },
                {
                    "sent": "And all of a sudden you're talking about 10s of millions of people.",
                    "label": 0
                },
                {
                    "sent": "We know this story.",
                    "label": 0
                },
                {
                    "sent": "And all the people who are involved other than this woman.",
                    "label": 0
                },
                {
                    "sent": "Were known by their screen names.",
                    "label": 0
                },
                {
                    "sent": "Miss Kim.",
                    "label": 0
                },
                {
                    "sent": "The previous comment are anonymous.",
                    "label": 0
                },
                {
                    "sent": "It's very interesting that in some ways you know what is happening.",
                    "label": 0
                },
                {
                    "sent": "Here is the technology that we are talking about here and how his intersect with privacy is histotechnology.",
                    "label": 0
                },
                {
                    "sent": "It's an invention of social networks is the invention of social media and the business model to use the Warren and Brandeis framework is this crowd sourcing.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here's what she wrote.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to read the whole thing.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The relevant portion in my mind is this.",
                    "label": 0
                },
                {
                    "sent": "When she felt helpless.",
                    "label": 0
                },
                {
                    "sent": "To stop this, she invoked the law.",
                    "label": 0
                },
                {
                    "sent": "She said if you keep putting me down on the Internet, I'll Sue all the people.",
                    "label": 1
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a very this girl feeling this sense of powerlessness.",
                    "label": 0
                },
                {
                    "sent": "It's what drives us normally to invoke the law.",
                    "label": 0
                },
                {
                    "sent": "People say I will Sue you because they're angry and they feel like there's no other recourse that they could turn to.",
                    "label": 0
                },
                {
                    "sent": "Alright, so it's not hard when you start seeing it from her point of view how this could happen to any of us on a bad day.",
                    "label": 0
                },
                {
                    "sent": "And so as a as a.",
                    "label": 0
                },
                {
                    "sent": "As a story about privacy introduced some of the concepts of privacy.",
                    "label": 0
                },
                {
                    "sent": "It actually is archetypal because just so many other examples that are similar to this in the US, Their business is suing customers who write bad reviews on Yelp about their businesses.",
                    "label": 0
                },
                {
                    "sent": "They are actually suffering economic loss when those customers right to bad reviews.",
                    "label": 0
                },
                {
                    "sent": "Right there are.",
                    "label": 0
                },
                {
                    "sent": "You know Facebook is being used as evidence in 2/3 of the divorce cases.",
                    "label": 0
                },
                {
                    "sent": "According to a study by the matrimonial lawyers.",
                    "label": 0
                },
                {
                    "sent": "Loyola University actually did a study, and they attribute one out of five divorces.",
                    "label": 0
                },
                {
                    "sent": "To Facebook now.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "It's it's social media has really had an effect.",
                    "label": 0
                },
                {
                    "sent": "And it's translated often into legal proceedings.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the problem is, the law is not always as sympathetic, so would like it to be.",
                    "label": 0
                },
                {
                    "sent": "Idea of a right of privacy is pretty clear, right?",
                    "label": 0
                },
                {
                    "sent": "And this is from the United Nations, adopted by the General Assembly in the mid part of last century.",
                    "label": 0
                },
                {
                    "sent": "And it says very clearly we should be protected against.",
                    "label": 0
                },
                {
                    "sent": "Interference in attacks.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the operative word here is the word arbitrary.",
                    "label": 0
                },
                {
                    "sent": "Write an arbitrary is defined by soul silence.",
                    "label": 0
                },
                {
                    "sent": "Is defined by.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I you know, what is it?",
                    "label": 0
                },
                {
                    "sent": "That we as a as a society believe.",
                    "label": 0
                },
                {
                    "sent": "Is not arbitrary, right?",
                    "label": 0
                },
                {
                    "sent": "What is it that if you look at the legal definition of arbitrary, it's not based on reason or judgment?",
                    "label": 0
                },
                {
                    "sent": "It's with regard without regard to rules or standards is founded on prejudice.",
                    "label": 0
                },
                {
                    "sent": "Right, it's anonymous, possibly with tyranny.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Law generally.",
                    "label": 0
                },
                {
                    "sent": "Happens in 2 paces, right?",
                    "label": 0
                },
                {
                    "sent": "There's the kneejerk pace that happens immediately anytime there's a new technology.",
                    "label": 0
                },
                {
                    "sent": "There's a sudden rush of new laws to try to protect against the harm to injury, to change that's happening, right?",
                    "label": 0
                },
                {
                    "sent": "The boundaries that get broken down by whatever this new technology is.",
                    "label": 0
                },
                {
                    "sent": "And then there is the law that actually follows more than natural law, right?",
                    "label": 0
                },
                {
                    "sent": "The Universal law allow that comes into place that starts.",
                    "label": 0
                },
                {
                    "sent": "Adjusting to what happens once the technology is actually, you know, been adopted and accepted and learn.",
                    "label": 0
                },
                {
                    "sent": "We learn how to use that technology.",
                    "label": 0
                },
                {
                    "sent": "If you look at the boundaries here, for example, in the subway, you know it's very much all of these boundaries were suddenly gone for this woman.",
                    "label": 0
                },
                {
                    "sent": "What happened in the physical world of the subway train car suddenly became something that was occurring in the virtual world that she had no control over what she thought was a private matter between her and her dog turned into a public matter.",
                    "label": 0
                },
                {
                    "sent": "The Internet vigilanteism is really a question about where the lines between what is a government and what is in our government right?",
                    "label": 0
                },
                {
                    "sent": "What is state and non state?",
                    "label": 0
                },
                {
                    "sent": "You know the fact that her her life with the University got brought in and eventually also her employment?",
                    "label": 0
                },
                {
                    "sent": "You know suddenly she found out boundaries between work and personal life are broken down.",
                    "label": 0
                },
                {
                    "sent": "Yeah, social media turn into published media.",
                    "label": 0
                },
                {
                    "sent": "What is actually is a Blogger or journalist, you know, did it really become news when it was published in his soul papers and walked in Washington Post?",
                    "label": 0
                },
                {
                    "sent": "Or was it actually protected in some way as to source back when it was published under blogs by the anonymous posters local Versus Global?",
                    "label": 0
                },
                {
                    "sent": "Something that happened in Seoul suddenly is being reported in Washington Post and the Shades will start.",
                    "label": 0
                },
                {
                    "sent": "The residences will start becoming clear.",
                    "label": 0
                },
                {
                    "sent": "Two things that are happening.",
                    "label": 0
                },
                {
                    "sent": "In the Arab countries right now, when you start looking at authoritarian, you know boundaries versus Democratic boundaries, right?",
                    "label": 0
                },
                {
                    "sent": "I won't get into that right now, but.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The result is you start thinking Oh my gosh with all these boundaries slipping is like the block.",
                    "label": 0
                },
                {
                    "sent": "This is a movie that was American moving in 1950s about a blob that would just consume things and it was remade in 1999.",
                    "label": 0
                },
                {
                    "sent": "I would argue 10 years too soon.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So why is this all important for this audience?",
                    "label": 0
                },
                {
                    "sent": "Well, because we've got a new invention.",
                    "label": 0
                },
                {
                    "sent": "Semantic web or from calling adventure?",
                    "label": 0
                },
                {
                    "sent": "Right, and I think just being covered in a few of the talks.",
                    "label": 0
                },
                {
                    "sent": "You know, just what is the business model of the semantic Web and to what extent is the semantic Web Part of the world that we live in, right?",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I would say that it's very much right here now.",
                    "label": 0
                },
                {
                    "sent": "We have finally in the last year or two discovered the business model to semantic web.",
                    "label": 0
                },
                {
                    "sent": "People refer to it as big Data.",
                    "label": 0
                },
                {
                    "sent": "And we also have to take notice as an aside that alive Vance, Munts in knowledge discovery and data mining technologies in the past half decade also contribute as inventions to his news or a boundary that privacy needs to.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Joy.",
                    "label": 0
                },
                {
                    "sent": "So the the unprecedented amount of data is changing our view.",
                    "label": 0
                },
                {
                    "sent": "Of how to actually conduct science?",
                    "label": 0
                },
                {
                    "sent": "Even Wired magazine went so far as to say science is over.",
                    "label": 0
                },
                {
                    "sent": "It's just about data.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "And there are people out there who are claiming that the more data you have.",
                    "label": 0
                },
                {
                    "sent": "You don't even need the algorithms anymore, right?",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Explosion in data is clear.",
                    "label": 0
                },
                {
                    "sent": "Everybody in this room knows about these types of of predictions.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "But ultimately it's really about cost.",
                    "label": 0
                },
                {
                    "sent": "In fact there is.",
                    "label": 0
                },
                {
                    "sent": "The world is getting cheaper and cheaper for all of you to do what you all need to do and want to do right.",
                    "label": 0
                },
                {
                    "sent": "Costa memories dropped dramatically over the last decade across the processing powers are just dropped right?",
                    "label": 0
                },
                {
                    "sent": "It's gotten to a point where.",
                    "label": 0
                },
                {
                    "sent": "The home page for world's business leaders, forbes.com, would publish an article that says, here's how to build a data startup.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In case you couldn't read the fine print, you need a hustler, a designer and a proton ear.",
                    "label": 0
                },
                {
                    "sent": "Our assumed a prod and ear is referring to all of you.",
                    "label": 0
                },
                {
                    "sent": "You need somebody who can do the engineering with the data.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now it's quite a sharp contrast to what was last century.",
                    "label": 0
                },
                {
                    "sent": "It took deleting database marketing companies half a decade to take a census data that was produced in 1970 census in the US and actually be able to match and match it with enough data to understand the demographics of 50% of the households.",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                },
                {
                    "sent": "Alright, so?",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now with PC's and mobile devices in amount of streaming data that's created.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we're talking about lots of stars being able to be born fairly quickly, and audience science has been around for awhile.",
                    "label": 0
                },
                {
                    "sent": "They used to be called revenue science, and they're much more over traditional database marketing type firm that tries to segment you according to what you read on line just starting.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But right behind it now just in the last couple of years we've got clear site Interactive, their matching demographic data to IP address is 200.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In plus of them you've got blue Cava who's matching data to unique device ID's under 25,000,000.",
                    "label": 0
                },
                {
                    "sent": "That I could find him short of growing.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Play you got Blue Kai, who's matching shopping activity of a particular user with that same users media consumption?",
                    "label": 0
                },
                {
                    "sent": "So if any of you are surfing news sites right now is still seeing ads for a vacation in Greece.",
                    "label": 0
                },
                {
                    "sent": "There are partly responsible, right?",
                    "label": 0
                },
                {
                    "sent": "If you saw a handbag in a store and he keeps you that same handbag advertised to you.",
                    "label": 0
                },
                {
                    "sent": "You know two days later at the newyorktimes.com.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Responsible for that.",
                    "label": 0
                },
                {
                    "sent": "Epsilon Abacus.",
                    "label": 0
                },
                {
                    "sent": "They just recently had a huge data breach with their email database.",
                    "label": 0
                },
                {
                    "sent": "They're matching the online information with the offline information.",
                    "label": 0
                },
                {
                    "sent": "Alright, so it's beginning to traverse boundaries on.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Online, offline, right?",
                    "label": 0
                },
                {
                    "sent": "And then you've got people like targets.",
                    "label": 0
                },
                {
                    "sent": "Also matching offline data.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Online presence you've got people like Brillig.",
                    "label": 1
                },
                {
                    "sent": "They'll who are trying to create platforms which they say we're open to anybody's day to just bring it to us will help you.",
                    "label": 0
                },
                {
                    "sent": "Just mash it up and will help you meet other people who might want to.",
                    "label": 0
                },
                {
                    "sent": "You know, exchange your date.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With you.",
                    "label": 0
                },
                {
                    "sent": "Alright, you've got sense.",
                    "label": 0
                },
                {
                    "sent": "Networks which indexes real-world habits.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, he got people now looking at other types of data and privacy issues become more and more pronounced, right?",
                    "label": 0
                },
                {
                    "sent": "So you've got ingenic switches looking at prescription drug history and trying to match that to health Ben.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fence.",
                    "label": 0
                },
                {
                    "sent": "Any got facial recognition technology which starts pre staging the world that Spielberg showed in minor report.",
                    "label": 0
                },
                {
                    "sent": "You know walking into a shopping mall and having the advertising speak directly to you based on recognizing it so the privacy issues.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Becoming a little more clear, you know this is the world online today, right of where advertisers and publishers are.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is where they're getting all their data.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now today.",
                    "label": 0
                },
                {
                    "sent": "The legislators have focused on personally identifiable information.",
                    "label": 0
                },
                {
                    "sent": "Right, and they've kind of touched upon tracking.",
                    "label": 0
                },
                {
                    "sent": "It's enough to make your head spin so much that they're just holding on to something that they can actually legislate about.",
                    "label": 0
                },
                {
                    "sent": "That's understandable because their technology is gone way ahead and they can't keep up right.",
                    "label": 0
                },
                {
                    "sent": "But the laws have largely talked about privacy from an economic rights point of view, and all of those startups or illustrate that right?",
                    "label": 0
                },
                {
                    "sent": "Those are the companies they seem to want to regulate.",
                    "label": 0
                },
                {
                    "sent": "But when we talk about privacy and the harm, we really talk about in terms of a trespass, right?",
                    "label": 0
                },
                {
                    "sent": "So there's this dissonance that's going on right now.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And when you actually get courts looking at whether the laws that have been enacted should be enforced, they really have a trouble doing it.",
                    "label": 0
                },
                {
                    "sent": "You know, because oftentimes they can't find the economic injury.",
                    "label": 0
                },
                {
                    "sent": "So here specific media was sued by a class action that was claiming its use of flash cookies, or some people call them zombie cookies because they were able to survive deletions of cookie deletions and browsers.",
                    "label": 0
                },
                {
                    "sent": "Caused economic injury, right?",
                    "label": 0
                },
                {
                    "sent": "That was what the plaintiffs claim.",
                    "label": 0
                },
                {
                    "sent": "But the judge couldn't find it.",
                    "label": 0
                },
                {
                    "sent": "And the plane's couldn't articulate an injury sufficiently well that the judge bought into it.",
                    "label": 0
                },
                {
                    "sent": "In fact, the judge went so far as to say you guys even having even met on an aggregate basis, we're talking bout a class action, which theoretically would be every single users as encounter specific media ad online, that all of you guys probably couldn't add up to more than five grand of injury.",
                    "label": 0
                },
                {
                    "sent": "So you're through to KSA.",
                    "label": 0
                },
                {
                    "sent": "Now security breaches like the Sony breach and everything else that the courts have been able to understand, and they have been able to enforce that because again, it touches upon something that we feel in terms of privacy, right?",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what's happened is some of the legal theorists have started moving, pushing the boundaries, pushing, pushing the theory that you know what this is not about personally identifiable information.",
                    "label": 0
                },
                {
                    "sent": "This is not just about economic rights.",
                    "label": 0
                },
                {
                    "sent": "This is really about protecting people against not PII, but PE.",
                    "label": 0
                },
                {
                    "sent": "I personally embarrassing information, right?",
                    "label": 0
                },
                {
                    "sent": "They point to things like the data Valdez is right playing on the Exxon Valdez moniker.",
                    "label": 0
                },
                {
                    "sent": "You know, they talk about how.",
                    "label": 0
                },
                {
                    "sent": "Companies will set up, you know, wonderful offerings and then change their business terms.",
                    "label": 0
                },
                {
                    "sent": "You know, in order to be able to capitalize and exploit on on the data they've collected, they point to DND anonymization of data sets, right?",
                    "label": 0
                },
                {
                    "sent": "And ultimately they they talk about things like a database of Doom.",
                    "label": 0
                },
                {
                    "sent": "They paint this picture that somehow out there there is PR people who hold on to data.",
                    "label": 0
                },
                {
                    "sent": "They are so sensitive that they could destroy your life if the wrong people learned of those things.",
                    "label": 0
                },
                {
                    "sent": "So they're not talking about economic loss anymore, not so much as they're talking about.",
                    "label": 0
                },
                {
                    "sent": "You know this right to be left alone, and that's how we're beginning to frame it.",
                    "label": 0
                },
                {
                    "sent": "And they're scaring the legislatures.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and that's the reason why we start having all of these these laws that are taking what one professor is called the privacy precautionary principle.",
                    "label": 0
                },
                {
                    "sent": "It's like a proactive approach.",
                    "label": 0
                },
                {
                    "sent": "It's not a reactive approach anymore.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so you had this.",
                    "label": 0
                },
                {
                    "sent": "You have course that will say you know what we're going to enforce.",
                    "label": 0
                },
                {
                    "sent": "Against a California retailer, you know the fact that they ask for a zip code?",
                    "label": 0
                },
                {
                    "sent": "So williams-sonoma.",
                    "label": 0
                },
                {
                    "sent": "Whenever you go up in this and they sell kitchen type products whenever you go up and buy something, he's a credit card just just to store clinical asking what's your zip code?",
                    "label": 0
                },
                {
                    "sent": "And under California law stores are not allowed to ask for personally personally identifiable information.",
                    "label": 0
                },
                {
                    "sent": "And what the lawyers have been able to convince this California Court was a ZIP code is personally identifiable information.",
                    "label": 0
                },
                {
                    "sent": "Now, of course matched with name on the credit card.",
                    "label": 0
                },
                {
                    "sent": "It can be.",
                    "label": 0
                },
                {
                    "sent": "It can lead you to find the address, and certainly it is something that that that is arguably personally identifiable information by inference, right?",
                    "label": 0
                },
                {
                    "sent": "So by matching.",
                    "label": 0
                },
                {
                    "sent": "But here you know, it's into what's interesting is the lawyers are painting the picture of discomfort that people feel when they are asked to zip code information.",
                    "label": 0
                },
                {
                    "sent": "Well, that's that's, that's really the harm that you're protecting against.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so in in a leading paper, has become very influential, called the broken promise of privacy.",
                    "label": 0
                },
                {
                    "sent": "Palome, who actually coined the database of Doom or anchor, you know, has sought legislators to take this approach.",
                    "label": 0
                },
                {
                    "sent": "To take this precautionary propose, and what he does is he actually points to three easy re identification suitcases that probably a lot of you know about already.",
                    "label": 0
                },
                {
                    "sent": "You know the AOL situation and I'll talk about all three of them just briefly.",
                    "label": 0
                },
                {
                    "sent": "As evidence of why this is necessary, why it isn't legislatures need to actually force companies to regulate private information?",
                    "label": 0
                },
                {
                    "sent": "Personally identifiable information just as much as they have to regulate non personally identifiable.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nation alright so.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "AOL, the first case released search histories.",
                    "label": 0
                },
                {
                    "sent": "Now what's really important?",
                    "label": 0
                },
                {
                    "sent": "Point out here is it was to embrace the vision of open research.",
                    "label": 1
                },
                {
                    "sent": "That's something that must touch the heart of every person in this room, right?",
                    "label": 0
                },
                {
                    "sent": "So AOL in 2006.",
                    "label": 1
                },
                {
                    "sent": "Publicly posted 20,000,000 search queries.",
                    "label": 1
                },
                {
                    "sent": "Sample 650,000 users covering about three months of activity.",
                    "label": 0
                },
                {
                    "sent": "They deleted everything that they thought was personally identifiable information.",
                    "label": 0
                },
                {
                    "sent": "Now at the time under US law, IP addresses wouldn't be considered PII, but they deleted PIA.",
                    "label": 0
                },
                {
                    "sent": "the IP addresses as well.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These are some of the search histories our store.",
                    "label": 1
                },
                {
                    "sent": "These are the kinds of examples are used by Paula Home and others.",
                    "label": 0
                },
                {
                    "sent": "How do you tell your family you're a victim of incest?",
                    "label": 0
                },
                {
                    "sent": "How to kill your wife?",
                    "label": 0
                },
                {
                    "sent": "Depression medical leave.",
                    "label": 0
                },
                {
                    "sent": "You know, clearly sensitive subject matters that people are searching for.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What happened was a couple of very resourceful New York Times reporters were very quickly able to track down one of the users.",
                    "label": 0
                },
                {
                    "sent": "They found Thelma Arnold, 62 years old widow from Georgia.",
                    "label": 0
                },
                {
                    "sent": "And when they confronted her with what they believed to be her search results, you said, yes, you're right.",
                    "label": 0
                },
                {
                    "sent": "These are my search results.",
                    "label": 0
                },
                {
                    "sent": "Numb fingers 60 single men dog that urinates on everything that became the caption for many many stories about this.",
                    "label": 0
                },
                {
                    "sent": "Now here this is being raised as an example of the failure of.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anonymisation just move on to the next one.",
                    "label": 0
                },
                {
                    "sent": "Carnegie Mellon Montana Sweeney did a study at the 1990 census data.",
                    "label": 0
                },
                {
                    "sent": "And she found that there's a fair amount of sparsity if you actually only look at gender birthday in a 5 digit zip code to zip code is the provincial code in the US.",
                    "label": 0
                },
                {
                    "sent": "So she found that 87% of the US population could be identified uniquely by these three pieces of information.",
                    "label": 0
                },
                {
                    "sent": "In 2005, another study was done also on the 1990 census data that she used as well as the 2000 census data didn't quite get 87% that she got was still pretty interesting.",
                    "label": 0
                },
                {
                    "sent": "An insignificant number.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She wanted Illustrator points so she picked an example.",
                    "label": 0
                },
                {
                    "sent": "The math is Massachusetts Group Insurance Commission.",
                    "label": 0
                },
                {
                    "sent": "This is the group health Plan of Massachusetts government employees decided to release state employees records.",
                    "label": 0
                },
                {
                    "sent": "Again, I'm going to call out for research purposes.",
                    "label": 0
                },
                {
                    "sent": "They removed names, addresses, Social Security numbers, explicit identifiers, but they kept the zip code to gender and the birthday.",
                    "label": 0
                },
                {
                    "sent": "Right after this release, Governor Weld came out and said publicly don't worry, we've taken all the precautionary steps and of course with.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That challenge Sweeney went to work.",
                    "label": 0
                },
                {
                    "sent": "She purchased some voter rolls and was actually able to match back and find the governor's own medical records.",
                    "label": 0
                },
                {
                    "sent": "And with that disclosed to the public, in fact, I think she only sent you to the office.",
                    "label": 0
                },
                {
                    "sent": "She didn't disclose it in public, but she just goes to prove that she did send to the office his diagnosis and prescription medicine.",
                    "label": 0
                },
                {
                    "sent": "So clearly very personal information, something that is should be covered by privacy law.",
                    "label": 0
                },
                {
                    "sent": "But again, you know this is being used as an example for failure of animals anonymous.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Session last example.",
                    "label": 0
                },
                {
                    "sent": "Netflix did Netflix challenge.",
                    "label": 0
                },
                {
                    "sent": "So this has led to, I think, a bounty of learning in the data mining field.",
                    "label": 0
                },
                {
                    "sent": "They released 100 million records covering 500,000 users spanning a few years.",
                    "label": 0
                },
                {
                    "sent": "All they released with movie titles and ratings.",
                    "label": 0
                },
                {
                    "sent": "That's it.",
                    "label": 0
                },
                {
                    "sent": "And today to ratings.",
                    "label": 0
                },
                {
                    "sent": "So today today.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Point only took two University professors 2 weeks.",
                    "label": 0
                },
                {
                    "sent": "To actually match.",
                    "label": 0
                },
                {
                    "sent": "That database back to two individuals and what they did was they just matched the ratings of particular movies.",
                    "label": 0
                },
                {
                    "sent": "Watched two ratings that those same individuals posted up at IMDb, which was a public data set that they scraped.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now what was interesting was in this very very huge data set and I might point out it would have to be a very large data set.",
                    "label": 0
                },
                {
                    "sent": "They did find that 99% of subscribers can be uniquely identified by knowing only eight movie ratings.",
                    "label": 0
                },
                {
                    "sent": "And the dates of those ratings.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're actually impressed me more was the next point that they found, which is 84% of subscribers can be uniquely identified by their long tail movie habits, right?",
                    "label": 1
                },
                {
                    "sent": "So these are the movies that are not within the top 500, right?",
                    "label": 0
                },
                {
                    "sent": "You get a lesser percent of identification if you go with only the top 100.",
                    "label": 0
                },
                {
                    "sent": "But still, it's impressive.",
                    "label": 0
                },
                {
                    "sent": "So this would actually scare me.",
                    "label": 0
                },
                {
                    "sent": "I look at this and say, Gee, we've got lots and lots of cookies out there tracking my media consumption.",
                    "label": 0
                },
                {
                    "sent": "What I read online.",
                    "label": 0
                },
                {
                    "sent": "An If I could be matched back.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is, that's very concerning.",
                    "label": 0
                },
                {
                    "sent": "And of course, if you look at the current day, these are all historical examples.",
                    "label": 0
                },
                {
                    "sent": "There's still with us, right?",
                    "label": 0
                },
                {
                    "sent": "The Netflix suit is actually only comedy trial.",
                    "label": 0
                },
                {
                    "sent": "There's a class action about that release.",
                    "label": 0
                },
                {
                    "sent": "It's only come to trial in November of this year.",
                    "label": 0
                },
                {
                    "sent": "And you've got a federal grand jury investigation Pandora?",
                    "label": 0
                },
                {
                    "sent": "Why?",
                    "label": 0
                },
                {
                    "sent": "Because they shared birthday, gender and GPS, which of course could be wind too.",
                    "label": 0
                },
                {
                    "sent": "Probably home location with advertising companies.",
                    "label": 0
                },
                {
                    "sent": "Anna, you objected to Yahoo changing their search data retention periods and they really slammed all three of the big US search engines about not meeting the deanonymization requirements.",
                    "label": 0
                },
                {
                    "sent": "Alright, and Netflix as I said, was was sued on the class action there, but it's also been sued recently for retaining movie viewing and rental habits.",
                    "label": 0
                },
                {
                    "sent": "And ratings even after somebody cancels their subscription.",
                    "label": 0
                },
                {
                    "sent": "Now the question though is these.",
                    "label": 0
                },
                {
                    "sent": "Are these are very real.",
                    "label": 0
                },
                {
                    "sent": "World cases and there are laws out there that are being invoked that actually support these cases were active actions, but how real order harms?",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in fact there are quite powerful animalization.",
                    "label": 0
                },
                {
                    "sent": "Techniques out there.",
                    "label": 0
                },
                {
                    "sent": "They are available if they are used correctly.",
                    "label": 0
                },
                {
                    "sent": "I mean, in in the first 2 examples one would argue that it wasn't an issue of.",
                    "label": 0
                },
                {
                    "sent": "A threat of easy you know re identification.",
                    "label": 0
                },
                {
                    "sent": "It was a fact that the anonymization was actually applied incorrectly, and Sweeney certainly based on having done that study, was able to develop Takei anonymity out of it.",
                    "label": 0
                },
                {
                    "sent": "So there was a benefit that came out of that exercise.",
                    "label": 0
                },
                {
                    "sent": "So I'm not going to go into these, but I'd like to.",
                    "label": 0
                },
                {
                    "sent": "I'd like to.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sort of moved into kind of the message.",
                    "label": 0
                },
                {
                    "sent": "I would like to bring to this group.",
                    "label": 0
                },
                {
                    "sent": "The reason I titled the talk to pirated I was because in my mind I was trying to find a conceptual relationship between the regulation of the Internet with what I thought was to close this analogy though, which is the regulation in the high seas right?",
                    "label": 0
                },
                {
                    "sent": "The oceans?",
                    "label": 0
                },
                {
                    "sent": "The ones that really and what we're talking about is we're talking about this area here, right?",
                    "label": 0
                },
                {
                    "sent": "International waters, there really exists beyond the governance of any particular jurisdiction, any particular country.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And when I went back and looked at how the laws around piracy for grew up and and then I found that the history of it leads to this guy.",
                    "label": 0
                },
                {
                    "sent": "He will grow tedious.",
                    "label": 0
                },
                {
                    "sent": "And what's ironic is he was a lawyer that was hired by the then newly formed Dutch East India Company.",
                    "label": 0
                },
                {
                    "sent": "Which was looking to establish trade with the Asian Asian countries.",
                    "label": 0
                },
                {
                    "sent": "And and he was hired because on one of their trips.",
                    "label": 0
                },
                {
                    "sent": "They actually captured a Portuguese merchant galleon and more merchant ship.",
                    "label": 0
                },
                {
                    "sent": "And that was at a time when Spain and Portugal were monopolizing Asian trade.",
                    "label": 0
                },
                {
                    "sent": "So Gradius was hired essentially to write a polemic.",
                    "label": 0
                },
                {
                    "sent": "He was hired to write something that said and this is what he came up with.",
                    "label": 0
                },
                {
                    "sent": "The Law of nations really dictates the navigation should be free.",
                    "label": 0
                },
                {
                    "sent": "To all persons whatsoever, that every nation should be able to use the waters of the Earth which to trade.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he came up with an argument for this freedom of seas.",
                    "label": 0
                },
                {
                    "sent": "It's best syllogistic, but it works.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I felt that in some ways this echoed what many of us feel, or many people feel about the web.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That an here's somebody who feels very strongly about it wanted to Co founders, Electronic Frontier Foundation John Perry Barlow.",
                    "label": 0
                },
                {
                    "sent": "His words actually very much resonating.",
                    "label": 0
                },
                {
                    "sent": "Shared the same tone as Brody's words about the oceans.",
                    "label": 0
                },
                {
                    "sent": "Right cyberspace consists of transactions relationships, thought, you know we should all be allowed to enter.",
                    "label": 0
                },
                {
                    "sent": "Right, we should be able to do so without being coerced into silence without being coerced into conformity.",
                    "label": 1
                },
                {
                    "sent": "This is about the right of choice, right?",
                    "label": 0
                },
                {
                    "sent": "We should be able to inform that there is an ethic and enlightened self interest as foreign to develop.",
                    "label": 0
                },
                {
                    "sent": "Lessig talks about how the code is ultimately going to prevail as the legal regime within the Internet space.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that and so separate governance from the kinds of governance that countries develop will come into being.",
                    "label": 0
                },
                {
                    "sent": "Now this was very much in the news recently with the G8.",
                    "label": 0
                },
                {
                    "sent": "So you have.",
                    "label": 0
                },
                {
                    "sent": "Here you have Sarkozy and Merkel meeting with Maurice Levy, chief executive of Publicis.",
                    "label": 0
                },
                {
                    "sent": "And you course recognized Zuckerberg.",
                    "label": 0
                },
                {
                    "sent": "I'm sure an Eric Schmidt.",
                    "label": 0
                },
                {
                    "sent": "Alright, and Sarkozy set up the GA, which is being kind of referred to as the ECJ.",
                    "label": 0
                },
                {
                    "sent": "As a place to deal with the Internet because his feeling is is so much part of public life, it needs to be regulated.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any invited all the leaders of the leading businesses to come and speak, and they went with the mission.",
                    "label": 0
                },
                {
                    "sent": "And their mission was very simple.",
                    "label": 0
                },
                {
                    "sent": "Their mission was to say no.",
                    "label": 0
                },
                {
                    "sent": "Keep it open.",
                    "label": 0
                },
                {
                    "sent": "If you start regulating the Internet, you're going to stifle innovation.",
                    "label": 0
                },
                {
                    "sent": "You're going to stifle discourse.",
                    "label": 0
                },
                {
                    "sent": "And Mark Zuckerberg refers to, you know, speaks here about the fact that you know Facebook has had a great instrumental.",
                    "label": 0
                },
                {
                    "sent": "I don't know how much cause and effect, but certainly a a role in the Arab uprisings.",
                    "label": 0
                },
                {
                    "sent": "And you can't have both.",
                    "label": 0
                },
                {
                    "sent": "This was his messages.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this is this correct cognitive dissonance coming in for that.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In and the question then is, who's really the pirate here?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "And what are Pirates all about?",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Because when you go back to this chart this this slide and you think about the fact that we live in a world with all these verses.",
                    "label": 0
                },
                {
                    "sent": "And the problem in part is those verses are disappearing and the seamlessness is creating this kind of cognitive dissonance.",
                    "label": 0
                },
                {
                    "sent": "Maybe the best.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Way to think about things is uncharted.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, and the question would be to what extent?",
                    "label": 0
                },
                {
                    "sent": "To keep punning on the piracy.",
                    "label": 0
                },
                {
                    "sent": "Should we be battening down the hatches?",
                    "label": 0
                },
                {
                    "sent": "Should we really be battening down the hatches?",
                    "label": 0
                },
                {
                    "sent": "Does it help anything to discredit anonymization?",
                    "label": 0
                },
                {
                    "sent": "Now do we want to advocate a total opt in?",
                    "label": 0
                },
                {
                    "sent": "Consent model of privacy precautionary principle should that really leave?",
                    "label": 0
                },
                {
                    "sent": "Should we be challenging these kinds of uses?",
                    "label": 0
                },
                {
                    "sent": "Right and large has an example of how to use Facebook data to track flu.",
                    "label": 0
                },
                {
                    "sent": "This is revolutionary.",
                    "label": 0
                },
                {
                    "sent": "But the only way that this can work is if they use the data of everybody.",
                    "label": 0
                },
                {
                    "sent": "Who searches for flu in Google?",
                    "label": 0
                },
                {
                    "sent": "They can't just seem right.",
                    "label": 0
                },
                {
                    "sent": "It has to be everybody.",
                    "label": 0
                },
                {
                    "sent": "So you can't have an opt in.",
                    "label": 0
                },
                {
                    "sent": "And still be able to have these kinds of tools and find these kinds of tools so you know the kind of problem is where does it end if you start pursuing these privacy precautionary approaches, you know, and as a kind of start ironically feeling like if you're trying to protect privacy really ending up with more of an Orwellian world.",
                    "label": 0
                },
                {
                    "sent": "Hell.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An you think about privacy and censorship or fairly related concepts?",
                    "label": 0
                },
                {
                    "sent": "You know you start thinking about places like China where they can so easily shut down anybody.",
                    "label": 0
                },
                {
                    "sent": "Right, who tweets?",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And when?",
                    "label": 0
                },
                {
                    "sent": "The user stay one step ahead and they start tweeting about the empty Chan instead of actually using Lu's name.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "They start airbrushing the empty chair out of the photos.",
                    "label": 1
                },
                {
                    "sent": "In eliminating from the search engines.",
                    "label": 0
                },
                {
                    "sent": "And I feel like this in some ways is analogous to the same kinds that this is the possible end in effect of the same kind of censorship of data that might happen if we impose overly strict privacy regulations.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the problem really is that the greatest victim of privacy regulation is probably not Facebook and Google or any of those startup businesses.",
                    "label": 0
                },
                {
                    "sent": "I showed you before.",
                    "label": 0
                },
                {
                    "sent": "It may in fact be science.",
                    "label": 0
                },
                {
                    "sent": "And this is probably the biggest concern.",
                    "label": 0
                },
                {
                    "sent": "That the legal theorists should be debating at this time.",
                    "label": 0
                },
                {
                    "sent": "Thankfully there are few law professors out there.",
                    "label": 0
                },
                {
                    "sent": "We're focusing on it.",
                    "label": 0
                },
                {
                    "sent": "Jane Jackovitz, who's with Brooklyn Law School, just wrote a paper two months ago.",
                    "label": 0
                },
                {
                    "sent": "You know, I was in Ghana and I gave a very similar presentation and this in the presentation I gave in Ghana was much more slanted too.",
                    "label": 0
                },
                {
                    "sent": "Here's what you should be afraid of, right?",
                    "label": 0
                },
                {
                    "sent": "You have an opportunity in Ghana to kind of start the Internet and create a structure that might work and be open.",
                    "label": 0
                },
                {
                    "sent": "But be afraid that you have to protect against these things and I walked away.",
                    "label": 0
                },
                {
                    "sent": "And I thought, Gee, you know, was that the right message and one of the professors that was in the audience asked me so with all of these very fearful things, you've shown us, you know what should we do?",
                    "label": 0
                },
                {
                    "sent": "And my answer to him was ignore me because what you should do is you should embrace the data because only through learning from the data will you actually figure out what the future of the Internet in Ghana is.",
                    "label": 0
                },
                {
                    "sent": "Alright, I'm here to tell you.",
                    "label": 0
                },
                {
                    "sent": "Sorry, cautionary tales.",
                    "label": 0
                },
                {
                    "sent": "And so she was sensitized to what could happen to individuals where we are freedoms can be impinged where where but.",
                    "label": 0
                },
                {
                    "sent": "Really from your.",
                    "label": 0
                },
                {
                    "sent": "Purpose where you come from, what you should do is pursue the science.",
                    "label": 0
                },
                {
                    "sent": "With Jane Jackovitz, you know worries about is that as these privacy regulations come down and all of the fear gets created.",
                    "label": 0
                },
                {
                    "sent": "We will end up with the tragedy of data comments.",
                    "label": 0
                },
                {
                    "sent": "'cause every individual who is offered the opportunity to opt in is going to say love reading this article.",
                    "label": 0
                },
                {
                    "sent": "This newspaper.",
                    "label": 0
                },
                {
                    "sent": "Love using Facebook?",
                    "label": 0
                },
                {
                    "sent": "Love hooking up with my friends, but I'm going to opt out.",
                    "label": 0
                },
                {
                    "sent": "And as a result, we're going to actually.",
                    "label": 0
                },
                {
                    "sent": "We generate that this sort of collective benefit that we could get from the data is going to generate overtime, a classic tragedy Commons issue.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so.",
                    "label": 0
                },
                {
                    "sent": "You know, I don't think we've seen the end of science.",
                    "label": 0
                },
                {
                    "sent": "And you know where we really are is with that kind of the costs coming down and the access to data being so available.",
                    "label": 0
                },
                {
                    "sent": "You know we're at a place where we can actually create a new age, right?",
                    "label": 0
                },
                {
                    "sent": "A new age of science.",
                    "label": 0
                },
                {
                    "sent": "And what we worry about is we don't want.",
                    "label": 0
                },
                {
                    "sent": "The legs get ahead of the body.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK and so out.",
                    "label": 0
                },
                {
                    "sent": "The last words I'll leave you with or from Eric Schmidt.",
                    "label": 0
                },
                {
                    "sent": "Who says?",
                    "label": 0
                },
                {
                    "sent": "Technology will move faster than governments.",
                    "label": 0
                },
                {
                    "sent": "Don't legislate before you understand the consequences.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the last slide, I'll leave you with properly, I hope is Tim Berners Lee's statement that they will build privacy into semantic web.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "So I had an interesting experience with a classroom full of college students recently where I presented to them much about the amount of information Google has on them.",
                    "label": 0
                },
                {
                    "sent": "How it works.",
                    "label": 0
                },
                {
                    "sent": "You know, little video that someone had made, which was kind of a humorous version of Google, will own the world data wise an ask them to write a little, you know, one pager on it.",
                    "label": 0
                },
                {
                    "sent": "An 29 out of 30 of them said I don't care the service they offered me.",
                    "label": 0
                },
                {
                    "sent": "Exceeds the value of my personal information.",
                    "label": 0
                },
                {
                    "sent": "Now I don't know if that's just 'cause they're young and don't understand yet, or that's a general national thing to literature.",
                    "label": 0
                },
                {
                    "sent": "Is full of that question, but an interesting question that comes up is the legal framework really isn't about tradeoffs in that sense very easily.",
                    "label": 0
                },
                {
                    "sent": "And how do you see us kind of playing?",
                    "label": 0
                },
                {
                    "sent": "The technology game into that sort of world where there's considered a value for.",
                    "label": 0
                },
                {
                    "sent": "The service and the payment is the data you've been doing lots of startup step in trying to create this idea of hiking.",
                    "label": 0
                },
                {
                    "sent": "Barter my personal information right and in every transaction I can use it like a credit card and I think there will be some startups that will actually succeed.",
                    "label": 0
                },
                {
                    "sent": "Esther Dyson was just recently on a panel where that's what she's excited about and she's investing.",
                    "label": 0
                },
                {
                    "sent": "She's a very successful Angel investor an she is investing in startups are exactly doing that.",
                    "label": 0
                },
                {
                    "sent": "How do I give this technology so that the individual user now has the power?",
                    "label": 0
                },
                {
                    "sent": "To be able to control how their information use and it starts with understanding, you know, once being used for.",
                    "label": 0
                },
                {
                    "sent": "So there's some transparency that needs to come into place and but really, the problem ultimately is that the Internet is created out of network effect.",
                    "label": 0
                },
                {
                    "sent": "And these startups, as much as they go out with good ideas and good intentions, often fail.",
                    "label": 0
                },
                {
                    "sent": "Because it's just so much easier to grow so much more quickly when you can actually just get data from all over and cross and comingle data from different people, right?",
                    "label": 0
                },
                {
                    "sent": "And so it's I think it's only a matter of time before the technology gets better enough you know well, so that you can.",
                    "label": 0
                },
                {
                    "sent": "Actually when you go to a site, say you know from some plugin in your browser.",
                    "label": 0
                },
                {
                    "sent": "This is what's going on.",
                    "label": 0
                },
                {
                    "sent": "This began to happen.",
                    "label": 0
                },
                {
                    "sent": "And when people start getting used to know, seeing that little window, you know things like Ghostory as a plugin for Firefox and start seeing that window and then go St takes that next step.",
                    "label": 0
                },
                {
                    "sent": "Now they've got the adoption and say here this is what your choices are.",
                    "label": 0
                },
                {
                    "sent": "Then we start getting into a place where I think a true barter economy can work.",
                    "label": 0
                },
                {
                    "sent": "Now the course have been very quick to pick up on that, right?",
                    "label": 0
                },
                {
                    "sent": "So they didn't they didn't.",
                    "label": 0
                },
                {
                    "sent": "They threw out the specific media case right?",
                    "label": 0
                },
                {
                    "sent": "But they did allow the case against Rock You Rock You is one of these social networks where you give personal information and then they give you the ability to share media with other people and Rock You frankly didn't spend enough money, didn't actually put the right by security in place to protect that information, and the court was very quick to say.",
                    "label": 0
                },
                {
                    "sent": "You know what?",
                    "label": 0
                },
                {
                    "sent": "You broke the bargain and also you know once those kinds of laws start getting sorted out.",
                    "label": 0
                },
                {
                    "sent": "I do think there is an opening for that kind of approach.",
                    "label": 0
                },
                {
                    "sent": "I don't know that that was much of a devil's advocate question.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your talk.",
                    "label": 0
                },
                {
                    "sent": "It's really a very good talk.",
                    "label": 0
                },
                {
                    "sent": "And what I was thinking that there are all these kind of self controlling mechanisms in the Internet, for example Reddit where you can.",
                    "label": 0
                },
                {
                    "sent": "Rate also, for example, read it.",
                    "label": 0
                },
                {
                    "sent": "Then you can just rate the new stuff and people actually can control and see if somebody is actually advocating their own thing and can control against that.",
                    "label": 0
                },
                {
                    "sent": "So do you think and using those sub controlling mechanisms that we could also contribute you to privacy and fairness on the Internet?",
                    "label": 0
                },
                {
                    "sent": "Yes, I'm sorry.",
                    "label": 0
                },
                {
                    "sent": "So do you?",
                    "label": 0
                },
                {
                    "sent": "Do you?",
                    "label": 0
                },
                {
                    "sent": "What do you think about that?",
                    "label": 0
                },
                {
                    "sent": "Do you think that could work to make the Internet more secure?",
                    "label": 0
                },
                {
                    "sent": "More like I respect privacy.",
                    "label": 0
                },
                {
                    "sent": "You know this talk.",
                    "label": 0
                },
                {
                    "sent": "This talk was about privacy.",
                    "label": 0
                },
                {
                    "sent": "There are other issues that are sort of peripheral to privacy that actually worrying me more right?",
                    "label": 0
                },
                {
                    "sent": "I worry more that if you don't have enough of the kinds of services like read it, right?",
                    "label": 0
                },
                {
                    "sent": "The hat.",
                    "label": 0
                },
                {
                    "sent": "Google, Facebook and Microsoft and Apple basically control all user data going forward about your media consumption.",
                    "label": 0
                },
                {
                    "sent": "Oh, right, so there's something called.",
                    "label": 0
                },
                {
                    "sent": "There's a book out there called the Master Switch by a professor named Tim Wu.",
                    "label": 0
                },
                {
                    "sent": "And he talks about the history of media and how it becomes monopolies.",
                    "label": 0
                },
                {
                    "sent": "Right, and so you know, I love services like reading because it empowers the individual.",
                    "label": 0
                },
                {
                    "sent": "But ironically, Reddit is owned by Conde Nast, wanted a leading magazine groups.",
                    "label": 0
                },
                {
                    "sent": "Yeah, also to what extent you know is that a worry that we should have.",
                    "label": 0
                },
                {
                    "sent": "The other thing that I don't talk about is the filter bubble right?",
                    "label": 0
                },
                {
                    "sent": "There's a book that just recently got published and there was a very famous Ted Talk that's been traveling all over the Internet about how personalization tools have caused you to more and more narrowly perceive the web.",
                    "label": 0
                },
                {
                    "sent": "Because we only get to see beyond what the web is delivering to you.",
                    "label": 0
                },
                {
                    "sent": "I recommend that Ted Talk where it's too much time to talk about it here, but those are.",
                    "label": 0
                },
                {
                    "sent": "Those are directly linked to privacy as well as their go to right of choice.",
                    "label": 0
                },
                {
                    "sent": "Know who you are.",
                    "label": 0
                },
                {
                    "sent": "Will have to stand up so we see each other.",
                    "label": 0
                },
                {
                    "sent": "Thank you baby for the great talk.",
                    "label": 0
                },
                {
                    "sent": "But at the end of it, I feel confused.",
                    "label": 0
                },
                {
                    "sent": "You mentioned the great very visible case of the dark dark poop girl, Internet vigilantism and then it seemed like you were going to be telling us how to prevent the next ones.",
                    "label": 0
                },
                {
                    "sent": "And then it seemed like you were telling us that we really shouldn't do anything yet at least.",
                    "label": 0
                },
                {
                    "sent": "But would you have suggestions for how to perhaps prevent such next cases?",
                    "label": 0
                },
                {
                    "sent": "Or if not, why?",
                    "label": 0
                },
                {
                    "sent": "The reason why I went through the subway narrative was because I wanted to actually translate privacies issues into something you could feel all the dimensions of it.",
                    "label": 0
                },
                {
                    "sent": "My.",
                    "label": 0
                },
                {
                    "sent": "Anne and the title of the talk.",
                    "label": 0
                },
                {
                    "sent": "If I might go back up to the top, the title of the talk is how privacy can't exist on a law.",
                    "label": 0
                },
                {
                    "sent": "Less semantic web 'cause I do believe there is a place for laws right?",
                    "label": 0
                },
                {
                    "sent": "The place for laws is to honor bargains, to actually protect individuals against, you know, vigilanteism like that, the place where laws is to is to actually protect a security Sony with its breach.",
                    "label": 0
                },
                {
                    "sent": "the Canadian Commissioner came out and said we're going to find the.",
                    "label": 0
                },
                {
                    "sent": "Dickens added these people because if we don't find them, they're not going to pay attention to the fact that they're holding on to precious information.",
                    "label": 0
                },
                {
                    "sent": "So that is an appropriate place where laws should be applied.",
                    "label": 0
                },
                {
                    "sent": "Now when I am worried about is more prescriptive and prophylactic approaches that basically say you know what is dangerous, it's almost like.",
                    "label": 0
                },
                {
                    "sent": "We're worried about all of the gossip in the yellow journalism back in the early 1900s, so we're going to outlaw cameras.",
                    "label": 0
                },
                {
                    "sent": "The law should actually go to the intent in use of the technology.",
                    "label": 0
                },
                {
                    "sent": "Or the failure to uphold a bargain about how the technology is offered, not about the technology itself itself.",
                    "label": 0
                },
                {
                    "sent": "And that's where I hope to end up.",
                    "label": 0
                },
                {
                    "sent": "Thank you, that was before experiences on publishing open content on the Internet, such as Creative Commons media or Open Source Software's Entourage was saying yesterday the bad guys are coming to the link data soon or later from a lower point of view.",
                    "label": 0
                },
                {
                    "sent": "What can we learn from the previous experiences on?",
                    "label": 0
                },
                {
                    "sent": "Sorry I'm having a little trouble hearing you if you hold the Michael closer just the last part.",
                    "label": 0
                },
                {
                    "sent": "She was saying yesterday that the bad guys are coming through the link data soon or later.",
                    "label": 0
                },
                {
                    "sent": "I mean by spamming it or by changing the content by.",
                    "label": 0
                },
                {
                    "sent": "Why are you saying sooner or later the data is just going to get out here refers to the discussion yesterday when the Doctor was saying that bad guys are coming.",
                    "label": 0
                },
                {
                    "sent": "Also to the link data.",
                    "label": 0
                },
                {
                    "sent": "So to the structured part, well, that goes back to you know you do need to have strict laws to deal with people who are actually.",
                    "label": 0
                },
                {
                    "sent": "We're actually misusing the data.",
                    "label": 0
                },
                {
                    "sent": "When the when when bin Laden was was killed by the Seal six group, the Navy SEAL Six team photos were taken and the Obama administration debated back and forth as to whether or not to publish those photos and he decided out of I thought, very dignified reasons, not to publish the photos.",
                    "label": 0
                },
                {
                    "sent": "What was interesting is that the argument on the other side was those photos are going to get out.",
                    "label": 0
                },
                {
                    "sent": "Eventually they will get out.",
                    "label": 0
                },
                {
                    "sent": "So why not be in control of the publication rather than deal with it on a reactionary basis when they get out?",
                    "label": 0
                },
                {
                    "sent": "I think to actually think about to always be worried and think about a future where the bad will happen.",
                    "label": 0
                },
                {
                    "sent": "Is exactly the kind of fears that some of these legal theorists are trying to pose, which is there are bad guys out there, right?",
                    "label": 0
                },
                {
                    "sent": "There are the underground networks of credit cards and they will actually go and hack through systems.",
                    "label": 0
                },
                {
                    "sent": "So it's better if we say to Sony you're not allowed to collect credit cards.",
                    "label": 0
                },
                {
                    "sent": "The use actually examining and considering whether or not Sony A is collected more personal information they should have.",
                    "label": 0
                },
                {
                    "sent": "I don't think that's the way to go.",
                    "label": 0
                },
                {
                    "sent": "I don't know if that answers your question because I'm still not sure I followed it fully.",
                    "label": 0
                },
                {
                    "sent": "But OK, we have to finish now just for the sake of time because we are a little bit over.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Shape.",
                    "label": 0
                },
                {
                    "sent": "Again, I think was a great talk.",
                    "label": 0
                }
            ]
        }
    }
}