{
    "id": "q7sy2hd7uvnhbwgpvf32kkqjaj4eol4z",
    "title": "Outreach demos: targeting the general public with web applications",
    "info": {
        "author": [
            "Nello Cristianini, Department of Engineering Mathematics, University of Bristol"
        ],
        "published": "Feb. 15, 2008",
        "recorded": "January 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Pattern Recognition"
        ]
    },
    "url": "http://videolectures.net/psm08_cristianini_odt/",
    "segmentation": [
        [
            "So now I will talk about.",
            "Targeting the general public with web applications.",
            "Activities.",
            "So this is.",
            "At Allen, should have gone in the challenges section, actually, maybe next year.",
            "We were told out of the blue by the.",
            "Whoever the high level people in the Pascal project that we really should target the general public and.",
            "We are idiot computer scientist.",
            "And we leave, you know, our happy life with.",
            "Our little world of.",
            "Computers and."
        ],
        [
            "Pascal videos and books.",
            "Butter.",
            "We thought that we should be able to communicate what is exciting to us.",
            "Also, two more normal people.",
            "Which came as a complete surprise.",
            "And we thought, aren't we normal people?",
            "So we decided to do the only sensible thing it was."
        ],
        [
            "Saturday night we are doing the usual.",
            "Pump priming activities and doing entertainment and we thought OK, we can talk to the general public so obviously."
        ],
        [
            "We decided to device strategy.",
            "How to reach?"
        ],
        [
            "People.",
            "So the first action obviously unavoidable.",
            "We gathered information and then we came up with a clear understanding that maybe we are not representative of the general population."
        ],
        [
            "The other people out there.",
            "And so we thought.",
            "Let's take this at Globe."
        ],
        [
            "And we did type again the same query.",
            "On a much larger scale, and it turns out yes."
        ],
        [
            "Is there other people around and we actually are pretty?",
            "Isolated type of characters and what is exciting to us perhaps?",
            "Is not exciting to everybody else, so that was difficult, but we came up with various attempts to convey the excitement and the relevance of what we do.",
            "Two people that aren't necessarily spending every single day feeling proposals and stuff like this, and we thought of.",
            "Well.",
            "We do find partners.",
            "These are important.",
            "They make a difference.",
            "A lot of things depend on that.",
            "And yet nobody knows it.",
            "So how do we explain why it's sub some technology actually?",
            "Matters."
        ],
        [
            "So the solution was to identify various types of target audiences and we did it the exercise to decide virus types of people want to talk to colleagues, scientists, industrial people, and end.",
            "The general public, we believe that addressing the general public actually has a series of consequences in terms of reaching decision makers and so on and so forth.",
            "We do have to make the case for what?",
            "We have to explain why what to do is important.",
            "It is our job to explain why it is important, but mostly about explain what we do.",
            "Because if I tell my mother that I found.",
            "I don't know the pagerank of the social network somewhere is.",
            "The metabolic network of a cell has a.",
            "Power low in the rack distribution.",
            "It doesn't much matter much, so we don't work.",
            "It matters in it yet.",
            "We need the last step how to?",
            "Scored a goal."
        ],
        [
            "So here we go.",
            "This is the description of this attempt to spend some time not on producing necessarily new result, but on making sure people know what we do and why it matters and how it works, and make sure that these things is meaningful to the general public.",
            "In the process we also achieved a number of side results that are going to be very important for the next Pascal.",
            "So there's been a series of good news after this project which was not directly a search product.",
            "Bad, so I hope you all.",
            "Started doing outreach projects because it might help you research too.",
            "So we made it a proof of concept.",
            "To the brokerage of expertise, from priming, which is a very short term, small budget type of activity to just.",
            "Do the final step and make some demonstration of technology.",
            "We actually built this on top of a project we had running before about studying the media, assisted the content in the media system, which is also abstract for many people, so we had to.",
            "Build a platform that people can experience."
        ],
        [
            "And this is something already said.",
            "So here we go.",
            "Build a platform.",
            "That can be used as a showcase of new ideas."
        ],
        [
            "So we thought about real domains that matter, something I don't want to be in any way condescending.",
            "I mean, I'm just I've been asking around what could be of interest.",
            "I was listing the patterns I want to showcase, list the algorithms I wanted to demonstrate and try to come up with.",
            "We"
        ],
        [
            "The values.",
            "Domains in which these things can be."
        ],
        [
            "So one thing we did is the website.",
            "It's going to be live in a few weeks.",
            "It just analyzes text from the web, identifies a number of important things, entities, relations and organizes these things into timelines, social networks, and then from the social network gets all the patterns from the graph and so on and so forth.",
            "Essentially does everything I usually do on unlimited Bolick network, just on a social network.",
            "And although somebody may say, well, you know the authority level of.",
            "The.",
            "Lactose operon within the E coli network is very high.",
            "I can tell you that George Clooney is in the same position in the Hollywood Celebrity Network.",
            "It's a very high page rank, authority in the social network.",
            "It's a little bit easier to relate if I have to say the shortest path between David Letterman and George Clooney goes through Britney Spears.",
            "That means something more than just say that's the pathway in bacteria, so it was enjoyable and we didn't have to do much.",
            "We had all the algorithms.",
            "They're good algorithms and the generalized to measurements.",
            "So here is one of the things we did gathering reading there is a poor student news.",
            "He just started in October and his first assignment was to start reading all the possible gossip magazines in the UK in the USA.",
            "He was very surprised and then he started slowly applying software to this and he now apparently the gate expert in Britney Spears that in the Meanwhile has become newsworthy.",
            "So this is one of the things we're doing."
        ],
        [
            "We can explore the.",
            "The user will be able to explore the network and visualize patterns, statistics, quantities, and so on, interact in various ways with the corpus.",
            "That I think is live.",
            "It updates all the time."
        ],
        [
            "See Timelines, Time series analysis, change points.",
            "We can find every sort of thing this is the platform that is going to be expanded overtime."
        ],
        [
            "If you wonder, this is a version of the network, this is the."
        ],
        [
            "Much more connected version depending where you cut.",
            "Right now in this prototype, we're still finishing up the relation extraction system, and by the way, I'm planning to use a planning to test entailment technologies that I enjoyed seeing these days.",
            "This is just a corcorans network.",
            "And you can see Brad Pitt in the network tool in the center of the net."
        ],
        [
            "Hey, this is classical path analysis.",
            "You will do it in a metabolic network in a cell.",
            "How do you go from here to here with the shortest path?",
            "How important is in order from the point of view of controlling the global diameter of the flow of in the network?",
            "And if you want to connect opera with the other means you have to go to Jennifer Hudson.",
            "Unfortunately I don't know much but I'm catching up fast."
        ],
        [
            "Any you can rank people not by frequency of mentions not buy anything just by the connectivity to the social network.",
            "So Brad Pitt is the most connected with this piece.",
            "Apparently is seeing other people very often.",
            "So just to do this, we have to do 45 key steps, getting text, parsing text, statistical analysis, getting entities, Association, mining, subsequence mining.",
            "Graph Analysis Time series analysis.",
            "Geo location.",
            "By the way we do, we just do the full lot.",
            "We do it anyway and it makes sense."
        ],
        [
            "At least, but of course not everybody.",
            "Cares about Hollywood such a life.",
            "I found out also this to Googling around and there are other people who care about that."
        ],
        [
            "So we have the same platform reading about 600 newspapers every six hours, distracting news stories, analyzing news stories.",
            "We machine translated by the way in this case also from Spanish, French and German, and Italian, and again we get a time series clusters."
        ],
        [
            "Dogs Geo location.",
            "So this Heath Ledger relates to United States but also to Australia and all these things are running."
        ],
        [
            "And then we are attending this science watch Tango just to target somebody we understand a bit better.",
            "Maybe if you want to find out.",
            "What's going on in the life Sciences in biology and so on?",
            "This is just reading everything available in terms of possibilities in science, organizing them for you.",
            "This is a bit behind schedule."
        ],
        [
            "So what does it mean?",
            "We made the pipeline.",
            "We made it very large scale platform.",
            "We did the beginning.",
            "In the end it was the boring part and now we play with the middle.",
            "We just stuck to relations which is what we do.",
            "We test algorithms.",
            "We demonstrated them and we really want this to be ready for our showcase activities in July when they had the big conferences.",
            "Why CML?",
            "And when this is running, we're going to try to attack.",
            "Attention in traffic to it.",
            "Hope everybody can help by putting pointers.",
            "The idea is that the more people go there, the more we can analyze their behavior here and then.",
            "Give them back these patterns though, so that I think has a semantic on top of the normal algorithmics.",
            "It taught me a lot in terms of making infrastructure I have been doing theory for a long time and it's nice to learn how you make a large scale project."
        ],
        [
            "And the file.",
            "Questions."
        ],
        [
            "Please.",
            "And that they will be a computer science.",
            "Could be a science, computer science or so, so I know this is intended for the general public.",
            "Also, a fourth year computer scientist, or, you know, might look at it too.",
            "Yeah, it's possible.",
            "We were told in the last review meeting that we kind of succeeded in reaching out to our peers.",
            "We were told that we weren't so good in reaching out to everybody else.",
            "I'm saying is you should add the data.",
            "Yeah, all that is needed at this point took awhile, but now it's now.",
            "It's very easy.",
            "Absolutely next time we meet I can tell you how this is going to go in various directions, but for the moment that's what we did please.",
            "I think that this is a dynamic would be even better to outreach in an Attack Attack attention crisis.",
            "I think that if we had something like a gossip generator then this and that this would be interesting for many, absolutely.",
            "Isn't there something like ethics?",
            "Ethics.",
            "He is a.",
            "About knowing that there are two ways ethics in the sense that.",
            "You want to mine an ethical document database or you want to discuss the ethics of doing research because I like the second topic very much.",
            "Well, I can do one ethical question right now.",
            "You apply celebrity awards.",
            "To your Gmail box, which some people can do today and you get your social network, your Geo location, everything else.",
            "If I missed my Google, I can access everybody's Gmail box, run this algorithm and get everybody's personal life.",
            "Is this not an ethical question?",
            "Yes, but I mean this is not something where we have an active role.",
            "Oh well, I don't know well I like ethics, should discuss it, but the gossip generator.",
            "I think that is your finest thought for the day.",
            "Don't do anything else.",
            "OK, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now I will talk about.",
                    "label": 0
                },
                {
                    "sent": "Targeting the general public with web applications.",
                    "label": 1
                },
                {
                    "sent": "Activities.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "At Allen, should have gone in the challenges section, actually, maybe next year.",
                    "label": 0
                },
                {
                    "sent": "We were told out of the blue by the.",
                    "label": 0
                },
                {
                    "sent": "Whoever the high level people in the Pascal project that we really should target the general public and.",
                    "label": 0
                },
                {
                    "sent": "We are idiot computer scientist.",
                    "label": 0
                },
                {
                    "sent": "And we leave, you know, our happy life with.",
                    "label": 0
                },
                {
                    "sent": "Our little world of.",
                    "label": 0
                },
                {
                    "sent": "Computers and.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pascal videos and books.",
                    "label": 0
                },
                {
                    "sent": "Butter.",
                    "label": 0
                },
                {
                    "sent": "We thought that we should be able to communicate what is exciting to us.",
                    "label": 0
                },
                {
                    "sent": "Also, two more normal people.",
                    "label": 0
                },
                {
                    "sent": "Which came as a complete surprise.",
                    "label": 0
                },
                {
                    "sent": "And we thought, aren't we normal people?",
                    "label": 0
                },
                {
                    "sent": "So we decided to do the only sensible thing it was.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Saturday night we are doing the usual.",
                    "label": 0
                },
                {
                    "sent": "Pump priming activities and doing entertainment and we thought OK, we can talk to the general public so obviously.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We decided to device strategy.",
                    "label": 0
                },
                {
                    "sent": "How to reach?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "People.",
                    "label": 0
                },
                {
                    "sent": "So the first action obviously unavoidable.",
                    "label": 0
                },
                {
                    "sent": "We gathered information and then we came up with a clear understanding that maybe we are not representative of the general population.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The other people out there.",
                    "label": 0
                },
                {
                    "sent": "And so we thought.",
                    "label": 0
                },
                {
                    "sent": "Let's take this at Globe.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we did type again the same query.",
                    "label": 0
                },
                {
                    "sent": "On a much larger scale, and it turns out yes.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is there other people around and we actually are pretty?",
                    "label": 0
                },
                {
                    "sent": "Isolated type of characters and what is exciting to us perhaps?",
                    "label": 0
                },
                {
                    "sent": "Is not exciting to everybody else, so that was difficult, but we came up with various attempts to convey the excitement and the relevance of what we do.",
                    "label": 0
                },
                {
                    "sent": "Two people that aren't necessarily spending every single day feeling proposals and stuff like this, and we thought of.",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "We do find partners.",
                    "label": 0
                },
                {
                    "sent": "These are important.",
                    "label": 0
                },
                {
                    "sent": "They make a difference.",
                    "label": 0
                },
                {
                    "sent": "A lot of things depend on that.",
                    "label": 0
                },
                {
                    "sent": "And yet nobody knows it.",
                    "label": 0
                },
                {
                    "sent": "So how do we explain why it's sub some technology actually?",
                    "label": 0
                },
                {
                    "sent": "Matters.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the solution was to identify various types of target audiences and we did it the exercise to decide virus types of people want to talk to colleagues, scientists, industrial people, and end.",
                    "label": 0
                },
                {
                    "sent": "The general public, we believe that addressing the general public actually has a series of consequences in terms of reaching decision makers and so on and so forth.",
                    "label": 1
                },
                {
                    "sent": "We do have to make the case for what?",
                    "label": 0
                },
                {
                    "sent": "We have to explain why what to do is important.",
                    "label": 0
                },
                {
                    "sent": "It is our job to explain why it is important, but mostly about explain what we do.",
                    "label": 0
                },
                {
                    "sent": "Because if I tell my mother that I found.",
                    "label": 0
                },
                {
                    "sent": "I don't know the pagerank of the social network somewhere is.",
                    "label": 1
                },
                {
                    "sent": "The metabolic network of a cell has a.",
                    "label": 0
                },
                {
                    "sent": "Power low in the rack distribution.",
                    "label": 0
                },
                {
                    "sent": "It doesn't much matter much, so we don't work.",
                    "label": 0
                },
                {
                    "sent": "It matters in it yet.",
                    "label": 1
                },
                {
                    "sent": "We need the last step how to?",
                    "label": 0
                },
                {
                    "sent": "Scored a goal.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we go.",
                    "label": 0
                },
                {
                    "sent": "This is the description of this attempt to spend some time not on producing necessarily new result, but on making sure people know what we do and why it matters and how it works, and make sure that these things is meaningful to the general public.",
                    "label": 1
                },
                {
                    "sent": "In the process we also achieved a number of side results that are going to be very important for the next Pascal.",
                    "label": 1
                },
                {
                    "sent": "So there's been a series of good news after this project which was not directly a search product.",
                    "label": 0
                },
                {
                    "sent": "Bad, so I hope you all.",
                    "label": 0
                },
                {
                    "sent": "Started doing outreach projects because it might help you research too.",
                    "label": 1
                },
                {
                    "sent": "So we made it a proof of concept.",
                    "label": 0
                },
                {
                    "sent": "To the brokerage of expertise, from priming, which is a very short term, small budget type of activity to just.",
                    "label": 0
                },
                {
                    "sent": "Do the final step and make some demonstration of technology.",
                    "label": 0
                },
                {
                    "sent": "We actually built this on top of a project we had running before about studying the media, assisted the content in the media system, which is also abstract for many people, so we had to.",
                    "label": 0
                },
                {
                    "sent": "Build a platform that people can experience.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is something already said.",
                    "label": 0
                },
                {
                    "sent": "So here we go.",
                    "label": 0
                },
                {
                    "sent": "Build a platform.",
                    "label": 0
                },
                {
                    "sent": "That can be used as a showcase of new ideas.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we thought about real domains that matter, something I don't want to be in any way condescending.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm just I've been asking around what could be of interest.",
                    "label": 0
                },
                {
                    "sent": "I was listing the patterns I want to showcase, list the algorithms I wanted to demonstrate and try to come up with.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The values.",
                    "label": 0
                },
                {
                    "sent": "Domains in which these things can be.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So one thing we did is the website.",
                    "label": 0
                },
                {
                    "sent": "It's going to be live in a few weeks.",
                    "label": 0
                },
                {
                    "sent": "It just analyzes text from the web, identifies a number of important things, entities, relations and organizes these things into timelines, social networks, and then from the social network gets all the patterns from the graph and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Essentially does everything I usually do on unlimited Bolick network, just on a social network.",
                    "label": 0
                },
                {
                    "sent": "And although somebody may say, well, you know the authority level of.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "Lactose operon within the E coli network is very high.",
                    "label": 0
                },
                {
                    "sent": "I can tell you that George Clooney is in the same position in the Hollywood Celebrity Network.",
                    "label": 0
                },
                {
                    "sent": "It's a very high page rank, authority in the social network.",
                    "label": 0
                },
                {
                    "sent": "It's a little bit easier to relate if I have to say the shortest path between David Letterman and George Clooney goes through Britney Spears.",
                    "label": 0
                },
                {
                    "sent": "That means something more than just say that's the pathway in bacteria, so it was enjoyable and we didn't have to do much.",
                    "label": 0
                },
                {
                    "sent": "We had all the algorithms.",
                    "label": 0
                },
                {
                    "sent": "They're good algorithms and the generalized to measurements.",
                    "label": 0
                },
                {
                    "sent": "So here is one of the things we did gathering reading there is a poor student news.",
                    "label": 0
                },
                {
                    "sent": "He just started in October and his first assignment was to start reading all the possible gossip magazines in the UK in the USA.",
                    "label": 0
                },
                {
                    "sent": "He was very surprised and then he started slowly applying software to this and he now apparently the gate expert in Britney Spears that in the Meanwhile has become newsworthy.",
                    "label": 0
                },
                {
                    "sent": "So this is one of the things we're doing.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can explore the.",
                    "label": 0
                },
                {
                    "sent": "The user will be able to explore the network and visualize patterns, statistics, quantities, and so on, interact in various ways with the corpus.",
                    "label": 0
                },
                {
                    "sent": "That I think is live.",
                    "label": 0
                },
                {
                    "sent": "It updates all the time.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "See Timelines, Time series analysis, change points.",
                    "label": 0
                },
                {
                    "sent": "We can find every sort of thing this is the platform that is going to be expanded overtime.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you wonder, this is a version of the network, this is the.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Much more connected version depending where you cut.",
                    "label": 0
                },
                {
                    "sent": "Right now in this prototype, we're still finishing up the relation extraction system, and by the way, I'm planning to use a planning to test entailment technologies that I enjoyed seeing these days.",
                    "label": 0
                },
                {
                    "sent": "This is just a corcorans network.",
                    "label": 0
                },
                {
                    "sent": "And you can see Brad Pitt in the network tool in the center of the net.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hey, this is classical path analysis.",
                    "label": 1
                },
                {
                    "sent": "You will do it in a metabolic network in a cell.",
                    "label": 0
                },
                {
                    "sent": "How do you go from here to here with the shortest path?",
                    "label": 0
                },
                {
                    "sent": "How important is in order from the point of view of controlling the global diameter of the flow of in the network?",
                    "label": 0
                },
                {
                    "sent": "And if you want to connect opera with the other means you have to go to Jennifer Hudson.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately I don't know much but I'm catching up fast.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Any you can rank people not by frequency of mentions not buy anything just by the connectivity to the social network.",
                    "label": 0
                },
                {
                    "sent": "So Brad Pitt is the most connected with this piece.",
                    "label": 1
                },
                {
                    "sent": "Apparently is seeing other people very often.",
                    "label": 0
                },
                {
                    "sent": "So just to do this, we have to do 45 key steps, getting text, parsing text, statistical analysis, getting entities, Association, mining, subsequence mining.",
                    "label": 0
                },
                {
                    "sent": "Graph Analysis Time series analysis.",
                    "label": 0
                },
                {
                    "sent": "Geo location.",
                    "label": 0
                },
                {
                    "sent": "By the way we do, we just do the full lot.",
                    "label": 0
                },
                {
                    "sent": "We do it anyway and it makes sense.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At least, but of course not everybody.",
                    "label": 0
                },
                {
                    "sent": "Cares about Hollywood such a life.",
                    "label": 0
                },
                {
                    "sent": "I found out also this to Googling around and there are other people who care about that.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we have the same platform reading about 600 newspapers every six hours, distracting news stories, analyzing news stories.",
                    "label": 0
                },
                {
                    "sent": "We machine translated by the way in this case also from Spanish, French and German, and Italian, and again we get a time series clusters.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Dogs Geo location.",
                    "label": 0
                },
                {
                    "sent": "So this Heath Ledger relates to United States but also to Australia and all these things are running.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we are attending this science watch Tango just to target somebody we understand a bit better.",
                    "label": 0
                },
                {
                    "sent": "Maybe if you want to find out.",
                    "label": 0
                },
                {
                    "sent": "What's going on in the life Sciences in biology and so on?",
                    "label": 0
                },
                {
                    "sent": "This is just reading everything available in terms of possibilities in science, organizing them for you.",
                    "label": 0
                },
                {
                    "sent": "This is a bit behind schedule.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what does it mean?",
                    "label": 0
                },
                {
                    "sent": "We made the pipeline.",
                    "label": 0
                },
                {
                    "sent": "We made it very large scale platform.",
                    "label": 0
                },
                {
                    "sent": "We did the beginning.",
                    "label": 0
                },
                {
                    "sent": "In the end it was the boring part and now we play with the middle.",
                    "label": 0
                },
                {
                    "sent": "We just stuck to relations which is what we do.",
                    "label": 0
                },
                {
                    "sent": "We test algorithms.",
                    "label": 0
                },
                {
                    "sent": "We demonstrated them and we really want this to be ready for our showcase activities in July when they had the big conferences.",
                    "label": 0
                },
                {
                    "sent": "Why CML?",
                    "label": 0
                },
                {
                    "sent": "And when this is running, we're going to try to attack.",
                    "label": 0
                },
                {
                    "sent": "Attention in traffic to it.",
                    "label": 0
                },
                {
                    "sent": "Hope everybody can help by putting pointers.",
                    "label": 0
                },
                {
                    "sent": "The idea is that the more people go there, the more we can analyze their behavior here and then.",
                    "label": 0
                },
                {
                    "sent": "Give them back these patterns though, so that I think has a semantic on top of the normal algorithmics.",
                    "label": 0
                },
                {
                    "sent": "It taught me a lot in terms of making infrastructure I have been doing theory for a long time and it's nice to learn how you make a large scale project.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the file.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Please.",
                    "label": 0
                },
                {
                    "sent": "And that they will be a computer science.",
                    "label": 0
                },
                {
                    "sent": "Could be a science, computer science or so, so I know this is intended for the general public.",
                    "label": 0
                },
                {
                    "sent": "Also, a fourth year computer scientist, or, you know, might look at it too.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's possible.",
                    "label": 0
                },
                {
                    "sent": "We were told in the last review meeting that we kind of succeeded in reaching out to our peers.",
                    "label": 0
                },
                {
                    "sent": "We were told that we weren't so good in reaching out to everybody else.",
                    "label": 0
                },
                {
                    "sent": "I'm saying is you should add the data.",
                    "label": 0
                },
                {
                    "sent": "Yeah, all that is needed at this point took awhile, but now it's now.",
                    "label": 0
                },
                {
                    "sent": "It's very easy.",
                    "label": 0
                },
                {
                    "sent": "Absolutely next time we meet I can tell you how this is going to go in various directions, but for the moment that's what we did please.",
                    "label": 0
                },
                {
                    "sent": "I think that this is a dynamic would be even better to outreach in an Attack Attack attention crisis.",
                    "label": 0
                },
                {
                    "sent": "I think that if we had something like a gossip generator then this and that this would be interesting for many, absolutely.",
                    "label": 0
                },
                {
                    "sent": "Isn't there something like ethics?",
                    "label": 0
                },
                {
                    "sent": "Ethics.",
                    "label": 0
                },
                {
                    "sent": "He is a.",
                    "label": 0
                },
                {
                    "sent": "About knowing that there are two ways ethics in the sense that.",
                    "label": 0
                },
                {
                    "sent": "You want to mine an ethical document database or you want to discuss the ethics of doing research because I like the second topic very much.",
                    "label": 0
                },
                {
                    "sent": "Well, I can do one ethical question right now.",
                    "label": 0
                },
                {
                    "sent": "You apply celebrity awards.",
                    "label": 0
                },
                {
                    "sent": "To your Gmail box, which some people can do today and you get your social network, your Geo location, everything else.",
                    "label": 0
                },
                {
                    "sent": "If I missed my Google, I can access everybody's Gmail box, run this algorithm and get everybody's personal life.",
                    "label": 0
                },
                {
                    "sent": "Is this not an ethical question?",
                    "label": 0
                },
                {
                    "sent": "Yes, but I mean this is not something where we have an active role.",
                    "label": 0
                },
                {
                    "sent": "Oh well, I don't know well I like ethics, should discuss it, but the gossip generator.",
                    "label": 0
                },
                {
                    "sent": "I think that is your finest thought for the day.",
                    "label": 0
                },
                {
                    "sent": "Don't do anything else.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}