{
    "id": "qakogrrwfd6vovmxliqgamokd3o2c72k",
    "title": "Infinite Kernel Learning",
    "info": {
        "author": [
            "Peter Vincent Gehler, Max Planck Institute for Biological Cybernetics, Max Planck Institute"
        ],
        "published": "Dec. 20, 2008",
        "recorded": "December 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Kernel Methods"
        ]
    },
    "url": "http://videolectures.net/lkasok08_gehler_ikl/",
    "segmentation": [
        [
            "So yeah, thanks.",
            "Thank you.",
            "I mean it because it's the one of them here.",
            "I'm gonna be very.",
            "So this is joint work.",
            "Doing so."
        ],
        [
            "So this is about is about internally we had talked about this today.",
            "And so I'm stating the main results here.",
            "Wake up.",
            "So the 1st result is that going on is indeed.",
            "Classes and.",
            "No, they're not so many followups on that paper.",
            "So we just talked about going to define a new unit."
        ],
        [
            "Morning I would like to show you how to how to learn with us."
        ],
        [
            "And then there is an experimental part where we show what has been discussed in the audience is already that there's little performance gain linearly combining kernels, and I tried a number of cases.",
            "And have some later and but there's go, so using this infinite kernel."
        ],
        [
            "Very very general.",
            "With all possible banquet in all possible directions, you can gain something.",
            "OK, so.",
            "So let's go from OK."
        ],
        [
            "I want to give some sense imitations on denoting a kernel here with the with the permit of feature, often; Here, and Peter defines the type of the kernel.",
            "Invented.",
            "And whenever I buy Capitol Theatre with a small subscript F here, then it's a finite set, whenever it is without the debt.",
            "And so all we are still trying to do is we're learning the weights here and we're learning the parameters and the final kernel is then passed.",
            "I've seen many times today.",
            "So let's let's divide the algorithm.",
            "So we'll start."
        ],
        [
            "Simple SVM and this is just a simple SVM formulation.",
            "Operator.",
            "The program has just really.",
            "So you're going to entail you're given the finite."
        ],
        [
            "And now you are not modifying.",
            "Minimizing over the combination weights.",
            "And so your final classifier is now with some over all those possible place.",
            "And so you're giving, giving giving this finite set of goals and all.",
            "I'm asking you.",
            "Exponent optimize this here once and or somebody comes to me and says you're allowed to add one more kernel and retrain which one is it.",
            "And so I'm interested in."
        ],
        [
            "General set.",
            "What's the what's the best linear?",
            "What's the best pilot set from those here?",
            "The best model for multiple coloring solution office setting.",
            "So we just take this.",
            "We take it to the dual."
        ],
        [
            "And then we had to do a program.",
            "This is just a dual program.",
            "Often work on learning.",
            "Possible business individual thing would be helpful for me says here you have the lenders and for every kernel in your.",
            "Give one of these constraints.",
            "This is Linda.",
            "Here is just that my GOSH multiplier update.",
            "Should be in.",
            "I mean this is this is.",
            "Of the.",
            "Solder.",
            "OK, so that's good, that's fine.",
            "We were interested in this thing yet, so we."
        ],
        [
            "Here we go.",
            "We just change this thing here."
        ],
        [
            "Now we have an infinite number of content.",
            "And at the optimal solution we need to satisfy all of them.",
            "OK, so for sure.",
            "Yeah, I'm gonna call."
        ],
        [
            "Function via the function T because it's.",
            "Is coming up later again and again and so how do how?",
            "How do we solve this?",
            "I mean, for any finite here we finite set.",
            "We know how to solve any MPLS over.",
            "So this then?"
        ],
        [
            "Can we suggest then?",
            "Concentration.",
            "So between.",
            "So given any."
        ],
        [
            "We we solve it using any impulse over which gives us.",
            "And now we need to check if any other."
        ],
        [
            "Strange.",
            "For which the T 12 year is bigger than this."
        ],
        [
            "The case.",
            "Be solved.",
            "Just gotta keep on doing this.",
            "More and more constraints.",
            "No .1 here is fairly used to do that.",
            "So."
        ],
        [
            "So really the problem now is giving given some parameters alphas like intermediate during the.",
            "Training points you need to find the maximum, like the maximum of this function.",
            "It's annoying."
        ],
        [
            "The man in the paper from IU.",
            "They found that for certain color, current classes are different.",
            "And yeah, maybe maybe.",
            "A normalized version of.",
            "ESPN.",
            "Colonel.",
            "Nothing more.",
            "Yeah, I mean there's nothing bad about this.",
            "Peoples connections.",
            "Bye.",
            "For him there, but now we have a score of if we're allowed to add more kernels to walk out there and try to find some.",
            "I mean, you could still choose your own stuff and say, OK, here's a new kernel.",
            "I think that's good.",
            "Just letting you know."
        ],
        [
            "OK, now someone might have notice, so we have infinite number of girls here.",
            "I mean is there?",
            "I mean is this solution?",
            "And yes, they are.",
            "Representation.",
            "And you can express it.",
            "And Furthermore, if you can solve this problem so if you are lucky situation, consult this morning."
        ],
        [
            "Proposed.",
            "I'll come to that in district.",
            "OK."
        ],
        [
            "We should talk about how to solve this problem for certain classes of girls.",
            "Devices.",
            "And then you get organized guarantees that you conversion, but it's OK.",
            "So I mean, for most problems we cannot do this because this is like too expensive.",
            "All the girls I would have used.",
            "And like stop from there some gradient descent to title."
        ],
        [
            "So now with an infinite amount of kernels, we can say that the data.",
            "So we first start with the with the small toy example here, so wet red and blue glasses.",
            "So check for the chess board pattern here.",
            "There only two columns here in four rows here.",
            "So like the optimal kernel.",
            "OK, so this is.",
            "Problem.",
            "I'm only showing the first 2 dimensions.",
            "The other eight.",
            "So what's the optimal kernel here?",
            "Separate the two clauses blue and so it should have like different bandwidth here in here.",
            "And it should be as smooth as possible so that it should have as large bandwidth as possible, so it should be in this direction here.",
            "Trust that it does not.",
            "Yeah, I mean it.",
            "It captures this distance here and in this direction.",
            "It captures this distance.",
            "This is this is like 20 dimensional.",
            "So we just stop on the couple of random random.",
            "Kernels gradient descent with my new ones."
        ],
        [
            "This this is what?",
            "With like one kernel, one per meters, which is just the white kernel."
        ],
        [
            "0.",
            "Testing 1.",
            "Is the smoothest kernel which does though, and that has a very high weight.",
            "And then there's another code on here which only explains some notes.",
            "So."
        ],
        [
            "This is this is this is how it looks like what you do to start with.",
            "And you choose one more according to their function.",
            "So I plotted two slices of the trans dimensional problem here.",
            "So this is like the first 2 dimensions which correspond to these here.",
            "So those are like what I called the signal domain compared with information lies in and you can see there's a nice maximum here.",
            "So you have to maximize this year whenever that is like above, playing which you can pull you barely see.",
            "Then the kernel will do good utilized under below displaying here that it will know there's no user including that program.",
            "This is this is the kind of problem you have to solve, But I mean this.",
            "And like two nights in general, it might be like."
        ],
        [
            "These so.",
            "Over three different classes.",
            "So the first one is I have a single Gaussian kernel with only one benefit.",
            "Just one."
        ],
        [
            "So the second class is I say, OK, I this.",
            "This consumes all dimensions jointly, not I'm using Windows plus every dimension gets a single kernel, so every kernel now looks also only the single dimension.",
            "There's a second."
        ],
        [
            "3rd one is just with General Gaussian kernels.",
            "Arbitrary.",
            "Very very large copper pearls, and indeed matrices you can generate in here range from diagonal ones to pull one matrices, so there's."
        ],
        [
            "So we can point.",
            "So we compare three different models, the SPN, as everybody is doing the kernel selected.",
            "Learning has access to.",
            "Learning and everything else is estimated by customization.",
            "Yahoo.",
            "So I."
        ],
        [
            "Download couple days.",
            "So I ran.",
            "The SPN shows one best kernel, used wood Kernel, English has access to all those things are, so this is the class singers we know only considering all dimensions separately, no joined it.",
            "Select everybody using SVM, learning all those kernels into kernel.",
            "Learning with the continuously government.",
            "Off corners.",
            "I mean I'm here."
        ],
        [
            "So now let's say OK.",
            "Which we can not.",
            "Expensive so I just repeated this this this one year forms like from the slide before and now I'm applying with running with all the occurrences before, but now every kernel.",
            "But now the additional kernels which look into each feature direction separately, like only in One Direction.",
            "What is 0.6?",
            "That's all friends here.",
            "This is the one.",
            "This is one data set here which I followed when you can.",
            "OK. Maybe?",
            "But yeah, I mean.",
            "No, actually.",
            "I talked to God and he said oh his improve on one of those.",
            "OK, so.",
            "Maybe they are if you if you consider like also subsets of organisms.",
            "My encouragement to order.",
            "Sorry.",
            "Actually, yes."
        ],
        [
            "Fox place.",
            "So this caused the error rate here and there pops up another algorithm called image.",
            "We also have the error rate of the learning results.",
            "I mean sometimes it's sometimes it's worse.",
            "I mean something to you.",
            "So, so it's not really like doing well on all those folders here.",
            "And I mean also that there are.",
            "These are the training points sizes.",
            "This is a test point sizes, number of dimensions of the data set, so there's like a variety of like medium size datasets and all those results here are coverage over 100 independent ones.",
            "So yeah, I mean sometimes, sometimes it really helps.",
            "But I mean not too often, so I thought, OK, maybe maybe I'll just pick some more."
        ],
        [
            "Computer.",
            "SBM.",
            "With only one.",
            "And then like if you did, you confuse the separate clause in each dimension separately to improve here over the SVG data set the product you can prove even more there would be with the general classical overfit.",
            "On this.",
            "2 results there are here because they are just too expensive to calculate.",
            "Yes, technically.",
            "Yeah, that's so these two hundred runs and easier however, which over I think the $20.",
            "Yes, yeah here."
        ],
        [
            "This selects way more kernels then."
        ],
        [
            "Yeah, so I mean this is this is this is like kind of like the story I observe here.",
            "Like I didn't try to like go out and like find the datasets where where we did best but I just thought OK maybe you'd use the standard datasets.",
            "Class of colonels.",
            "And you have the ability to model feature directions jointly, so that way you can gain something.",
            "OK, so the main results repeat."
        ],
        [
            "You know this slide just the very same thing.",
            "Maybe I should add that the internal learning algorithm is this, of course.",
            "Play songs.",
            "Captain Morgan using simple."
        ],
        [
            "We had to do that because.",
            "Select folders.",
            "660 kernels and they're like really big, so it was way more efficient to switch power.",
            "The active girls.",
            "And another."
        ],
        [
            "Other side, but didn't go to learning how you can also."
        ],
        [
            "Although it's an ongoing problem.",
            "At any point you were given.",
            "Report available.",
            "More details please.",
            "So once future."
        ],
        [
            "Obviously.",
            "This team here really believing in order for learning objective function.",
            "Either by end design as as you doing.",
            "Like waiting send somebody.",
            "No.",
            "Water efficient ways to self esteem.",
            "And what is also interesting is like an application to structured kernels event this submission.",
            "Where we treat like pre processing steps as currently so we still got something back on 1st generation.",
            "We have usually you dictionary and you map the features in the dictionary.",
            "Representation.",
            "Dictionary search over those.",
            "Or we say this is this like a variant of the Boomer metric owner.",
            "So we're looking and like what is the region to look in if I want to classify 2 images?",
            "And this is this is like the outcome of this.",
            "So.",
            "So these are structured kernels, and for each of those there poses the problem of DD and efficient ways to solve this.",
            "You can like more and more."
        ],
        [
            "You mentioned several times that you.",
            "The closest one.",
            "So you give an impression how fast or how slow.",
            "It is really retraining the SBM over and over again, so I mean for the SPM case, you only need one SPM to be.",
            "There were multiple kernel learning case in our implementation of Simple and Kyle.",
            "We need about like 10 to 15 maybe and then for multiple learning you need about.",
            "It really varies, but I think it's about like 20 to 30 years old or maybe maybe about like 50 work early cause but each of them with like a small set of currents.",
            "And then you can do like several stopping.",
            "Special is going on.",
            "Fastest.",
            "So this is another story like would occur learning for this for these things here is really hard to compute because you have a lot more kernels which are very very close.",
            "Only one of them will be active in the in the in the final step."
        ],
        [
            "Is it this one?",
            "So.",
            "Is not among the fastest.",
            "Also if you want to.",
            "If you want to go into discussion.",
            "Should you get always?",
            "Number of close proximity device over locator number set of carriers crossword.",
            "Is it the greedy or no?",
            "Function.",
            "Of course you can.",
            "But but that does not give give a good margin.",
            "Burden.",
            "I mean, usually you're thinking like you need to regular.",
            "So this this tells you that for most classes.",
            "Combined with the.",
            "I have another.",
            "Hilton Workshop selling make this controversial remarks.",
            "So if you think about what you did and you suggested to do multiple kernel learning and then some gradient descent.",
            "In the direction of the new kernel to be taken, I remember it was long ago, but he called this neural network so.",
            "Please call back propagation so you also had kernels.",
            "Spread over some point.",
            "Like that?",
            "Running itself.",
            "That's what I.",
            "The only thing about this is the point here.",
            "Girls.",
            "You may be not believing in believing in.",
            "You're not living in the objective function.",
            "This.",
            "But I don't know if the machine learning field."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So yeah, thanks.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "I mean it because it's the one of them here.",
                    "label": 0
                },
                {
                    "sent": "I'm gonna be very.",
                    "label": 0
                },
                {
                    "sent": "So this is joint work.",
                    "label": 0
                },
                {
                    "sent": "Doing so.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is about is about internally we had talked about this today.",
                    "label": 0
                },
                {
                    "sent": "And so I'm stating the main results here.",
                    "label": 0
                },
                {
                    "sent": "Wake up.",
                    "label": 0
                },
                {
                    "sent": "So the 1st result is that going on is indeed.",
                    "label": 0
                },
                {
                    "sent": "Classes and.",
                    "label": 0
                },
                {
                    "sent": "No, they're not so many followups on that paper.",
                    "label": 0
                },
                {
                    "sent": "So we just talked about going to define a new unit.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Morning I would like to show you how to how to learn with us.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there is an experimental part where we show what has been discussed in the audience is already that there's little performance gain linearly combining kernels, and I tried a number of cases.",
                    "label": 0
                },
                {
                    "sent": "And have some later and but there's go, so using this infinite kernel.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Very very general.",
                    "label": 0
                },
                {
                    "sent": "With all possible banquet in all possible directions, you can gain something.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So let's go from OK.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to give some sense imitations on denoting a kernel here with the with the permit of feature, often; Here, and Peter defines the type of the kernel.",
                    "label": 1
                },
                {
                    "sent": "Invented.",
                    "label": 1
                },
                {
                    "sent": "And whenever I buy Capitol Theatre with a small subscript F here, then it's a finite set, whenever it is without the debt.",
                    "label": 0
                },
                {
                    "sent": "And so all we are still trying to do is we're learning the weights here and we're learning the parameters and the final kernel is then passed.",
                    "label": 0
                },
                {
                    "sent": "I've seen many times today.",
                    "label": 0
                },
                {
                    "sent": "So let's let's divide the algorithm.",
                    "label": 0
                },
                {
                    "sent": "So we'll start.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Simple SVM and this is just a simple SVM formulation.",
                    "label": 0
                },
                {
                    "sent": "Operator.",
                    "label": 0
                },
                {
                    "sent": "The program has just really.",
                    "label": 0
                },
                {
                    "sent": "So you're going to entail you're given the finite.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And now you are not modifying.",
                    "label": 0
                },
                {
                    "sent": "Minimizing over the combination weights.",
                    "label": 0
                },
                {
                    "sent": "And so your final classifier is now with some over all those possible place.",
                    "label": 0
                },
                {
                    "sent": "And so you're giving, giving giving this finite set of goals and all.",
                    "label": 0
                },
                {
                    "sent": "I'm asking you.",
                    "label": 0
                },
                {
                    "sent": "Exponent optimize this here once and or somebody comes to me and says you're allowed to add one more kernel and retrain which one is it.",
                    "label": 0
                },
                {
                    "sent": "And so I'm interested in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "General set.",
                    "label": 0
                },
                {
                    "sent": "What's the what's the best linear?",
                    "label": 0
                },
                {
                    "sent": "What's the best pilot set from those here?",
                    "label": 0
                },
                {
                    "sent": "The best model for multiple coloring solution office setting.",
                    "label": 0
                },
                {
                    "sent": "So we just take this.",
                    "label": 0
                },
                {
                    "sent": "We take it to the dual.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we had to do a program.",
                    "label": 0
                },
                {
                    "sent": "This is just a dual program.",
                    "label": 0
                },
                {
                    "sent": "Often work on learning.",
                    "label": 0
                },
                {
                    "sent": "Possible business individual thing would be helpful for me says here you have the lenders and for every kernel in your.",
                    "label": 0
                },
                {
                    "sent": "Give one of these constraints.",
                    "label": 0
                },
                {
                    "sent": "This is Linda.",
                    "label": 0
                },
                {
                    "sent": "Here is just that my GOSH multiplier update.",
                    "label": 0
                },
                {
                    "sent": "Should be in.",
                    "label": 0
                },
                {
                    "sent": "I mean this is this is.",
                    "label": 0
                },
                {
                    "sent": "Of the.",
                    "label": 0
                },
                {
                    "sent": "Solder.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's good, that's fine.",
                    "label": 0
                },
                {
                    "sent": "We were interested in this thing yet, so we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here we go.",
                    "label": 0
                },
                {
                    "sent": "We just change this thing here.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now we have an infinite number of content.",
                    "label": 0
                },
                {
                    "sent": "And at the optimal solution we need to satisfy all of them.",
                    "label": 0
                },
                {
                    "sent": "OK, so for sure.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I'm gonna call.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Function via the function T because it's.",
                    "label": 0
                },
                {
                    "sent": "Is coming up later again and again and so how do how?",
                    "label": 0
                },
                {
                    "sent": "How do we solve this?",
                    "label": 0
                },
                {
                    "sent": "I mean, for any finite here we finite set.",
                    "label": 0
                },
                {
                    "sent": "We know how to solve any MPLS over.",
                    "label": 0
                },
                {
                    "sent": "So this then?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can we suggest then?",
                    "label": 0
                },
                {
                    "sent": "Concentration.",
                    "label": 0
                },
                {
                    "sent": "So between.",
                    "label": 0
                },
                {
                    "sent": "So given any.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We we solve it using any impulse over which gives us.",
                    "label": 0
                },
                {
                    "sent": "And now we need to check if any other.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Strange.",
                    "label": 0
                },
                {
                    "sent": "For which the T 12 year is bigger than this.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The case.",
                    "label": 0
                },
                {
                    "sent": "Be solved.",
                    "label": 0
                },
                {
                    "sent": "Just gotta keep on doing this.",
                    "label": 0
                },
                {
                    "sent": "More and more constraints.",
                    "label": 0
                },
                {
                    "sent": "No .1 here is fairly used to do that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So really the problem now is giving given some parameters alphas like intermediate during the.",
                    "label": 0
                },
                {
                    "sent": "Training points you need to find the maximum, like the maximum of this function.",
                    "label": 0
                },
                {
                    "sent": "It's annoying.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The man in the paper from IU.",
                    "label": 0
                },
                {
                    "sent": "They found that for certain color, current classes are different.",
                    "label": 0
                },
                {
                    "sent": "And yeah, maybe maybe.",
                    "label": 0
                },
                {
                    "sent": "A normalized version of.",
                    "label": 0
                },
                {
                    "sent": "ESPN.",
                    "label": 0
                },
                {
                    "sent": "Colonel.",
                    "label": 0
                },
                {
                    "sent": "Nothing more.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean there's nothing bad about this.",
                    "label": 0
                },
                {
                    "sent": "Peoples connections.",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                },
                {
                    "sent": "For him there, but now we have a score of if we're allowed to add more kernels to walk out there and try to find some.",
                    "label": 0
                },
                {
                    "sent": "I mean, you could still choose your own stuff and say, OK, here's a new kernel.",
                    "label": 0
                },
                {
                    "sent": "I think that's good.",
                    "label": 0
                },
                {
                    "sent": "Just letting you know.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, now someone might have notice, so we have infinite number of girls here.",
                    "label": 0
                },
                {
                    "sent": "I mean is there?",
                    "label": 0
                },
                {
                    "sent": "I mean is this solution?",
                    "label": 0
                },
                {
                    "sent": "And yes, they are.",
                    "label": 0
                },
                {
                    "sent": "Representation.",
                    "label": 0
                },
                {
                    "sent": "And you can express it.",
                    "label": 0
                },
                {
                    "sent": "And Furthermore, if you can solve this problem so if you are lucky situation, consult this morning.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Proposed.",
                    "label": 0
                },
                {
                    "sent": "I'll come to that in district.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We should talk about how to solve this problem for certain classes of girls.",
                    "label": 0
                },
                {
                    "sent": "Devices.",
                    "label": 0
                },
                {
                    "sent": "And then you get organized guarantees that you conversion, but it's OK.",
                    "label": 0
                },
                {
                    "sent": "So I mean, for most problems we cannot do this because this is like too expensive.",
                    "label": 0
                },
                {
                    "sent": "All the girls I would have used.",
                    "label": 0
                },
                {
                    "sent": "And like stop from there some gradient descent to title.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now with an infinite amount of kernels, we can say that the data.",
                    "label": 0
                },
                {
                    "sent": "So we first start with the with the small toy example here, so wet red and blue glasses.",
                    "label": 0
                },
                {
                    "sent": "So check for the chess board pattern here.",
                    "label": 0
                },
                {
                    "sent": "There only two columns here in four rows here.",
                    "label": 0
                },
                {
                    "sent": "So like the optimal kernel.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "Problem.",
                    "label": 0
                },
                {
                    "sent": "I'm only showing the first 2 dimensions.",
                    "label": 0
                },
                {
                    "sent": "The other eight.",
                    "label": 0
                },
                {
                    "sent": "So what's the optimal kernel here?",
                    "label": 0
                },
                {
                    "sent": "Separate the two clauses blue and so it should have like different bandwidth here in here.",
                    "label": 0
                },
                {
                    "sent": "And it should be as smooth as possible so that it should have as large bandwidth as possible, so it should be in this direction here.",
                    "label": 0
                },
                {
                    "sent": "Trust that it does not.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean it.",
                    "label": 0
                },
                {
                    "sent": "It captures this distance here and in this direction.",
                    "label": 0
                },
                {
                    "sent": "It captures this distance.",
                    "label": 0
                },
                {
                    "sent": "This is this is like 20 dimensional.",
                    "label": 0
                },
                {
                    "sent": "So we just stop on the couple of random random.",
                    "label": 0
                },
                {
                    "sent": "Kernels gradient descent with my new ones.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This this is what?",
                    "label": 0
                },
                {
                    "sent": "With like one kernel, one per meters, which is just the white kernel.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "0.",
                    "label": 0
                },
                {
                    "sent": "Testing 1.",
                    "label": 0
                },
                {
                    "sent": "Is the smoothest kernel which does though, and that has a very high weight.",
                    "label": 0
                },
                {
                    "sent": "And then there's another code on here which only explains some notes.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is this is this is how it looks like what you do to start with.",
                    "label": 0
                },
                {
                    "sent": "And you choose one more according to their function.",
                    "label": 0
                },
                {
                    "sent": "So I plotted two slices of the trans dimensional problem here.",
                    "label": 0
                },
                {
                    "sent": "So this is like the first 2 dimensions which correspond to these here.",
                    "label": 0
                },
                {
                    "sent": "So those are like what I called the signal domain compared with information lies in and you can see there's a nice maximum here.",
                    "label": 0
                },
                {
                    "sent": "So you have to maximize this year whenever that is like above, playing which you can pull you barely see.",
                    "label": 0
                },
                {
                    "sent": "Then the kernel will do good utilized under below displaying here that it will know there's no user including that program.",
                    "label": 0
                },
                {
                    "sent": "This is this is the kind of problem you have to solve, But I mean this.",
                    "label": 0
                },
                {
                    "sent": "And like two nights in general, it might be like.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These so.",
                    "label": 0
                },
                {
                    "sent": "Over three different classes.",
                    "label": 0
                },
                {
                    "sent": "So the first one is I have a single Gaussian kernel with only one benefit.",
                    "label": 0
                },
                {
                    "sent": "Just one.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the second class is I say, OK, I this.",
                    "label": 0
                },
                {
                    "sent": "This consumes all dimensions jointly, not I'm using Windows plus every dimension gets a single kernel, so every kernel now looks also only the single dimension.",
                    "label": 0
                },
                {
                    "sent": "There's a second.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "3rd one is just with General Gaussian kernels.",
                    "label": 0
                },
                {
                    "sent": "Arbitrary.",
                    "label": 0
                },
                {
                    "sent": "Very very large copper pearls, and indeed matrices you can generate in here range from diagonal ones to pull one matrices, so there's.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we can point.",
                    "label": 0
                },
                {
                    "sent": "So we compare three different models, the SPN, as everybody is doing the kernel selected.",
                    "label": 1
                },
                {
                    "sent": "Learning has access to.",
                    "label": 1
                },
                {
                    "sent": "Learning and everything else is estimated by customization.",
                    "label": 0
                },
                {
                    "sent": "Yahoo.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Download couple days.",
                    "label": 0
                },
                {
                    "sent": "So I ran.",
                    "label": 0
                },
                {
                    "sent": "The SPN shows one best kernel, used wood Kernel, English has access to all those things are, so this is the class singers we know only considering all dimensions separately, no joined it.",
                    "label": 0
                },
                {
                    "sent": "Select everybody using SVM, learning all those kernels into kernel.",
                    "label": 0
                },
                {
                    "sent": "Learning with the continuously government.",
                    "label": 0
                },
                {
                    "sent": "Off corners.",
                    "label": 0
                },
                {
                    "sent": "I mean I'm here.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now let's say OK.",
                    "label": 0
                },
                {
                    "sent": "Which we can not.",
                    "label": 0
                },
                {
                    "sent": "Expensive so I just repeated this this this one year forms like from the slide before and now I'm applying with running with all the occurrences before, but now every kernel.",
                    "label": 0
                },
                {
                    "sent": "But now the additional kernels which look into each feature direction separately, like only in One Direction.",
                    "label": 0
                },
                {
                    "sent": "What is 0.6?",
                    "label": 0
                },
                {
                    "sent": "That's all friends here.",
                    "label": 0
                },
                {
                    "sent": "This is the one.",
                    "label": 0
                },
                {
                    "sent": "This is one data set here which I followed when you can.",
                    "label": 0
                },
                {
                    "sent": "OK. Maybe?",
                    "label": 0
                },
                {
                    "sent": "But yeah, I mean.",
                    "label": 0
                },
                {
                    "sent": "No, actually.",
                    "label": 0
                },
                {
                    "sent": "I talked to God and he said oh his improve on one of those.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Maybe they are if you if you consider like also subsets of organisms.",
                    "label": 0
                },
                {
                    "sent": "My encouragement to order.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Actually, yes.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fox place.",
                    "label": 0
                },
                {
                    "sent": "So this caused the error rate here and there pops up another algorithm called image.",
                    "label": 0
                },
                {
                    "sent": "We also have the error rate of the learning results.",
                    "label": 0
                },
                {
                    "sent": "I mean sometimes it's sometimes it's worse.",
                    "label": 0
                },
                {
                    "sent": "I mean something to you.",
                    "label": 0
                },
                {
                    "sent": "So, so it's not really like doing well on all those folders here.",
                    "label": 0
                },
                {
                    "sent": "And I mean also that there are.",
                    "label": 0
                },
                {
                    "sent": "These are the training points sizes.",
                    "label": 0
                },
                {
                    "sent": "This is a test point sizes, number of dimensions of the data set, so there's like a variety of like medium size datasets and all those results here are coverage over 100 independent ones.",
                    "label": 0
                },
                {
                    "sent": "So yeah, I mean sometimes, sometimes it really helps.",
                    "label": 0
                },
                {
                    "sent": "But I mean not too often, so I thought, OK, maybe maybe I'll just pick some more.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Computer.",
                    "label": 0
                },
                {
                    "sent": "SBM.",
                    "label": 0
                },
                {
                    "sent": "With only one.",
                    "label": 0
                },
                {
                    "sent": "And then like if you did, you confuse the separate clause in each dimension separately to improve here over the SVG data set the product you can prove even more there would be with the general classical overfit.",
                    "label": 0
                },
                {
                    "sent": "On this.",
                    "label": 0
                },
                {
                    "sent": "2 results there are here because they are just too expensive to calculate.",
                    "label": 0
                },
                {
                    "sent": "Yes, technically.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's so these two hundred runs and easier however, which over I think the $20.",
                    "label": 0
                },
                {
                    "sent": "Yes, yeah here.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This selects way more kernels then.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, so I mean this is this is this is like kind of like the story I observe here.",
                    "label": 0
                },
                {
                    "sent": "Like I didn't try to like go out and like find the datasets where where we did best but I just thought OK maybe you'd use the standard datasets.",
                    "label": 0
                },
                {
                    "sent": "Class of colonels.",
                    "label": 0
                },
                {
                    "sent": "And you have the ability to model feature directions jointly, so that way you can gain something.",
                    "label": 0
                },
                {
                    "sent": "OK, so the main results repeat.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You know this slide just the very same thing.",
                    "label": 0
                },
                {
                    "sent": "Maybe I should add that the internal learning algorithm is this, of course.",
                    "label": 0
                },
                {
                    "sent": "Play songs.",
                    "label": 0
                },
                {
                    "sent": "Captain Morgan using simple.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We had to do that because.",
                    "label": 0
                },
                {
                    "sent": "Select folders.",
                    "label": 0
                },
                {
                    "sent": "660 kernels and they're like really big, so it was way more efficient to switch power.",
                    "label": 0
                },
                {
                    "sent": "The active girls.",
                    "label": 0
                },
                {
                    "sent": "And another.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other side, but didn't go to learning how you can also.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Although it's an ongoing problem.",
                    "label": 0
                },
                {
                    "sent": "At any point you were given.",
                    "label": 0
                },
                {
                    "sent": "Report available.",
                    "label": 0
                },
                {
                    "sent": "More details please.",
                    "label": 0
                },
                {
                    "sent": "So once future.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Obviously.",
                    "label": 0
                },
                {
                    "sent": "This team here really believing in order for learning objective function.",
                    "label": 0
                },
                {
                    "sent": "Either by end design as as you doing.",
                    "label": 0
                },
                {
                    "sent": "Like waiting send somebody.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Water efficient ways to self esteem.",
                    "label": 0
                },
                {
                    "sent": "And what is also interesting is like an application to structured kernels event this submission.",
                    "label": 1
                },
                {
                    "sent": "Where we treat like pre processing steps as currently so we still got something back on 1st generation.",
                    "label": 0
                },
                {
                    "sent": "We have usually you dictionary and you map the features in the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Representation.",
                    "label": 0
                },
                {
                    "sent": "Dictionary search over those.",
                    "label": 0
                },
                {
                    "sent": "Or we say this is this like a variant of the Boomer metric owner.",
                    "label": 0
                },
                {
                    "sent": "So we're looking and like what is the region to look in if I want to classify 2 images?",
                    "label": 0
                },
                {
                    "sent": "And this is this is like the outcome of this.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So these are structured kernels, and for each of those there poses the problem of DD and efficient ways to solve this.",
                    "label": 1
                },
                {
                    "sent": "You can like more and more.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You mentioned several times that you.",
                    "label": 0
                },
                {
                    "sent": "The closest one.",
                    "label": 0
                },
                {
                    "sent": "So you give an impression how fast or how slow.",
                    "label": 0
                },
                {
                    "sent": "It is really retraining the SBM over and over again, so I mean for the SPM case, you only need one SPM to be.",
                    "label": 0
                },
                {
                    "sent": "There were multiple kernel learning case in our implementation of Simple and Kyle.",
                    "label": 0
                },
                {
                    "sent": "We need about like 10 to 15 maybe and then for multiple learning you need about.",
                    "label": 0
                },
                {
                    "sent": "It really varies, but I think it's about like 20 to 30 years old or maybe maybe about like 50 work early cause but each of them with like a small set of currents.",
                    "label": 0
                },
                {
                    "sent": "And then you can do like several stopping.",
                    "label": 0
                },
                {
                    "sent": "Special is going on.",
                    "label": 0
                },
                {
                    "sent": "Fastest.",
                    "label": 0
                },
                {
                    "sent": "So this is another story like would occur learning for this for these things here is really hard to compute because you have a lot more kernels which are very very close.",
                    "label": 0
                },
                {
                    "sent": "Only one of them will be active in the in the in the final step.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is it this one?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Is not among the fastest.",
                    "label": 0
                },
                {
                    "sent": "Also if you want to.",
                    "label": 0
                },
                {
                    "sent": "If you want to go into discussion.",
                    "label": 0
                },
                {
                    "sent": "Should you get always?",
                    "label": 0
                },
                {
                    "sent": "Number of close proximity device over locator number set of carriers crossword.",
                    "label": 0
                },
                {
                    "sent": "Is it the greedy or no?",
                    "label": 0
                },
                {
                    "sent": "Function.",
                    "label": 0
                },
                {
                    "sent": "Of course you can.",
                    "label": 0
                },
                {
                    "sent": "But but that does not give give a good margin.",
                    "label": 0
                },
                {
                    "sent": "Burden.",
                    "label": 0
                },
                {
                    "sent": "I mean, usually you're thinking like you need to regular.",
                    "label": 0
                },
                {
                    "sent": "So this this tells you that for most classes.",
                    "label": 0
                },
                {
                    "sent": "Combined with the.",
                    "label": 0
                },
                {
                    "sent": "I have another.",
                    "label": 0
                },
                {
                    "sent": "Hilton Workshop selling make this controversial remarks.",
                    "label": 0
                },
                {
                    "sent": "So if you think about what you did and you suggested to do multiple kernel learning and then some gradient descent.",
                    "label": 0
                },
                {
                    "sent": "In the direction of the new kernel to be taken, I remember it was long ago, but he called this neural network so.",
                    "label": 0
                },
                {
                    "sent": "Please call back propagation so you also had kernels.",
                    "label": 0
                },
                {
                    "sent": "Spread over some point.",
                    "label": 0
                },
                {
                    "sent": "Like that?",
                    "label": 0
                },
                {
                    "sent": "Running itself.",
                    "label": 0
                },
                {
                    "sent": "That's what I.",
                    "label": 0
                },
                {
                    "sent": "The only thing about this is the point here.",
                    "label": 0
                },
                {
                    "sent": "Girls.",
                    "label": 0
                },
                {
                    "sent": "You may be not believing in believing in.",
                    "label": 0
                },
                {
                    "sent": "You're not living in the objective function.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "But I don't know if the machine learning field.",
                    "label": 0
                }
            ]
        }
    }
}