{
    "id": "qen26maaoi7abjakicggskgoh5dzfswc",
    "title": "ER.ELEX.IS",
    "info": {
        "author": [
            "Iztok Kosem, Trojina – Institute for Applied Slovene Studies"
        ],
        "published": "March 6, 2019",
        "recorded": "February 2019",
        "category": [
            "Top->Humanities->Linguistics->Lexicography",
            "Top->Computer Science->Big Data"
        ]
    },
    "url": "http://videolectures.net/elexisobserver2019_kosem_elex_is/",
    "segmentation": [
        [
            "It's my pleasure too.",
            "Start presenting something that's been done already, 'cause it's been one year into the project and it's always nice to have something to show that the work that's been done within Alexis."
        ],
        [
            "And this is exactly what someone has already mentioned.",
            "So when we talk about lexicography and the project, especially when we come to research output, we have to know that the lexicographic research output is global.",
            "So of course, relax is is a European project, but our work has an impact globally, and vice versa.",
            "We want to also know about lexicographic developments around the world.",
            "I mean, even the evidence or this can be seen in this user survey, which wasn't limited to European countries alone, where you want to have feedback from lexicographers around the world.",
            "So this is the first point to make."
        ],
        [
            "And the second one that lexicographic research output is getting multimodal.",
            "So you get proceedings, you get Journal papers online more and more, but now you getting videos as well.",
            "More and more conferences are adopting the approach of recording the presentations, which were same thing we're doing today to make this available as widely as possible to people who cannot attend who cannot afford to attend.",
            "Or who want to see it at some point at some point in the future and see what's being done in a certain area in lexicography.",
            "Which."
        ],
        [
            "Which sort of leads us back to at least two of the elexis objectives.",
            "So the first one is sort of fostering the cooperation, especially knowledge exchange between different research communities.",
            "In Europe and around the world and the second one is to promote Open Access in all shapes and forms, and we're not talking only about tools and dictionaries.",
            "But we're also talking about publications, so we want to make it easier for people to find what's been written about different topics.",
            "And this is.",
            "This is something.",
            "So this is the ER, ellex is 2.",
            "Simone show glimpses of it at you, relax, but sort of we added a few functionality since then, so I will take a risk now and demo it live So what you can see here is that the papers we have included in the tool so far are distributed across the world and you can actually see you can even get a bit closer and you can see sort of.",
            "For example, in Europe.",
            "Distribution across different countries.",
            "This is by the 1st author of the publication, so if there are multiple authors we took the institution and the country at that time.",
            "So at the time of the publication was made of the authors and then of course you can search by.",
            "Let's say you can search by.",
            "Different concepts and you say I want to see all the publications on the topic of synonyms and you get the results and then you can.",
            "These are the clickable links to the the papers directly, so you can read the paper and download it because they are at the moment these are all Open Access.",
            "So let me get back to the.",
            "Of course you can filter can do a bit more with the with the search tool.",
            "For example, you can look at the other concepts related to the papers that were just listed.",
            "So you can say I want to limit my search to synonyms and verbs and you can actually add this conditions and it will show you only the results that are related to synonyms and verbs and then you can close this and you can go back to the results.",
            "You can, you can see the languages at the moment you have to search in a particular language and we're actually talking to David with.",
            "To make this feature a bit more multilingual.",
            "So if you search for synonym search and other languages, you can see the tag cloud so.",
            "Familiar with this, the advantage is that you can again click and you can say.",
            "Should work, maybe fire for normal you could add the condition and limited.",
            "You can see by author locations or articles per country.",
            "So pretty much you can get a lot of information about the papers.",
            "Could see the conferences.",
            "Consider authors, so who wrote about synonyms?",
            "Like if you want to limit it to all required, you show his papers and have a look so.",
            "Anne.",
            "And.",
            "Cable concept graph.",
            "So you can see the.",
            "The concept that are linked.",
            "So let's say if I see the.",
            "Collocation idiom, so these are sort of connected concepts.",
            "And you can do a bit more with the search like I can say I can search synonyms or.",
            "To hours and I get all the results that are either or.",
            "I mean we will.",
            "We will get some instructions prepared to help you find things more easily.",
            "I mean, there's things like you can do synonyms, but I can do minus collocation.",
            "So it searches synonyms but not collocations, so it gives you only the papers that.",
            "Talk about synonyms but don't mention collocations.",
            "Things like that.",
            "I'm sure.",
            "People will find more uses that I'm demonstrating here.",
            "Of course you can limit by location, so if you want to know what authors well we have in in Vienna, so let's do the so let's say what authors of papers from Vienna.",
            "Produced so then you can limit that and you find the results.",
            "In different languages.",
            "So.",
            "And then you can basically go to the papers again.",
            "Then you have a feature like you.",
            "You can look at the particular proceedings or source.",
            "So you can say I want to look at papers from the Elecs conference or the UX conference and you get all the papers only from that particular conference.",
            "And of course you can search by your favorite author, right?",
            "You can say OK, cmon I want to say.",
            "Um?",
            "I don't want to embarrass anyone else, I know, OK, I can sort of look for seamless paper so.",
            "So we can see one's production at the moment in the tool, and you can read all of his papers and then you can explore further.",
            "OK. You can also limit your search by saying I want to search for the last decade or I want to just sort really in the history so you can do that and you can limit your results, but per language.",
            "So let's say you want to look for Spanish only and you can get all the papers that are written in Spanish.",
            "OK.",
            "I think this is almost it.",
            "There's one more thing I want to show you.",
            "So as I said at the beginning, the production is multimodal.",
            "So here you have articles but you also have videos.",
            "So.",
            "No, I don't know.",
            "OK, so you can also include videos in your search.",
            "I don't know idiom.",
            "Anne.",
            "So.",
            "You would get a result to the videos and you say OK. At the moment the videos are mainly from the video lectures, but it takes you to the video, this one.",
            "Was is from the Euro exchange plan and then you can watch the video.",
            "And learn more about.",
            "In this case, the Latvian lexicography.",
            "OK, I think that's pretty much it.",
            "It's online, we will put it also on the Alexis website, the link and so this is just to finish off.",
            "OK."
        ],
        [
            "Right, so the question is, what's currently in the tool?",
            "So we have currently put in all all the UX proceedings.",
            "Well, except for the last one, that's still pretty prepared, and all the elects proceedings.",
            "There's 86 video presentations and their eleven different languages and representation across languages in the number of contributions is displayed in the graph.",
            "And we are still."
        ],
        [
            "Things that are in the pipeline, so being prepared we are in talks basically preparing the proceedings for major lakes DNA and of course we intend to.",
            "Include all the you relax and elects proceedings and we have started preparing the lexical Journal so we will include that.",
            "Another Open Access journals that we know when we can obtain material from.",
            "We have started discussions with David who is compiling well.",
            "He will be doing the presentations after me so you will learn all about it.",
            "But we want to consolidate our efforts and make sure that we get sort of.",
            "We don't duplicate the work and the community to get as much as possible from both of our projects, and we are also collecting videos.",
            "There are already 110 further videos prepared so we just have to prepare the final metadata and put it in the tool and we will prepare instructions on how to prepare these files.",
            "So in the future, if anyone want has maybe identifies a Journal or maybe there's an open Open Access journals.",
            "So this is one thing we expect that there will be a Journal which may not be lexicographic in content in total, but there would be a paper one or two and somebody might say, well I want to maybe contribute this Open Access paper to your search tool and we will prepare an easy instructions so they can submit that it will be a simple Excel line and all the metadata that we need and then it can be pretty much seamlessly included in the tool.",
            "And it is it for me.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's my pleasure too.",
                    "label": 0
                },
                {
                    "sent": "Start presenting something that's been done already, 'cause it's been one year into the project and it's always nice to have something to show that the work that's been done within Alexis.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is exactly what someone has already mentioned.",
                    "label": 0
                },
                {
                    "sent": "So when we talk about lexicography and the project, especially when we come to research output, we have to know that the lexicographic research output is global.",
                    "label": 1
                },
                {
                    "sent": "So of course, relax is is a European project, but our work has an impact globally, and vice versa.",
                    "label": 0
                },
                {
                    "sent": "We want to also know about lexicographic developments around the world.",
                    "label": 0
                },
                {
                    "sent": "I mean, even the evidence or this can be seen in this user survey, which wasn't limited to European countries alone, where you want to have feedback from lexicographers around the world.",
                    "label": 0
                },
                {
                    "sent": "So this is the first point to make.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the second one that lexicographic research output is getting multimodal.",
                    "label": 1
                },
                {
                    "sent": "So you get proceedings, you get Journal papers online more and more, but now you getting videos as well.",
                    "label": 0
                },
                {
                    "sent": "More and more conferences are adopting the approach of recording the presentations, which were same thing we're doing today to make this available as widely as possible to people who cannot attend who cannot afford to attend.",
                    "label": 0
                },
                {
                    "sent": "Or who want to see it at some point at some point in the future and see what's being done in a certain area in lexicography.",
                    "label": 0
                },
                {
                    "sent": "Which.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which sort of leads us back to at least two of the elexis objectives.",
                    "label": 1
                },
                {
                    "sent": "So the first one is sort of fostering the cooperation, especially knowledge exchange between different research communities.",
                    "label": 1
                },
                {
                    "sent": "In Europe and around the world and the second one is to promote Open Access in all shapes and forms, and we're not talking only about tools and dictionaries.",
                    "label": 0
                },
                {
                    "sent": "But we're also talking about publications, so we want to make it easier for people to find what's been written about different topics.",
                    "label": 0
                },
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "This is something.",
                    "label": 0
                },
                {
                    "sent": "So this is the ER, ellex is 2.",
                    "label": 0
                },
                {
                    "sent": "Simone show glimpses of it at you, relax, but sort of we added a few functionality since then, so I will take a risk now and demo it live So what you can see here is that the papers we have included in the tool so far are distributed across the world and you can actually see you can even get a bit closer and you can see sort of.",
                    "label": 0
                },
                {
                    "sent": "For example, in Europe.",
                    "label": 0
                },
                {
                    "sent": "Distribution across different countries.",
                    "label": 0
                },
                {
                    "sent": "This is by the 1st author of the publication, so if there are multiple authors we took the institution and the country at that time.",
                    "label": 0
                },
                {
                    "sent": "So at the time of the publication was made of the authors and then of course you can search by.",
                    "label": 0
                },
                {
                    "sent": "Let's say you can search by.",
                    "label": 0
                },
                {
                    "sent": "Different concepts and you say I want to see all the publications on the topic of synonyms and you get the results and then you can.",
                    "label": 0
                },
                {
                    "sent": "These are the clickable links to the the papers directly, so you can read the paper and download it because they are at the moment these are all Open Access.",
                    "label": 0
                },
                {
                    "sent": "So let me get back to the.",
                    "label": 1
                },
                {
                    "sent": "Of course you can filter can do a bit more with the with the search tool.",
                    "label": 0
                },
                {
                    "sent": "For example, you can look at the other concepts related to the papers that were just listed.",
                    "label": 0
                },
                {
                    "sent": "So you can say I want to limit my search to synonyms and verbs and you can actually add this conditions and it will show you only the results that are related to synonyms and verbs and then you can close this and you can go back to the results.",
                    "label": 0
                },
                {
                    "sent": "You can, you can see the languages at the moment you have to search in a particular language and we're actually talking to David with.",
                    "label": 0
                },
                {
                    "sent": "To make this feature a bit more multilingual.",
                    "label": 0
                },
                {
                    "sent": "So if you search for synonym search and other languages, you can see the tag cloud so.",
                    "label": 0
                },
                {
                    "sent": "Familiar with this, the advantage is that you can again click and you can say.",
                    "label": 0
                },
                {
                    "sent": "Should work, maybe fire for normal you could add the condition and limited.",
                    "label": 0
                },
                {
                    "sent": "You can see by author locations or articles per country.",
                    "label": 0
                },
                {
                    "sent": "So pretty much you can get a lot of information about the papers.",
                    "label": 0
                },
                {
                    "sent": "Could see the conferences.",
                    "label": 0
                },
                {
                    "sent": "Consider authors, so who wrote about synonyms?",
                    "label": 0
                },
                {
                    "sent": "Like if you want to limit it to all required, you show his papers and have a look so.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Cable concept graph.",
                    "label": 0
                },
                {
                    "sent": "So you can see the.",
                    "label": 0
                },
                {
                    "sent": "The concept that are linked.",
                    "label": 0
                },
                {
                    "sent": "So let's say if I see the.",
                    "label": 0
                },
                {
                    "sent": "Collocation idiom, so these are sort of connected concepts.",
                    "label": 0
                },
                {
                    "sent": "And you can do a bit more with the search like I can say I can search synonyms or.",
                    "label": 0
                },
                {
                    "sent": "To hours and I get all the results that are either or.",
                    "label": 0
                },
                {
                    "sent": "I mean we will.",
                    "label": 0
                },
                {
                    "sent": "We will get some instructions prepared to help you find things more easily.",
                    "label": 0
                },
                {
                    "sent": "I mean, there's things like you can do synonyms, but I can do minus collocation.",
                    "label": 0
                },
                {
                    "sent": "So it searches synonyms but not collocations, so it gives you only the papers that.",
                    "label": 0
                },
                {
                    "sent": "Talk about synonyms but don't mention collocations.",
                    "label": 0
                },
                {
                    "sent": "Things like that.",
                    "label": 0
                },
                {
                    "sent": "I'm sure.",
                    "label": 0
                },
                {
                    "sent": "People will find more uses that I'm demonstrating here.",
                    "label": 0
                },
                {
                    "sent": "Of course you can limit by location, so if you want to know what authors well we have in in Vienna, so let's do the so let's say what authors of papers from Vienna.",
                    "label": 0
                },
                {
                    "sent": "Produced so then you can limit that and you find the results.",
                    "label": 0
                },
                {
                    "sent": "In different languages.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And then you can basically go to the papers again.",
                    "label": 0
                },
                {
                    "sent": "Then you have a feature like you.",
                    "label": 0
                },
                {
                    "sent": "You can look at the particular proceedings or source.",
                    "label": 0
                },
                {
                    "sent": "So you can say I want to look at papers from the Elecs conference or the UX conference and you get all the papers only from that particular conference.",
                    "label": 0
                },
                {
                    "sent": "And of course you can search by your favorite author, right?",
                    "label": 0
                },
                {
                    "sent": "You can say OK, cmon I want to say.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "I don't want to embarrass anyone else, I know, OK, I can sort of look for seamless paper so.",
                    "label": 0
                },
                {
                    "sent": "So we can see one's production at the moment in the tool, and you can read all of his papers and then you can explore further.",
                    "label": 0
                },
                {
                    "sent": "OK. You can also limit your search by saying I want to search for the last decade or I want to just sort really in the history so you can do that and you can limit your results, but per language.",
                    "label": 0
                },
                {
                    "sent": "So let's say you want to look for Spanish only and you can get all the papers that are written in Spanish.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "I think this is almost it.",
                    "label": 0
                },
                {
                    "sent": "There's one more thing I want to show you.",
                    "label": 0
                },
                {
                    "sent": "So as I said at the beginning, the production is multimodal.",
                    "label": 0
                },
                {
                    "sent": "So here you have articles but you also have videos.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "No, I don't know.",
                    "label": 0
                },
                {
                    "sent": "OK, so you can also include videos in your search.",
                    "label": 0
                },
                {
                    "sent": "I don't know idiom.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "You would get a result to the videos and you say OK. At the moment the videos are mainly from the video lectures, but it takes you to the video, this one.",
                    "label": 0
                },
                {
                    "sent": "Was is from the Euro exchange plan and then you can watch the video.",
                    "label": 0
                },
                {
                    "sent": "And learn more about.",
                    "label": 0
                },
                {
                    "sent": "In this case, the Latvian lexicography.",
                    "label": 0
                },
                {
                    "sent": "OK, I think that's pretty much it.",
                    "label": 0
                },
                {
                    "sent": "It's online, we will put it also on the Alexis website, the link and so this is just to finish off.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so the question is, what's currently in the tool?",
                    "label": 0
                },
                {
                    "sent": "So we have currently put in all all the UX proceedings.",
                    "label": 0
                },
                {
                    "sent": "Well, except for the last one, that's still pretty prepared, and all the elects proceedings.",
                    "label": 0
                },
                {
                    "sent": "There's 86 video presentations and their eleven different languages and representation across languages in the number of contributions is displayed in the graph.",
                    "label": 1
                },
                {
                    "sent": "And we are still.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things that are in the pipeline, so being prepared we are in talks basically preparing the proceedings for major lakes DNA and of course we intend to.",
                    "label": 0
                },
                {
                    "sent": "Include all the you relax and elects proceedings and we have started preparing the lexical Journal so we will include that.",
                    "label": 0
                },
                {
                    "sent": "Another Open Access journals that we know when we can obtain material from.",
                    "label": 1
                },
                {
                    "sent": "We have started discussions with David who is compiling well.",
                    "label": 0
                },
                {
                    "sent": "He will be doing the presentations after me so you will learn all about it.",
                    "label": 0
                },
                {
                    "sent": "But we want to consolidate our efforts and make sure that we get sort of.",
                    "label": 0
                },
                {
                    "sent": "We don't duplicate the work and the community to get as much as possible from both of our projects, and we are also collecting videos.",
                    "label": 0
                },
                {
                    "sent": "There are already 110 further videos prepared so we just have to prepare the final metadata and put it in the tool and we will prepare instructions on how to prepare these files.",
                    "label": 1
                },
                {
                    "sent": "So in the future, if anyone want has maybe identifies a Journal or maybe there's an open Open Access journals.",
                    "label": 0
                },
                {
                    "sent": "So this is one thing we expect that there will be a Journal which may not be lexicographic in content in total, but there would be a paper one or two and somebody might say, well I want to maybe contribute this Open Access paper to your search tool and we will prepare an easy instructions so they can submit that it will be a simple Excel line and all the metadata that we need and then it can be pretty much seamlessly included in the tool.",
                    "label": 0
                },
                {
                    "sent": "And it is it for me.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}