{
    "id": "qtpsmvp7jxsyhxvjtxvkwl6fcmllxnwi",
    "title": "Semantic Web in Asia: Example Use Cases",
    "info": {
        "author": [
            "Tony Lee, Saltlux Inc."
        ],
        "published": "Nov. 24, 2008",
        "recorded": "October 2008",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc08_lee_swiauc/",
    "segmentation": [
        [
            "Good afternoon, my name is Tony from Salt rocks Korea.",
            "Actually I just arrived in this morning from Korea so I still have jet lag so it means that I can sleep in my presentation.",
            "OK, so title of my presentation is about the semantic web in Asia.",
            "It's focusing on the user cases by using semantic technology."
        ],
        [
            "OK.",
            "So I introduced several user cases in Asia, especially in Korea, and I introduce the infrastructure for the vision system and so I introduce our companies or troops."
        ],
        [
            "So here is overview and introduction of the user cases.",
            "We found that there are four different types of user cases and applications in Asia like semantic search.",
            "Based on semantic metadata and in careers, so it's very interesting.",
            "Thanks for the mobile environment based on certain generation or 3.5 generation mobile environment the telecom company wanted to improve their infrastructure more intelligent so the sort troops and other companies have many experience in this field.",
            "This Picture folder recommendation of content and the Prince Analyzation of mobile phone and mobile.",
            "Services and also the in Korean in Japan.",
            "There are lots of ubiquitous computing project, especially in Korea and Japan.",
            "We have you city project, Ubiquitous City in Korea.",
            "We have more than five different ubiquitous city project.",
            "That is something about to establishing new whole City with the ubiquitous concept.",
            "Like context, awareness and sensor networks, so in this area is also the ontology and semantic web were already, you know, implemented and the last one is about the semantic web like Semantic Wiki and semantic blow and also search Porter.",
            "By using semantic technology."
        ],
        [
            "For the first one, I'd like to introduce the Project commercial project from the Korean government, the Agency for accumulating and preserving historical records of government to knock.",
            "And not prepared the two years to introduce ontology and semantic technology for their services.",
            "And they finish this service.",
            "And Korean people are using this service.",
            "OK, in this service there are five different technical layers from the legacy data layer to the application layer in here.",
            "In this project the We utilize the Triple Store.",
            "And then rebase the reasoning engine for the interoperability of data and also for the more semantic and more intelligent searching systems.",
            "And in this project we found the big.",
            "We faced big holders something about the performance versus the scalability in this agent.",
            "They have more than 70 million documents and they want to do to generate the semantic metadata from the oradell records.",
            "So it might be more than 1 billion three proofs and each was up to 10 billion trippers, so we had to handle such a huge amount of three.",
            "Plus in this project.",
            "OK, uh."
        ],
        [
            "Also, in this project, one of the main aims is about the material into probability based on semantic meta data repository's.",
            "In this project, the project team applied the ISO an ICIEC 11179 for developing dental ontology and also the in this project projected team used on teologi.",
            "Instantiation technologies by using rules and information extraction system like natural language processing, and also this system now stored about one and half billion 3% this system.",
            "And in this system, OK the."
        ],
        [
            "Application is something about searching with the meaning."
        ],
        [
            "K Second UK support semantic search.",
            "It is about the digital library carries.",
            "It is also government agency for the education and the research materials in this agency.",
            "Two years ago they started to make a new service based on ontology and reasoning.",
            "In this project the fundamental requirement for this project was something like that.",
            "Large scale this semantic.",
            "I'll more than 100 million 3% in two years ago and one of their requirements was.",
            "The high performance reasoning to under the opening to 5 second with the reasoning and ontology.",
            "And so it looks implemented these searching services by integrating of reasoning and search engines, and we tried to make semantic annotation system.",
            "OK, so the society is running well based on so many technologies and this service Porter provides a recommendation of paper or the researchers like Professor for the researcher."
        ],
        [
            "K are the second user cases.",
            "Is something about the mobile platform.",
            "This is quite interesting for me because you know, mobile industry is so huge.",
            "So it we found the rear optimistic opportunities in these areas.",
            "His picture for the mobile content recommendation and personalization.",
            "So conventionally, the companies used utilized the data mining architecture, but they realize that there are many limitations.",
            "By using only data mining, so they want to to utilize ontology, an reasoning architecture for the mobile environment and SCT or the Ctfu tried to evaluate the technology.",
            "And Korea Telecom Freetel is one of the largest mobile company in Korea.",
            "And during last two two years they invested money to make no comment.",
            "Intelligent platform based on ontology and semantic technologies and we faced the big problem about also the scalability.",
            "Huge huge scalability.",
            "More than 10 billion triples because you know every time you know a person called calls to the other.",
            "This is our legacy system and network can generate large bunch of data and they want to to transfer such kind of dynamic data to the trippers based on ontology.",
            "So it was really hard to overcome.",
            "It means that we have to handle the both sides of a coin.",
            "The performance is real time performance is for the mobile environment and also the huge amount of scalability.",
            "And the left side of this slide shows about preferred structures of and the DC system is based on the IMS infrastructures."
        ],
        [
            "So.",
            "This slide shows about the service platform.",
            "Based on IMS Network, this is system can can gather the legacy data from the legacy systems like a Cdr stores and membership services, histories or other.",
            "You know profiles from user, the mobile phone and this system can generate the knowledge base based on ontologies and you know the consist of trippers and seems like here.",
            "That this the middleware system can handle such knowledge base by using rules and reasoning architectures.",
            "And we achieved the personal recommendation and personalized the services based on IMS, infrastructures and ontology and Semantic Web."
        ],
        [
            "OK, this slide also shows a floor from the latest data to the.",
            "You know the context of Wellness and also other discovering of the intelligent data.",
            "Ice."
        ],
        [
            "Keep this one.",
            "So another interesting things.",
            "Is the social network analysis is specially our client and soul troops were interested in the mobile social network analysis so that we analyzed the whole phone core of KTF and we are could generate the social network.",
            "We do every phone calls and we did the information over location seems like that and we apply the ontologies and rule like this one.",
            "We use the F logic in this project and then you can.",
            "We can find The Who is who.",
            "It means that who is someone's father and wife and also the friends or something like that by using ontology and.",
            "Rules so you know it's very interesting and also symbolic.",
            "The result to be cause the telecom company want to to make a new business model like advertisement.",
            "So they want to, to, you know the evaluate the person who is the more important and who is who could be the how can I say at the core over networks?",
            "So the we are made this such an enlarging system to any large dynamic phone calls and also the we could generate the semantic metadata based on semantic networks.",
            "It was very interesting well.",
            "And here is."
        ],
        [
            "The rear walking the application, the snapshot of application.",
            "Send the Dojo applications are working on the Samsung Mobile phone.",
            "And there are many applications logging on now.",
            "This intelligent platform, like a personalized you know main screen and recommendation.",
            "And the private management, and also the context based tour information and the shopping recommendation and view the recommendation based on his activities and his.",
            "How can I say?",
            "The social network and also his preference is the most important technology was down analyzing of users preferences.",
            "So we utilize the apology and reasoning rules and also we use the subsumption reasoning to find the preferences of users."
        ],
        [
            "OK.",
            "Here is another user cases for ubiquitous computing.",
            "Katie is our largest telecommunications company in Korea.",
            "Like to each telecom and entity, and this project was started before five years ago and I want to have your so go.",
            "This project was finished well and this project was to develop the middleware platform for context awareness services feature for the home networks and for the car navigation system.",
            "And in this project salt looks and Katie introduced the OS GI framework for the Midway architectures and we developed the digit kind kind of under materials based on regionals and some kinds of interface engines or knowledge repositories.",
            "Also we use the owl and F logic together in this project.",
            "And nowadays this middleware is used for developing the intelligent robot and IPTV for the exposure for the recommendation of content for the users."
        ],
        [
            "OK then here is a snapshot and I will show you the demonstration.",
            "OK, there are no sound but.",
            "So the left side is not a virtual reality.",
            "Is the emulation the environment so the every you know the activities in the environment then the middleware can get the sensor information, then that this middleware ordered two orders to the optimum appliances.",
            "And if other people together then this system can reserve the completion of.",
            "Preferences seems like that, and also I'll move a little more.",
            "Then here this is a new terminal and look at this one.",
            "This is a test bed.",
            "We'd know you can see though, the opening of cotton and also the turn on the light, something like that.",
            "So anyway, that we developed the this middleware for the intelligent to home networks by using reasoning and ontologies and it worked well and we are already commercialized.",
            "The diameter air for the many user cases and applications.",
            "OK, I used it stop this one.",
            "And.",
            "K."
        ],
        [
            "She.",
            "So nowadays, so to see an other, companies try to make a huge platform for handling a whole city, like Ubiquitous City and now Korean government and the Samsung trying to make a build new infrastructure for the ubiquitous cities.",
            "And the salt looks contributed has contributed to this project.",
            "By using ontology and semantic technologies, especially for this project, we already know evaluated the performances and you know technology about the ubiquitous intelligent transportation system.",
            "It means that by using reasoning engines, the middleware or media platform of ubiquitous society can handle the traffics and can.",
            "Give some message to the traffic controller and also this project is undergoing under development."
        ],
        [
            "OK, now I'd like to introduce several other user cases about semantic web.",
            "It specially assault looks are just opened feature on the Semantic Porter.",
            "This semantic Porter is based on the Semantic wiki and Semantic Blog.",
            "Actually the semantic wiki is quite different from the you know the current semantic wiki and we used Web 2.0 concept like RIA and Ajax technologies in this project and.",
            "Most interesting things that they we introduced the RDF a for the tagging.",
            "So the in this semantic voters or content can have the RDF tag inside you know the content.",
            "Ki will show you something.",
            "K so I'm so sorry.",
            "Almost content you know written in Korean so you cannot understand.",
            "But anyway, this is the new interpreter of our site.",
            "And there are many.",
            "Are the interactive things.",
            "By using the architectures and a jobs.",
            "And in here.",
            "OK, so people moving here, you can find the keyword like wiki and beside Wiki you can find the LDF tag here and every kind of these syndicated content were from the knowledge base with our dev, tag and tripper curing things like that and also.",
            "In this is one of the Porter of Activision, so these two these two people sharing the 4th in our company we have about more than 80 now people, persons and every employees has his own the 4th in this company and in here so you know the fundamentals of the portal consists of the blogs and wiki.",
            "KR here is the samples of the web pages we can blow.",
            "I mean that the.",
            "All every content and topics.",
            "Has each on the blogs and wiki coupled.",
            "And here is the block and I will introduce about how we can make the semantic weekend semantic blow.",
            "But I found some problem in here about the network speed you can find here the on ontology and when you over the mouse on this icon.",
            "Then this system can you know Curie the triple path.",
            "OK can I move?",
            "And also in the weekend blow you can generate all the F tag and adult F tag.",
            "Taxes are included automatically inside.",
            "HTML and I will demonstrate about that if I.",
            "No.",
            "Drop and push the right button and you can find.",
            "Our semantic, you know, tagging editors.",
            "And it will walk.",
            "It's too slow because of the network.",
            "Oops.",
            "I show you later.",
            "It's because of the traffic.",
            "Something like that.",
            "OK, like this.",
            "This is the window for editing the triples, each more familiar for the users better than the conventional semantic wiki, and this system is integrated with knowledge base like triple stores and reasoning engines, and you can find the previous trippers and you can print a three person here.",
            "And.",
            "I'm sorry it's too slow.",
            "OK, I'll continue my presentation.",
            "K so this sorta looks has each owns many quota based on semantic weekend semantic blogs and it consists of RDF A and the knowledge base."
        ],
        [
            "With the three press and another user cases we have it show about the web scale.",
            "Semantic searching system for more than the 100 million web document.",
            "Is it this system can gather the cruel.",
            "The large of information like blogs and webpages and uses and this system can generate the three pools and extracted the information from the structure of the document and also this system can.",
            "Evaluate their of each other concept and relationship so it's very interesting things that I will show you.",
            "True about that.",
            "OK, DC is the you know the working result.",
            "I print the keyword Myung Lee is the name of the President of Korea, and this system can only large the last bunch of the web content and blocks and this system found several related keywords in here.",
            "OK, I read the blogs, news and many things and actually this is system that architecture of the system is based on.",
            "The three person ontologies.",
            "So every content to already know the annotated we don't ologist.",
            "And here is you can find the several information like you know meta information.",
            "Also this kind of metadata.",
            "Were extracted from the unstructured data and stored in the trip restore and several statistics.",
            "If I can click here then that you can find the other big picture.",
            "The semantic network, something like.",
            "This and if I click here then you can navigate automatically extracted knowledge from the web and also this system can extract metadata from the web if I can if I click here then the bug name is a person.",
            "Oops.",
            "Matt worked well.",
            "OK, like this and the DC system already extracted automatic data semantic meta data from the web and the find the pictures from the web, which is very interesting.",
            "OK, it's time to finish."
        ],
        [
            "So this is system is based on the grid architecture, so lots of computers are working together.",
            "And the weekend, you know, damage each node of agreed architectures to gather the information from the web and turn allies to extract the semantic metadata and an enlarged the relationships."
        ],
        [
            "OK, here is the add some comparison between the hour limit document google.com.",
            "I don't believe that.",
            "To be the competitor of Google, but it's very symbolic.",
            "Are the try and the we have a confusion over the name out limit?",
            "You know all over?",
            "You know the big outline, but I actually the outline is the Korean word.",
            "It has the meaning of the harmony.",
            "So anyway the sort looks purchase the domain Outlook.com and we made the poster."
        ],
        [
            "So other infrastructure like Comet Comet for the ontology libraries, and CVF.",
            "This is very interesting."
        ],
        [
            "And.",
            "And also I'd like to introduce a as well for the semantic infrastructure to make the original system based on."
        ],
        [
            "Where?",
            "OK, so it looks I'm a present and they see oversold trucks and we have 880 people and we have HELT laboratory.",
            "It perform CUFP 6 and 57."
        ],
        [
            "OK, we have a business based on ontology for the knowledge accessing like researching and the ubiquitous."
        ],
        [
            "Computing so here is my final slide, so we learned many things from the industry.",
            "The first one, so is about the scalability.",
            "1 billion is not enough.",
            "I believe that more than 10 and 100 billion we need for achieving such scalability.",
            "It's impossible to use just one machine.",
            "We need to consider the distributed computing for handle such, you know.",
            "The high scalable system and also data interoperability is the key for the next generation mobile services in industry and also for the ubiquitous computing.",
            "And we found the value of application like a semantic search, personalization and recommendation in the near future.",
            "And also the in Korean in Japan, many people are trying to use semantic technology and semantic web to the real web based services."
        ],
        [
            "OK, thank you.",
            "Alright West, please thank you Tony for bringing such a interesting use.",
            "Cases of semantic web application in Asia.",
            "So we have about 3 minutes left.",
            "Anybody have questions but only here?",
            "Excuse me over there.",
            "Yes.",
            "Hey, very nice presentation.",
            "Can you give us some more insights into in addition to just using the triple stores, what the semantic technologies are doing for you?",
            "What kind of reasoning you are using like my question mainly is that if you had databases in the background, would you be able to do the same things?",
            "Yeah, actually in current industry we don't need the, you know the reasoning.",
            "I mean that the light is too enough for us there socializing.",
            "So and in the business domain, especially for the reasoning in some case, in many cases we need the rule based reasoning becausw are in the business domain.",
            "The subsumption reading is not enough for.",
            "Finding new data and for you know the evaluated result.",
            "So the.",
            "It is the correct answer for you.",
            "So level, where are you know the expressibility is, the our light is enough for and we are using the substantial reasoning and also the rule based reasoning.",
            "We need both one both.",
            "K thank you.",
            "Danny."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon, my name is Tony from Salt rocks Korea.",
                    "label": 0
                },
                {
                    "sent": "Actually I just arrived in this morning from Korea so I still have jet lag so it means that I can sleep in my presentation.",
                    "label": 0
                },
                {
                    "sent": "OK, so title of my presentation is about the semantic web in Asia.",
                    "label": 1
                },
                {
                    "sent": "It's focusing on the user cases by using semantic technology.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So I introduced several user cases in Asia, especially in Korea, and I introduce the infrastructure for the vision system and so I introduce our companies or troops.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is overview and introduction of the user cases.",
                    "label": 0
                },
                {
                    "sent": "We found that there are four different types of user cases and applications in Asia like semantic search.",
                    "label": 1
                },
                {
                    "sent": "Based on semantic metadata and in careers, so it's very interesting.",
                    "label": 0
                },
                {
                    "sent": "Thanks for the mobile environment based on certain generation or 3.5 generation mobile environment the telecom company wanted to improve their infrastructure more intelligent so the sort troops and other companies have many experience in this field.",
                    "label": 0
                },
                {
                    "sent": "This Picture folder recommendation of content and the Prince Analyzation of mobile phone and mobile.",
                    "label": 0
                },
                {
                    "sent": "Services and also the in Korean in Japan.",
                    "label": 0
                },
                {
                    "sent": "There are lots of ubiquitous computing project, especially in Korea and Japan.",
                    "label": 0
                },
                {
                    "sent": "We have you city project, Ubiquitous City in Korea.",
                    "label": 0
                },
                {
                    "sent": "We have more than five different ubiquitous city project.",
                    "label": 0
                },
                {
                    "sent": "That is something about to establishing new whole City with the ubiquitous concept.",
                    "label": 0
                },
                {
                    "sent": "Like context, awareness and sensor networks, so in this area is also the ontology and semantic web were already, you know, implemented and the last one is about the semantic web like Semantic Wiki and semantic blow and also search Porter.",
                    "label": 0
                },
                {
                    "sent": "By using semantic technology.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the first one, I'd like to introduce the Project commercial project from the Korean government, the Agency for accumulating and preserving historical records of government to knock.",
                    "label": 1
                },
                {
                    "sent": "And not prepared the two years to introduce ontology and semantic technology for their services.",
                    "label": 0
                },
                {
                    "sent": "And they finish this service.",
                    "label": 0
                },
                {
                    "sent": "And Korean people are using this service.",
                    "label": 0
                },
                {
                    "sent": "OK, in this service there are five different technical layers from the legacy data layer to the application layer in here.",
                    "label": 0
                },
                {
                    "sent": "In this project the We utilize the Triple Store.",
                    "label": 0
                },
                {
                    "sent": "And then rebase the reasoning engine for the interoperability of data and also for the more semantic and more intelligent searching systems.",
                    "label": 0
                },
                {
                    "sent": "And in this project we found the big.",
                    "label": 0
                },
                {
                    "sent": "We faced big holders something about the performance versus the scalability in this agent.",
                    "label": 0
                },
                {
                    "sent": "They have more than 70 million documents and they want to do to generate the semantic metadata from the oradell records.",
                    "label": 0
                },
                {
                    "sent": "So it might be more than 1 billion three proofs and each was up to 10 billion trippers, so we had to handle such a huge amount of three.",
                    "label": 0
                },
                {
                    "sent": "Plus in this project.",
                    "label": 0
                },
                {
                    "sent": "OK, uh.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, in this project, one of the main aims is about the material into probability based on semantic meta data repository's.",
                    "label": 0
                },
                {
                    "sent": "In this project, the project team applied the ISO an ICIEC 11179 for developing dental ontology and also the in this project projected team used on teologi.",
                    "label": 0
                },
                {
                    "sent": "Instantiation technologies by using rules and information extraction system like natural language processing, and also this system now stored about one and half billion 3% this system.",
                    "label": 0
                },
                {
                    "sent": "And in this system, OK the.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Application is something about searching with the meaning.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K Second UK support semantic search.",
                    "label": 1
                },
                {
                    "sent": "It is about the digital library carries.",
                    "label": 0
                },
                {
                    "sent": "It is also government agency for the education and the research materials in this agency.",
                    "label": 1
                },
                {
                    "sent": "Two years ago they started to make a new service based on ontology and reasoning.",
                    "label": 0
                },
                {
                    "sent": "In this project the fundamental requirement for this project was something like that.",
                    "label": 1
                },
                {
                    "sent": "Large scale this semantic.",
                    "label": 0
                },
                {
                    "sent": "I'll more than 100 million 3% in two years ago and one of their requirements was.",
                    "label": 1
                },
                {
                    "sent": "The high performance reasoning to under the opening to 5 second with the reasoning and ontology.",
                    "label": 0
                },
                {
                    "sent": "And so it looks implemented these searching services by integrating of reasoning and search engines, and we tried to make semantic annotation system.",
                    "label": 0
                },
                {
                    "sent": "OK, so the society is running well based on so many technologies and this service Porter provides a recommendation of paper or the researchers like Professor for the researcher.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K are the second user cases.",
                    "label": 0
                },
                {
                    "sent": "Is something about the mobile platform.",
                    "label": 1
                },
                {
                    "sent": "This is quite interesting for me because you know, mobile industry is so huge.",
                    "label": 0
                },
                {
                    "sent": "So it we found the rear optimistic opportunities in these areas.",
                    "label": 0
                },
                {
                    "sent": "His picture for the mobile content recommendation and personalization.",
                    "label": 1
                },
                {
                    "sent": "So conventionally, the companies used utilized the data mining architecture, but they realize that there are many limitations.",
                    "label": 0
                },
                {
                    "sent": "By using only data mining, so they want to to utilize ontology, an reasoning architecture for the mobile environment and SCT or the Ctfu tried to evaluate the technology.",
                    "label": 0
                },
                {
                    "sent": "And Korea Telecom Freetel is one of the largest mobile company in Korea.",
                    "label": 1
                },
                {
                    "sent": "And during last two two years they invested money to make no comment.",
                    "label": 0
                },
                {
                    "sent": "Intelligent platform based on ontology and semantic technologies and we faced the big problem about also the scalability.",
                    "label": 0
                },
                {
                    "sent": "Huge huge scalability.",
                    "label": 0
                },
                {
                    "sent": "More than 10 billion triples because you know every time you know a person called calls to the other.",
                    "label": 0
                },
                {
                    "sent": "This is our legacy system and network can generate large bunch of data and they want to to transfer such kind of dynamic data to the trippers based on ontology.",
                    "label": 0
                },
                {
                    "sent": "So it was really hard to overcome.",
                    "label": 0
                },
                {
                    "sent": "It means that we have to handle the both sides of a coin.",
                    "label": 0
                },
                {
                    "sent": "The performance is real time performance is for the mobile environment and also the huge amount of scalability.",
                    "label": 0
                },
                {
                    "sent": "And the left side of this slide shows about preferred structures of and the DC system is based on the IMS infrastructures.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This slide shows about the service platform.",
                    "label": 0
                },
                {
                    "sent": "Based on IMS Network, this is system can can gather the legacy data from the legacy systems like a Cdr stores and membership services, histories or other.",
                    "label": 1
                },
                {
                    "sent": "You know profiles from user, the mobile phone and this system can generate the knowledge base based on ontologies and you know the consist of trippers and seems like here.",
                    "label": 0
                },
                {
                    "sent": "That this the middleware system can handle such knowledge base by using rules and reasoning architectures.",
                    "label": 0
                },
                {
                    "sent": "And we achieved the personal recommendation and personalized the services based on IMS, infrastructures and ontology and Semantic Web.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this slide also shows a floor from the latest data to the.",
                    "label": 0
                },
                {
                    "sent": "You know the context of Wellness and also other discovering of the intelligent data.",
                    "label": 0
                },
                {
                    "sent": "Ice.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Keep this one.",
                    "label": 0
                },
                {
                    "sent": "So another interesting things.",
                    "label": 0
                },
                {
                    "sent": "Is the social network analysis is specially our client and soul troops were interested in the mobile social network analysis so that we analyzed the whole phone core of KTF and we are could generate the social network.",
                    "label": 1
                },
                {
                    "sent": "We do every phone calls and we did the information over location seems like that and we apply the ontologies and rule like this one.",
                    "label": 0
                },
                {
                    "sent": "We use the F logic in this project and then you can.",
                    "label": 0
                },
                {
                    "sent": "We can find The Who is who.",
                    "label": 0
                },
                {
                    "sent": "It means that who is someone's father and wife and also the friends or something like that by using ontology and.",
                    "label": 0
                },
                {
                    "sent": "Rules so you know it's very interesting and also symbolic.",
                    "label": 0
                },
                {
                    "sent": "The result to be cause the telecom company want to to make a new business model like advertisement.",
                    "label": 0
                },
                {
                    "sent": "So they want to, to, you know the evaluate the person who is the more important and who is who could be the how can I say at the core over networks?",
                    "label": 0
                },
                {
                    "sent": "So the we are made this such an enlarging system to any large dynamic phone calls and also the we could generate the semantic metadata based on semantic networks.",
                    "label": 0
                },
                {
                    "sent": "It was very interesting well.",
                    "label": 0
                },
                {
                    "sent": "And here is.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The rear walking the application, the snapshot of application.",
                    "label": 0
                },
                {
                    "sent": "Send the Dojo applications are working on the Samsung Mobile phone.",
                    "label": 0
                },
                {
                    "sent": "And there are many applications logging on now.",
                    "label": 0
                },
                {
                    "sent": "This intelligent platform, like a personalized you know main screen and recommendation.",
                    "label": 1
                },
                {
                    "sent": "And the private management, and also the context based tour information and the shopping recommendation and view the recommendation based on his activities and his.",
                    "label": 1
                },
                {
                    "sent": "How can I say?",
                    "label": 0
                },
                {
                    "sent": "The social network and also his preference is the most important technology was down analyzing of users preferences.",
                    "label": 0
                },
                {
                    "sent": "So we utilize the apology and reasoning rules and also we use the subsumption reasoning to find the preferences of users.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Here is another user cases for ubiquitous computing.",
                    "label": 1
                },
                {
                    "sent": "Katie is our largest telecommunications company in Korea.",
                    "label": 0
                },
                {
                    "sent": "Like to each telecom and entity, and this project was started before five years ago and I want to have your so go.",
                    "label": 0
                },
                {
                    "sent": "This project was finished well and this project was to develop the middleware platform for context awareness services feature for the home networks and for the car navigation system.",
                    "label": 1
                },
                {
                    "sent": "And in this project salt looks and Katie introduced the OS GI framework for the Midway architectures and we developed the digit kind kind of under materials based on regionals and some kinds of interface engines or knowledge repositories.",
                    "label": 0
                },
                {
                    "sent": "Also we use the owl and F logic together in this project.",
                    "label": 0
                },
                {
                    "sent": "And nowadays this middleware is used for developing the intelligent robot and IPTV for the exposure for the recommendation of content for the users.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK then here is a snapshot and I will show you the demonstration.",
                    "label": 0
                },
                {
                    "sent": "OK, there are no sound but.",
                    "label": 0
                },
                {
                    "sent": "So the left side is not a virtual reality.",
                    "label": 0
                },
                {
                    "sent": "Is the emulation the environment so the every you know the activities in the environment then the middleware can get the sensor information, then that this middleware ordered two orders to the optimum appliances.",
                    "label": 0
                },
                {
                    "sent": "And if other people together then this system can reserve the completion of.",
                    "label": 0
                },
                {
                    "sent": "Preferences seems like that, and also I'll move a little more.",
                    "label": 0
                },
                {
                    "sent": "Then here this is a new terminal and look at this one.",
                    "label": 0
                },
                {
                    "sent": "This is a test bed.",
                    "label": 0
                },
                {
                    "sent": "We'd know you can see though, the opening of cotton and also the turn on the light, something like that.",
                    "label": 0
                },
                {
                    "sent": "So anyway, that we developed the this middleware for the intelligent to home networks by using reasoning and ontologies and it worked well and we are already commercialized.",
                    "label": 0
                },
                {
                    "sent": "The diameter air for the many user cases and applications.",
                    "label": 0
                },
                {
                    "sent": "OK, I used it stop this one.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "K.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "So nowadays, so to see an other, companies try to make a huge platform for handling a whole city, like Ubiquitous City and now Korean government and the Samsung trying to make a build new infrastructure for the ubiquitous cities.",
                    "label": 1
                },
                {
                    "sent": "And the salt looks contributed has contributed to this project.",
                    "label": 0
                },
                {
                    "sent": "By using ontology and semantic technologies, especially for this project, we already know evaluated the performances and you know technology about the ubiquitous intelligent transportation system.",
                    "label": 0
                },
                {
                    "sent": "It means that by using reasoning engines, the middleware or media platform of ubiquitous society can handle the traffics and can.",
                    "label": 0
                },
                {
                    "sent": "Give some message to the traffic controller and also this project is undergoing under development.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now I'd like to introduce several other user cases about semantic web.",
                    "label": 0
                },
                {
                    "sent": "It specially assault looks are just opened feature on the Semantic Porter.",
                    "label": 0
                },
                {
                    "sent": "This semantic Porter is based on the Semantic wiki and Semantic Blog.",
                    "label": 1
                },
                {
                    "sent": "Actually the semantic wiki is quite different from the you know the current semantic wiki and we used Web 2.0 concept like RIA and Ajax technologies in this project and.",
                    "label": 1
                },
                {
                    "sent": "Most interesting things that they we introduced the RDF a for the tagging.",
                    "label": 0
                },
                {
                    "sent": "So the in this semantic voters or content can have the RDF tag inside you know the content.",
                    "label": 0
                },
                {
                    "sent": "Ki will show you something.",
                    "label": 0
                },
                {
                    "sent": "K so I'm so sorry.",
                    "label": 0
                },
                {
                    "sent": "Almost content you know written in Korean so you cannot understand.",
                    "label": 0
                },
                {
                    "sent": "But anyway, this is the new interpreter of our site.",
                    "label": 0
                },
                {
                    "sent": "And there are many.",
                    "label": 0
                },
                {
                    "sent": "Are the interactive things.",
                    "label": 0
                },
                {
                    "sent": "By using the architectures and a jobs.",
                    "label": 0
                },
                {
                    "sent": "And in here.",
                    "label": 0
                },
                {
                    "sent": "OK, so people moving here, you can find the keyword like wiki and beside Wiki you can find the LDF tag here and every kind of these syndicated content were from the knowledge base with our dev, tag and tripper curing things like that and also.",
                    "label": 0
                },
                {
                    "sent": "In this is one of the Porter of Activision, so these two these two people sharing the 4th in our company we have about more than 80 now people, persons and every employees has his own the 4th in this company and in here so you know the fundamentals of the portal consists of the blogs and wiki.",
                    "label": 0
                },
                {
                    "sent": "KR here is the samples of the web pages we can blow.",
                    "label": 0
                },
                {
                    "sent": "I mean that the.",
                    "label": 0
                },
                {
                    "sent": "All every content and topics.",
                    "label": 0
                },
                {
                    "sent": "Has each on the blogs and wiki coupled.",
                    "label": 0
                },
                {
                    "sent": "And here is the block and I will introduce about how we can make the semantic weekend semantic blow.",
                    "label": 0
                },
                {
                    "sent": "But I found some problem in here about the network speed you can find here the on ontology and when you over the mouse on this icon.",
                    "label": 0
                },
                {
                    "sent": "Then this system can you know Curie the triple path.",
                    "label": 0
                },
                {
                    "sent": "OK can I move?",
                    "label": 0
                },
                {
                    "sent": "And also in the weekend blow you can generate all the F tag and adult F tag.",
                    "label": 0
                },
                {
                    "sent": "Taxes are included automatically inside.",
                    "label": 0
                },
                {
                    "sent": "HTML and I will demonstrate about that if I.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Drop and push the right button and you can find.",
                    "label": 0
                },
                {
                    "sent": "Our semantic, you know, tagging editors.",
                    "label": 0
                },
                {
                    "sent": "And it will walk.",
                    "label": 0
                },
                {
                    "sent": "It's too slow because of the network.",
                    "label": 0
                },
                {
                    "sent": "Oops.",
                    "label": 0
                },
                {
                    "sent": "I show you later.",
                    "label": 0
                },
                {
                    "sent": "It's because of the traffic.",
                    "label": 0
                },
                {
                    "sent": "Something like that.",
                    "label": 0
                },
                {
                    "sent": "OK, like this.",
                    "label": 0
                },
                {
                    "sent": "This is the window for editing the triples, each more familiar for the users better than the conventional semantic wiki, and this system is integrated with knowledge base like triple stores and reasoning engines, and you can find the previous trippers and you can print a three person here.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry it's too slow.",
                    "label": 0
                },
                {
                    "sent": "OK, I'll continue my presentation.",
                    "label": 0
                },
                {
                    "sent": "K so this sorta looks has each owns many quota based on semantic weekend semantic blogs and it consists of RDF A and the knowledge base.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With the three press and another user cases we have it show about the web scale.",
                    "label": 1
                },
                {
                    "sent": "Semantic searching system for more than the 100 million web document.",
                    "label": 0
                },
                {
                    "sent": "Is it this system can gather the cruel.",
                    "label": 0
                },
                {
                    "sent": "The large of information like blogs and webpages and uses and this system can generate the three pools and extracted the information from the structure of the document and also this system can.",
                    "label": 0
                },
                {
                    "sent": "Evaluate their of each other concept and relationship so it's very interesting things that I will show you.",
                    "label": 0
                },
                {
                    "sent": "True about that.",
                    "label": 0
                },
                {
                    "sent": "OK, DC is the you know the working result.",
                    "label": 0
                },
                {
                    "sent": "I print the keyword Myung Lee is the name of the President of Korea, and this system can only large the last bunch of the web content and blocks and this system found several related keywords in here.",
                    "label": 0
                },
                {
                    "sent": "OK, I read the blogs, news and many things and actually this is system that architecture of the system is based on.",
                    "label": 1
                },
                {
                    "sent": "The three person ontologies.",
                    "label": 0
                },
                {
                    "sent": "So every content to already know the annotated we don't ologist.",
                    "label": 0
                },
                {
                    "sent": "And here is you can find the several information like you know meta information.",
                    "label": 0
                },
                {
                    "sent": "Also this kind of metadata.",
                    "label": 0
                },
                {
                    "sent": "Were extracted from the unstructured data and stored in the trip restore and several statistics.",
                    "label": 0
                },
                {
                    "sent": "If I can click here then that you can find the other big picture.",
                    "label": 0
                },
                {
                    "sent": "The semantic network, something like.",
                    "label": 0
                },
                {
                    "sent": "This and if I click here then you can navigate automatically extracted knowledge from the web and also this system can extract metadata from the web if I can if I click here then the bug name is a person.",
                    "label": 0
                },
                {
                    "sent": "Oops.",
                    "label": 0
                },
                {
                    "sent": "Matt worked well.",
                    "label": 0
                },
                {
                    "sent": "OK, like this and the DC system already extracted automatic data semantic meta data from the web and the find the pictures from the web, which is very interesting.",
                    "label": 0
                },
                {
                    "sent": "OK, it's time to finish.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is system is based on the grid architecture, so lots of computers are working together.",
                    "label": 0
                },
                {
                    "sent": "And the weekend, you know, damage each node of agreed architectures to gather the information from the web and turn allies to extract the semantic metadata and an enlarged the relationships.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, here is the add some comparison between the hour limit document google.com.",
                    "label": 0
                },
                {
                    "sent": "I don't believe that.",
                    "label": 0
                },
                {
                    "sent": "To be the competitor of Google, but it's very symbolic.",
                    "label": 0
                },
                {
                    "sent": "Are the try and the we have a confusion over the name out limit?",
                    "label": 0
                },
                {
                    "sent": "You know all over?",
                    "label": 0
                },
                {
                    "sent": "You know the big outline, but I actually the outline is the Korean word.",
                    "label": 0
                },
                {
                    "sent": "It has the meaning of the harmony.",
                    "label": 0
                },
                {
                    "sent": "So anyway the sort looks purchase the domain Outlook.com and we made the poster.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So other infrastructure like Comet Comet for the ontology libraries, and CVF.",
                    "label": 0
                },
                {
                    "sent": "This is very interesting.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And also I'd like to introduce a as well for the semantic infrastructure to make the original system based on.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where?",
                    "label": 0
                },
                {
                    "sent": "OK, so it looks I'm a present and they see oversold trucks and we have 880 people and we have HELT laboratory.",
                    "label": 0
                },
                {
                    "sent": "It perform CUFP 6 and 57.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, we have a business based on ontology for the knowledge accessing like researching and the ubiquitous.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Computing so here is my final slide, so we learned many things from the industry.",
                    "label": 0
                },
                {
                    "sent": "The first one, so is about the scalability.",
                    "label": 0
                },
                {
                    "sent": "1 billion is not enough.",
                    "label": 1
                },
                {
                    "sent": "I believe that more than 10 and 100 billion we need for achieving such scalability.",
                    "label": 0
                },
                {
                    "sent": "It's impossible to use just one machine.",
                    "label": 1
                },
                {
                    "sent": "We need to consider the distributed computing for handle such, you know.",
                    "label": 0
                },
                {
                    "sent": "The high scalable system and also data interoperability is the key for the next generation mobile services in industry and also for the ubiquitous computing.",
                    "label": 1
                },
                {
                    "sent": "And we found the value of application like a semantic search, personalization and recommendation in the near future.",
                    "label": 0
                },
                {
                    "sent": "And also the in Korean in Japan, many people are trying to use semantic technology and semantic web to the real web based services.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, thank you.",
                    "label": 0
                },
                {
                    "sent": "Alright West, please thank you Tony for bringing such a interesting use.",
                    "label": 0
                },
                {
                    "sent": "Cases of semantic web application in Asia.",
                    "label": 0
                },
                {
                    "sent": "So we have about 3 minutes left.",
                    "label": 0
                },
                {
                    "sent": "Anybody have questions but only here?",
                    "label": 0
                },
                {
                    "sent": "Excuse me over there.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Hey, very nice presentation.",
                    "label": 0
                },
                {
                    "sent": "Can you give us some more insights into in addition to just using the triple stores, what the semantic technologies are doing for you?",
                    "label": 0
                },
                {
                    "sent": "What kind of reasoning you are using like my question mainly is that if you had databases in the background, would you be able to do the same things?",
                    "label": 0
                },
                {
                    "sent": "Yeah, actually in current industry we don't need the, you know the reasoning.",
                    "label": 0
                },
                {
                    "sent": "I mean that the light is too enough for us there socializing.",
                    "label": 0
                },
                {
                    "sent": "So and in the business domain, especially for the reasoning in some case, in many cases we need the rule based reasoning becausw are in the business domain.",
                    "label": 0
                },
                {
                    "sent": "The subsumption reading is not enough for.",
                    "label": 0
                },
                {
                    "sent": "Finding new data and for you know the evaluated result.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                },
                {
                    "sent": "It is the correct answer for you.",
                    "label": 0
                },
                {
                    "sent": "So level, where are you know the expressibility is, the our light is enough for and we are using the substantial reasoning and also the rule based reasoning.",
                    "label": 0
                },
                {
                    "sent": "We need both one both.",
                    "label": 0
                },
                {
                    "sent": "K thank you.",
                    "label": 0
                },
                {
                    "sent": "Danny.",
                    "label": 0
                }
            ]
        }
    }
}