{
    "id": "quixtgw27gec55g2eq6sunwssrathasa",
    "title": "Optimizing Web Traffic via the Media Scheduling Problem",
    "info": {
        "author": [
            "Lars Backstrom, Facebook"
        ],
        "published": "Sept. 14, 2009",
        "recorded": "July 2009",
        "category": [
            "Top->Computer Science->Web Mining"
        ]
    },
    "url": "http://videolectures.net/kdd09_backstrom_owtvmsp/",
    "segmentation": [
        [
            "Thank you Daniel.",
            "So this is joint work with John Kleinberg and Robbie Kumar from Yahoo Research and today we can talk about what we've called the media scheduling problem and if you go through a lot of different websites you'll notice that sort of front and center they have this sort of fee."
        ],
        [
            "Shared item here.",
            "So Amazon is trying to sell you their Kindle flick."
        ],
        [
            "It has some photo that they think you might be interested in seeing."
        ],
        [
            "YouTube has a number of featured videos which."
        ],
        [
            "I hope you'll be interested in.",
            "And if you go to Yahoo, you'll notice that there's this featured news item right in the middle that they think you might want to read about."
        ],
        [
            "So.",
            "Well, we can think about is that sort of abstractly in all of these cases, some utility is gained through this sort of featured item by using that real estate on the web page and having that featured item.",
            "All of these sites, they're getting something, so that could be something sort of nebulous is sort of general user interest, or it could be something more concrete, like ad revenue on the linked pages, or in the case of Amazon, they actually have a product that they're trying to sell you, so it could just be direct revenue from product sales.",
            "But at this level we think there's some utility gain per impression every time.",
            "The user comes and sees that featured item.",
            "The website operator is giving something in the goal, then is to use that real estate in from the feature that slot and then maximize the utility that we gain sort of over the course of a day, and then the question is how can we do that given that we have a bunch of different things we could put in that item, how should we schedule them?",
            "And in our study were going from yahoo.com from the front page, and we're going to consider the University to be total clicks.",
            "And of course you know in some sense at the end of the day what Yahoo cares about is revenue.",
            "But you know, it sort of makes sense.",
            "They're trying to increase general user interest and that sort of leads to revenue and clicks.",
            "Of course, that's what we can observe in the server logs easily."
        ],
        [
            "So what's the framework?",
            "Well, the first thing that I should say is that we're not going to be talking about personalization, and there's certainly lots of scenarios where personalization would certainly be the way they go, and that might be better for certain things, but for better or worse, a lot of these websites, they don't have any personalization.",
            "They're showing the same thing to everybody, and that's the framework that we're going to consider throughout this talk.",
            "So, given that what we think about is that the website operator like Yahoo has this pool of items and all of the items are sort of knowing ahead of time, you know they have a bunch of stories that were written by either Yahoo employees or offsite or something, and there's some pool of them that they can use over the course of the day, and somehow they sort of know how good all of those items are and I'll sort of talk a little bit later about how they might know that ahead of time, but you know, they maybe have some historical data if its products.",
            "Or they can do some bucket testing and sort of early on to get an idea of how good these things are and what they want to do in order to get the most out of this featured item slot.",
            "'cause I want to come up with some sort of optimal schedule.",
            "It looks a little bit like this right?",
            "So they have a bunch of things.",
            "Bunch of different items and they picked these intervals so from 6 in the morning till 640 three they showed this article and then they switch over to this other article.",
            "May show that until 7:21 and they talk about Britney Spears probably for the rest of the day.",
            "Not really, but so there's three sort of."
        ],
        [
            "Things to consider when we're trying to do solve this optimization problem.",
            "So the first important component is that the traffic is varying throughout the day, so this shows at the beginning of the day, early in the morning the traffic is very low and it sort of goes up peaks around midday.",
            "There's maybe a little dip for lunch, and then it goes back down in the afternoon.",
            "So that's one thing that's."
        ],
        [
            "We're going to have to consider another thing.",
            "Is this idea of items staleness.",
            "So the longer we leave something in that featured slot sort of less utility we're getting per impression it, sort of.",
            "People become less interested in overtime and this just shows an example of the declining clickthrough rate overtime for a single article.",
            "As we leave that article on the website."
        ],
        [
            "And then finally, in this one is sort of obvious.",
            "Maybe there's a lot of item variation, right?",
            "Some things are just inherently better.",
            "They have more user interest, they generate more revenue, they have larger margins, whatever.",
            "So there's this huge variation in the items."
        ],
        [
            "Alright, so let's talk about those three in a little bit more detail.",
            "So the first thing is this varying traffic.",
            "And here we show the traffic, the number of visitors to yahoo.com over the course of three weeks, with each week on top of each other, and the things that you notice is that, well, it varies a lot from night at the bottom to middle of the day, and also you know different days are different.",
            "There's less peak traffic on the weekends.",
            "Friday afternoons people leave a little bit early, things like that.",
            "But what's important here is that.",
            "From one week to the next, it's pretty stable, with the exception of things like Holidays.",
            "This Wednesday is the same as last.",
            "Wednesday is the same as the Wednesday before, and you can see there's really almost no variation from one week to the next, and that's going to be important because when we're solving the scheduling problem, we're going to assume that we know what the traffic looks like for the day ahead of time."
        ],
        [
            "So the second thing is this idea of items staleness.",
            "So as we leave something up, you know we put it up there at 8:00 in the morning and then we leave it up there for half an hour by the end of that half an hour.",
            "It's lost a lot of its utility for us, and the primary reason for that is that this is a website that people are coming back to over and over again.",
            "If it's a portal like yahoo.com, somebody might come at 8:05 then again 8:15 and 8:25.",
            "And if the same thing is up there each time, there is almost certainly not going to click on it.",
            "More than once, right?",
            "Either they're going to reject the item right away the first time.",
            "Never click on.",
            "Or maybe they'll play.",
            "Kind of the first time, and then they won't click on it again.",
            "So what we're going to say just a little bit of notation is that for every article there's some sort of decay function in the utility, so the click through rate here is going down, and then they call the click through rate for Article IFI.",
            "Sub T where T is the number of minutes since it first appeared on the website.",
            "And I'll just note, sort of very briefly that if we try to fit some curves to this decline clickthrough rate, it seems like an exponential decay curve fits best, and we'll sort of talk a little bit more about that later."
        ],
        [
            "So the third thing which I mentioned is this idea of item variation and here we can just see a distribution of how good all the articles that Yahoo placed over the course of these three weeks that we observed were.",
            "And you can see there's some of the best articles are orders of magnitude better than the worst ones.",
            "Um?",
            "And what's important is that we can observe most of this ahead of time, right?",
            "In this problem we need to be able to sort of know how good something is before we schedule it.",
            "And in the case of Yahoo, you can imagine that what you do is you know what the articles are ahead of time.",
            "Say you have 40 of them over the course of the day.",
            "So first thing in the morning you split up all of your traffic into four different buckets, and then you sort of use that bucket testing to get an idea of how good all of the articles are.",
            "So that."
        ],
        [
            "Allows us to sort of formalize this problem, so we have these different components.",
            "Here's the traffic curve and we want to do is come up with the schedule that looks sort of like this.",
            "We divided the whole day into all of these intervals and we place different articles in each interval and then what you can think about doing is you have some click through rate here and you sort of multiply that by the amount of traffic that gives you the number of clicks at that time.",
            "Then you add up over the course of the whole day, and that's the objective is to maximize the total number of clicks over the whole day."
        ],
        [
            "OK, so.",
            "And then this work.",
            "As I mentioned we're using this yahoo.com, that's it, and we're trying to optimize this spot here.",
            "So we had these three weeks of data from 2008, and they had this whole number of page views, so we knew exactly what the traffic was and were also able to extract the clickthrough rates for the articles that were actually placed up on the website, which means that we can sort of good idea of what these functions look like, because, well, they only last for a certain amount of time.",
            "I mean, the other is taken down after awhile, but they're up there long enough that we get a good idea of what they look through.",
            "Sort of going forward.",
            "OK, So what is these utility click through rates?"
        ],
        [
            "So this is just a sampling, a few articles and you can see that this one here was much much better.",
            "It starts with a much higher clickthrough rate.",
            "And what we observed when we started to look at the data is that, well, yes, there's a lot of variation because some things are better than others.",
            "But sort of given the starting point, things follow roughly the same trend, right?",
            "If you sort of start low, you're going to sort of follow the same trajectory.",
            "They're not sort of diverging from different starting from the same starting point.",
            "And."
        ],
        [
            "But turn out was that we could sort of align all of them to this single universal curve, and this is a little bit of a tricky concept, I think.",
            "But if you sort of look carefully at this curve, what you'll see is that there's many, many curves, sort of embedded along this sort of large fuzzy curve, and what we've done here is taking all of the clickthrough rates for all of these articles that we observed, and we've sort of shifted them along this axis and then place them all there, and they all sort of fit within that once we shift them.",
            "They fit along this single universal curve."
        ],
        [
            "So you can think here, for example, is what one article might look like.",
            "It has some offset.",
            "It starts at this click through rate and then it follows this universal curve from there, right?",
            "So we can say that for every article there's some Sigma which defines how far along this universal curve we start.",
            "And well, sort of.",
            "The exponential decay doesn't fit quite as well as sort of the best universal curve.",
            "It turns out that it's a pretty close approximation, and So what we'll use that gives us a good way to fit sort of a smaller if we only observe the 1st 20 minutes of an article, we can sort of use some exponential decay, because that seems like a good fit to extend the click through rate.",
            "Beyond that, and we're going to need to be able to do that when we sort of start talking about algorithms and thinking about.",
            "Rescheduling things.",
            "So the point then is that The thing is, is the other thing that's important here is that.",
            "Because this is universal curve, if we can figure out sort of the Y intercept what the value of F50 that tells us where this offset is, and this sort of enables you to do this.",
            "Bucket testing which I mentioned earlier, and if I can figure out what the click through rate is just for the first few minutes, I sort of can predict the click through rate for the rest of time for that one article."
        ],
        [
            "So.",
            "When we start designing, algorithms were going to.",
            "It turns out that in general the problem is NP hard.",
            "So if we don't make any assumptions about the data or the click through rates or anything were to not going to be able to do very well for large numbers of articles right now if we have to think about if there's any articles and factorial different permutations, we can do a little better than that.",
            "Using something like programming.",
            "But you can see here that it still sort of has this exponential.",
            "And together, we're going to have to use some observations about the data that we observed and the key thing is going to be that everything fit along that one universal curve which was monotonically decreasing right?",
            "And that sort of makes sense that you expect to click through rate to decrease overtime.",
            "So think about how we could maybe design A polynomial algorithm to solve this problem.",
            "Let's think about."
        ],
        [
            "Special case where the traffic pattern is monotonically increasing, so that's sort of the case early in the day, right?",
            "When people are getting to work and the traffic is going up.",
            "And really, is sort of a simple argument to show that an optimal ordering is just to take all of the articles and sort them from worst to best.",
            "So how does that?",
            "So here in order to do the proof we have this traffic.",
            "It's increasing.",
            "And imagine that there was some sort of inversion, right?",
            "So here things are ordered."
        ],
        [
            "In different way I have the better article first.",
            "Well what I can do is swap them in such a way that the traffic in this region remains unchanged, right?",
            "But the traffic sort of over here goes up."
        ],
        [
            "And every year it goes down.",
            "So we sort of lose some click through rate in this area, right?",
            "Because we are now."
        ],
        [
            "The worst article there, but we gained some over there and it turns out that the area of sort of this loss if you were to integrate is the same as the area of the gain.",
            "But then you need to think that you're multiplying this by the total traffic and in this region the traffic is higher than in this region and so by performing that swap you end up doing strictly better, which shows that in the case when the traffic is increasing we have this simple ordering, which we know is optimal."
        ],
        [
            "So it turns out that decreasing traffic is a similar case.",
            "It's just sort of the opposite way.",
            "Instead of ordering from worst to best to order from best to worst.",
            "So that tells you what the ordering is, and then if you want to actually find the schedule well, you need to do a little bit more.",
            "You need to use some dynamic programming, so here this sort of gives you an idea of how that goes for the case where the traffic is monotonically increasing.",
            "What we've done, we know what the ordering is, it's from worst to best, and so we've scheduled the worst sort of couple articles already and they end here and then what we need to do is just figure out what's the interval length for the next worst article so we know that it's somewhere along here and you use this dynamic program too.",
            "Solve the whole thing and get the optimal solution.",
            "In this case where the traffic is increasing and all of these functions are along this universal decay.",
            "OK, so that's the increasing case, but of course that's not what we have, right?",
            "We have."
        ],
        [
            "Sort of some more general traffic, but if you sort of remember back the traffic was roughly unimodal, right?",
            "It sort of goes up in the morning peaks and then it goes down.",
            "There was this sort of dip for lunch, but to a close approximation it's just single peaked.",
            "So what can we do in that case?",
            "Well?",
            "Sort of, if we could divide it up into the upper part in the down part, we already know how to solve both of those, and that doesn't quite get us there because of course there's an exponential number of ways to partition the articles between those two halves, but it turns out that we can use a slightly more dynamic programming algorithm to do the whole thing at once, and the way we think about that sort of is that we're putting the best articles here in the middle where the traffic is highest, and imagine that you've sort of scheduled the best three articles, and they sort of span this peak region, and now I need to think where should I put?",
            "The 4th best article?",
            "Well, it's either going to sort of to the right what I already have scheduled over here, or it's going to the left of what's scheduled and do that program and you can solve this whole thing for this unimodal case.",
            "So at this point."
        ],
        [
            "Are we done?",
            "We've shown that to a close approximation we have this single universal decay curve, which all these click through rates fit to an that.",
            "Given that if the traffic is unimodal we can efficiently solve the optimal schedule in polynomial time.",
            "So that's good.",
            "But if you sort of think back well, the traffic wasn't quite unimodal.",
            "So how does it work in reality?",
            "So what we did was we went back and looked at the data and so this is what the traffic actually looked like.",
            "You can see that there's this big dip here.",
            "And so it's not quite unit model and we can go and look at the historical clickthrough rates for all the articles that were scheduled over a day, right?",
            "So the Yahoo editors picked some to the verticals and they placed them for some intervals.",
            "And what we do is extract from the data that we have what these click through rate decay curves look like.",
            "And because we know that they lie along this one sort of universal curve, we can extend them beyond the actual lifetime that they had on the website.",
            "And so then we can run our algorithm and.",
            "We find is that even though the traffic isn't quite unimodal, even though it has this dip, our algorithm compared to this exponential algorithm, which we could actually afford to run.",
            "You know, obviously it takes longer, but it wasn't so bad that we could do it.",
            "So when we compare our algorithm to the actual optimal."
        ],
        [
            "Were always within .1%, so we're pretty much giving the right answer.",
            "And if you look at this schedule, you can see there's actually two curves here.",
            "If you look very closely, one of them is our algorithm and one of them is the optimal, and maybe you can see there's a slight difference there, but for the most part pretty much the same.",
            "And then the other thing that compared to, of course, is how many clicks did the editor choices get.",
            "And for that one where they go back?",
            "OK, sorry for that one.",
            "We win by a lot 26% over the course of these three weeks.",
            "OK, so the last thing I'm going to talk just very briefly about is looking at why do they click through rates, decline overtime and when we started looking at this, that's sort of a big part of this is being able to make this assumption that there's this one sort of universal decay curve and we came up with this fairly simple sort of generative model which incorporates a few things about the Yahoo visitors which we observed in the server logs, and basically there's three parts, right?",
            "Different visitors sort of come to the website at different rates.",
            "You know some people are visiting much more frequently than others, and so we have some distribution over how often everybody comes and then another component is that given that you visit four times a day, there's some sort of interarrival gap distribution.",
            "So if you visit it 8 in the morning, maybe it's not sort of a uniform distribution over the rest of the day.",
            "Maybe you're more likely to come back and short intervals.",
            "And so we have those two distributions so far.",
            "We have a distribution.",
            "Given your visit rate distribution, what's your interarrival gap time distribution?",
            "And then finally we have this attenuation curve which we observed in the data.",
            "So given that I come to the website say 3 times and the same article has been up all three times, what's the probability that I'll click on that article the first time I see it?",
            "The second time, I see that the third time I see that which is this decaying function which we actually observe from the data, and then we can perform these simulations.",
            "And we get these two curves, one of which let's see the red one is the actual clickthrough rate that we observed for one article, and the Green one is what our simulation suggests it would be, and you can see that they align pretty closely, which makes us think that these are the sort of important ingredients for why we have this decline.",
            "So finally a few sort of further directions for this.",
            "One thing that we're not able to do."
        ],
        [
            "So, and I think would be very interesting is what can we do if we have new items appearing over the course of the day right?",
            "And all of our scenarios?",
            "We're thinking about websites where sort of everything is available ahead of time and I can do this combinatorial scheduling problem.",
            "You know, sort of with perfect information, but what happens if you're someone like CNN and you have new things, new stories appearing, and maybe they appear according to some distribution, then what should you do?",
            "The other sort of obvious thing is how can I combine this fall with personalization?",
            "What can I do if everybody sort of sees something else?",
            "And the results about sort of this general model suggests that you should sort of if somebody's already seen something, then maybe you should show them something else the next time.",
            "Or maybe you should only show them one article or one item a couple times, or something like that.",
            "Case of YouTube, we saw that there were multiple featured items, right.",
            "There were a lot I think 4 different videos and if you have that scenario sort of how can you extend this even in the same framework where you know everything ahead of time and finally we only have this one data set.",
            "Unfortunately and so it's sort of an open and I think important question to what extent do these assumptions apply to other data sets?",
            "I would expect the traffic given modality is pretty general.",
            "I guess I've seen that other places, but to what extent is there this sort of single universal decay curve that?",
            "We observed in other data sets.",
            "And that's it."
        ],
        [
            "There is a few minutes for questions.",
            "Questions.",
            "Were there any cases where that's an article was taken down after some time, and then maybe later in the day, put back up and in that case, what happens to the Cdr?",
            "Does it just start where it left off, or is there is fine?",
            "That's an excellent question, and I think I mean that's one consideration is what can you do sort of and what happens in that case?",
            "We didn't consider that we in the framework that we were considering you only had an article up once for one contiguous interval.",
            "For whatever reason, we for the most part that it almost never happens that an article goes down and comes back up.",
            "There are a few instances in the data set where that happens, and it's sort of somewhere in between.",
            "So you see the click through rate goes down for awhile and then they take the article off for a few hours or something, and then it comes back up and it doesn't quite start where it left off, but it also doesn't start at the same point that started before.",
            "It's sort of somewhere in between.",
            "If you think about that, sort of makes sense right?",
            "Because some of the people side, you know hours before when it was there and those people aren't clicking again, so it's sort of recover some, but not all the way.",
            "Other questions.",
            "Testing that uses basically behave different than ours, and then maybe you have like different curves.",
            "Actually, instead of just one right?",
            "Yeah, so somebody make sure everyone heard.",
            "So the question is, do you have the same article and you started at 8:00 o'clock?",
            "You might start with a different click through rate than if you started at noon, right?",
            "Because people are sort of looking for different things in the morning then they're looking at noon, and I think that that's probably the case.",
            "I think that people are looking for finance news.",
            "At one time the day and not in the evenings or something like that.",
            "Unfortunately, we don't really have an opportunity to observe that very much, because in our data the articles start at one point and another point, and we don't really have any way to disambiguate whether they click through rate is just a function of the article, or whether it's some combination, because we only have that one data point.",
            "Uses behave differently.",
            "Right?",
            "Right, yeah, no.",
            "I mean, I think that's probably the case and I don't.",
            "My suspicion is that it's not a huge effect, but I think that there probably is some effect like that."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you Daniel.",
                    "label": 0
                },
                {
                    "sent": "So this is joint work with John Kleinberg and Robbie Kumar from Yahoo Research and today we can talk about what we've called the media scheduling problem and if you go through a lot of different websites you'll notice that sort of front and center they have this sort of fee.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Shared item here.",
                    "label": 0
                },
                {
                    "sent": "So Amazon is trying to sell you their Kindle flick.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It has some photo that they think you might be interested in seeing.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "YouTube has a number of featured videos which.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I hope you'll be interested in.",
                    "label": 0
                },
                {
                    "sent": "And if you go to Yahoo, you'll notice that there's this featured news item right in the middle that they think you might want to read about.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Well, we can think about is that sort of abstractly in all of these cases, some utility is gained through this sort of featured item by using that real estate on the web page and having that featured item.",
                    "label": 1
                },
                {
                    "sent": "All of these sites, they're getting something, so that could be something sort of nebulous is sort of general user interest, or it could be something more concrete, like ad revenue on the linked pages, or in the case of Amazon, they actually have a product that they're trying to sell you, so it could just be direct revenue from product sales.",
                    "label": 1
                },
                {
                    "sent": "But at this level we think there's some utility gain per impression every time.",
                    "label": 0
                },
                {
                    "sent": "The user comes and sees that featured item.",
                    "label": 0
                },
                {
                    "sent": "The website operator is giving something in the goal, then is to use that real estate in from the feature that slot and then maximize the utility that we gain sort of over the course of a day, and then the question is how can we do that given that we have a bunch of different things we could put in that item, how should we schedule them?",
                    "label": 1
                },
                {
                    "sent": "And in our study were going from yahoo.com from the front page, and we're going to consider the University to be total clicks.",
                    "label": 1
                },
                {
                    "sent": "And of course you know in some sense at the end of the day what Yahoo cares about is revenue.",
                    "label": 0
                },
                {
                    "sent": "But you know, it sort of makes sense.",
                    "label": 0
                },
                {
                    "sent": "They're trying to increase general user interest and that sort of leads to revenue and clicks.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's what we can observe in the server logs easily.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what's the framework?",
                    "label": 0
                },
                {
                    "sent": "Well, the first thing that I should say is that we're not going to be talking about personalization, and there's certainly lots of scenarios where personalization would certainly be the way they go, and that might be better for certain things, but for better or worse, a lot of these websites, they don't have any personalization.",
                    "label": 0
                },
                {
                    "sent": "They're showing the same thing to everybody, and that's the framework that we're going to consider throughout this talk.",
                    "label": 0
                },
                {
                    "sent": "So, given that what we think about is that the website operator like Yahoo has this pool of items and all of the items are sort of knowing ahead of time, you know they have a bunch of stories that were written by either Yahoo employees or offsite or something, and there's some pool of them that they can use over the course of the day, and somehow they sort of know how good all of those items are and I'll sort of talk a little bit later about how they might know that ahead of time, but you know, they maybe have some historical data if its products.",
                    "label": 1
                },
                {
                    "sent": "Or they can do some bucket testing and sort of early on to get an idea of how good these things are and what they want to do in order to get the most out of this featured item slot.",
                    "label": 0
                },
                {
                    "sent": "'cause I want to come up with some sort of optimal schedule.",
                    "label": 0
                },
                {
                    "sent": "It looks a little bit like this right?",
                    "label": 0
                },
                {
                    "sent": "So they have a bunch of things.",
                    "label": 0
                },
                {
                    "sent": "Bunch of different items and they picked these intervals so from 6 in the morning till 640 three they showed this article and then they switch over to this other article.",
                    "label": 0
                },
                {
                    "sent": "May show that until 7:21 and they talk about Britney Spears probably for the rest of the day.",
                    "label": 0
                },
                {
                    "sent": "Not really, but so there's three sort of.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things to consider when we're trying to do solve this optimization problem.",
                    "label": 0
                },
                {
                    "sent": "So the first important component is that the traffic is varying throughout the day, so this shows at the beginning of the day, early in the morning the traffic is very low and it sort of goes up peaks around midday.",
                    "label": 0
                },
                {
                    "sent": "There's maybe a little dip for lunch, and then it goes back down in the afternoon.",
                    "label": 0
                },
                {
                    "sent": "So that's one thing that's.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're going to have to consider another thing.",
                    "label": 0
                },
                {
                    "sent": "Is this idea of items staleness.",
                    "label": 0
                },
                {
                    "sent": "So the longer we leave something in that featured slot sort of less utility we're getting per impression it, sort of.",
                    "label": 0
                },
                {
                    "sent": "People become less interested in overtime and this just shows an example of the declining clickthrough rate overtime for a single article.",
                    "label": 0
                },
                {
                    "sent": "As we leave that article on the website.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then finally, in this one is sort of obvious.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's a lot of item variation, right?",
                    "label": 1
                },
                {
                    "sent": "Some things are just inherently better.",
                    "label": 1
                },
                {
                    "sent": "They have more user interest, they generate more revenue, they have larger margins, whatever.",
                    "label": 0
                },
                {
                    "sent": "So there's this huge variation in the items.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Alright, so let's talk about those three in a little bit more detail.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is this varying traffic.",
                    "label": 1
                },
                {
                    "sent": "And here we show the traffic, the number of visitors to yahoo.com over the course of three weeks, with each week on top of each other, and the things that you notice is that, well, it varies a lot from night at the bottom to middle of the day, and also you know different days are different.",
                    "label": 0
                },
                {
                    "sent": "There's less peak traffic on the weekends.",
                    "label": 0
                },
                {
                    "sent": "Friday afternoons people leave a little bit early, things like that.",
                    "label": 0
                },
                {
                    "sent": "But what's important here is that.",
                    "label": 0
                },
                {
                    "sent": "From one week to the next, it's pretty stable, with the exception of things like Holidays.",
                    "label": 0
                },
                {
                    "sent": "This Wednesday is the same as last.",
                    "label": 0
                },
                {
                    "sent": "Wednesday is the same as the Wednesday before, and you can see there's really almost no variation from one week to the next, and that's going to be important because when we're solving the scheduling problem, we're going to assume that we know what the traffic looks like for the day ahead of time.",
                    "label": 1
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the second thing is this idea of items staleness.",
                    "label": 0
                },
                {
                    "sent": "So as we leave something up, you know we put it up there at 8:00 in the morning and then we leave it up there for half an hour by the end of that half an hour.",
                    "label": 0
                },
                {
                    "sent": "It's lost a lot of its utility for us, and the primary reason for that is that this is a website that people are coming back to over and over again.",
                    "label": 0
                },
                {
                    "sent": "If it's a portal like yahoo.com, somebody might come at 8:05 then again 8:15 and 8:25.",
                    "label": 0
                },
                {
                    "sent": "And if the same thing is up there each time, there is almost certainly not going to click on it.",
                    "label": 0
                },
                {
                    "sent": "More than once, right?",
                    "label": 0
                },
                {
                    "sent": "Either they're going to reject the item right away the first time.",
                    "label": 0
                },
                {
                    "sent": "Never click on.",
                    "label": 0
                },
                {
                    "sent": "Or maybe they'll play.",
                    "label": 0
                },
                {
                    "sent": "Kind of the first time, and then they won't click on it again.",
                    "label": 0
                },
                {
                    "sent": "So what we're going to say just a little bit of notation is that for every article there's some sort of decay function in the utility, so the click through rate here is going down, and then they call the click through rate for Article IFI.",
                    "label": 0
                },
                {
                    "sent": "Sub T where T is the number of minutes since it first appeared on the website.",
                    "label": 0
                },
                {
                    "sent": "And I'll just note, sort of very briefly that if we try to fit some curves to this decline clickthrough rate, it seems like an exponential decay curve fits best, and we'll sort of talk a little bit more about that later.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the third thing which I mentioned is this idea of item variation and here we can just see a distribution of how good all the articles that Yahoo placed over the course of these three weeks that we observed were.",
                    "label": 0
                },
                {
                    "sent": "And you can see there's some of the best articles are orders of magnitude better than the worst ones.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And what's important is that we can observe most of this ahead of time, right?",
                    "label": 1
                },
                {
                    "sent": "In this problem we need to be able to sort of know how good something is before we schedule it.",
                    "label": 0
                },
                {
                    "sent": "And in the case of Yahoo, you can imagine that what you do is you know what the articles are ahead of time.",
                    "label": 1
                },
                {
                    "sent": "Say you have 40 of them over the course of the day.",
                    "label": 0
                },
                {
                    "sent": "So first thing in the morning you split up all of your traffic into four different buckets, and then you sort of use that bucket testing to get an idea of how good all of the articles are.",
                    "label": 0
                },
                {
                    "sent": "So that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Allows us to sort of formalize this problem, so we have these different components.",
                    "label": 0
                },
                {
                    "sent": "Here's the traffic curve and we want to do is come up with the schedule that looks sort of like this.",
                    "label": 0
                },
                {
                    "sent": "We divided the whole day into all of these intervals and we place different articles in each interval and then what you can think about doing is you have some click through rate here and you sort of multiply that by the amount of traffic that gives you the number of clicks at that time.",
                    "label": 0
                },
                {
                    "sent": "Then you add up over the course of the whole day, and that's the objective is to maximize the total number of clicks over the whole day.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "And then this work.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned we're using this yahoo.com, that's it, and we're trying to optimize this spot here.",
                    "label": 0
                },
                {
                    "sent": "So we had these three weeks of data from 2008, and they had this whole number of page views, so we knew exactly what the traffic was and were also able to extract the clickthrough rates for the articles that were actually placed up on the website, which means that we can sort of good idea of what these functions look like, because, well, they only last for a certain amount of time.",
                    "label": 0
                },
                {
                    "sent": "I mean, the other is taken down after awhile, but they're up there long enough that we get a good idea of what they look through.",
                    "label": 0
                },
                {
                    "sent": "Sort of going forward.",
                    "label": 0
                },
                {
                    "sent": "OK, So what is these utility click through rates?",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is just a sampling, a few articles and you can see that this one here was much much better.",
                    "label": 0
                },
                {
                    "sent": "It starts with a much higher clickthrough rate.",
                    "label": 0
                },
                {
                    "sent": "And what we observed when we started to look at the data is that, well, yes, there's a lot of variation because some things are better than others.",
                    "label": 0
                },
                {
                    "sent": "But sort of given the starting point, things follow roughly the same trend, right?",
                    "label": 0
                },
                {
                    "sent": "If you sort of start low, you're going to sort of follow the same trajectory.",
                    "label": 0
                },
                {
                    "sent": "They're not sort of diverging from different starting from the same starting point.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But turn out was that we could sort of align all of them to this single universal curve, and this is a little bit of a tricky concept, I think.",
                    "label": 0
                },
                {
                    "sent": "But if you sort of look carefully at this curve, what you'll see is that there's many, many curves, sort of embedded along this sort of large fuzzy curve, and what we've done here is taking all of the clickthrough rates for all of these articles that we observed, and we've sort of shifted them along this axis and then place them all there, and they all sort of fit within that once we shift them.",
                    "label": 0
                },
                {
                    "sent": "They fit along this single universal curve.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you can think here, for example, is what one article might look like.",
                    "label": 0
                },
                {
                    "sent": "It has some offset.",
                    "label": 0
                },
                {
                    "sent": "It starts at this click through rate and then it follows this universal curve from there, right?",
                    "label": 0
                },
                {
                    "sent": "So we can say that for every article there's some Sigma which defines how far along this universal curve we start.",
                    "label": 0
                },
                {
                    "sent": "And well, sort of.",
                    "label": 0
                },
                {
                    "sent": "The exponential decay doesn't fit quite as well as sort of the best universal curve.",
                    "label": 0
                },
                {
                    "sent": "It turns out that it's a pretty close approximation, and So what we'll use that gives us a good way to fit sort of a smaller if we only observe the 1st 20 minutes of an article, we can sort of use some exponential decay, because that seems like a good fit to extend the click through rate.",
                    "label": 0
                },
                {
                    "sent": "Beyond that, and we're going to need to be able to do that when we sort of start talking about algorithms and thinking about.",
                    "label": 0
                },
                {
                    "sent": "Rescheduling things.",
                    "label": 0
                },
                {
                    "sent": "So the point then is that The thing is, is the other thing that's important here is that.",
                    "label": 0
                },
                {
                    "sent": "Because this is universal curve, if we can figure out sort of the Y intercept what the value of F50 that tells us where this offset is, and this sort of enables you to do this.",
                    "label": 0
                },
                {
                    "sent": "Bucket testing which I mentioned earlier, and if I can figure out what the click through rate is just for the first few minutes, I sort of can predict the click through rate for the rest of time for that one article.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When we start designing, algorithms were going to.",
                    "label": 0
                },
                {
                    "sent": "It turns out that in general the problem is NP hard.",
                    "label": 1
                },
                {
                    "sent": "So if we don't make any assumptions about the data or the click through rates or anything were to not going to be able to do very well for large numbers of articles right now if we have to think about if there's any articles and factorial different permutations, we can do a little better than that.",
                    "label": 0
                },
                {
                    "sent": "Using something like programming.",
                    "label": 0
                },
                {
                    "sent": "But you can see here that it still sort of has this exponential.",
                    "label": 1
                },
                {
                    "sent": "And together, we're going to have to use some observations about the data that we observed and the key thing is going to be that everything fit along that one universal curve which was monotonically decreasing right?",
                    "label": 1
                },
                {
                    "sent": "And that sort of makes sense that you expect to click through rate to decrease overtime.",
                    "label": 0
                },
                {
                    "sent": "So think about how we could maybe design A polynomial algorithm to solve this problem.",
                    "label": 0
                },
                {
                    "sent": "Let's think about.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Special case where the traffic pattern is monotonically increasing, so that's sort of the case early in the day, right?",
                    "label": 0
                },
                {
                    "sent": "When people are getting to work and the traffic is going up.",
                    "label": 0
                },
                {
                    "sent": "And really, is sort of a simple argument to show that an optimal ordering is just to take all of the articles and sort them from worst to best.",
                    "label": 1
                },
                {
                    "sent": "So how does that?",
                    "label": 0
                },
                {
                    "sent": "So here in order to do the proof we have this traffic.",
                    "label": 0
                },
                {
                    "sent": "It's increasing.",
                    "label": 0
                },
                {
                    "sent": "And imagine that there was some sort of inversion, right?",
                    "label": 0
                },
                {
                    "sent": "So here things are ordered.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In different way I have the better article first.",
                    "label": 0
                },
                {
                    "sent": "Well what I can do is swap them in such a way that the traffic in this region remains unchanged, right?",
                    "label": 0
                },
                {
                    "sent": "But the traffic sort of over here goes up.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And every year it goes down.",
                    "label": 0
                },
                {
                    "sent": "So we sort of lose some click through rate in this area, right?",
                    "label": 0
                },
                {
                    "sent": "Because we are now.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The worst article there, but we gained some over there and it turns out that the area of sort of this loss if you were to integrate is the same as the area of the gain.",
                    "label": 0
                },
                {
                    "sent": "But then you need to think that you're multiplying this by the total traffic and in this region the traffic is higher than in this region and so by performing that swap you end up doing strictly better, which shows that in the case when the traffic is increasing we have this simple ordering, which we know is optimal.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it turns out that decreasing traffic is a similar case.",
                    "label": 1
                },
                {
                    "sent": "It's just sort of the opposite way.",
                    "label": 0
                },
                {
                    "sent": "Instead of ordering from worst to best to order from best to worst.",
                    "label": 1
                },
                {
                    "sent": "So that tells you what the ordering is, and then if you want to actually find the schedule well, you need to do a little bit more.",
                    "label": 0
                },
                {
                    "sent": "You need to use some dynamic programming, so here this sort of gives you an idea of how that goes for the case where the traffic is monotonically increasing.",
                    "label": 0
                },
                {
                    "sent": "What we've done, we know what the ordering is, it's from worst to best, and so we've scheduled the worst sort of couple articles already and they end here and then what we need to do is just figure out what's the interval length for the next worst article so we know that it's somewhere along here and you use this dynamic program too.",
                    "label": 0
                },
                {
                    "sent": "Solve the whole thing and get the optimal solution.",
                    "label": 0
                },
                {
                    "sent": "In this case where the traffic is increasing and all of these functions are along this universal decay.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's the increasing case, but of course that's not what we have, right?",
                    "label": 0
                },
                {
                    "sent": "We have.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sort of some more general traffic, but if you sort of remember back the traffic was roughly unimodal, right?",
                    "label": 0
                },
                {
                    "sent": "It sort of goes up in the morning peaks and then it goes down.",
                    "label": 0
                },
                {
                    "sent": "There was this sort of dip for lunch, but to a close approximation it's just single peaked.",
                    "label": 0
                },
                {
                    "sent": "So what can we do in that case?",
                    "label": 0
                },
                {
                    "sent": "Well?",
                    "label": 0
                },
                {
                    "sent": "Sort of, if we could divide it up into the upper part in the down part, we already know how to solve both of those, and that doesn't quite get us there because of course there's an exponential number of ways to partition the articles between those two halves, but it turns out that we can use a slightly more dynamic programming algorithm to do the whole thing at once, and the way we think about that sort of is that we're putting the best articles here in the middle where the traffic is highest, and imagine that you've sort of scheduled the best three articles, and they sort of span this peak region, and now I need to think where should I put?",
                    "label": 0
                },
                {
                    "sent": "The 4th best article?",
                    "label": 0
                },
                {
                    "sent": "Well, it's either going to sort of to the right what I already have scheduled over here, or it's going to the left of what's scheduled and do that program and you can solve this whole thing for this unimodal case.",
                    "label": 0
                },
                {
                    "sent": "So at this point.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are we done?",
                    "label": 0
                },
                {
                    "sent": "We've shown that to a close approximation we have this single universal decay curve, which all these click through rates fit to an that.",
                    "label": 0
                },
                {
                    "sent": "Given that if the traffic is unimodal we can efficiently solve the optimal schedule in polynomial time.",
                    "label": 0
                },
                {
                    "sent": "So that's good.",
                    "label": 0
                },
                {
                    "sent": "But if you sort of think back well, the traffic wasn't quite unimodal.",
                    "label": 0
                },
                {
                    "sent": "So how does it work in reality?",
                    "label": 0
                },
                {
                    "sent": "So what we did was we went back and looked at the data and so this is what the traffic actually looked like.",
                    "label": 0
                },
                {
                    "sent": "You can see that there's this big dip here.",
                    "label": 0
                },
                {
                    "sent": "And so it's not quite unit model and we can go and look at the historical clickthrough rates for all the articles that were scheduled over a day, right?",
                    "label": 1
                },
                {
                    "sent": "So the Yahoo editors picked some to the verticals and they placed them for some intervals.",
                    "label": 0
                },
                {
                    "sent": "And what we do is extract from the data that we have what these click through rate decay curves look like.",
                    "label": 0
                },
                {
                    "sent": "And because we know that they lie along this one sort of universal curve, we can extend them beyond the actual lifetime that they had on the website.",
                    "label": 0
                },
                {
                    "sent": "And so then we can run our algorithm and.",
                    "label": 1
                },
                {
                    "sent": "We find is that even though the traffic isn't quite unimodal, even though it has this dip, our algorithm compared to this exponential algorithm, which we could actually afford to run.",
                    "label": 1
                },
                {
                    "sent": "You know, obviously it takes longer, but it wasn't so bad that we could do it.",
                    "label": 0
                },
                {
                    "sent": "So when we compare our algorithm to the actual optimal.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Were always within .1%, so we're pretty much giving the right answer.",
                    "label": 0
                },
                {
                    "sent": "And if you look at this schedule, you can see there's actually two curves here.",
                    "label": 0
                },
                {
                    "sent": "If you look very closely, one of them is our algorithm and one of them is the optimal, and maybe you can see there's a slight difference there, but for the most part pretty much the same.",
                    "label": 0
                },
                {
                    "sent": "And then the other thing that compared to, of course, is how many clicks did the editor choices get.",
                    "label": 0
                },
                {
                    "sent": "And for that one where they go back?",
                    "label": 0
                },
                {
                    "sent": "OK, sorry for that one.",
                    "label": 0
                },
                {
                    "sent": "We win by a lot 26% over the course of these three weeks.",
                    "label": 1
                },
                {
                    "sent": "OK, so the last thing I'm going to talk just very briefly about is looking at why do they click through rates, decline overtime and when we started looking at this, that's sort of a big part of this is being able to make this assumption that there's this one sort of universal decay curve and we came up with this fairly simple sort of generative model which incorporates a few things about the Yahoo visitors which we observed in the server logs, and basically there's three parts, right?",
                    "label": 0
                },
                {
                    "sent": "Different visitors sort of come to the website at different rates.",
                    "label": 0
                },
                {
                    "sent": "You know some people are visiting much more frequently than others, and so we have some distribution over how often everybody comes and then another component is that given that you visit four times a day, there's some sort of interarrival gap distribution.",
                    "label": 0
                },
                {
                    "sent": "So if you visit it 8 in the morning, maybe it's not sort of a uniform distribution over the rest of the day.",
                    "label": 0
                },
                {
                    "sent": "Maybe you're more likely to come back and short intervals.",
                    "label": 0
                },
                {
                    "sent": "And so we have those two distributions so far.",
                    "label": 0
                },
                {
                    "sent": "We have a distribution.",
                    "label": 1
                },
                {
                    "sent": "Given your visit rate distribution, what's your interarrival gap time distribution?",
                    "label": 0
                },
                {
                    "sent": "And then finally we have this attenuation curve which we observed in the data.",
                    "label": 1
                },
                {
                    "sent": "So given that I come to the website say 3 times and the same article has been up all three times, what's the probability that I'll click on that article the first time I see it?",
                    "label": 1
                },
                {
                    "sent": "The second time, I see that the third time I see that which is this decaying function which we actually observe from the data, and then we can perform these simulations.",
                    "label": 1
                },
                {
                    "sent": "And we get these two curves, one of which let's see the red one is the actual clickthrough rate that we observed for one article, and the Green one is what our simulation suggests it would be, and you can see that they align pretty closely, which makes us think that these are the sort of important ingredients for why we have this decline.",
                    "label": 0
                },
                {
                    "sent": "So finally a few sort of further directions for this.",
                    "label": 0
                },
                {
                    "sent": "One thing that we're not able to do.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, and I think would be very interesting is what can we do if we have new items appearing over the course of the day right?",
                    "label": 1
                },
                {
                    "sent": "And all of our scenarios?",
                    "label": 0
                },
                {
                    "sent": "We're thinking about websites where sort of everything is available ahead of time and I can do this combinatorial scheduling problem.",
                    "label": 0
                },
                {
                    "sent": "You know, sort of with perfect information, but what happens if you're someone like CNN and you have new things, new stories appearing, and maybe they appear according to some distribution, then what should you do?",
                    "label": 1
                },
                {
                    "sent": "The other sort of obvious thing is how can I combine this fall with personalization?",
                    "label": 0
                },
                {
                    "sent": "What can I do if everybody sort of sees something else?",
                    "label": 0
                },
                {
                    "sent": "And the results about sort of this general model suggests that you should sort of if somebody's already seen something, then maybe you should show them something else the next time.",
                    "label": 0
                },
                {
                    "sent": "Or maybe you should only show them one article or one item a couple times, or something like that.",
                    "label": 1
                },
                {
                    "sent": "Case of YouTube, we saw that there were multiple featured items, right.",
                    "label": 0
                },
                {
                    "sent": "There were a lot I think 4 different videos and if you have that scenario sort of how can you extend this even in the same framework where you know everything ahead of time and finally we only have this one data set.",
                    "label": 1
                },
                {
                    "sent": "Unfortunately and so it's sort of an open and I think important question to what extent do these assumptions apply to other data sets?",
                    "label": 0
                },
                {
                    "sent": "I would expect the traffic given modality is pretty general.",
                    "label": 0
                },
                {
                    "sent": "I guess I've seen that other places, but to what extent is there this sort of single universal decay curve that?",
                    "label": 0
                },
                {
                    "sent": "We observed in other data sets.",
                    "label": 0
                },
                {
                    "sent": "And that's it.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is a few minutes for questions.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "Were there any cases where that's an article was taken down after some time, and then maybe later in the day, put back up and in that case, what happens to the Cdr?",
                    "label": 0
                },
                {
                    "sent": "Does it just start where it left off, or is there is fine?",
                    "label": 0
                },
                {
                    "sent": "That's an excellent question, and I think I mean that's one consideration is what can you do sort of and what happens in that case?",
                    "label": 0
                },
                {
                    "sent": "We didn't consider that we in the framework that we were considering you only had an article up once for one contiguous interval.",
                    "label": 0
                },
                {
                    "sent": "For whatever reason, we for the most part that it almost never happens that an article goes down and comes back up.",
                    "label": 0
                },
                {
                    "sent": "There are a few instances in the data set where that happens, and it's sort of somewhere in between.",
                    "label": 0
                },
                {
                    "sent": "So you see the click through rate goes down for awhile and then they take the article off for a few hours or something, and then it comes back up and it doesn't quite start where it left off, but it also doesn't start at the same point that started before.",
                    "label": 0
                },
                {
                    "sent": "It's sort of somewhere in between.",
                    "label": 0
                },
                {
                    "sent": "If you think about that, sort of makes sense right?",
                    "label": 0
                },
                {
                    "sent": "Because some of the people side, you know hours before when it was there and those people aren't clicking again, so it's sort of recover some, but not all the way.",
                    "label": 0
                },
                {
                    "sent": "Other questions.",
                    "label": 0
                },
                {
                    "sent": "Testing that uses basically behave different than ours, and then maybe you have like different curves.",
                    "label": 0
                },
                {
                    "sent": "Actually, instead of just one right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so somebody make sure everyone heard.",
                    "label": 0
                },
                {
                    "sent": "So the question is, do you have the same article and you started at 8:00 o'clock?",
                    "label": 0
                },
                {
                    "sent": "You might start with a different click through rate than if you started at noon, right?",
                    "label": 0
                },
                {
                    "sent": "Because people are sort of looking for different things in the morning then they're looking at noon, and I think that that's probably the case.",
                    "label": 0
                },
                {
                    "sent": "I think that people are looking for finance news.",
                    "label": 0
                },
                {
                    "sent": "At one time the day and not in the evenings or something like that.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, we don't really have an opportunity to observe that very much, because in our data the articles start at one point and another point, and we don't really have any way to disambiguate whether they click through rate is just a function of the article, or whether it's some combination, because we only have that one data point.",
                    "label": 0
                },
                {
                    "sent": "Uses behave differently.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Right, yeah, no.",
                    "label": 0
                },
                {
                    "sent": "I mean, I think that's probably the case and I don't.",
                    "label": 0
                },
                {
                    "sent": "My suspicion is that it's not a huge effect, but I think that there probably is some effect like that.",
                    "label": 0
                }
            ]
        }
    }
}