{
    "id": "qxegvklz2hb4ijkbklaz7dvmjkiotzik",
    "title": "Free/Open-Source Machine Translation: The Apertium Platform",
    "info": {
        "author": [
            "Mikel L. Forcada, Department of Software and Computing Systems, University of Alicante"
        ],
        "published": "July 15, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Computers->Software->Open-Source Software",
            "Top->Computer Science->Computational Linguistics->Machine Translation"
        ]
    },
    "url": "http://videolectures.net/translingeu2010_forcada_fos/",
    "segmentation": [
        [
            "My name is Michael Whoops.",
            "Yes, my name is Miguel Cortana and I am one of the.",
            "Person that started up her team with many other people and practices.",
            "Open source."
        ],
        [
            "Free slash open source machine translation platform, but I wanted to talk initially a little bit about free open source machine translate."
        ],
        [
            "And in general.",
            "So.",
            "OK, well you probably are very familiar with these definitions of free and open source software.",
            "Usually there are two ways of looking at the same thing.",
            "Free software is software you can use for any purpose you can.",
            "Anyone can examine it and modify it for any purpose and share it with other people.",
            "You can distribute it.",
            "That's the usual way that the Free Software Foundation looks at free software.",
            "Other point of view is looking actually at the procedure in which software is developed, and that's the way in which the open source initiative looks at it."
        ],
        [
            "Thank you.",
            "OK, so I before before I go on.",
            "I have three hats there Center for next generation localization in Dublin City University.",
            "That's where I am now.",
            "I am based on my current position is in the University of other contain an.",
            "I am also in.",
            "Company is 1 company was started that does business on another team."
        ],
        [
            "OK, so we can.",
            "I wanted to just make a small.",
            "Excuses about copyleft because it's something that may be interesting on top of free or open source software you can have or not have.",
            "Copyleft and copyleft is obviously upon non Copyright, but it still Copyright in the sense that we usually we deal with it in the way we would deal with any Copyright.",
            "Legally we deal with it like with Copyright.",
            "So it basically means that any any modification that you make to your software if you distribute them, you have to stay with them with the source because he would have to be distributed under same license.",
            "And you have many licenses you probably used to them at some of these licenses were mentioned in the in the talk that the we localize people gave.",
            "So you have the non copyrighted open source licenses like BSD or Apache or Creative Commons Attribution.",
            "Or you can have also the copy letter licenses of which the most famous one is DNO GPL which is the one that upper team uses."
        ],
        [
            "One thing that's interesting about copyleft is that it secures, or at least promotes the existing to existence of knowledge Commons, and so things are thrown in maybe thrown into like a common box or come on area that is prevented from private appropriation because of the copyleft itself.",
            "And this is and we found this to be a very effective way of enabling a community of programmers or community of developers that we will.",
            "Build bodies are free, open source, free, slashed open source resources because it requires that all of the derivative word has to be.",
            "Work has to be distributed under the same license and I like to say that copyleft is crucial or is 1 important thing, although it might not be."
        ],
        [
            "The required, but it helps very much in building a platform.",
            "So we know that I don't need to convince meant to convince you that free and open source software is open for business, but many people still ask us like how come your company is working on open source software and things like these?",
            "And basically it's because it changes the way you look at business and emphasizes the service part sometimes and also one interesting thing that some customers may like is that since the software is out there and you're offering services on that software, you're not the only person who can actually offer service on that one.",
            "And then they don't.",
            "They are not locked in to you as a vendor, but rather they look at you at one possible technology technological partner in the in.",
            "Whatever you're trying to do."
        ],
        [
            "And it's true that if a company engages in doing open source software, third parties can engage in business.",
            "The basically in the same level in the same field as you, and can compete effectively with you.",
            "The advantages that you've been there before is probably you have a certain time advantage.",
            "You know that usually you're if you're the developer, your know how is.",
            "Is deeper and the other guys have to?",
            "Take longer, so that's usually the advantage you might do.",
            "Might have, but you can do all kinds of businesses and that's what we do with the per diem in promise it so you can do.",
            "You can install, configure the software, customize it for a customer, adapting it, and you can even get it right.",
            "You can give a price break to your customer.",
            "You say I'm going to get the code for you.",
            "Would let me have the code.",
            "Well, let me open, let me add it to the open source pool of things and I'll give you a price break because this improves my my.",
            "My chances are doing.",
            "More business and improved your in your price.",
            "You find the price for your service and.",
            "Of course you can do business on non copylefted software and that means that you can do all this and also you can sell close software."
        ],
        [
            "Based on it.",
            "So machine translation is special.",
            "When we talk about open source machine translation or free machine translation, we have to be aware that machine translation has three components or you can see three parts.",
            "You can see an engine which may be code decoder in SMT or RECOMBINATE, AURINI, BMT or just an engine in Rule based machine translation.",
            "You might you might have data which may be dictionaries, rules or maybe just corpora and you have the tools to maintain all them and make them work with the engine you have.",
            "And I contend that for machine translation to be fully free slash open source.",
            "The engine, the data and the tools have all to be open source or free, which is hard in the case of corpus based empty because that means that your computer has to be free and there are some computer which had free with someone not so.",
            "In room basis, things are easier if your dictionaries and rules are are open source, then your open source OK."
        ],
        [
            "I think we've been working on this for 11 years now.",
            "Burke, Tim started in 2005, but it drew very much on previous projects that my group in the University of Alicante had, which were internal strumentale versia.",
            "The technologies were machine rule based machine translation technologies that were used basically to translate between very similar languages, so we had a quick success with them.",
            "But we even if they were initially designed for related languages."
        ],
        [
            "She extended them to deal with other languages with variable success.",
            "So upper team is a platform.",
            "I like to call it a platform.",
            "It's it's an open source machine translation platform that provides the three components.",
            "First, it provides you with an engine and the engine uses very Britain but are very simple technology for machine translation.",
            "So in addition to text form and management, you have finite state lexical processing.",
            "All lexical processing is finite state for speed.",
            "Statistical lexical disambiguation and shallow transfer based on very simple finite state pattern matching technologies.",
            "We also prepare platform also provide linguistic data.",
            "You I'll show you later in a slide in well specified XML formats for a variety of language pairs, many of which are small languages that you will see in this life.",
            "And also we provide the users with free and open source to tools like compilers to turn linguistic data into.",
            "The fast and compact way that the machine translation engine uses and also software to learn them from corvara too.",
            "This is Joe."
        ],
        [
            "Website that shows that it's a kind of a pipeline architecture and one thing that we we make a lot of effort.",
            "I mean we, we emphasize is that all of the modules to talk to each other with text, so it's easy to modify, easy to diagnose what's going on.",
            "So it's a typical Unix pipeline, more or less."
        ],
        [
            "So we provide currently.",
            "I think there are 21 stable language pairs which are open source like all of our team and they include all of these you you see the we have like big languages like Spanish or Portuguese or English but we also have small languages like Britain or or.",
            "Welsh, so in fact our community in our team is very was very initiative from the very beginning was motivated by the need to provide machine translation that was free and easily accessible for smaller languages.",
            "Initially the languages of Spain."
        ],
        [
            "And we also have a growing number of language pairs on the development.",
            "The project started as part of a consortium with three companies and for universities.",
            "The construction is called open trap and it was funded by the Ministry of Education.",
            "Sorry, Ministry of Industry, Tourism and Commerce in Spain.",
            "Additionally, we've had funding from other ministries from the Government of Catalonia from the Government of Romania, Romanians for running into Spanish machine translation from the universities that themselves have given us some money for projects, internal projects, the Breton Language Board.",
            "Google is supporting us through the Google Summer of code, so we have nine students now who are working in different projects in apartment last year we also had them, so we're very lucky to be able to have that new stream of developers coming into a per team.",
            "And of course, all of the companies who are using the perfume and also developing it and prompts it my company.",
            "But also electrical engineering, mystical or Basque Country Company or the matching software which is in Galicia in Spain, which were in the initial.",
            "These last two wearing the initial consortium that started a perfume."
        ],
        [
            "We also have a community which welcomes everyone.",
            "It's not the probably the idea Community development situation because it's usually a bit like you know, all open source projects.",
            "You tend to have more things going on and you can actually organize well, but we have a more than 100 developers now in the in the in the project.",
            "Most of the documentation is a wiki, so that is fastly updated and everything that's developers themselves can.",
            "Dated we have an IRC channel, so if you go to that Channel apertium you can talk to some of our developers.",
            "We have a mailing list and the good thing is that upper team packages the stable packages have been ported to Debian and then they have surfaced in Ubuntu because of the way they it's built.",
            "So currently in one of the most common synergy new Linux distributions you can have you have a part in there.",
            "You can just test it.",
            "It's part of the.",
            "Packages that you can install."
        ],
        [
            "So on the.",
            "On the on a per team we do have a platform in that platform is is being used to do both research and Business Research.",
            "I was checking the other day in the weekly.",
            "We have more than 30 publications related to opportune and and one PhD thesis uses all of the components where releasing to upper team and for master thesis and.",
            "As a business is being used by many companies like from seat Ilica, Imagine, Imagine Software etc which are offering services to customers such as Autodesk or the Government of Catalonia or or one of the main best banks or the daily newspaper levels.",
            "Alicia so you have many customers that are some customers.",
            "Their big customers are actually using apartment hiring these companies to do to provide them with services over the over the platform.",
            "One thing that is good about having a free slash open source community.",
            "Is is that it creates a model of very tight interaction between many different stakeholders like users, researchers, developers and vendors because there's a continuum between them.",
            "This one minute.",
            "Almost finishing and and it makes it very easy for them to communicate to each other and make the product easier.",
            "Easily adapted to a new new customers on you users."
        ],
        [
            "Requirements there's a lot of free open source machine translation out there, and in fact I sit together.",
            "I put them together, you know, in a in a web page which you will find in www.fosmt.info and if you feel that one system is missing there, just let me know because it should be.",
            "There is just anything that has a free or open source license will should be there and in addition to a party min during my stay in Dublin during my sabbatical stay in Dublin.",
            "Ended by Science Foundation Ireland by the University of Alicante I am involved in the open matrix, although RG which is the open sourcing of the technology of the corpus based machine translation system metrics.",
            "That is the like the main machine translation system used in Dublin City University in the machine Translation Group.",
            "So I've been involved with open sourcing it and we we have outside.",
            "You can find Flyers on apartment open matrix if you want at the table where there were the batches where."
        ],
        [
            "Of course the slides are free store used.",
            "We want them to have a free license.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My name is Michael Whoops.",
                    "label": 0
                },
                {
                    "sent": "Yes, my name is Miguel Cortana and I am one of the.",
                    "label": 0
                },
                {
                    "sent": "Person that started up her team with many other people and practices.",
                    "label": 0
                },
                {
                    "sent": "Open source.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Free slash open source machine translation platform, but I wanted to talk initially a little bit about free open source machine translate.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in general.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "OK, well you probably are very familiar with these definitions of free and open source software.",
                    "label": 0
                },
                {
                    "sent": "Usually there are two ways of looking at the same thing.",
                    "label": 0
                },
                {
                    "sent": "Free software is software you can use for any purpose you can.",
                    "label": 1
                },
                {
                    "sent": "Anyone can examine it and modify it for any purpose and share it with other people.",
                    "label": 1
                },
                {
                    "sent": "You can distribute it.",
                    "label": 0
                },
                {
                    "sent": "That's the usual way that the Free Software Foundation looks at free software.",
                    "label": 0
                },
                {
                    "sent": "Other point of view is looking actually at the procedure in which software is developed, and that's the way in which the open source initiative looks at it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, so I before before I go on.",
                    "label": 0
                },
                {
                    "sent": "I have three hats there Center for next generation localization in Dublin City University.",
                    "label": 1
                },
                {
                    "sent": "That's where I am now.",
                    "label": 0
                },
                {
                    "sent": "I am based on my current position is in the University of other contain an.",
                    "label": 0
                },
                {
                    "sent": "I am also in.",
                    "label": 0
                },
                {
                    "sent": "Company is 1 company was started that does business on another team.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so we can.",
                    "label": 0
                },
                {
                    "sent": "I wanted to just make a small.",
                    "label": 0
                },
                {
                    "sent": "Excuses about copyleft because it's something that may be interesting on top of free or open source software you can have or not have.",
                    "label": 0
                },
                {
                    "sent": "Copyleft and copyleft is obviously upon non Copyright, but it still Copyright in the sense that we usually we deal with it in the way we would deal with any Copyright.",
                    "label": 0
                },
                {
                    "sent": "Legally we deal with it like with Copyright.",
                    "label": 0
                },
                {
                    "sent": "So it basically means that any any modification that you make to your software if you distribute them, you have to stay with them with the source because he would have to be distributed under same license.",
                    "label": 1
                },
                {
                    "sent": "And you have many licenses you probably used to them at some of these licenses were mentioned in the in the talk that the we localize people gave.",
                    "label": 1
                },
                {
                    "sent": "So you have the non copyrighted open source licenses like BSD or Apache or Creative Commons Attribution.",
                    "label": 0
                },
                {
                    "sent": "Or you can have also the copy letter licenses of which the most famous one is DNO GPL which is the one that upper team uses.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One thing that's interesting about copyleft is that it secures, or at least promotes the existing to existence of knowledge Commons, and so things are thrown in maybe thrown into like a common box or come on area that is prevented from private appropriation because of the copyleft itself.",
                    "label": 1
                },
                {
                    "sent": "And this is and we found this to be a very effective way of enabling a community of programmers or community of developers that we will.",
                    "label": 0
                },
                {
                    "sent": "Build bodies are free, open source, free, slashed open source resources because it requires that all of the derivative word has to be.",
                    "label": 0
                },
                {
                    "sent": "Work has to be distributed under the same license and I like to say that copyleft is crucial or is 1 important thing, although it might not be.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The required, but it helps very much in building a platform.",
                    "label": 0
                },
                {
                    "sent": "So we know that I don't need to convince meant to convince you that free and open source software is open for business, but many people still ask us like how come your company is working on open source software and things like these?",
                    "label": 0
                },
                {
                    "sent": "And basically it's because it changes the way you look at business and emphasizes the service part sometimes and also one interesting thing that some customers may like is that since the software is out there and you're offering services on that software, you're not the only person who can actually offer service on that one.",
                    "label": 0
                },
                {
                    "sent": "And then they don't.",
                    "label": 0
                },
                {
                    "sent": "They are not locked in to you as a vendor, but rather they look at you at one possible technology technological partner in the in.",
                    "label": 0
                },
                {
                    "sent": "Whatever you're trying to do.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it's true that if a company engages in doing open source software, third parties can engage in business.",
                    "label": 1
                },
                {
                    "sent": "The basically in the same level in the same field as you, and can compete effectively with you.",
                    "label": 0
                },
                {
                    "sent": "The advantages that you've been there before is probably you have a certain time advantage.",
                    "label": 0
                },
                {
                    "sent": "You know that usually you're if you're the developer, your know how is.",
                    "label": 0
                },
                {
                    "sent": "Is deeper and the other guys have to?",
                    "label": 0
                },
                {
                    "sent": "Take longer, so that's usually the advantage you might do.",
                    "label": 0
                },
                {
                    "sent": "Might have, but you can do all kinds of businesses and that's what we do with the per diem in promise it so you can do.",
                    "label": 1
                },
                {
                    "sent": "You can install, configure the software, customize it for a customer, adapting it, and you can even get it right.",
                    "label": 1
                },
                {
                    "sent": "You can give a price break to your customer.",
                    "label": 0
                },
                {
                    "sent": "You say I'm going to get the code for you.",
                    "label": 0
                },
                {
                    "sent": "Would let me have the code.",
                    "label": 0
                },
                {
                    "sent": "Well, let me open, let me add it to the open source pool of things and I'll give you a price break because this improves my my.",
                    "label": 0
                },
                {
                    "sent": "My chances are doing.",
                    "label": 1
                },
                {
                    "sent": "More business and improved your in your price.",
                    "label": 0
                },
                {
                    "sent": "You find the price for your service and.",
                    "label": 0
                },
                {
                    "sent": "Of course you can do business on non copylefted software and that means that you can do all this and also you can sell close software.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Based on it.",
                    "label": 0
                },
                {
                    "sent": "So machine translation is special.",
                    "label": 1
                },
                {
                    "sent": "When we talk about open source machine translation or free machine translation, we have to be aware that machine translation has three components or you can see three parts.",
                    "label": 1
                },
                {
                    "sent": "You can see an engine which may be code decoder in SMT or RECOMBINATE, AURINI, BMT or just an engine in Rule based machine translation.",
                    "label": 0
                },
                {
                    "sent": "You might you might have data which may be dictionaries, rules or maybe just corpora and you have the tools to maintain all them and make them work with the engine you have.",
                    "label": 0
                },
                {
                    "sent": "And I contend that for machine translation to be fully free slash open source.",
                    "label": 0
                },
                {
                    "sent": "The engine, the data and the tools have all to be open source or free, which is hard in the case of corpus based empty because that means that your computer has to be free and there are some computer which had free with someone not so.",
                    "label": 1
                },
                {
                    "sent": "In room basis, things are easier if your dictionaries and rules are are open source, then your open source OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think we've been working on this for 11 years now.",
                    "label": 0
                },
                {
                    "sent": "Burke, Tim started in 2005, but it drew very much on previous projects that my group in the University of Alicante had, which were internal strumentale versia.",
                    "label": 0
                },
                {
                    "sent": "The technologies were machine rule based machine translation technologies that were used basically to translate between very similar languages, so we had a quick success with them.",
                    "label": 1
                },
                {
                    "sent": "But we even if they were initially designed for related languages.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "She extended them to deal with other languages with variable success.",
                    "label": 0
                },
                {
                    "sent": "So upper team is a platform.",
                    "label": 1
                },
                {
                    "sent": "I like to call it a platform.",
                    "label": 0
                },
                {
                    "sent": "It's it's an open source machine translation platform that provides the three components.",
                    "label": 1
                },
                {
                    "sent": "First, it provides you with an engine and the engine uses very Britain but are very simple technology for machine translation.",
                    "label": 1
                },
                {
                    "sent": "So in addition to text form and management, you have finite state lexical processing.",
                    "label": 0
                },
                {
                    "sent": "All lexical processing is finite state for speed.",
                    "label": 0
                },
                {
                    "sent": "Statistical lexical disambiguation and shallow transfer based on very simple finite state pattern matching technologies.",
                    "label": 1
                },
                {
                    "sent": "We also prepare platform also provide linguistic data.",
                    "label": 1
                },
                {
                    "sent": "You I'll show you later in a slide in well specified XML formats for a variety of language pairs, many of which are small languages that you will see in this life.",
                    "label": 1
                },
                {
                    "sent": "And also we provide the users with free and open source to tools like compilers to turn linguistic data into.",
                    "label": 0
                },
                {
                    "sent": "The fast and compact way that the machine translation engine uses and also software to learn them from corvara too.",
                    "label": 0
                },
                {
                    "sent": "This is Joe.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Website that shows that it's a kind of a pipeline architecture and one thing that we we make a lot of effort.",
                    "label": 0
                },
                {
                    "sent": "I mean we, we emphasize is that all of the modules to talk to each other with text, so it's easy to modify, easy to diagnose what's going on.",
                    "label": 0
                },
                {
                    "sent": "So it's a typical Unix pipeline, more or less.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we provide currently.",
                    "label": 0
                },
                {
                    "sent": "I think there are 21 stable language pairs which are open source like all of our team and they include all of these you you see the we have like big languages like Spanish or Portuguese or English but we also have small languages like Britain or or.",
                    "label": 0
                },
                {
                    "sent": "Welsh, so in fact our community in our team is very was very initiative from the very beginning was motivated by the need to provide machine translation that was free and easily accessible for smaller languages.",
                    "label": 0
                },
                {
                    "sent": "Initially the languages of Spain.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we also have a growing number of language pairs on the development.",
                    "label": 0
                },
                {
                    "sent": "The project started as part of a consortium with three companies and for universities.",
                    "label": 0
                },
                {
                    "sent": "The construction is called open trap and it was funded by the Ministry of Education.",
                    "label": 0
                },
                {
                    "sent": "Sorry, Ministry of Industry, Tourism and Commerce in Spain.",
                    "label": 0
                },
                {
                    "sent": "Additionally, we've had funding from other ministries from the Government of Catalonia from the Government of Romania, Romanians for running into Spanish machine translation from the universities that themselves have given us some money for projects, internal projects, the Breton Language Board.",
                    "label": 1
                },
                {
                    "sent": "Google is supporting us through the Google Summer of code, so we have nine students now who are working in different projects in apartment last year we also had them, so we're very lucky to be able to have that new stream of developers coming into a per team.",
                    "label": 0
                },
                {
                    "sent": "And of course, all of the companies who are using the perfume and also developing it and prompts it my company.",
                    "label": 0
                },
                {
                    "sent": "But also electrical engineering, mystical or Basque Country Company or the matching software which is in Galicia in Spain, which were in the initial.",
                    "label": 0
                },
                {
                    "sent": "These last two wearing the initial consortium that started a perfume.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also have a community which welcomes everyone.",
                    "label": 0
                },
                {
                    "sent": "It's not the probably the idea Community development situation because it's usually a bit like you know, all open source projects.",
                    "label": 1
                },
                {
                    "sent": "You tend to have more things going on and you can actually organize well, but we have a more than 100 developers now in the in the in the project.",
                    "label": 1
                },
                {
                    "sent": "Most of the documentation is a wiki, so that is fastly updated and everything that's developers themselves can.",
                    "label": 0
                },
                {
                    "sent": "Dated we have an IRC channel, so if you go to that Channel apertium you can talk to some of our developers.",
                    "label": 0
                },
                {
                    "sent": "We have a mailing list and the good thing is that upper team packages the stable packages have been ported to Debian and then they have surfaced in Ubuntu because of the way they it's built.",
                    "label": 1
                },
                {
                    "sent": "So currently in one of the most common synergy new Linux distributions you can have you have a part in there.",
                    "label": 0
                },
                {
                    "sent": "You can just test it.",
                    "label": 0
                },
                {
                    "sent": "It's part of the.",
                    "label": 0
                },
                {
                    "sent": "Packages that you can install.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So on the.",
                    "label": 0
                },
                {
                    "sent": "On the on a per team we do have a platform in that platform is is being used to do both research and Business Research.",
                    "label": 0
                },
                {
                    "sent": "I was checking the other day in the weekly.",
                    "label": 0
                },
                {
                    "sent": "We have more than 30 publications related to opportune and and one PhD thesis uses all of the components where releasing to upper team and for master thesis and.",
                    "label": 0
                },
                {
                    "sent": "As a business is being used by many companies like from seat Ilica, Imagine, Imagine Software etc which are offering services to customers such as Autodesk or the Government of Catalonia or or one of the main best banks or the daily newspaper levels.",
                    "label": 1
                },
                {
                    "sent": "Alicia so you have many customers that are some customers.",
                    "label": 0
                },
                {
                    "sent": "Their big customers are actually using apartment hiring these companies to do to provide them with services over the over the platform.",
                    "label": 0
                },
                {
                    "sent": "One thing that is good about having a free slash open source community.",
                    "label": 0
                },
                {
                    "sent": "Is is that it creates a model of very tight interaction between many different stakeholders like users, researchers, developers and vendors because there's a continuum between them.",
                    "label": 0
                },
                {
                    "sent": "This one minute.",
                    "label": 0
                },
                {
                    "sent": "Almost finishing and and it makes it very easy for them to communicate to each other and make the product easier.",
                    "label": 0
                },
                {
                    "sent": "Easily adapted to a new new customers on you users.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Requirements there's a lot of free open source machine translation out there, and in fact I sit together.",
                    "label": 0
                },
                {
                    "sent": "I put them together, you know, in a in a web page which you will find in www.fosmt.info and if you feel that one system is missing there, just let me know because it should be.",
                    "label": 0
                },
                {
                    "sent": "There is just anything that has a free or open source license will should be there and in addition to a party min during my stay in Dublin during my sabbatical stay in Dublin.",
                    "label": 0
                },
                {
                    "sent": "Ended by Science Foundation Ireland by the University of Alicante I am involved in the open matrix, although RG which is the open sourcing of the technology of the corpus based machine translation system metrics.",
                    "label": 1
                },
                {
                    "sent": "That is the like the main machine translation system used in Dublin City University in the machine Translation Group.",
                    "label": 0
                },
                {
                    "sent": "So I've been involved with open sourcing it and we we have outside.",
                    "label": 0
                },
                {
                    "sent": "You can find Flyers on apartment open matrix if you want at the table where there were the batches where.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course the slides are free store used.",
                    "label": 0
                },
                {
                    "sent": "We want them to have a free license.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}