{
    "id": "qydlovm4ae7e6wwljidg7d6fp4fbdxgs",
    "title": "The Triple Revolution & The Turn to Networked Individualism",
    "info": {
        "author": [
            "Barry Wellman, NETLAB, Department of Sociology, University of Toronto"
        ],
        "published": "July 19, 2011",
        "recorded": "June 2011",
        "category": [
            "Top->Computers->Social Networking",
            "Top->Social Sciences->Society->Social Networks"
        ]
    },
    "url": "http://videolectures.net/acmwebsci2011_wellman_individualism/",
    "segmentation": [
        [
            "I have a sense that many of you came here from the world of computer science and are more interested in moving into the social science implications.",
            "And I've gone in the opposite direction."
        ],
        [
            "Literally I came from New York City.",
            "I moved to Toronto in 1967.",
            "Which of those you have any sense in history was a particularly good year to move to Canada had a choice between your job in Toronto or a job in Vietnam.",
            "And they were not gold farming in Vietnam then.",
            "Interesting things worked out and in the 1960s I started Graduate School in 1963.",
            "Most to see my Twitter picture.",
            "I had a little bit more heritage.",
            "We were developing I would say was the Godfather.",
            "I would say Harrison White and in England.",
            "Clyde Mitchell and John Barnes work where really the originators of social network analysis.",
            "But we were developing the thinking of affect and if you look at the book that came out about 20 years later called social Structures in network approach.",
            "Cambridge you Chris.",
            "It's out of print but still pretty widely available.",
            "We pretty well laid out some of the basic tenants of social network analysis and the first chapter I wrote there pretty well holds up at the same time.",
            "I was a community sociologist and I'm doing this biography because I think we're all coming from different places.",
            "Actually heard me wrote this yesterday.",
            "An coming as a child from New York.",
            "I was shocked and appalled that.",
            "Receive sociological and popular media wisdom.",
            "Back then, as it is now, Sherry Turkle, saying communities falling apart, except it isn't.",
            "How I grew up hanging around in streets in New York and I knew we had strong communities and so I made it my mission for about 30 years to study communities, but not necessarily assuming there in neighborhoods, but linking with my first interest to treat communities as social networks.",
            "Because as everybody here knows, but popular media has not really figured out, we all have far flung friends.",
            "Physical friends, one of the reasons we come to conferences like this is when I get an email from Southampton.",
            "I will have a face in a body and a voice to associate with some more likely to answer in the news.",
            "Yep.",
            "And."
        ],
        [
            "So this is ongoing interplay between what's happening face to face and what's happening online.",
            "1990 R 3 computer scientists run Becca, Bill Buxton and well who's then called Marilyn Manti now Maryland?",
            "Tremaine got in touch with me and said, hey, look, we're building a system for people to collaborate with each other, hopefully online.",
            "We even have the word Internet, yet in fact, we built it off.",
            "From scratch, which is a crazy way to do it, called the Telepresence got to copyrighted, so Cisco is now making the money that we should have made over it, and I've happily work with computer scientist ever since, while when they're smart to their quick, I got tired of people in social Sciences thinking five years about what project to do, and three, they have better conferences and more interesting places, always important criteria.",
            "Better way to sociologists are meeting in Las Vegas this summer.",
            "If you want to get a cheap room in Caesars Palace, this is your chance.",
            "And and for although there will be some dispute here, computer scientists have more money on research grants and social scientists too and money is nice.",
            "It allows people to go to conferences and buy big toys and little toys.",
            "And I continue doing that.",
            "I'm working with a group in Canada called grand.",
            "Any Canadians here?",
            "OK, I can lie 02.",
            "And it's a network of centers of excellence of research centers across Canada.",
            "Canada is about 8000 kilometres wide.",
            "Or maybe it's a little bit of exaggeration.",
            "With big Country sparsely settled, so we're studying the people in computer science, social science and humanities.",
            "How they relate to each other in projects.",
            "Whether space makes a difference.",
            "The short answer, it sure does.",
            "And with the discipline makes a difference.",
            "Help people can relate to each other across and also how projects are organized.",
            "And I have a team of doctoral students an.",
            "System Professor Anatoly Bruce are very, very happily engaged in this research.",
            "No hot findings.",
            "It invite me back next year."
        ],
        [
            "So I really personally have interested is when they said in.",
            "Finding the interplay of technology and society and sometimes stating the non obvious.",
            "I've been doing a study called Connective lives with Bernie Hogan, now with the Oxford Internet Institute, Keith Hampton.",
            "Jeffrey Bows for many years and what we find unlike what Sherry Turkle's alarmists in data free book, it's great to have a book without data.",
            "You can say what you want.",
            "People have more friends than ever.",
            "See the paper that Helen Wang and I did quotes social connectivity.",
            "American behavioral scientist, American behavioral scientist.",
            "Last year we find the local is still important.",
            "I work with geography Dan amok on that, the closer you physically artist somebody, the more likely are going to connect, and we find that almost all online friends are offline as well.",
            "Carolina Heathrow employed now British Columbia, and I added a book called the Internet in everyday Life.",
            "2002 I think it holds up.",
            "And I've been working a lot recently with the Pew Internet and American Life Project, which only does American studies.",
            "That's what they're funded for.",
            "They'd love to go abroad.",
            "I also work with the World Internet project anyway.",
            "Here involved with world Internet.",
            "OK thanks, where are you from?",
            "Oh I OK yeah.",
            "They're doing comparative research in many, many countries."
        ],
        [
            "But turning to the substance of this talk and what the book that Lee Rainey, his head of the Pew Internet Project, and I we've just handed in the manuscript, and we're in that kind of expecting pregnancy, raises the books not coming out until January 2012 by MIT Press.",
            "And what we argue is that there's a triple revolution.",
            "And the revolution is turning from groups.",
            "Founded solidarity Local, tightly knit to social networks in which people move around among many different sets of relations, much as we're doing here.",
            "Although I noticed on the boat last night, most people were sitting in one spot with their own group that they came from.",
            "How many people moved around in network below?",
            "So you exaggerate.",
            "'cause I took video of the whole thing.",
            "But we do this morning.",
            "Second, the things we take for granted now, although certainly if you're as old as I am.",
            "Few others in this audience, we don't forever the Internet.",
            "But the Internet has some very interesting properties.",
            "Obviously it's more or less distance free for those who are trying to communicate back home to Korea or America, know the timing shift problems and so personal.",
            "Everybody remembered ildefons yeah why?",
            "It came into the house.",
            "They didn't come into your pocket and therefore when your boyfriend or girlfriend called, everybody knew what was going on.",
            "So the Internet is personal, mobile is personal, mobile is a number of talks saying here is developing a somewhat distant dynamic, although I kept wondering about the talk about West Africa, how people charge their mobile phones without electricity.",
            "The sun, right?",
            "You had central stations, public public buildings as well.",
            "Yeah, yeah, they didn't have personalized electrical connection, so we're interested in what the intersection of these phenomena is doing to interpersonal relations.",
            "I mean, there are other kinds of relations are import."
        ],
        [
            "But I'm just not looking at it.",
            "And we plugged into a controversy.",
            "All how many people here are sociologists.",
            "Hey.",
            "Few of us were there can remember June 2, 2006 before some of you were born.",
            "There was this article in the American Sociological Review called Social Isolation in America that took one question.",
            "Do you he discuss important matters with an?",
            "Found that the number of people had declined from a mean of 2.9 in 1984 to 2.1 in 2005, and that 23% of Americans were social isolates, and this created a great deal of media on moaning and a great deal of actually academic moaning.",
            "That's what I call a cobalt sociology, and to use a German phrase or unit."
        ],
        [
            "In fact, it's the perennial question of social cohesion.",
            "Ove sociologies.",
            "Another translation if you want to.",
            "More informal, it's a pretty old question.",
            "Thomas Jefferson, who we Canadians think of is an evil rebel, wrote in 17.",
            "That's pretty Americans in the audience rope in 1784 at the mobs is city, or, you know, just soars screwing up the strength of the human body and the question from attorneys to Terkel has been our things.",
            "Falling apart from urbanization reauthorization, industrialization, capitalization, socialization, socialism?",
            "And Techno changed and and you read in the newspapers, the Internet is just the latest example of that.",
            "Francis can cross in England, wrote a book 1996 If I remember called the Death of Distance."
        ],
        [
            "Said that, bodies don't matter and this guy actually lived a life.",
            "Ryan Lackey was running a data farm semi legally in the English Channel and once a month about would come in and give him stuff that's going on given food and otherwise in that he was just connecting on life and this is very imageable Canadian government.",
            "The National Film Board made a movie about him and a few other people.",
            "It was a cyber sex segment to the movie, but it's very atypical.",
            "I've been sitting at the back, leave your screens.",
            "No one here is engaged in cyber sex during this conference."
        ],
        [
            "But more typically is this cartoon from The New Yorker, which I didn't change.",
            "They used my name.",
            "And this is new request is just it's moving more than 10 years ago.",
            "So what's going on?",
            "I have to check my email 100 times a day, something the low side of this.",
            "But I tweet a lot."
        ],
        [
            "Some of you know.",
            "OK, so there's a moral panic about what's happening from the Internet.",
            "Are we being closed?",
            "Are we being isolated?",
            "But Putnam wrote his book called Bowling Alone.",
            "Actually, before the Internet became popular, he did a little bit of the BC into it, but he's basically saying people are not connecting the argument I am making and I think I'm making with evidence and the evidence is in the 350 page book is that the Internet and mobile are actually connecting us with a new ways, socially networked weighs more than formally organized with.",
            "And then."
        ],
        [
            "Goes with some of the hacktivism.",
            "Talk with Michael Yip.",
            "Produced before by the way, I thought of another reason why the Chinese government wants it.",
            "It's a great way to collect names for the future.",
            "And I wonder if they're using semantic analysis and stuff like that is filtering techniques, But I work with many Chinese students, and I cautioned them to be extremely careful online.",
            "Of course, I work with American students and I question them in the same way.",
            "OK, so people are moving in their social networks beyond the world of type groups.",
            "By the way, social networks existed before Mark Zuckerberg.",
            "And if you look at that, how many people have not seen that movie?",
            "I'm really surprised.",
            "OK, if you look at the social network movie, it's not about social networks, it's about a.",
            "Pretty lonely guy.",
            "Trying to get a girlfriend.",
            "It's about.",
            "It's about social class and ethnic problems in Harvard, which I think were exaggerated also about really a typing that group.",
            "All these very little networking going on in that film.",
            "But anyway we can get."
        ],
        [
            "No, they already crazy, so the argument is people function more as network individuals that the individual is the organizing unit rabbit in the village, the family, the neighborhood of the organization.",
            "And that therefore we have someone list.",
            "I think it was Karen put up each person has agencies operating his network and person to person.",
            "Contact has supplanted place to place content.",
            "Each one of you is or Thomas Quasi autonomous network agent."
        ],
        [
            "And so we have to move around between.",
            "We don't have one home community.",
            "We have to move around among them.",
            "Other number of them.",
            "We manage our networks and we have to get the rely on many specialized relations.",
            "This is not just an assertion.",
            "If you read paper that I wrote with Scott Berkeley Way back in 1990 called different strokes for different folks, we documented that in the area of Canada that we study part of Toronto.",
            "The Connected Life study that I did with Bernie Hogan at the OAI, and a number of other people also documented that.",
            "In the age of the Internet, the people you get emotional support rather unique to cold sisters.",
            "The people you get financial support are rather unique to cold parents until you get to be my age, in which it then reverses people who you deal with taking out the garbage or watering your plants are called neighbors, and these are very specific roles.",
            "So with Facebook really screws up and I can't believe they're making money by have, they haven't listened to me is by assuming everybody wants to know everybody else.",
            "Anybody remember the buzz disaster?",
            "What was the disaster?",
            "We need everybody.",
            "They need everybody visible to everybody else in the network.",
            "So we had one woman linked to her abusive ex-husband 'cause she had to deal with about the kid and her current boyfriend.",
            "They suddenly knew about each other.",
            "It was literally in case of great personal danger, so there's a reason why computer scientists need to know social science.",
            "To avoid class action suits and to better to do better software."
        ],
        [
            "So we're talking about people have partial membership in multiple networks rather than being in one.",
            "I call it the Facebook fallacy.",
            "If you want to call it the buzz fallacy.",
            "Go on.",
            "So you have to be a juggler.",
            "It's more work than sitting back and letting your mother or your father in a village elder deal."
        ],
        [
            "These things in fact, it's interesting when you ask people about their close ties, that half of them still akin in the age of the Internet.",
            "What's disappeared has been neighbors have shrunk from 13% in the 1980s down to 4% now, and Melissa God Boo Tracy Kenny I coming out with a paper on this, I think we're going to call it.",
            "Closeness is a many splendored thing.",
            "Still have a movie submitted yet so we're not sure, but."
        ],
        [
            "To argue that and show the different kinds of people are close for different reasons.",
            "That the argument by Lynn Smith, Lovin and McPherson, and Matt Breshears.",
            "Really good scholars that you have to look at only discussing important matters is really 2."
        ],
        [
            "Narrow definition of this.",
            "I want to skip the stuff, but this is basically saying people have a lot of different ways."
        ],
        [
            "Are being close with each other.",
            "And this is different from the old traditional small groups where it was village based.",
            "Knowledge came from only within the group.",
            "That's our logo by the way.",
            "In the bottom of the slide, am I moving too fast for somebody?",
            "Anybody think I'm talking too fast?",
            "Too slow, you want to eat?",
            "Nice to speed up the beers waiting, OK."
        ],
        [
            "We then moved and this is my own thinking and I have evidence for it to what I think since World War Two, having lived in England, having lived in Netherlands for a year, traveled a bit.",
            "So what I called localized situation.",
            "Which is the fact that we still had home bases, typically home Village or town, or neighborhood and workgroup.",
            "But then we traveled between them.",
            "The obvious example might be little.",
            "Last night, maybe we went down the Rhine, but we never connected with anything down the line.",
            "When you get on an Expressway or a train or a plane, you go from point to point.",
            "When you have intensive involvement, but unlike the old days when you rode a horse or walk, you don't really deal with anything in between.",
            "So you still have a group basis and then some connections.",
            "And of course the old dial-up telephone was like that.",
            "But now we're into what we call networked individualism where the person is the individual unit."
        ],
        [
            "Of interaction."
        ],
        [
            "It is said that here we have private concerns are important.",
            "We have less surveillance in many ways.",
            "We have surveillance that I really need to update this slide in two ways.",
            "When we're watching each other on Facebook and we came up with the name covalence for peer to peer surveillance and two as the Chinese government example, sort of implied there is a great deal of corporate and government surveillance of people.",
            "All Facebook once again being an example of who, what you're doing, who you're doing it with, what's going on.",
            "So there's the appearance of individual autonomy.",
            "Within that.",
            "There's a lot of visibility in some ways, harking back to the old villages where if you snuck out at 2:00 in the morning to have an affair with your neighbors girlfriend.",
            "It might be pretty visible really quickly."
        ],
        [
            "And this is a different individualistic family model than the 1950s.",
            "These are American examples.",
            "I apologize for it, but that was a type family group and in Ozzie and Harriet Radio and then television show and fun with Dick and Jane is white American.",
            "Every school kid in my agent even later learned how to read.",
            "Mom stayed home.",
            "The two kids played only in the neighborhood and Dad went off to work and came back.",
            "Are there many TV shows like this or Cosby show?",
            "Actually Mom went out, but we never really sore and this is changed.",
            "Who has kids here?",
            "Well, a lot of you.",
            "What do all your children have cell phones?",
            "Anybody not give your child a cell phone?",
            "How come?",
            "General.",
            "That's that's not that is not the cause or reason.",
            "That's a descriptive phenomenon.",
            "Because the average kid knows how to play Angry Birds at the age of 2 right now.",
            "So when we did a Canadian study, the mean age was actually 9, but I predict it will go down rapidly even in Europe.",
            "Kids want it.",
            "They think it's liberated.",
            "Those moms who gave your kids cell phones.",
            "No, it's not liberating.",
            "It keeps the kid on a leash.",
            "You know where he or her are at all times.",
            "Anybody have some examples of that from Europe?",
            "It's liberating within the boundaries, so it is liberating aspect of it.",
            "But because the boundaries are both define the tether.",
            "If you will have a cell phone.",
            "Yeah, kids can.",
            "You can call him up and say where?",
            "Where are you?",
            "What are you doing now?",
            "You know?",
            "Ingenious, I know in Japan you can get phony background noise to put on the floor.",
            "Stuff like that.",
            "I mean, so there's an arms race between kids and parents.",
            "What else is new?",
            "And we found in Tracy Kennedy I have a paper based on Pew data called network household and so chapter six of the current new book called Network Families, in which there's a lot of communications and husbands and wives or in Canada because we're progressive country husbands and husbands are relating to Ardito wives and wives.",
            "It's not fancy about it relating to each other all the time using their mobile phone.",
            "As a way of coordinating so even though they're not staying home as tightly as before, is still is a lot of communication."
        ],
        [
            "So the households that can move from being groups to net."
        ],
        [
            "Works.",
            "And at the same time, the kind of how so this is American data.",
            "Has changed in that there are fewer households with children.",
            "There are few American households in more single parent households.",
            "Canadian data looks the same.",
            "I have not are we had to do some boundaries in our book for interest, and we therefore used only American and Canadian data.",
            "I'm not too upset.",
            "I think many, but not all of the examples will pertain to Europe, Japan, Korea."
        ],
        [
            "Perhaps even parts of India.",
            "So we know from time use that they keep less time together.",
            "They keep separate address books.",
            "All they connect through their mobile's and at the homework boundary.",
            "Tracy Kennedy died just published the paper.",
            "It's in a book edited by James Cats on mobile communication.",
            "There are many kinds of doing work at home.",
            "First of all, the people who stay at home all the time to work anybody stay home at least three to four days a week to work.",
            "OK, yeah?",
            "The real your real smaller but small and and of course when you get the jobs like sales clerk or truck driver, it's really hard to stay home.",
            "If your truck driving.",
            "2nd is a people who routinely bring home work.",
            "Overload work, and I'm not even gonna ask anybody not bring homework in the evening.",
            "Will you be embarrassed here?",
            "I TV kind of group and then third or people who do both who moved back and forth a lot.",
            "I know I had to stay home to get through the bloody book done so the homework boundary which used to be pretty clear.",
            "You know you go off.",
            "Come back at 5:00 o'clock and stuff like that we now back to the 19th century when farmers shopkeepers lived over to store or accountants even and doctors doctors used to actually you visit them in their house but they made house calls.",
            "So we're actually going back to that homework.",
            "Kind of thing when I have a specialist doctor through problem, I have an I email him and I get to his answer back at midnight.",
            "Thanks Homie, I hope he's at work."
        ],
        [
            "At home, so we know from time uses Canadian data.",
            "People are spending less time in person together, but they're spending more time communicating one."
        ],
        [
            "Later another.",
            "Now the whole notion where the technology is alienating of I mean the Chinese example in Michael.",
            "Yep, that is very different in Canadian, but there's a big media myth that says people hate the Internet.",
            "Anybody encounter dead myth in your own reading or stuff like that?",
            "I'm not making it up.",
            "Certainly all over North America or The Economist, which is become practically an American magazine.",
            "So I worked with.",
            "I did work with survey is across Canada and we found I think the first 2 numbers are interesting and for those of you qualitative analysis I've done the math by 5 to one ratio.",
            "People feel more connected by technology rather than less.",
            "This is what the survey tells us.",
            "However, to me the this the bottom part 51% and 7% off people shrug they say oh we, we don't even think about technology, which basically means mobile in the Internet is just part of their lives.",
            "So we treat web science is a big deal.",
            "They think the web is something like the toilet.",
            "It's just something that's there all the time.",
            "Similar use."
        ],
        [
            "Similarly news.",
            "Speak for yourself.",
            "OK, so we have we have a lot more connectivity and once again."
        ],
        [
            "This isn't just an assertion of American data.",
            "Once again, you can see that the number of cars off at every household has is going up fair amount.",
            "We can do a whole speech about American wasting electricity, but I don't want to get there when I want to argue.",
            "Assert is that there's more individual mobility.",
            "One car per Apple."
        ],
        [
            "Airlines, many of us came here.",
            "This was a great trip.",
            "We didn't have delays.",
            "And.",
            "When I grew up, people addressing ties and jackets to get on the plane, it was such a big event in 1965 when I took my first trip.",
            "Now I only dress in the tie in jacket to do keynote speeches.",
            "You know we're in switch sweats and stuff like that when we fly.",
            "It's like taking the bus when the train was in the."
        ],
        [
            "More days on.",
            "And I think I left a slide out.",
            "What's what may shock you if you read the newspaper?",
            "There's more peace in the developed world and there has been an age is.",
            "Yeah, we know about Afghanistan, Iraq, Libya.",
            "Many other micro wars, but we also know about the Schengen Agreement.",
            "We know about our free travel, not free, but rather unimpeded travel between North America and Europe and listen to that silly people like George Bush put visa restrictions on so it in so great.",
            "But still it's pretty easy for all of us to get together places now.",
            "And the phone exists when my grandmother used the phone, she used to shout down the telephone just to make sure it was heard.",
            "Now we can get on Skype relatively easily, talk to each other.",
            "People have called home in the past few days.",
            "Thank you."
        ],
        [
            "And so the number of calls is shut up with the money they're making perko.",
            "It's been a volume versus money making trade off."
        ],
        [
            "And we know because I did the data, so I totally trust it all, which with Quan otherwise known as Helen Wayne, just graduated a year ago from.",
            "However, school in Southern California.",
            "That when people are saying they have more friends than before to them or use the Internet, the more friendships you have and the Pew Internet and American Life Project www.internet.org just came out with a big study headed by Keith Hampton.",
            "Came out two days ago and 15, two or three day two days ago showing pretty similar stuff would even more.",
            "Detail information and Helen and I quietly is Helen Wang.",
            "Sorry there's a published name in it.",
            "Informally, we decompose the data and it wasn't just that young folks were coming on.",
            "It was that people as they grew older, we're using we're developing more fresh."
        ],
        [
            "Ships as well as using the Internet more.",
            "So one thing I'm not going to go into more detail is the voluntary organizations have been supplanted by ad hoc open, informal civic networks.",
            "As Michael you said in the previous talk, China doesn't allow organized groups.",
            "Anybody from East Europe here.",
            "Yeah, it's actually pretty constricted conference.",
            "I notice Germany and England.",
            "Netherlands in America, but in East Europe they actually did allow some organized groups as long as they supported the party up until 1989.",
            "So my revolutionary friends were in the ecology movement, which suddenly emerged in Bulgarian, even on visit."
        ],
        [
            "Is a political organization and something that I I noticed and some of the people in this room could speak to even more often compared to one of the few other times I've been in Germany, I've noticed that there's been more move staffing homogenate nitrogenated.",
            "Excuse me.",
            "I'm sure they're real problems here, but you know, I see multi colored people even on the streets in Coblence talking German and that's a big change you guys want to comment down there.",
            "Anybody here let's that would take too long and US we having a fair percentage of marriages are interracial.",
            "When I grew up, it was almost unheard of.",
            "Even going across really."
        ],
        [
            "Edges boundaries were strong this the picture on the left.",
            "With the world's most gorgeous man of good time Sydney Port EA was a shocking movie in 1967 when in many states in US is still illegal to marry across racial boundaries.",
            "And he said all the woman I forgot her name even remember her name is an actress.",
            "She said mom guess who's coming to dinner my my fiance.",
            "He says doctors surgeon, he's brilliant.",
            "He went to Harvard, Stanford, Berkeley, Oxford.",
            "Who knows you gotta love him and then the doorbell rings in.",
            "This black man walks in and the parents have a nervous breakdown.",
            "That's the entire movie basically.",
            "And of course, the punchline is they find it they love men.",
            "Now we have a company called Harmony which supports the Oxford Internet Institute.",
            "By the way, showing ads with a guy with a.",
            "More than a suntan.",
            "Plug in your very blonde woman and this is a commercial way they want to make money.",
            "So they're treating.",
            "This is normal.",
            "Destiny isn't, you know anybody can do a Brotherhood weekend, but when a company puts it on there."
        ],
        [
            "Pretty amazing.",
            "And."
        ],
        [
            "OK, we have some survey data showing that too, and even religion is changing.",
            "There's been a rise of different religious groups in North America and Western Europe, and."
        ],
        [
            "Some understanded groups have gone away and this was I had to get my my zoom lens on on this one.",
            "Here is Chelsea Clinton.",
            "She's the woman.",
            "Neringa, Diane.",
            "It was all about housing investment banker, but then I notice the little bump on top of this thing.",
            "Yeah, it was in the New York Times and that's what injured divisions called the Kepi or Yama 'cause it was an Inter religious marriage which was not really remarked that I didn't see it remarked on anywhere.",
            "If it was, it was.",
            "It was very very microphone.",
            "This is all group nization."
        ],
        [
            "OK, so now we have the Internet revolution giving people a lot of power.",
            "We all know that I don't have to do that in this group.",
            "The number of PC's.",
            "OK, well this is kind of obvious.",
            "I'm going to move fast."
        ],
        [
            "Anybody need to know the Internet gives you a lot of communication."
        ],
        [
            "OK."
        ],
        [
            "But we take some of the things for granted.",
            "Well, I did until I had actually 1.8 kilobyte service at the Mercur Hotel last night.",
            "Instead of watching paint dry, I was watching the screen lines.",
            "He painted so we have fast bandwidth we can get on anytime I showed up without my laptop and knowing that someone would supply when here complete with viruses out here.",
            "And we can all get on the same way and almost anywhere in the world.",
            "North Korea, and maybe Cuba, except it, and it's personalized.",
            "It's you logging in red."
        ],
        [
            "Then the family phone login.",
            "So we find that the closer people are, the more that they say they close with each other.",
            "They more of a talk and we find still that telephone is the most voluntary medium you know, except for Robo calls where people are trying to sell you something.",
            "Telephoning is really where you think about who you calling and why you're calling and being a very close eye matters."
        ],
        [
            "Yet, we know that the Internet fosters neighboring change.",
            "Jacobs, who lived in New York for many years when she wrote Death and life, American cities and then moved up actually to be my neighbor in Toronto.",
            "Found that eyes on the street keep things going and keep things safe.",
            "Well in some ways Facebook gives you eyes on the street.",
            "You know when there's a problem.",
            "You actually experienced the one where fringes broke up by changing relationship to single.",
            "Anybody actually experienced there?",
            "It's one of those urban legend kind of thing.",
            "I've seen a wedding where the guy.",
            "Went on Facebook during the ceremony, but that was so famous that it went viral around the world, but we know from my data and we can do other studies that many emails, messages, cell phones or local.",
            "In fact, among University students, my colleague Rhonda McEwen found the most common message among University students is calling 5 minutes before you get arrive at a place saying I'm almost there, giving it a chance to kind of clean up.",
            "And then of course you meet face to face and then about 10 minutes after you leave, you called back and said that was wonderful.",
            "And I also pull it off.",
            "And then you do some gossip here so it is an interplay between physical locality, physical propinquity and."
        ],
        [
            "I'm using cell phone and Internet.",
            "It is somewhat fragmented culture, but I haven't."
        ],
        [
            "Good evidence of that, so skip this one.",
            "OK, so the mobile revolution obviously has allowed ICT's to become appendages.",
            "Has Europe Gunn's texting?",
            "I think you're actually went to texting more than America.",
            "Am I right on that?",
            "Nobody's phone has Rang during this conference, which is pretty amazing.",
            "So we're always iaccessible whether we want to or not.",
            "I like this needs to be studied more about how at least being always on.",
            "Anybody experienced the fact?",
            "Why didn't you answer your text message today?",
            "Because I expected you to?",
            "And no, I'm at a conference and I'm trying to pay attention.",
            "Anybody experienced that?",
            "Yeah, that's the only a few.",
            "Or if you."
        ],
        [
            "Wait a minute.",
            "So.",
            "Lee Rainie, my coauthor, and I we took old movies.",
            "Some of these may be too old to you once really old movie from the 1600s.",
            "And we could put that.",
            "What would happen if mobile phones?",
            "I won't use the German word handy.",
            "It sounds too upsetting to North Americans.",
            "The Rocky Horror Show everybody seen the wrecking you haven't seen the Rocky Horror Show.",
            "Get some weed.",
            "Go to Amsterdam.",
            "The lost and trapped in this haunted house with really interesting people in it.",
            "Just pull out clone called their parents up and see.",
            "Send the Mercedes Romeo and Juliet is you know God.",
            "If they had only been able to call each other.",
            "There is Eula, I don't know.",
            "Anybody seen Ferris Bueller here?",
            "Yeah, great movie.",
            "Kid takes off from school.",
            "He's adding touch.",
            "You know we have to pull.",
            "This season is battery out.",
            "He'd be tracked Roman holiday, even greater movie with or to heparin from the 50s.",
            "She's a Princess one so high message to Garcia.",
            "Basically a guy has a different message through by hand.",
            "Instead of sending an attachment."
        ],
        [
            "When is the first American imperialistic wars is worth 1898 Spanish American war, so we're seeing in US.",
            "I'll landline to going down mobile is going up.",
            "How many people here do not have a landline at their home?",
            "Tell me about 10 to 15% in America of course is very much age related.",
            "The younger you are, the less likely you have in landline and this makes real problems for survey data because there are no published directory.",
            "Is a landline of mobile phone people and they're very expensive to contact with random digit dialing.",
            "Center for Disease Control's, which is doing a lot of epidemiological studies.",
            "Is 1, but is it speaking?",
            "Rapid etiology?",
            "Do we know it's bean sprouts?",
            "Who said no?",
            "Tested it.",
            "Borderline.",
            "Oh my God, I'm dead."
        ],
        [
            "But still people watching television."
        ],
        [
            "Stuff like that, um, work Cortana.",
            "Be, as I said, has many of us are working in network teams of across everywhere.",
            "Distributed word stuff is coming in.",
            "Sometimes it worked.",
            "I flew a Boeing 777 which was designed.",
            "It is distributed, wait anybody fly a Boeing 787 year because it hasn't taken off yet in a safe manner.",
            "They built it in a distributed way.",
            "An parts just don't fit together tremendously.",
            "Well, and it's I think about four years behind schedules.",
            "Many of us work flexible schedules, so who is it?",
            "Oh, I.",
            "You know, never call Bernie Hogan before 10 in the morning, right?",
            "Or you expect a response with the kind of jobs.",
            "Certainly knowledge workers, especially we don't have to necessarily show up nine to five and less.",
            "We live and work in Singapore where it's pretty obligatory.",
            "Even crafted Dennis."
        ],
        [
            "We're moving to use is phrase, and then Richard Florida's picked it up from being Adam workers in which we manipulate things to being bit workers, which is what you roll manipulating on the computer.",
            "All the letter you would Adam consumers last night by terms of your.",
            "Tony"
        ],
        [
            "Yeah, an all this picture will be in the booking little Honda Good Canadian name.",
            "She lives in Toronto at least Indian background.",
            "Oh yeah, we posted a little bit, but she had all that stuff out at a local cafe and I just put some labels on there and.",
            "I don't think she missed anything.",
            "And she was working at that time for those in Canadians who was working for see TV.",
            "Now she works for another media company.",
            "I love the fact that unlike most other people her age, she actually had a real watch out and certainly lower left hand boundary over just like."
        ],
        [
            "So I'm starting to sum up those you're watching your your time off.",
            "We have a triple revolution going on the move to networks individuals and not in groups.",
            "Turns out a social networks are larger.",
            "Dunbars number it doesn't make sense.",
            "I provide evidence in the book that.",
            "The magic number is about 600 and change of the number of average number of real people we know, not Facebook friends.",
            "We've never heard of in contact and up.",
            "Tweaks that we've never heard of off this in a number of studies in a number of places is a robust regression coefficient of more infinities.",
            "Is untyped, is associated with more in person contact.",
            "There's more moves back to the 1800s where people work at home, and they work with the weight is a lot of part time working at home.",
            "Of course I see teams are giving us a lot more information and more diverse information.",
            "And something that my colleague Juan Carrasco, now in Concepcion Chile, did for his PhD thesis is transportation is both fungible, replaceable with communication.",
            "But if that were so, all none of us would be sitting here.",
            "We'd be only online, and so we find out that it actually is additive, with people with ICT's information and communication technology, the more people see each other as here.",
            "Then the more that they can communicate with each other all through the Internet or mobile phones."
        ],
        [
            "Here I had the sense I just wrote these last night, so please forgive me.",
            "I put I clearly couldn't download a lot of URLs.",
            "Mercury was so bad, but if you want to develop this if you're moving from the computer science world onto the social science world, these are some leads I think you might want the international network for social network analysis.",
            "I founded in 1976 and that's about 1300 members and that's its website and it has a really good listserv called sakhmet.",
            "SOCNET you can get on through the website next conferences Los Angeles March on.",
            "2012 and then in 2013 there will be 2 conferences.",
            "Of one will be up North in Germany and Hamburg.",
            "Who's organizing that I forget?",
            "Latina hosting is organizing in Hamburg and colleagues and then another one will be in China.",
            "GNX IAF of both the new bout this time of year.",
            "The energy is organizing that none involved with that.",
            "Secondly, as Eva Kahan will tell 'cause she found out about this conference is a really nice.",
            "Lists are from the communication Information Technology section of American Sociology, Association of all weird places for left wing, sociologists to meet.",
            "We're in Las Vegas in this August, where it will be about 50 degrees per.",
            "That's Celsius few Americans.",
            "OK.",
            "But we're at Caesar's Palace.",
            "And the room price is only $120.00 a night, which is a bargain.",
            "You want to see Las Vegas, which is amazing cultural phenomenon.",
            "Nice thing about Las Vegas, you know if they see Europe because his hotel.",
            "International Communications Association.",
            "We just met.",
            "I think it's wonderful even though I'm a sociologist, I know Peter Mungia, general folk.",
            "Were there Nash contractor?",
            "Was there anybody else to DIC in?",
            "Couple of people Brian Keegan was there.",
            "Next meeting is in Phoenix in May 2012.",
            "I believe it's may it will be awfully hot here too.",
            "And Phoenix, unlike Las Vegas, has nothing to it other than suburbia.",
            "So you be forced to do the conference.",
            "The Information Society people.",
            "I really don't know much about when or where they meet anybody contribute today.",
            "OK."
        ],
        [
            "You can look him up and as I said, the books coming out in January 2012.",
            "Those are the chapters in the book.",
            "There's my coauthor like me you had here when you started.",
            "And we've had a lot of fun doing it, and I've really learned a lot from coming here.",
            "So Many thanks to all of you, goodbye."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have a sense that many of you came here from the world of computer science and are more interested in moving into the social science implications.",
                    "label": 0
                },
                {
                    "sent": "And I've gone in the opposite direction.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Literally I came from New York City.",
                    "label": 1
                },
                {
                    "sent": "I moved to Toronto in 1967.",
                    "label": 0
                },
                {
                    "sent": "Which of those you have any sense in history was a particularly good year to move to Canada had a choice between your job in Toronto or a job in Vietnam.",
                    "label": 0
                },
                {
                    "sent": "And they were not gold farming in Vietnam then.",
                    "label": 1
                },
                {
                    "sent": "Interesting things worked out and in the 1960s I started Graduate School in 1963.",
                    "label": 0
                },
                {
                    "sent": "Most to see my Twitter picture.",
                    "label": 0
                },
                {
                    "sent": "I had a little bit more heritage.",
                    "label": 0
                },
                {
                    "sent": "We were developing I would say was the Godfather.",
                    "label": 0
                },
                {
                    "sent": "I would say Harrison White and in England.",
                    "label": 1
                },
                {
                    "sent": "Clyde Mitchell and John Barnes work where really the originators of social network analysis.",
                    "label": 0
                },
                {
                    "sent": "But we were developing the thinking of affect and if you look at the book that came out about 20 years later called social Structures in network approach.",
                    "label": 0
                },
                {
                    "sent": "Cambridge you Chris.",
                    "label": 0
                },
                {
                    "sent": "It's out of print but still pretty widely available.",
                    "label": 0
                },
                {
                    "sent": "We pretty well laid out some of the basic tenants of social network analysis and the first chapter I wrote there pretty well holds up at the same time.",
                    "label": 0
                },
                {
                    "sent": "I was a community sociologist and I'm doing this biography because I think we're all coming from different places.",
                    "label": 1
                },
                {
                    "sent": "Actually heard me wrote this yesterday.",
                    "label": 0
                },
                {
                    "sent": "An coming as a child from New York.",
                    "label": 0
                },
                {
                    "sent": "I was shocked and appalled that.",
                    "label": 0
                },
                {
                    "sent": "Receive sociological and popular media wisdom.",
                    "label": 0
                },
                {
                    "sent": "Back then, as it is now, Sherry Turkle, saying communities falling apart, except it isn't.",
                    "label": 0
                },
                {
                    "sent": "How I grew up hanging around in streets in New York and I knew we had strong communities and so I made it my mission for about 30 years to study communities, but not necessarily assuming there in neighborhoods, but linking with my first interest to treat communities as social networks.",
                    "label": 0
                },
                {
                    "sent": "Because as everybody here knows, but popular media has not really figured out, we all have far flung friends.",
                    "label": 0
                },
                {
                    "sent": "Physical friends, one of the reasons we come to conferences like this is when I get an email from Southampton.",
                    "label": 0
                },
                {
                    "sent": "I will have a face in a body and a voice to associate with some more likely to answer in the news.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is ongoing interplay between what's happening face to face and what's happening online.",
                    "label": 0
                },
                {
                    "sent": "1990 R 3 computer scientists run Becca, Bill Buxton and well who's then called Marilyn Manti now Maryland?",
                    "label": 1
                },
                {
                    "sent": "Tremaine got in touch with me and said, hey, look, we're building a system for people to collaborate with each other, hopefully online.",
                    "label": 0
                },
                {
                    "sent": "We even have the word Internet, yet in fact, we built it off.",
                    "label": 0
                },
                {
                    "sent": "From scratch, which is a crazy way to do it, called the Telepresence got to copyrighted, so Cisco is now making the money that we should have made over it, and I've happily work with computer scientist ever since, while when they're smart to their quick, I got tired of people in social Sciences thinking five years about what project to do, and three, they have better conferences and more interesting places, always important criteria.",
                    "label": 0
                },
                {
                    "sent": "Better way to sociologists are meeting in Las Vegas this summer.",
                    "label": 0
                },
                {
                    "sent": "If you want to get a cheap room in Caesars Palace, this is your chance.",
                    "label": 0
                },
                {
                    "sent": "And and for although there will be some dispute here, computer scientists have more money on research grants and social scientists too and money is nice.",
                    "label": 0
                },
                {
                    "sent": "It allows people to go to conferences and buy big toys and little toys.",
                    "label": 0
                },
                {
                    "sent": "And I continue doing that.",
                    "label": 0
                },
                {
                    "sent": "I'm working with a group in Canada called grand.",
                    "label": 0
                },
                {
                    "sent": "Any Canadians here?",
                    "label": 0
                },
                {
                    "sent": "OK, I can lie 02.",
                    "label": 1
                },
                {
                    "sent": "And it's a network of centers of excellence of research centers across Canada.",
                    "label": 0
                },
                {
                    "sent": "Canada is about 8000 kilometres wide.",
                    "label": 0
                },
                {
                    "sent": "Or maybe it's a little bit of exaggeration.",
                    "label": 0
                },
                {
                    "sent": "With big Country sparsely settled, so we're studying the people in computer science, social science and humanities.",
                    "label": 0
                },
                {
                    "sent": "How they relate to each other in projects.",
                    "label": 0
                },
                {
                    "sent": "Whether space makes a difference.",
                    "label": 0
                },
                {
                    "sent": "The short answer, it sure does.",
                    "label": 0
                },
                {
                    "sent": "And with the discipline makes a difference.",
                    "label": 0
                },
                {
                    "sent": "Help people can relate to each other across and also how projects are organized.",
                    "label": 0
                },
                {
                    "sent": "And I have a team of doctoral students an.",
                    "label": 0
                },
                {
                    "sent": "System Professor Anatoly Bruce are very, very happily engaged in this research.",
                    "label": 0
                },
                {
                    "sent": "No hot findings.",
                    "label": 0
                },
                {
                    "sent": "It invite me back next year.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I really personally have interested is when they said in.",
                    "label": 0
                },
                {
                    "sent": "Finding the interplay of technology and society and sometimes stating the non obvious.",
                    "label": 1
                },
                {
                    "sent": "I've been doing a study called Connective lives with Bernie Hogan, now with the Oxford Internet Institute, Keith Hampton.",
                    "label": 0
                },
                {
                    "sent": "Jeffrey Bows for many years and what we find unlike what Sherry Turkle's alarmists in data free book, it's great to have a book without data.",
                    "label": 0
                },
                {
                    "sent": "You can say what you want.",
                    "label": 1
                },
                {
                    "sent": "People have more friends than ever.",
                    "label": 0
                },
                {
                    "sent": "See the paper that Helen Wang and I did quotes social connectivity.",
                    "label": 0
                },
                {
                    "sent": "American behavioral scientist, American behavioral scientist.",
                    "label": 1
                },
                {
                    "sent": "Last year we find the local is still important.",
                    "label": 0
                },
                {
                    "sent": "I work with geography Dan amok on that, the closer you physically artist somebody, the more likely are going to connect, and we find that almost all online friends are offline as well.",
                    "label": 1
                },
                {
                    "sent": "Carolina Heathrow employed now British Columbia, and I added a book called the Internet in everyday Life.",
                    "label": 0
                },
                {
                    "sent": "2002 I think it holds up.",
                    "label": 0
                },
                {
                    "sent": "And I've been working a lot recently with the Pew Internet and American Life Project, which only does American studies.",
                    "label": 1
                },
                {
                    "sent": "That's what they're funded for.",
                    "label": 0
                },
                {
                    "sent": "They'd love to go abroad.",
                    "label": 0
                },
                {
                    "sent": "I also work with the World Internet project anyway.",
                    "label": 0
                },
                {
                    "sent": "Here involved with world Internet.",
                    "label": 0
                },
                {
                    "sent": "OK thanks, where are you from?",
                    "label": 0
                },
                {
                    "sent": "Oh I OK yeah.",
                    "label": 0
                },
                {
                    "sent": "They're doing comparative research in many, many countries.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But turning to the substance of this talk and what the book that Lee Rainey, his head of the Pew Internet Project, and I we've just handed in the manuscript, and we're in that kind of expecting pregnancy, raises the books not coming out until January 2012 by MIT Press.",
                    "label": 0
                },
                {
                    "sent": "And what we argue is that there's a triple revolution.",
                    "label": 1
                },
                {
                    "sent": "And the revolution is turning from groups.",
                    "label": 1
                },
                {
                    "sent": "Founded solidarity Local, tightly knit to social networks in which people move around among many different sets of relations, much as we're doing here.",
                    "label": 1
                },
                {
                    "sent": "Although I noticed on the boat last night, most people were sitting in one spot with their own group that they came from.",
                    "label": 0
                },
                {
                    "sent": "How many people moved around in network below?",
                    "label": 1
                },
                {
                    "sent": "So you exaggerate.",
                    "label": 0
                },
                {
                    "sent": "'cause I took video of the whole thing.",
                    "label": 0
                },
                {
                    "sent": "But we do this morning.",
                    "label": 0
                },
                {
                    "sent": "Second, the things we take for granted now, although certainly if you're as old as I am.",
                    "label": 0
                },
                {
                    "sent": "Few others in this audience, we don't forever the Internet.",
                    "label": 0
                },
                {
                    "sent": "But the Internet has some very interesting properties.",
                    "label": 0
                },
                {
                    "sent": "Obviously it's more or less distance free for those who are trying to communicate back home to Korea or America, know the timing shift problems and so personal.",
                    "label": 0
                },
                {
                    "sent": "Everybody remembered ildefons yeah why?",
                    "label": 0
                },
                {
                    "sent": "It came into the house.",
                    "label": 0
                },
                {
                    "sent": "They didn't come into your pocket and therefore when your boyfriend or girlfriend called, everybody knew what was going on.",
                    "label": 0
                },
                {
                    "sent": "So the Internet is personal, mobile is personal, mobile is a number of talks saying here is developing a somewhat distant dynamic, although I kept wondering about the talk about West Africa, how people charge their mobile phones without electricity.",
                    "label": 0
                },
                {
                    "sent": "The sun, right?",
                    "label": 0
                },
                {
                    "sent": "You had central stations, public public buildings as well.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, they didn't have personalized electrical connection, so we're interested in what the intersection of these phenomena is doing to interpersonal relations.",
                    "label": 1
                },
                {
                    "sent": "I mean, there are other kinds of relations are import.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But I'm just not looking at it.",
                    "label": 0
                },
                {
                    "sent": "And we plugged into a controversy.",
                    "label": 0
                },
                {
                    "sent": "All how many people here are sociologists.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "Few of us were there can remember June 2, 2006 before some of you were born.",
                    "label": 0
                },
                {
                    "sent": "There was this article in the American Sociological Review called Social Isolation in America that took one question.",
                    "label": 1
                },
                {
                    "sent": "Do you he discuss important matters with an?",
                    "label": 0
                },
                {
                    "sent": "Found that the number of people had declined from a mean of 2.9 in 1984 to 2.1 in 2005, and that 23% of Americans were social isolates, and this created a great deal of media on moaning and a great deal of actually academic moaning.",
                    "label": 1
                },
                {
                    "sent": "That's what I call a cobalt sociology, and to use a German phrase or unit.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In fact, it's the perennial question of social cohesion.",
                    "label": 1
                },
                {
                    "sent": "Ove sociologies.",
                    "label": 0
                },
                {
                    "sent": "Another translation if you want to.",
                    "label": 0
                },
                {
                    "sent": "More informal, it's a pretty old question.",
                    "label": 0
                },
                {
                    "sent": "Thomas Jefferson, who we Canadians think of is an evil rebel, wrote in 17.",
                    "label": 1
                },
                {
                    "sent": "That's pretty Americans in the audience rope in 1784 at the mobs is city, or, you know, just soars screwing up the strength of the human body and the question from attorneys to Terkel has been our things.",
                    "label": 0
                },
                {
                    "sent": "Falling apart from urbanization reauthorization, industrialization, capitalization, socialization, socialism?",
                    "label": 1
                },
                {
                    "sent": "And Techno changed and and you read in the newspapers, the Internet is just the latest example of that.",
                    "label": 0
                },
                {
                    "sent": "Francis can cross in England, wrote a book 1996 If I remember called the Death of Distance.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Said that, bodies don't matter and this guy actually lived a life.",
                    "label": 0
                },
                {
                    "sent": "Ryan Lackey was running a data farm semi legally in the English Channel and once a month about would come in and give him stuff that's going on given food and otherwise in that he was just connecting on life and this is very imageable Canadian government.",
                    "label": 1
                },
                {
                    "sent": "The National Film Board made a movie about him and a few other people.",
                    "label": 1
                },
                {
                    "sent": "It was a cyber sex segment to the movie, but it's very atypical.",
                    "label": 0
                },
                {
                    "sent": "I've been sitting at the back, leave your screens.",
                    "label": 0
                },
                {
                    "sent": "No one here is engaged in cyber sex during this conference.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But more typically is this cartoon from The New Yorker, which I didn't change.",
                    "label": 1
                },
                {
                    "sent": "They used my name.",
                    "label": 0
                },
                {
                    "sent": "And this is new request is just it's moving more than 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "So what's going on?",
                    "label": 0
                },
                {
                    "sent": "I have to check my email 100 times a day, something the low side of this.",
                    "label": 0
                },
                {
                    "sent": "But I tweet a lot.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some of you know.",
                    "label": 0
                },
                {
                    "sent": "OK, so there's a moral panic about what's happening from the Internet.",
                    "label": 1
                },
                {
                    "sent": "Are we being closed?",
                    "label": 0
                },
                {
                    "sent": "Are we being isolated?",
                    "label": 1
                },
                {
                    "sent": "But Putnam wrote his book called Bowling Alone.",
                    "label": 0
                },
                {
                    "sent": "Actually, before the Internet became popular, he did a little bit of the BC into it, but he's basically saying people are not connecting the argument I am making and I think I'm making with evidence and the evidence is in the 350 page book is that the Internet and mobile are actually connecting us with a new ways, socially networked weighs more than formally organized with.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Goes with some of the hacktivism.",
                    "label": 0
                },
                {
                    "sent": "Talk with Michael Yip.",
                    "label": 0
                },
                {
                    "sent": "Produced before by the way, I thought of another reason why the Chinese government wants it.",
                    "label": 0
                },
                {
                    "sent": "It's a great way to collect names for the future.",
                    "label": 0
                },
                {
                    "sent": "And I wonder if they're using semantic analysis and stuff like that is filtering techniques, But I work with many Chinese students, and I cautioned them to be extremely careful online.",
                    "label": 0
                },
                {
                    "sent": "Of course, I work with American students and I question them in the same way.",
                    "label": 0
                },
                {
                    "sent": "OK, so people are moving in their social networks beyond the world of type groups.",
                    "label": 1
                },
                {
                    "sent": "By the way, social networks existed before Mark Zuckerberg.",
                    "label": 0
                },
                {
                    "sent": "And if you look at that, how many people have not seen that movie?",
                    "label": 0
                },
                {
                    "sent": "I'm really surprised.",
                    "label": 1
                },
                {
                    "sent": "OK, if you look at the social network movie, it's not about social networks, it's about a.",
                    "label": 0
                },
                {
                    "sent": "Pretty lonely guy.",
                    "label": 0
                },
                {
                    "sent": "Trying to get a girlfriend.",
                    "label": 0
                },
                {
                    "sent": "It's about.",
                    "label": 0
                },
                {
                    "sent": "It's about social class and ethnic problems in Harvard, which I think were exaggerated also about really a typing that group.",
                    "label": 0
                },
                {
                    "sent": "All these very little networking going on in that film.",
                    "label": 0
                },
                {
                    "sent": "But anyway we can get.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, they already crazy, so the argument is people function more as network individuals that the individual is the organizing unit rabbit in the village, the family, the neighborhood of the organization.",
                    "label": 1
                },
                {
                    "sent": "And that therefore we have someone list.",
                    "label": 1
                },
                {
                    "sent": "I think it was Karen put up each person has agencies operating his network and person to person.",
                    "label": 1
                },
                {
                    "sent": "Contact has supplanted place to place content.",
                    "label": 0
                },
                {
                    "sent": "Each one of you is or Thomas Quasi autonomous network agent.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so we have to move around between.",
                    "label": 0
                },
                {
                    "sent": "We don't have one home community.",
                    "label": 1
                },
                {
                    "sent": "We have to move around among them.",
                    "label": 0
                },
                {
                    "sent": "Other number of them.",
                    "label": 0
                },
                {
                    "sent": "We manage our networks and we have to get the rely on many specialized relations.",
                    "label": 1
                },
                {
                    "sent": "This is not just an assertion.",
                    "label": 1
                },
                {
                    "sent": "If you read paper that I wrote with Scott Berkeley Way back in 1990 called different strokes for different folks, we documented that in the area of Canada that we study part of Toronto.",
                    "label": 1
                },
                {
                    "sent": "The Connected Life study that I did with Bernie Hogan at the OAI, and a number of other people also documented that.",
                    "label": 0
                },
                {
                    "sent": "In the age of the Internet, the people you get emotional support rather unique to cold sisters.",
                    "label": 0
                },
                {
                    "sent": "The people you get financial support are rather unique to cold parents until you get to be my age, in which it then reverses people who you deal with taking out the garbage or watering your plants are called neighbors, and these are very specific roles.",
                    "label": 0
                },
                {
                    "sent": "So with Facebook really screws up and I can't believe they're making money by have, they haven't listened to me is by assuming everybody wants to know everybody else.",
                    "label": 0
                },
                {
                    "sent": "Anybody remember the buzz disaster?",
                    "label": 0
                },
                {
                    "sent": "What was the disaster?",
                    "label": 0
                },
                {
                    "sent": "We need everybody.",
                    "label": 0
                },
                {
                    "sent": "They need everybody visible to everybody else in the network.",
                    "label": 0
                },
                {
                    "sent": "So we had one woman linked to her abusive ex-husband 'cause she had to deal with about the kid and her current boyfriend.",
                    "label": 0
                },
                {
                    "sent": "They suddenly knew about each other.",
                    "label": 0
                },
                {
                    "sent": "It was literally in case of great personal danger, so there's a reason why computer scientists need to know social science.",
                    "label": 0
                },
                {
                    "sent": "To avoid class action suits and to better to do better software.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we're talking about people have partial membership in multiple networks rather than being in one.",
                    "label": 1
                },
                {
                    "sent": "I call it the Facebook fallacy.",
                    "label": 0
                },
                {
                    "sent": "If you want to call it the buzz fallacy.",
                    "label": 0
                },
                {
                    "sent": "Go on.",
                    "label": 0
                },
                {
                    "sent": "So you have to be a juggler.",
                    "label": 0
                },
                {
                    "sent": "It's more work than sitting back and letting your mother or your father in a village elder deal.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These things in fact, it's interesting when you ask people about their close ties, that half of them still akin in the age of the Internet.",
                    "label": 0
                },
                {
                    "sent": "What's disappeared has been neighbors have shrunk from 13% in the 1980s down to 4% now, and Melissa God Boo Tracy Kenny I coming out with a paper on this, I think we're going to call it.",
                    "label": 0
                },
                {
                    "sent": "Closeness is a many splendored thing.",
                    "label": 0
                },
                {
                    "sent": "Still have a movie submitted yet so we're not sure, but.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To argue that and show the different kinds of people are close for different reasons.",
                    "label": 0
                },
                {
                    "sent": "That the argument by Lynn Smith, Lovin and McPherson, and Matt Breshears.",
                    "label": 0
                },
                {
                    "sent": "Really good scholars that you have to look at only discussing important matters is really 2.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Narrow definition of this.",
                    "label": 0
                },
                {
                    "sent": "I want to skip the stuff, but this is basically saying people have a lot of different ways.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are being close with each other.",
                    "label": 0
                },
                {
                    "sent": "And this is different from the old traditional small groups where it was village based.",
                    "label": 1
                },
                {
                    "sent": "Knowledge came from only within the group.",
                    "label": 1
                },
                {
                    "sent": "That's our logo by the way.",
                    "label": 0
                },
                {
                    "sent": "In the bottom of the slide, am I moving too fast for somebody?",
                    "label": 0
                },
                {
                    "sent": "Anybody think I'm talking too fast?",
                    "label": 0
                },
                {
                    "sent": "Too slow, you want to eat?",
                    "label": 0
                },
                {
                    "sent": "Nice to speed up the beers waiting, OK.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We then moved and this is my own thinking and I have evidence for it to what I think since World War Two, having lived in England, having lived in Netherlands for a year, traveled a bit.",
                    "label": 0
                },
                {
                    "sent": "So what I called localized situation.",
                    "label": 0
                },
                {
                    "sent": "Which is the fact that we still had home bases, typically home Village or town, or neighborhood and workgroup.",
                    "label": 0
                },
                {
                    "sent": "But then we traveled between them.",
                    "label": 0
                },
                {
                    "sent": "The obvious example might be little.",
                    "label": 0
                },
                {
                    "sent": "Last night, maybe we went down the Rhine, but we never connected with anything down the line.",
                    "label": 0
                },
                {
                    "sent": "When you get on an Expressway or a train or a plane, you go from point to point.",
                    "label": 0
                },
                {
                    "sent": "When you have intensive involvement, but unlike the old days when you rode a horse or walk, you don't really deal with anything in between.",
                    "label": 0
                },
                {
                    "sent": "So you still have a group basis and then some connections.",
                    "label": 0
                },
                {
                    "sent": "And of course the old dial-up telephone was like that.",
                    "label": 0
                },
                {
                    "sent": "But now we're into what we call networked individualism where the person is the individual unit.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of interaction.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is said that here we have private concerns are important.",
                    "label": 0
                },
                {
                    "sent": "We have less surveillance in many ways.",
                    "label": 0
                },
                {
                    "sent": "We have surveillance that I really need to update this slide in two ways.",
                    "label": 0
                },
                {
                    "sent": "When we're watching each other on Facebook and we came up with the name covalence for peer to peer surveillance and two as the Chinese government example, sort of implied there is a great deal of corporate and government surveillance of people.",
                    "label": 0
                },
                {
                    "sent": "All Facebook once again being an example of who, what you're doing, who you're doing it with, what's going on.",
                    "label": 0
                },
                {
                    "sent": "So there's the appearance of individual autonomy.",
                    "label": 0
                },
                {
                    "sent": "Within that.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of visibility in some ways, harking back to the old villages where if you snuck out at 2:00 in the morning to have an affair with your neighbors girlfriend.",
                    "label": 0
                },
                {
                    "sent": "It might be pretty visible really quickly.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And this is a different individualistic family model than the 1950s.",
                    "label": 1
                },
                {
                    "sent": "These are American examples.",
                    "label": 0
                },
                {
                    "sent": "I apologize for it, but that was a type family group and in Ozzie and Harriet Radio and then television show and fun with Dick and Jane is white American.",
                    "label": 0
                },
                {
                    "sent": "Every school kid in my agent even later learned how to read.",
                    "label": 0
                },
                {
                    "sent": "Mom stayed home.",
                    "label": 1
                },
                {
                    "sent": "The two kids played only in the neighborhood and Dad went off to work and came back.",
                    "label": 0
                },
                {
                    "sent": "Are there many TV shows like this or Cosby show?",
                    "label": 0
                },
                {
                    "sent": "Actually Mom went out, but we never really sore and this is changed.",
                    "label": 0
                },
                {
                    "sent": "Who has kids here?",
                    "label": 0
                },
                {
                    "sent": "Well, a lot of you.",
                    "label": 0
                },
                {
                    "sent": "What do all your children have cell phones?",
                    "label": 0
                },
                {
                    "sent": "Anybody not give your child a cell phone?",
                    "label": 0
                },
                {
                    "sent": "How come?",
                    "label": 0
                },
                {
                    "sent": "General.",
                    "label": 0
                },
                {
                    "sent": "That's that's not that is not the cause or reason.",
                    "label": 0
                },
                {
                    "sent": "That's a descriptive phenomenon.",
                    "label": 0
                },
                {
                    "sent": "Because the average kid knows how to play Angry Birds at the age of 2 right now.",
                    "label": 0
                },
                {
                    "sent": "So when we did a Canadian study, the mean age was actually 9, but I predict it will go down rapidly even in Europe.",
                    "label": 0
                },
                {
                    "sent": "Kids want it.",
                    "label": 0
                },
                {
                    "sent": "They think it's liberated.",
                    "label": 0
                },
                {
                    "sent": "Those moms who gave your kids cell phones.",
                    "label": 0
                },
                {
                    "sent": "No, it's not liberating.",
                    "label": 0
                },
                {
                    "sent": "It keeps the kid on a leash.",
                    "label": 0
                },
                {
                    "sent": "You know where he or her are at all times.",
                    "label": 0
                },
                {
                    "sent": "Anybody have some examples of that from Europe?",
                    "label": 0
                },
                {
                    "sent": "It's liberating within the boundaries, so it is liberating aspect of it.",
                    "label": 0
                },
                {
                    "sent": "But because the boundaries are both define the tether.",
                    "label": 0
                },
                {
                    "sent": "If you will have a cell phone.",
                    "label": 0
                },
                {
                    "sent": "Yeah, kids can.",
                    "label": 0
                },
                {
                    "sent": "You can call him up and say where?",
                    "label": 0
                },
                {
                    "sent": "Where are you?",
                    "label": 0
                },
                {
                    "sent": "What are you doing now?",
                    "label": 0
                },
                {
                    "sent": "You know?",
                    "label": 0
                },
                {
                    "sent": "Ingenious, I know in Japan you can get phony background noise to put on the floor.",
                    "label": 0
                },
                {
                    "sent": "Stuff like that.",
                    "label": 0
                },
                {
                    "sent": "I mean, so there's an arms race between kids and parents.",
                    "label": 0
                },
                {
                    "sent": "What else is new?",
                    "label": 0
                },
                {
                    "sent": "And we found in Tracy Kennedy I have a paper based on Pew data called network household and so chapter six of the current new book called Network Families, in which there's a lot of communications and husbands and wives or in Canada because we're progressive country husbands and husbands are relating to Ardito wives and wives.",
                    "label": 0
                },
                {
                    "sent": "It's not fancy about it relating to each other all the time using their mobile phone.",
                    "label": 0
                },
                {
                    "sent": "As a way of coordinating so even though they're not staying home as tightly as before, is still is a lot of communication.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the households that can move from being groups to net.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Works.",
                    "label": 0
                },
                {
                    "sent": "And at the same time, the kind of how so this is American data.",
                    "label": 0
                },
                {
                    "sent": "Has changed in that there are fewer households with children.",
                    "label": 0
                },
                {
                    "sent": "There are few American households in more single parent households.",
                    "label": 1
                },
                {
                    "sent": "Canadian data looks the same.",
                    "label": 0
                },
                {
                    "sent": "I have not are we had to do some boundaries in our book for interest, and we therefore used only American and Canadian data.",
                    "label": 0
                },
                {
                    "sent": "I'm not too upset.",
                    "label": 0
                },
                {
                    "sent": "I think many, but not all of the examples will pertain to Europe, Japan, Korea.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Perhaps even parts of India.",
                    "label": 0
                },
                {
                    "sent": "So we know from time use that they keep less time together.",
                    "label": 1
                },
                {
                    "sent": "They keep separate address books.",
                    "label": 1
                },
                {
                    "sent": "All they connect through their mobile's and at the homework boundary.",
                    "label": 0
                },
                {
                    "sent": "Tracy Kennedy died just published the paper.",
                    "label": 0
                },
                {
                    "sent": "It's in a book edited by James Cats on mobile communication.",
                    "label": 1
                },
                {
                    "sent": "There are many kinds of doing work at home.",
                    "label": 0
                },
                {
                    "sent": "First of all, the people who stay at home all the time to work anybody stay home at least three to four days a week to work.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah?",
                    "label": 1
                },
                {
                    "sent": "The real your real smaller but small and and of course when you get the jobs like sales clerk or truck driver, it's really hard to stay home.",
                    "label": 0
                },
                {
                    "sent": "If your truck driving.",
                    "label": 0
                },
                {
                    "sent": "2nd is a people who routinely bring home work.",
                    "label": 0
                },
                {
                    "sent": "Overload work, and I'm not even gonna ask anybody not bring homework in the evening.",
                    "label": 0
                },
                {
                    "sent": "Will you be embarrassed here?",
                    "label": 0
                },
                {
                    "sent": "I TV kind of group and then third or people who do both who moved back and forth a lot.",
                    "label": 0
                },
                {
                    "sent": "I know I had to stay home to get through the bloody book done so the homework boundary which used to be pretty clear.",
                    "label": 0
                },
                {
                    "sent": "You know you go off.",
                    "label": 0
                },
                {
                    "sent": "Come back at 5:00 o'clock and stuff like that we now back to the 19th century when farmers shopkeepers lived over to store or accountants even and doctors doctors used to actually you visit them in their house but they made house calls.",
                    "label": 0
                },
                {
                    "sent": "So we're actually going back to that homework.",
                    "label": 0
                },
                {
                    "sent": "Kind of thing when I have a specialist doctor through problem, I have an I email him and I get to his answer back at midnight.",
                    "label": 0
                },
                {
                    "sent": "Thanks Homie, I hope he's at work.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At home, so we know from time uses Canadian data.",
                    "label": 0
                },
                {
                    "sent": "People are spending less time in person together, but they're spending more time communicating one.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Later another.",
                    "label": 0
                },
                {
                    "sent": "Now the whole notion where the technology is alienating of I mean the Chinese example in Michael.",
                    "label": 0
                },
                {
                    "sent": "Yep, that is very different in Canadian, but there's a big media myth that says people hate the Internet.",
                    "label": 0
                },
                {
                    "sent": "Anybody encounter dead myth in your own reading or stuff like that?",
                    "label": 0
                },
                {
                    "sent": "I'm not making it up.",
                    "label": 0
                },
                {
                    "sent": "Certainly all over North America or The Economist, which is become practically an American magazine.",
                    "label": 0
                },
                {
                    "sent": "So I worked with.",
                    "label": 0
                },
                {
                    "sent": "I did work with survey is across Canada and we found I think the first 2 numbers are interesting and for those of you qualitative analysis I've done the math by 5 to one ratio.",
                    "label": 0
                },
                {
                    "sent": "People feel more connected by technology rather than less.",
                    "label": 1
                },
                {
                    "sent": "This is what the survey tells us.",
                    "label": 0
                },
                {
                    "sent": "However, to me the this the bottom part 51% and 7% off people shrug they say oh we, we don't even think about technology, which basically means mobile in the Internet is just part of their lives.",
                    "label": 1
                },
                {
                    "sent": "So we treat web science is a big deal.",
                    "label": 0
                },
                {
                    "sent": "They think the web is something like the toilet.",
                    "label": 0
                },
                {
                    "sent": "It's just something that's there all the time.",
                    "label": 0
                },
                {
                    "sent": "Similar use.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Similarly news.",
                    "label": 0
                },
                {
                    "sent": "Speak for yourself.",
                    "label": 0
                },
                {
                    "sent": "OK, so we have we have a lot more connectivity and once again.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This isn't just an assertion of American data.",
                    "label": 0
                },
                {
                    "sent": "Once again, you can see that the number of cars off at every household has is going up fair amount.",
                    "label": 0
                },
                {
                    "sent": "We can do a whole speech about American wasting electricity, but I don't want to get there when I want to argue.",
                    "label": 0
                },
                {
                    "sent": "Assert is that there's more individual mobility.",
                    "label": 0
                },
                {
                    "sent": "One car per Apple.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Airlines, many of us came here.",
                    "label": 0
                },
                {
                    "sent": "This was a great trip.",
                    "label": 0
                },
                {
                    "sent": "We didn't have delays.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "When I grew up, people addressing ties and jackets to get on the plane, it was such a big event in 1965 when I took my first trip.",
                    "label": 0
                },
                {
                    "sent": "Now I only dress in the tie in jacket to do keynote speeches.",
                    "label": 0
                },
                {
                    "sent": "You know we're in switch sweats and stuff like that when we fly.",
                    "label": 0
                },
                {
                    "sent": "It's like taking the bus when the train was in the.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More days on.",
                    "label": 0
                },
                {
                    "sent": "And I think I left a slide out.",
                    "label": 0
                },
                {
                    "sent": "What's what may shock you if you read the newspaper?",
                    "label": 0
                },
                {
                    "sent": "There's more peace in the developed world and there has been an age is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, we know about Afghanistan, Iraq, Libya.",
                    "label": 0
                },
                {
                    "sent": "Many other micro wars, but we also know about the Schengen Agreement.",
                    "label": 0
                },
                {
                    "sent": "We know about our free travel, not free, but rather unimpeded travel between North America and Europe and listen to that silly people like George Bush put visa restrictions on so it in so great.",
                    "label": 0
                },
                {
                    "sent": "But still it's pretty easy for all of us to get together places now.",
                    "label": 0
                },
                {
                    "sent": "And the phone exists when my grandmother used the phone, she used to shout down the telephone just to make sure it was heard.",
                    "label": 0
                },
                {
                    "sent": "Now we can get on Skype relatively easily, talk to each other.",
                    "label": 0
                },
                {
                    "sent": "People have called home in the past few days.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so the number of calls is shut up with the money they're making perko.",
                    "label": 0
                },
                {
                    "sent": "It's been a volume versus money making trade off.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we know because I did the data, so I totally trust it all, which with Quan otherwise known as Helen Wayne, just graduated a year ago from.",
                    "label": 0
                },
                {
                    "sent": "However, school in Southern California.",
                    "label": 0
                },
                {
                    "sent": "That when people are saying they have more friends than before to them or use the Internet, the more friendships you have and the Pew Internet and American Life Project www.internet.org just came out with a big study headed by Keith Hampton.",
                    "label": 0
                },
                {
                    "sent": "Came out two days ago and 15, two or three day two days ago showing pretty similar stuff would even more.",
                    "label": 0
                },
                {
                    "sent": "Detail information and Helen and I quietly is Helen Wang.",
                    "label": 0
                },
                {
                    "sent": "Sorry there's a published name in it.",
                    "label": 0
                },
                {
                    "sent": "Informally, we decompose the data and it wasn't just that young folks were coming on.",
                    "label": 0
                },
                {
                    "sent": "It was that people as they grew older, we're using we're developing more fresh.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ships as well as using the Internet more.",
                    "label": 0
                },
                {
                    "sent": "So one thing I'm not going to go into more detail is the voluntary organizations have been supplanted by ad hoc open, informal civic networks.",
                    "label": 1
                },
                {
                    "sent": "As Michael you said in the previous talk, China doesn't allow organized groups.",
                    "label": 0
                },
                {
                    "sent": "Anybody from East Europe here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's actually pretty constricted conference.",
                    "label": 0
                },
                {
                    "sent": "I notice Germany and England.",
                    "label": 0
                },
                {
                    "sent": "Netherlands in America, but in East Europe they actually did allow some organized groups as long as they supported the party up until 1989.",
                    "label": 0
                },
                {
                    "sent": "So my revolutionary friends were in the ecology movement, which suddenly emerged in Bulgarian, even on visit.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is a political organization and something that I I noticed and some of the people in this room could speak to even more often compared to one of the few other times I've been in Germany, I've noticed that there's been more move staffing homogenate nitrogenated.",
                    "label": 0
                },
                {
                    "sent": "Excuse me.",
                    "label": 0
                },
                {
                    "sent": "I'm sure they're real problems here, but you know, I see multi colored people even on the streets in Coblence talking German and that's a big change you guys want to comment down there.",
                    "label": 0
                },
                {
                    "sent": "Anybody here let's that would take too long and US we having a fair percentage of marriages are interracial.",
                    "label": 1
                },
                {
                    "sent": "When I grew up, it was almost unheard of.",
                    "label": 0
                },
                {
                    "sent": "Even going across really.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Edges boundaries were strong this the picture on the left.",
                    "label": 0
                },
                {
                    "sent": "With the world's most gorgeous man of good time Sydney Port EA was a shocking movie in 1967 when in many states in US is still illegal to marry across racial boundaries.",
                    "label": 0
                },
                {
                    "sent": "And he said all the woman I forgot her name even remember her name is an actress.",
                    "label": 0
                },
                {
                    "sent": "She said mom guess who's coming to dinner my my fiance.",
                    "label": 0
                },
                {
                    "sent": "He says doctors surgeon, he's brilliant.",
                    "label": 0
                },
                {
                    "sent": "He went to Harvard, Stanford, Berkeley, Oxford.",
                    "label": 0
                },
                {
                    "sent": "Who knows you gotta love him and then the doorbell rings in.",
                    "label": 0
                },
                {
                    "sent": "This black man walks in and the parents have a nervous breakdown.",
                    "label": 0
                },
                {
                    "sent": "That's the entire movie basically.",
                    "label": 0
                },
                {
                    "sent": "And of course, the punchline is they find it they love men.",
                    "label": 0
                },
                {
                    "sent": "Now we have a company called Harmony which supports the Oxford Internet Institute.",
                    "label": 0
                },
                {
                    "sent": "By the way, showing ads with a guy with a.",
                    "label": 0
                },
                {
                    "sent": "More than a suntan.",
                    "label": 0
                },
                {
                    "sent": "Plug in your very blonde woman and this is a commercial way they want to make money.",
                    "label": 0
                },
                {
                    "sent": "So they're treating.",
                    "label": 0
                },
                {
                    "sent": "This is normal.",
                    "label": 0
                },
                {
                    "sent": "Destiny isn't, you know anybody can do a Brotherhood weekend, but when a company puts it on there.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pretty amazing.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, we have some survey data showing that too, and even religion is changing.",
                    "label": 0
                },
                {
                    "sent": "There's been a rise of different religious groups in North America and Western Europe, and.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some understanded groups have gone away and this was I had to get my my zoom lens on on this one.",
                    "label": 0
                },
                {
                    "sent": "Here is Chelsea Clinton.",
                    "label": 0
                },
                {
                    "sent": "She's the woman.",
                    "label": 0
                },
                {
                    "sent": "Neringa, Diane.",
                    "label": 0
                },
                {
                    "sent": "It was all about housing investment banker, but then I notice the little bump on top of this thing.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it was in the New York Times and that's what injured divisions called the Kepi or Yama 'cause it was an Inter religious marriage which was not really remarked that I didn't see it remarked on anywhere.",
                    "label": 0
                },
                {
                    "sent": "If it was, it was.",
                    "label": 0
                },
                {
                    "sent": "It was very very microphone.",
                    "label": 0
                },
                {
                    "sent": "This is all group nization.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so now we have the Internet revolution giving people a lot of power.",
                    "label": 1
                },
                {
                    "sent": "We all know that I don't have to do that in this group.",
                    "label": 0
                },
                {
                    "sent": "The number of PC's.",
                    "label": 0
                },
                {
                    "sent": "OK, well this is kind of obvious.",
                    "label": 0
                },
                {
                    "sent": "I'm going to move fast.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anybody need to know the Internet gives you a lot of communication.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we take some of the things for granted.",
                    "label": 1
                },
                {
                    "sent": "Well, I did until I had actually 1.8 kilobyte service at the Mercur Hotel last night.",
                    "label": 0
                },
                {
                    "sent": "Instead of watching paint dry, I was watching the screen lines.",
                    "label": 0
                },
                {
                    "sent": "He painted so we have fast bandwidth we can get on anytime I showed up without my laptop and knowing that someone would supply when here complete with viruses out here.",
                    "label": 0
                },
                {
                    "sent": "And we can all get on the same way and almost anywhere in the world.",
                    "label": 0
                },
                {
                    "sent": "North Korea, and maybe Cuba, except it, and it's personalized.",
                    "label": 0
                },
                {
                    "sent": "It's you logging in red.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then the family phone login.",
                    "label": 0
                },
                {
                    "sent": "So we find that the closer people are, the more that they say they close with each other.",
                    "label": 0
                },
                {
                    "sent": "They more of a talk and we find still that telephone is the most voluntary medium you know, except for Robo calls where people are trying to sell you something.",
                    "label": 0
                },
                {
                    "sent": "Telephoning is really where you think about who you calling and why you're calling and being a very close eye matters.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yet, we know that the Internet fosters neighboring change.",
                    "label": 1
                },
                {
                    "sent": "Jacobs, who lived in New York for many years when she wrote Death and life, American cities and then moved up actually to be my neighbor in Toronto.",
                    "label": 0
                },
                {
                    "sent": "Found that eyes on the street keep things going and keep things safe.",
                    "label": 1
                },
                {
                    "sent": "Well in some ways Facebook gives you eyes on the street.",
                    "label": 0
                },
                {
                    "sent": "You know when there's a problem.",
                    "label": 0
                },
                {
                    "sent": "You actually experienced the one where fringes broke up by changing relationship to single.",
                    "label": 0
                },
                {
                    "sent": "Anybody actually experienced there?",
                    "label": 0
                },
                {
                    "sent": "It's one of those urban legend kind of thing.",
                    "label": 1
                },
                {
                    "sent": "I've seen a wedding where the guy.",
                    "label": 0
                },
                {
                    "sent": "Went on Facebook during the ceremony, but that was so famous that it went viral around the world, but we know from my data and we can do other studies that many emails, messages, cell phones or local.",
                    "label": 0
                },
                {
                    "sent": "In fact, among University students, my colleague Rhonda McEwen found the most common message among University students is calling 5 minutes before you get arrive at a place saying I'm almost there, giving it a chance to kind of clean up.",
                    "label": 0
                },
                {
                    "sent": "And then of course you meet face to face and then about 10 minutes after you leave, you called back and said that was wonderful.",
                    "label": 0
                },
                {
                    "sent": "And I also pull it off.",
                    "label": 0
                },
                {
                    "sent": "And then you do some gossip here so it is an interplay between physical locality, physical propinquity and.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm using cell phone and Internet.",
                    "label": 0
                },
                {
                    "sent": "It is somewhat fragmented culture, but I haven't.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good evidence of that, so skip this one.",
                    "label": 0
                },
                {
                    "sent": "OK, so the mobile revolution obviously has allowed ICT's to become appendages.",
                    "label": 1
                },
                {
                    "sent": "Has Europe Gunn's texting?",
                    "label": 0
                },
                {
                    "sent": "I think you're actually went to texting more than America.",
                    "label": 0
                },
                {
                    "sent": "Am I right on that?",
                    "label": 0
                },
                {
                    "sent": "Nobody's phone has Rang during this conference, which is pretty amazing.",
                    "label": 0
                },
                {
                    "sent": "So we're always iaccessible whether we want to or not.",
                    "label": 0
                },
                {
                    "sent": "I like this needs to be studied more about how at least being always on.",
                    "label": 0
                },
                {
                    "sent": "Anybody experienced the fact?",
                    "label": 0
                },
                {
                    "sent": "Why didn't you answer your text message today?",
                    "label": 0
                },
                {
                    "sent": "Because I expected you to?",
                    "label": 0
                },
                {
                    "sent": "And no, I'm at a conference and I'm trying to pay attention.",
                    "label": 0
                },
                {
                    "sent": "Anybody experienced that?",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the only a few.",
                    "label": 0
                },
                {
                    "sent": "Or if you.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Wait a minute.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Lee Rainie, my coauthor, and I we took old movies.",
                    "label": 0
                },
                {
                    "sent": "Some of these may be too old to you once really old movie from the 1600s.",
                    "label": 0
                },
                {
                    "sent": "And we could put that.",
                    "label": 0
                },
                {
                    "sent": "What would happen if mobile phones?",
                    "label": 0
                },
                {
                    "sent": "I won't use the German word handy.",
                    "label": 0
                },
                {
                    "sent": "It sounds too upsetting to North Americans.",
                    "label": 0
                },
                {
                    "sent": "The Rocky Horror Show everybody seen the wrecking you haven't seen the Rocky Horror Show.",
                    "label": 1
                },
                {
                    "sent": "Get some weed.",
                    "label": 0
                },
                {
                    "sent": "Go to Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "The lost and trapped in this haunted house with really interesting people in it.",
                    "label": 0
                },
                {
                    "sent": "Just pull out clone called their parents up and see.",
                    "label": 0
                },
                {
                    "sent": "Send the Mercedes Romeo and Juliet is you know God.",
                    "label": 0
                },
                {
                    "sent": "If they had only been able to call each other.",
                    "label": 0
                },
                {
                    "sent": "There is Eula, I don't know.",
                    "label": 1
                },
                {
                    "sent": "Anybody seen Ferris Bueller here?",
                    "label": 0
                },
                {
                    "sent": "Yeah, great movie.",
                    "label": 0
                },
                {
                    "sent": "Kid takes off from school.",
                    "label": 0
                },
                {
                    "sent": "He's adding touch.",
                    "label": 0
                },
                {
                    "sent": "You know we have to pull.",
                    "label": 0
                },
                {
                    "sent": "This season is battery out.",
                    "label": 0
                },
                {
                    "sent": "He'd be tracked Roman holiday, even greater movie with or to heparin from the 50s.",
                    "label": 0
                },
                {
                    "sent": "She's a Princess one so high message to Garcia.",
                    "label": 1
                },
                {
                    "sent": "Basically a guy has a different message through by hand.",
                    "label": 0
                },
                {
                    "sent": "Instead of sending an attachment.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When is the first American imperialistic wars is worth 1898 Spanish American war, so we're seeing in US.",
                    "label": 0
                },
                {
                    "sent": "I'll landline to going down mobile is going up.",
                    "label": 0
                },
                {
                    "sent": "How many people here do not have a landline at their home?",
                    "label": 0
                },
                {
                    "sent": "Tell me about 10 to 15% in America of course is very much age related.",
                    "label": 0
                },
                {
                    "sent": "The younger you are, the less likely you have in landline and this makes real problems for survey data because there are no published directory.",
                    "label": 0
                },
                {
                    "sent": "Is a landline of mobile phone people and they're very expensive to contact with random digit dialing.",
                    "label": 0
                },
                {
                    "sent": "Center for Disease Control's, which is doing a lot of epidemiological studies.",
                    "label": 0
                },
                {
                    "sent": "Is 1, but is it speaking?",
                    "label": 0
                },
                {
                    "sent": "Rapid etiology?",
                    "label": 0
                },
                {
                    "sent": "Do we know it's bean sprouts?",
                    "label": 0
                },
                {
                    "sent": "Who said no?",
                    "label": 0
                },
                {
                    "sent": "Tested it.",
                    "label": 0
                },
                {
                    "sent": "Borderline.",
                    "label": 0
                },
                {
                    "sent": "Oh my God, I'm dead.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But still people watching television.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Stuff like that, um, work Cortana.",
                    "label": 0
                },
                {
                    "sent": "Be, as I said, has many of us are working in network teams of across everywhere.",
                    "label": 0
                },
                {
                    "sent": "Distributed word stuff is coming in.",
                    "label": 0
                },
                {
                    "sent": "Sometimes it worked.",
                    "label": 0
                },
                {
                    "sent": "I flew a Boeing 777 which was designed.",
                    "label": 0
                },
                {
                    "sent": "It is distributed, wait anybody fly a Boeing 787 year because it hasn't taken off yet in a safe manner.",
                    "label": 0
                },
                {
                    "sent": "They built it in a distributed way.",
                    "label": 0
                },
                {
                    "sent": "An parts just don't fit together tremendously.",
                    "label": 0
                },
                {
                    "sent": "Well, and it's I think about four years behind schedules.",
                    "label": 0
                },
                {
                    "sent": "Many of us work flexible schedules, so who is it?",
                    "label": 1
                },
                {
                    "sent": "Oh, I.",
                    "label": 1
                },
                {
                    "sent": "You know, never call Bernie Hogan before 10 in the morning, right?",
                    "label": 0
                },
                {
                    "sent": "Or you expect a response with the kind of jobs.",
                    "label": 0
                },
                {
                    "sent": "Certainly knowledge workers, especially we don't have to necessarily show up nine to five and less.",
                    "label": 0
                },
                {
                    "sent": "We live and work in Singapore where it's pretty obligatory.",
                    "label": 0
                },
                {
                    "sent": "Even crafted Dennis.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We're moving to use is phrase, and then Richard Florida's picked it up from being Adam workers in which we manipulate things to being bit workers, which is what you roll manipulating on the computer.",
                    "label": 0
                },
                {
                    "sent": "All the letter you would Adam consumers last night by terms of your.",
                    "label": 0
                },
                {
                    "sent": "Tony",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, an all this picture will be in the booking little Honda Good Canadian name.",
                    "label": 0
                },
                {
                    "sent": "She lives in Toronto at least Indian background.",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, we posted a little bit, but she had all that stuff out at a local cafe and I just put some labels on there and.",
                    "label": 0
                },
                {
                    "sent": "I don't think she missed anything.",
                    "label": 0
                },
                {
                    "sent": "And she was working at that time for those in Canadians who was working for see TV.",
                    "label": 0
                },
                {
                    "sent": "Now she works for another media company.",
                    "label": 0
                },
                {
                    "sent": "I love the fact that unlike most other people her age, she actually had a real watch out and certainly lower left hand boundary over just like.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm starting to sum up those you're watching your your time off.",
                    "label": 0
                },
                {
                    "sent": "We have a triple revolution going on the move to networks individuals and not in groups.",
                    "label": 1
                },
                {
                    "sent": "Turns out a social networks are larger.",
                    "label": 1
                },
                {
                    "sent": "Dunbars number it doesn't make sense.",
                    "label": 0
                },
                {
                    "sent": "I provide evidence in the book that.",
                    "label": 0
                },
                {
                    "sent": "The magic number is about 600 and change of the number of average number of real people we know, not Facebook friends.",
                    "label": 0
                },
                {
                    "sent": "We've never heard of in contact and up.",
                    "label": 0
                },
                {
                    "sent": "Tweaks that we've never heard of off this in a number of studies in a number of places is a robust regression coefficient of more infinities.",
                    "label": 1
                },
                {
                    "sent": "Is untyped, is associated with more in person contact.",
                    "label": 1
                },
                {
                    "sent": "There's more moves back to the 1800s where people work at home, and they work with the weight is a lot of part time working at home.",
                    "label": 0
                },
                {
                    "sent": "Of course I see teams are giving us a lot more information and more diverse information.",
                    "label": 0
                },
                {
                    "sent": "And something that my colleague Juan Carrasco, now in Concepcion Chile, did for his PhD thesis is transportation is both fungible, replaceable with communication.",
                    "label": 0
                },
                {
                    "sent": "But if that were so, all none of us would be sitting here.",
                    "label": 0
                },
                {
                    "sent": "We'd be only online, and so we find out that it actually is additive, with people with ICT's information and communication technology, the more people see each other as here.",
                    "label": 0
                },
                {
                    "sent": "Then the more that they can communicate with each other all through the Internet or mobile phones.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here I had the sense I just wrote these last night, so please forgive me.",
                    "label": 0
                },
                {
                    "sent": "I put I clearly couldn't download a lot of URLs.",
                    "label": 0
                },
                {
                    "sent": "Mercury was so bad, but if you want to develop this if you're moving from the computer science world onto the social science world, these are some leads I think you might want the international network for social network analysis.",
                    "label": 1
                },
                {
                    "sent": "I founded in 1976 and that's about 1300 members and that's its website and it has a really good listserv called sakhmet.",
                    "label": 1
                },
                {
                    "sent": "SOCNET you can get on through the website next conferences Los Angeles March on.",
                    "label": 0
                },
                {
                    "sent": "2012 and then in 2013 there will be 2 conferences.",
                    "label": 0
                },
                {
                    "sent": "Of one will be up North in Germany and Hamburg.",
                    "label": 0
                },
                {
                    "sent": "Who's organizing that I forget?",
                    "label": 0
                },
                {
                    "sent": "Latina hosting is organizing in Hamburg and colleagues and then another one will be in China.",
                    "label": 0
                },
                {
                    "sent": "GNX IAF of both the new bout this time of year.",
                    "label": 0
                },
                {
                    "sent": "The energy is organizing that none involved with that.",
                    "label": 0
                },
                {
                    "sent": "Secondly, as Eva Kahan will tell 'cause she found out about this conference is a really nice.",
                    "label": 0
                },
                {
                    "sent": "Lists are from the communication Information Technology section of American Sociology, Association of all weird places for left wing, sociologists to meet.",
                    "label": 0
                },
                {
                    "sent": "We're in Las Vegas in this August, where it will be about 50 degrees per.",
                    "label": 0
                },
                {
                    "sent": "That's Celsius few Americans.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "But we're at Caesar's Palace.",
                    "label": 0
                },
                {
                    "sent": "And the room price is only $120.00 a night, which is a bargain.",
                    "label": 0
                },
                {
                    "sent": "You want to see Las Vegas, which is amazing cultural phenomenon.",
                    "label": 0
                },
                {
                    "sent": "Nice thing about Las Vegas, you know if they see Europe because his hotel.",
                    "label": 0
                },
                {
                    "sent": "International Communications Association.",
                    "label": 0
                },
                {
                    "sent": "We just met.",
                    "label": 0
                },
                {
                    "sent": "I think it's wonderful even though I'm a sociologist, I know Peter Mungia, general folk.",
                    "label": 0
                },
                {
                    "sent": "Were there Nash contractor?",
                    "label": 0
                },
                {
                    "sent": "Was there anybody else to DIC in?",
                    "label": 0
                },
                {
                    "sent": "Couple of people Brian Keegan was there.",
                    "label": 0
                },
                {
                    "sent": "Next meeting is in Phoenix in May 2012.",
                    "label": 0
                },
                {
                    "sent": "I believe it's may it will be awfully hot here too.",
                    "label": 1
                },
                {
                    "sent": "And Phoenix, unlike Las Vegas, has nothing to it other than suburbia.",
                    "label": 0
                },
                {
                    "sent": "So you be forced to do the conference.",
                    "label": 0
                },
                {
                    "sent": "The Information Society people.",
                    "label": 0
                },
                {
                    "sent": "I really don't know much about when or where they meet anybody contribute today.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can look him up and as I said, the books coming out in January 2012.",
                    "label": 0
                },
                {
                    "sent": "Those are the chapters in the book.",
                    "label": 0
                },
                {
                    "sent": "There's my coauthor like me you had here when you started.",
                    "label": 0
                },
                {
                    "sent": "And we've had a lot of fun doing it, and I've really learned a lot from coming here.",
                    "label": 0
                },
                {
                    "sent": "So Many thanks to all of you, goodbye.",
                    "label": 0
                }
            ]
        }
    }
}