{
    "id": "qzzvw4i26qys2pe4ibhzc7wwkri4yt6u",
    "title": "Psychological Advertising: Exploring Consumer Psychology for Click Prediction in Sponsored Search",
    "info": {
        "author": [
            "Jiang Bian, Microsoft Research Asia, Microsoft Research"
        ],
        "published": "Sept. 27, 2013",
        "recorded": "August 2013",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2013_bian_click_prediction/",
    "segmentation": [
        [
            "Good morning everyone and thanks for attending this talk today.",
            "I'm going to talk about our work on psychological advertising, especially on how to explore users psychology for click prediction in sponsor search.",
            "This is a joint work with Typhoon and Italian from Microsoft Research and another two interns shoes and an."
        ],
        [
            "So as you know, the sponsor search has become one of the most important business model for the commercial search engine.",
            "It generates most of the revenues for for the search engines, so sponsor search present both the spa."
        ],
        [
            "The search result, along with the story along with organic search results.",
            "And then to deliver the most interesting ads to users.",
            "A sponsor."
        ],
        [
            "Our system consists of several important."
        ],
        [
            "Hence, such as the keyword selection or Edward selection by Match Tap and among them click prediction."
        ],
        [
            "Is SN very essential part in general in general, so click prediction can be used."
        ],
        [
            "Or as filtering, ranking, allocation and pricing."
        ],
        [
            "So the states half the state of the art click prediction model employed.",
            "The machine learning approach basically."
        ],
        [
            "They use two kind of features.",
            "The first one is the relevance features such as the similarity between the query and as or the quality of the S. And this kind of features generally reflect what relevant content users seek to click, and another important features is the His."
        ],
        [
            "Oracle click features.",
            "This feature generally reflect how users click."
        ],
        [
            "But our work want to switch the point of view to why users click.",
            "To answer this questions, we first contact several data analysis."
        ],
        [
            "So in this figure we can find."
        ],
        [
            "For the query of online education and the Bing search serves several sponsored search results and we can find that these three as you do very similar relevant score.",
            "Here we use BM 25 but they have quite different Cdr and this case is very common."
        ],
        [
            "In the Bing search."
        ],
        [
            "And so, based on this common cases, we can find that it may not be reasonable to directly using relevant score to print to predict the clicks.",
            "And our data analysis showed that UC F BM25 is just a .55, which means it's quite close to random gas.",
            "And."
        ],
        [
            "Our explanation is in two fold.",
            "First we consider many as is specially for those popular queries.",
            "You do very similar relevance and cannot be well distinguished by their relevance score and the other fold users came to the search engine for some relevance information but not further as so.",
            "They do not necessarily click on the relevant cells.",
            "And some other data analysis shows that when facing the same query at pair who."
        ],
        [
            "Overall historical click are given and fixed.",
            "Different users could still demonstrate very different click behaviors, for example, from this figures we show two as example.",
            "The figure under the as show the percentage of users of different city or range, so we can find that some users may very high city are like 20% of users while about 80% users use very low CR."
        ],
        [
            "And so we consider that the historical click counts which reflect the meaning of their this city.",
            "Ours will lead to a significant prediction error, which corresponds to the variance of this city hours."
        ],
        [
            "So our explanation to that is also in two folds.",
            "First we consider other users click behaviors.",
            "Highly diverse and.",
            "And they are not identical, so different users may have a different very different click behaviors and the second vote we consider one person may not necessarily click on add if many other peoples click on it."
        ],
        [
            "So this analysis simply tell us that both relevance and historical clicks cannot answer the questions regarding why people click less, So what else we should use.",
            "Our proposal is to leverage the study on users behaviors in the literature of economics and vertising.",
            "In particularly, we propose using the psychological needs of users, inspired by the fact that psychological factor is one of the central design principles in the advertising industry."
        ],
        [
            "So in the following of this talk, I will first give some data analysis on user psychological desire an followed by our proposal to discover user psychological desire from S, and we will also introduce how to use this kind of psychological desire into the click prediction model."
        ],
        [
            "So.",
            "In sponsor search, once the user clicked the as the natural glow of him would be conversion.",
            "So to predict users click behavior on S it is necessary to investigate what people will consider during their consuming behaviors.",
            "So according to the classic study consumer behavior, the process of making consumption into.",
            "The four stages.",
            "So the 1st first 2 state stages problem recognition an information search.",
            "So using based on these two stages users may find some candidate information an.",
            "Then the decision decision-making is affected by three general effects, including the context or effects.",
            "The sort based factors, and feeling based factors.",
            "So the sort base sort based factors such as pricing, discount or deliver time limitation more.",
            "Comfort a fireball.",
            "And while the feeling bass effect such as the brand preference or trust versie.",
            "More related to subjective so."
        ],
        [
            "So.",
            "So among these three types types of effects, we consider the sort based and filling based effects play as the more critical factor in decision-making and form up consumers psychological desires.",
            "So this."
        ],
        [
            "Table we show some example of users desires and are thought basean feeling based effects which are extracted from the real S by the human experts.",
            "So from this paper this table we can find that advertisers do put specific textual content in as tax to target user psychological desires."
        ],
        [
            "So here we show some specific example.",
            "Here we show three queries and we demonstrate three as correspondingly, and we can find that.",
            "For example, for the query, like if we.",
            "Even the ass contains some specific tax patterns such as free or Cooper.",
            "City are will be quite different with other as without this text pattern.",
            "Also like the perfume if we use the official site in this text it will raise the city of this as significantly."
        ],
        [
            "So we consider the as we saw mix explicit patterns can rise peoples certain desire to interact."
        ],
        [
            "So to investigate if this texture patterns will affect the user clicks, we also do some data analysis on kind of aggregate levels.",
            "So here we show the city are difference between the ads, which is which is man which are matched with some user desired patterns compared with the overall S. And this table shows that if we use some desired patterns like coupon or official.",
            "And it will give us to a big city are change compared to the overall US.",
            "And the following figures also show that this this kind of desired patterns may cause the different city or distribute distribution compared to the overall distribution."
        ],
        [
            "And then I will talk about how we discover user psychological desire from S."
        ],
        [
            "So we follow 5 principles.",
            "The first one we consider at context at content contains 2 a major part.",
            "The first one is talk about the relevance between the ad and query and the second one.",
            "Which target the user desire.",
            "The second principle is the psychological desire should reflect users.",
            "Did dairy in terms of city or difference.",
            "It is based on our data analysis before.",
            "So the third principle is this psychological desire patterns should catch in enough volume coverage so it can have the benefit to the search engine.",
            "And the next two principle is this psychological desire should should be generalized into desired patterns.",
            "So similar content can reflect the specifics in desire.",
            "And last we consider.",
            "The content from experience advertisers should be more important to help us catch the psychological desire."
        ],
        [
            "So here we have several steps to discover the user psychological desire.",
            "First, given copies of as we first clean up the content for relevance, which means.",
            "We filter those words from that at as tax, which is similar to the query.",
            "And then we tokenize them into several engrams."
        ],
        [
            "Then we feel refining those engrams with high frequency, an insignificant city oil change and this step covered the principle principle to answer."
        ],
        [
            "After that we try to cover the principle four to generalize the generalized psychological desire pattern, and we employ the clustering methods to cluster those engrams into several groups, and for each groups we employ the human experts to give the label of of this kind of design patterns.",
            "And also during this classroom.",
            "We in order to emphasize the experience, advertisers we give more weight to the engrams from the experience advertiser.",
            "During the class ring.",
            "So after that, in order to use such psychological desire in the click prediction more effectively."
        ],
        [
            "And also to reduce the sparsity we organize such desire patterns into a hierarchical.",
            "Structure and here we also employ a classic principle in cycle logic which is a Maslow hierarchy."
        ],
        [
            "So in particular, Maslow hierarchy is.",
            "Describe the humans needs as 5 levels.",
            "So we can directly map this hierarchy."
        ],
        [
            "Into the context of consumers psychological categories.",
            "So from this this figure we kind of find that.",
            "The lower level represents more basic user psychological desire, while while the upper levels represent some advanced desires."
        ],
        [
            "And we also consider that.",
            "People in different situations may belong to different psychological categories, so this motivates us to model users in terms of psychological desires.",
            "So how to?"
        ],
        [
            "How to organize such our psychological design patterns into the muscle?",
            "Chris, here we use active psychological needs.",
            "Mining method which."
        ],
        [
            "Means we first select some candidate patterns and based on uncertainty based active learning, we will find those candidates with most uncertainty and then we employ human labeling to give the better label of these patterns.",
            "Then we employ a label propagation message to propagate the labels into other patterns.",
            "Then we take the iterations of that.",
            "So after some patterns whose pseudo labels are certain enough, we will extract them and store them in a pattern database."
        ],
        [
            "So here we show some specific example of desire patterns we collect for each category of the hierarchy."
        ],
        [
            "So after that we will study how to use that to benefit the."
        ],
        [
            "Prediction in general.",
            "The correct prediction you."
        ],
        [
            "Is the maximum entropy model which is well studied since its strength in combining diverse forms of features.",
            "And."
        ],
        [
            "Maximum entropy model also learns the weight vector by maximizing the likelihood X exponential models, so I will not talk much about that."
        ],
        [
            "So to integrate our psychological desire into click prediction."
        ],
        [
            "We first we first use our desired patterns to model the.",
            "To to model the ad features so specifically for each ad we can.",
            "Describe it into desired space using a binary feature vector and we can also describe as in the desired category, feature desired category space.",
            "Also use the binary feature."
        ],
        [
            "And after that, how to model the users?",
            "So here we use the historical click.",
            "Historical historical clickthrough locks to model the users, especially.",
            "For each users we can also model them into both desire space and desire category space.",
            "For desire space we use the city are of this users on the S with a certain pattern to model each dimension of the desired space and we can use the similar methods to model the users psychological features in the desired category space."
        ],
        [
            "So after that we can also use some simple similarity function to model the.",
            "The similarity between the users and Anas.",
            "Here we also model them in both the desire space and the desire category space."
        ],
        [
            "So let's move to the experimental evaluations."
        ],
        [
            "So here we use data set from Bing search logs and we compare several methods.",
            "Here we use the.",
            "The model with historical click features only as the baseline, and we compare five other models first wise use both the relevance and historical features and the second one use the historical click features plus the desired pattern features, while the third one used the historical click features plus both desired patterns, features and desire category features.",
            "The last two methods use both the relevant features and historical features, plus our desired pattern features."
        ],
        [
            "So we use the relative information gain an as one of the evaluation metrics.",
            "Also, we use the simulate simulators clickthrough rate as another evaluation metrics."
        ],
        [
            "So from this figure we can find that."
        ],
        [
            "When we use the user desired features both either the desired pattern features or did their desired category features and they can give rise to significant improvement on the click prediction."
        ],
        [
            "Also, we find that if we use the desired category features, it can give more benefits to the click prediction.",
            "We consider.",
            "The reason is that this category features can help to reduce the sparsity of the desired features for individual S."
        ],
        [
            "So Furthermore, we take experiments on the impacts of.",
            "Our desired patterns.",
            "Features for both the rich and rare pass.",
            "For the ask with a rich history set.",
            "We can find find that the relevance features may not may not give much benefit.",
            "We can see that there are.",
            "The reason is that advertisers may adjust the attacks so it is beneficial to obviously leverage updated design patterns for click prediction.",
            "And.",
            "For the rare history, we find that the click prediction is mainly based on.",
            "We find that the relevance features may not indicate the user's potential for consuming.",
            "And we also find that.",
            "For both the rich and the right history, if we use the desired pattern features, it can give a similar performance.",
            "So which means our desired pattern features are more robust to both the rich and rare history as.",
            "So as a summary."
        ],
        [
            "Talk.",
            "Try to answer the question is why user click the S and we connect the user click Click Connect, click prediction with user behavior analysis and this.",
            "Artists work embrace user psychological desires at click prediction.",
            "And our future work includes.",
            "Exploring Contacts aware user psychological desire and to design structured user design.",
            "Also, we hope to explore how to use the temporal psychological desire.",
            "So."
        ],
        [
            "That is, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning everyone and thanks for attending this talk today.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about our work on psychological advertising, especially on how to explore users psychology for click prediction in sponsor search.",
                    "label": 1
                },
                {
                    "sent": "This is a joint work with Typhoon and Italian from Microsoft Research and another two interns shoes and an.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as you know, the sponsor search has become one of the most important business model for the commercial search engine.",
                    "label": 0
                },
                {
                    "sent": "It generates most of the revenues for for the search engines, so sponsor search present both the spa.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The search result, along with the story along with organic search results.",
                    "label": 1
                },
                {
                    "sent": "And then to deliver the most interesting ads to users.",
                    "label": 0
                },
                {
                    "sent": "A sponsor.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our system consists of several important.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hence, such as the keyword selection or Edward selection by Match Tap and among them click prediction.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is SN very essential part in general in general, so click prediction can be used.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or as filtering, ranking, allocation and pricing.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the states half the state of the art click prediction model employed.",
                    "label": 0
                },
                {
                    "sent": "The machine learning approach basically.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They use two kind of features.",
                    "label": 0
                },
                {
                    "sent": "The first one is the relevance features such as the similarity between the query and as or the quality of the S. And this kind of features generally reflect what relevant content users seek to click, and another important features is the His.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oracle click features.",
                    "label": 0
                },
                {
                    "sent": "This feature generally reflect how users click.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But our work want to switch the point of view to why users click.",
                    "label": 0
                },
                {
                    "sent": "To answer this questions, we first contact several data analysis.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this figure we can find.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the query of online education and the Bing search serves several sponsored search results and we can find that these three as you do very similar relevant score.",
                    "label": 0
                },
                {
                    "sent": "Here we use BM 25 but they have quite different Cdr and this case is very common.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the Bing search.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so, based on this common cases, we can find that it may not be reasonable to directly using relevant score to print to predict the clicks.",
                    "label": 1
                },
                {
                    "sent": "And our data analysis showed that UC F BM25 is just a .55, which means it's quite close to random gas.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our explanation is in two fold.",
                    "label": 0
                },
                {
                    "sent": "First we consider many as is specially for those popular queries.",
                    "label": 0
                },
                {
                    "sent": "You do very similar relevance and cannot be well distinguished by their relevance score and the other fold users came to the search engine for some relevance information but not further as so.",
                    "label": 1
                },
                {
                    "sent": "They do not necessarily click on the relevant cells.",
                    "label": 0
                },
                {
                    "sent": "And some other data analysis shows that when facing the same query at pair who.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Overall historical click are given and fixed.",
                    "label": 0
                },
                {
                    "sent": "Different users could still demonstrate very different click behaviors, for example, from this figures we show two as example.",
                    "label": 0
                },
                {
                    "sent": "The figure under the as show the percentage of users of different city or range, so we can find that some users may very high city are like 20% of users while about 80% users use very low CR.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we consider that the historical click counts which reflect the meaning of their this city.",
                    "label": 0
                },
                {
                    "sent": "Ours will lead to a significant prediction error, which corresponds to the variance of this city hours.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our explanation to that is also in two folds.",
                    "label": 0
                },
                {
                    "sent": "First we consider other users click behaviors.",
                    "label": 0
                },
                {
                    "sent": "Highly diverse and.",
                    "label": 0
                },
                {
                    "sent": "And they are not identical, so different users may have a different very different click behaviors and the second vote we consider one person may not necessarily click on add if many other peoples click on it.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this analysis simply tell us that both relevance and historical clicks cannot answer the questions regarding why people click less, So what else we should use.",
                    "label": 0
                },
                {
                    "sent": "Our proposal is to leverage the study on users behaviors in the literature of economics and vertising.",
                    "label": 1
                },
                {
                    "sent": "In particularly, we propose using the psychological needs of users, inspired by the fact that psychological factor is one of the central design principles in the advertising industry.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the following of this talk, I will first give some data analysis on user psychological desire an followed by our proposal to discover user psychological desire from S, and we will also introduce how to use this kind of psychological desire into the click prediction model.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In sponsor search, once the user clicked the as the natural glow of him would be conversion.",
                    "label": 0
                },
                {
                    "sent": "So to predict users click behavior on S it is necessary to investigate what people will consider during their consuming behaviors.",
                    "label": 0
                },
                {
                    "sent": "So according to the classic study consumer behavior, the process of making consumption into.",
                    "label": 1
                },
                {
                    "sent": "The four stages.",
                    "label": 0
                },
                {
                    "sent": "So the 1st first 2 state stages problem recognition an information search.",
                    "label": 1
                },
                {
                    "sent": "So using based on these two stages users may find some candidate information an.",
                    "label": 0
                },
                {
                    "sent": "Then the decision decision-making is affected by three general effects, including the context or effects.",
                    "label": 0
                },
                {
                    "sent": "The sort based factors, and feeling based factors.",
                    "label": 0
                },
                {
                    "sent": "So the sort base sort based factors such as pricing, discount or deliver time limitation more.",
                    "label": 0
                },
                {
                    "sent": "Comfort a fireball.",
                    "label": 0
                },
                {
                    "sent": "And while the feeling bass effect such as the brand preference or trust versie.",
                    "label": 0
                },
                {
                    "sent": "More related to subjective so.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So among these three types types of effects, we consider the sort based and filling based effects play as the more critical factor in decision-making and form up consumers psychological desires.",
                    "label": 0
                },
                {
                    "sent": "So this.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Table we show some example of users desires and are thought basean feeling based effects which are extracted from the real S by the human experts.",
                    "label": 0
                },
                {
                    "sent": "So from this paper this table we can find that advertisers do put specific textual content in as tax to target user psychological desires.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here we show some specific example.",
                    "label": 0
                },
                {
                    "sent": "Here we show three queries and we demonstrate three as correspondingly, and we can find that.",
                    "label": 0
                },
                {
                    "sent": "For example, for the query, like if we.",
                    "label": 0
                },
                {
                    "sent": "Even the ass contains some specific tax patterns such as free or Cooper.",
                    "label": 0
                },
                {
                    "sent": "City are will be quite different with other as without this text pattern.",
                    "label": 0
                },
                {
                    "sent": "Also like the perfume if we use the official site in this text it will raise the city of this as significantly.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we consider the as we saw mix explicit patterns can rise peoples certain desire to interact.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to investigate if this texture patterns will affect the user clicks, we also do some data analysis on kind of aggregate levels.",
                    "label": 0
                },
                {
                    "sent": "So here we show the city are difference between the ads, which is which is man which are matched with some user desired patterns compared with the overall S. And this table shows that if we use some desired patterns like coupon or official.",
                    "label": 1
                },
                {
                    "sent": "And it will give us to a big city are change compared to the overall US.",
                    "label": 0
                },
                {
                    "sent": "And the following figures also show that this this kind of desired patterns may cause the different city or distribute distribution compared to the overall distribution.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then I will talk about how we discover user psychological desire from S.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we follow 5 principles.",
                    "label": 0
                },
                {
                    "sent": "The first one we consider at context at content contains 2 a major part.",
                    "label": 0
                },
                {
                    "sent": "The first one is talk about the relevance between the ad and query and the second one.",
                    "label": 0
                },
                {
                    "sent": "Which target the user desire.",
                    "label": 1
                },
                {
                    "sent": "The second principle is the psychological desire should reflect users.",
                    "label": 0
                },
                {
                    "sent": "Did dairy in terms of city or difference.",
                    "label": 1
                },
                {
                    "sent": "It is based on our data analysis before.",
                    "label": 0
                },
                {
                    "sent": "So the third principle is this psychological desire patterns should catch in enough volume coverage so it can have the benefit to the search engine.",
                    "label": 1
                },
                {
                    "sent": "And the next two principle is this psychological desire should should be generalized into desired patterns.",
                    "label": 0
                },
                {
                    "sent": "So similar content can reflect the specifics in desire.",
                    "label": 0
                },
                {
                    "sent": "And last we consider.",
                    "label": 0
                },
                {
                    "sent": "The content from experience advertisers should be more important to help us catch the psychological desire.",
                    "label": 1
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we have several steps to discover the user psychological desire.",
                    "label": 1
                },
                {
                    "sent": "First, given copies of as we first clean up the content for relevance, which means.",
                    "label": 0
                },
                {
                    "sent": "We filter those words from that at as tax, which is similar to the query.",
                    "label": 0
                },
                {
                    "sent": "And then we tokenize them into several engrams.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we feel refining those engrams with high frequency, an insignificant city oil change and this step covered the principle principle to answer.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After that we try to cover the principle four to generalize the generalized psychological desire pattern, and we employ the clustering methods to cluster those engrams into several groups, and for each groups we employ the human experts to give the label of of this kind of design patterns.",
                    "label": 0
                },
                {
                    "sent": "And also during this classroom.",
                    "label": 0
                },
                {
                    "sent": "We in order to emphasize the experience, advertisers we give more weight to the engrams from the experience advertiser.",
                    "label": 0
                },
                {
                    "sent": "During the class ring.",
                    "label": 0
                },
                {
                    "sent": "So after that, in order to use such psychological desire in the click prediction more effectively.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And also to reduce the sparsity we organize such desire patterns into a hierarchical.",
                    "label": 0
                },
                {
                    "sent": "Structure and here we also employ a classic principle in cycle logic which is a Maslow hierarchy.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in particular, Maslow hierarchy is.",
                    "label": 0
                },
                {
                    "sent": "Describe the humans needs as 5 levels.",
                    "label": 0
                },
                {
                    "sent": "So we can directly map this hierarchy.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Into the context of consumers psychological categories.",
                    "label": 0
                },
                {
                    "sent": "So from this this figure we kind of find that.",
                    "label": 0
                },
                {
                    "sent": "The lower level represents more basic user psychological desire, while while the upper levels represent some advanced desires.",
                    "label": 1
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we also consider that.",
                    "label": 0
                },
                {
                    "sent": "People in different situations may belong to different psychological categories, so this motivates us to model users in terms of psychological desires.",
                    "label": 0
                },
                {
                    "sent": "So how to?",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How to organize such our psychological design patterns into the muscle?",
                    "label": 0
                },
                {
                    "sent": "Chris, here we use active psychological needs.",
                    "label": 0
                },
                {
                    "sent": "Mining method which.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Means we first select some candidate patterns and based on uncertainty based active learning, we will find those candidates with most uncertainty and then we employ human labeling to give the better label of these patterns.",
                    "label": 0
                },
                {
                    "sent": "Then we employ a label propagation message to propagate the labels into other patterns.",
                    "label": 0
                },
                {
                    "sent": "Then we take the iterations of that.",
                    "label": 0
                },
                {
                    "sent": "So after some patterns whose pseudo labels are certain enough, we will extract them and store them in a pattern database.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here we show some specific example of desire patterns we collect for each category of the hierarchy.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So after that we will study how to use that to benefit the.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Prediction in general.",
                    "label": 0
                },
                {
                    "sent": "The correct prediction you.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is the maximum entropy model which is well studied since its strength in combining diverse forms of features.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maximum entropy model also learns the weight vector by maximizing the likelihood X exponential models, so I will not talk much about that.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to integrate our psychological desire into click prediction.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We first we first use our desired patterns to model the.",
                    "label": 0
                },
                {
                    "sent": "To to model the ad features so specifically for each ad we can.",
                    "label": 0
                },
                {
                    "sent": "Describe it into desired space using a binary feature vector and we can also describe as in the desired category, feature desired category space.",
                    "label": 0
                },
                {
                    "sent": "Also use the binary feature.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And after that, how to model the users?",
                    "label": 0
                },
                {
                    "sent": "So here we use the historical click.",
                    "label": 0
                },
                {
                    "sent": "Historical historical clickthrough locks to model the users, especially.",
                    "label": 0
                },
                {
                    "sent": "For each users we can also model them into both desire space and desire category space.",
                    "label": 1
                },
                {
                    "sent": "For desire space we use the city are of this users on the S with a certain pattern to model each dimension of the desired space and we can use the similar methods to model the users psychological features in the desired category space.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So after that we can also use some simple similarity function to model the.",
                    "label": 0
                },
                {
                    "sent": "The similarity between the users and Anas.",
                    "label": 0
                },
                {
                    "sent": "Here we also model them in both the desire space and the desire category space.",
                    "label": 1
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's move to the experimental evaluations.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here we use data set from Bing search logs and we compare several methods.",
                    "label": 0
                },
                {
                    "sent": "Here we use the.",
                    "label": 0
                },
                {
                    "sent": "The model with historical click features only as the baseline, and we compare five other models first wise use both the relevance and historical features and the second one use the historical click features plus the desired pattern features, while the third one used the historical click features plus both desired patterns, features and desire category features.",
                    "label": 0
                },
                {
                    "sent": "The last two methods use both the relevant features and historical features, plus our desired pattern features.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we use the relative information gain an as one of the evaluation metrics.",
                    "label": 0
                },
                {
                    "sent": "Also, we use the simulate simulators clickthrough rate as another evaluation metrics.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So from this figure we can find that.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we use the user desired features both either the desired pattern features or did their desired category features and they can give rise to significant improvement on the click prediction.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also, we find that if we use the desired category features, it can give more benefits to the click prediction.",
                    "label": 0
                },
                {
                    "sent": "We consider.",
                    "label": 0
                },
                {
                    "sent": "The reason is that this category features can help to reduce the sparsity of the desired features for individual S.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Furthermore, we take experiments on the impacts of.",
                    "label": 0
                },
                {
                    "sent": "Our desired patterns.",
                    "label": 0
                },
                {
                    "sent": "Features for both the rich and rare pass.",
                    "label": 1
                },
                {
                    "sent": "For the ask with a rich history set.",
                    "label": 0
                },
                {
                    "sent": "We can find find that the relevance features may not may not give much benefit.",
                    "label": 0
                },
                {
                    "sent": "We can see that there are.",
                    "label": 0
                },
                {
                    "sent": "The reason is that advertisers may adjust the attacks so it is beneficial to obviously leverage updated design patterns for click prediction.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "For the rare history, we find that the click prediction is mainly based on.",
                    "label": 0
                },
                {
                    "sent": "We find that the relevance features may not indicate the user's potential for consuming.",
                    "label": 0
                },
                {
                    "sent": "And we also find that.",
                    "label": 0
                },
                {
                    "sent": "For both the rich and the right history, if we use the desired pattern features, it can give a similar performance.",
                    "label": 1
                },
                {
                    "sent": "So which means our desired pattern features are more robust to both the rich and rare history as.",
                    "label": 0
                },
                {
                    "sent": "So as a summary.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talk.",
                    "label": 0
                },
                {
                    "sent": "Try to answer the question is why user click the S and we connect the user click Click Connect, click prediction with user behavior analysis and this.",
                    "label": 1
                },
                {
                    "sent": "Artists work embrace user psychological desires at click prediction.",
                    "label": 1
                },
                {
                    "sent": "And our future work includes.",
                    "label": 0
                },
                {
                    "sent": "Exploring Contacts aware user psychological desire and to design structured user design.",
                    "label": 0
                },
                {
                    "sent": "Also, we hope to explore how to use the temporal psychological desire.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is, thanks.",
                    "label": 0
                }
            ]
        }
    }
}