{
    "id": "rb5oeaxus5n7qh7n5cyinnu5snkdaegb",
    "title": "Controllable Face Privacy",
    "info": {
        "author": [
            "Terence Sim, School of Computing, National University of Singapore"
        ],
        "published": "July 2, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Computer Science->Computer Vision",
            "Top->Computer Science->Computer Vision->Face & Gesture Analysis"
        ]
    },
    "url": "http://videolectures.net/fgconference2015_sim_face_privacy/",
    "segmentation": [
        [
            "OK hi, good morning everyone.",
            "My name is Terrence SIM.",
            "My title trouble controllable face privacy and this is done with my graduate student, Junglee.",
            "I'm from the National University of Singapore."
        ],
        [
            "So if you look at the traditional or perhaps naive D application methods that the previous speaker mentioned, you have a face here that goes through some camera and it goes through some dedication method up.",
            "Sorry and.",
            "And so here's an example of blurring.",
            "OK.",
            "So that works blurring.",
            "Will suppress the identity, so if you run that image through a face recognition it will fail OK, but then if you run it through a gender race or H detector, those will fail also.",
            "So what we are proposing is the following.",
            "That is.",
            "We"
        ],
        [
            "Through I'll know our concept of controllable privacy protection where we selectively alter some attributes and the goal of which is the following.",
            "You now have.",
            "The identity that's changed OK, which is what you want.",
            "And you can also change the gender, but you can also preserve.",
            "The other facial attributes that you choose to preserve.",
            "So in other words, you don't.",
            "It's not all or nothing affair.",
            "You can selectively control which facial attribute you wish to change in which to retain.",
            "OK."
        ],
        [
            "So very quickly, the key idea is the following is to take a face represented as a vector X and decompose it into 3.",
            "Subspace is represented by the blue lines, so each of these are subspaces, and I'll tell you more details shortly.",
            "And so in this case, we decompose into gender H and raise subspaces.",
            "Now if you move in, say, one of the subspaces, for instance, you move from AX2A, you're moving along the gender subspace, then all you're changing is the gender and not the age, and not the race.",
            "So that's the result of moving that in this direction.",
            "Likewise, if you move from.",
            "Ecstasy, you're moving in the H subspace then you're just changing the age of the person and the other two facial attributes are unchanged.",
            "So for so in other."
        ],
        [
            "It's in terms of linear algebra.",
            "What we want to do is to, given an input face, represent it.",
            "As a linear, some linear combination of these semantic faces, what we call semantic faces, and there are so called because.",
            "These faces have semantic."
        ],
        [
            "Meanings, the first one represents gender.",
            "The next two represents race captures the notion of race.",
            "The next tool captures the notion of age, so by taking appropriate linear combinations you can synthesize faces of different facial attributes that you desire.",
            "And it's not just a linear combination, is actually an orthogonal summer.",
            "Using this symbol here?",
            "An orthogonal sum tells you that these semantic faces are mutually orthogonal and that gives us the ability to alter one without altering the others."
        ],
        [
            "So what can we do with that?",
            "Well, we can increase femininity, right?",
            "So we can increase.",
            "We have a parameter called Sigma which governs the intensity of that change.",
            "So by changing that Sigma alone, we can make a face looking more feminine, which I hope you agree this is more feminine than this.",
            "We can make you more masculine too, just in case.",
            "We can also intensify the African Ness if there's such a word.",
            "Hopefully you agree that this is more African than this.",
            "At a certain point, distortion sets in right?",
            "Because then it gets out of what's a reasonable face.",
            "We can also aid you, or maybe we can go in the reverse direction and make you look younger.",
            "So let me tell you a little bit more about the math behind it.",
            "How then do we?"
        ],
        [
            "Learn semantic thesis, right?",
            "Well, we're actually using in an old method that we developed in publishing ICC V. 20 or 9.",
            "We called it multi multi modal discriminant analysis and the idea is very simple.",
            "Basically you repeat and you apply Fisher linear discriminant multiple times.",
            "I think everyone here is familiar with the Fisher ratio or LDA.",
            "While we applied multiple multiple times on gender on H on race.",
            "OK more details are upcoming."
        ],
        [
            "To begin with, we start off with N = 18 set of training images which are labeled fully labeled as you can see we have two genders, male and female.",
            "We have three races, Caucasian, African and Oriental.",
            "OK, and then we're three age groups, young middle age and O.",
            "As you can see from these images, these images were called from the Internet.",
            "We just grab them because of the frontal illumination and the good good resolution.",
            "So you begin with."
        ],
        [
            "These images 18 of them, and we do a face encoding and I can tell you more shortly, but the end result is every image is represented as a vector and we put all of them into this data matrix.",
            "Then we."
        ],
        [
            "Quickly center the mean.",
            "We subtract the mean of all these images and then we whiten it, whitening the math is here.",
            "But intuitively this P matrix is PCA.",
            "OK, as you can see is the scatter matrix and the eigen decomposition.",
            "So that gives you your PCA but with this one over square root of the Lambda values, these are the eigenvalues and the effect of that is to whiten meaning the covariance matrix of X~ is now the identity matrix."
        ],
        [
            "And now for each mode of gender, race and H, you simply apply your Fisher linear discriminant, which means you compute the within class scatter matrix the between class and within class scatter matrices.",
            "You perform the eigendecomposition and you solve this Fisher criteria that everybody is familiar with.",
            "But you do it 3 * 1 Four H, Gender, and race."
        ],
        [
            "And the result of this, you get a set of vectors that you populate this V matrix OK. Now it turns out and I'll omit the proof.",
            "The proof was mentioned in the ICC V20O9 paper, and this V can be shown to be an N by 1 -- * N by 117 in this case, because with 18 training images it's an orthogonal matrix and therefore it's invertible.",
            "OK, and the columns are the bases for these gender, race and age subspaces.",
            "That's the decomposition that we seek to achieve that I showed you pictorially two slides ago.",
            "These subspaces captured the variations of gender, age, and race, respectively.",
            "And finally, we have this mysterious thing called the residual space.",
            "It's a 12 dimensional space, and for us it captures facial identity.",
            "Now identity is a tricky concept, right?",
            "Because identity is tight to gender and race.",
            "But not to age right?",
            "Because you can have older, younger version of you, but I cannot have a female version of me.",
            "Heaven forbid.",
            "Anne, I'm Chinese, so I can't change my race so but we loosely call it identity.",
            "To distinguish it from gender, race and age."
        ],
        [
            "So now if you apply this decomposition, given a face image represented as a vector.",
            "You apply P, transpose and V transpose and you get Y and the components of.",
            "Why are the following?",
            "These are exactly the weights that you can manipulate to change the gender, age and race.",
            "OK.",
            "So I refresh your memory with this picture that the GDR ones are twos are precisely coming from the Y.",
            "So it's a very simple linear algebra transformation and it can run pretty fast."
        ],
        [
            "Now the key trick therefore the key trick in our thing is that we can actually synthesize new faces, and this is the synthesis equation given a knew.",
            "Parameter Y prime, where some one or more of the components has been altered.",
            "You can simply reverse the operation by multiplying by APR.",
            "I'm sorry that's missing a V here.",
            "I'm sorry there's a typo in my slide, not in the paper here.",
            "This life has a typo, but the idea is that you can synthesize it to get a news face X, which is a column vector and you rearrange it and you can get a an image.",
            "Now if I visualize Q."
        ],
        [
            "These are the semantic faces there.",
            "Exactly 17 of them earlier on I showed you the first 5 because the first 5 controls.",
            "This one controls the gender.",
            "These two controls the race and these two controls the H. Interestingly, an Oriental Anna Caucasian face combined to give an African phase.",
            "That was surprising.",
            "And then these two combined to give you young middle age and old faces and the rest are the residual space.",
            "The other 12 which.",
            "We manipulate it to change the identity, but to preserve the race and gender."
        ],
        [
            "OK, so.",
            "As I said, the heart of our algorithm is this linear algebra thing, which is easily understood.",
            "Here's an overview.",
            "The remaining thing to get our technique to work is this shape normalization and encoding, which are quickly stepped through."
        ],
        [
            "Given the input face, we first perform a rough alignment using affine transform to a reference face so that the size and translation is roughly the same.",
            "Then we locate facial landmarks using standard SDSM or face plus plus that locates about 70.",
            "Landmarks in the face.",
            "Using that, we do a nonlinear warping to a reference phase and this is what allows us to overcome the ghosting because with proper alignment and then when you synthesize you don't.",
            "You do not get misaligned jaws, misalign noses and that takes away the ghosting.",
            "In our experience this has been very helpful.",
            "We then End Quote this space as a vector.",
            "We just simply take the XYZ color space values we XYZ turns out to be better than RGB.",
            "We store all of them into a vector and we also encode the X&Y landmark coordinations of the coordinates of the 70 landmark positions that encodes the shape as well as the color, right?",
            "So we take all of this, and that's how we encode our face as a vector.",
            "Alright."
        ],
        [
            "So let's quickly see some results.",
            "You have seen the earlier."
        ],
        [
            "Once, here are some more like I said, because we have three mutually orthogonal subspaces, actually 4 if you include residual space, we can independently control one or more of these, right?",
            "So here we show what happens when you change two attributes, gender and H. OK, so this is the original face and this is changing both the gender and age.",
            "This is the intensity 1.0 and a stronger intensity.",
            "Think you'll agree that.",
            "It's older, that's for sure, and it's supposed to be female.",
            "Here we are changing race and gender.",
            "OK. And the last one is raised an age.",
            "So gender is preserved here.",
            "Here's the thing that's not changed has been preserved.",
            "We can, of course."
        ],
        [
            "Change all three attributes, so in this example we have a young Caucasian female.",
            "We turn her into an old African male.",
            "I hope it's convincing that all three attributes have been changed."
        ],
        [
            "Now what can we do?",
            "What we can use it to alter your identity in an irreversible way?",
            "An example it's here.",
            "These two men.",
            "What we do is we use the decomposition and set the residual vector to zero the coefficients rather to zero.",
            "OK, by doing that and recent the sizing, we get new faces like that an.",
            "You'll agree that these two look more similar than these two, although they both came from the same phase.",
            "So by doing that with effectively prevented you from reengineering.",
            "OK, which is important for privacy protection because it's useless if you can reverse engineer.",
            "So we have shown a way to do that.",
            "Of course you can also add some random element given an input phase, randomly alter the identity and synthesize that will work.",
            "Also another example, these two African ladies.",
            "We set the identity component to zero and we re synthesize and you can see that these two look pretty alike.",
            "And therefore you cannot reverse engineer."
        ],
        [
            "So the acid test is surely the images look convincing to us humans, but can we fool vision algorithms?",
            "That's how we started this talk right?",
            "When we run through agenda detector, does it?",
            "Does it work when we run through a race detector?",
            "Does it work?",
            "So what we set out as?"
        ],
        [
            "As follows, we built.",
            "Change detectors OK, what is the change detector?",
            "Basically a change detector accepts two inputs, runs through a commercial face detector.",
            "In this case they agenda classifier and just compares whether the gender is the same.",
            "OK, if it's the same, it says yes, same gender otherwise.",
            "No, so we built three change detectors, one for gender, one 4H, and one for race, right?",
            "And then what we did was we synthesize.",
            "We take an original image.",
            "We perform a. Alteration on one or more of the facial attributes, and we take that image pair and feed it to our change detector, right?",
            "Because that's going to tell us whether our algorithm is effective at making the changes.",
            "Anne."
        ],
        [
            "Here are the results.",
            "Let's just focus on the first line for a minute.",
            "In this first line we are altering only gender, just one attribute.",
            "We just change the gender of the input face at different intensities 0.5, one .0 and so forth and then we run it through a gender change detector.",
            "OK, as you can see.",
            "So this is the change rate.",
            "In other words, this is the proportion of time that the change detector says yes.",
            "The face has changed.",
            "I mean the gender has changed in this case, right?",
            "Because we only change one one thing, the gender.",
            "So as we increase the intensity, the change rate goes up, meaning that the gender detector is convinced that the gender has changed, whether male to female or female to male.",
            "OK, so that's good news.",
            "The other good news is the following.",
            "The other two attributes are unchanged, right?",
            "And we ran them through.",
            "We ran the images through the face, the race and gender change there, and it pretty much says is unchanged.",
            "KD change rates doesn't increase or pretty much remains low.",
            "So that's good news.",
            "In other words, the thing that we want to change is change the thing that we want to retain is unchanged.",
            "At least as far as these detectors go.",
            "Likewise, if we change the race alone, we can see that the highest scores are reported in the in bold.",
            "Which means to say, the race detector agrees that the change has occurred in the race attribute, but not in the gender and not in the age.",
            "And then likewise, if we change the H, only the HCD registers a change, and the other two attributes.",
            "Remain relatively low.",
            "OK."
        ],
        [
            "And here's the result of changing multiple attributes, gender and race, gender and age, race and H, and all three attributes.",
            "Here the numbers are a lot lower.",
            "And you need to increase to a higher intensity before the detectors agree that the change has taken place.",
            "We're not quite sure why, but changing two or more attributes seems to lower the change rate.",
            "This isn't an error obviously.",
            "Here we are only changing gender and race and H. Should be unchanged by the H detector is reporting a high value.",
            "So somehow as we change you're raising your gender.",
            "We make you older as well.",
            "Unfortunate."
        ],
        [
            "And then finally, if we do just a pure identity change.",
            "We run through a face plus plus a commercial identifier.",
            "It always says the face has changed, so that's the I mean.",
            "The identity is changed, but that's not interesting.",
            "What's interesting is to look at the confidence value.",
            "'cause this this record recognition method does.",
            "Report the confidence of that change as well as the identity is very high, so it shows that the algorithm does think that the identity has been changed.",
            "Alright."
        ],
        [
            "Fun results, so we had to run this on Michael Jackson.",
            "Before surgery, right when he was younger.",
            "So this is a younger Michael Jackson, obviously African.",
            "Very African, and this is the Oriental version of him.",
            "If you believe that and this is the Caucasian version of Michael Jackson, if you believe our algorithm.",
            "Um?"
        ],
        [
            "And then we took this avatar thing from the alien rather from the movie Avatar, right?",
            "And that's the Caucasian version, the African version and the Oriental version of this alien.",
            "You will notice that the facial proportions are nonhuman.",
            "This is this is alien, and so the synthesized results look a bit grotesque."
        ],
        [
            "So in conclusion, we're happy to present this notion of controllable face privacy, which allows a more nuanced alteration of facial attributes.",
            "You don't need an all or nothing affair.",
            "You can selectively alter an retain facial attributes.",
            "And the trick is to use this orthogonal subspace decomposition that can separate the parameters that control gender, race and H and therefore it allows you to sense that I synthesize new faces with the appropriate variations.",
            "Now, although I did mention in my talk in our paper, we do show that we can put in some privacy guarantees in the data mining community.",
            "The champion this notion of K anonymity that's similar to the K select of.",
            "The previous speaker case instead of Gross and Sweeney.",
            "But there's also L diversity and T closeness, so these are provable privacy guarantees that can be readily incorporated into our technique.",
            "So in other words, we can synthesize faces that look alike look like K other faces.",
            "Or the Chief El diversity, or achieve a certain distribution.",
            "So for instance, in this room there are only so many Asians, so we can synthesize faces of the approximate statistical distribution as found in this room.",
            "So that's the notion of closeness, which can be incorporated into our scheme.",
            "Ann, we ran about.",
            "Many, many thousands when experiencing many thousands of image pairs like 70 thousands and the results do validate their method is quite effective at changing faces."
        ],
        [
            "So this is my last slide.",
            "We have a demo the next three days.",
            "We have a demo here at the conference so please stop by our booth.",
            "Have your face taken.",
            "Will do it live on you and we can send you the images as a souvenir.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK hi, good morning everyone.",
                    "label": 0
                },
                {
                    "sent": "My name is Terrence SIM.",
                    "label": 0
                },
                {
                    "sent": "My title trouble controllable face privacy and this is done with my graduate student, Junglee.",
                    "label": 1
                },
                {
                    "sent": "I'm from the National University of Singapore.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you look at the traditional or perhaps naive D application methods that the previous speaker mentioned, you have a face here that goes through some camera and it goes through some dedication method up.",
                    "label": 0
                },
                {
                    "sent": "Sorry and.",
                    "label": 0
                },
                {
                    "sent": "And so here's an example of blurring.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So that works blurring.",
                    "label": 0
                },
                {
                    "sent": "Will suppress the identity, so if you run that image through a face recognition it will fail OK, but then if you run it through a gender race or H detector, those will fail also.",
                    "label": 0
                },
                {
                    "sent": "So what we are proposing is the following.",
                    "label": 0
                },
                {
                    "sent": "That is.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Through I'll know our concept of controllable privacy protection where we selectively alter some attributes and the goal of which is the following.",
                    "label": 1
                },
                {
                    "sent": "You now have.",
                    "label": 0
                },
                {
                    "sent": "The identity that's changed OK, which is what you want.",
                    "label": 0
                },
                {
                    "sent": "And you can also change the gender, but you can also preserve.",
                    "label": 0
                },
                {
                    "sent": "The other facial attributes that you choose to preserve.",
                    "label": 0
                },
                {
                    "sent": "So in other words, you don't.",
                    "label": 0
                },
                {
                    "sent": "It's not all or nothing affair.",
                    "label": 0
                },
                {
                    "sent": "You can selectively control which facial attribute you wish to change in which to retain.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So very quickly, the key idea is the following is to take a face represented as a vector X and decompose it into 3.",
                    "label": 1
                },
                {
                    "sent": "Subspace is represented by the blue lines, so each of these are subspaces, and I'll tell you more details shortly.",
                    "label": 0
                },
                {
                    "sent": "And so in this case, we decompose into gender H and raise subspaces.",
                    "label": 0
                },
                {
                    "sent": "Now if you move in, say, one of the subspaces, for instance, you move from AX2A, you're moving along the gender subspace, then all you're changing is the gender and not the age, and not the race.",
                    "label": 0
                },
                {
                    "sent": "So that's the result of moving that in this direction.",
                    "label": 0
                },
                {
                    "sent": "Likewise, if you move from.",
                    "label": 0
                },
                {
                    "sent": "Ecstasy, you're moving in the H subspace then you're just changing the age of the person and the other two facial attributes are unchanged.",
                    "label": 0
                },
                {
                    "sent": "So for so in other.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's in terms of linear algebra.",
                    "label": 0
                },
                {
                    "sent": "What we want to do is to, given an input face, represent it.",
                    "label": 0
                },
                {
                    "sent": "As a linear, some linear combination of these semantic faces, what we call semantic faces, and there are so called because.",
                    "label": 1
                },
                {
                    "sent": "These faces have semantic.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Meanings, the first one represents gender.",
                    "label": 0
                },
                {
                    "sent": "The next two represents race captures the notion of race.",
                    "label": 0
                },
                {
                    "sent": "The next tool captures the notion of age, so by taking appropriate linear combinations you can synthesize faces of different facial attributes that you desire.",
                    "label": 0
                },
                {
                    "sent": "And it's not just a linear combination, is actually an orthogonal summer.",
                    "label": 0
                },
                {
                    "sent": "Using this symbol here?",
                    "label": 0
                },
                {
                    "sent": "An orthogonal sum tells you that these semantic faces are mutually orthogonal and that gives us the ability to alter one without altering the others.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what can we do with that?",
                    "label": 0
                },
                {
                    "sent": "Well, we can increase femininity, right?",
                    "label": 0
                },
                {
                    "sent": "So we can increase.",
                    "label": 0
                },
                {
                    "sent": "We have a parameter called Sigma which governs the intensity of that change.",
                    "label": 0
                },
                {
                    "sent": "So by changing that Sigma alone, we can make a face looking more feminine, which I hope you agree this is more feminine than this.",
                    "label": 0
                },
                {
                    "sent": "We can make you more masculine too, just in case.",
                    "label": 0
                },
                {
                    "sent": "We can also intensify the African Ness if there's such a word.",
                    "label": 0
                },
                {
                    "sent": "Hopefully you agree that this is more African than this.",
                    "label": 0
                },
                {
                    "sent": "At a certain point, distortion sets in right?",
                    "label": 0
                },
                {
                    "sent": "Because then it gets out of what's a reasonable face.",
                    "label": 0
                },
                {
                    "sent": "We can also aid you, or maybe we can go in the reverse direction and make you look younger.",
                    "label": 0
                },
                {
                    "sent": "So let me tell you a little bit more about the math behind it.",
                    "label": 0
                },
                {
                    "sent": "How then do we?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Learn semantic thesis, right?",
                    "label": 0
                },
                {
                    "sent": "Well, we're actually using in an old method that we developed in publishing ICC V. 20 or 9.",
                    "label": 0
                },
                {
                    "sent": "We called it multi multi modal discriminant analysis and the idea is very simple.",
                    "label": 0
                },
                {
                    "sent": "Basically you repeat and you apply Fisher linear discriminant multiple times.",
                    "label": 1
                },
                {
                    "sent": "I think everyone here is familiar with the Fisher ratio or LDA.",
                    "label": 0
                },
                {
                    "sent": "While we applied multiple multiple times on gender on H on race.",
                    "label": 0
                },
                {
                    "sent": "OK more details are upcoming.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To begin with, we start off with N = 18 set of training images which are labeled fully labeled as you can see we have two genders, male and female.",
                    "label": 0
                },
                {
                    "sent": "We have three races, Caucasian, African and Oriental.",
                    "label": 1
                },
                {
                    "sent": "OK, and then we're three age groups, young middle age and O.",
                    "label": 0
                },
                {
                    "sent": "As you can see from these images, these images were called from the Internet.",
                    "label": 0
                },
                {
                    "sent": "We just grab them because of the frontal illumination and the good good resolution.",
                    "label": 0
                },
                {
                    "sent": "So you begin with.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These images 18 of them, and we do a face encoding and I can tell you more shortly, but the end result is every image is represented as a vector and we put all of them into this data matrix.",
                    "label": 0
                },
                {
                    "sent": "Then we.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Quickly center the mean.",
                    "label": 0
                },
                {
                    "sent": "We subtract the mean of all these images and then we whiten it, whitening the math is here.",
                    "label": 0
                },
                {
                    "sent": "But intuitively this P matrix is PCA.",
                    "label": 0
                },
                {
                    "sent": "OK, as you can see is the scatter matrix and the eigen decomposition.",
                    "label": 0
                },
                {
                    "sent": "So that gives you your PCA but with this one over square root of the Lambda values, these are the eigenvalues and the effect of that is to whiten meaning the covariance matrix of X~ is now the identity matrix.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now for each mode of gender, race and H, you simply apply your Fisher linear discriminant, which means you compute the within class scatter matrix the between class and within class scatter matrices.",
                    "label": 1
                },
                {
                    "sent": "You perform the eigendecomposition and you solve this Fisher criteria that everybody is familiar with.",
                    "label": 0
                },
                {
                    "sent": "But you do it 3 * 1 Four H, Gender, and race.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the result of this, you get a set of vectors that you populate this V matrix OK. Now it turns out and I'll omit the proof.",
                    "label": 0
                },
                {
                    "sent": "The proof was mentioned in the ICC V20O9 paper, and this V can be shown to be an N by 1 -- * N by 117 in this case, because with 18 training images it's an orthogonal matrix and therefore it's invertible.",
                    "label": 0
                },
                {
                    "sent": "OK, and the columns are the bases for these gender, race and age subspaces.",
                    "label": 1
                },
                {
                    "sent": "That's the decomposition that we seek to achieve that I showed you pictorially two slides ago.",
                    "label": 1
                },
                {
                    "sent": "These subspaces captured the variations of gender, age, and race, respectively.",
                    "label": 0
                },
                {
                    "sent": "And finally, we have this mysterious thing called the residual space.",
                    "label": 0
                },
                {
                    "sent": "It's a 12 dimensional space, and for us it captures facial identity.",
                    "label": 0
                },
                {
                    "sent": "Now identity is a tricky concept, right?",
                    "label": 0
                },
                {
                    "sent": "Because identity is tight to gender and race.",
                    "label": 0
                },
                {
                    "sent": "But not to age right?",
                    "label": 0
                },
                {
                    "sent": "Because you can have older, younger version of you, but I cannot have a female version of me.",
                    "label": 0
                },
                {
                    "sent": "Heaven forbid.",
                    "label": 0
                },
                {
                    "sent": "Anne, I'm Chinese, so I can't change my race so but we loosely call it identity.",
                    "label": 0
                },
                {
                    "sent": "To distinguish it from gender, race and age.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now if you apply this decomposition, given a face image represented as a vector.",
                    "label": 0
                },
                {
                    "sent": "You apply P, transpose and V transpose and you get Y and the components of.",
                    "label": 0
                },
                {
                    "sent": "Why are the following?",
                    "label": 0
                },
                {
                    "sent": "These are exactly the weights that you can manipulate to change the gender, age and race.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So I refresh your memory with this picture that the GDR ones are twos are precisely coming from the Y.",
                    "label": 0
                },
                {
                    "sent": "So it's a very simple linear algebra transformation and it can run pretty fast.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now the key trick therefore the key trick in our thing is that we can actually synthesize new faces, and this is the synthesis equation given a knew.",
                    "label": 1
                },
                {
                    "sent": "Parameter Y prime, where some one or more of the components has been altered.",
                    "label": 0
                },
                {
                    "sent": "You can simply reverse the operation by multiplying by APR.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry that's missing a V here.",
                    "label": 0
                },
                {
                    "sent": "I'm sorry there's a typo in my slide, not in the paper here.",
                    "label": 0
                },
                {
                    "sent": "This life has a typo, but the idea is that you can synthesize it to get a news face X, which is a column vector and you rearrange it and you can get a an image.",
                    "label": 0
                },
                {
                    "sent": "Now if I visualize Q.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These are the semantic faces there.",
                    "label": 1
                },
                {
                    "sent": "Exactly 17 of them earlier on I showed you the first 5 because the first 5 controls.",
                    "label": 0
                },
                {
                    "sent": "This one controls the gender.",
                    "label": 0
                },
                {
                    "sent": "These two controls the race and these two controls the H. Interestingly, an Oriental Anna Caucasian face combined to give an African phase.",
                    "label": 0
                },
                {
                    "sent": "That was surprising.",
                    "label": 0
                },
                {
                    "sent": "And then these two combined to give you young middle age and old faces and the rest are the residual space.",
                    "label": 0
                },
                {
                    "sent": "The other 12 which.",
                    "label": 0
                },
                {
                    "sent": "We manipulate it to change the identity, but to preserve the race and gender.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "As I said, the heart of our algorithm is this linear algebra thing, which is easily understood.",
                    "label": 0
                },
                {
                    "sent": "Here's an overview.",
                    "label": 0
                },
                {
                    "sent": "The remaining thing to get our technique to work is this shape normalization and encoding, which are quickly stepped through.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Given the input face, we first perform a rough alignment using affine transform to a reference face so that the size and translation is roughly the same.",
                    "label": 0
                },
                {
                    "sent": "Then we locate facial landmarks using standard SDSM or face plus plus that locates about 70.",
                    "label": 0
                },
                {
                    "sent": "Landmarks in the face.",
                    "label": 0
                },
                {
                    "sent": "Using that, we do a nonlinear warping to a reference phase and this is what allows us to overcome the ghosting because with proper alignment and then when you synthesize you don't.",
                    "label": 0
                },
                {
                    "sent": "You do not get misaligned jaws, misalign noses and that takes away the ghosting.",
                    "label": 0
                },
                {
                    "sent": "In our experience this has been very helpful.",
                    "label": 0
                },
                {
                    "sent": "We then End Quote this space as a vector.",
                    "label": 0
                },
                {
                    "sent": "We just simply take the XYZ color space values we XYZ turns out to be better than RGB.",
                    "label": 1
                },
                {
                    "sent": "We store all of them into a vector and we also encode the X&Y landmark coordinations of the coordinates of the 70 landmark positions that encodes the shape as well as the color, right?",
                    "label": 0
                },
                {
                    "sent": "So we take all of this, and that's how we encode our face as a vector.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's quickly see some results.",
                    "label": 0
                },
                {
                    "sent": "You have seen the earlier.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once, here are some more like I said, because we have three mutually orthogonal subspaces, actually 4 if you include residual space, we can independently control one or more of these, right?",
                    "label": 0
                },
                {
                    "sent": "So here we show what happens when you change two attributes, gender and H. OK, so this is the original face and this is changing both the gender and age.",
                    "label": 0
                },
                {
                    "sent": "This is the intensity 1.0 and a stronger intensity.",
                    "label": 0
                },
                {
                    "sent": "Think you'll agree that.",
                    "label": 0
                },
                {
                    "sent": "It's older, that's for sure, and it's supposed to be female.",
                    "label": 0
                },
                {
                    "sent": "Here we are changing race and gender.",
                    "label": 0
                },
                {
                    "sent": "OK. And the last one is raised an age.",
                    "label": 0
                },
                {
                    "sent": "So gender is preserved here.",
                    "label": 0
                },
                {
                    "sent": "Here's the thing that's not changed has been preserved.",
                    "label": 0
                },
                {
                    "sent": "We can, of course.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Change all three attributes, so in this example we have a young Caucasian female.",
                    "label": 0
                },
                {
                    "sent": "We turn her into an old African male.",
                    "label": 0
                },
                {
                    "sent": "I hope it's convincing that all three attributes have been changed.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now what can we do?",
                    "label": 0
                },
                {
                    "sent": "What we can use it to alter your identity in an irreversible way?",
                    "label": 0
                },
                {
                    "sent": "An example it's here.",
                    "label": 0
                },
                {
                    "sent": "These two men.",
                    "label": 0
                },
                {
                    "sent": "What we do is we use the decomposition and set the residual vector to zero the coefficients rather to zero.",
                    "label": 0
                },
                {
                    "sent": "OK, by doing that and recent the sizing, we get new faces like that an.",
                    "label": 0
                },
                {
                    "sent": "You'll agree that these two look more similar than these two, although they both came from the same phase.",
                    "label": 0
                },
                {
                    "sent": "So by doing that with effectively prevented you from reengineering.",
                    "label": 0
                },
                {
                    "sent": "OK, which is important for privacy protection because it's useless if you can reverse engineer.",
                    "label": 0
                },
                {
                    "sent": "So we have shown a way to do that.",
                    "label": 0
                },
                {
                    "sent": "Of course you can also add some random element given an input phase, randomly alter the identity and synthesize that will work.",
                    "label": 0
                },
                {
                    "sent": "Also another example, these two African ladies.",
                    "label": 0
                },
                {
                    "sent": "We set the identity component to zero and we re synthesize and you can see that these two look pretty alike.",
                    "label": 0
                },
                {
                    "sent": "And therefore you cannot reverse engineer.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the acid test is surely the images look convincing to us humans, but can we fool vision algorithms?",
                    "label": 1
                },
                {
                    "sent": "That's how we started this talk right?",
                    "label": 0
                },
                {
                    "sent": "When we run through agenda detector, does it?",
                    "label": 0
                },
                {
                    "sent": "Does it work when we run through a race detector?",
                    "label": 0
                },
                {
                    "sent": "Does it work?",
                    "label": 0
                },
                {
                    "sent": "So what we set out as?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As follows, we built.",
                    "label": 0
                },
                {
                    "sent": "Change detectors OK, what is the change detector?",
                    "label": 1
                },
                {
                    "sent": "Basically a change detector accepts two inputs, runs through a commercial face detector.",
                    "label": 0
                },
                {
                    "sent": "In this case they agenda classifier and just compares whether the gender is the same.",
                    "label": 1
                },
                {
                    "sent": "OK, if it's the same, it says yes, same gender otherwise.",
                    "label": 0
                },
                {
                    "sent": "No, so we built three change detectors, one for gender, one 4H, and one for race, right?",
                    "label": 0
                },
                {
                    "sent": "And then what we did was we synthesize.",
                    "label": 0
                },
                {
                    "sent": "We take an original image.",
                    "label": 0
                },
                {
                    "sent": "We perform a. Alteration on one or more of the facial attributes, and we take that image pair and feed it to our change detector, right?",
                    "label": 0
                },
                {
                    "sent": "Because that's going to tell us whether our algorithm is effective at making the changes.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here are the results.",
                    "label": 0
                },
                {
                    "sent": "Let's just focus on the first line for a minute.",
                    "label": 0
                },
                {
                    "sent": "In this first line we are altering only gender, just one attribute.",
                    "label": 0
                },
                {
                    "sent": "We just change the gender of the input face at different intensities 0.5, one .0 and so forth and then we run it through a gender change detector.",
                    "label": 0
                },
                {
                    "sent": "OK, as you can see.",
                    "label": 0
                },
                {
                    "sent": "So this is the change rate.",
                    "label": 0
                },
                {
                    "sent": "In other words, this is the proportion of time that the change detector says yes.",
                    "label": 0
                },
                {
                    "sent": "The face has changed.",
                    "label": 0
                },
                {
                    "sent": "I mean the gender has changed in this case, right?",
                    "label": 0
                },
                {
                    "sent": "Because we only change one one thing, the gender.",
                    "label": 0
                },
                {
                    "sent": "So as we increase the intensity, the change rate goes up, meaning that the gender detector is convinced that the gender has changed, whether male to female or female to male.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's good news.",
                    "label": 0
                },
                {
                    "sent": "The other good news is the following.",
                    "label": 0
                },
                {
                    "sent": "The other two attributes are unchanged, right?",
                    "label": 1
                },
                {
                    "sent": "And we ran them through.",
                    "label": 0
                },
                {
                    "sent": "We ran the images through the face, the race and gender change there, and it pretty much says is unchanged.",
                    "label": 0
                },
                {
                    "sent": "KD change rates doesn't increase or pretty much remains low.",
                    "label": 0
                },
                {
                    "sent": "So that's good news.",
                    "label": 0
                },
                {
                    "sent": "In other words, the thing that we want to change is change the thing that we want to retain is unchanged.",
                    "label": 0
                },
                {
                    "sent": "At least as far as these detectors go.",
                    "label": 0
                },
                {
                    "sent": "Likewise, if we change the race alone, we can see that the highest scores are reported in the in bold.",
                    "label": 0
                },
                {
                    "sent": "Which means to say, the race detector agrees that the change has occurred in the race attribute, but not in the gender and not in the age.",
                    "label": 0
                },
                {
                    "sent": "And then likewise, if we change the H, only the HCD registers a change, and the other two attributes.",
                    "label": 0
                },
                {
                    "sent": "Remain relatively low.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's the result of changing multiple attributes, gender and race, gender and age, race and H, and all three attributes.",
                    "label": 0
                },
                {
                    "sent": "Here the numbers are a lot lower.",
                    "label": 0
                },
                {
                    "sent": "And you need to increase to a higher intensity before the detectors agree that the change has taken place.",
                    "label": 1
                },
                {
                    "sent": "We're not quite sure why, but changing two or more attributes seems to lower the change rate.",
                    "label": 0
                },
                {
                    "sent": "This isn't an error obviously.",
                    "label": 0
                },
                {
                    "sent": "Here we are only changing gender and race and H. Should be unchanged by the H detector is reporting a high value.",
                    "label": 0
                },
                {
                    "sent": "So somehow as we change you're raising your gender.",
                    "label": 0
                },
                {
                    "sent": "We make you older as well.",
                    "label": 0
                },
                {
                    "sent": "Unfortunate.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then finally, if we do just a pure identity change.",
                    "label": 1
                },
                {
                    "sent": "We run through a face plus plus a commercial identifier.",
                    "label": 0
                },
                {
                    "sent": "It always says the face has changed, so that's the I mean.",
                    "label": 0
                },
                {
                    "sent": "The identity is changed, but that's not interesting.",
                    "label": 0
                },
                {
                    "sent": "What's interesting is to look at the confidence value.",
                    "label": 0
                },
                {
                    "sent": "'cause this this record recognition method does.",
                    "label": 0
                },
                {
                    "sent": "Report the confidence of that change as well as the identity is very high, so it shows that the algorithm does think that the identity has been changed.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fun results, so we had to run this on Michael Jackson.",
                    "label": 0
                },
                {
                    "sent": "Before surgery, right when he was younger.",
                    "label": 0
                },
                {
                    "sent": "So this is a younger Michael Jackson, obviously African.",
                    "label": 0
                },
                {
                    "sent": "Very African, and this is the Oriental version of him.",
                    "label": 0
                },
                {
                    "sent": "If you believe that and this is the Caucasian version of Michael Jackson, if you believe our algorithm.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then we took this avatar thing from the alien rather from the movie Avatar, right?",
                    "label": 0
                },
                {
                    "sent": "And that's the Caucasian version, the African version and the Oriental version of this alien.",
                    "label": 0
                },
                {
                    "sent": "You will notice that the facial proportions are nonhuman.",
                    "label": 0
                },
                {
                    "sent": "This is this is alien, and so the synthesized results look a bit grotesque.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in conclusion, we're happy to present this notion of controllable face privacy, which allows a more nuanced alteration of facial attributes.",
                    "label": 1
                },
                {
                    "sent": "You don't need an all or nothing affair.",
                    "label": 0
                },
                {
                    "sent": "You can selectively alter an retain facial attributes.",
                    "label": 0
                },
                {
                    "sent": "And the trick is to use this orthogonal subspace decomposition that can separate the parameters that control gender, race and H and therefore it allows you to sense that I synthesize new faces with the appropriate variations.",
                    "label": 1
                },
                {
                    "sent": "Now, although I did mention in my talk in our paper, we do show that we can put in some privacy guarantees in the data mining community.",
                    "label": 0
                },
                {
                    "sent": "The champion this notion of K anonymity that's similar to the K select of.",
                    "label": 0
                },
                {
                    "sent": "The previous speaker case instead of Gross and Sweeney.",
                    "label": 0
                },
                {
                    "sent": "But there's also L diversity and T closeness, so these are provable privacy guarantees that can be readily incorporated into our technique.",
                    "label": 0
                },
                {
                    "sent": "So in other words, we can synthesize faces that look alike look like K other faces.",
                    "label": 0
                },
                {
                    "sent": "Or the Chief El diversity, or achieve a certain distribution.",
                    "label": 0
                },
                {
                    "sent": "So for instance, in this room there are only so many Asians, so we can synthesize faces of the approximate statistical distribution as found in this room.",
                    "label": 0
                },
                {
                    "sent": "So that's the notion of closeness, which can be incorporated into our scheme.",
                    "label": 0
                },
                {
                    "sent": "Ann, we ran about.",
                    "label": 0
                },
                {
                    "sent": "Many, many thousands when experiencing many thousands of image pairs like 70 thousands and the results do validate their method is quite effective at changing faces.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is my last slide.",
                    "label": 0
                },
                {
                    "sent": "We have a demo the next three days.",
                    "label": 0
                },
                {
                    "sent": "We have a demo here at the conference so please stop by our booth.",
                    "label": 0
                },
                {
                    "sent": "Have your face taken.",
                    "label": 0
                },
                {
                    "sent": "Will do it live on you and we can send you the images as a souvenir.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}