{
    "id": "rfa63ktunytd6ayazt7ipbg6omgw4kfa",
    "title": "Are We There Yet?",
    "info": {
        "author": [
            "Nello Cristianini, Department of Engineering Mathematics, University of Bristol"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd09_christianini_awty/",
    "segmentation": [
        [
            "We had two activities this morning.",
            "Two is we announced the winner for best demo or so.",
            "Start with the private talk.",
            "It's my pleasure to introduce Professor Miller Cristiani this journey he's currently prefers.",
            "Regardless, intelligence Bristol University of Bristol.",
            "He was previously.",
            "Statistics at UC Davis.",
            "He's also visited Berkeley and Royal Holloway in London.",
            "No one ever has a number of interest.",
            "Computational pattern analysis, genomics, computational intelligence, artificial intelligence, especially his relationship with statistics.",
            "Recently, he's also been looking at bias in the media.",
            "Now many of you should not design, which is easy.",
            "Offer two of their best known books.",
            "He's also an author of the book in Genomics.",
            "And as a community member needs an editor in both Jamilla and Jer.",
            "Now he's quite a popular file that invited Sessions, so he gives talks in a wide range of areas and your networks artificial intelligence machine learning.",
            "So without further ado.",
            "To put this talking in context, this talk is about the future.",
            "Final session.",
            "Conference thank you, thank you."
        ],
        [
            "Thank you rifle.",
            "Beautiful introduction.",
            "Before I start, I would really like to thank.",
            "The local organizers more than all the organizers, it is being an incredibly impressive.",
            "Series of days and.",
            "I'm very impressed that you set a very high standard for those who will follow next year.",
            "And after that and then.",
            "The only negative side of having a newsletter is that I don't get to go on the newsletter because it's the last day today and everything nice reading on it.",
            "And so I am on it all.",
            "OK, thank you very much.",
            "I'll save you think of everything.",
            "I just stay there because my computer works like Shy Ben Davis laptop and I may need your input just like you did.",
            "So it might not work, so I might have to reprogram something as we go.",
            "Let's see if this is."
        ],
        [
            "Can I have a?",
            "I have used my little.",
            "Time machine.",
            "Let's see if it works.",
            "You know, simple fill out the assets of Bristol, limbs doctor greywater neurologist who makes robots as a hobby.",
            "They are small, but he's undressed enough to look like them because the tortoises and so claiming they have that inside being designed that they respond to stimuli are right on track is light.",
            "And she sees a metric center which rotates around her body.",
            "When light strikes the sample driving and steering mechanism sensor high in Georgia.",
            "If she brushes against any object in South Park.",
            "Contacts are operated the turn the steering away and so automatically she takes avoiding action.",
            "He worked exactly the same way.",
            "Electronic toys work exactly as they have a simple two so nervous system.",
            "And that would more so they will be able to do many more tricks already else has one Apple help with her batteries begin to fail the automatically runs home to her kennel, but charging up and incontinence could deliver much better luck.",
            "Sciences.",
            "Normal stuff for money had been spent on the age of language translation by computer.",
            "Is that in computer recognition of human speech?",
            "400 level and in automatic proving of theorems in higher mathematics.",
            "So I would like you to feel very much like 1950s because the idea is to take you back for a moment to 1950s and try to.",
            "See a few other things that were going on and then we're going to come back to the second gentlemen of 1973."
        ],
        [
            "So in November 1958.",
            "Just outside of London in Teddington.",
            "At the National Physical Ability Remarkable meeting took place.",
            "In where were about 200 people?",
            "A meeting not unlike this one, actually 200 people for three or four days met.",
            "To discuss the topic of.",
            "Can we mechanize thinking?",
            "Can we build thinking machines can machines thing?",
            "And let a group of people included cyberneticist, biologists, mathematicians and.",
            "Early artificial intelligence researchers and the consequence of that meeting are felt still now.",
            "And.",
            "I would like to spend some time looking at what was discussed because it has implications for us.",
            "So these are the two volume proceedings just like this."
        ],
        [
            "Two volume proceedings here, and that happened nearly exactly 50 years ago, so it's a good comparison.",
            "This symposium, the preceding say, was held to bring together scientists studying artificial thinking, character in pattern recognition, learning, mechanical language translation biology, automatic programming, industrial planning, and clerical mechanization.",
            "It was felt that the common theme in all these fields was the mechanization of thought processes and data into exchange of ideas between these specialists would be very valuable.",
            "And in fact."
        ],
        [
            "That was a good time to meet for those experts in 1958 there was already a research community in machine intelligence in the US and the UK, and it wasn't even the beginning of it because I don't know you had died already four years before.",
            "Cybernetic movement was ten years old, at least if you count Venus book as the beginning.",
            "Which is pessimistic.",
            "The movement started before 1948.",
            "The Macy conferences had ended there at the club stop meeting.",
            "This was actually a moment in which one entire chapter was coming to an end and another chapter was starting, but in that meeting all the various communities of machine intelligence came together to discuss.",
            "The question of can machines think?",
            "From the United States knew wind was coming.",
            "It was called artificial intelligence.",
            "Two years before a meeting at Dartmouth College used this name for the first time, but if you look at the."
        ],
        [
            "Conference it was organized along very familiar lines.",
            "By today's standards, you find decisions on general theoretical principles, machine translation, speech recognition.",
            "What are you learning?",
            "And biological and industrial applications.",
            "The only parallel tracks or entire conference where the applications in the last day.",
            "So you wouldn't feel very out of place.",
            "Perhaps if you were to be in Teddington in 2000 in 1958."
        ],
        [
            "Any fucked?",
            "The people that took place in this meeting are very well known to most of us.",
            "You would find Frank Rosenblatt, the inventor of the perception.",
            "Who presented perceptron algorithm?",
            "Arthur, Samuel, the author of the Fast Learning Algorithm Checker Player on the IBM machines.",
            "Marvin Minsky longtime evangelist of artificial intelligence for 50 years following.",
            "Oliver selford of the Selfridges family from England.",
            "Who actually where Americans in Norwegian and the author of the Pandemonium Architecture so prototype for all?",
            "Agent based evolutionary based.",
            "Met with John MacArthur, the inventor of artificial intelligence definition and Lisp, among many other things.",
            "Donald Mackay, father of David Mackay, Cyberneticist information theorist.",
            "Gay Walter.",
            "The gentleman you seen in the first video.",
            "Or both assistant overall eclectic.",
            "From Bristol, Warren McCulloch, new office geologist from the McCulloch and Pitts model also.",
            "Ashby Cyberneticist, inventor of the Omen stuff and the concept of homeostasis and so many other people met to discuss this question.",
            "So many ideas that we use today.",
            "Come from those people.",
            "Yeah.",
            "So I find it in."
        ],
        [
            "Thing to just look at Sam.",
            "I will not take you to the proceedings I it will be boring talking.",
            "It's the last day, but I would like to see some pages of the proceedings just to see what was the general idea that generally the first session, the general one I think must have been negotiated carefully.",
            "It is actually presenting intermeshed.",
            "Dogs from artificial intelligence and cybernetics, and again so you have Minsky Mackay, Matt McCarthy, our speed up and they discuss interesting questions.",
            "You Ristic programming common sense reasoning using probability to model biological behavior, and so on.",
            "John McCarthy was already talking about programming with Common Sense, which would become a theme in the furlough or slash bill.",
            "We know he talks about learning in biological systems.",
            "It was a very interesting.",
            "Conference that Estock was by."
        ],
        [
            "We missed you.",
            "I will not stop there, but you can see already.",
            "He would say particular attention is given to possibly involving pattern recognition, learning, planning ahead, and the use of analogies in models.",
            "A machine might improve itself by adding to its collection of problem solving methods and so on and so forth."
        ],
        [
            "But the most interesting things I find in the later chapters in the speech recognition chapter, there was a group of people from UCL.",
            "John might even be sitting in their office.",
            "And never suggested that in order to improve speech recognition.",
            "This is 50 years ago.",
            "You probably should collect frequencies of engrams and use them to model the word transition probabilities and use that to improve the quality of your transcription.",
            "To complement the acoustic information that you have, something that we do today.",
            "Um?",
            "But"
        ],
        [
            "The chapter was going to discuss it was actually the machine learning one for this conference.",
            "Is the Machine learning conference and thank you also block presented his perceptron algorithm some variations and it was pretty much done when he was presented a lot of other things.",
            "Happened after, but the basic algorithm was presented in this meeting.",
            "Selfridge presented the pandemonium system, and it's interesting because he tested it on a task of handwriting recognition and letter recognition, which is using a similar protocol today, training and testing, and they all usual things.",
            "That was done in that.",
            "Paper and do not extend the undo implemented her in Harbor Wave, an algorithm of roughly about 2.",
            "Extracting conditional probabilities from.",
            "Something that we would call today Association mining.",
            "If you want it I can show you so the data miners here might be interested in this.",
            "The."
        ],
        [
            "The architecture was able to count the frequency of items set.",
            "ABC&AB as well and then working out the ratio between accessing computing the conditional probability of item C. Being present if items A&B are present.",
            "They were talking about items that with this expression, but that was the algorithm and it was essentially the hardware equivalent to the Peoria Association mining algorithm.",
            "And many many other things can be seen in that in that.",
            "It doesn't do two volumes of the proceedings, so I find it very.",
            "Interesting to read and to try and think what happened after that."
        ],
        [
            "In fact, this is a snapshot of what was in machine intelligence research in the year 1958.",
            "The fundamental, but I haven't done the beautiful world clouded I could have done using the.",
            "Tools made here in Vienna, but I did it by hand and there was that he found our pattern recognition heuristic programming common sense conditional probability machines, perceptors learning machines, statistical separability, inductive inference, information retrieval, nervousness, reinforcement.",
            "Many, many of these words are found even in these proceedings of this conference today.",
            "In the same times."
        ],
        [
            "So the obvious about your questions come out as you read this and I will try to ask if you're this question.",
            "So I ask is easy answer is harder, so I will ask you questions and I will let you answer them in your head.",
            "But somehow we can try and reason about together.",
            "Money is a.",
            "Are we any closer to building intelligent machines?",
            "What are the important things that have been done after that meeting?",
            "What are the milestones?",
            "What?",
            "In other words, if we some of us was lucky enough to be able to give an invited keynote speech.",
            "From 2009, in that meeting, in telling them what would they report?",
            "Give 2.",
            "You're given a 45 minutes later like everybody else, saying they tell you how are you doing.",
            "In 2009, what is?",
            "What is important?",
            "What happened?",
            "I think it's a."
        ],
        [
            "Question they would ask and.",
            "I think, and this is machine intelligence.",
            "In the AD 2009.",
            "That audience would certainly be thrilled to hear that today we can retrieve relevant documents by machine.",
            "Just by asking a question, typing some words, we can translate the document fairly well.",
            "We can summarize them.",
            "Software can recommend books.",
            "Software recommended movies.",
            "Computers describe speech, recognize handwriting.",
            "All of these things were on their wish list, and all of these things are possible today.",
            "So the very first piece of news should be that we can do so many things.",
            "That that you were listing as.",
            "Interesting things in by the way.",
            "If you've seen the 2nd.",
            "A little video I showed you by 1973.",
            "That was the list of failures.",
            "That was a AB.",
            "Sir James Lighthill, a mathematician.",
            "That there was asked by his such councils to assess the field of artificial intelligence, to decide if it was worth funding in the future.",
            "He wrote the light, he report that killed a lot of the funding for many years to come, and he was challenged to debate at the Royal Institution.",
            "And in the debate John McCarthy was there.",
            "Don't meet you, Richard Gregory.",
            "And BBC broadcasted and the debate was.",
            "His position was artificial.",
            "Intelligence cannot happen for fundamental reasons.",
            "And that was the list of failures that he presented, unchallenged, because nobody could challenge him in that nobody could transcribe speech.",
            "Translate documents summarizes one in those days recognize handwriting.",
            "And yet we could do now stand in the conference if you have to come from now and tell people.",
            "Yes, it has been done.",
            "That wish list has been many items to be cost of.",
            "The reason I think that would be remarkably useful thing for them.",
            "So all the small things like.",
            "Should we use a classy another Gaussian try?",
            "Or should we use a one normal trainer?",
            "This would be lost in the noise forever.",
            "The news are we can do these things, they work."
        ],
        [
            "So before.",
            "If you wanted to receive recommendations for books.",
            "You go online.",
            "It's such a trivial thing that we don't think about it, but this is the kind of thing would have meant a lot to do that audience you can retrieve their profit items.",
            "You"
        ],
        [
            "Repeat it back up with information.",
            "In terms of images and documents."
        ],
        [
            "I have even tried to translate some material I thought would be useful.",
            "And I know this can be done automatically.",
            "And we shouldn't think that this is obvious.",
            "This is being part of the quest for many years."
        ],
        [
            "So that's the main message, in a way you know some would say part of the mission accomplished.",
            "But"
        ],
        [
            "But the second thing you should say right after that.",
            "Would be things didn't go quite in the way.",
            "Those pioneers perhaps expected.",
            "By this I mean.",
            "It isn't that we understood how humans do those things so well that we implemented it.",
            "It isn't that we are able the way intelligence in humans works, and then we made the machine that does it.",
            "We don't know how we understand the document.",
            "Computers don't under Amazon doesn't understand books and Google doesn't read documents in the way we think.",
            "Nevertheless, we obtained the intended behavior.",
            "By a series of statistical hacks.",
            "Large amounts of data, simple minded algorithms did this for us in all the applications I listed, so this should be, I think the second news piece of news for them.",
            "We did it not in the way you wanted.",
            "We don't know much more than you about how people do it, perhaps, but we can do it.",
            "Statistics, statistical, learning theory or whatever battle recognition quality the way you want it.",
            "Allowed us to to hack.",
            "These things together.",
            "Which."
        ],
        [
            "Perhaps exciting, perhaps disappointing.",
            "So the consideration is that very humble activities such as indexing and clustering and estimating parameters.",
            "Have become the enabling factors of artificial intelligence today and the statistical pattern analysis has actually taken set center stage in the field in the entire field of machine intelligence.",
            "Eating what is a data driven artificial intelligence?",
            "And just to give you a.",
            "Simple example, by no means representing everything, but it's one example of this trend I would like to look at the.",
            "Impressive impact of the very simple Viterbi algorithm for decoding signals in communications."
        ],
        [
            "And this had an impact in our field.",
            "I will just have a look at it.",
            "I am returning.",
            "I have worked in writing this for 50 years and I still enjoy it.",
            "Undo, it'll be working by wireless.",
            "He does not work in machine intelligence is a rich man because of telecommunications, and he has no interest in machine intelligence.",
            "Nevertheless, his impact in our field is being larger than many of the members of this community.",
            "This."
        ],
        [
            "Calculator was introduced in 1960s.",
            "Is part of information theory.",
            "It has to do with the decoding or denoising a message coming through a noisy channel.",
            "Ender you want to do that efficiently in a simple way that you can also implement in hardware.",
            "And if you make assumptions about the statistical nature of the channel and the data that you're sending, you can do it very, very fast.",
            "So we're not going with the details, but the idea is if I send a string of bits generated the Markov chain to a noisy channel, and the channel has noise that is independent of for its symbol.",
            "You can workout the most likely message I sent.",
            "In linear time.",
            "That's under the table contribution.",
            "And it's very simple.",
            "Agreed, it is really a shortest path in a graph.",
            "So it's a dynamic programming example.",
            "Something by the way, that in 1858 it was not yet.",
            "Published because it was in the 59 algorithm.",
            "The shortest path in Melbourne."
        ],
        [
            "But if you look at the position of this paper.",
            "Error bounds for convolutional codes.",
            "It doesn't look, of course like a machine intelligence paper.",
            "But it has had a lot of consequences.",
            "If we can transcribe speech today, it's because of that.",
            "Hidden Markov models are the standard in speech recognition.",
            "And they used to be so good.",
            "I mean, in the most important phase of decoding.",
            "But what is even more interesting is that when after many years of failures in machine translation decided to try something different in nature and give up on linguistic rules and language modeling, try data driven approaches they.",
            "Tend to this kind of papers.",
            "They use the speech recognition model as an example and today.",
            "Documents are translated using.",
            "The mark of either the Viterbi like algorithms, we have a Markov chain assumption on the language and the.",
            "Noisy channel model in the way you represented the translation process.",
            "That is how we do it.",
            "That's how Google did this living translation before.",
            "Be causing it in this way.",
            "And if you hear someone saying that there are 20 or 22,000 genes in the human genome, and this is because somebody in Cambridge used the hidden Markov model to count them.",
            "David Hauser is being the first one to look for genes using hidden Markov models.",
            "Any fears of graphical models in belief networks you are using the junction tree algorithm which is a generalization of the Derby algorithm and the list could go on.",
            "We do a lot of the things in that list because of Italy's algorithm and other things in the list.",
            "Because of similar algorithms, which is the point."
        ],
        [
            "So the question is, is it maybe that this very simple algorithm has been more influential than other celebrated?",
            "Still improving type of Argos, perhaps?",
            "I think it has been more important than.",
            "Not only through improving, but neural networks and evolution in programming and any linguistic analysis that we can do.",
            "At solving those problems.",
            "That is made more of a difference."
        ],
        [
            "So here we go, a series of statistical facts.",
            "Together we did good optimization and a lot of data delivered the intelligent behavior that we can show off today and claim as a success story of the field.",
            "But there are other things we do using similar methods have been listed."
        ],
        [
            "So here I think this is the story of how optimization and statistics became.",
            "Part of the language of.",
            "Artificial intelligence.",
            "They are behind this algorithm and other algorithms.",
            "They're also behind, for example, support vector machines, convex optimization and statistically bonds which are used in text categorization and hand recognition.",
            "There behind graphical models there behind Association mining.",
            "So if you do recommendations automatically for products, you're going to find statistical patterns in your data using very efficient search algorithms and so on.",
            "Because of machine learning is so central in modern AI.",
            "Statistical language and optimization language have become central part of modern.",
            "Artificial."
        ],
        [
            "So we should like it because we work in machine learning and should feel very happy about it and we should really emphasize we have come a long way as a field.",
            "But I think after acknowledging and celebrating and listing the successes and even spelling correction and face detection detection, all these things are done.",
            "OK, so this is the second time we've done it.",
            "It was not in the way.",
            "They expected 50 years ago."
        ],
        [
            "But this is what I would like to discuss with you right now.",
            "Are we perhaps?",
            "Focusing just on those tasks that can be handled by sophistical methods.",
            "You see, when everything was framed as a search.",
            "Process in the solution space during the days of.",
            "Yeah, in the 70s perhaps.",
            "It was easy to try and frame everything as a search process and theory improving the process.",
            "Everything was following the metaphor of chess match even in the navigation of the robot.",
            "In an environment like this would be phrased as a planning process with the searching solution space.",
            "All these things were framed this way and many other policies were overlooked because they weren't fitting.",
            "And that's a different story.",
            "I can't.",
            "I can't explain now, but are we doing the same?",
            "Are we just focusing a lot on those tasks that you can do with data and just?",
            "Essentially, redefining our goals.",
            "That is my concern today are we redefining our goals.",
            "Are we deluding ourselves?",
            "What is the goal of a?"
        ],
        [
            "Well, for me it is to generate intelligent behavior whatever that means.",
            "So we try to define it properly with not much hope.",
            "But I think we should repeat to ourselves.",
            "What is the fundamental goal very often, otherwise we risk to just slowly drift and do whatever we can do and think that is the goal that we're trying to achieve.",
            "What is our game plan as a community to achieve machine intelligence?",
            "I mean, are we going to Polish perceptions for the next 50 years?",
            "Is this the plan?",
            "Are we going to improve and unequal awards?",
            "But he can do the job.",
            "But I are we going to analyze data are we?",
            "Is this what we are about?",
            "Data analysis?",
            "'cause this is petitions and.",
            "They are very serious about it.",
            "They want to be the one I think that not only this is not our mission to analyze data.",
            "Statistics is anyway not probably sufficient to achieve the fundamental goals that are to generate and understand intelligent behavior in naturally in future systems.",
            "So this is what I would like to discuss a little bit with you.",
            "In the next part of the presentation."
        ],
        [
            "So here is very humble, pragmatic and I don't take it too seriously.",
            "Definition of intelligent behavior.",
            "I think an agent can be displaying an intelligent behavior if it can pursue its goals.",
            "In a complex environment, by making informed decisions and adapting to situations that were not directly specified by the designer.",
            "I use this definition because I want to move everything away from this idea of human like intelligence.",
            "This is very important for me.",
            "If we insist in defining intelligence by thinking that human intelligence we make a terrible mistake.",
            "Intelligence is being around for literally.",
            "Millions, probably billions of years before the 1st human appeared before human language and logic were invented, intelligence existed.",
            "And.",
            "So if you have a name, an Organism escaping, hunting, achieving goals, using information from its environment to make informed decisions, to draw inferences, and to achieve goals, that is why intelligence evolved in the first place.",
            "And I say almost my student chicken crossing the road is a better example than two in test.",
            "Chicken is listen to noise seeing.",
            "Planning, making decisions, avoiding obstacles in admin.",
            "Trying to survive across their order.",
            "That is why we have a brain.",
            "Other tasks are nice.",
            "Filtering spam is nice, but I don't think our brain evolved.",
            "For filtering spam, although some way.",
            "So here is my."
        ],
        [
            "This is why I take the voice down.",
            "You can tell him learning to use videos.",
            "Here is an agent.",
            "Behaving.",
            "You don't environment.",
            "Sing, Sing is environment using various channels.",
            "Getting information in.",
            "And using the information to make decisions and the decisions are to achieve specific goals.",
            "I can see the goal coming now.",
            "And that's the agent.",
            "There you go.",
            "So this stuff has been going on for.",
            "Millions or billions of years.",
            "In the oceans fast on land after this is where information posting has been refined and refined and refined and sensitive.",
            "Information and generational behavior.",
            "And that is where.",
            "Here no brain, no, never system.",
            "Why you care?",
            "You're trying to eat one prokaryote.",
            "Sing, sing chemically.",
            "And.",
            "You can see there is an agent with a goal using information to achieve a goal, making decisions in conditions that any but they couldn't predict it too complex of a combination.",
            "They were last time other agent.",
            "No level system, no brain again.",
            "Information gathering in decision making to achieve goals.",
            "This is an algorithm being executed right now, but the system they do that all the time.",
            "Ender goal achieved.",
            "The plant can.",
            "Move to the next goal.",
            "That is probably to go the right leaf and the right through fruit in the right place at the right time, making the Flowers in the right moment, and so on and so forth.",
            "Information posting.",
            "And decision making are commonplace in nature.",
            "And understanding how this behavior is generated is very important."
        ],
        [
            "So this is what it may seem.",
            "I do it on purpose.",
            "I want to say let's focus on agents that make decisions and have a behavior.",
            "And you will have much less confusion than when you try to define if generating a piece of music uses the same type of intelligence as solving an education problem, many of the things we do everyday also, as humans are the same nature as those videos we've seen very few of the things we do are of symbolic deliberative, declarative, logical inference, type of processing, very, very few.",
            "And when we try to build robots using logical reasoning, we failed.",
            "When we decided that we can make intelligent systems by just listing all the possible in declarative form, all the possible facts that are needed, we started listing endless an endless lists of facts and they're still not complete.",
            "Now 30 years after the beginning, and perhaps if you faced in that way you can't deal with the ambiguities and uncertainties of the real world.",
            "It's very hard.",
            "But I think that the those tasks are also not statistical tasks.",
            "They're not apart recognition task.",
            "They're not in of the sort of an input output mapping that you are so good at emulating today.",
            "So our success in the other fields has been like this.",
            "We give you a lot of French and English documents.",
            "You learn the map will give you a lot of speech and text.",
            "You learn them up.",
            "We can give you handwriting images of handwriting and the labels learn it.",
            "This input output protocol for machine learning has done so much to achieve the goals we've seen before, but perhaps it is not sufficient to model intelligent behavior even of the simple nature that we've seen here, let alone everything else.",
            "The more complex types of behavior we should be emulating.",
            "So, and it's funny because the data driven AI actually would be compatible with the.",
            "Concepts that are other than data analysis.",
            "It doesn't have to be statistics all the time.",
            "We should start introducing ideas from control theory, dynamical systems, game theory.",
            "And they don't necessarily reduce the statistics.",
            "And the eye does not reduce.",
            "Do statistics.",
            "So this is a very important thing because we are in the moment in which we achieved many of the goals we were working on and now the choice is either we keep on.",
            "Polishing essentially.",
            "Or we move to the next task."
        ],
        [
            "And I think modeling the interactions will not reduce the statistics interactions with an environment to generate behavior.",
            "For example, Amazon OK, Amazon is doing better mining in it's not log files, but there is a feedback loop.",
            "It is enormously important.",
            "System is making suggestions to the user in making decisions, and the system is using this information to make suggestions and the interaction goes on.",
            "When you have two things interacting with each other and generating each others data and Co evolving accord acting, you don't have IID sampling of any sort.",
            "For example, this is just their stability issues.",
            "Perhaps in that simple case there aren't.",
            "But as soon as you scale it up into many agents, you start talking about.",
            "Ability and control concepts that are very important interact."
        ],
        [
            "Can be found also within a system.",
            "If you build a large scale architecture.",
            "Made many models, which is what I think we should be doing now if it so that we're good in translating, classifying, transcribing, summarizing.",
            "If we have achieved a decent level in those tasks, my question is how do they go together to make an intelligent system and suddenly you have a lot of adaptive models interacting with each other, generating each others data.",
            "Having complicated feedback loops and you have issues of stability and error propagation and error control, how do you generate a system made of noisy modules to operate in a noisy environment and still deliver a decent behavior?",
            "So this I think a very important part of what we do now.",
            "If you're building proper large scale intelligence systems.",
            "Modeling all this interaction.",
            "It made."
        ],
        [
            "This task has been properly solved by natural systems over there.",
            "Over the years.",
            "And I don't believe this can be best formalized as input, output pattern recognition tasks.",
            "That's my personal impression.",
            "But many ideas exist already out there from many fields, and they are perfectly compatible with what we are doing.",
            "Many ideas exist in the logical systems that.",
            "That are very worthwhile exploring when you model behavior generation for example.",
            "And by the way, also ideas that come from other fields, even some of the earlier things done in AI in some conditions can be very.",
            "Can be more indicated of course."
        ],
        [
            "So here is my.",
            "Moment of where I stop for a minute.",
            "Modeling and creating intelligent behavior will require concepts that go beyond statistical pattern analysis and.",
            "Many concepts.",
            "That are equal to.",
            "To achieve this task involved the dynamic nature of the task and probably they don't videos directly likely to.",
            "To statistics in the general sense of.",
            "Analyzing data in.",
            "I think this is actually starting to happen, not say should happen.",
            "I see it happening now.",
            "If you look around it.",
            "This is happening in these days and just report that we're moving on to some extent.",
            "Of course they don't recommend to get out get out of the pattern recognition here."
        ],
        [
            "But there's another thing separate totally that I think is interesting.",
            "That would be worthwhile reporting if you were too.",
            "Give it talking at 1058 and tell them how is life today now."
        ],
        [
            "My next video I am.",
            "I'm sure it will not work, so let me.",
            "Change one thing because I know what that is.",
            "There you go.",
            "I want the full screen.",
            "And this always wants the small screen, so I don't know why.",
            "Here is my latest piece of video.",
            "I know it was not necessary, but these are some of the journals in machine intelligence.",
            "This is another lot.",
            "Every cut is a different page, different list.",
            "These are Jonas.",
            "These come out every month, perhaps with bunch of articles inside.",
            "And these are some really literally a subset of conferences.",
            "I don't know how many of these conferences do you go to or how many people do not go there, but each of them looks like this one.",
            "Each of them has two 300 people.",
            "Maybe they're not all of them, but they proceedings they have at the banquet.",
            "They have the tape they have.",
            "These are all the same.",
            "These are all pieces, so if I was to report how does machine intelligence look like in 2980?",
            "I think this picture would come to mind.",
            "Ender and this is, I think, are an important picture because that this is for those of you who are not over.",
            "Western M dissent.",
            "This is the way God made sure people don't achieve anything right.",
            "We were trying to achieve too much and God said OK, fine.",
            "Let's kids 100 conferences speaking different languages and.",
            "That's the way you do it machine today.",
            "That is a concern.",
            "That is strange, that is.",
            "The fragmentation is enormous.",
            "I don't say people shouldn't specialize, they just say.",
            "Are we exceeding so diverse?"
        ],
        [
            "I like it, but not if it hampers comparability.",
            "We need to know if somebody is achieving something better than somebody, so perhaps grounding the field in some grand grand challenge might provide that.",
            "And this is actually coming again.",
            "The web is helping a lot.",
            "Robotics is acting by format.",
            "Is it in these things are grounded in field in keeping us honest.",
            "Then"
        ],
        [
            "So here is the question.",
            "You know what is our game plan?",
            "What are we going to do next?",
            "If we have to build intelligent behavior or understand intelligent behavior in natural systems."
        ],
        [
            "I think many things are moving and.",
            "From the theoretical point of view.",
            "In learning the emergence of string theory has really helped.",
            "To create.",
            "Single, powerful dominant way to do things in learning.",
            "Why not?",
            "I think this is coming now.",
            "Also in more general AI tasks and more general ideas can be included.",
            "In that framework in engineering, I think obviously I like it a lot when I see people making systems and putting things together and understanding at the next level up.",
            "How Unite behavior here?",
            "There was a beautiful demo session this session.",
            "While many people were making systems and when you make systems you don't just hack things together, you are using modules that are the result of previous research.",
            "But the way you combine them needs a lot of research in its own right to ensure all the things said before block error propagation.",
            "Keep stability, make sure the system behaves as a system in an intelligent way, and I would love it if next year.",
            "In this email we could see because we could see papers of people making starting and modeling the behavior of large scale intelligence systems that needs a lot of attention by theoreticians in this moment.",
            "And the big conceptual step we made, I think, is that we have moved away from this anthropocentric emotional intelligence, so we're more ready to deal with Google and Amazon as intelligent agents.",
            "Just the same sort as the crayfish we've seen before.",
            "They also gather information positive and make decision and achieve their goals.",
            "Amazon and Google are not different from those videos in some respect, and yet they wouldn't pass doing this test, and yet nobody cares.",
            "And that's the kind of I think progress we made."
        ],
        [
            "So.",
            "Incorporating all of these ideas.",
            "We take us closer to the natural systems.",
            "Closed biology.",
            "We might become finally relevant to people who actually study behavior in natural systems because it is weird that actually diligence has so little to say to people that study animal behavior, for example.",
            "And by the way, it would mark a return to some of the ideas that were typical in cybernetics.",
            "And many of the people in the meeting would be pleased to hear that we are.",
            "Moving a little bit.",
            "Partly full circle.",
            "But then."
        ],
        [
            "Here's my biggest question of all the 1st that came to mind when I was reading.",
            "The proceedings.",
            "Although, as they say that came after the first thing that came to mind, probably because I'm so Nello centric, perhaps is what of my work.",
            "Would be relevant in 2059.",
            "'cause I was in blood.",
            "Manske Selfridges and the others.",
            "Their papers in that.",
            "That would have really affected the way we think today.",
            "In the proceedings of this conference.",
            "What is affecting?",
            "The next 50 years.",
            "And again, if we do something, I take this to mean or to you, because it's night already.",
            "But I need to tell me often.",
            "If something I do doesn't have a chance of affecting the next 50 years.",
            "Should I do it?"
        ],
        [
            "Little Carly you want to videos again?",
            "I know I can put videos.",
            "It's about 3 comments, so I guess you nicely complemented the talk from yesterday which was.",
            "Charlotte was going on in AI or participate I from top down perspective.",
            "While this was his bottom up perspective, data driven perspective.",
            "So I guess we can also observe evolution and development from this top down perspective and that kind of merger of two areas.",
            "Just why maybe Mark didn't mention this yesterday with my feeling here is based on areas many many times happens that secret is.",
            "It's algorithms how keep the ceiling and that case and how we can extend nicely expense.",
            "Performance with a little bit of top down element which is also approaching and the same great top down AI is well hitting the bottom in many ways so economically degrees extremely expensive and so on, and that agreement techniques and machine learning can somehow help a lot.",
            "So this is one piece.",
            "Honest, I agree.",
            "Actually I we needed the glue to put the pieces back together.",
            "I'm not sure that the glue is going to be eventually logic AI, but we do need a framework to put things together.",
            "And yesterday was suggesting was made.",
            "Yeah.",
            "AI is the goal and.",
            "It is the worst goal, but it's far from being the only one.",
            "I mean I can help society in a way which is not a high mean.",
            "The Golden elephant is not communicated.",
            "Vision, fly people and be useful.",
            "So if I can with the statistical data mining achieve.",
            "Society I don't care so much if it's really irritating, intelligent behavior or not, so it's not that it's not worth the goal to be right, but I think it's far from being lonely.",
            "And negative statements to say that you are not in it with.",
            "Oh yes, OK.",
            "I probably I.",
            "Probably I can't deal with too many negations in the same sentence.",
            "So we are not not visit mutating them.",
            "Know, understood, understood.",
            "I was joking, it is.",
            "It is very clear.",
            "But I do like to tease you.",
            "I I think that I I didn't want to suggest that our goal is to imitate nature.",
            "I want to say there is a class of important behaviors that we are trying to model which are what we call intelligent behavior.",
            "And they will not be achieved by pure data analysis.",
            "You can do a lot and they imitating this behavior.",
            "It doesn't have to reproduce nature, I just said there are some behaviors I want to be able to let loose and heal, and I know it will end up in the sagace next year.",
            "I don't know how I know the system has a goal and will achieve it.",
            "That is a goal achieving behavior.",
            "That could be requested in an official system.",
            "I want to have an agent on the web that fully autonomously achieve some goals interacting with people and making decisions and learning and adapting, and I don't care if we build the web agent in a natural looking way.",
            "But the behavior I want is goal achieving goal oriented behavior and better is a different goal from that analysis.",
            "So you demonstrated very nicely the great diversity of the broad machine intelligence community, and he also suggested that one way to try to build them together is to consider some grand challenges.",
            "So could you share some thoughts and possible grand challenges with maybe a 50 year vision?",
            "Or if not, maybe attending 10 is easier.",
            "Five is even easier if you let me.",
            "Where it?",
            "I didn't have time to discuss this, but.",
            "It is obvious that an intelligent agent can manifest its behavior once it is immersed in an environment where it is to achieve its goals.",
            "You don't have general purpose in vitro notions of intelligence, so I think the opportunities we have from the web are incredible.",
            "That is a very natural playground for at Fishel intelligence.",
            "Obviously, because it's a world it's digital.",
            "But it's complex, but it's noisy.",
            "But it's not the physical world that is to me, the obvious place where things are going to happen.",
            "And in that happening by the way, companies are not waiting for pool academics to catch up.",
            "There are 10 years ahead, and they're doing it now.",
            "We have to.",
            "To do it too.",
            "Intelligence is going to happen on the web and the challenges are coming.",
            "You know, assisting with this goal?",
            "For example, making more money is Amazon Amazon's system making.",
            "At making decisions, using information, adapting and learning, and trying to maximize the income, these are examples.",
            "Over autonomous decision-making systems, I think that direction.",
            "Of course it's at the beginning, but that direction has a chance to bring things together an and clean up if something works.",
            "Or something doesn't work, it will show.",
            "So that's the place we can really compare if things are working.",
            "These are real world conditions, scalable, adversarial, noisy conditions.",
            "And besides selling books, there are many things you can do in digital worlds.",
            "I'll give it a second life synthetic world and the physical world, but you need an environment where things are done so either physical or digital world are going to be the playground for intelligent systems.",
            "This is where you get the grounding.",
            "Everything else is 1 ended up.",
            "It's ungrounded and runs the risk of being self defining and self pleasing and self.",
            "Central welding, so to speak.",
            "Yes, I was surprised to see that you think that physical methods of achieving machine translation.",
            "No you can.",
            "Thanks for real.",
            "Questions.",
            "I I think we can do very well, but I am sure that you recognize instantly a machine generated document.",
            "It takes a second.",
            "It is very.",
            "It is little.",
            "I mean you can instantly recognize a bad translation comes out of the machine.",
            "You know it nevertheless.",
            "I'm.",
            "You can input an English document and get out a decent Slovene document.",
            "In the example I showed.",
            "And.",
            "You can output the summary again, not perfect with all the mistakes that you get in the summary of the type, but the point is that that is the state of the art today.",
            "Hello.",
            "Like it, I think it was not visited by anything because but but I think most people would acknowledge that was going to be useful, usable.",
            "The fact that you can make a business on top of it, it means that it works.",
            "It doesn't work with like a person, but it works sufficiently.",
            "Lighting was a very interesting person.",
            "I never met him, but David met him so I knew about him and he was a remarkable mathematician in the UK and he.",
            "It came to mind when I saw the island here, because he he eventually after a very successful career, died when he was a.",
            "In old age, trying to swim all around an island.",
            "And it's pretty remarkable.",
            "Things that I would never try to, even if it was 18.",
            "And that's what Michael person.",
            "But he was really against and recommended.",
            "There are online versions of this video.",
            "It's a very nice debate that debate.",
            "GNU theory.",
            "Aspect.",
            "Systems do you have any thoughts about where that might come from?",
            "All you know, what ingredients would be useful?",
            "Yeah, I don't know much, but I do know that as soon as you have feedback loops, you run the risk to amplify noise.",
            "And so as soon as you have a system that is making its own data, for example, or stuff like this, your feedback loops.",
            "This dynamics must be kept under control.",
            "And the data.",
            "Eventually is a central idea that comes from control theory and dynamical systems to study the stability of systems that have feedback dynamics, so that cannot be avoided as soon as you build a large enough thing.",
            "Even in my little small lab, we have a small experiment going on and we have a few dozen modules.",
            "Boxing news data and generating each others data.",
            "Training on each other's output.",
            "We already have feedbacks.",
            "Or we try to avoid them, but it's deliberately trying to prevent the interaction loop from closing.",
            "One is to start thinking dynamically.",
            "That is for sure.",
            "You were emphasizing the importance and impact of the Chinese things, so the algorithms.",
            "Tricks or hacks as you called them, and I was surprised that you from there came to the systems because.",
            "I expected you would move to this distributed nature or nature of intelligence, that is that putting all these things together no longer needs to beach one centralized system as the people in the 50s expected.",
            "Bridge.",
            "Little tricks we come to an overall setting and.",
            "That that really makes intelligent behavior occur at several places and even integrated into the environment.",
            "So the environment agent is not that separated.",
            "Right, as in.",
            "And so I wondered with the notion system you included, this distributed in network computing and intelligent environments and always.",
            "Obviously, obviously whenever you have but the condition for them to be a system is that they must work together.",
            "Having a bunch of adaptive models in an isolation doesn't make them a system, they become a system.",
            "If they communicate.",
            "And then they do have a system.",
            "It doesn't matter if they are in it.",
            "Physically together they can be a swarm of agents or swarm robots.",
            "You could have a complex.",
            "System self organizing, whatever mix of people in machine.",
            "It makes it the system is if they can.",
            "If they communicate and cooperate.",
            "To achieve their goals.",
            "So I think of.",
            "So to follow up cabinets question and also the systems issue, I mean Providence is a big problem right away.",
            "Providence had trust.",
            "So is that 10 year challenge?",
            "Is that 50?",
            "Providence.",
            "Oh, I was thinking.",
            "Oh, I'm the origin of the data.",
            "I think you have to design the system assuming that you will have other size, giving the data to you.",
            "Nothing short of that can scale, and that is part of what went wrong in the past.",
            "We must learn from it.",
            "You can't build the system and hope that there is going to be true and false, and that is never going to change.",
            "The system must be designed from the first minute in the assumption that you will receive.",
            "Other sale information and you will have to revise your beliefs all along.",
            "Short of that.",
            "You don't have any robust autonomous.",
            "That is why you want to go in the real world and use the web for example.",
            "Otherwise you go back into your synthetic block world where you have a cube to be put on another cube in a white environment with constant lighting.",
            "We've done that.",
            "It's obvious that.",
            "Even the notion of two an false statement.",
            "I have some.",
            "Yeah I I know some students would say that notion is so 80s that is so 1980s two or false statements.",
            "Dynamics.",
            "Also also not all about but also don't.",
            "Well, summer.",
            "Stepping basically static.",
            "The manager got his account manager.",
            "Yeah.",
            "You, you're getting this feedback.",
            "That problem is instantly difficult.",
            "There is a community that started to study this matter.",
            "General artificial Intel.",
            "Yes, I I like the bandit.",
            "I like enforcement learning.",
            "I know there are lots of people working in these things and I'm not claiming that we haven't done anything we should be doing it.",
            "I think these things are happening.",
            "I wanted to actually emphasize it.",
            "This is the next step and people are doing it enforcement abandoned policy.",
            "As for General Fishel, intelligence like to say.",
            "The noise to signal ratio is such that I don't understand what's going on to be honest, but I'm sure it's something we cannot do it.",
            "I just put the moment I've been trying to follow up and.",
            "It takes a lot of patience, so I can't.",
            "I can't say much.",
            "Well then again, I think we should thank the organizers alot for this impressive.",
            "Performers, thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We had two activities this morning.",
                    "label": 0
                },
                {
                    "sent": "Two is we announced the winner for best demo or so.",
                    "label": 0
                },
                {
                    "sent": "Start with the private talk.",
                    "label": 0
                },
                {
                    "sent": "It's my pleasure to introduce Professor Miller Cristiani this journey he's currently prefers.",
                    "label": 0
                },
                {
                    "sent": "Regardless, intelligence Bristol University of Bristol.",
                    "label": 0
                },
                {
                    "sent": "He was previously.",
                    "label": 0
                },
                {
                    "sent": "Statistics at UC Davis.",
                    "label": 0
                },
                {
                    "sent": "He's also visited Berkeley and Royal Holloway in London.",
                    "label": 0
                },
                {
                    "sent": "No one ever has a number of interest.",
                    "label": 0
                },
                {
                    "sent": "Computational pattern analysis, genomics, computational intelligence, artificial intelligence, especially his relationship with statistics.",
                    "label": 0
                },
                {
                    "sent": "Recently, he's also been looking at bias in the media.",
                    "label": 0
                },
                {
                    "sent": "Now many of you should not design, which is easy.",
                    "label": 0
                },
                {
                    "sent": "Offer two of their best known books.",
                    "label": 0
                },
                {
                    "sent": "He's also an author of the book in Genomics.",
                    "label": 0
                },
                {
                    "sent": "And as a community member needs an editor in both Jamilla and Jer.",
                    "label": 0
                },
                {
                    "sent": "Now he's quite a popular file that invited Sessions, so he gives talks in a wide range of areas and your networks artificial intelligence machine learning.",
                    "label": 0
                },
                {
                    "sent": "So without further ado.",
                    "label": 0
                },
                {
                    "sent": "To put this talking in context, this talk is about the future.",
                    "label": 0
                },
                {
                    "sent": "Final session.",
                    "label": 0
                },
                {
                    "sent": "Conference thank you, thank you.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you rifle.",
                    "label": 0
                },
                {
                    "sent": "Beautiful introduction.",
                    "label": 0
                },
                {
                    "sent": "Before I start, I would really like to thank.",
                    "label": 0
                },
                {
                    "sent": "The local organizers more than all the organizers, it is being an incredibly impressive.",
                    "label": 0
                },
                {
                    "sent": "Series of days and.",
                    "label": 0
                },
                {
                    "sent": "I'm very impressed that you set a very high standard for those who will follow next year.",
                    "label": 0
                },
                {
                    "sent": "And after that and then.",
                    "label": 0
                },
                {
                    "sent": "The only negative side of having a newsletter is that I don't get to go on the newsletter because it's the last day today and everything nice reading on it.",
                    "label": 0
                },
                {
                    "sent": "And so I am on it all.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 0
                },
                {
                    "sent": "I'll save you think of everything.",
                    "label": 0
                },
                {
                    "sent": "I just stay there because my computer works like Shy Ben Davis laptop and I may need your input just like you did.",
                    "label": 0
                },
                {
                    "sent": "So it might not work, so I might have to reprogram something as we go.",
                    "label": 0
                },
                {
                    "sent": "Let's see if this is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can I have a?",
                    "label": 0
                },
                {
                    "sent": "I have used my little.",
                    "label": 0
                },
                {
                    "sent": "Time machine.",
                    "label": 0
                },
                {
                    "sent": "Let's see if it works.",
                    "label": 0
                },
                {
                    "sent": "You know, simple fill out the assets of Bristol, limbs doctor greywater neurologist who makes robots as a hobby.",
                    "label": 0
                },
                {
                    "sent": "They are small, but he's undressed enough to look like them because the tortoises and so claiming they have that inside being designed that they respond to stimuli are right on track is light.",
                    "label": 0
                },
                {
                    "sent": "And she sees a metric center which rotates around her body.",
                    "label": 0
                },
                {
                    "sent": "When light strikes the sample driving and steering mechanism sensor high in Georgia.",
                    "label": 0
                },
                {
                    "sent": "If she brushes against any object in South Park.",
                    "label": 0
                },
                {
                    "sent": "Contacts are operated the turn the steering away and so automatically she takes avoiding action.",
                    "label": 0
                },
                {
                    "sent": "He worked exactly the same way.",
                    "label": 0
                },
                {
                    "sent": "Electronic toys work exactly as they have a simple two so nervous system.",
                    "label": 0
                },
                {
                    "sent": "And that would more so they will be able to do many more tricks already else has one Apple help with her batteries begin to fail the automatically runs home to her kennel, but charging up and incontinence could deliver much better luck.",
                    "label": 0
                },
                {
                    "sent": "Sciences.",
                    "label": 0
                },
                {
                    "sent": "Normal stuff for money had been spent on the age of language translation by computer.",
                    "label": 0
                },
                {
                    "sent": "Is that in computer recognition of human speech?",
                    "label": 0
                },
                {
                    "sent": "400 level and in automatic proving of theorems in higher mathematics.",
                    "label": 0
                },
                {
                    "sent": "So I would like you to feel very much like 1950s because the idea is to take you back for a moment to 1950s and try to.",
                    "label": 0
                },
                {
                    "sent": "See a few other things that were going on and then we're going to come back to the second gentlemen of 1973.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in November 1958.",
                    "label": 0
                },
                {
                    "sent": "Just outside of London in Teddington.",
                    "label": 0
                },
                {
                    "sent": "At the National Physical Ability Remarkable meeting took place.",
                    "label": 0
                },
                {
                    "sent": "In where were about 200 people?",
                    "label": 0
                },
                {
                    "sent": "A meeting not unlike this one, actually 200 people for three or four days met.",
                    "label": 0
                },
                {
                    "sent": "To discuss the topic of.",
                    "label": 0
                },
                {
                    "sent": "Can we mechanize thinking?",
                    "label": 0
                },
                {
                    "sent": "Can we build thinking machines can machines thing?",
                    "label": 0
                },
                {
                    "sent": "And let a group of people included cyberneticist, biologists, mathematicians and.",
                    "label": 0
                },
                {
                    "sent": "Early artificial intelligence researchers and the consequence of that meeting are felt still now.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "I would like to spend some time looking at what was discussed because it has implications for us.",
                    "label": 0
                },
                {
                    "sent": "So these are the two volume proceedings just like this.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Two volume proceedings here, and that happened nearly exactly 50 years ago, so it's a good comparison.",
                    "label": 0
                },
                {
                    "sent": "This symposium, the preceding say, was held to bring together scientists studying artificial thinking, character in pattern recognition, learning, mechanical language translation biology, automatic programming, industrial planning, and clerical mechanization.",
                    "label": 0
                },
                {
                    "sent": "It was felt that the common theme in all these fields was the mechanization of thought processes and data into exchange of ideas between these specialists would be very valuable.",
                    "label": 0
                },
                {
                    "sent": "And in fact.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That was a good time to meet for those experts in 1958 there was already a research community in machine intelligence in the US and the UK, and it wasn't even the beginning of it because I don't know you had died already four years before.",
                    "label": 1
                },
                {
                    "sent": "Cybernetic movement was ten years old, at least if you count Venus book as the beginning.",
                    "label": 0
                },
                {
                    "sent": "Which is pessimistic.",
                    "label": 0
                },
                {
                    "sent": "The movement started before 1948.",
                    "label": 1
                },
                {
                    "sent": "The Macy conferences had ended there at the club stop meeting.",
                    "label": 1
                },
                {
                    "sent": "This was actually a moment in which one entire chapter was coming to an end and another chapter was starting, but in that meeting all the various communities of machine intelligence came together to discuss.",
                    "label": 0
                },
                {
                    "sent": "The question of can machines think?",
                    "label": 0
                },
                {
                    "sent": "From the United States knew wind was coming.",
                    "label": 0
                },
                {
                    "sent": "It was called artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "Two years before a meeting at Dartmouth College used this name for the first time, but if you look at the.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Conference it was organized along very familiar lines.",
                    "label": 1
                },
                {
                    "sent": "By today's standards, you find decisions on general theoretical principles, machine translation, speech recognition.",
                    "label": 1
                },
                {
                    "sent": "What are you learning?",
                    "label": 0
                },
                {
                    "sent": "And biological and industrial applications.",
                    "label": 0
                },
                {
                    "sent": "The only parallel tracks or entire conference where the applications in the last day.",
                    "label": 0
                },
                {
                    "sent": "So you wouldn't feel very out of place.",
                    "label": 0
                },
                {
                    "sent": "Perhaps if you were to be in Teddington in 2000 in 1958.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Any fucked?",
                    "label": 0
                },
                {
                    "sent": "The people that took place in this meeting are very well known to most of us.",
                    "label": 0
                },
                {
                    "sent": "You would find Frank Rosenblatt, the inventor of the perception.",
                    "label": 1
                },
                {
                    "sent": "Who presented perceptron algorithm?",
                    "label": 1
                },
                {
                    "sent": "Arthur, Samuel, the author of the Fast Learning Algorithm Checker Player on the IBM machines.",
                    "label": 0
                },
                {
                    "sent": "Marvin Minsky longtime evangelist of artificial intelligence for 50 years following.",
                    "label": 0
                },
                {
                    "sent": "Oliver selford of the Selfridges family from England.",
                    "label": 1
                },
                {
                    "sent": "Who actually where Americans in Norwegian and the author of the Pandemonium Architecture so prototype for all?",
                    "label": 0
                },
                {
                    "sent": "Agent based evolutionary based.",
                    "label": 0
                },
                {
                    "sent": "Met with John MacArthur, the inventor of artificial intelligence definition and Lisp, among many other things.",
                    "label": 0
                },
                {
                    "sent": "Donald Mackay, father of David Mackay, Cyberneticist information theorist.",
                    "label": 0
                },
                {
                    "sent": "Gay Walter.",
                    "label": 0
                },
                {
                    "sent": "The gentleman you seen in the first video.",
                    "label": 0
                },
                {
                    "sent": "Or both assistant overall eclectic.",
                    "label": 0
                },
                {
                    "sent": "From Bristol, Warren McCulloch, new office geologist from the McCulloch and Pitts model also.",
                    "label": 0
                },
                {
                    "sent": "Ashby Cyberneticist, inventor of the Omen stuff and the concept of homeostasis and so many other people met to discuss this question.",
                    "label": 0
                },
                {
                    "sent": "So many ideas that we use today.",
                    "label": 0
                },
                {
                    "sent": "Come from those people.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So I find it in.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thing to just look at Sam.",
                    "label": 0
                },
                {
                    "sent": "I will not take you to the proceedings I it will be boring talking.",
                    "label": 0
                },
                {
                    "sent": "It's the last day, but I would like to see some pages of the proceedings just to see what was the general idea that generally the first session, the general one I think must have been negotiated carefully.",
                    "label": 0
                },
                {
                    "sent": "It is actually presenting intermeshed.",
                    "label": 0
                },
                {
                    "sent": "Dogs from artificial intelligence and cybernetics, and again so you have Minsky Mackay, Matt McCarthy, our speed up and they discuss interesting questions.",
                    "label": 0
                },
                {
                    "sent": "You Ristic programming common sense reasoning using probability to model biological behavior, and so on.",
                    "label": 0
                },
                {
                    "sent": "John McCarthy was already talking about programming with Common Sense, which would become a theme in the furlough or slash bill.",
                    "label": 1
                },
                {
                    "sent": "We know he talks about learning in biological systems.",
                    "label": 0
                },
                {
                    "sent": "It was a very interesting.",
                    "label": 0
                },
                {
                    "sent": "Conference that Estock was by.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We missed you.",
                    "label": 0
                },
                {
                    "sent": "I will not stop there, but you can see already.",
                    "label": 0
                },
                {
                    "sent": "He would say particular attention is given to possibly involving pattern recognition, learning, planning ahead, and the use of analogies in models.",
                    "label": 1
                },
                {
                    "sent": "A machine might improve itself by adding to its collection of problem solving methods and so on and so forth.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the most interesting things I find in the later chapters in the speech recognition chapter, there was a group of people from UCL.",
                    "label": 1
                },
                {
                    "sent": "John might even be sitting in their office.",
                    "label": 0
                },
                {
                    "sent": "And never suggested that in order to improve speech recognition.",
                    "label": 1
                },
                {
                    "sent": "This is 50 years ago.",
                    "label": 0
                },
                {
                    "sent": "You probably should collect frequencies of engrams and use them to model the word transition probabilities and use that to improve the quality of your transcription.",
                    "label": 0
                },
                {
                    "sent": "To complement the acoustic information that you have, something that we do today.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The chapter was going to discuss it was actually the machine learning one for this conference.",
                    "label": 0
                },
                {
                    "sent": "Is the Machine learning conference and thank you also block presented his perceptron algorithm some variations and it was pretty much done when he was presented a lot of other things.",
                    "label": 0
                },
                {
                    "sent": "Happened after, but the basic algorithm was presented in this meeting.",
                    "label": 0
                },
                {
                    "sent": "Selfridge presented the pandemonium system, and it's interesting because he tested it on a task of handwriting recognition and letter recognition, which is using a similar protocol today, training and testing, and they all usual things.",
                    "label": 1
                },
                {
                    "sent": "That was done in that.",
                    "label": 0
                },
                {
                    "sent": "Paper and do not extend the undo implemented her in Harbor Wave, an algorithm of roughly about 2.",
                    "label": 0
                },
                {
                    "sent": "Extracting conditional probabilities from.",
                    "label": 0
                },
                {
                    "sent": "Something that we would call today Association mining.",
                    "label": 0
                },
                {
                    "sent": "If you want it I can show you so the data miners here might be interested in this.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The architecture was able to count the frequency of items set.",
                    "label": 0
                },
                {
                    "sent": "ABC&AB as well and then working out the ratio between accessing computing the conditional probability of item C. Being present if items A&B are present.",
                    "label": 0
                },
                {
                    "sent": "They were talking about items that with this expression, but that was the algorithm and it was essentially the hardware equivalent to the Peoria Association mining algorithm.",
                    "label": 1
                },
                {
                    "sent": "And many many other things can be seen in that in that.",
                    "label": 0
                },
                {
                    "sent": "It doesn't do two volumes of the proceedings, so I find it very.",
                    "label": 0
                },
                {
                    "sent": "Interesting to read and to try and think what happened after that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In fact, this is a snapshot of what was in machine intelligence research in the year 1958.",
                    "label": 0
                },
                {
                    "sent": "The fundamental, but I haven't done the beautiful world clouded I could have done using the.",
                    "label": 0
                },
                {
                    "sent": "Tools made here in Vienna, but I did it by hand and there was that he found our pattern recognition heuristic programming common sense conditional probability machines, perceptors learning machines, statistical separability, inductive inference, information retrieval, nervousness, reinforcement.",
                    "label": 1
                },
                {
                    "sent": "Many, many of these words are found even in these proceedings of this conference today.",
                    "label": 0
                },
                {
                    "sent": "In the same times.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the obvious about your questions come out as you read this and I will try to ask if you're this question.",
                    "label": 0
                },
                {
                    "sent": "So I ask is easy answer is harder, so I will ask you questions and I will let you answer them in your head.",
                    "label": 0
                },
                {
                    "sent": "But somehow we can try and reason about together.",
                    "label": 0
                },
                {
                    "sent": "Money is a.",
                    "label": 0
                },
                {
                    "sent": "Are we any closer to building intelligent machines?",
                    "label": 1
                },
                {
                    "sent": "What are the important things that have been done after that meeting?",
                    "label": 0
                },
                {
                    "sent": "What are the milestones?",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "In other words, if we some of us was lucky enough to be able to give an invited keynote speech.",
                    "label": 0
                },
                {
                    "sent": "From 2009, in that meeting, in telling them what would they report?",
                    "label": 0
                },
                {
                    "sent": "Give 2.",
                    "label": 0
                },
                {
                    "sent": "You're given a 45 minutes later like everybody else, saying they tell you how are you doing.",
                    "label": 0
                },
                {
                    "sent": "In 2009, what is?",
                    "label": 0
                },
                {
                    "sent": "What is important?",
                    "label": 0
                },
                {
                    "sent": "What happened?",
                    "label": 0
                },
                {
                    "sent": "I think it's a.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Question they would ask and.",
                    "label": 0
                },
                {
                    "sent": "I think, and this is machine intelligence.",
                    "label": 0
                },
                {
                    "sent": "In the AD 2009.",
                    "label": 0
                },
                {
                    "sent": "That audience would certainly be thrilled to hear that today we can retrieve relevant documents by machine.",
                    "label": 1
                },
                {
                    "sent": "Just by asking a question, typing some words, we can translate the document fairly well.",
                    "label": 0
                },
                {
                    "sent": "We can summarize them.",
                    "label": 0
                },
                {
                    "sent": "Software can recommend books.",
                    "label": 0
                },
                {
                    "sent": "Software recommended movies.",
                    "label": 1
                },
                {
                    "sent": "Computers describe speech, recognize handwriting.",
                    "label": 1
                },
                {
                    "sent": "All of these things were on their wish list, and all of these things are possible today.",
                    "label": 0
                },
                {
                    "sent": "So the very first piece of news should be that we can do so many things.",
                    "label": 0
                },
                {
                    "sent": "That that you were listing as.",
                    "label": 0
                },
                {
                    "sent": "Interesting things in by the way.",
                    "label": 0
                },
                {
                    "sent": "If you've seen the 2nd.",
                    "label": 0
                },
                {
                    "sent": "A little video I showed you by 1973.",
                    "label": 0
                },
                {
                    "sent": "That was the list of failures.",
                    "label": 0
                },
                {
                    "sent": "That was a AB.",
                    "label": 0
                },
                {
                    "sent": "Sir James Lighthill, a mathematician.",
                    "label": 0
                },
                {
                    "sent": "That there was asked by his such councils to assess the field of artificial intelligence, to decide if it was worth funding in the future.",
                    "label": 0
                },
                {
                    "sent": "He wrote the light, he report that killed a lot of the funding for many years to come, and he was challenged to debate at the Royal Institution.",
                    "label": 0
                },
                {
                    "sent": "And in the debate John McCarthy was there.",
                    "label": 0
                },
                {
                    "sent": "Don't meet you, Richard Gregory.",
                    "label": 0
                },
                {
                    "sent": "And BBC broadcasted and the debate was.",
                    "label": 0
                },
                {
                    "sent": "His position was artificial.",
                    "label": 0
                },
                {
                    "sent": "Intelligence cannot happen for fundamental reasons.",
                    "label": 0
                },
                {
                    "sent": "And that was the list of failures that he presented, unchallenged, because nobody could challenge him in that nobody could transcribe speech.",
                    "label": 0
                },
                {
                    "sent": "Translate documents summarizes one in those days recognize handwriting.",
                    "label": 0
                },
                {
                    "sent": "And yet we could do now stand in the conference if you have to come from now and tell people.",
                    "label": 0
                },
                {
                    "sent": "Yes, it has been done.",
                    "label": 0
                },
                {
                    "sent": "That wish list has been many items to be cost of.",
                    "label": 0
                },
                {
                    "sent": "The reason I think that would be remarkably useful thing for them.",
                    "label": 0
                },
                {
                    "sent": "So all the small things like.",
                    "label": 0
                },
                {
                    "sent": "Should we use a classy another Gaussian try?",
                    "label": 0
                },
                {
                    "sent": "Or should we use a one normal trainer?",
                    "label": 0
                },
                {
                    "sent": "This would be lost in the noise forever.",
                    "label": 0
                },
                {
                    "sent": "The news are we can do these things, they work.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So before.",
                    "label": 0
                },
                {
                    "sent": "If you wanted to receive recommendations for books.",
                    "label": 0
                },
                {
                    "sent": "You go online.",
                    "label": 0
                },
                {
                    "sent": "It's such a trivial thing that we don't think about it, but this is the kind of thing would have meant a lot to do that audience you can retrieve their profit items.",
                    "label": 0
                },
                {
                    "sent": "You",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Repeat it back up with information.",
                    "label": 0
                },
                {
                    "sent": "In terms of images and documents.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I have even tried to translate some material I thought would be useful.",
                    "label": 0
                },
                {
                    "sent": "And I know this can be done automatically.",
                    "label": 0
                },
                {
                    "sent": "And we shouldn't think that this is obvious.",
                    "label": 0
                },
                {
                    "sent": "This is being part of the quest for many years.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's the main message, in a way you know some would say part of the mission accomplished.",
                    "label": 0
                },
                {
                    "sent": "But",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the second thing you should say right after that.",
                    "label": 0
                },
                {
                    "sent": "Would be things didn't go quite in the way.",
                    "label": 0
                },
                {
                    "sent": "Those pioneers perhaps expected.",
                    "label": 0
                },
                {
                    "sent": "By this I mean.",
                    "label": 0
                },
                {
                    "sent": "It isn't that we understood how humans do those things so well that we implemented it.",
                    "label": 0
                },
                {
                    "sent": "It isn't that we are able the way intelligence in humans works, and then we made the machine that does it.",
                    "label": 0
                },
                {
                    "sent": "We don't know how we understand the document.",
                    "label": 0
                },
                {
                    "sent": "Computers don't under Amazon doesn't understand books and Google doesn't read documents in the way we think.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, we obtained the intended behavior.",
                    "label": 0
                },
                {
                    "sent": "By a series of statistical hacks.",
                    "label": 1
                },
                {
                    "sent": "Large amounts of data, simple minded algorithms did this for us in all the applications I listed, so this should be, I think the second news piece of news for them.",
                    "label": 0
                },
                {
                    "sent": "We did it not in the way you wanted.",
                    "label": 0
                },
                {
                    "sent": "We don't know much more than you about how people do it, perhaps, but we can do it.",
                    "label": 0
                },
                {
                    "sent": "Statistics, statistical, learning theory or whatever battle recognition quality the way you want it.",
                    "label": 0
                },
                {
                    "sent": "Allowed us to to hack.",
                    "label": 0
                },
                {
                    "sent": "These things together.",
                    "label": 0
                },
                {
                    "sent": "Which.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Perhaps exciting, perhaps disappointing.",
                    "label": 0
                },
                {
                    "sent": "So the consideration is that very humble activities such as indexing and clustering and estimating parameters.",
                    "label": 1
                },
                {
                    "sent": "Have become the enabling factors of artificial intelligence today and the statistical pattern analysis has actually taken set center stage in the field in the entire field of machine intelligence.",
                    "label": 1
                },
                {
                    "sent": "Eating what is a data driven artificial intelligence?",
                    "label": 0
                },
                {
                    "sent": "And just to give you a.",
                    "label": 0
                },
                {
                    "sent": "Simple example, by no means representing everything, but it's one example of this trend I would like to look at the.",
                    "label": 1
                },
                {
                    "sent": "Impressive impact of the very simple Viterbi algorithm for decoding signals in communications.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this had an impact in our field.",
                    "label": 0
                },
                {
                    "sent": "I will just have a look at it.",
                    "label": 0
                },
                {
                    "sent": "I am returning.",
                    "label": 0
                },
                {
                    "sent": "I have worked in writing this for 50 years and I still enjoy it.",
                    "label": 0
                },
                {
                    "sent": "Undo, it'll be working by wireless.",
                    "label": 0
                },
                {
                    "sent": "He does not work in machine intelligence is a rich man because of telecommunications, and he has no interest in machine intelligence.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, his impact in our field is being larger than many of the members of this community.",
                    "label": 0
                },
                {
                    "sent": "This.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Calculator was introduced in 1960s.",
                    "label": 1
                },
                {
                    "sent": "Is part of information theory.",
                    "label": 1
                },
                {
                    "sent": "It has to do with the decoding or denoising a message coming through a noisy channel.",
                    "label": 0
                },
                {
                    "sent": "Ender you want to do that efficiently in a simple way that you can also implement in hardware.",
                    "label": 0
                },
                {
                    "sent": "And if you make assumptions about the statistical nature of the channel and the data that you're sending, you can do it very, very fast.",
                    "label": 1
                },
                {
                    "sent": "So we're not going with the details, but the idea is if I send a string of bits generated the Markov chain to a noisy channel, and the channel has noise that is independent of for its symbol.",
                    "label": 1
                },
                {
                    "sent": "You can workout the most likely message I sent.",
                    "label": 1
                },
                {
                    "sent": "In linear time.",
                    "label": 1
                },
                {
                    "sent": "That's under the table contribution.",
                    "label": 0
                },
                {
                    "sent": "And it's very simple.",
                    "label": 0
                },
                {
                    "sent": "Agreed, it is really a shortest path in a graph.",
                    "label": 1
                },
                {
                    "sent": "So it's a dynamic programming example.",
                    "label": 0
                },
                {
                    "sent": "Something by the way, that in 1858 it was not yet.",
                    "label": 0
                },
                {
                    "sent": "Published because it was in the 59 algorithm.",
                    "label": 0
                },
                {
                    "sent": "The shortest path in Melbourne.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But if you look at the position of this paper.",
                    "label": 0
                },
                {
                    "sent": "Error bounds for convolutional codes.",
                    "label": 0
                },
                {
                    "sent": "It doesn't look, of course like a machine intelligence paper.",
                    "label": 0
                },
                {
                    "sent": "But it has had a lot of consequences.",
                    "label": 0
                },
                {
                    "sent": "If we can transcribe speech today, it's because of that.",
                    "label": 0
                },
                {
                    "sent": "Hidden Markov models are the standard in speech recognition.",
                    "label": 0
                },
                {
                    "sent": "And they used to be so good.",
                    "label": 0
                },
                {
                    "sent": "I mean, in the most important phase of decoding.",
                    "label": 0
                },
                {
                    "sent": "But what is even more interesting is that when after many years of failures in machine translation decided to try something different in nature and give up on linguistic rules and language modeling, try data driven approaches they.",
                    "label": 0
                },
                {
                    "sent": "Tend to this kind of papers.",
                    "label": 0
                },
                {
                    "sent": "They use the speech recognition model as an example and today.",
                    "label": 0
                },
                {
                    "sent": "Documents are translated using.",
                    "label": 0
                },
                {
                    "sent": "The mark of either the Viterbi like algorithms, we have a Markov chain assumption on the language and the.",
                    "label": 0
                },
                {
                    "sent": "Noisy channel model in the way you represented the translation process.",
                    "label": 0
                },
                {
                    "sent": "That is how we do it.",
                    "label": 0
                },
                {
                    "sent": "That's how Google did this living translation before.",
                    "label": 0
                },
                {
                    "sent": "Be causing it in this way.",
                    "label": 0
                },
                {
                    "sent": "And if you hear someone saying that there are 20 or 22,000 genes in the human genome, and this is because somebody in Cambridge used the hidden Markov model to count them.",
                    "label": 0
                },
                {
                    "sent": "David Hauser is being the first one to look for genes using hidden Markov models.",
                    "label": 0
                },
                {
                    "sent": "Any fears of graphical models in belief networks you are using the junction tree algorithm which is a generalization of the Derby algorithm and the list could go on.",
                    "label": 1
                },
                {
                    "sent": "We do a lot of the things in that list because of Italy's algorithm and other things in the list.",
                    "label": 0
                },
                {
                    "sent": "Because of similar algorithms, which is the point.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the question is, is it maybe that this very simple algorithm has been more influential than other celebrated?",
                    "label": 1
                },
                {
                    "sent": "Still improving type of Argos, perhaps?",
                    "label": 0
                },
                {
                    "sent": "I think it has been more important than.",
                    "label": 0
                },
                {
                    "sent": "Not only through improving, but neural networks and evolution in programming and any linguistic analysis that we can do.",
                    "label": 0
                },
                {
                    "sent": "At solving those problems.",
                    "label": 0
                },
                {
                    "sent": "That is made more of a difference.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we go, a series of statistical facts.",
                    "label": 1
                },
                {
                    "sent": "Together we did good optimization and a lot of data delivered the intelligent behavior that we can show off today and claim as a success story of the field.",
                    "label": 1
                },
                {
                    "sent": "But there are other things we do using similar methods have been listed.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here I think this is the story of how optimization and statistics became.",
                    "label": 0
                },
                {
                    "sent": "Part of the language of.",
                    "label": 1
                },
                {
                    "sent": "Artificial intelligence.",
                    "label": 0
                },
                {
                    "sent": "They are behind this algorithm and other algorithms.",
                    "label": 1
                },
                {
                    "sent": "They're also behind, for example, support vector machines, convex optimization and statistically bonds which are used in text categorization and hand recognition.",
                    "label": 1
                },
                {
                    "sent": "There behind graphical models there behind Association mining.",
                    "label": 0
                },
                {
                    "sent": "So if you do recommendations automatically for products, you're going to find statistical patterns in your data using very efficient search algorithms and so on.",
                    "label": 0
                },
                {
                    "sent": "Because of machine learning is so central in modern AI.",
                    "label": 1
                },
                {
                    "sent": "Statistical language and optimization language have become central part of modern.",
                    "label": 1
                },
                {
                    "sent": "Artificial.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we should like it because we work in machine learning and should feel very happy about it and we should really emphasize we have come a long way as a field.",
                    "label": 1
                },
                {
                    "sent": "But I think after acknowledging and celebrating and listing the successes and even spelling correction and face detection detection, all these things are done.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the second time we've done it.",
                    "label": 0
                },
                {
                    "sent": "It was not in the way.",
                    "label": 0
                },
                {
                    "sent": "They expected 50 years ago.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But this is what I would like to discuss with you right now.",
                    "label": 0
                },
                {
                    "sent": "Are we perhaps?",
                    "label": 0
                },
                {
                    "sent": "Focusing just on those tasks that can be handled by sophistical methods.",
                    "label": 1
                },
                {
                    "sent": "You see, when everything was framed as a search.",
                    "label": 0
                },
                {
                    "sent": "Process in the solution space during the days of.",
                    "label": 0
                },
                {
                    "sent": "Yeah, in the 70s perhaps.",
                    "label": 0
                },
                {
                    "sent": "It was easy to try and frame everything as a search process and theory improving the process.",
                    "label": 0
                },
                {
                    "sent": "Everything was following the metaphor of chess match even in the navigation of the robot.",
                    "label": 0
                },
                {
                    "sent": "In an environment like this would be phrased as a planning process with the searching solution space.",
                    "label": 0
                },
                {
                    "sent": "All these things were framed this way and many other policies were overlooked because they weren't fitting.",
                    "label": 1
                },
                {
                    "sent": "And that's a different story.",
                    "label": 0
                },
                {
                    "sent": "I can't.",
                    "label": 0
                },
                {
                    "sent": "I can't explain now, but are we doing the same?",
                    "label": 0
                },
                {
                    "sent": "Are we just focusing a lot on those tasks that you can do with data and just?",
                    "label": 0
                },
                {
                    "sent": "Essentially, redefining our goals.",
                    "label": 0
                },
                {
                    "sent": "That is my concern today are we redefining our goals.",
                    "label": 0
                },
                {
                    "sent": "Are we deluding ourselves?",
                    "label": 0
                },
                {
                    "sent": "What is the goal of a?",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, for me it is to generate intelligent behavior whatever that means.",
                    "label": 1
                },
                {
                    "sent": "So we try to define it properly with not much hope.",
                    "label": 0
                },
                {
                    "sent": "But I think we should repeat to ourselves.",
                    "label": 0
                },
                {
                    "sent": "What is the fundamental goal very often, otherwise we risk to just slowly drift and do whatever we can do and think that is the goal that we're trying to achieve.",
                    "label": 1
                },
                {
                    "sent": "What is our game plan as a community to achieve machine intelligence?",
                    "label": 1
                },
                {
                    "sent": "I mean, are we going to Polish perceptions for the next 50 years?",
                    "label": 0
                },
                {
                    "sent": "Is this the plan?",
                    "label": 0
                },
                {
                    "sent": "Are we going to improve and unequal awards?",
                    "label": 1
                },
                {
                    "sent": "But he can do the job.",
                    "label": 0
                },
                {
                    "sent": "But I are we going to analyze data are we?",
                    "label": 0
                },
                {
                    "sent": "Is this what we are about?",
                    "label": 0
                },
                {
                    "sent": "Data analysis?",
                    "label": 0
                },
                {
                    "sent": "'cause this is petitions and.",
                    "label": 0
                },
                {
                    "sent": "They are very serious about it.",
                    "label": 0
                },
                {
                    "sent": "They want to be the one I think that not only this is not our mission to analyze data.",
                    "label": 0
                },
                {
                    "sent": "Statistics is anyway not probably sufficient to achieve the fundamental goals that are to generate and understand intelligent behavior in naturally in future systems.",
                    "label": 0
                },
                {
                    "sent": "So this is what I would like to discuss a little bit with you.",
                    "label": 0
                },
                {
                    "sent": "In the next part of the presentation.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is very humble, pragmatic and I don't take it too seriously.",
                    "label": 0
                },
                {
                    "sent": "Definition of intelligent behavior.",
                    "label": 0
                },
                {
                    "sent": "I think an agent can be displaying an intelligent behavior if it can pursue its goals.",
                    "label": 0
                },
                {
                    "sent": "In a complex environment, by making informed decisions and adapting to situations that were not directly specified by the designer.",
                    "label": 1
                },
                {
                    "sent": "I use this definition because I want to move everything away from this idea of human like intelligence.",
                    "label": 1
                },
                {
                    "sent": "This is very important for me.",
                    "label": 0
                },
                {
                    "sent": "If we insist in defining intelligence by thinking that human intelligence we make a terrible mistake.",
                    "label": 0
                },
                {
                    "sent": "Intelligence is being around for literally.",
                    "label": 0
                },
                {
                    "sent": "Millions, probably billions of years before the 1st human appeared before human language and logic were invented, intelligence existed.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So if you have a name, an Organism escaping, hunting, achieving goals, using information from its environment to make informed decisions, to draw inferences, and to achieve goals, that is why intelligence evolved in the first place.",
                    "label": 0
                },
                {
                    "sent": "And I say almost my student chicken crossing the road is a better example than two in test.",
                    "label": 0
                },
                {
                    "sent": "Chicken is listen to noise seeing.",
                    "label": 0
                },
                {
                    "sent": "Planning, making decisions, avoiding obstacles in admin.",
                    "label": 0
                },
                {
                    "sent": "Trying to survive across their order.",
                    "label": 0
                },
                {
                    "sent": "That is why we have a brain.",
                    "label": 0
                },
                {
                    "sent": "Other tasks are nice.",
                    "label": 0
                },
                {
                    "sent": "Filtering spam is nice, but I don't think our brain evolved.",
                    "label": 0
                },
                {
                    "sent": "For filtering spam, although some way.",
                    "label": 0
                },
                {
                    "sent": "So here is my.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is why I take the voice down.",
                    "label": 0
                },
                {
                    "sent": "You can tell him learning to use videos.",
                    "label": 0
                },
                {
                    "sent": "Here is an agent.",
                    "label": 0
                },
                {
                    "sent": "Behaving.",
                    "label": 0
                },
                {
                    "sent": "You don't environment.",
                    "label": 0
                },
                {
                    "sent": "Sing, Sing is environment using various channels.",
                    "label": 0
                },
                {
                    "sent": "Getting information in.",
                    "label": 0
                },
                {
                    "sent": "And using the information to make decisions and the decisions are to achieve specific goals.",
                    "label": 0
                },
                {
                    "sent": "I can see the goal coming now.",
                    "label": 0
                },
                {
                    "sent": "And that's the agent.",
                    "label": 0
                },
                {
                    "sent": "There you go.",
                    "label": 0
                },
                {
                    "sent": "So this stuff has been going on for.",
                    "label": 0
                },
                {
                    "sent": "Millions or billions of years.",
                    "label": 0
                },
                {
                    "sent": "In the oceans fast on land after this is where information posting has been refined and refined and refined and sensitive.",
                    "label": 0
                },
                {
                    "sent": "Information and generational behavior.",
                    "label": 0
                },
                {
                    "sent": "And that is where.",
                    "label": 0
                },
                {
                    "sent": "Here no brain, no, never system.",
                    "label": 0
                },
                {
                    "sent": "Why you care?",
                    "label": 0
                },
                {
                    "sent": "You're trying to eat one prokaryote.",
                    "label": 0
                },
                {
                    "sent": "Sing, sing chemically.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You can see there is an agent with a goal using information to achieve a goal, making decisions in conditions that any but they couldn't predict it too complex of a combination.",
                    "label": 0
                },
                {
                    "sent": "They were last time other agent.",
                    "label": 0
                },
                {
                    "sent": "No level system, no brain again.",
                    "label": 0
                },
                {
                    "sent": "Information gathering in decision making to achieve goals.",
                    "label": 0
                },
                {
                    "sent": "This is an algorithm being executed right now, but the system they do that all the time.",
                    "label": 0
                },
                {
                    "sent": "Ender goal achieved.",
                    "label": 0
                },
                {
                    "sent": "The plant can.",
                    "label": 0
                },
                {
                    "sent": "Move to the next goal.",
                    "label": 0
                },
                {
                    "sent": "That is probably to go the right leaf and the right through fruit in the right place at the right time, making the Flowers in the right moment, and so on and so forth.",
                    "label": 0
                },
                {
                    "sent": "Information posting.",
                    "label": 0
                },
                {
                    "sent": "And decision making are commonplace in nature.",
                    "label": 0
                },
                {
                    "sent": "And understanding how this behavior is generated is very important.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is what it may seem.",
                    "label": 0
                },
                {
                    "sent": "I do it on purpose.",
                    "label": 0
                },
                {
                    "sent": "I want to say let's focus on agents that make decisions and have a behavior.",
                    "label": 0
                },
                {
                    "sent": "And you will have much less confusion than when you try to define if generating a piece of music uses the same type of intelligence as solving an education problem, many of the things we do everyday also, as humans are the same nature as those videos we've seen very few of the things we do are of symbolic deliberative, declarative, logical inference, type of processing, very, very few.",
                    "label": 0
                },
                {
                    "sent": "And when we try to build robots using logical reasoning, we failed.",
                    "label": 0
                },
                {
                    "sent": "When we decided that we can make intelligent systems by just listing all the possible in declarative form, all the possible facts that are needed, we started listing endless an endless lists of facts and they're still not complete.",
                    "label": 0
                },
                {
                    "sent": "Now 30 years after the beginning, and perhaps if you faced in that way you can't deal with the ambiguities and uncertainties of the real world.",
                    "label": 0
                },
                {
                    "sent": "It's very hard.",
                    "label": 0
                },
                {
                    "sent": "But I think that the those tasks are also not statistical tasks.",
                    "label": 0
                },
                {
                    "sent": "They're not apart recognition task.",
                    "label": 0
                },
                {
                    "sent": "They're not in of the sort of an input output mapping that you are so good at emulating today.",
                    "label": 0
                },
                {
                    "sent": "So our success in the other fields has been like this.",
                    "label": 0
                },
                {
                    "sent": "We give you a lot of French and English documents.",
                    "label": 0
                },
                {
                    "sent": "You learn the map will give you a lot of speech and text.",
                    "label": 0
                },
                {
                    "sent": "You learn them up.",
                    "label": 0
                },
                {
                    "sent": "We can give you handwriting images of handwriting and the labels learn it.",
                    "label": 0
                },
                {
                    "sent": "This input output protocol for machine learning has done so much to achieve the goals we've seen before, but perhaps it is not sufficient to model intelligent behavior even of the simple nature that we've seen here, let alone everything else.",
                    "label": 0
                },
                {
                    "sent": "The more complex types of behavior we should be emulating.",
                    "label": 0
                },
                {
                    "sent": "So, and it's funny because the data driven AI actually would be compatible with the.",
                    "label": 1
                },
                {
                    "sent": "Concepts that are other than data analysis.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to be statistics all the time.",
                    "label": 0
                },
                {
                    "sent": "We should start introducing ideas from control theory, dynamical systems, game theory.",
                    "label": 1
                },
                {
                    "sent": "And they don't necessarily reduce the statistics.",
                    "label": 0
                },
                {
                    "sent": "And the eye does not reduce.",
                    "label": 0
                },
                {
                    "sent": "Do statistics.",
                    "label": 0
                },
                {
                    "sent": "So this is a very important thing because we are in the moment in which we achieved many of the goals we were working on and now the choice is either we keep on.",
                    "label": 0
                },
                {
                    "sent": "Polishing essentially.",
                    "label": 0
                },
                {
                    "sent": "Or we move to the next task.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I think modeling the interactions will not reduce the statistics interactions with an environment to generate behavior.",
                    "label": 0
                },
                {
                    "sent": "For example, Amazon OK, Amazon is doing better mining in it's not log files, but there is a feedback loop.",
                    "label": 1
                },
                {
                    "sent": "It is enormously important.",
                    "label": 0
                },
                {
                    "sent": "System is making suggestions to the user in making decisions, and the system is using this information to make suggestions and the interaction goes on.",
                    "label": 0
                },
                {
                    "sent": "When you have two things interacting with each other and generating each others data and Co evolving accord acting, you don't have IID sampling of any sort.",
                    "label": 0
                },
                {
                    "sent": "For example, this is just their stability issues.",
                    "label": 0
                },
                {
                    "sent": "Perhaps in that simple case there aren't.",
                    "label": 0
                },
                {
                    "sent": "But as soon as you scale it up into many agents, you start talking about.",
                    "label": 0
                },
                {
                    "sent": "Ability and control concepts that are very important interact.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can be found also within a system.",
                    "label": 1
                },
                {
                    "sent": "If you build a large scale architecture.",
                    "label": 0
                },
                {
                    "sent": "Made many models, which is what I think we should be doing now if it so that we're good in translating, classifying, transcribing, summarizing.",
                    "label": 0
                },
                {
                    "sent": "If we have achieved a decent level in those tasks, my question is how do they go together to make an intelligent system and suddenly you have a lot of adaptive models interacting with each other, generating each others data.",
                    "label": 0
                },
                {
                    "sent": "Having complicated feedback loops and you have issues of stability and error propagation and error control, how do you generate a system made of noisy modules to operate in a noisy environment and still deliver a decent behavior?",
                    "label": 1
                },
                {
                    "sent": "So this I think a very important part of what we do now.",
                    "label": 0
                },
                {
                    "sent": "If you're building proper large scale intelligence systems.",
                    "label": 0
                },
                {
                    "sent": "Modeling all this interaction.",
                    "label": 0
                },
                {
                    "sent": "It made.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This task has been properly solved by natural systems over there.",
                    "label": 1
                },
                {
                    "sent": "Over the years.",
                    "label": 0
                },
                {
                    "sent": "And I don't believe this can be best formalized as input, output pattern recognition tasks.",
                    "label": 1
                },
                {
                    "sent": "That's my personal impression.",
                    "label": 0
                },
                {
                    "sent": "But many ideas exist already out there from many fields, and they are perfectly compatible with what we are doing.",
                    "label": 1
                },
                {
                    "sent": "Many ideas exist in the logical systems that.",
                    "label": 0
                },
                {
                    "sent": "That are very worthwhile exploring when you model behavior generation for example.",
                    "label": 0
                },
                {
                    "sent": "And by the way, also ideas that come from other fields, even some of the earlier things done in AI in some conditions can be very.",
                    "label": 0
                },
                {
                    "sent": "Can be more indicated of course.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is my.",
                    "label": 0
                },
                {
                    "sent": "Moment of where I stop for a minute.",
                    "label": 0
                },
                {
                    "sent": "Modeling and creating intelligent behavior will require concepts that go beyond statistical pattern analysis and.",
                    "label": 1
                },
                {
                    "sent": "Many concepts.",
                    "label": 0
                },
                {
                    "sent": "That are equal to.",
                    "label": 0
                },
                {
                    "sent": "To achieve this task involved the dynamic nature of the task and probably they don't videos directly likely to.",
                    "label": 0
                },
                {
                    "sent": "To statistics in the general sense of.",
                    "label": 0
                },
                {
                    "sent": "Analyzing data in.",
                    "label": 1
                },
                {
                    "sent": "I think this is actually starting to happen, not say should happen.",
                    "label": 0
                },
                {
                    "sent": "I see it happening now.",
                    "label": 0
                },
                {
                    "sent": "If you look around it.",
                    "label": 0
                },
                {
                    "sent": "This is happening in these days and just report that we're moving on to some extent.",
                    "label": 0
                },
                {
                    "sent": "Of course they don't recommend to get out get out of the pattern recognition here.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But there's another thing separate totally that I think is interesting.",
                    "label": 0
                },
                {
                    "sent": "That would be worthwhile reporting if you were too.",
                    "label": 0
                },
                {
                    "sent": "Give it talking at 1058 and tell them how is life today now.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My next video I am.",
                    "label": 0
                },
                {
                    "sent": "I'm sure it will not work, so let me.",
                    "label": 0
                },
                {
                    "sent": "Change one thing because I know what that is.",
                    "label": 0
                },
                {
                    "sent": "There you go.",
                    "label": 0
                },
                {
                    "sent": "I want the full screen.",
                    "label": 0
                },
                {
                    "sent": "And this always wants the small screen, so I don't know why.",
                    "label": 0
                },
                {
                    "sent": "Here is my latest piece of video.",
                    "label": 0
                },
                {
                    "sent": "I know it was not necessary, but these are some of the journals in machine intelligence.",
                    "label": 0
                },
                {
                    "sent": "This is another lot.",
                    "label": 0
                },
                {
                    "sent": "Every cut is a different page, different list.",
                    "label": 0
                },
                {
                    "sent": "These are Jonas.",
                    "label": 0
                },
                {
                    "sent": "These come out every month, perhaps with bunch of articles inside.",
                    "label": 0
                },
                {
                    "sent": "And these are some really literally a subset of conferences.",
                    "label": 0
                },
                {
                    "sent": "I don't know how many of these conferences do you go to or how many people do not go there, but each of them looks like this one.",
                    "label": 0
                },
                {
                    "sent": "Each of them has two 300 people.",
                    "label": 0
                },
                {
                    "sent": "Maybe they're not all of them, but they proceedings they have at the banquet.",
                    "label": 0
                },
                {
                    "sent": "They have the tape they have.",
                    "label": 0
                },
                {
                    "sent": "These are all the same.",
                    "label": 0
                },
                {
                    "sent": "These are all pieces, so if I was to report how does machine intelligence look like in 2980?",
                    "label": 0
                },
                {
                    "sent": "I think this picture would come to mind.",
                    "label": 0
                },
                {
                    "sent": "Ender and this is, I think, are an important picture because that this is for those of you who are not over.",
                    "label": 0
                },
                {
                    "sent": "Western M dissent.",
                    "label": 0
                },
                {
                    "sent": "This is the way God made sure people don't achieve anything right.",
                    "label": 0
                },
                {
                    "sent": "We were trying to achieve too much and God said OK, fine.",
                    "label": 0
                },
                {
                    "sent": "Let's kids 100 conferences speaking different languages and.",
                    "label": 0
                },
                {
                    "sent": "That's the way you do it machine today.",
                    "label": 0
                },
                {
                    "sent": "That is a concern.",
                    "label": 0
                },
                {
                    "sent": "That is strange, that is.",
                    "label": 0
                },
                {
                    "sent": "The fragmentation is enormous.",
                    "label": 0
                },
                {
                    "sent": "I don't say people shouldn't specialize, they just say.",
                    "label": 0
                },
                {
                    "sent": "Are we exceeding so diverse?",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I like it, but not if it hampers comparability.",
                    "label": 0
                },
                {
                    "sent": "We need to know if somebody is achieving something better than somebody, so perhaps grounding the field in some grand grand challenge might provide that.",
                    "label": 1
                },
                {
                    "sent": "And this is actually coming again.",
                    "label": 1
                },
                {
                    "sent": "The web is helping a lot.",
                    "label": 0
                },
                {
                    "sent": "Robotics is acting by format.",
                    "label": 0
                },
                {
                    "sent": "Is it in these things are grounded in field in keeping us honest.",
                    "label": 0
                },
                {
                    "sent": "Then",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is the question.",
                    "label": 0
                },
                {
                    "sent": "You know what is our game plan?",
                    "label": 1
                },
                {
                    "sent": "What are we going to do next?",
                    "label": 0
                },
                {
                    "sent": "If we have to build intelligent behavior or understand intelligent behavior in natural systems.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think many things are moving and.",
                    "label": 1
                },
                {
                    "sent": "From the theoretical point of view.",
                    "label": 1
                },
                {
                    "sent": "In learning the emergence of string theory has really helped.",
                    "label": 0
                },
                {
                    "sent": "To create.",
                    "label": 0
                },
                {
                    "sent": "Single, powerful dominant way to do things in learning.",
                    "label": 0
                },
                {
                    "sent": "Why not?",
                    "label": 0
                },
                {
                    "sent": "I think this is coming now.",
                    "label": 0
                },
                {
                    "sent": "Also in more general AI tasks and more general ideas can be included.",
                    "label": 0
                },
                {
                    "sent": "In that framework in engineering, I think obviously I like it a lot when I see people making systems and putting things together and understanding at the next level up.",
                    "label": 0
                },
                {
                    "sent": "How Unite behavior here?",
                    "label": 0
                },
                {
                    "sent": "There was a beautiful demo session this session.",
                    "label": 0
                },
                {
                    "sent": "While many people were making systems and when you make systems you don't just hack things together, you are using modules that are the result of previous research.",
                    "label": 0
                },
                {
                    "sent": "But the way you combine them needs a lot of research in its own right to ensure all the things said before block error propagation.",
                    "label": 1
                },
                {
                    "sent": "Keep stability, make sure the system behaves as a system in an intelligent way, and I would love it if next year.",
                    "label": 0
                },
                {
                    "sent": "In this email we could see because we could see papers of people making starting and modeling the behavior of large scale intelligence systems that needs a lot of attention by theoreticians in this moment.",
                    "label": 1
                },
                {
                    "sent": "And the big conceptual step we made, I think, is that we have moved away from this anthropocentric emotional intelligence, so we're more ready to deal with Google and Amazon as intelligent agents.",
                    "label": 0
                },
                {
                    "sent": "Just the same sort as the crayfish we've seen before.",
                    "label": 0
                },
                {
                    "sent": "They also gather information positive and make decision and achieve their goals.",
                    "label": 0
                },
                {
                    "sent": "Amazon and Google are not different from those videos in some respect, and yet they wouldn't pass doing this test, and yet nobody cares.",
                    "label": 0
                },
                {
                    "sent": "And that's the kind of I think progress we made.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Incorporating all of these ideas.",
                    "label": 1
                },
                {
                    "sent": "We take us closer to the natural systems.",
                    "label": 0
                },
                {
                    "sent": "Closed biology.",
                    "label": 0
                },
                {
                    "sent": "We might become finally relevant to people who actually study behavior in natural systems because it is weird that actually diligence has so little to say to people that study animal behavior, for example.",
                    "label": 0
                },
                {
                    "sent": "And by the way, it would mark a return to some of the ideas that were typical in cybernetics.",
                    "label": 1
                },
                {
                    "sent": "And many of the people in the meeting would be pleased to hear that we are.",
                    "label": 0
                },
                {
                    "sent": "Moving a little bit.",
                    "label": 0
                },
                {
                    "sent": "Partly full circle.",
                    "label": 0
                },
                {
                    "sent": "But then.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here's my biggest question of all the 1st that came to mind when I was reading.",
                    "label": 1
                },
                {
                    "sent": "The proceedings.",
                    "label": 0
                },
                {
                    "sent": "Although, as they say that came after the first thing that came to mind, probably because I'm so Nello centric, perhaps is what of my work.",
                    "label": 1
                },
                {
                    "sent": "Would be relevant in 2059.",
                    "label": 0
                },
                {
                    "sent": "'cause I was in blood.",
                    "label": 0
                },
                {
                    "sent": "Manske Selfridges and the others.",
                    "label": 0
                },
                {
                    "sent": "Their papers in that.",
                    "label": 1
                },
                {
                    "sent": "That would have really affected the way we think today.",
                    "label": 0
                },
                {
                    "sent": "In the proceedings of this conference.",
                    "label": 0
                },
                {
                    "sent": "What is affecting?",
                    "label": 0
                },
                {
                    "sent": "The next 50 years.",
                    "label": 0
                },
                {
                    "sent": "And again, if we do something, I take this to mean or to you, because it's night already.",
                    "label": 0
                },
                {
                    "sent": "But I need to tell me often.",
                    "label": 0
                },
                {
                    "sent": "If something I do doesn't have a chance of affecting the next 50 years.",
                    "label": 0
                },
                {
                    "sent": "Should I do it?",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Little Carly you want to videos again?",
                    "label": 0
                },
                {
                    "sent": "I know I can put videos.",
                    "label": 0
                },
                {
                    "sent": "It's about 3 comments, so I guess you nicely complemented the talk from yesterday which was.",
                    "label": 0
                },
                {
                    "sent": "Charlotte was going on in AI or participate I from top down perspective.",
                    "label": 0
                },
                {
                    "sent": "While this was his bottom up perspective, data driven perspective.",
                    "label": 0
                },
                {
                    "sent": "So I guess we can also observe evolution and development from this top down perspective and that kind of merger of two areas.",
                    "label": 0
                },
                {
                    "sent": "Just why maybe Mark didn't mention this yesterday with my feeling here is based on areas many many times happens that secret is.",
                    "label": 0
                },
                {
                    "sent": "It's algorithms how keep the ceiling and that case and how we can extend nicely expense.",
                    "label": 0
                },
                {
                    "sent": "Performance with a little bit of top down element which is also approaching and the same great top down AI is well hitting the bottom in many ways so economically degrees extremely expensive and so on, and that agreement techniques and machine learning can somehow help a lot.",
                    "label": 0
                },
                {
                    "sent": "So this is one piece.",
                    "label": 0
                },
                {
                    "sent": "Honest, I agree.",
                    "label": 0
                },
                {
                    "sent": "Actually I we needed the glue to put the pieces back together.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure that the glue is going to be eventually logic AI, but we do need a framework to put things together.",
                    "label": 0
                },
                {
                    "sent": "And yesterday was suggesting was made.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "AI is the goal and.",
                    "label": 0
                },
                {
                    "sent": "It is the worst goal, but it's far from being the only one.",
                    "label": 0
                },
                {
                    "sent": "I mean I can help society in a way which is not a high mean.",
                    "label": 0
                },
                {
                    "sent": "The Golden elephant is not communicated.",
                    "label": 0
                },
                {
                    "sent": "Vision, fly people and be useful.",
                    "label": 0
                },
                {
                    "sent": "So if I can with the statistical data mining achieve.",
                    "label": 0
                },
                {
                    "sent": "Society I don't care so much if it's really irritating, intelligent behavior or not, so it's not that it's not worth the goal to be right, but I think it's far from being lonely.",
                    "label": 0
                },
                {
                    "sent": "And negative statements to say that you are not in it with.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, OK.",
                    "label": 0
                },
                {
                    "sent": "I probably I.",
                    "label": 0
                },
                {
                    "sent": "Probably I can't deal with too many negations in the same sentence.",
                    "label": 0
                },
                {
                    "sent": "So we are not not visit mutating them.",
                    "label": 0
                },
                {
                    "sent": "Know, understood, understood.",
                    "label": 0
                },
                {
                    "sent": "I was joking, it is.",
                    "label": 0
                },
                {
                    "sent": "It is very clear.",
                    "label": 0
                },
                {
                    "sent": "But I do like to tease you.",
                    "label": 0
                },
                {
                    "sent": "I I think that I I didn't want to suggest that our goal is to imitate nature.",
                    "label": 0
                },
                {
                    "sent": "I want to say there is a class of important behaviors that we are trying to model which are what we call intelligent behavior.",
                    "label": 0
                },
                {
                    "sent": "And they will not be achieved by pure data analysis.",
                    "label": 0
                },
                {
                    "sent": "You can do a lot and they imitating this behavior.",
                    "label": 0
                },
                {
                    "sent": "It doesn't have to reproduce nature, I just said there are some behaviors I want to be able to let loose and heal, and I know it will end up in the sagace next year.",
                    "label": 0
                },
                {
                    "sent": "I don't know how I know the system has a goal and will achieve it.",
                    "label": 0
                },
                {
                    "sent": "That is a goal achieving behavior.",
                    "label": 0
                },
                {
                    "sent": "That could be requested in an official system.",
                    "label": 0
                },
                {
                    "sent": "I want to have an agent on the web that fully autonomously achieve some goals interacting with people and making decisions and learning and adapting, and I don't care if we build the web agent in a natural looking way.",
                    "label": 0
                },
                {
                    "sent": "But the behavior I want is goal achieving goal oriented behavior and better is a different goal from that analysis.",
                    "label": 0
                },
                {
                    "sent": "So you demonstrated very nicely the great diversity of the broad machine intelligence community, and he also suggested that one way to try to build them together is to consider some grand challenges.",
                    "label": 0
                },
                {
                    "sent": "So could you share some thoughts and possible grand challenges with maybe a 50 year vision?",
                    "label": 0
                },
                {
                    "sent": "Or if not, maybe attending 10 is easier.",
                    "label": 0
                },
                {
                    "sent": "Five is even easier if you let me.",
                    "label": 0
                },
                {
                    "sent": "Where it?",
                    "label": 0
                },
                {
                    "sent": "I didn't have time to discuss this, but.",
                    "label": 0
                },
                {
                    "sent": "It is obvious that an intelligent agent can manifest its behavior once it is immersed in an environment where it is to achieve its goals.",
                    "label": 0
                },
                {
                    "sent": "You don't have general purpose in vitro notions of intelligence, so I think the opportunities we have from the web are incredible.",
                    "label": 0
                },
                {
                    "sent": "That is a very natural playground for at Fishel intelligence.",
                    "label": 0
                },
                {
                    "sent": "Obviously, because it's a world it's digital.",
                    "label": 0
                },
                {
                    "sent": "But it's complex, but it's noisy.",
                    "label": 0
                },
                {
                    "sent": "But it's not the physical world that is to me, the obvious place where things are going to happen.",
                    "label": 0
                },
                {
                    "sent": "And in that happening by the way, companies are not waiting for pool academics to catch up.",
                    "label": 0
                },
                {
                    "sent": "There are 10 years ahead, and they're doing it now.",
                    "label": 0
                },
                {
                    "sent": "We have to.",
                    "label": 0
                },
                {
                    "sent": "To do it too.",
                    "label": 0
                },
                {
                    "sent": "Intelligence is going to happen on the web and the challenges are coming.",
                    "label": 0
                },
                {
                    "sent": "You know, assisting with this goal?",
                    "label": 0
                },
                {
                    "sent": "For example, making more money is Amazon Amazon's system making.",
                    "label": 0
                },
                {
                    "sent": "At making decisions, using information, adapting and learning, and trying to maximize the income, these are examples.",
                    "label": 0
                },
                {
                    "sent": "Over autonomous decision-making systems, I think that direction.",
                    "label": 0
                },
                {
                    "sent": "Of course it's at the beginning, but that direction has a chance to bring things together an and clean up if something works.",
                    "label": 0
                },
                {
                    "sent": "Or something doesn't work, it will show.",
                    "label": 0
                },
                {
                    "sent": "So that's the place we can really compare if things are working.",
                    "label": 0
                },
                {
                    "sent": "These are real world conditions, scalable, adversarial, noisy conditions.",
                    "label": 0
                },
                {
                    "sent": "And besides selling books, there are many things you can do in digital worlds.",
                    "label": 0
                },
                {
                    "sent": "I'll give it a second life synthetic world and the physical world, but you need an environment where things are done so either physical or digital world are going to be the playground for intelligent systems.",
                    "label": 0
                },
                {
                    "sent": "This is where you get the grounding.",
                    "label": 0
                },
                {
                    "sent": "Everything else is 1 ended up.",
                    "label": 0
                },
                {
                    "sent": "It's ungrounded and runs the risk of being self defining and self pleasing and self.",
                    "label": 0
                },
                {
                    "sent": "Central welding, so to speak.",
                    "label": 0
                },
                {
                    "sent": "Yes, I was surprised to see that you think that physical methods of achieving machine translation.",
                    "label": 0
                },
                {
                    "sent": "No you can.",
                    "label": 0
                },
                {
                    "sent": "Thanks for real.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "I I think we can do very well, but I am sure that you recognize instantly a machine generated document.",
                    "label": 0
                },
                {
                    "sent": "It takes a second.",
                    "label": 0
                },
                {
                    "sent": "It is very.",
                    "label": 0
                },
                {
                    "sent": "It is little.",
                    "label": 0
                },
                {
                    "sent": "I mean you can instantly recognize a bad translation comes out of the machine.",
                    "label": 0
                },
                {
                    "sent": "You know it nevertheless.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "You can input an English document and get out a decent Slovene document.",
                    "label": 0
                },
                {
                    "sent": "In the example I showed.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You can output the summary again, not perfect with all the mistakes that you get in the summary of the type, but the point is that that is the state of the art today.",
                    "label": 0
                },
                {
                    "sent": "Hello.",
                    "label": 0
                },
                {
                    "sent": "Like it, I think it was not visited by anything because but but I think most people would acknowledge that was going to be useful, usable.",
                    "label": 0
                },
                {
                    "sent": "The fact that you can make a business on top of it, it means that it works.",
                    "label": 0
                },
                {
                    "sent": "It doesn't work with like a person, but it works sufficiently.",
                    "label": 0
                },
                {
                    "sent": "Lighting was a very interesting person.",
                    "label": 0
                },
                {
                    "sent": "I never met him, but David met him so I knew about him and he was a remarkable mathematician in the UK and he.",
                    "label": 0
                },
                {
                    "sent": "It came to mind when I saw the island here, because he he eventually after a very successful career, died when he was a.",
                    "label": 0
                },
                {
                    "sent": "In old age, trying to swim all around an island.",
                    "label": 0
                },
                {
                    "sent": "And it's pretty remarkable.",
                    "label": 0
                },
                {
                    "sent": "Things that I would never try to, even if it was 18.",
                    "label": 0
                },
                {
                    "sent": "And that's what Michael person.",
                    "label": 0
                },
                {
                    "sent": "But he was really against and recommended.",
                    "label": 0
                },
                {
                    "sent": "There are online versions of this video.",
                    "label": 0
                },
                {
                    "sent": "It's a very nice debate that debate.",
                    "label": 0
                },
                {
                    "sent": "GNU theory.",
                    "label": 0
                },
                {
                    "sent": "Aspect.",
                    "label": 0
                },
                {
                    "sent": "Systems do you have any thoughts about where that might come from?",
                    "label": 0
                },
                {
                    "sent": "All you know, what ingredients would be useful?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I don't know much, but I do know that as soon as you have feedback loops, you run the risk to amplify noise.",
                    "label": 0
                },
                {
                    "sent": "And so as soon as you have a system that is making its own data, for example, or stuff like this, your feedback loops.",
                    "label": 0
                },
                {
                    "sent": "This dynamics must be kept under control.",
                    "label": 0
                },
                {
                    "sent": "And the data.",
                    "label": 0
                },
                {
                    "sent": "Eventually is a central idea that comes from control theory and dynamical systems to study the stability of systems that have feedback dynamics, so that cannot be avoided as soon as you build a large enough thing.",
                    "label": 0
                },
                {
                    "sent": "Even in my little small lab, we have a small experiment going on and we have a few dozen modules.",
                    "label": 0
                },
                {
                    "sent": "Boxing news data and generating each others data.",
                    "label": 0
                },
                {
                    "sent": "Training on each other's output.",
                    "label": 0
                },
                {
                    "sent": "We already have feedbacks.",
                    "label": 0
                },
                {
                    "sent": "Or we try to avoid them, but it's deliberately trying to prevent the interaction loop from closing.",
                    "label": 0
                },
                {
                    "sent": "One is to start thinking dynamically.",
                    "label": 0
                },
                {
                    "sent": "That is for sure.",
                    "label": 0
                },
                {
                    "sent": "You were emphasizing the importance and impact of the Chinese things, so the algorithms.",
                    "label": 0
                },
                {
                    "sent": "Tricks or hacks as you called them, and I was surprised that you from there came to the systems because.",
                    "label": 0
                },
                {
                    "sent": "I expected you would move to this distributed nature or nature of intelligence, that is that putting all these things together no longer needs to beach one centralized system as the people in the 50s expected.",
                    "label": 0
                },
                {
                    "sent": "Bridge.",
                    "label": 0
                },
                {
                    "sent": "Little tricks we come to an overall setting and.",
                    "label": 0
                },
                {
                    "sent": "That that really makes intelligent behavior occur at several places and even integrated into the environment.",
                    "label": 0
                },
                {
                    "sent": "So the environment agent is not that separated.",
                    "label": 0
                },
                {
                    "sent": "Right, as in.",
                    "label": 0
                },
                {
                    "sent": "And so I wondered with the notion system you included, this distributed in network computing and intelligent environments and always.",
                    "label": 0
                },
                {
                    "sent": "Obviously, obviously whenever you have but the condition for them to be a system is that they must work together.",
                    "label": 0
                },
                {
                    "sent": "Having a bunch of adaptive models in an isolation doesn't make them a system, they become a system.",
                    "label": 0
                },
                {
                    "sent": "If they communicate.",
                    "label": 0
                },
                {
                    "sent": "And then they do have a system.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter if they are in it.",
                    "label": 0
                },
                {
                    "sent": "Physically together they can be a swarm of agents or swarm robots.",
                    "label": 0
                },
                {
                    "sent": "You could have a complex.",
                    "label": 0
                },
                {
                    "sent": "System self organizing, whatever mix of people in machine.",
                    "label": 0
                },
                {
                    "sent": "It makes it the system is if they can.",
                    "label": 0
                },
                {
                    "sent": "If they communicate and cooperate.",
                    "label": 0
                },
                {
                    "sent": "To achieve their goals.",
                    "label": 0
                },
                {
                    "sent": "So I think of.",
                    "label": 0
                },
                {
                    "sent": "So to follow up cabinets question and also the systems issue, I mean Providence is a big problem right away.",
                    "label": 0
                },
                {
                    "sent": "Providence had trust.",
                    "label": 0
                },
                {
                    "sent": "So is that 10 year challenge?",
                    "label": 0
                },
                {
                    "sent": "Is that 50?",
                    "label": 0
                },
                {
                    "sent": "Providence.",
                    "label": 0
                },
                {
                    "sent": "Oh, I was thinking.",
                    "label": 0
                },
                {
                    "sent": "Oh, I'm the origin of the data.",
                    "label": 0
                },
                {
                    "sent": "I think you have to design the system assuming that you will have other size, giving the data to you.",
                    "label": 0
                },
                {
                    "sent": "Nothing short of that can scale, and that is part of what went wrong in the past.",
                    "label": 0
                },
                {
                    "sent": "We must learn from it.",
                    "label": 0
                },
                {
                    "sent": "You can't build the system and hope that there is going to be true and false, and that is never going to change.",
                    "label": 0
                },
                {
                    "sent": "The system must be designed from the first minute in the assumption that you will receive.",
                    "label": 0
                },
                {
                    "sent": "Other sale information and you will have to revise your beliefs all along.",
                    "label": 0
                },
                {
                    "sent": "Short of that.",
                    "label": 0
                },
                {
                    "sent": "You don't have any robust autonomous.",
                    "label": 0
                },
                {
                    "sent": "That is why you want to go in the real world and use the web for example.",
                    "label": 0
                },
                {
                    "sent": "Otherwise you go back into your synthetic block world where you have a cube to be put on another cube in a white environment with constant lighting.",
                    "label": 0
                },
                {
                    "sent": "We've done that.",
                    "label": 0
                },
                {
                    "sent": "It's obvious that.",
                    "label": 0
                },
                {
                    "sent": "Even the notion of two an false statement.",
                    "label": 0
                },
                {
                    "sent": "I have some.",
                    "label": 0
                },
                {
                    "sent": "Yeah I I know some students would say that notion is so 80s that is so 1980s two or false statements.",
                    "label": 0
                },
                {
                    "sent": "Dynamics.",
                    "label": 0
                },
                {
                    "sent": "Also also not all about but also don't.",
                    "label": 0
                },
                {
                    "sent": "Well, summer.",
                    "label": 0
                },
                {
                    "sent": "Stepping basically static.",
                    "label": 0
                },
                {
                    "sent": "The manager got his account manager.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "You, you're getting this feedback.",
                    "label": 0
                },
                {
                    "sent": "That problem is instantly difficult.",
                    "label": 0
                },
                {
                    "sent": "There is a community that started to study this matter.",
                    "label": 0
                },
                {
                    "sent": "General artificial Intel.",
                    "label": 0
                },
                {
                    "sent": "Yes, I I like the bandit.",
                    "label": 0
                },
                {
                    "sent": "I like enforcement learning.",
                    "label": 0
                },
                {
                    "sent": "I know there are lots of people working in these things and I'm not claiming that we haven't done anything we should be doing it.",
                    "label": 0
                },
                {
                    "sent": "I think these things are happening.",
                    "label": 0
                },
                {
                    "sent": "I wanted to actually emphasize it.",
                    "label": 0
                },
                {
                    "sent": "This is the next step and people are doing it enforcement abandoned policy.",
                    "label": 0
                },
                {
                    "sent": "As for General Fishel, intelligence like to say.",
                    "label": 0
                },
                {
                    "sent": "The noise to signal ratio is such that I don't understand what's going on to be honest, but I'm sure it's something we cannot do it.",
                    "label": 0
                },
                {
                    "sent": "I just put the moment I've been trying to follow up and.",
                    "label": 0
                },
                {
                    "sent": "It takes a lot of patience, so I can't.",
                    "label": 0
                },
                {
                    "sent": "I can't say much.",
                    "label": 0
                },
                {
                    "sent": "Well then again, I think we should thank the organizers alot for this impressive.",
                    "label": 0
                },
                {
                    "sent": "Performers, thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}