{
    "id": "rkqtonlseenby5h27jajfgrih5bdz6yz",
    "title": "Maltese",
    "info": {
        "author": [
            "Mike Rosner, Department of Intelligent Computer Systems, University of Malta"
        ],
        "published": "July 15, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Humanities->Languages"
        ]
    },
    "url": "http://videolectures.net/translingeu2010_rosner_maltese/",
    "segmentation": [
        [
            "OK, so to start with a small language model is very small place and I think one of the things I want to get across today is that this is a problem.",
            "And I've been told this too."
        ],
        [
            "Maltese on the brink.",
            "Because in a sense we are on the brink of decisions having to be made at national level, which will either advance or not advance the state of computational approaches to the Maltese language.",
            "What you see there is, but I want to add the various people who are involved with Maltese with computational approaches to Maltese.",
            "That is the basically the the people in the country who are involved.",
            "It's a sensing which is small.",
            "That's the team and there aren't very many others, so it's a small team working on on this area what I wanted."
        ],
        [
            "About is a little bit about Malta Maltese language itself.",
            "Secondly, about its official status.",
            "Finish with with something about concurrent projects which are going on and then I'll mention a couple of issues to conclude with."
        ],
        [
            "I'll go through this in 10 minutes and I will."
        ],
        [
            "Can be fast, so one of the main features of Maltese is that it is a mixed language.",
            "OK, it's a mixture of Arabic and romance and English and you can see this by just looking at the words a little bit here.",
            "The word for the word for dog is kelp, which is from the from the Arabic word which is the same.",
            "Whereas cut off site is aware we will know if we know romance languages means a carriage or or something which on wheels.",
            "So that's familiar enough.",
            "We also have words which are clearly coming from English which have received a new kind of spelling.",
            "So there was switch the word for a nurse working in a hospital, and the last one is OK, Alright.",
            "Another feature that it's got a lot in script.",
            "Mostly there are few characters which are which are different, but it's mostly Latin scripts familiar and unlike Arabic vowels always written."
        ],
        [
            "Now let me just a little bit more about this notion of a mixture.",
            "The semantic side of the language is follows the rules which we see in Semitic languages.",
            "So it's based on triliteral roots OK and the way in which words are formed is not concatenated, which means that I'll show you an example environment, but it's not confirmed by concatenating prefixes and prefixes only to form a word, whereas a monster magic side of the language which is basically romance is based on stems.",
            "It is competitive, and it's it's received its input from Sicilian.",
            "Italian and."
        ],
        [
            "English we can even see this in in the same phrase as the same English phrase translated in different ways.",
            "The If you want the semantic way of doing it, and the Italian way of doing it.",
            "So the the phrase the Maltese language on the Arabic side.",
            "Takes the world Lucy multi.",
            "The tongue Maltese and on the other side on it, on the romance side we see in lingua multia which is far more understandable to people in from romance countries."
        ],
        [
            "To show you how words are formed.",
            "Go back to that Arabic, the Arabic side and you see it will scene.",
            "You'll notice that the word for the word for tongue is composed of three continents, aanenson vowels.",
            "So you take those three consonants.",
            "LSN on top of the other top and then vowels get interdigitate interdigitate inside to form various different way different words which are built on top of these three basic consonants so we can see if you look along the English column you will see many words which have to do with tongue speaking and so on.",
            "So talk, say uttered the word tengwar language is the word utterance and the word dictionary and these are formed by basically plugging in different.",
            "Different vowels into the Internet.",
            "Basic pattern.",
            "OK, so we get a lot of different forms for you know for the same basic idea and this is this is going to cause problems when it comes to recognizing words on the page is not always that easy to get from the page.",
            "The page word to the word in the dictionary which is referred which is refer."
        ],
        [
            "2 On the other side, we take the word lingua, and you'll see that there can.",
            "You can also for many words, from lingua, but they all share basically the same main part.",
            "It's it's formed competitively, and the beast Mlin GW is there forever to see preserved throughout."
        ],
        [
            "OK, I think I'll have my dinner time.",
            "5 minutes OK. 5 minutes, just another another couple of."
        ],
        [
            "Ages of Maltese, which I thought might mention."
        ],
        [
            "Is that we have like Italian, we can put all kinds of endings on the end of words, and so the distinction between the, let's say the word morphology and the syntax is much more blurred than it would be in other European languages.",
            "So for example, here we have the translator translated form is I didn't send it to her where we've got the first part of that of the Maltese word, but is send.",
            "And remainder is.",
            "Fixes which are giving the rest of that sentence meaning OK.",
            "So again from the point of view of of analysis on the page, there's some complicated morphology taking place there, which is I've just challenge for us."
        ],
        [
            "We see verbs with from Italian and from English, both taking on the morphology of of Maltese.",
            "Here Spiga is is the Italian borrowing which many of you will know, and on the English side the word for kick as in football is shoot shoot you.",
            "So that's shooting shooting the ball and these have been taken on the morphology of.",
            "Of these, from the semantic side, and are now part of the semantic side of the language."
        ],
        [
            "OK, briefly, the language that you."
        ],
        [
            "Malta, Malta is with the national language and it's an official language.",
            "So as a national language it is seem to be representative of the culture and has to be preserved as such.",
            "But English is also an official language meat, which means that laws and governmental correspondence normally take place both in those two languages and in reality this makes for some difficulties because there's a strong tendency for English to be used.",
            "Actually in government departments internally.",
            "And we tend to see that Maltese is mostly spoken language, whilst English tends to be the written.",
            "The written reality tends to be in English.",
            "Being there there are there are written.",
            "There are newspapers in Maltese.",
            "The reality you see as a walking around in the street is in English."
        ],
        [
            "So what you see in this graph is the the blue column is the number of the percentage of speakers who speak Maltese at home, and that represents approximately 95% of speakers in the country speaking at home, so it's by no means an artificial languages being being reconstructed constituted.",
            "It's spoken by nearly everybody, so it's very very widely used.",
            "English at Home is spoken, unless it's the Green column next to the next to the blue one, that's the."
        ],
        [
            "First language of people.",
            "So the first language is very much Maltese wealth, the written language.",
            "There's a typical Maltese kind of junky kind of scene, and you can see all of the signs on the street.",
            "They will.",
            "They will learn English and including you'll see the paint, the letters on the lorry or also in English.",
            "So the printed reality is very much."
        ],
        [
            "It's still in English.",
            "Since 2004, then it became an official EU language.",
            "It received a higher socio political status.",
            "An increase in the awareness of the languages as something which has to be translated into other languages.",
            "Particularly European context need for translators, developments in terminology and standardization of orthography in order to bring in new terminology.",
            "National Council for the Maltese Language is formed in 2000."
        ],
        [
            "Five, and I think I'm going to get all the bullet points.",
            "I don't have time, but the last one is interesting.",
            "The the idea is to establish a National Center of the Maltese language which besides serving as an office for the Council, we have the we have the Council, but it has no premises.",
            "So hopefully get an office for this.",
            "One day will also be a place which were naturally language resource is might be centralized, so we're looking."
        ],
        [
            "To do to do that, current projects we have a lot of bits and pieces that."
        ],
        [
            "The basic the basic problem we have is that you have only one minute, one minute, little bits and pieces.",
            "I won't go through all of these, but there are a number of very small projects which tend to last a long time, but with bursts of activity intermittently.",
            "So for us one of the problem."
        ],
        [
            "Is sustainability of effort in a given direction?",
            "Let me well, I haven't got."
        ],
        [
            "The future with that, I'll give you my final slide so."
        ],
        [
            "The conclusions are it's a mixed language in a true sense and very complex.",
            "For that reason we still lack a lot of basic language resource is we lack stable funding.",
            "When we have something with chicken and egg situation regarding the users and the funders, you know the fun to say, well, who's going to use this technology and the total number of people using this technology will always be small.",
            "I think we are at the brink because in order to survive in order to survive and in order for the language to survive at technological level, it requires significant investment and that has to come from national decisions decisions at a national level, not really by people working at University.",
            "So we have to do a balancing act here between between conserving what the essentials of the language and modernizing in the face of technology.",
            "Thank you very much."
        ],
        [
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so to start with a small language model is very small place and I think one of the things I want to get across today is that this is a problem.",
                    "label": 0
                },
                {
                    "sent": "And I've been told this too.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maltese on the brink.",
                    "label": 0
                },
                {
                    "sent": "Because in a sense we are on the brink of decisions having to be made at national level, which will either advance or not advance the state of computational approaches to the Maltese language.",
                    "label": 0
                },
                {
                    "sent": "What you see there is, but I want to add the various people who are involved with Maltese with computational approaches to Maltese.",
                    "label": 0
                },
                {
                    "sent": "That is the basically the the people in the country who are involved.",
                    "label": 0
                },
                {
                    "sent": "It's a sensing which is small.",
                    "label": 0
                },
                {
                    "sent": "That's the team and there aren't very many others, so it's a small team working on on this area what I wanted.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "About is a little bit about Malta Maltese language itself.",
                    "label": 1
                },
                {
                    "sent": "Secondly, about its official status.",
                    "label": 0
                },
                {
                    "sent": "Finish with with something about concurrent projects which are going on and then I'll mention a couple of issues to conclude with.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll go through this in 10 minutes and I will.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Can be fast, so one of the main features of Maltese is that it is a mixed language.",
                    "label": 0
                },
                {
                    "sent": "OK, it's a mixture of Arabic and romance and English and you can see this by just looking at the words a little bit here.",
                    "label": 0
                },
                {
                    "sent": "The word for the word for dog is kelp, which is from the from the Arabic word which is the same.",
                    "label": 0
                },
                {
                    "sent": "Whereas cut off site is aware we will know if we know romance languages means a carriage or or something which on wheels.",
                    "label": 0
                },
                {
                    "sent": "So that's familiar enough.",
                    "label": 0
                },
                {
                    "sent": "We also have words which are clearly coming from English which have received a new kind of spelling.",
                    "label": 0
                },
                {
                    "sent": "So there was switch the word for a nurse working in a hospital, and the last one is OK, Alright.",
                    "label": 0
                },
                {
                    "sent": "Another feature that it's got a lot in script.",
                    "label": 0
                },
                {
                    "sent": "Mostly there are few characters which are which are different, but it's mostly Latin scripts familiar and unlike Arabic vowels always written.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let me just a little bit more about this notion of a mixture.",
                    "label": 0
                },
                {
                    "sent": "The semantic side of the language is follows the rules which we see in Semitic languages.",
                    "label": 0
                },
                {
                    "sent": "So it's based on triliteral roots OK and the way in which words are formed is not concatenated, which means that I'll show you an example environment, but it's not confirmed by concatenating prefixes and prefixes only to form a word, whereas a monster magic side of the language which is basically romance is based on stems.",
                    "label": 0
                },
                {
                    "sent": "It is competitive, and it's it's received its input from Sicilian.",
                    "label": 0
                },
                {
                    "sent": "Italian and.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "English we can even see this in in the same phrase as the same English phrase translated in different ways.",
                    "label": 0
                },
                {
                    "sent": "The If you want the semantic way of doing it, and the Italian way of doing it.",
                    "label": 0
                },
                {
                    "sent": "So the the phrase the Maltese language on the Arabic side.",
                    "label": 1
                },
                {
                    "sent": "Takes the world Lucy multi.",
                    "label": 0
                },
                {
                    "sent": "The tongue Maltese and on the other side on it, on the romance side we see in lingua multia which is far more understandable to people in from romance countries.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To show you how words are formed.",
                    "label": 0
                },
                {
                    "sent": "Go back to that Arabic, the Arabic side and you see it will scene.",
                    "label": 0
                },
                {
                    "sent": "You'll notice that the word for the word for tongue is composed of three continents, aanenson vowels.",
                    "label": 0
                },
                {
                    "sent": "So you take those three consonants.",
                    "label": 0
                },
                {
                    "sent": "LSN on top of the other top and then vowels get interdigitate interdigitate inside to form various different way different words which are built on top of these three basic consonants so we can see if you look along the English column you will see many words which have to do with tongue speaking and so on.",
                    "label": 0
                },
                {
                    "sent": "So talk, say uttered the word tengwar language is the word utterance and the word dictionary and these are formed by basically plugging in different.",
                    "label": 0
                },
                {
                    "sent": "Different vowels into the Internet.",
                    "label": 0
                },
                {
                    "sent": "Basic pattern.",
                    "label": 0
                },
                {
                    "sent": "OK, so we get a lot of different forms for you know for the same basic idea and this is this is going to cause problems when it comes to recognizing words on the page is not always that easy to get from the page.",
                    "label": 0
                },
                {
                    "sent": "The page word to the word in the dictionary which is referred which is refer.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "2 On the other side, we take the word lingua, and you'll see that there can.",
                    "label": 0
                },
                {
                    "sent": "You can also for many words, from lingua, but they all share basically the same main part.",
                    "label": 0
                },
                {
                    "sent": "It's it's formed competitively, and the beast Mlin GW is there forever to see preserved throughout.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I think I'll have my dinner time.",
                    "label": 0
                },
                {
                    "sent": "5 minutes OK. 5 minutes, just another another couple of.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ages of Maltese, which I thought might mention.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is that we have like Italian, we can put all kinds of endings on the end of words, and so the distinction between the, let's say the word morphology and the syntax is much more blurred than it would be in other European languages.",
                    "label": 0
                },
                {
                    "sent": "So for example, here we have the translator translated form is I didn't send it to her where we've got the first part of that of the Maltese word, but is send.",
                    "label": 1
                },
                {
                    "sent": "And remainder is.",
                    "label": 0
                },
                {
                    "sent": "Fixes which are giving the rest of that sentence meaning OK.",
                    "label": 0
                },
                {
                    "sent": "So again from the point of view of of analysis on the page, there's some complicated morphology taking place there, which is I've just challenge for us.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We see verbs with from Italian and from English, both taking on the morphology of of Maltese.",
                    "label": 0
                },
                {
                    "sent": "Here Spiga is is the Italian borrowing which many of you will know, and on the English side the word for kick as in football is shoot shoot you.",
                    "label": 0
                },
                {
                    "sent": "So that's shooting shooting the ball and these have been taken on the morphology of.",
                    "label": 0
                },
                {
                    "sent": "Of these, from the semantic side, and are now part of the semantic side of the language.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, briefly, the language that you.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Malta, Malta is with the national language and it's an official language.",
                    "label": 0
                },
                {
                    "sent": "So as a national language it is seem to be representative of the culture and has to be preserved as such.",
                    "label": 0
                },
                {
                    "sent": "But English is also an official language meat, which means that laws and governmental correspondence normally take place both in those two languages and in reality this makes for some difficulties because there's a strong tendency for English to be used.",
                    "label": 1
                },
                {
                    "sent": "Actually in government departments internally.",
                    "label": 0
                },
                {
                    "sent": "And we tend to see that Maltese is mostly spoken language, whilst English tends to be the written.",
                    "label": 1
                },
                {
                    "sent": "The written reality tends to be in English.",
                    "label": 0
                },
                {
                    "sent": "Being there there are there are written.",
                    "label": 0
                },
                {
                    "sent": "There are newspapers in Maltese.",
                    "label": 0
                },
                {
                    "sent": "The reality you see as a walking around in the street is in English.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what you see in this graph is the the blue column is the number of the percentage of speakers who speak Maltese at home, and that represents approximately 95% of speakers in the country speaking at home, so it's by no means an artificial languages being being reconstructed constituted.",
                    "label": 0
                },
                {
                    "sent": "It's spoken by nearly everybody, so it's very very widely used.",
                    "label": 0
                },
                {
                    "sent": "English at Home is spoken, unless it's the Green column next to the next to the blue one, that's the.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First language of people.",
                    "label": 0
                },
                {
                    "sent": "So the first language is very much Maltese wealth, the written language.",
                    "label": 1
                },
                {
                    "sent": "There's a typical Maltese kind of junky kind of scene, and you can see all of the signs on the street.",
                    "label": 0
                },
                {
                    "sent": "They will.",
                    "label": 0
                },
                {
                    "sent": "They will learn English and including you'll see the paint, the letters on the lorry or also in English.",
                    "label": 0
                },
                {
                    "sent": "So the printed reality is very much.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's still in English.",
                    "label": 0
                },
                {
                    "sent": "Since 2004, then it became an official EU language.",
                    "label": 0
                },
                {
                    "sent": "It received a higher socio political status.",
                    "label": 0
                },
                {
                    "sent": "An increase in the awareness of the languages as something which has to be translated into other languages.",
                    "label": 0
                },
                {
                    "sent": "Particularly European context need for translators, developments in terminology and standardization of orthography in order to bring in new terminology.",
                    "label": 0
                },
                {
                    "sent": "National Council for the Maltese Language is formed in 2000.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Five, and I think I'm going to get all the bullet points.",
                    "label": 0
                },
                {
                    "sent": "I don't have time, but the last one is interesting.",
                    "label": 0
                },
                {
                    "sent": "The the idea is to establish a National Center of the Maltese language which besides serving as an office for the Council, we have the we have the Council, but it has no premises.",
                    "label": 1
                },
                {
                    "sent": "So hopefully get an office for this.",
                    "label": 0
                },
                {
                    "sent": "One day will also be a place which were naturally language resource is might be centralized, so we're looking.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To do to do that, current projects we have a lot of bits and pieces that.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The basic the basic problem we have is that you have only one minute, one minute, little bits and pieces.",
                    "label": 0
                },
                {
                    "sent": "I won't go through all of these, but there are a number of very small projects which tend to last a long time, but with bursts of activity intermittently.",
                    "label": 0
                },
                {
                    "sent": "So for us one of the problem.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is sustainability of effort in a given direction?",
                    "label": 0
                },
                {
                    "sent": "Let me well, I haven't got.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The future with that, I'll give you my final slide so.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The conclusions are it's a mixed language in a true sense and very complex.",
                    "label": 1
                },
                {
                    "sent": "For that reason we still lack a lot of basic language resource is we lack stable funding.",
                    "label": 1
                },
                {
                    "sent": "When we have something with chicken and egg situation regarding the users and the funders, you know the fun to say, well, who's going to use this technology and the total number of people using this technology will always be small.",
                    "label": 1
                },
                {
                    "sent": "I think we are at the brink because in order to survive in order to survive and in order for the language to survive at technological level, it requires significant investment and that has to come from national decisions decisions at a national level, not really by people working at University.",
                    "label": 0
                },
                {
                    "sent": "So we have to do a balancing act here between between conserving what the essentials of the language and modernizing in the face of technology.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}