{
    "id": "rqeagmbclb44jx6oiintotadipqhmca5",
    "title": "Label Ranking with Partial Abstention Using Ensemble Learning",
    "info": {
        "author": [
            "Weiwei Cheng, Mathematik und Informatik, Philipps-Universität Marburg"
        ],
        "published": "Oct. 20, 2009",
        "recorded": "September 2009",
        "category": [
            "Top->Computer Science->Machine Learning->Ensemble Methods"
        ]
    },
    "url": "http://videolectures.net/ecmlpkdd09_cheng_lrpauel/",
    "segmentation": [
        [
            "Alright, so I'm here to talk about label ranking problem and basically everybody would know what LeBron guess and here I want to present a label ranking method which is able to say.",
            "Abstain alittle, you know.",
            "And actually we're not obligated to say output a full ranking, but instead of that we're able to output a partial ranking.",
            "And why are we doing that?",
            "We will see in a minute, so I don't have to say this is a coworker smile wiser.",
            "I can hear my so.",
            "OK, So what is label ranking?",
            "So I guess everybody knows that already, but I just mention."
        ],
        [
            "For example, you gotta several hotels and you know every different customer might have different preference and hotel hotels so.",
            "By the way, you might know that all these three hotels actually belong to the same company.",
            "OK, so for that company is really necessary or interested to know that what is a new customers preference on the different hotels?",
            "And this kind of type of problem.",
            "We can also represent it in terms of a permutation.",
            "It is the same thing, but just, you know, for some mathematical convenience.",
            "Sometime we presented in terms of permutation.",
            "And formally, that a label ranking problem is we have a set of, say, training stones and a set of labels.",
            "Will we also have a set of pairwise preference?"
        ],
        [
            "It tells you for certain instance which labor is preferred to which one.",
            "OK, and the goal is of course we want to learn a ranking function which give you instance it."
        ],
        [
            "Output the ranking.",
            "And of course, this prediction should generalize well in terms of a predefined loss function.",
            "For example, can just talk.",
            "All.",
            "I mean, label ranking problem is actually really say quite a common problem you can find in real day life.",
            "So there are already some work on this problem.",
            "Here are.",
            "Here is a list of some representative method.",
            "And I highlight this one because."
        ],
        [
            "In this work we using this parallels approach as a base learner, but in fact you could also use some other method will lead to say similar results.",
            "OK, so.",
            "So here's an idea that.",
            "I gave your training data.",
            "You train the model and in the test time you just apply the model, then your output."
        ],
        [
            "A ranking.",
            "Right?",
            "But The thing is that especially.",
            "Talking about a prediction that normally you should take some time, some application you would like to say that.",
            "You would like to measure the learner.",
            "Act with more caution.",
            "The idea is if you are not sure, you should say you don't know.",
            "Right, I mean this is actually.",
            "Sometimes when necessary, in some some domains.",
            "For example, in medical treatment, right?",
            "It's very necessary.",
            "For learner be able to say I don't know.",
            "For example, in the tumor diagnostic detection, right?",
            "Because the consequent of.",
            "Miss protection is severe, right?",
            "So we cannot afford to make a mistake.",
            "Another example is for example, in criminal detection right, you cannot make mistake.",
            "Otherwise you could just destroy another Bill Gates for example.",
            "Oh actually some kind of problem, say such kind of setting in classification.",
            "We call that learning with project option.",
            "And, uh."
        ],
        [
            "Learning with your check option in classification is already being addressed for long time.",
            "But for label ranking so far.",
            "We haven't seen any work on that.",
            "And actually, if you think about it, this learning with project option is even more interesting for say in label ranking problem because in conventional classification you could only say make a prediction or not.",
            "But in label ranking setting you could say you upstairs in a certain degree right?",
            "Because for each pair of labels.",
            "You could decide if you output the prediction.",
            "Or you choose the reject option.",
            "And of course, you would also like the learner to be consistent, which means the output should be transitive.",
            "OK, so if you can call all the things together, actually the learner is now then.",
            "Not obligated to output the total order, but it said a partial order.",
            "Alright.",
            "Now the problem is how do we?",
            "How do we realize it?",
            "We use ensembling.",
            "Actually, when you're using, sample learning is quite natural, say to represent such kind of reliability of prediction.",
            "Right, because you just use voting OK?"
        ],
        [
            "It is also widely done in the real life.",
            "Right, but sometimes not working, but.",
            "OK, so.",
            "Here's the idea.",
            "If you have a test data.",
            "Then we set up a ranking in sample of size K, so he."
        ],
        [
            "K for example, you have K members of the example.",
            "Then you output K different rankings.",
            "And then what you do is you define the partial order.",
            "That is, if this ensemble agree with the comparison, your output it.",
            "This is so natural, most natural way to do it.",
            "But of course, in practice this condition might be to say two strength to strict.",
            "So in practice, normally what you can do is this way.",
            "This is actually majority voting.",
            "Right?",
            "So this is how people normally do in practice.",
            "Now here comes the problem.",
            "If we use such kind of majority voting.",
            "We have to make sure the output is consistent."
        ],
        [
            "So namely, we haven't facing our two problems.",
            "First, how can we make sure?",
            "As output ranking.",
            "Is transitive, the output is transitive right?",
            "And the second problem is, how can we make sure there's no circle in output?",
            "Right?",
            "Actually, on this transitive problem is already being addressed in order, sorry.",
            "Basically we can just using this transitive chloro so you just can you sing this Marshall algorithm to get a transitive closure.",
            "Then you can make sure the output relation is transitive.",
            "And the second problem is we have to make sure the relation is has no circle, then it is.",
            "There will be addressed in this work.",
            "So basically we have the fall."
        ],
        [
            "Boring.",
            "Position which I want to hear.",
            "I just loaded down here, so basic idea is.",
            "If you do know this proportion of two labels a better than B is pabs, then we having the following result, that is PSA is smaller than two minus PAB minus PSA.",
            "What is that mean?",
            "What does that mean?",
            "That means that.",
            "Immediately you can have this following if you said Pabs is bigger than two, Sir.",
            "And people say also bigger than two Sir.",
            "Then you immediately can get that piece and small run through Sir.",
            "This is actually equal to say if we set a threshold which is bigger than two Sir, you automatically make sure that the result relation has no circle.",
            "OK.",
            "So basically the second problem is also solved.",
            "Now I jump to the experimental."
        ],
        [
            "Result we have test on several datasets.",
            "And we're choosing this evaluation metric, which is basically extension of this cattle distance.",
            "So here actually we compare our prediction and it is a partial ranking.",
            "Compared with the true ranking.",
            "OK.",
            "So here comes the result.",
            "So basically what I do here is I said in sample size."
        ],
        [
            "Of turn an, I compare the different threshold value and to see what is the performance and this origonal means that we don't train and assemble will just take the order in the base learner or trend it on the original data site.",
            "OK, the way we generalize this example is using begging.",
            "OK, we're just packing the data.",
            "So as you can see, it's quite clear that if you're increasing the threshold.",
            "We push the result higher OK.",
            "The particulate get higher.",
            "The result is quite clear.",
            "It's pretty much the other thing I want to say actually.",
            "I believe this is the first attempt that."
        ],
        [
            "How to make label ranking method say has a reject option?",
            "And we have designed assemble learning, so which can output a reliable partial ranking.",
            "OK. And of course, I believe this is another story because I believe this label ranking with reject option is a really interesting topic and I believe this deserves further application.",
            "So I hope more people will follow this kind of line and do some work on this kind of topic.",
            "So basically that is all I want to say.",
            "So thank you very much."
        ],
        [
            "Yeah please.",
            "Yeah, this I didn't understand why the second doesn't immediately follow from the first.",
            "If it's transitive it can't have cycles.",
            "No, not really.",
            "For example.",
            "Let's just use it about.",
            "I see.",
            "If you say if you consider this is a relation matrix.",
            "I can say this is also transitive.",
            "But this has to go right?",
            "It's always transitive.",
            "For example, if you have a label ABC ABC.",
            "Then this one miss is better than be.",
            "So if this arrow, which means there's no such relation, but if it's one, which means it's better than be.",
            "If you have such kind of relation matrix, you also still have transitive transitivity, but you don't have.",
            "You also have circle.",
            "OK, everything is better than everything.",
            "Yep, you're still transitive, but still not.",
            "So you still have to solve this 2 problems.",
            "OK, it's alright cool.",
            "Expected value add up to one so you cannot have this situation.",
            "Yeah, it's in class exactly.",
            "Left yeah, this is.",
            "Transitivity, or simpler set?",
            "It means that if you put these values on a weighted graph, even if they are not symmetric, you get the triangle.",
            "And is the weakest thing that you get.",
            "I can I have a proof for that in general?",
            "OK, if you have a collection of random variables that you compare them pairwise week in winning matters, how many times is XP?",
            "Why we can never go beyond this problem all right now if you go next to the next slide.",
            "Alright.",
            "Brakes.",
            "Yeah please yes because what you exclude here is the existence of free cycles.",
            "But there could be 4 cycles, five side, 6 hours or so."
        ],
        [
            "So you have to get higher and higher and higher if you want to exclude all sites.",
            "Relations is not sufficient, so by doing this you know there cannot be a cycle of three.",
            "Yeah, but there could be a cycle before also interesting.",
            "OK, please show me later about this.",
            "Thank you for letting me.",
            "Very much.",
            "That's that's a good point here.",
            "I mean this stuff with a look at the average I know, and in the our AI Journal Paper we exactly made that point and I get the reference letter to look like yours.",
            "It's a special case.",
            "This is exactly the result.",
            "I know you have a big paper.",
            "Framework this is definitely so.",
            "In fact the the answer here is very poor.",
            "If you do not know his answer, but if you want to solve it.",
            "So if you want to avoid to have cycles, yeah, but also for cycles 5 cycles up to Infinity.",
            "The only thing that works is to cut at one.",
            "I sent.",
            "So in every audience understaffed agree on everything.",
            "So just like I think I'm.",
            "Otherwise, you can never assure that it was outside.",
            "Thanks.",
            "I don't know when you go back to the results card with the table.",
            "I mean, this was really a bit quick.",
            "Maybe I would like to ask.",
            "And did anybody get the main idea why actually we expect the results to become better with increasing pressure?",
            "T actually went very fast.",
            "Exactly.",
            "If we increase the threat."
        ],
        [
            "So the learner abstains more, so the predictions that he makes become more and more partial.",
            "And if you go back one slide, you see that the measure here evaluation metric is only evaluated."
        ],
        [
            "On the subset of pairwise relations on which the learner does not have state.",
            "So the key idea, of course is that if the learner abstains in a reasonable way.",
            "Then it abstains on those pairwise relations that are really uncertain, which means.",
            "The more the learner of states, the better it should become on the remaining pairwise relations for which he makes a prediction.",
            "And this is essentially the way how to evaluate this type of learners with the reject option and what way has shown on the next.",
            "On the table, on the on the in the table, on the next slide is basically the counterpart of what for classification is called the accuracy rejection curve.",
            "When you plot the performance of the classifier as a function of its degree of of extension, and as we have seen in the table, it really nicely increases in terms of performance and this basically shows that this relatively simple a way of implementing abstention in labor ranking at least seems to work essentially like trade.",
            "This recall with the position.",
            "So something like that.",
            "I missed something there.",
            "I guess if you ask input from the user or the data.",
            "You want to receive statements like Label 8 fits better than they will be.",
            "First pairwise kind of.",
            "Then I am.",
            "I'm surprised because if you look at the preference modeling for your reference structures as we have now, you allow for incompatibility innocence.",
            "I'm not able to compare, so I don't know.",
            "Think before it's indifference.",
            "You build a partial order, but you ask for stickers.",
            "I could be sure that both labels labels fit perfectly.",
            "And I'm not able to say they are equal in this framework, no, no there there is a subtle difference.",
            "I mean what we assume is really that with every instance we can associate the total order.",
            "The learner is only able to say.",
            "Basically, I'm not sure enough to make this prediction and then start to the total order.",
            "Yeah, OK, that's why I abstain.",
            "That's that's the subtle difference.",
            "So.",
            "But if you would allow for recorders.",
            "I'm loving to agree on indifference.",
            "That's true, yes.",
            "In the in the label ranking setting that we studied so far, we always proceed from total office because otherwise it comes with.",
            "Please.",
            "Questions question what is the percentage of?",
            "Extension in in your weight 40% section in your next time I mean, of course it's good to be able to say well here I'm not sure enough, but at the same time you're back.",
            "OK, yeah, I.",
            "Ideally, shoulder here.",
            "Actually I should also plot here, but it's not here actually.",
            "I think in the paper question paper, maybe the paper.",
            "If not, I could also show you later because we have the status as well.",
            "Because I think the board is that you be as precise as possible, yeah?",
            "You should say something as soon as often as possible.",
            "Just show it's actually this recall and position as you have dependencies.",
            "Some if one score variant or something like that would be.",
            "Yeah, exactly.",
            "Maybe even tell her.",
            "Or later.",
            "Sex.",
            "Right?",
            "5 minutes.",
            "Text."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so I'm here to talk about label ranking problem and basically everybody would know what LeBron guess and here I want to present a label ranking method which is able to say.",
                    "label": 0
                },
                {
                    "sent": "Abstain alittle, you know.",
                    "label": 0
                },
                {
                    "sent": "And actually we're not obligated to say output a full ranking, but instead of that we're able to output a partial ranking.",
                    "label": 0
                },
                {
                    "sent": "And why are we doing that?",
                    "label": 0
                },
                {
                    "sent": "We will see in a minute, so I don't have to say this is a coworker smile wiser.",
                    "label": 0
                },
                {
                    "sent": "I can hear my so.",
                    "label": 0
                },
                {
                    "sent": "OK, So what is label ranking?",
                    "label": 0
                },
                {
                    "sent": "So I guess everybody knows that already, but I just mention.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, you gotta several hotels and you know every different customer might have different preference and hotel hotels so.",
                    "label": 0
                },
                {
                    "sent": "By the way, you might know that all these three hotels actually belong to the same company.",
                    "label": 0
                },
                {
                    "sent": "OK, so for that company is really necessary or interested to know that what is a new customers preference on the different hotels?",
                    "label": 0
                },
                {
                    "sent": "And this kind of type of problem.",
                    "label": 0
                },
                {
                    "sent": "We can also represent it in terms of a permutation.",
                    "label": 0
                },
                {
                    "sent": "It is the same thing, but just, you know, for some mathematical convenience.",
                    "label": 0
                },
                {
                    "sent": "Sometime we presented in terms of permutation.",
                    "label": 0
                },
                {
                    "sent": "And formally, that a label ranking problem is we have a set of, say, training stones and a set of labels.",
                    "label": 0
                },
                {
                    "sent": "Will we also have a set of pairwise preference?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It tells you for certain instance which labor is preferred to which one.",
                    "label": 0
                },
                {
                    "sent": "OK, and the goal is of course we want to learn a ranking function which give you instance it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Output the ranking.",
                    "label": 0
                },
                {
                    "sent": "And of course, this prediction should generalize well in terms of a predefined loss function.",
                    "label": 1
                },
                {
                    "sent": "For example, can just talk.",
                    "label": 0
                },
                {
                    "sent": "All.",
                    "label": 0
                },
                {
                    "sent": "I mean, label ranking problem is actually really say quite a common problem you can find in real day life.",
                    "label": 0
                },
                {
                    "sent": "So there are already some work on this problem.",
                    "label": 0
                },
                {
                    "sent": "Here are.",
                    "label": 0
                },
                {
                    "sent": "Here is a list of some representative method.",
                    "label": 0
                },
                {
                    "sent": "And I highlight this one because.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this work we using this parallels approach as a base learner, but in fact you could also use some other method will lead to say similar results.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "So here's an idea that.",
                    "label": 0
                },
                {
                    "sent": "I gave your training data.",
                    "label": 0
                },
                {
                    "sent": "You train the model and in the test time you just apply the model, then your output.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A ranking.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "But The thing is that especially.",
                    "label": 0
                },
                {
                    "sent": "Talking about a prediction that normally you should take some time, some application you would like to say that.",
                    "label": 0
                },
                {
                    "sent": "You would like to measure the learner.",
                    "label": 0
                },
                {
                    "sent": "Act with more caution.",
                    "label": 0
                },
                {
                    "sent": "The idea is if you are not sure, you should say you don't know.",
                    "label": 0
                },
                {
                    "sent": "Right, I mean this is actually.",
                    "label": 0
                },
                {
                    "sent": "Sometimes when necessary, in some some domains.",
                    "label": 0
                },
                {
                    "sent": "For example, in medical treatment, right?",
                    "label": 0
                },
                {
                    "sent": "It's very necessary.",
                    "label": 0
                },
                {
                    "sent": "For learner be able to say I don't know.",
                    "label": 1
                },
                {
                    "sent": "For example, in the tumor diagnostic detection, right?",
                    "label": 0
                },
                {
                    "sent": "Because the consequent of.",
                    "label": 0
                },
                {
                    "sent": "Miss protection is severe, right?",
                    "label": 0
                },
                {
                    "sent": "So we cannot afford to make a mistake.",
                    "label": 0
                },
                {
                    "sent": "Another example is for example, in criminal detection right, you cannot make mistake.",
                    "label": 0
                },
                {
                    "sent": "Otherwise you could just destroy another Bill Gates for example.",
                    "label": 0
                },
                {
                    "sent": "Oh actually some kind of problem, say such kind of setting in classification.",
                    "label": 0
                },
                {
                    "sent": "We call that learning with project option.",
                    "label": 0
                },
                {
                    "sent": "And, uh.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Learning with your check option in classification is already being addressed for long time.",
                    "label": 0
                },
                {
                    "sent": "But for label ranking so far.",
                    "label": 1
                },
                {
                    "sent": "We haven't seen any work on that.",
                    "label": 0
                },
                {
                    "sent": "And actually, if you think about it, this learning with project option is even more interesting for say in label ranking problem because in conventional classification you could only say make a prediction or not.",
                    "label": 0
                },
                {
                    "sent": "But in label ranking setting you could say you upstairs in a certain degree right?",
                    "label": 0
                },
                {
                    "sent": "Because for each pair of labels.",
                    "label": 1
                },
                {
                    "sent": "You could decide if you output the prediction.",
                    "label": 0
                },
                {
                    "sent": "Or you choose the reject option.",
                    "label": 1
                },
                {
                    "sent": "And of course, you would also like the learner to be consistent, which means the output should be transitive.",
                    "label": 0
                },
                {
                    "sent": "OK, so if you can call all the things together, actually the learner is now then.",
                    "label": 0
                },
                {
                    "sent": "Not obligated to output the total order, but it said a partial order.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Now the problem is how do we?",
                    "label": 0
                },
                {
                    "sent": "How do we realize it?",
                    "label": 0
                },
                {
                    "sent": "We use ensembling.",
                    "label": 0
                },
                {
                    "sent": "Actually, when you're using, sample learning is quite natural, say to represent such kind of reliability of prediction.",
                    "label": 0
                },
                {
                    "sent": "Right, because you just use voting OK?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is also widely done in the real life.",
                    "label": 0
                },
                {
                    "sent": "Right, but sometimes not working, but.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Here's the idea.",
                    "label": 0
                },
                {
                    "sent": "If you have a test data.",
                    "label": 0
                },
                {
                    "sent": "Then we set up a ranking in sample of size K, so he.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "K for example, you have K members of the example.",
                    "label": 0
                },
                {
                    "sent": "Then you output K different rankings.",
                    "label": 0
                },
                {
                    "sent": "And then what you do is you define the partial order.",
                    "label": 1
                },
                {
                    "sent": "That is, if this ensemble agree with the comparison, your output it.",
                    "label": 0
                },
                {
                    "sent": "This is so natural, most natural way to do it.",
                    "label": 0
                },
                {
                    "sent": "But of course, in practice this condition might be to say two strength to strict.",
                    "label": 0
                },
                {
                    "sent": "So in practice, normally what you can do is this way.",
                    "label": 0
                },
                {
                    "sent": "This is actually majority voting.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "So this is how people normally do in practice.",
                    "label": 0
                },
                {
                    "sent": "Now here comes the problem.",
                    "label": 0
                },
                {
                    "sent": "If we use such kind of majority voting.",
                    "label": 0
                },
                {
                    "sent": "We have to make sure the output is consistent.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So namely, we haven't facing our two problems.",
                    "label": 1
                },
                {
                    "sent": "First, how can we make sure?",
                    "label": 0
                },
                {
                    "sent": "As output ranking.",
                    "label": 0
                },
                {
                    "sent": "Is transitive, the output is transitive right?",
                    "label": 0
                },
                {
                    "sent": "And the second problem is, how can we make sure there's no circle in output?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Actually, on this transitive problem is already being addressed in order, sorry.",
                    "label": 0
                },
                {
                    "sent": "Basically we can just using this transitive chloro so you just can you sing this Marshall algorithm to get a transitive closure.",
                    "label": 1
                },
                {
                    "sent": "Then you can make sure the output relation is transitive.",
                    "label": 0
                },
                {
                    "sent": "And the second problem is we have to make sure the relation is has no circle, then it is.",
                    "label": 0
                },
                {
                    "sent": "There will be addressed in this work.",
                    "label": 0
                },
                {
                    "sent": "So basically we have the fall.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Boring.",
                    "label": 0
                },
                {
                    "sent": "Position which I want to hear.",
                    "label": 0
                },
                {
                    "sent": "I just loaded down here, so basic idea is.",
                    "label": 0
                },
                {
                    "sent": "If you do know this proportion of two labels a better than B is pabs, then we having the following result, that is PSA is smaller than two minus PAB minus PSA.",
                    "label": 0
                },
                {
                    "sent": "What is that mean?",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "That means that.",
                    "label": 0
                },
                {
                    "sent": "Immediately you can have this following if you said Pabs is bigger than two, Sir.",
                    "label": 0
                },
                {
                    "sent": "And people say also bigger than two Sir.",
                    "label": 0
                },
                {
                    "sent": "Then you immediately can get that piece and small run through Sir.",
                    "label": 0
                },
                {
                    "sent": "This is actually equal to say if we set a threshold which is bigger than two Sir, you automatically make sure that the result relation has no circle.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So basically the second problem is also solved.",
                    "label": 0
                },
                {
                    "sent": "Now I jump to the experimental.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Result we have test on several datasets.",
                    "label": 0
                },
                {
                    "sent": "And we're choosing this evaluation metric, which is basically extension of this cattle distance.",
                    "label": 0
                },
                {
                    "sent": "So here actually we compare our prediction and it is a partial ranking.",
                    "label": 0
                },
                {
                    "sent": "Compared with the true ranking.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So here comes the result.",
                    "label": 0
                },
                {
                    "sent": "So basically what I do here is I said in sample size.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of turn an, I compare the different threshold value and to see what is the performance and this origonal means that we don't train and assemble will just take the order in the base learner or trend it on the original data site.",
                    "label": 0
                },
                {
                    "sent": "OK, the way we generalize this example is using begging.",
                    "label": 0
                },
                {
                    "sent": "OK, we're just packing the data.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, it's quite clear that if you're increasing the threshold.",
                    "label": 0
                },
                {
                    "sent": "We push the result higher OK.",
                    "label": 0
                },
                {
                    "sent": "The particulate get higher.",
                    "label": 0
                },
                {
                    "sent": "The result is quite clear.",
                    "label": 0
                },
                {
                    "sent": "It's pretty much the other thing I want to say actually.",
                    "label": 0
                },
                {
                    "sent": "I believe this is the first attempt that.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How to make label ranking method say has a reject option?",
                    "label": 0
                },
                {
                    "sent": "And we have designed assemble learning, so which can output a reliable partial ranking.",
                    "label": 1
                },
                {
                    "sent": "OK. And of course, I believe this is another story because I believe this label ranking with reject option is a really interesting topic and I believe this deserves further application.",
                    "label": 1
                },
                {
                    "sent": "So I hope more people will follow this kind of line and do some work on this kind of topic.",
                    "label": 0
                },
                {
                    "sent": "So basically that is all I want to say.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah please.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this I didn't understand why the second doesn't immediately follow from the first.",
                    "label": 0
                },
                {
                    "sent": "If it's transitive it can't have cycles.",
                    "label": 0
                },
                {
                    "sent": "No, not really.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "Let's just use it about.",
                    "label": 0
                },
                {
                    "sent": "I see.",
                    "label": 0
                },
                {
                    "sent": "If you say if you consider this is a relation matrix.",
                    "label": 0
                },
                {
                    "sent": "I can say this is also transitive.",
                    "label": 0
                },
                {
                    "sent": "But this has to go right?",
                    "label": 0
                },
                {
                    "sent": "It's always transitive.",
                    "label": 0
                },
                {
                    "sent": "For example, if you have a label ABC ABC.",
                    "label": 0
                },
                {
                    "sent": "Then this one miss is better than be.",
                    "label": 0
                },
                {
                    "sent": "So if this arrow, which means there's no such relation, but if it's one, which means it's better than be.",
                    "label": 0
                },
                {
                    "sent": "If you have such kind of relation matrix, you also still have transitive transitivity, but you don't have.",
                    "label": 0
                },
                {
                    "sent": "You also have circle.",
                    "label": 0
                },
                {
                    "sent": "OK, everything is better than everything.",
                    "label": 0
                },
                {
                    "sent": "Yep, you're still transitive, but still not.",
                    "label": 0
                },
                {
                    "sent": "So you still have to solve this 2 problems.",
                    "label": 0
                },
                {
                    "sent": "OK, it's alright cool.",
                    "label": 0
                },
                {
                    "sent": "Expected value add up to one so you cannot have this situation.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's in class exactly.",
                    "label": 0
                },
                {
                    "sent": "Left yeah, this is.",
                    "label": 0
                },
                {
                    "sent": "Transitivity, or simpler set?",
                    "label": 0
                },
                {
                    "sent": "It means that if you put these values on a weighted graph, even if they are not symmetric, you get the triangle.",
                    "label": 0
                },
                {
                    "sent": "And is the weakest thing that you get.",
                    "label": 0
                },
                {
                    "sent": "I can I have a proof for that in general?",
                    "label": 0
                },
                {
                    "sent": "OK, if you have a collection of random variables that you compare them pairwise week in winning matters, how many times is XP?",
                    "label": 0
                },
                {
                    "sent": "Why we can never go beyond this problem all right now if you go next to the next slide.",
                    "label": 0
                },
                {
                    "sent": "Alright.",
                    "label": 0
                },
                {
                    "sent": "Brakes.",
                    "label": 0
                },
                {
                    "sent": "Yeah please yes because what you exclude here is the existence of free cycles.",
                    "label": 0
                },
                {
                    "sent": "But there could be 4 cycles, five side, 6 hours or so.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So you have to get higher and higher and higher if you want to exclude all sites.",
                    "label": 0
                },
                {
                    "sent": "Relations is not sufficient, so by doing this you know there cannot be a cycle of three.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but there could be a cycle before also interesting.",
                    "label": 0
                },
                {
                    "sent": "OK, please show me later about this.",
                    "label": 0
                },
                {
                    "sent": "Thank you for letting me.",
                    "label": 0
                },
                {
                    "sent": "Very much.",
                    "label": 0
                },
                {
                    "sent": "That's that's a good point here.",
                    "label": 0
                },
                {
                    "sent": "I mean this stuff with a look at the average I know, and in the our AI Journal Paper we exactly made that point and I get the reference letter to look like yours.",
                    "label": 0
                },
                {
                    "sent": "It's a special case.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the result.",
                    "label": 0
                },
                {
                    "sent": "I know you have a big paper.",
                    "label": 0
                },
                {
                    "sent": "Framework this is definitely so.",
                    "label": 0
                },
                {
                    "sent": "In fact the the answer here is very poor.",
                    "label": 0
                },
                {
                    "sent": "If you do not know his answer, but if you want to solve it.",
                    "label": 0
                },
                {
                    "sent": "So if you want to avoid to have cycles, yeah, but also for cycles 5 cycles up to Infinity.",
                    "label": 0
                },
                {
                    "sent": "The only thing that works is to cut at one.",
                    "label": 0
                },
                {
                    "sent": "I sent.",
                    "label": 0
                },
                {
                    "sent": "So in every audience understaffed agree on everything.",
                    "label": 0
                },
                {
                    "sent": "So just like I think I'm.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, you can never assure that it was outside.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "I don't know when you go back to the results card with the table.",
                    "label": 0
                },
                {
                    "sent": "I mean, this was really a bit quick.",
                    "label": 0
                },
                {
                    "sent": "Maybe I would like to ask.",
                    "label": 0
                },
                {
                    "sent": "And did anybody get the main idea why actually we expect the results to become better with increasing pressure?",
                    "label": 0
                },
                {
                    "sent": "T actually went very fast.",
                    "label": 0
                },
                {
                    "sent": "Exactly.",
                    "label": 0
                },
                {
                    "sent": "If we increase the threat.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the learner abstains more, so the predictions that he makes become more and more partial.",
                    "label": 0
                },
                {
                    "sent": "And if you go back one slide, you see that the measure here evaluation metric is only evaluated.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the subset of pairwise relations on which the learner does not have state.",
                    "label": 0
                },
                {
                    "sent": "So the key idea, of course is that if the learner abstains in a reasonable way.",
                    "label": 0
                },
                {
                    "sent": "Then it abstains on those pairwise relations that are really uncertain, which means.",
                    "label": 0
                },
                {
                    "sent": "The more the learner of states, the better it should become on the remaining pairwise relations for which he makes a prediction.",
                    "label": 0
                },
                {
                    "sent": "And this is essentially the way how to evaluate this type of learners with the reject option and what way has shown on the next.",
                    "label": 0
                },
                {
                    "sent": "On the table, on the on the in the table, on the next slide is basically the counterpart of what for classification is called the accuracy rejection curve.",
                    "label": 0
                },
                {
                    "sent": "When you plot the performance of the classifier as a function of its degree of of extension, and as we have seen in the table, it really nicely increases in terms of performance and this basically shows that this relatively simple a way of implementing abstention in labor ranking at least seems to work essentially like trade.",
                    "label": 0
                },
                {
                    "sent": "This recall with the position.",
                    "label": 0
                },
                {
                    "sent": "So something like that.",
                    "label": 0
                },
                {
                    "sent": "I missed something there.",
                    "label": 0
                },
                {
                    "sent": "I guess if you ask input from the user or the data.",
                    "label": 0
                },
                {
                    "sent": "You want to receive statements like Label 8 fits better than they will be.",
                    "label": 0
                },
                {
                    "sent": "First pairwise kind of.",
                    "label": 0
                },
                {
                    "sent": "Then I am.",
                    "label": 0
                },
                {
                    "sent": "I'm surprised because if you look at the preference modeling for your reference structures as we have now, you allow for incompatibility innocence.",
                    "label": 0
                },
                {
                    "sent": "I'm not able to compare, so I don't know.",
                    "label": 0
                },
                {
                    "sent": "Think before it's indifference.",
                    "label": 0
                },
                {
                    "sent": "You build a partial order, but you ask for stickers.",
                    "label": 0
                },
                {
                    "sent": "I could be sure that both labels labels fit perfectly.",
                    "label": 0
                },
                {
                    "sent": "And I'm not able to say they are equal in this framework, no, no there there is a subtle difference.",
                    "label": 0
                },
                {
                    "sent": "I mean what we assume is really that with every instance we can associate the total order.",
                    "label": 0
                },
                {
                    "sent": "The learner is only able to say.",
                    "label": 0
                },
                {
                    "sent": "Basically, I'm not sure enough to make this prediction and then start to the total order.",
                    "label": 0
                },
                {
                    "sent": "Yeah, OK, that's why I abstain.",
                    "label": 0
                },
                {
                    "sent": "That's that's the subtle difference.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "But if you would allow for recorders.",
                    "label": 0
                },
                {
                    "sent": "I'm loving to agree on indifference.",
                    "label": 0
                },
                {
                    "sent": "That's true, yes.",
                    "label": 0
                },
                {
                    "sent": "In the in the label ranking setting that we studied so far, we always proceed from total office because otherwise it comes with.",
                    "label": 0
                },
                {
                    "sent": "Please.",
                    "label": 0
                },
                {
                    "sent": "Questions question what is the percentage of?",
                    "label": 0
                },
                {
                    "sent": "Extension in in your weight 40% section in your next time I mean, of course it's good to be able to say well here I'm not sure enough, but at the same time you're back.",
                    "label": 0
                },
                {
                    "sent": "OK, yeah, I.",
                    "label": 0
                },
                {
                    "sent": "Ideally, shoulder here.",
                    "label": 0
                },
                {
                    "sent": "Actually I should also plot here, but it's not here actually.",
                    "label": 0
                },
                {
                    "sent": "I think in the paper question paper, maybe the paper.",
                    "label": 0
                },
                {
                    "sent": "If not, I could also show you later because we have the status as well.",
                    "label": 0
                },
                {
                    "sent": "Because I think the board is that you be as precise as possible, yeah?",
                    "label": 0
                },
                {
                    "sent": "You should say something as soon as often as possible.",
                    "label": 0
                },
                {
                    "sent": "Just show it's actually this recall and position as you have dependencies.",
                    "label": 0
                },
                {
                    "sent": "Some if one score variant or something like that would be.",
                    "label": 0
                },
                {
                    "sent": "Yeah, exactly.",
                    "label": 0
                },
                {
                    "sent": "Maybe even tell her.",
                    "label": 0
                },
                {
                    "sent": "Or later.",
                    "label": 0
                },
                {
                    "sent": "Sex.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "5 minutes.",
                    "label": 0
                },
                {
                    "sent": "Text.",
                    "label": 0
                }
            ]
        }
    }
}