{
    "id": "rxhzhrsxy2y4uqgvvcqtqqk336vv3o6i",
    "title": "Sorted Neighborhood for Schema-free RDF Data",
    "info": {
        "author": [
            "Mayank Kejriwal, Department of Computer Science, University of Texas at Austin"
        ],
        "published": "July 15, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2015_kejriwal_sorted_neighborhood/",
    "segmentation": [
        [
            "So my unk and today I'll be presenting sorted neighborhood for schema free RDF data.",
            "So we'll go through that.",
            "My advisors Dan Ronco, and we're from the University of Texas at Austin, and we'd also like to acknowledge the NSF for funding this research."
        ],
        [
            "OK, so let me get started with an overview of the problem called instance matching.",
            "So many of you may have heard of the problem, but this is kind of the high level question that is problem seeks to ask which is that which instances or which pieces of instances over here refer to the same underlying entity.",
            "So if we look at these two graphs, we have RDF graph one graph 2 and we have someone like Mike Page and we also have someone like Michael.",
            "What beats Junior now simply from the context we can actually make out that.",
            "They refer to the same person despite all the different representations, so it's usually easy for a human being to actually make out that there are these things that refer to the same."
        ],
        [
            "Relying entity."
        ],
        [
            "But it turns out that this is a very hard AI problem.",
            "It's still unsolved, it's 50 or problem.",
            "There's been lots of progress on it, but in our community usually this is what happens.",
            "We need to locate the pairs of entities, and then we kind of link them using these all, same as or similar properties.",
            "So you know, that's kind of the end goal, but it's a very difficult problem to do automatically for a computer program."
        ],
        [
            "And the primary application in the semantic web is linked open data, but there are many other applications and we see more creative users of this problem as we move along.",
            "So on linked open data, even if we just take DB pedia in Freebase and common knowledge basis, we have many entities that do refer to the same thing and between which you won't necessarily find the link.",
            "And there are lots of challenges.",
            "So lots of people are dealing with this problem and making progress on this problem.",
            "But one of the key challenges is that if we want, we need to do this efficiently, clearly, and on linked open data.",
            "We have many schema free RDF datasets, so even if the data set is not schema free, you know there are often cases where the schema is not useful.",
            "We cannot really use this key Wiener deep manner so you know, those are kind of the two words that will sort of come back to so efficient and schema free.",
            "So that's the big picture that we kind of looking at, but in a very specific, you know in progress, work over."
        ],
        [
            "Here, so first let me describe briefly without going into the schema free part of things that that what exactly is meant by efficient instance matching over here.",
            "So it turns out there's a very specific meaning of efficiency in the instance matching literature, and you know just to take an example so very abstract to RDF graphs M and entities respectively.",
            "And let's assume that were given this thing called functional specification, which is basically a Boolean function.",
            "We can think of it like a Boolean function.",
            "It takes 2 entities as input.",
            "And would return true if they refer to the same thing and would return false otherwise.",
            "So very simple Boolean function and will assume now it's given to us, although that's that's a very difficult problem.",
            "Just figuring out what that function is, but even given that we would have to carry out MN evaluations in a knife case, we would just have to compare every pair an it's been observed that the number of hours, same as links that are actually discovered are quite small compared to M, like it's very sparse.",
            "It is usually linear or much smaller than linear.",
            "In the datasets, so the goal is to choose a small subset of the animals that are good candidates for for the linking, and this step is called blocking.",
            "Now usually this is like clustering, we use an approximate similar similarity function to cluster entities and only entities within the same cluster are essentially paired.",
            "An added to the candidates."
        ],
        [
            "Right, so this is what the state of the art kind of looks like.",
            "Predominantly, that these two RDF graphs they go into this blocking step where approximately similar instances so kind of preprocessing step are clustered together.",
            "Entities within the same cluster are paired and become candidates, and this candidate set is much smaller than M, so that's why this locking step is, you know, deals with efficiency and then in the classification step every pair within the candidate set would be evaluated by the.",
            "Function and the ones that are matching that should be linked using all simars would be output, so this is a very high."
        ],
        [
            "Level overview of of what the current state of the art looks."
        ],
        [
            "And in this work we will actually adapt a classic procedure called Sorted neighborhood which will go into.",
            "So this is we will just look at blocking in this work.",
            "We will not go into the second step and we'll assume that the graphs are schema free, so that's the other thing.",
            "And you know if you're more interested.",
            "I'm also talking about the classification step in the main conference.",
            "So if you're interested in this talk, please come to that one also."
        ],
        [
            "Also, you know, so why So what is sorted neighborhood and why would we want to use it for blocking?",
            "So in order to do that, let me describe the traditional sort of neighborhood, so we're not.",
            "It's not a method that we're inventing, it was invented way back in the mid 90s in a very Seminole work.",
            "That's my academic Grand Father stall fold.",
            "So he came up with this method, which instantly took off.",
            "It's been it's one of the most classic works in instance matching, because this method just performs really well.",
            "It has all these excellent empirical and.",
            "Theoretical properties and he proposed it for tabular databases, so here's how the method works.",
            "You have a table, you know here the table is S just have one column.",
            "These all records 8 Y very generic and it assumes a heuristic called a blocking key.",
            "So to take an example, this is kind of the clustering function, the one based on which we will form the blocks and the units.",
            "It could be something like, say, tokens last name, so you know just extracting the tokens from the last name as that approximate similarity measure to cut down on the unnecessary.",
            "Comparisons and so you know here the you know this is the blocking key generation step where this blocking key is applied on each record and blocking key which you know more generically it's just a string, could be a number.",
            "In this case it's a number is output.",
            "We can think of a blocking key value, so each of these cases are blocking key values almost like hash keys.",
            "So you know the goal is that the.",
            "For the records that are similar, you would want to key to be very similar or the same, so that's what a good blocking key should look like, so that's the intuition behind that.",
            "If the tokens lasting, we would assume that if there is some common token in the last name, then that's you know that's where the comparison, and then in the second step sorted labeled essentially sorts the database.",
            "So based on the keys, so we have 123.",
            "It's also we can see that there are some records that have the same blocking key and then it does it slides of window of constant size.",
            "In this case tree.",
            "From top to bottom and the records are shared or window are paid an added to the candidate set.",
            "So if you kind of analyze this theoretically then it's just oh of N like you would have a Vin records record pairs in the candidate set you instead of of North squared so it converts from quadratic to linear with very very very good empirical performance.",
            "So that was kind of, you know, by took off and work so well and many variants have been proposed to the paper by called and coauthors in 2011.",
            "I took their diagram.",
            "They implemented it in MapReduce or there are people who have implemented it for XML databases.",
            "So we're Julie.",
            "Just continuing to see a lot of work on this."
        ],
        [
            "And of course, our question is that you know, given that we have in the relational database Community, this is just work so well, can we actually make it work that well for schema free?",
            "I have use cases and this is actually non trivial to implement this for schema free so there are two main problems over here.",
            "So first the data has no schema which sorta neighborhood presume.",
            "So it assumes that you have this nice structure table with the schema and it uses the blocking key.",
            "You know on that schema the blocking keys or function of the schema.",
            "So how do we actually do that given no schema?",
            "And the second thing is that in many cases we will not have, you know of an actual file, a batch term.",
            "We will just have a sparkle endpoint.",
            "So how can we operationalize sorted neighborhood using this to sparkle endpoint?",
            "And we propose a workflow to sort of address these challenges.",
            "So again, very preliminary work and."
        ],
        [
            "So you know I'll just show you some of the key intuition and the work that we've done so far.",
            "So there are two key intuitions which will go into before I show you the full, the full diagram, the first key intuition is actually something that we got out of Wilkinson who implemented the Gina Gina in 2003.",
            "He used something called a physical property table to store RDF, and we will use what's called a logical property table for.",
            "Instance matching, so we sort of taking the abstraction up or level, and the goal is to construct a pseudo schema from the property so you know, kind of it looks like this.",
            "So you have a subject column and if you have like all the properties that are in the database, you would have a column for each property.",
            "So you're using the properties to build a schema and the subject would be the key of the table, so it would be the primary key of the table, because each subject you are I would have just one unique role in that and all the different properties would.",
            "Go into that.",
            "So that's the that's what the physical table would look like.",
            "We'll go into the logical table a little more, and Secondly so we have two datasets and we will actually construct the property tables for both.",
            "The question is, how do we now run sorted neighborhood on both of those tables?",
            "Because usually there's just one table and one schemas in that diagram that I showed you for just one table, one sliding windows.",
            "So how can we reconcile the two tables and will go into that is?"
        ],
        [
            "Well, and so this is what the workflow actually looks like.",
            "So in the first half.",
            "So this is this should actually be looked at in like top half and bottom half and will go into the smaller details are a little later.",
            "So in the top half you know these are the inputs so we have the two blocking keys, one for each IDF data set G1 and G2, and you can sort of see here that you know if it's Markle accessible.",
            "Then there's a query we need to execute, and I'll go into that and then do some post processing if it's not sparkle accessible, we would just execute.",
            "A batch processing algorithm, so it's very easy to derive the property table if we just given N triples file.",
            "Like if I just give you an interest while you just need to read the file it so you know event procedure.",
            "You can build a table with, you know, just a column for each property very easily.",
            "If you have, you know the whole file, but if there's if it's Markle access will, then the naive ways that we down we do a select star we do the whole dump and then we do the batch that very inefficient.",
            "Or we can do it more intelligently, which which I'll show you in the next slide, but the end result is that we get this.",
            "These things called projected logical property table.",
            "Projected because not all the properties might be in the table, so we will only use.",
            "So over here we actually have all the properties but we will not use all the properties in the logical version.",
            "We will only use the ones that we need to use.",
            "So in some sense we are projecting out some of the properties.",
            "So that's the projected logical tables and then those both of those tables will go in the modified sorry neighborhood algorithm, which are also described will be run.",
            "And finally you know the candidates that will go into the second the classification step.",
            "Which comes after blocking, so we're not dealing with that here, but you know, so it's not the end of the workflow.",
            "For instance, matching.",
            "We still have to do the second classification step, and there are also options you know, like you don't have to run the whole thing over again if you change your blocking key.",
            "Your graph updates things like that.",
            "We have options of publishing VKV for publishing, blocking key values, candidate sets, and so on, so you can cache intermediate results and sort of reuse."
        ],
        [
            "You know, as you change things so you know constructing the sparkle queries.",
            "So let's assume we have, you know like in the diagram we have the blocking key, so we'll assume that the blocking key is defined only in terms of the properties in the data set, so that makes sense because there's not a lot more we can actually define the blocking key on.",
            "We don't have a schema, so we can't use function in terms of a schema, so we literally have to use the properties and I'll give an example in the next slide.",
            "But let's assume that we're using properties.",
            "P1 to PD in the blocking key, and that's what will be contained within the properties set.",
            "So the property set contains a set of properties that will be used in the blocking key, and this is a generic way.",
            "It looks ugly.",
            "I'll be happy to come back to this after the talk, but right now."
        ],
        [
            "I just want to give you an example.",
            "You know because that that will hopefully clarify.",
            "So let's say we have this blocking keys, so we come back to our old example of Mike Page, so tokens subject union tokens D1 has brother.",
            "So D1 has brothers is obviously a property and subject over your simply refers to the subject you are I what it says is that if two things have the same token in the subject, or at least have a common token in the subject and or have a common you know has have a common Grado.",
            "Then they would essentially have the same blocking key, so in this case you know we can kind of see that when we run the instantiated query.",
            "This is what we kind of get, so not all the properties I've shown up, we only have the property that is used, which is has.",
            "Brother subject always shows up.",
            "Mike Bates does not have a brother, you know, neither does Dayton, Sam cracks and so on.",
            "South those cells are empty.",
            "On the other hand, Joan cracks.",
            "Bates has two brothers, so subject is not actually your primary key over here.",
            "In this table of what's called loosely structured.",
            "And the empty cell.",
            "So that's another problem.",
            "But we also have these rows where we have multiple values."
        ],
        [
            "So that's kind of just so very simple post processing to get the property table out of this where we flat into rows that have multiple values using our reserve delimiter.",
            "So that's the; Or whatever it can be.",
            "Any reserve delimiter and we replace the empty values with reserved keyword, which just in this case would be null.",
            "And that's kind of what we how we get to logical property table.",
            "So it's different from the physical version that was proposed by Wilkinson, but very similar principles.",
            "So again properties are columns on the subject would be the key.",
            "In the table, so that's."
        ],
        [
            "Over here and now, of course, we have two tables, one for each, one for each graph, so we need to modify the sort of neighborhood algorithm to do that, and I'll just go through the two or three main steps over here.",
            "So first you know the candidate said, you know, we initialize it to be empty, and then we apply each blocking key.",
            "So say B12, each two plenty, one so very similar to original sorted neighborhood semantics where you just apply a blocking into each record in a table.",
            "You get a blocking key value.",
            "But he also changed.",
            "We build multi Maps so multi map is.",
            "You know it's like it's like an ordinary map hash map.",
            "But you can have a set of values you don't.",
            "You have a key and instead of a value you can have a set of values.",
            "So the BKV the blocking key value over.",
            "Here is the key and the set of records that would have the same blocking key value would be the the set that is referenced by other blocking key value and we get 2 multi Maps by one and Pi 2 and Now what we do is.",
            "And this is kind of the working.",
            "Agres part because we think that there are better ways of doing this.",
            "Kind of working on that, but for now we just kind of join the two Maps together.",
            "So basically if there is a blocking key value that shows up in one map and doesn't show up in the other map, it would get discarded.",
            "It's not useful to us, but the others we joined, and if one of the set of records they Rs if R is bigger than S&R, would get truncated.",
            "So we discard some records so this truncation threshold is clearly important and we tune that you know, and after that we kind of the rest of it can actually be."
        ],
        [
            "Visualized so we get a table like this so once we merge the two once we join on the blocking key values and we only need to retain the subject because the subject was the primary key in both the property tables.",
            "So we have these two subjects we have the blocking key values and we can actually run the windowing process on this.",
            "So here I'm just showing double equals to two we already showed with W equal to three, but the blue can be anything and we just slide and so the subject subject pairs would be the candidate set that we would actually need to compare.",
            "In the classification step."
        ],
        [
            "So, just to recap, you know the proposed system.",
            "We take the two blocking keys.",
            "We extract the property sets or you know we check if it sparkle, access will or not.",
            "You know ultimately we get these projected property tables which goes into the modified algorithm.",
            "We can publish intermediate results and finally the candidate said goes into the classification step.",
            "So hopefully this is a little more clear after those components and now."
        ],
        [
            "For the experiments, so we use five or benchmark.",
            "So we use small benchmarks for this work for, but we are currently evaluating on large or MapReduce based or infrastructure also, but for this work we only use very small but very well established benchmarks, so these are very commonly used in the instance matching community.",
            "These all of them are believer from the OAI initiative which takes place at RSW.",
            "See and they known to be fairly challenging or we learn the blocking key using an unsupervised.",
            "Good clustering methods.",
            "We did not have a user come in and give us a blocking key.",
            "We use a state of the art algorithm by pappadakis and coauthors to learn the scheme using an unsupervised method, and we use the same blocking key for all the baselines so that you know we're not penalising anyone unfairly and we compare against two baselines, block purging, which was again proposing 2011.",
            "It's known to perform very well for schema free data sets and canopy's which can also be applied on schema free data sets.",
            "It was proposed by Andrew McCallum and his group.",
            "In 2000, known to be a very good algorithm, very simple to implement and with some good properties, and it can be used on schema free, so we're evaluating against these two schema freebase lines, one of which is well known in our community and the other which is more well known outside our community but can be used."
        ],
        [
            "So these are the three metrics, so it's not Christian.",
            "Recall, we don't evaluate blocking using Christian recall because it's not the final output.",
            "We have the classification step that evaluates unchristian recall.",
            "But to actually evaluate the blocking individually, we have these two metrics called pairs, completeness and reduction ratio.",
            "So pairs completeness is basically, you know how many true pairs are included in your candidate set.",
            "So the coverage of your candidate said if your candidate side is not good, then you won't include any true pairs.",
            "And you have trouble doing well in the classification.",
            "Will get almost zero recall in the classification if you don't cover in this phase itself.",
            "Reduction ratio basically measures that.",
            "What fraction of NM have I reduced?",
            "You know.",
            "So if NM, like you have reduced 99% of that, 90% of that in the candidate set, because ultimately blocking is all about complexity and the F score is just a harmonic mean of that so."
        ],
        [
            "He quickly let me show you the results.",
            "What we find is that block purging continues to do very well.",
            "You know on these datasets, which is a good thing, but the reduction ratio of block purging is actually very low, so we have 87% versus 93% and it's known in our community that even small differences in reduction ratio are known to have large impact because it's a quadratic function.",
            "Reduction ratios dependent on EM.",
            "So even point 1.2% can have has this ginormous impact, basically.",
            "So we need you know this is a very big difference in production issue.",
            "And finally for Canopy's, I have some backup slides on this.",
            "I'm almost done but it's out performed by both methods on PCF score it does do well on reduction ratio though, but it does really badly on the other two.",
            "So it means that Canopy's should not really be used in our community.",
            "Unit was very good for the domain it was used on.",
            "It does not seem to be doing so well with ur eyes and."
        ],
        [
            "Just in our community in general.",
            "So to conclude, these are kind of my takeaways.",
            "First efficient, I am on schema free idea is a challenging problem.",
            "It's an ongoing problem and we presented one solution.",
            "It's not the only solution, but it's one solution and it's so adaptation of a classic algorithm which has many variants, so this kind of have a lot of follow ups where a lot of variants can actually be now applied by using this workflow and represent a workflow for doing that.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So my unk and today I'll be presenting sorted neighborhood for schema free RDF data.",
                    "label": 0
                },
                {
                    "sent": "So we'll go through that.",
                    "label": 0
                },
                {
                    "sent": "My advisors Dan Ronco, and we're from the University of Texas at Austin, and we'd also like to acknowledge the NSF for funding this research.",
                    "label": 1
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so let me get started with an overview of the problem called instance matching.",
                    "label": 0
                },
                {
                    "sent": "So many of you may have heard of the problem, but this is kind of the high level question that is problem seeks to ask which is that which instances or which pieces of instances over here refer to the same underlying entity.",
                    "label": 0
                },
                {
                    "sent": "So if we look at these two graphs, we have RDF graph one graph 2 and we have someone like Mike Page and we also have someone like Michael.",
                    "label": 0
                },
                {
                    "sent": "What beats Junior now simply from the context we can actually make out that.",
                    "label": 0
                },
                {
                    "sent": "They refer to the same person despite all the different representations, so it's usually easy for a human being to actually make out that there are these things that refer to the same.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Relying entity.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it turns out that this is a very hard AI problem.",
                    "label": 0
                },
                {
                    "sent": "It's still unsolved, it's 50 or problem.",
                    "label": 0
                },
                {
                    "sent": "There's been lots of progress on it, but in our community usually this is what happens.",
                    "label": 0
                },
                {
                    "sent": "We need to locate the pairs of entities, and then we kind of link them using these all, same as or similar properties.",
                    "label": 0
                },
                {
                    "sent": "So you know, that's kind of the end goal, but it's a very difficult problem to do automatically for a computer program.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the primary application in the semantic web is linked open data, but there are many other applications and we see more creative users of this problem as we move along.",
                    "label": 1
                },
                {
                    "sent": "So on linked open data, even if we just take DB pedia in Freebase and common knowledge basis, we have many entities that do refer to the same thing and between which you won't necessarily find the link.",
                    "label": 0
                },
                {
                    "sent": "And there are lots of challenges.",
                    "label": 0
                },
                {
                    "sent": "So lots of people are dealing with this problem and making progress on this problem.",
                    "label": 0
                },
                {
                    "sent": "But one of the key challenges is that if we want, we need to do this efficiently, clearly, and on linked open data.",
                    "label": 0
                },
                {
                    "sent": "We have many schema free RDF datasets, so even if the data set is not schema free, you know there are often cases where the schema is not useful.",
                    "label": 0
                },
                {
                    "sent": "We cannot really use this key Wiener deep manner so you know, those are kind of the two words that will sort of come back to so efficient and schema free.",
                    "label": 0
                },
                {
                    "sent": "So that's the big picture that we kind of looking at, but in a very specific, you know in progress, work over.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here, so first let me describe briefly without going into the schema free part of things that that what exactly is meant by efficient instance matching over here.",
                    "label": 0
                },
                {
                    "sent": "So it turns out there's a very specific meaning of efficiency in the instance matching literature, and you know just to take an example so very abstract to RDF graphs M and entities respectively.",
                    "label": 0
                },
                {
                    "sent": "And let's assume that were given this thing called functional specification, which is basically a Boolean function.",
                    "label": 0
                },
                {
                    "sent": "We can think of it like a Boolean function.",
                    "label": 0
                },
                {
                    "sent": "It takes 2 entities as input.",
                    "label": 0
                },
                {
                    "sent": "And would return true if they refer to the same thing and would return false otherwise.",
                    "label": 0
                },
                {
                    "sent": "So very simple Boolean function and will assume now it's given to us, although that's that's a very difficult problem.",
                    "label": 0
                },
                {
                    "sent": "Just figuring out what that function is, but even given that we would have to carry out MN evaluations in a knife case, we would just have to compare every pair an it's been observed that the number of hours, same as links that are actually discovered are quite small compared to M, like it's very sparse.",
                    "label": 0
                },
                {
                    "sent": "It is usually linear or much smaller than linear.",
                    "label": 0
                },
                {
                    "sent": "In the datasets, so the goal is to choose a small subset of the animals that are good candidates for for the linking, and this step is called blocking.",
                    "label": 1
                },
                {
                    "sent": "Now usually this is like clustering, we use an approximate similar similarity function to cluster entities and only entities within the same cluster are essentially paired.",
                    "label": 0
                },
                {
                    "sent": "An added to the candidates.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so this is what the state of the art kind of looks like.",
                    "label": 0
                },
                {
                    "sent": "Predominantly, that these two RDF graphs they go into this blocking step where approximately similar instances so kind of preprocessing step are clustered together.",
                    "label": 0
                },
                {
                    "sent": "Entities within the same cluster are paired and become candidates, and this candidate set is much smaller than M, so that's why this locking step is, you know, deals with efficiency and then in the classification step every pair within the candidate set would be evaluated by the.",
                    "label": 0
                },
                {
                    "sent": "Function and the ones that are matching that should be linked using all simars would be output, so this is a very high.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Level overview of of what the current state of the art looks.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in this work we will actually adapt a classic procedure called Sorted neighborhood which will go into.",
                    "label": 1
                },
                {
                    "sent": "So this is we will just look at blocking in this work.",
                    "label": 0
                },
                {
                    "sent": "We will not go into the second step and we'll assume that the graphs are schema free, so that's the other thing.",
                    "label": 0
                },
                {
                    "sent": "And you know if you're more interested.",
                    "label": 0
                },
                {
                    "sent": "I'm also talking about the classification step in the main conference.",
                    "label": 0
                },
                {
                    "sent": "So if you're interested in this talk, please come to that one also.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, you know, so why So what is sorted neighborhood and why would we want to use it for blocking?",
                    "label": 0
                },
                {
                    "sent": "So in order to do that, let me describe the traditional sort of neighborhood, so we're not.",
                    "label": 0
                },
                {
                    "sent": "It's not a method that we're inventing, it was invented way back in the mid 90s in a very Seminole work.",
                    "label": 0
                },
                {
                    "sent": "That's my academic Grand Father stall fold.",
                    "label": 0
                },
                {
                    "sent": "So he came up with this method, which instantly took off.",
                    "label": 0
                },
                {
                    "sent": "It's been it's one of the most classic works in instance matching, because this method just performs really well.",
                    "label": 0
                },
                {
                    "sent": "It has all these excellent empirical and.",
                    "label": 0
                },
                {
                    "sent": "Theoretical properties and he proposed it for tabular databases, so here's how the method works.",
                    "label": 1
                },
                {
                    "sent": "You have a table, you know here the table is S just have one column.",
                    "label": 0
                },
                {
                    "sent": "These all records 8 Y very generic and it assumes a heuristic called a blocking key.",
                    "label": 1
                },
                {
                    "sent": "So to take an example, this is kind of the clustering function, the one based on which we will form the blocks and the units.",
                    "label": 0
                },
                {
                    "sent": "It could be something like, say, tokens last name, so you know just extracting the tokens from the last name as that approximate similarity measure to cut down on the unnecessary.",
                    "label": 0
                },
                {
                    "sent": "Comparisons and so you know here the you know this is the blocking key generation step where this blocking key is applied on each record and blocking key which you know more generically it's just a string, could be a number.",
                    "label": 0
                },
                {
                    "sent": "In this case it's a number is output.",
                    "label": 0
                },
                {
                    "sent": "We can think of a blocking key value, so each of these cases are blocking key values almost like hash keys.",
                    "label": 0
                },
                {
                    "sent": "So you know the goal is that the.",
                    "label": 0
                },
                {
                    "sent": "For the records that are similar, you would want to key to be very similar or the same, so that's what a good blocking key should look like, so that's the intuition behind that.",
                    "label": 0
                },
                {
                    "sent": "If the tokens lasting, we would assume that if there is some common token in the last name, then that's you know that's where the comparison, and then in the second step sorted labeled essentially sorts the database.",
                    "label": 0
                },
                {
                    "sent": "So based on the keys, so we have 123.",
                    "label": 0
                },
                {
                    "sent": "It's also we can see that there are some records that have the same blocking key and then it does it slides of window of constant size.",
                    "label": 0
                },
                {
                    "sent": "In this case tree.",
                    "label": 0
                },
                {
                    "sent": "From top to bottom and the records are shared or window are paid an added to the candidate set.",
                    "label": 0
                },
                {
                    "sent": "So if you kind of analyze this theoretically then it's just oh of N like you would have a Vin records record pairs in the candidate set you instead of of North squared so it converts from quadratic to linear with very very very good empirical performance.",
                    "label": 0
                },
                {
                    "sent": "So that was kind of, you know, by took off and work so well and many variants have been proposed to the paper by called and coauthors in 2011.",
                    "label": 0
                },
                {
                    "sent": "I took their diagram.",
                    "label": 0
                },
                {
                    "sent": "They implemented it in MapReduce or there are people who have implemented it for XML databases.",
                    "label": 0
                },
                {
                    "sent": "So we're Julie.",
                    "label": 0
                },
                {
                    "sent": "Just continuing to see a lot of work on this.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And of course, our question is that you know, given that we have in the relational database Community, this is just work so well, can we actually make it work that well for schema free?",
                    "label": 0
                },
                {
                    "sent": "I have use cases and this is actually non trivial to implement this for schema free so there are two main problems over here.",
                    "label": 0
                },
                {
                    "sent": "So first the data has no schema which sorta neighborhood presume.",
                    "label": 1
                },
                {
                    "sent": "So it assumes that you have this nice structure table with the schema and it uses the blocking key.",
                    "label": 0
                },
                {
                    "sent": "You know on that schema the blocking keys or function of the schema.",
                    "label": 1
                },
                {
                    "sent": "So how do we actually do that given no schema?",
                    "label": 0
                },
                {
                    "sent": "And the second thing is that in many cases we will not have, you know of an actual file, a batch term.",
                    "label": 0
                },
                {
                    "sent": "We will just have a sparkle endpoint.",
                    "label": 0
                },
                {
                    "sent": "So how can we operationalize sorted neighborhood using this to sparkle endpoint?",
                    "label": 1
                },
                {
                    "sent": "And we propose a workflow to sort of address these challenges.",
                    "label": 0
                },
                {
                    "sent": "So again, very preliminary work and.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you know I'll just show you some of the key intuition and the work that we've done so far.",
                    "label": 0
                },
                {
                    "sent": "So there are two key intuitions which will go into before I show you the full, the full diagram, the first key intuition is actually something that we got out of Wilkinson who implemented the Gina Gina in 2003.",
                    "label": 0
                },
                {
                    "sent": "He used something called a physical property table to store RDF, and we will use what's called a logical property table for.",
                    "label": 1
                },
                {
                    "sent": "Instance matching, so we sort of taking the abstraction up or level, and the goal is to construct a pseudo schema from the property so you know, kind of it looks like this.",
                    "label": 1
                },
                {
                    "sent": "So you have a subject column and if you have like all the properties that are in the database, you would have a column for each property.",
                    "label": 0
                },
                {
                    "sent": "So you're using the properties to build a schema and the subject would be the key of the table, so it would be the primary key of the table, because each subject you are I would have just one unique role in that and all the different properties would.",
                    "label": 0
                },
                {
                    "sent": "Go into that.",
                    "label": 0
                },
                {
                    "sent": "So that's the that's what the physical table would look like.",
                    "label": 0
                },
                {
                    "sent": "We'll go into the logical table a little more, and Secondly so we have two datasets and we will actually construct the property tables for both.",
                    "label": 1
                },
                {
                    "sent": "The question is, how do we now run sorted neighborhood on both of those tables?",
                    "label": 1
                },
                {
                    "sent": "Because usually there's just one table and one schemas in that diagram that I showed you for just one table, one sliding windows.",
                    "label": 0
                },
                {
                    "sent": "So how can we reconcile the two tables and will go into that is?",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, and so this is what the workflow actually looks like.",
                    "label": 0
                },
                {
                    "sent": "So in the first half.",
                    "label": 0
                },
                {
                    "sent": "So this is this should actually be looked at in like top half and bottom half and will go into the smaller details are a little later.",
                    "label": 0
                },
                {
                    "sent": "So in the top half you know these are the inputs so we have the two blocking keys, one for each IDF data set G1 and G2, and you can sort of see here that you know if it's Markle accessible.",
                    "label": 0
                },
                {
                    "sent": "Then there's a query we need to execute, and I'll go into that and then do some post processing if it's not sparkle accessible, we would just execute.",
                    "label": 0
                },
                {
                    "sent": "A batch processing algorithm, so it's very easy to derive the property table if we just given N triples file.",
                    "label": 0
                },
                {
                    "sent": "Like if I just give you an interest while you just need to read the file it so you know event procedure.",
                    "label": 0
                },
                {
                    "sent": "You can build a table with, you know, just a column for each property very easily.",
                    "label": 0
                },
                {
                    "sent": "If you have, you know the whole file, but if there's if it's Markle access will, then the naive ways that we down we do a select star we do the whole dump and then we do the batch that very inefficient.",
                    "label": 0
                },
                {
                    "sent": "Or we can do it more intelligently, which which I'll show you in the next slide, but the end result is that we get this.",
                    "label": 0
                },
                {
                    "sent": "These things called projected logical property table.",
                    "label": 0
                },
                {
                    "sent": "Projected because not all the properties might be in the table, so we will only use.",
                    "label": 0
                },
                {
                    "sent": "So over here we actually have all the properties but we will not use all the properties in the logical version.",
                    "label": 0
                },
                {
                    "sent": "We will only use the ones that we need to use.",
                    "label": 0
                },
                {
                    "sent": "So in some sense we are projecting out some of the properties.",
                    "label": 0
                },
                {
                    "sent": "So that's the projected logical tables and then those both of those tables will go in the modified sorry neighborhood algorithm, which are also described will be run.",
                    "label": 0
                },
                {
                    "sent": "And finally you know the candidates that will go into the second the classification step.",
                    "label": 0
                },
                {
                    "sent": "Which comes after blocking, so we're not dealing with that here, but you know, so it's not the end of the workflow.",
                    "label": 0
                },
                {
                    "sent": "For instance, matching.",
                    "label": 0
                },
                {
                    "sent": "We still have to do the second classification step, and there are also options you know, like you don't have to run the whole thing over again if you change your blocking key.",
                    "label": 0
                },
                {
                    "sent": "Your graph updates things like that.",
                    "label": 0
                },
                {
                    "sent": "We have options of publishing VKV for publishing, blocking key values, candidate sets, and so on, so you can cache intermediate results and sort of reuse.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You know, as you change things so you know constructing the sparkle queries.",
                    "label": 0
                },
                {
                    "sent": "So let's assume we have, you know like in the diagram we have the blocking key, so we'll assume that the blocking key is defined only in terms of the properties in the data set, so that makes sense because there's not a lot more we can actually define the blocking key on.",
                    "label": 1
                },
                {
                    "sent": "We don't have a schema, so we can't use function in terms of a schema, so we literally have to use the properties and I'll give an example in the next slide.",
                    "label": 0
                },
                {
                    "sent": "But let's assume that we're using properties.",
                    "label": 0
                },
                {
                    "sent": "P1 to PD in the blocking key, and that's what will be contained within the properties set.",
                    "label": 1
                },
                {
                    "sent": "So the property set contains a set of properties that will be used in the blocking key, and this is a generic way.",
                    "label": 0
                },
                {
                    "sent": "It looks ugly.",
                    "label": 0
                },
                {
                    "sent": "I'll be happy to come back to this after the talk, but right now.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I just want to give you an example.",
                    "label": 0
                },
                {
                    "sent": "You know because that that will hopefully clarify.",
                    "label": 0
                },
                {
                    "sent": "So let's say we have this blocking keys, so we come back to our old example of Mike Page, so tokens subject union tokens D1 has brother.",
                    "label": 0
                },
                {
                    "sent": "So D1 has brothers is obviously a property and subject over your simply refers to the subject you are I what it says is that if two things have the same token in the subject, or at least have a common token in the subject and or have a common you know has have a common Grado.",
                    "label": 0
                },
                {
                    "sent": "Then they would essentially have the same blocking key, so in this case you know we can kind of see that when we run the instantiated query.",
                    "label": 1
                },
                {
                    "sent": "This is what we kind of get, so not all the properties I've shown up, we only have the property that is used, which is has.",
                    "label": 0
                },
                {
                    "sent": "Brother subject always shows up.",
                    "label": 0
                },
                {
                    "sent": "Mike Bates does not have a brother, you know, neither does Dayton, Sam cracks and so on.",
                    "label": 0
                },
                {
                    "sent": "South those cells are empty.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, Joan cracks.",
                    "label": 0
                },
                {
                    "sent": "Bates has two brothers, so subject is not actually your primary key over here.",
                    "label": 1
                },
                {
                    "sent": "In this table of what's called loosely structured.",
                    "label": 0
                },
                {
                    "sent": "And the empty cell.",
                    "label": 0
                },
                {
                    "sent": "So that's another problem.",
                    "label": 0
                },
                {
                    "sent": "But we also have these rows where we have multiple values.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's kind of just so very simple post processing to get the property table out of this where we flat into rows that have multiple values using our reserve delimiter.",
                    "label": 0
                },
                {
                    "sent": "So that's the; Or whatever it can be.",
                    "label": 0
                },
                {
                    "sent": "Any reserve delimiter and we replace the empty values with reserved keyword, which just in this case would be null.",
                    "label": 0
                },
                {
                    "sent": "And that's kind of what we how we get to logical property table.",
                    "label": 1
                },
                {
                    "sent": "So it's different from the physical version that was proposed by Wilkinson, but very similar principles.",
                    "label": 0
                },
                {
                    "sent": "So again properties are columns on the subject would be the key.",
                    "label": 0
                },
                {
                    "sent": "In the table, so that's.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Over here and now, of course, we have two tables, one for each, one for each graph, so we need to modify the sort of neighborhood algorithm to do that, and I'll just go through the two or three main steps over here.",
                    "label": 0
                },
                {
                    "sent": "So first you know the candidate said, you know, we initialize it to be empty, and then we apply each blocking key.",
                    "label": 0
                },
                {
                    "sent": "So say B12, each two plenty, one so very similar to original sorted neighborhood semantics where you just apply a blocking into each record in a table.",
                    "label": 0
                },
                {
                    "sent": "You get a blocking key value.",
                    "label": 0
                },
                {
                    "sent": "But he also changed.",
                    "label": 0
                },
                {
                    "sent": "We build multi Maps so multi map is.",
                    "label": 0
                },
                {
                    "sent": "You know it's like it's like an ordinary map hash map.",
                    "label": 0
                },
                {
                    "sent": "But you can have a set of values you don't.",
                    "label": 0
                },
                {
                    "sent": "You have a key and instead of a value you can have a set of values.",
                    "label": 0
                },
                {
                    "sent": "So the BKV the blocking key value over.",
                    "label": 0
                },
                {
                    "sent": "Here is the key and the set of records that would have the same blocking key value would be the the set that is referenced by other blocking key value and we get 2 multi Maps by one and Pi 2 and Now what we do is.",
                    "label": 0
                },
                {
                    "sent": "And this is kind of the working.",
                    "label": 0
                },
                {
                    "sent": "Agres part because we think that there are better ways of doing this.",
                    "label": 0
                },
                {
                    "sent": "Kind of working on that, but for now we just kind of join the two Maps together.",
                    "label": 0
                },
                {
                    "sent": "So basically if there is a blocking key value that shows up in one map and doesn't show up in the other map, it would get discarded.",
                    "label": 0
                },
                {
                    "sent": "It's not useful to us, but the others we joined, and if one of the set of records they Rs if R is bigger than S&R, would get truncated.",
                    "label": 0
                },
                {
                    "sent": "So we discard some records so this truncation threshold is clearly important and we tune that you know, and after that we kind of the rest of it can actually be.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Visualized so we get a table like this so once we merge the two once we join on the blocking key values and we only need to retain the subject because the subject was the primary key in both the property tables.",
                    "label": 0
                },
                {
                    "sent": "So we have these two subjects we have the blocking key values and we can actually run the windowing process on this.",
                    "label": 0
                },
                {
                    "sent": "So here I'm just showing double equals to two we already showed with W equal to three, but the blue can be anything and we just slide and so the subject subject pairs would be the candidate set that we would actually need to compare.",
                    "label": 0
                },
                {
                    "sent": "In the classification step.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, just to recap, you know the proposed system.",
                    "label": 0
                },
                {
                    "sent": "We take the two blocking keys.",
                    "label": 0
                },
                {
                    "sent": "We extract the property sets or you know we check if it sparkle, access will or not.",
                    "label": 0
                },
                {
                    "sent": "You know ultimately we get these projected property tables which goes into the modified algorithm.",
                    "label": 0
                },
                {
                    "sent": "We can publish intermediate results and finally the candidate said goes into the classification step.",
                    "label": 0
                },
                {
                    "sent": "So hopefully this is a little more clear after those components and now.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the experiments, so we use five or benchmark.",
                    "label": 0
                },
                {
                    "sent": "So we use small benchmarks for this work for, but we are currently evaluating on large or MapReduce based or infrastructure also, but for this work we only use very small but very well established benchmarks, so these are very commonly used in the instance matching community.",
                    "label": 0
                },
                {
                    "sent": "These all of them are believer from the OAI initiative which takes place at RSW.",
                    "label": 0
                },
                {
                    "sent": "See and they known to be fairly challenging or we learn the blocking key using an unsupervised.",
                    "label": 1
                },
                {
                    "sent": "Good clustering methods.",
                    "label": 0
                },
                {
                    "sent": "We did not have a user come in and give us a blocking key.",
                    "label": 0
                },
                {
                    "sent": "We use a state of the art algorithm by pappadakis and coauthors to learn the scheme using an unsupervised method, and we use the same blocking key for all the baselines so that you know we're not penalising anyone unfairly and we compare against two baselines, block purging, which was again proposing 2011.",
                    "label": 1
                },
                {
                    "sent": "It's known to perform very well for schema free data sets and canopy's which can also be applied on schema free data sets.",
                    "label": 0
                },
                {
                    "sent": "It was proposed by Andrew McCallum and his group.",
                    "label": 0
                },
                {
                    "sent": "In 2000, known to be a very good algorithm, very simple to implement and with some good properties, and it can be used on schema free, so we're evaluating against these two schema freebase lines, one of which is well known in our community and the other which is more well known outside our community but can be used.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So these are the three metrics, so it's not Christian.",
                    "label": 0
                },
                {
                    "sent": "Recall, we don't evaluate blocking using Christian recall because it's not the final output.",
                    "label": 0
                },
                {
                    "sent": "We have the classification step that evaluates unchristian recall.",
                    "label": 0
                },
                {
                    "sent": "But to actually evaluate the blocking individually, we have these two metrics called pairs, completeness and reduction ratio.",
                    "label": 1
                },
                {
                    "sent": "So pairs completeness is basically, you know how many true pairs are included in your candidate set.",
                    "label": 0
                },
                {
                    "sent": "So the coverage of your candidate said if your candidate side is not good, then you won't include any true pairs.",
                    "label": 0
                },
                {
                    "sent": "And you have trouble doing well in the classification.",
                    "label": 0
                },
                {
                    "sent": "Will get almost zero recall in the classification if you don't cover in this phase itself.",
                    "label": 0
                },
                {
                    "sent": "Reduction ratio basically measures that.",
                    "label": 0
                },
                {
                    "sent": "What fraction of NM have I reduced?",
                    "label": 0
                },
                {
                    "sent": "You know.",
                    "label": 0
                },
                {
                    "sent": "So if NM, like you have reduced 99% of that, 90% of that in the candidate set, because ultimately blocking is all about complexity and the F score is just a harmonic mean of that so.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "He quickly let me show you the results.",
                    "label": 0
                },
                {
                    "sent": "What we find is that block purging continues to do very well.",
                    "label": 0
                },
                {
                    "sent": "You know on these datasets, which is a good thing, but the reduction ratio of block purging is actually very low, so we have 87% versus 93% and it's known in our community that even small differences in reduction ratio are known to have large impact because it's a quadratic function.",
                    "label": 1
                },
                {
                    "sent": "Reduction ratios dependent on EM.",
                    "label": 0
                },
                {
                    "sent": "So even point 1.2% can have has this ginormous impact, basically.",
                    "label": 0
                },
                {
                    "sent": "So we need you know this is a very big difference in production issue.",
                    "label": 0
                },
                {
                    "sent": "And finally for Canopy's, I have some backup slides on this.",
                    "label": 1
                },
                {
                    "sent": "I'm almost done but it's out performed by both methods on PCF score it does do well on reduction ratio though, but it does really badly on the other two.",
                    "label": 0
                },
                {
                    "sent": "So it means that Canopy's should not really be used in our community.",
                    "label": 0
                },
                {
                    "sent": "Unit was very good for the domain it was used on.",
                    "label": 0
                },
                {
                    "sent": "It does not seem to be doing so well with ur eyes and.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just in our community in general.",
                    "label": 0
                },
                {
                    "sent": "So to conclude, these are kind of my takeaways.",
                    "label": 0
                },
                {
                    "sent": "First efficient, I am on schema free idea is a challenging problem.",
                    "label": 1
                },
                {
                    "sent": "It's an ongoing problem and we presented one solution.",
                    "label": 0
                },
                {
                    "sent": "It's not the only solution, but it's one solution and it's so adaptation of a classic algorithm which has many variants, so this kind of have a lot of follow ups where a lot of variants can actually be now applied by using this workflow and represent a workflow for doing that.",
                    "label": 1
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}