{
    "id": "rznixaztvfswd2xuthmqpab5pzia2kyz",
    "title": "Changing the Perspective on Machine Translation",
    "info": {
        "author": [
            "Radu Soricut, SDL PLC"
        ],
        "recorded by": [
            "German Research Center for Artificial Intelligence (DFKI)"
        ],
        "published": "Aug. 9, 2012",
        "recorded": "June 2012",
        "category": [
            "Top->Computer Science->Natural Language Processing",
            "Top->Technology->Innovation",
            "Top->Science->Scientific Research"
        ]
    },
    "url": "http://videolectures.net/metaforum2012_soricut_translation/",
    "segmentation": [
        [
            "Hello everybody, thanks for having us here.",
            "I'm going to talk about the machine translation and in particular about something that is close to my heart about how we should actually think about machine translation and how should we see it as a changing field.",
            "I will start with."
        ],
        [
            "Uh, that's capable of machine community promotion.",
            "Translation community was concerned with in the last 10 years or so, and most of these acronyms are names.",
            "I'm pretty sure that most of you are familiar with is about statistical based machine translation, blue in terms of measuring how how good the translations are technology, it's phrase based tax base synchronous grammars and other things that are emerging in the last year such as domain adaptation.",
            "Quality estimation of valid identification.",
            "So all these things are things that you can see in the in the research community that talks about machine translation and when you look at the.",
            "Industry and what industry is concerned with regard machine translation.",
            "You can see discussions about the statistical versus rule based versus hybrid.",
            "How do we leverage the repositories?",
            "How do we do customization?",
            "How do we build machine translation apps use cases?",
            "So all these things pop up very often when machine translation comes into this session.",
            "But when you look at what manner?"
        ],
        [
            "In the end, to the customers and to the end users, it turns out they don't care about the technology behind machine translation went through based or statistical or hybrid.",
            "They certainly don't care how you measure it, then how blue is computed.",
            "They don't care about incremental advantage advances or about data.",
            "They basically care about.",
            "What can we do with the empty and how you can have value out of it.",
            "Turns out that our."
        ],
        [
            "Philosophy is that a lot more value can be created when you plug the empty solution inside your ecosystem in an enterprise.",
            "For that we have identified this wheels that can turn the value of machine translation into into something that can really make an impact, and these wheels are basically about GTM assets that can have their about customization in there about user feedback and even better is when you can bring the."
        ],
        [
            "Tap into the equation and when you can leverage the existence of huge repository's of data that are available on the web.",
            "Before I move on, I will make a short tour to showing you a bit of."
        ],
        [
            "How is tickle machine translation can be seen from a very high level in terms of what it matters for statistical machine translation to work and on the Y axis there you have empty quality.",
            "Doesn't matter how you measure, it is just higher is better and the truth of the matter is that the amount of data that you use matters a lot, so more data equals more quality.",
            "It seems to be sort of a. Algorithmic scale, but still you you still get another advantage out of having more data.",
            "This is one of the reasons, for instance, that everybody talks about Google Translate because they were the first ones to crack this big map of how do you leverage large amounts of data?",
            "The other part of the equation is of course better algorithms, and this is what mostly is being discussed in the academic community.",
            "How do we do better in terms of models in terms of algorithms?",
            "There is another important dimension there that is domain specific.",
            "Basically, if you focus your data on a specific vertical or specific domain then you can get a lot more quality out of that.",
            "And finally there is feedback.",
            "The usage that you get out of this initial round, but if you can have a positive feedback loop there then you can definitely increase the quality.",
            "So that these 4 dimensions being given."
        ],
        [
            "The question that I want to ask here and then I'll take a few steps to answer it, is what you get with empty when it's part of a larger ecosystem.",
            "And the first thing that you."
        ],
        [
            "Yeah, it is basically.",
            "TMZ it exploitation and again I'll refer to Google as being the property.",
            "For example here, because when you have data that is being hidden inside billions of web pages.",
            "You you need a very strong infrastructure and very strong engineering.",
            "Support that expertise in order to be able to mine that data out.",
            "But once you you can handle the amount of data at the web level and once you have the algorithms in place to identify parallel data, then you can basically start milking this this huge resource in terms of parallel corpora for for building.",
            "Vapor machine translation engines.",
            "So what I'm what I'm getting at here is that basically there were lots of valuations done that is showing that indeed.",
            "However, you want to measure.",
            "Again, this is on a scale of 1 to 5 in terms of every valuator is liking the translations you can see clearly increases as you add more data, let's say from one year to the next when we started exploiting this availability of.",
            "Data mined from from the web.",
            "You can clearly see increases, so the point here is that it doesn't really matter at one specific point how good your engine is.",
            "If you're part of a large ecosystem where exploiting data comes naturally by having the infrastructure in place, than this curve will is this performance will continually increase by by the sheer fact of adding lots of data according to the equation that I described.",
            "Before, so this is very DM acid, exploitation in terms of of milking.",
            "This is hugely important asset of of data, which is the web is a very important part of what you can do with the machine translation inside this larger ecosystem that allows you to do this exploitation.",
            "Another important part there is the other patient."
        ],
        [
            "In which you can basically have all the barrel data available to you being combined with signal that comes from the enterprise means or usage.",
            "And once you can successfully combine this signal, you can extract training data via some bigger selection method.",
            "That in the end would give additional advantage and I have another.",
            "There's comparisons here that basically show across languages.",
            "The fact that you can get huge gains in terms of accuracy of machine translation simply by using less data but more targeted towards the domain that customer is interested in that particular vertical.",
            "And a Third Point."
        ],
        [
            "That I want to bring is about how we discovered as an extremely important facet of empty adoption.",
            "The fact that you can make your empty system or empty ecosystem, so to speak out aware of its own failures, and this is a piece of technology that we call trust score.",
            "You have here example of English, Korean for specific customer where basically on the scale of 1 to 5.",
            "You can have the automatic prediction correlate extremely well with the human prediction in terms of how good the translations are on this scale of 1 to 5, and you can see that when the humans are saying it's good, machine also tends to say it's good and the other way around.",
            "So this we call this out awareness because it's in the end part of this, it's not the empty engine itself, it's a layer on top of the empty engine that does that.",
            "But once you have that in place that opens up the possibility of of integrating.",
            "Your empty solution into applications that are now taking advantage of this being available to them, and be aware that in case of empty failure, when it's recognized, probably empty, poor job, then you can have alternative ways of dealing with it.",
            "And the last part of the."
        ],
        [
            "Ecosystem is basically the integration of user feedback.",
            "We have we have this product.",
            "Is it called the global that allows one to handle these terms and phrases?",
            "You can add them to so called dictionaries.",
            "They will improve translation instantly on the on the phrases that you're targeting.",
            "We also have feedback and suggestion widgets that can be used there to basically rate translations so that you can improve on the on the prediction capability.",
            "You can also suggest different translations that can be used to improve it, improve the.",
            "Engine so all these things we believe are very, very important for a solution that has impeded core to be successful.",
            "Because only integrating this this wheels together, you can fully leverage everything that has been done up to date in the machine translation field.",
            "Um?"
        ],
        [
            "For the future of empty act right here to identify a couple of the challenges that we see ahead.",
            "One of the challenges it turns out to be.",
            "How do you scale from basically hundreds of customers to say 10s of thousands of customers that each have their unique characteristics and requirements?",
            "We would like to be able to do that to basically adapt the entry solution for each of these individual customers, but this is still a challenge that.",
            "It's somewhere in the future to be solved.",
            "Adaptation is again something that we currently do, but it's also something that.",
            "Is clearly a things need to be to be done even better so that you can very very quickly and efficiently adapt to, say, change in terminology and the style.",
            "So all those things are.",
            "Are important for adoption effective future in this ever changing world, but it's the current technology basically does it.",
            "2 slower paced according to most of the customers and then to how we feel about this.",
            "So this is again another challenge of how you do quick adaptation and then finally feedback we I presented a couple of ways in which we currently incorporate feedback into the empty engines, but doing automatically.",
            "Some sort of automatic validation based on this feedback inside of an empty ecosystem is still something of a challenge and is a direction that would love to see people look into and contribute to bring clever solutions.",
            "So I would like to add."
        ],
        [
            "With basically a.",
            "Asking you to take a step back and change a bit the perspective on empty that you may have currently in which the technology components are maybe not so important.",
            "What is important is the ecosystem and the value that you can bring with the entire ecosystem to the end customer and that that where they will see the value coming most thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everybody, thanks for having us here.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about the machine translation and in particular about something that is close to my heart about how we should actually think about machine translation and how should we see it as a changing field.",
                    "label": 0
                },
                {
                    "sent": "I will start with.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uh, that's capable of machine community promotion.",
                    "label": 0
                },
                {
                    "sent": "Translation community was concerned with in the last 10 years or so, and most of these acronyms are names.",
                    "label": 1
                },
                {
                    "sent": "I'm pretty sure that most of you are familiar with is about statistical based machine translation, blue in terms of measuring how how good the translations are technology, it's phrase based tax base synchronous grammars and other things that are emerging in the last year such as domain adaptation.",
                    "label": 0
                },
                {
                    "sent": "Quality estimation of valid identification.",
                    "label": 0
                },
                {
                    "sent": "So all these things are things that you can see in the in the research community that talks about machine translation and when you look at the.",
                    "label": 0
                },
                {
                    "sent": "Industry and what industry is concerned with regard machine translation.",
                    "label": 0
                },
                {
                    "sent": "You can see discussions about the statistical versus rule based versus hybrid.",
                    "label": 0
                },
                {
                    "sent": "How do we leverage the repositories?",
                    "label": 0
                },
                {
                    "sent": "How do we do customization?",
                    "label": 0
                },
                {
                    "sent": "How do we build machine translation apps use cases?",
                    "label": 0
                },
                {
                    "sent": "So all these things pop up very often when machine translation comes into this session.",
                    "label": 0
                },
                {
                    "sent": "But when you look at what manner?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the end, to the customers and to the end users, it turns out they don't care about the technology behind machine translation went through based or statistical or hybrid.",
                    "label": 1
                },
                {
                    "sent": "They certainly don't care how you measure it, then how blue is computed.",
                    "label": 0
                },
                {
                    "sent": "They don't care about incremental advantage advances or about data.",
                    "label": 1
                },
                {
                    "sent": "They basically care about.",
                    "label": 0
                },
                {
                    "sent": "What can we do with the empty and how you can have value out of it.",
                    "label": 0
                },
                {
                    "sent": "Turns out that our.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Philosophy is that a lot more value can be created when you plug the empty solution inside your ecosystem in an enterprise.",
                    "label": 0
                },
                {
                    "sent": "For that we have identified this wheels that can turn the value of machine translation into into something that can really make an impact, and these wheels are basically about GTM assets that can have their about customization in there about user feedback and even better is when you can bring the.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tap into the equation and when you can leverage the existence of huge repository's of data that are available on the web.",
                    "label": 0
                },
                {
                    "sent": "Before I move on, I will make a short tour to showing you a bit of.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How is tickle machine translation can be seen from a very high level in terms of what it matters for statistical machine translation to work and on the Y axis there you have empty quality.",
                    "label": 0
                },
                {
                    "sent": "Doesn't matter how you measure, it is just higher is better and the truth of the matter is that the amount of data that you use matters a lot, so more data equals more quality.",
                    "label": 1
                },
                {
                    "sent": "It seems to be sort of a. Algorithmic scale, but still you you still get another advantage out of having more data.",
                    "label": 0
                },
                {
                    "sent": "This is one of the reasons, for instance, that everybody talks about Google Translate because they were the first ones to crack this big map of how do you leverage large amounts of data?",
                    "label": 0
                },
                {
                    "sent": "The other part of the equation is of course better algorithms, and this is what mostly is being discussed in the academic community.",
                    "label": 0
                },
                {
                    "sent": "How do we do better in terms of models in terms of algorithms?",
                    "label": 0
                },
                {
                    "sent": "There is another important dimension there that is domain specific.",
                    "label": 0
                },
                {
                    "sent": "Basically, if you focus your data on a specific vertical or specific domain then you can get a lot more quality out of that.",
                    "label": 0
                },
                {
                    "sent": "And finally there is feedback.",
                    "label": 0
                },
                {
                    "sent": "The usage that you get out of this initial round, but if you can have a positive feedback loop there then you can definitely increase the quality.",
                    "label": 0
                },
                {
                    "sent": "So that these 4 dimensions being given.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The question that I want to ask here and then I'll take a few steps to answer it, is what you get with empty when it's part of a larger ecosystem.",
                    "label": 0
                },
                {
                    "sent": "And the first thing that you.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, it is basically.",
                    "label": 0
                },
                {
                    "sent": "TMZ it exploitation and again I'll refer to Google as being the property.",
                    "label": 0
                },
                {
                    "sent": "For example here, because when you have data that is being hidden inside billions of web pages.",
                    "label": 1
                },
                {
                    "sent": "You you need a very strong infrastructure and very strong engineering.",
                    "label": 0
                },
                {
                    "sent": "Support that expertise in order to be able to mine that data out.",
                    "label": 0
                },
                {
                    "sent": "But once you you can handle the amount of data at the web level and once you have the algorithms in place to identify parallel data, then you can basically start milking this this huge resource in terms of parallel corpora for for building.",
                    "label": 0
                },
                {
                    "sent": "Vapor machine translation engines.",
                    "label": 0
                },
                {
                    "sent": "So what I'm what I'm getting at here is that basically there were lots of valuations done that is showing that indeed.",
                    "label": 0
                },
                {
                    "sent": "However, you want to measure.",
                    "label": 0
                },
                {
                    "sent": "Again, this is on a scale of 1 to 5 in terms of every valuator is liking the translations you can see clearly increases as you add more data, let's say from one year to the next when we started exploiting this availability of.",
                    "label": 0
                },
                {
                    "sent": "Data mined from from the web.",
                    "label": 0
                },
                {
                    "sent": "You can clearly see increases, so the point here is that it doesn't really matter at one specific point how good your engine is.",
                    "label": 0
                },
                {
                    "sent": "If you're part of a large ecosystem where exploiting data comes naturally by having the infrastructure in place, than this curve will is this performance will continually increase by by the sheer fact of adding lots of data according to the equation that I described.",
                    "label": 0
                },
                {
                    "sent": "Before, so this is very DM acid, exploitation in terms of of milking.",
                    "label": 0
                },
                {
                    "sent": "This is hugely important asset of of data, which is the web is a very important part of what you can do with the machine translation inside this larger ecosystem that allows you to do this exploitation.",
                    "label": 0
                },
                {
                    "sent": "Another important part there is the other patient.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In which you can basically have all the barrel data available to you being combined with signal that comes from the enterprise means or usage.",
                    "label": 0
                },
                {
                    "sent": "And once you can successfully combine this signal, you can extract training data via some bigger selection method.",
                    "label": 0
                },
                {
                    "sent": "That in the end would give additional advantage and I have another.",
                    "label": 0
                },
                {
                    "sent": "There's comparisons here that basically show across languages.",
                    "label": 0
                },
                {
                    "sent": "The fact that you can get huge gains in terms of accuracy of machine translation simply by using less data but more targeted towards the domain that customer is interested in that particular vertical.",
                    "label": 0
                },
                {
                    "sent": "And a Third Point.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That I want to bring is about how we discovered as an extremely important facet of empty adoption.",
                    "label": 0
                },
                {
                    "sent": "The fact that you can make your empty system or empty ecosystem, so to speak out aware of its own failures, and this is a piece of technology that we call trust score.",
                    "label": 0
                },
                {
                    "sent": "You have here example of English, Korean for specific customer where basically on the scale of 1 to 5.",
                    "label": 0
                },
                {
                    "sent": "You can have the automatic prediction correlate extremely well with the human prediction in terms of how good the translations are on this scale of 1 to 5, and you can see that when the humans are saying it's good, machine also tends to say it's good and the other way around.",
                    "label": 0
                },
                {
                    "sent": "So this we call this out awareness because it's in the end part of this, it's not the empty engine itself, it's a layer on top of the empty engine that does that.",
                    "label": 0
                },
                {
                    "sent": "But once you have that in place that opens up the possibility of of integrating.",
                    "label": 0
                },
                {
                    "sent": "Your empty solution into applications that are now taking advantage of this being available to them, and be aware that in case of empty failure, when it's recognized, probably empty, poor job, then you can have alternative ways of dealing with it.",
                    "label": 0
                },
                {
                    "sent": "And the last part of the.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ecosystem is basically the integration of user feedback.",
                    "label": 1
                },
                {
                    "sent": "We have we have this product.",
                    "label": 0
                },
                {
                    "sent": "Is it called the global that allows one to handle these terms and phrases?",
                    "label": 0
                },
                {
                    "sent": "You can add them to so called dictionaries.",
                    "label": 0
                },
                {
                    "sent": "They will improve translation instantly on the on the phrases that you're targeting.",
                    "label": 0
                },
                {
                    "sent": "We also have feedback and suggestion widgets that can be used there to basically rate translations so that you can improve on the on the prediction capability.",
                    "label": 1
                },
                {
                    "sent": "You can also suggest different translations that can be used to improve it, improve the.",
                    "label": 0
                },
                {
                    "sent": "Engine so all these things we believe are very, very important for a solution that has impeded core to be successful.",
                    "label": 0
                },
                {
                    "sent": "Because only integrating this this wheels together, you can fully leverage everything that has been done up to date in the machine translation field.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For the future of empty act right here to identify a couple of the challenges that we see ahead.",
                    "label": 1
                },
                {
                    "sent": "One of the challenges it turns out to be.",
                    "label": 0
                },
                {
                    "sent": "How do you scale from basically hundreds of customers to say 10s of thousands of customers that each have their unique characteristics and requirements?",
                    "label": 1
                },
                {
                    "sent": "We would like to be able to do that to basically adapt the entry solution for each of these individual customers, but this is still a challenge that.",
                    "label": 0
                },
                {
                    "sent": "It's somewhere in the future to be solved.",
                    "label": 0
                },
                {
                    "sent": "Adaptation is again something that we currently do, but it's also something that.",
                    "label": 0
                },
                {
                    "sent": "Is clearly a things need to be to be done even better so that you can very very quickly and efficiently adapt to, say, change in terminology and the style.",
                    "label": 0
                },
                {
                    "sent": "So all those things are.",
                    "label": 0
                },
                {
                    "sent": "Are important for adoption effective future in this ever changing world, but it's the current technology basically does it.",
                    "label": 0
                },
                {
                    "sent": "2 slower paced according to most of the customers and then to how we feel about this.",
                    "label": 0
                },
                {
                    "sent": "So this is again another challenge of how you do quick adaptation and then finally feedback we I presented a couple of ways in which we currently incorporate feedback into the empty engines, but doing automatically.",
                    "label": 0
                },
                {
                    "sent": "Some sort of automatic validation based on this feedback inside of an empty ecosystem is still something of a challenge and is a direction that would love to see people look into and contribute to bring clever solutions.",
                    "label": 0
                },
                {
                    "sent": "So I would like to add.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With basically a.",
                    "label": 0
                },
                {
                    "sent": "Asking you to take a step back and change a bit the perspective on empty that you may have currently in which the technology components are maybe not so important.",
                    "label": 1
                },
                {
                    "sent": "What is important is the ecosystem and the value that you can bring with the entire ecosystem to the end customer and that that where they will see the value coming most thank you.",
                    "label": 0
                }
            ]
        }
    }
}