{
    "id": "s3rdscdsdghkxupwzvj326vzuzsm3aas",
    "title": "Factored Envisioning",
    "info": {
        "author": [
            "Johan de Kleer, Xerox Research Centre Europe, Xerox"
        ],
        "published": "July 22, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Computer Science->Machine Learning"
        ]
    },
    "url": "http://videolectures.net/qr09_kleer_fe/",
    "segmentation": [
        [
            "Well, thank you very much for coming.",
            "I would just think I notice that Ken is a coauthor on every one of the talks in the session, and therefore he should give all of them, but he's giving none of them, I think.",
            "So factored envisioning is really one of the concepts.",
            "This is part of a larger deep green project that can I deeply involved in applying qualitative reasoning to a military domain, so I don't know if there's any Peter Strauss clones in here, but they would now stand up.",
            "And walk out.",
            "I talked to Peter last week.",
            "And I asked him if he would stand up and walk out and he said yes.",
            "But he was perfectly willing to talk about it.",
            "So that's interesting.",
            "Anyways, this is an exciting project because there must be about 50 people working on different aspects of this.",
            "Only small part is what we do, but we do the core reasoning and it's applying qualitative reasoning to an entirely new domain and cannot look a little bit in the past.",
            "But I actually haven't seen us building models for military actions yet, so this is a new.",
            "And I'm going to do more of a sort of kind of overview of what we've done, rather than drill down on, factored envisioning precisely."
        ],
        [
            "So.",
            "So that's what we're trying to do.",
            "This is sort of a BA E slide, so we're working collaboratively with BA.",
            "I'm sure most of you now with Sift University of Texas, Tracy Hammond and Mr. Computers are right now being used in the military for logistics and zillion things.",
            "But can we actually use them to support the art of battle?",
            "How?",
            "What goes on and the language that the commanders uses with course of action diagram that you have seen can present.",
            "In previous years.",
            "I can't read that slide that's bad.",
            "Instead of and the intuition, I mean it's actually really exciting.",
            "The intuition behind this Docker program is that commanders naturally deal think about the world qualitatively.",
            "What influences what causes what?",
            "So in our task is not to replace the Commander is to augment a command or give him advice.",
            "Hentai things are not going well.",
            "In one curse thing, of course you have to watch out for when you work for DARPA, the thing actually has to work, or if they cancel your contract and work means I'll talk on the end.",
            "Someone comes with your program, your program for a week, and you don't change it, and it has to work.",
            "And we're starting.",
            "What would they call in the military?",
            "By the way, if I give an acronym you don't actually use the militaries, more acronyms that could possibly imagine.",
            "So they say one that I shouldn't just ask an explanation.",
            "So I think we're dealing with what they call Hicks, which is we're dealing with battles or people actually banging against each other.",
            "High intensity conflicts like World War Two or what the battle would be in North and South Korea.",
            "Not not Iraq.",
            "And can you can pop up and say."
        ],
        [
            "Say anything wrong?",
            "So this is a.",
            "This is how a commander sketches out his plan for battle.",
            "This is actually using Ken's newer bottle battle space.",
            "I'll just walk through it.",
            "I'm not going to really drill down, but there's the blue, the good guys, the red, the bad guys.",
            "This this is the Hill, these are Hills these green Hills.",
            "This is a town.",
            "This is a River.",
            "I'm just sketching this out so there's all these symbols.",
            "By the way, is one part of the contract that we had implemented a simple recognizer, which is the whole project by itself from sketches.",
            "So there's three task forces here.",
            "Actually this is smaller, but much smaller, so the idea here is this.",
            "Blue Task Force goes along Axis lion to try to capture that Hill that defeat the red sitting on this Hill, and then when he succeeds at that, this task force here will move back, move through this and attack the city.",
            "This task force here is going to move up here to try to fix red here.",
            "So when Red is defeated on this Hill, Red will not move back and resupply back here.",
            "So red strategy if it doesn't know which way blue is coming.",
            "So if blue comes from this direction or direction, it's going to turn blue into this area, and then it's going to pound on it and destroy it.",
            "And this red unit here is actually trying to prevent this blue unit here.",
            "Going top of the Hill.",
            "Anyways, there's much more.",
            "Here is if Blue succeeds, then red is going to move.",
            "Here to resupply, and if there's anything left here, it will try in the goals of a blue is to prevent red for moving there, and that's what this symbol means.",
            "OK, so I talked too much, but that's and you heard qualitative terms and their qualitative spatial reasoning causality so this."
        ],
        [
            "As much as you want, I want to give you a flavor of it.",
            "So this is the only thing that's what this project is a head to head competition.",
            "There are two programs each, but they give 11 million to each one.",
            "We're doing it the qualitative way.",
            "The other competitive waste domestically, and what they're using is a huge numerical simulator on a cluster.",
            "Problem with that is my point of view.",
            "It's very, very hard to identify low probability high impact events and it's not real time so."
        ],
        [
            "We're going to win this.",
            "So the new domain for qualitative physics.",
            "It has envisionment, so envisionment gets exploded, is exploded like we usually see, but we have a new way of called factored envisionment which I haven't seen before.",
            "The closest is Dan Clancy's work.",
            "We now have probabilities on transitions and propagation of probabilities.",
            "I could write a whole paper, probably will on how to use quantitative reasoning to guide probability analysis.",
            "And we all know how to use qualitative reasoning to guide numerical analysis or symbolic analysis.",
            "But we can also do it for probability analysis, But that's another talk.",
            "So this is I."
        ],
        [
            "I'm not going to go over it again, but this is the chart I showed.",
            "This is sort of a Gantt chart of it.",
            "This is sort of a UML chart of it, but part of the task, not our component of it, is to parse this drawing and construct things like this with some hints.",
            "But this is the primary iomart medium for soldiers.",
            "This is the four components of deep green you draw sketch on some board like this and it gets interpreted.",
            "We do this part.",
            "This is the actual reasoning, and then when something goes wrong, pop up the commander and say OK, you're going to get completely destroyed if you keep on going that way.",
            "You wanted something different, that's that, and then this is a loop so I'm only going to talk about this part 'cause.",
            "And by the way, this is like these are big projects of actually recognizing and doing IO and deciding when to interact and as.",
            "And is also oral."
        ],
        [
            "Not just linguist and not just a interface.",
            "So first, so how was the person so this?",
            "This is a version of the what we built, but now we use something better so can don't pop up and say this is all wrong.",
            "I wrote the first one and I decided to use planning domain description language from the planning community.",
            "I liked it because it is very simple.",
            "It's very simple language.",
            "It is interesting observation.",
            "I don't know if people have said this before planning and visioning are almost the same thing.",
            "Planning envisioning are the same except planning has an objective function.",
            "The other thing is the military has a fixed set of actions that we never we didn't have to face the problem of where the models we have this problem models come from, But there already described fairly concretely about who's acting and what's an intent and what's.",
            "What's an actual consequence.",
            "So there only a few dozen, so we entered them ourselves so we don't have to worry about the modeling part.",
            "Part of the reason I did originally, it's trivial to convert to a planner once you have something in PDL bang, you gotta planner.",
            "I know we weren't supposed to do planning.",
            "But let me tell you, they construct plans which have gaps in them.",
            "So part of my idea was to have a planner to do."
        ],
        [
            "Gaps, although we never use that feature, so the model of time we use is very familiar both to people during action planning an qualitative reasoning.",
            "There's actions which take place overtime.",
            "They have.",
            "The same idea is instant interval, instant.",
            "Some actions occur for a multiple situations, and you basically just break the situation time into situations where there is no action starting or ending it inside of it.",
            "This is classic."
        ],
        [
            "Qualitative physics.",
            "Here's an example of a.",
            "A bit of an action.",
            "I better speed up here so this is move people don't know PDL, it's I'll read it for you.",
            "There is a unit.",
            "And has a front which is of type unit from which type location a path which is a path into his location and then this condition is at the beginning of the action.",
            "To enable it the unit has to be at his from location.",
            "The path you have to be able to you know it can't be too narrow, it can't be over.",
            "Can't be over a River.",
            "And if you can't even at the start that has the path is to exist and during the entire action you can't be under fire units don't move very well under fire.",
            "They usually almost stop.",
            "And the effect of this action, if it completes, is that the unit will be on that pass through the entire action.",
            "The distance between the unit and where it's headed to is one time for decreasing, and if it ends correctly without being interrupted, then the unit will."
        ],
        [
            "At the very end location, and here's one more.",
            "Even faster.",
            "But this is attacked by fire.",
            "Parameters are same color scheme that arguments are units and from.",
            "And then there's conditions under which type by fire continues.",
            "And then, for example, the effect is that the strength of the enemy is monotonically decreasing, and if you complete the action, the posture posture is a military term is defeated is same as string."
        ],
        [
            "Being effectively zero OK?",
            "Classic, envisioning This is classic.",
            "Envisioning it works directly on these PDL rules.",
            "We find all the influence for each quantity you identify all the quantities, control it points you for each consistent combination you compute the successors of its new.",
            "You go, if it's if it's not new, just called the next thing on the queue.",
            "If it is new.",
            "You look at all the actions which are terminating and you terminate them.",
            "You look under all the actions which are now enabled and you add them and you go on everybody in this room should be able to do this."
        ],
        [
            "So now we have.",
            "Let's say we really simple battle scenario.",
            "I'm only going to the top half of this graph, so this is a picture.",
            "So this demarcation line so I'm only do what's above the line so they have red and I guess is blue.",
            "One would get get to K and they both want to seize it.",
            "So here's here's a classic Envisionment initial location.",
            "They both start moving.",
            "But we don't know which gets there first, so this is B1R1 gets there first.",
            "This is B1 gets there first, here they get together and then they have their battle and then one wins.",
            "See one, sees completes correctly and the other one is interrupted.",
            "So this is our one wins.",
            "This is B1 wins."
        ],
        [
            "Again, absolutely standard.",
            "Here is the first problem we had.",
            "The biggest problem we had with envisioning it, let's post you have 3 three movements.",
            "I make very simple, so we have three parts of the battle which are disconnected in classical.",
            "Envisioning what you would do is well then first step is really easy.",
            "They all is an instant interval, so their olicity start start the same instant so you immediately have them all on their axes.",
            "But qualitatively you can't tell which ones go there first, so every possible order happens.",
            "So this is RF2 gets to.",
            "Gets to the result, gets Hill first and that and then it transfers to RS3 and then the other possibilities are all there.",
            "So you have all these States and these states are a potentially explosive and I'll refer.",
            "Will that work to Dan Clancy?",
            "Dan Clancy did work in the custom simulator because Chatter oscillation hunting when you're trying to find.",
            "Going close to 0 and you can never get there, but the custom simulator does this statically.",
            "It does a causal analysis of the interactions, so we factored envisioning which I show in a second with."
        ],
        [
            "This dynamically and the basic idea is very simple.",
            "Is is when you see an envisionment here a note as global state which the units are not interacting with you first do is split them into their.",
            "You create smaller kernel situations which everything in there is interacting with.",
            "Everything else, perhaps transitively, and in this case they're not interacting at all, so these are only one.",
            "So you're simulating basically envisioning just one thread.",
            "So this is the envisionment."
        ],
        [
            "But now replaces this.",
            "Now it looks like that."
        ],
        [
            "The States and then go down much, but their simplicity went down dramatically in any ambiguity in one batch."
        ],
        [
            "Will not go to the other.",
            "Um?"
        ],
        [
            "And what we do is harking back to pad his night Manifesto is in this battle.",
            "We immediately separate.",
            "We start moving.",
            "I'm going to.",
            "I'm not going to be hand.",
            "What happens is you keep on intersecting spacetime tubes.",
            "You go to see whether these units by themselves are interacting, and when they're interacting, then they have the battle is a triangular join.",
            "Then the battle happens.",
            "And then again I factor it out to its individual pieces.",
            "This is a much easier way to analyze the battle.",
            "When you look at a particular ambiguity in the global state, you don't have to look at the multiple things that are going on there because it's done automatically.",
            "As factored, envisioning, factored, envisioning is even simpler, so it uses regular envisioning as a as a start, so when it starts with some Q or the factor envisioning Q, it takes the first such situation.",
            "What it does is it breaks into his kernels often if they're already kernel situations that can't be factored, this will often be just one, and then it's fine."
        ],
        [
            "Install the new consistent situation, intersections and new successors and it adds all those successors to the futures graph.",
            "I mean part of me to the factored Q and then so this is literally how I implemented this.",
            "So this is sort of.",
            "This is six months old data what?"
        ],
        [
            "What I did is I took a bunch of examples fairly, fairly simple examples.",
            "This is how many units eight against zero to three against five, and this is how complicated the color was.",
            "This is number of situations I get if I.",
            "Don't even merch, so there's some discussion about whether you can get the same state.",
            "Two different qualities that are qualitatively equivalent, but their quantitatively different.",
            "So we've decided we now merged states which are qualitatively identical.",
            "So what you get here is this is the.",
            "This is the analysis for unmerged non factor.",
            "This is the analysis for merged unfactored and this is the merge factor, which is what we would naturally do in qualitative physics.",
            "And the good news here is in this column, for example, it takes almost just a fraction of a second are the most complicated analysis and doing the full envisionment cost is 425 seconds.",
            "We now do problems which are orders of magnitude more complicated.",
            "In fact be calculated out.",
            "This was 10 to the 15th if they had to expand it.",
            "So using qualitative values using them to merge situations being factored makes.",
            "Get gives you what you want.",
            "Now the Member one of the beautiful things of qualitative reasoning.",
            "We're really trying to achieve with this project is the military wants every possible qualitative outcome.",
            "So once we completeness and once every outcome to be can happen for some value of ammunition and terrain, so its soundness of completeness and thus.",
            "But this still remains sound incomplete, and I don't think there's simulator which there simulator has to simulate over and over and over again.",
            "Has any chance of ever getting all the possible qualitatively distinguished features?"
        ],
        [
            "OK.",
            "Cool, so you can't get me off of an ATM S. So this is just a slide from Ken's in my book.",
            "I'll be very brief about it.",
            "So what we now have to do, probability inferences on these and there's two important parts of getting probabilities and I'll talk about one of 'em is when you put an ATM S underneath all the situations and this is just to refresh people's memory justifications.",
            "This means you anticipate the consequences are knows these are contradictions.",
            "So when you see something like this, these are three justifications supporting this node, so there conjunctions.",
            "But this whole thing is it just disjunction of three?",
            "And these are the consequences."
        ],
        [
            "So how does the PMS work?",
            "So So what the military often wants to do is they have they want to put many plans against many other plans in the so each color pair gets ATM S assumption.",
            "I'm actually now put assumption under every color, but that's never there.",
            "Every situation get snowed, all uncertain.",
            "Transitions could have a probabilistic version of it all.",
            "Uncertain transition represented by an assumption, and each transition is."
        ],
        [
            "Represented justification or multiple justification.",
            "So really simple.",
            "So here's another envisionment.",
            "Unfortunately it slightly format because it's from my list program, but you can just see it, sort of.",
            "You can see that the arrows.",
            "So if there are any ways of getting here, it just constructs us just."
        ],
        [
            "Kacian structure.",
            "Now, if there's uncertainty, for example, there's a battle here.",
            "There's two outcomes.",
            "This is forget the join.",
            "What I do is I create two assumptions.",
            "In this case, let's say 5050, but the there typically are not.",
            "And then I say these two are contradiction.",
            "So this is the."
        ],
        [
            "Structure that you now need to compute.",
            "Now the interest ATM S structure for joins is judges justification.",
            "And here's an interesting example where you see the Anna scenes are both .041041.",
            "So the problem with this is you have these battles which merged and you wanted probability of a node, and you want to know the degree of independence between these two nodes.",
            "Again, the underlying ATM S which would hold the talk figures out the degree of independence for itself, and in this case is very interesting.",
            "It notices that they are totally dependent.",
            "So the consequence is exactly what to Anna scene."
        ],
        [
            "Sorry.",
            "And of course, the fingernails her commander really wants to know is not the probability of a node of that situation happening, but they want to know the probability of getting a success node so they actually wanted the conditional probability that the current node reaches success.",
            "So we do that, and that's actually good enough for Commander because everybody gets killed here, they don't."
        ],
        [
            "This so they haven't, so they actually have a notion of expected utility which we have to compute for them, which is expected utility of a node.",
            "Is simply just some over the utilities of those nodes and the conditional probability of reaching that node reaching that outcome from that node.",
            "I just say right away I have not yet figured out it's an open problem.",
            "How to define utility over factored structures.",
            "No ones figure that out.",
            "So to compute these we can factor the nodes whose utility we're interested in.",
            "And there's two kind.",
            "There's two ways.",
            "Utility shows up in this.",
            "In this in vision are one of them, is when you ask.",
            "Commander asks about two plans.",
            "You can tell him.",
            "He says that he is a sucky plan.",
            "Could utility is low, so that's what we do.",
            "We do a second kind of analysis is we don't."
        ],
        [
            "It's just not for it's not just for battle for planning battles actually.",
            "For execution of battles.",
            "So what might happen is that there's a very low probability event, which is very bad, which you don't bother.",
            "The commander doesn't want to be bothered about that, but when the situation arises, when you get data from the field that tells you all your microphone on that path, then you alert the commander that a low utility outcome has high probability or relative high probability with something new.",
            "So just to give you a feeling of this, we're talking about, not a few message.",
            "We're talking about thousands.",
            "It's very noisy.",
            "It's in quite a noise in the quantities.",
            "There's noise in what units and unit numbers, and there's noise in time.",
            "It sucks completely out, in other words.",
            "And we spent a lot of time on this in the last three months.",
            "How to get that right?",
            "But we actually use the machine learning algorithms to figure out where the noise was coming from, so maybe it could be in the system, but we couldn't find any answers that question either.",
            "All time series analysis showed nothing.",
            "So this is again another aspect challenge for qualitative physics is I haven't seen people talk about OK, you got a qualitative envisionment and they've got numerical data from the field.",
            "How do you?",
            "How do you figure out where you are and then?"
        ],
        [
            "Envisionment just to show you the crap.",
            "This is a OK, so let me translate this so this is time and this is latitude.",
            "So there's five parameters, 6 latitude, longitude, fuel.",
            "I ammunition left a couple other things and so this so this is an envisionment which has eventually has five branches, so this only works for Branchton vision for trees, not for Dags yet.",
            "And look, we we sort of know the centroid of every qualitative state, but we don't know really what's happening in between.",
            "So what we've done here is we've always interpolate every every parameter from latitude to long, two to ammunition and fuel.",
            "We have no option but the interpolated as a straight line, so this is what the what the envisionment predicts and the reason it has its line.",
            "It's piecewise linear is because each of these is another situation in the qualitative measurement, and this is the data we get.",
            "And you can see how bad it is, right?",
            "It's seems to be very early.",
            "This seems to be late.",
            "There must be some battle going on here.",
            "It has lots and lots of data, but less crappy data is that late.",
            "Data early data anyway, the correct path from this data turns out to be.",
            "This one goes down there and now that now the good thing is you don't have to."
        ],
        [
            "The pen tryst on latitude.",
            "So this is our tracker and what it does.",
            "It constructs a tree of all the possible envisionment's, and what it does is, as these are essentially the path that you can follow, and as it gets messages, it updates the posterior conditional probability of each of these paths in a very direct way.",
            "What it does is it keeps the likelihood for each path, and then it uses the likelihood function so.",
            "Ammunition for one, like for latitude, it might be inversely how far you are away, and for ammunition and what we do is we sum them as a linear function.",
            "Of course, the probability Ms not listening, but he be screaming at me because this is not true probabilities because, but we assume that there could be a sum and then we just compute posterior probability.",
            "This is very, very hard to probably months to get this to work right because of the bad data.",
            "So the good news is we had on June 1st they came for a week every part of what we did worked.",
            "What?",
            "Bye.",
            "The probabilities, the probabilities of the correct path were like fractions above the.",
            "The wrong path, so we're very well I know lucky.",
            "I mean they come up with new plans, new battles, new future measurements that you've never seen before, and you don't get a chance to fix it.",
            "Well, if you have like a, you missed a parameter or didn't run DLL, let you fix that, but they won't let you."
        ],
        [
            "You aren't changing anything significant.",
            "So that so the qualitative reasoning approach has been validated, which was the original PM bucks hurt his PhD thesis.",
            "I got it right right?",
            "So here are the pieces.",
            "I guess this community.",
            "I've never seen it.",
            "So anyway.",
            "So other things we did.",
            "Um?",
            "There is a large part of using qualitative reason to drive battle outcomes.",
            "I did that as a whole other talk.",
            "There's missing actions in the plans.",
            "Often it's implied 'cause the commanders.",
            "No other commanders are using this, so they don't need to put certain things in the diagram.",
            "Same thing we encounter.",
            "We do qualitative physics on scientific domains.",
            "We've changed the qualitative process theory, KENS.",
            "There's terrain, and then there's a sketch to plan and sketched."
        ],
        [
            "Side OK.",
            "So Rich, I'll tell you what we haven't done and only one minute left we'd like to do qualitative terrain reasoning.",
            "Tracking, uh, I mean intentional train modification blowing up bridges, blowing up canyons, tracking against factor.",
            "Envisionment's utility already talked about that decision points decision points is where it's actually built into the plan, where the commander where local commander to decide optimal things to do next.",
            "That might be qualitative game theory.",
            "Very important to model the mind of the enemy commander like deception and faint.",
            "Supply lines just because a unit go there, they will have to get re supplied by continuously so those paths have to be kept open and air operations so.",
            "I think this is pretty interesting for qualitative reasoning domain because they."
        ],
        [
            "Head to head comparison between.",
            "The simulator hardcore simulation qualitative reasoning and we came up with a head and we came up ahead because one part of the evaluation is they bring in a bunch of experienced commanders and they look at our analysis and they say are these reasonable?",
            "An Rs as much reasonable, very reasonable.",
            "Um?",
            "So I think it's very successful.",
            "I'm probably report on the next."
        ],
        [
            "Part next session, I mean next next year, hopefully.",
            "You you are using planning?",
            "The first question is would need to be more appropriate to use some.",
            "Something like they play.",
            "Because the the problem essentially is that of painting.",
            "I mean what use a game engine?",
            "Well.",
            "Apps to use again Game Engine 2.",
            "Well, our company, our competition about our competition is essentially a game engine on steroids.",
            "Yes, so it says the other approaches using numerical simulation and then doing tons and tons Monte Carlo is sort of known to have problems in this domain, so it misses little probability outcomes.",
            "The amount of stimulation work yet to do is just obscene to actually come anything like close to the quality of coverage.",
            "So it take out the using qualitative reasoning rocks in terms of.",
            "Ashley nailing down all the possible behaviors.",
            "OK, I think it's great.",
            "Right?",
            "I absolutely agree with that.",
            "Only planning solves problems when you have just.",
            "One agent with wants to achieve some goals, but you have two agents well.",
            "Actually here for distance doesn't change your right, but then that's not something.",
            "Hoping that some of them.",
            "Reports, so I mean how does it work?",
            "Maybe Max didn't explain something.",
            "Maybe it's worth saying at the beginning, but I tried to say is the way the military works is the commander's job to find 3 and they really.",
            "This is the I mean it at least three different plans for battle.",
            "And then they imagine three other plans that the enemy might do and our job is to analyze those nine.",
            "So OK, so until you're given with given plan, yeah, so any other interesting were given?",
            "There's one more thing that tracker has to do.",
            "The tracker has to say.",
            "You're not on any of these three plans.",
            "Red is doing something different, so that's I didn't say that.",
            "But we have to raise a flag when the data says that rather, doing something different and then it's the job of the command that we notify the Commander doing something different.",
            "They really do not want us to do the work for him.",
            "I'm not alright, baby.",
            "So there is this so that we have a little problem generating plans in response to things and.",
            "Frankly, it's not that hard.",
            "I mean, this is actually the harder part problem to go out and play out.",
            "Possibly so you can imagine that given it's a couple of minutes now to do.",
            "I'm afraid my three color comparison that adding something that generated new plans and evaluated it this way would actually be a pretty inexpensive process in military was stunned.",
            "You know we had 30 minutes to do it, or doing any computation at all, and we have one laptop and it does it in a minute while we one thing I didn't tell you that rain reasoning under harder, so there were nine lot.",
            "There was nine laptops for the terrain reasoning, one for each combination.",
            "For the West End laptop.",
            "Is in the public GIS, right?",
            "Spatial computations to do the following data spatially.",
            "And that's why I love them.",
            "But Buck was beaming like he was mean.",
            "Fox may be based in time at 29 1/2 minutes.",
            "And they always take 29th at minutes or whatever they produce to be able to tell if actually and some huge cluster in the background.",
            "Big cloud computer.",
            "You wanna ask Bert?",
            "It's about really understanding this motion affecting real OK.",
            "Remove, let's say words that you're actually simulating.",
            "Then I they will actually be simulated independently until there's some spacetime interact intersection.",
            "I missed how do you know that they will interact at some point or you find out now they don't have.",
            "OK, there's two different ways to implement this.",
            "Ken has one.",
            "I have another, but the one in this one does is I simulate the foot forward.",
            "I simulate the world forward assuming no interactions all the way to quiescence, and those could create these spacetime tubes like I think for Hayes and then I just compute the intersection when I compute the intersection.",
            "Then there is something new that can happen at the intersection.",
            "At the same thing happens in the process oriented when it's just that and so you really are counting on the spatial temporal reasoning to figure out where the intersections are, and then you do temporal reasoning to say OK, given how fast these units can move, do we have to have a branch here?",
            "Right?",
            "Forward independently and they will find intersection right?",
            "So like when you see the intersection, then one thing it describes the intersection is that the one of the consequences of the intersection, or more than the consequences of the individual strands like battle.",
            "Now they're going to start.",
            "They see each other.",
            "Now they're going to beat on each other, and one of them probably die.",
            "Program like a runaway.",
            "I want two very interesting things for talking to all these generals won the major objective of military met commanders, get the other commander, not decide not to fight today.",
            "Now it's very it's my pain, my pain with these people is going way up Ken's book, people for years, but I used to sit there bunch of kids running around doing stupid things but I was very naive.",
            "They were actually very smart people, but I'm very impressed with them.",
            "I discovered one other interesting.",
            "What do you think?",
            "Today is the most common battle management tool in the US Army planning tool.",
            "You've seen it in front of you.",
            "PowerPoint.",
            "We will be auto generating power point.",
            "I am sure someplace login."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, thank you very much for coming.",
                    "label": 0
                },
                {
                    "sent": "I would just think I notice that Ken is a coauthor on every one of the talks in the session, and therefore he should give all of them, but he's giving none of them, I think.",
                    "label": 0
                },
                {
                    "sent": "So factored envisioning is really one of the concepts.",
                    "label": 1
                },
                {
                    "sent": "This is part of a larger deep green project that can I deeply involved in applying qualitative reasoning to a military domain, so I don't know if there's any Peter Strauss clones in here, but they would now stand up.",
                    "label": 0
                },
                {
                    "sent": "And walk out.",
                    "label": 0
                },
                {
                    "sent": "I talked to Peter last week.",
                    "label": 0
                },
                {
                    "sent": "And I asked him if he would stand up and walk out and he said yes.",
                    "label": 0
                },
                {
                    "sent": "But he was perfectly willing to talk about it.",
                    "label": 0
                },
                {
                    "sent": "So that's interesting.",
                    "label": 0
                },
                {
                    "sent": "Anyways, this is an exciting project because there must be about 50 people working on different aspects of this.",
                    "label": 0
                },
                {
                    "sent": "Only small part is what we do, but we do the core reasoning and it's applying qualitative reasoning to an entirely new domain and cannot look a little bit in the past.",
                    "label": 0
                },
                {
                    "sent": "But I actually haven't seen us building models for military actions yet, so this is a new.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to do more of a sort of kind of overview of what we've done, rather than drill down on, factored envisioning precisely.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So that's what we're trying to do.",
                    "label": 0
                },
                {
                    "sent": "This is sort of a BA E slide, so we're working collaboratively with BA.",
                    "label": 0
                },
                {
                    "sent": "I'm sure most of you now with Sift University of Texas, Tracy Hammond and Mr. Computers are right now being used in the military for logistics and zillion things.",
                    "label": 0
                },
                {
                    "sent": "But can we actually use them to support the art of battle?",
                    "label": 1
                },
                {
                    "sent": "How?",
                    "label": 1
                },
                {
                    "sent": "What goes on and the language that the commanders uses with course of action diagram that you have seen can present.",
                    "label": 0
                },
                {
                    "sent": "In previous years.",
                    "label": 0
                },
                {
                    "sent": "I can't read that slide that's bad.",
                    "label": 0
                },
                {
                    "sent": "Instead of and the intuition, I mean it's actually really exciting.",
                    "label": 0
                },
                {
                    "sent": "The intuition behind this Docker program is that commanders naturally deal think about the world qualitatively.",
                    "label": 1
                },
                {
                    "sent": "What influences what causes what?",
                    "label": 0
                },
                {
                    "sent": "So in our task is not to replace the Commander is to augment a command or give him advice.",
                    "label": 0
                },
                {
                    "sent": "Hentai things are not going well.",
                    "label": 0
                },
                {
                    "sent": "In one curse thing, of course you have to watch out for when you work for DARPA, the thing actually has to work, or if they cancel your contract and work means I'll talk on the end.",
                    "label": 0
                },
                {
                    "sent": "Someone comes with your program, your program for a week, and you don't change it, and it has to work.",
                    "label": 0
                },
                {
                    "sent": "And we're starting.",
                    "label": 0
                },
                {
                    "sent": "What would they call in the military?",
                    "label": 0
                },
                {
                    "sent": "By the way, if I give an acronym you don't actually use the militaries, more acronyms that could possibly imagine.",
                    "label": 0
                },
                {
                    "sent": "So they say one that I shouldn't just ask an explanation.",
                    "label": 0
                },
                {
                    "sent": "So I think we're dealing with what they call Hicks, which is we're dealing with battles or people actually banging against each other.",
                    "label": 0
                },
                {
                    "sent": "High intensity conflicts like World War Two or what the battle would be in North and South Korea.",
                    "label": 0
                },
                {
                    "sent": "Not not Iraq.",
                    "label": 0
                },
                {
                    "sent": "And can you can pop up and say.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Say anything wrong?",
                    "label": 0
                },
                {
                    "sent": "So this is a.",
                    "label": 0
                },
                {
                    "sent": "This is how a commander sketches out his plan for battle.",
                    "label": 0
                },
                {
                    "sent": "This is actually using Ken's newer bottle battle space.",
                    "label": 0
                },
                {
                    "sent": "I'll just walk through it.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to really drill down, but there's the blue, the good guys, the red, the bad guys.",
                    "label": 0
                },
                {
                    "sent": "This this is the Hill, these are Hills these green Hills.",
                    "label": 0
                },
                {
                    "sent": "This is a town.",
                    "label": 0
                },
                {
                    "sent": "This is a River.",
                    "label": 0
                },
                {
                    "sent": "I'm just sketching this out so there's all these symbols.",
                    "label": 0
                },
                {
                    "sent": "By the way, is one part of the contract that we had implemented a simple recognizer, which is the whole project by itself from sketches.",
                    "label": 0
                },
                {
                    "sent": "So there's three task forces here.",
                    "label": 0
                },
                {
                    "sent": "Actually this is smaller, but much smaller, so the idea here is this.",
                    "label": 0
                },
                {
                    "sent": "Blue Task Force goes along Axis lion to try to capture that Hill that defeat the red sitting on this Hill, and then when he succeeds at that, this task force here will move back, move through this and attack the city.",
                    "label": 0
                },
                {
                    "sent": "This task force here is going to move up here to try to fix red here.",
                    "label": 0
                },
                {
                    "sent": "So when Red is defeated on this Hill, Red will not move back and resupply back here.",
                    "label": 0
                },
                {
                    "sent": "So red strategy if it doesn't know which way blue is coming.",
                    "label": 0
                },
                {
                    "sent": "So if blue comes from this direction or direction, it's going to turn blue into this area, and then it's going to pound on it and destroy it.",
                    "label": 0
                },
                {
                    "sent": "And this red unit here is actually trying to prevent this blue unit here.",
                    "label": 0
                },
                {
                    "sent": "Going top of the Hill.",
                    "label": 0
                },
                {
                    "sent": "Anyways, there's much more.",
                    "label": 0
                },
                {
                    "sent": "Here is if Blue succeeds, then red is going to move.",
                    "label": 0
                },
                {
                    "sent": "Here to resupply, and if there's anything left here, it will try in the goals of a blue is to prevent red for moving there, and that's what this symbol means.",
                    "label": 0
                },
                {
                    "sent": "OK, so I talked too much, but that's and you heard qualitative terms and their qualitative spatial reasoning causality so this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As much as you want, I want to give you a flavor of it.",
                    "label": 0
                },
                {
                    "sent": "So this is the only thing that's what this project is a head to head competition.",
                    "label": 0
                },
                {
                    "sent": "There are two programs each, but they give 11 million to each one.",
                    "label": 0
                },
                {
                    "sent": "We're doing it the qualitative way.",
                    "label": 0
                },
                {
                    "sent": "The other competitive waste domestically, and what they're using is a huge numerical simulator on a cluster.",
                    "label": 0
                },
                {
                    "sent": "Problem with that is my point of view.",
                    "label": 0
                },
                {
                    "sent": "It's very, very hard to identify low probability high impact events and it's not real time so.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're going to win this.",
                    "label": 0
                },
                {
                    "sent": "So the new domain for qualitative physics.",
                    "label": 1
                },
                {
                    "sent": "It has envisionment, so envisionment gets exploded, is exploded like we usually see, but we have a new way of called factored envisionment which I haven't seen before.",
                    "label": 0
                },
                {
                    "sent": "The closest is Dan Clancy's work.",
                    "label": 1
                },
                {
                    "sent": "We now have probabilities on transitions and propagation of probabilities.",
                    "label": 0
                },
                {
                    "sent": "I could write a whole paper, probably will on how to use quantitative reasoning to guide probability analysis.",
                    "label": 0
                },
                {
                    "sent": "And we all know how to use qualitative reasoning to guide numerical analysis or symbolic analysis.",
                    "label": 0
                },
                {
                    "sent": "But we can also do it for probability analysis, But that's another talk.",
                    "label": 0
                },
                {
                    "sent": "So this is I.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not going to go over it again, but this is the chart I showed.",
                    "label": 0
                },
                {
                    "sent": "This is sort of a Gantt chart of it.",
                    "label": 0
                },
                {
                    "sent": "This is sort of a UML chart of it, but part of the task, not our component of it, is to parse this drawing and construct things like this with some hints.",
                    "label": 0
                },
                {
                    "sent": "But this is the primary iomart medium for soldiers.",
                    "label": 0
                },
                {
                    "sent": "This is the four components of deep green you draw sketch on some board like this and it gets interpreted.",
                    "label": 0
                },
                {
                    "sent": "We do this part.",
                    "label": 0
                },
                {
                    "sent": "This is the actual reasoning, and then when something goes wrong, pop up the commander and say OK, you're going to get completely destroyed if you keep on going that way.",
                    "label": 0
                },
                {
                    "sent": "You wanted something different, that's that, and then this is a loop so I'm only going to talk about this part 'cause.",
                    "label": 0
                },
                {
                    "sent": "And by the way, this is like these are big projects of actually recognizing and doing IO and deciding when to interact and as.",
                    "label": 0
                },
                {
                    "sent": "And is also oral.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Not just linguist and not just a interface.",
                    "label": 0
                },
                {
                    "sent": "So first, so how was the person so this?",
                    "label": 0
                },
                {
                    "sent": "This is a version of the what we built, but now we use something better so can don't pop up and say this is all wrong.",
                    "label": 0
                },
                {
                    "sent": "I wrote the first one and I decided to use planning domain description language from the planning community.",
                    "label": 1
                },
                {
                    "sent": "I liked it because it is very simple.",
                    "label": 0
                },
                {
                    "sent": "It's very simple language.",
                    "label": 0
                },
                {
                    "sent": "It is interesting observation.",
                    "label": 0
                },
                {
                    "sent": "I don't know if people have said this before planning and visioning are almost the same thing.",
                    "label": 0
                },
                {
                    "sent": "Planning envisioning are the same except planning has an objective function.",
                    "label": 0
                },
                {
                    "sent": "The other thing is the military has a fixed set of actions that we never we didn't have to face the problem of where the models we have this problem models come from, But there already described fairly concretely about who's acting and what's an intent and what's.",
                    "label": 0
                },
                {
                    "sent": "What's an actual consequence.",
                    "label": 1
                },
                {
                    "sent": "So there only a few dozen, so we entered them ourselves so we don't have to worry about the modeling part.",
                    "label": 1
                },
                {
                    "sent": "Part of the reason I did originally, it's trivial to convert to a planner once you have something in PDL bang, you gotta planner.",
                    "label": 0
                },
                {
                    "sent": "I know we weren't supposed to do planning.",
                    "label": 0
                },
                {
                    "sent": "But let me tell you, they construct plans which have gaps in them.",
                    "label": 0
                },
                {
                    "sent": "So part of my idea was to have a planner to do.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gaps, although we never use that feature, so the model of time we use is very familiar both to people during action planning an qualitative reasoning.",
                    "label": 0
                },
                {
                    "sent": "There's actions which take place overtime.",
                    "label": 0
                },
                {
                    "sent": "They have.",
                    "label": 0
                },
                {
                    "sent": "The same idea is instant interval, instant.",
                    "label": 0
                },
                {
                    "sent": "Some actions occur for a multiple situations, and you basically just break the situation time into situations where there is no action starting or ending it inside of it.",
                    "label": 0
                },
                {
                    "sent": "This is classic.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Qualitative physics.",
                    "label": 0
                },
                {
                    "sent": "Here's an example of a.",
                    "label": 0
                },
                {
                    "sent": "A bit of an action.",
                    "label": 0
                },
                {
                    "sent": "I better speed up here so this is move people don't know PDL, it's I'll read it for you.",
                    "label": 0
                },
                {
                    "sent": "There is a unit.",
                    "label": 0
                },
                {
                    "sent": "And has a front which is of type unit from which type location a path which is a path into his location and then this condition is at the beginning of the action.",
                    "label": 0
                },
                {
                    "sent": "To enable it the unit has to be at his from location.",
                    "label": 0
                },
                {
                    "sent": "The path you have to be able to you know it can't be too narrow, it can't be over.",
                    "label": 0
                },
                {
                    "sent": "Can't be over a River.",
                    "label": 0
                },
                {
                    "sent": "And if you can't even at the start that has the path is to exist and during the entire action you can't be under fire units don't move very well under fire.",
                    "label": 0
                },
                {
                    "sent": "They usually almost stop.",
                    "label": 0
                },
                {
                    "sent": "And the effect of this action, if it completes, is that the unit will be on that pass through the entire action.",
                    "label": 0
                },
                {
                    "sent": "The distance between the unit and where it's headed to is one time for decreasing, and if it ends correctly without being interrupted, then the unit will.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "At the very end location, and here's one more.",
                    "label": 0
                },
                {
                    "sent": "Even faster.",
                    "label": 0
                },
                {
                    "sent": "But this is attacked by fire.",
                    "label": 0
                },
                {
                    "sent": "Parameters are same color scheme that arguments are units and from.",
                    "label": 0
                },
                {
                    "sent": "And then there's conditions under which type by fire continues.",
                    "label": 0
                },
                {
                    "sent": "And then, for example, the effect is that the strength of the enemy is monotonically decreasing, and if you complete the action, the posture posture is a military term is defeated is same as string.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Being effectively zero OK?",
                    "label": 0
                },
                {
                    "sent": "Classic, envisioning This is classic.",
                    "label": 0
                },
                {
                    "sent": "Envisioning it works directly on these PDL rules.",
                    "label": 0
                },
                {
                    "sent": "We find all the influence for each quantity you identify all the quantities, control it points you for each consistent combination you compute the successors of its new.",
                    "label": 1
                },
                {
                    "sent": "You go, if it's if it's not new, just called the next thing on the queue.",
                    "label": 0
                },
                {
                    "sent": "If it is new.",
                    "label": 0
                },
                {
                    "sent": "You look at all the actions which are terminating and you terminate them.",
                    "label": 0
                },
                {
                    "sent": "You look under all the actions which are now enabled and you add them and you go on everybody in this room should be able to do this.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we have.",
                    "label": 0
                },
                {
                    "sent": "Let's say we really simple battle scenario.",
                    "label": 0
                },
                {
                    "sent": "I'm only going to the top half of this graph, so this is a picture.",
                    "label": 0
                },
                {
                    "sent": "So this demarcation line so I'm only do what's above the line so they have red and I guess is blue.",
                    "label": 0
                },
                {
                    "sent": "One would get get to K and they both want to seize it.",
                    "label": 0
                },
                {
                    "sent": "So here's here's a classic Envisionment initial location.",
                    "label": 0
                },
                {
                    "sent": "They both start moving.",
                    "label": 0
                },
                {
                    "sent": "But we don't know which gets there first, so this is B1R1 gets there first.",
                    "label": 0
                },
                {
                    "sent": "This is B1 gets there first, here they get together and then they have their battle and then one wins.",
                    "label": 0
                },
                {
                    "sent": "See one, sees completes correctly and the other one is interrupted.",
                    "label": 0
                },
                {
                    "sent": "So this is our one wins.",
                    "label": 0
                },
                {
                    "sent": "This is B1 wins.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Again, absolutely standard.",
                    "label": 0
                },
                {
                    "sent": "Here is the first problem we had.",
                    "label": 0
                },
                {
                    "sent": "The biggest problem we had with envisioning it, let's post you have 3 three movements.",
                    "label": 0
                },
                {
                    "sent": "I make very simple, so we have three parts of the battle which are disconnected in classical.",
                    "label": 0
                },
                {
                    "sent": "Envisioning what you would do is well then first step is really easy.",
                    "label": 0
                },
                {
                    "sent": "They all is an instant interval, so their olicity start start the same instant so you immediately have them all on their axes.",
                    "label": 0
                },
                {
                    "sent": "But qualitatively you can't tell which ones go there first, so every possible order happens.",
                    "label": 0
                },
                {
                    "sent": "So this is RF2 gets to.",
                    "label": 0
                },
                {
                    "sent": "Gets to the result, gets Hill first and that and then it transfers to RS3 and then the other possibilities are all there.",
                    "label": 0
                },
                {
                    "sent": "So you have all these States and these states are a potentially explosive and I'll refer.",
                    "label": 0
                },
                {
                    "sent": "Will that work to Dan Clancy?",
                    "label": 0
                },
                {
                    "sent": "Dan Clancy did work in the custom simulator because Chatter oscillation hunting when you're trying to find.",
                    "label": 0
                },
                {
                    "sent": "Going close to 0 and you can never get there, but the custom simulator does this statically.",
                    "label": 0
                },
                {
                    "sent": "It does a causal analysis of the interactions, so we factored envisioning which I show in a second with.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This dynamically and the basic idea is very simple.",
                    "label": 0
                },
                {
                    "sent": "Is is when you see an envisionment here a note as global state which the units are not interacting with you first do is split them into their.",
                    "label": 0
                },
                {
                    "sent": "You create smaller kernel situations which everything in there is interacting with.",
                    "label": 0
                },
                {
                    "sent": "Everything else, perhaps transitively, and in this case they're not interacting at all, so these are only one.",
                    "label": 0
                },
                {
                    "sent": "So you're simulating basically envisioning just one thread.",
                    "label": 0
                },
                {
                    "sent": "So this is the envisionment.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But now replaces this.",
                    "label": 0
                },
                {
                    "sent": "Now it looks like that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The States and then go down much, but their simplicity went down dramatically in any ambiguity in one batch.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will not go to the other.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what we do is harking back to pad his night Manifesto is in this battle.",
                    "label": 0
                },
                {
                    "sent": "We immediately separate.",
                    "label": 0
                },
                {
                    "sent": "We start moving.",
                    "label": 0
                },
                {
                    "sent": "I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to be hand.",
                    "label": 0
                },
                {
                    "sent": "What happens is you keep on intersecting spacetime tubes.",
                    "label": 0
                },
                {
                    "sent": "You go to see whether these units by themselves are interacting, and when they're interacting, then they have the battle is a triangular join.",
                    "label": 0
                },
                {
                    "sent": "Then the battle happens.",
                    "label": 0
                },
                {
                    "sent": "And then again I factor it out to its individual pieces.",
                    "label": 0
                },
                {
                    "sent": "This is a much easier way to analyze the battle.",
                    "label": 0
                },
                {
                    "sent": "When you look at a particular ambiguity in the global state, you don't have to look at the multiple things that are going on there because it's done automatically.",
                    "label": 0
                },
                {
                    "sent": "As factored, envisioning, factored, envisioning is even simpler, so it uses regular envisioning as a as a start, so when it starts with some Q or the factor envisioning Q, it takes the first such situation.",
                    "label": 0
                },
                {
                    "sent": "What it does is it breaks into his kernels often if they're already kernel situations that can't be factored, this will often be just one, and then it's fine.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Install the new consistent situation, intersections and new successors and it adds all those successors to the futures graph.",
                    "label": 1
                },
                {
                    "sent": "I mean part of me to the factored Q and then so this is literally how I implemented this.",
                    "label": 0
                },
                {
                    "sent": "So this is sort of.",
                    "label": 0
                },
                {
                    "sent": "This is six months old data what?",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What I did is I took a bunch of examples fairly, fairly simple examples.",
                    "label": 0
                },
                {
                    "sent": "This is how many units eight against zero to three against five, and this is how complicated the color was.",
                    "label": 0
                },
                {
                    "sent": "This is number of situations I get if I.",
                    "label": 0
                },
                {
                    "sent": "Don't even merch, so there's some discussion about whether you can get the same state.",
                    "label": 0
                },
                {
                    "sent": "Two different qualities that are qualitatively equivalent, but their quantitatively different.",
                    "label": 0
                },
                {
                    "sent": "So we've decided we now merged states which are qualitatively identical.",
                    "label": 0
                },
                {
                    "sent": "So what you get here is this is the.",
                    "label": 0
                },
                {
                    "sent": "This is the analysis for unmerged non factor.",
                    "label": 0
                },
                {
                    "sent": "This is the analysis for merged unfactored and this is the merge factor, which is what we would naturally do in qualitative physics.",
                    "label": 0
                },
                {
                    "sent": "And the good news here is in this column, for example, it takes almost just a fraction of a second are the most complicated analysis and doing the full envisionment cost is 425 seconds.",
                    "label": 0
                },
                {
                    "sent": "We now do problems which are orders of magnitude more complicated.",
                    "label": 0
                },
                {
                    "sent": "In fact be calculated out.",
                    "label": 0
                },
                {
                    "sent": "This was 10 to the 15th if they had to expand it.",
                    "label": 0
                },
                {
                    "sent": "So using qualitative values using them to merge situations being factored makes.",
                    "label": 0
                },
                {
                    "sent": "Get gives you what you want.",
                    "label": 0
                },
                {
                    "sent": "Now the Member one of the beautiful things of qualitative reasoning.",
                    "label": 0
                },
                {
                    "sent": "We're really trying to achieve with this project is the military wants every possible qualitative outcome.",
                    "label": 0
                },
                {
                    "sent": "So once we completeness and once every outcome to be can happen for some value of ammunition and terrain, so its soundness of completeness and thus.",
                    "label": 0
                },
                {
                    "sent": "But this still remains sound incomplete, and I don't think there's simulator which there simulator has to simulate over and over and over again.",
                    "label": 0
                },
                {
                    "sent": "Has any chance of ever getting all the possible qualitatively distinguished features?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Cool, so you can't get me off of an ATM S. So this is just a slide from Ken's in my book.",
                    "label": 0
                },
                {
                    "sent": "I'll be very brief about it.",
                    "label": 0
                },
                {
                    "sent": "So what we now have to do, probability inferences on these and there's two important parts of getting probabilities and I'll talk about one of 'em is when you put an ATM S underneath all the situations and this is just to refresh people's memory justifications.",
                    "label": 0
                },
                {
                    "sent": "This means you anticipate the consequences are knows these are contradictions.",
                    "label": 0
                },
                {
                    "sent": "So when you see something like this, these are three justifications supporting this node, so there conjunctions.",
                    "label": 0
                },
                {
                    "sent": "But this whole thing is it just disjunction of three?",
                    "label": 0
                },
                {
                    "sent": "And these are the consequences.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how does the PMS work?",
                    "label": 0
                },
                {
                    "sent": "So So what the military often wants to do is they have they want to put many plans against many other plans in the so each color pair gets ATM S assumption.",
                    "label": 0
                },
                {
                    "sent": "I'm actually now put assumption under every color, but that's never there.",
                    "label": 0
                },
                {
                    "sent": "Every situation get snowed, all uncertain.",
                    "label": 0
                },
                {
                    "sent": "Transitions could have a probabilistic version of it all.",
                    "label": 0
                },
                {
                    "sent": "Uncertain transition represented by an assumption, and each transition is.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Represented justification or multiple justification.",
                    "label": 0
                },
                {
                    "sent": "So really simple.",
                    "label": 0
                },
                {
                    "sent": "So here's another envisionment.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately it slightly format because it's from my list program, but you can just see it, sort of.",
                    "label": 0
                },
                {
                    "sent": "You can see that the arrows.",
                    "label": 0
                },
                {
                    "sent": "So if there are any ways of getting here, it just constructs us just.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kacian structure.",
                    "label": 0
                },
                {
                    "sent": "Now, if there's uncertainty, for example, there's a battle here.",
                    "label": 0
                },
                {
                    "sent": "There's two outcomes.",
                    "label": 0
                },
                {
                    "sent": "This is forget the join.",
                    "label": 0
                },
                {
                    "sent": "What I do is I create two assumptions.",
                    "label": 0
                },
                {
                    "sent": "In this case, let's say 5050, but the there typically are not.",
                    "label": 0
                },
                {
                    "sent": "And then I say these two are contradiction.",
                    "label": 0
                },
                {
                    "sent": "So this is the.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Structure that you now need to compute.",
                    "label": 0
                },
                {
                    "sent": "Now the interest ATM S structure for joins is judges justification.",
                    "label": 0
                },
                {
                    "sent": "And here's an interesting example where you see the Anna scenes are both .041041.",
                    "label": 0
                },
                {
                    "sent": "So the problem with this is you have these battles which merged and you wanted probability of a node, and you want to know the degree of independence between these two nodes.",
                    "label": 0
                },
                {
                    "sent": "Again, the underlying ATM S which would hold the talk figures out the degree of independence for itself, and in this case is very interesting.",
                    "label": 0
                },
                {
                    "sent": "It notices that they are totally dependent.",
                    "label": 0
                },
                {
                    "sent": "So the consequence is exactly what to Anna scene.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "And of course, the fingernails her commander really wants to know is not the probability of a node of that situation happening, but they want to know the probability of getting a success node so they actually wanted the conditional probability that the current node reaches success.",
                    "label": 0
                },
                {
                    "sent": "So we do that, and that's actually good enough for Commander because everybody gets killed here, they don't.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This so they haven't, so they actually have a notion of expected utility which we have to compute for them, which is expected utility of a node.",
                    "label": 0
                },
                {
                    "sent": "Is simply just some over the utilities of those nodes and the conditional probability of reaching that node reaching that outcome from that node.",
                    "label": 0
                },
                {
                    "sent": "I just say right away I have not yet figured out it's an open problem.",
                    "label": 0
                },
                {
                    "sent": "How to define utility over factored structures.",
                    "label": 0
                },
                {
                    "sent": "No ones figure that out.",
                    "label": 0
                },
                {
                    "sent": "So to compute these we can factor the nodes whose utility we're interested in.",
                    "label": 0
                },
                {
                    "sent": "And there's two kind.",
                    "label": 0
                },
                {
                    "sent": "There's two ways.",
                    "label": 0
                },
                {
                    "sent": "Utility shows up in this.",
                    "label": 0
                },
                {
                    "sent": "In this in vision are one of them, is when you ask.",
                    "label": 0
                },
                {
                    "sent": "Commander asks about two plans.",
                    "label": 0
                },
                {
                    "sent": "You can tell him.",
                    "label": 0
                },
                {
                    "sent": "He says that he is a sucky plan.",
                    "label": 0
                },
                {
                    "sent": "Could utility is low, so that's what we do.",
                    "label": 0
                },
                {
                    "sent": "We do a second kind of analysis is we don't.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's just not for it's not just for battle for planning battles actually.",
                    "label": 0
                },
                {
                    "sent": "For execution of battles.",
                    "label": 0
                },
                {
                    "sent": "So what might happen is that there's a very low probability event, which is very bad, which you don't bother.",
                    "label": 0
                },
                {
                    "sent": "The commander doesn't want to be bothered about that, but when the situation arises, when you get data from the field that tells you all your microphone on that path, then you alert the commander that a low utility outcome has high probability or relative high probability with something new.",
                    "label": 0
                },
                {
                    "sent": "So just to give you a feeling of this, we're talking about, not a few message.",
                    "label": 0
                },
                {
                    "sent": "We're talking about thousands.",
                    "label": 0
                },
                {
                    "sent": "It's very noisy.",
                    "label": 0
                },
                {
                    "sent": "It's in quite a noise in the quantities.",
                    "label": 1
                },
                {
                    "sent": "There's noise in what units and unit numbers, and there's noise in time.",
                    "label": 1
                },
                {
                    "sent": "It sucks completely out, in other words.",
                    "label": 0
                },
                {
                    "sent": "And we spent a lot of time on this in the last three months.",
                    "label": 0
                },
                {
                    "sent": "How to get that right?",
                    "label": 0
                },
                {
                    "sent": "But we actually use the machine learning algorithms to figure out where the noise was coming from, so maybe it could be in the system, but we couldn't find any answers that question either.",
                    "label": 0
                },
                {
                    "sent": "All time series analysis showed nothing.",
                    "label": 0
                },
                {
                    "sent": "So this is again another aspect challenge for qualitative physics is I haven't seen people talk about OK, you got a qualitative envisionment and they've got numerical data from the field.",
                    "label": 0
                },
                {
                    "sent": "How do you?",
                    "label": 0
                },
                {
                    "sent": "How do you figure out where you are and then?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Envisionment just to show you the crap.",
                    "label": 0
                },
                {
                    "sent": "This is a OK, so let me translate this so this is time and this is latitude.",
                    "label": 0
                },
                {
                    "sent": "So there's five parameters, 6 latitude, longitude, fuel.",
                    "label": 0
                },
                {
                    "sent": "I ammunition left a couple other things and so this so this is an envisionment which has eventually has five branches, so this only works for Branchton vision for trees, not for Dags yet.",
                    "label": 0
                },
                {
                    "sent": "And look, we we sort of know the centroid of every qualitative state, but we don't know really what's happening in between.",
                    "label": 0
                },
                {
                    "sent": "So what we've done here is we've always interpolate every every parameter from latitude to long, two to ammunition and fuel.",
                    "label": 0
                },
                {
                    "sent": "We have no option but the interpolated as a straight line, so this is what the what the envisionment predicts and the reason it has its line.",
                    "label": 0
                },
                {
                    "sent": "It's piecewise linear is because each of these is another situation in the qualitative measurement, and this is the data we get.",
                    "label": 0
                },
                {
                    "sent": "And you can see how bad it is, right?",
                    "label": 0
                },
                {
                    "sent": "It's seems to be very early.",
                    "label": 0
                },
                {
                    "sent": "This seems to be late.",
                    "label": 0
                },
                {
                    "sent": "There must be some battle going on here.",
                    "label": 0
                },
                {
                    "sent": "It has lots and lots of data, but less crappy data is that late.",
                    "label": 0
                },
                {
                    "sent": "Data early data anyway, the correct path from this data turns out to be.",
                    "label": 0
                },
                {
                    "sent": "This one goes down there and now that now the good thing is you don't have to.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The pen tryst on latitude.",
                    "label": 0
                },
                {
                    "sent": "So this is our tracker and what it does.",
                    "label": 0
                },
                {
                    "sent": "It constructs a tree of all the possible envisionment's, and what it does is, as these are essentially the path that you can follow, and as it gets messages, it updates the posterior conditional probability of each of these paths in a very direct way.",
                    "label": 0
                },
                {
                    "sent": "What it does is it keeps the likelihood for each path, and then it uses the likelihood function so.",
                    "label": 0
                },
                {
                    "sent": "Ammunition for one, like for latitude, it might be inversely how far you are away, and for ammunition and what we do is we sum them as a linear function.",
                    "label": 0
                },
                {
                    "sent": "Of course, the probability Ms not listening, but he be screaming at me because this is not true probabilities because, but we assume that there could be a sum and then we just compute posterior probability.",
                    "label": 0
                },
                {
                    "sent": "This is very, very hard to probably months to get this to work right because of the bad data.",
                    "label": 0
                },
                {
                    "sent": "So the good news is we had on June 1st they came for a week every part of what we did worked.",
                    "label": 0
                },
                {
                    "sent": "What?",
                    "label": 0
                },
                {
                    "sent": "Bye.",
                    "label": 0
                },
                {
                    "sent": "The probabilities, the probabilities of the correct path were like fractions above the.",
                    "label": 0
                },
                {
                    "sent": "The wrong path, so we're very well I know lucky.",
                    "label": 0
                },
                {
                    "sent": "I mean they come up with new plans, new battles, new future measurements that you've never seen before, and you don't get a chance to fix it.",
                    "label": 0
                },
                {
                    "sent": "Well, if you have like a, you missed a parameter or didn't run DLL, let you fix that, but they won't let you.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You aren't changing anything significant.",
                    "label": 0
                },
                {
                    "sent": "So that so the qualitative reasoning approach has been validated, which was the original PM bucks hurt his PhD thesis.",
                    "label": 0
                },
                {
                    "sent": "I got it right right?",
                    "label": 0
                },
                {
                    "sent": "So here are the pieces.",
                    "label": 0
                },
                {
                    "sent": "I guess this community.",
                    "label": 0
                },
                {
                    "sent": "I've never seen it.",
                    "label": 0
                },
                {
                    "sent": "So anyway.",
                    "label": 0
                },
                {
                    "sent": "So other things we did.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "There is a large part of using qualitative reason to drive battle outcomes.",
                    "label": 1
                },
                {
                    "sent": "I did that as a whole other talk.",
                    "label": 0
                },
                {
                    "sent": "There's missing actions in the plans.",
                    "label": 0
                },
                {
                    "sent": "Often it's implied 'cause the commanders.",
                    "label": 0
                },
                {
                    "sent": "No other commanders are using this, so they don't need to put certain things in the diagram.",
                    "label": 0
                },
                {
                    "sent": "Same thing we encounter.",
                    "label": 0
                },
                {
                    "sent": "We do qualitative physics on scientific domains.",
                    "label": 1
                },
                {
                    "sent": "We've changed the qualitative process theory, KENS.",
                    "label": 0
                },
                {
                    "sent": "There's terrain, and then there's a sketch to plan and sketched.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Side OK.",
                    "label": 0
                },
                {
                    "sent": "So Rich, I'll tell you what we haven't done and only one minute left we'd like to do qualitative terrain reasoning.",
                    "label": 0
                },
                {
                    "sent": "Tracking, uh, I mean intentional train modification blowing up bridges, blowing up canyons, tracking against factor.",
                    "label": 0
                },
                {
                    "sent": "Envisionment's utility already talked about that decision points decision points is where it's actually built into the plan, where the commander where local commander to decide optimal things to do next.",
                    "label": 0
                },
                {
                    "sent": "That might be qualitative game theory.",
                    "label": 1
                },
                {
                    "sent": "Very important to model the mind of the enemy commander like deception and faint.",
                    "label": 1
                },
                {
                    "sent": "Supply lines just because a unit go there, they will have to get re supplied by continuously so those paths have to be kept open and air operations so.",
                    "label": 0
                },
                {
                    "sent": "I think this is pretty interesting for qualitative reasoning domain because they.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Head to head comparison between.",
                    "label": 0
                },
                {
                    "sent": "The simulator hardcore simulation qualitative reasoning and we came up with a head and we came up ahead because one part of the evaluation is they bring in a bunch of experienced commanders and they look at our analysis and they say are these reasonable?",
                    "label": 1
                },
                {
                    "sent": "An Rs as much reasonable, very reasonable.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So I think it's very successful.",
                    "label": 0
                },
                {
                    "sent": "I'm probably report on the next.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Part next session, I mean next next year, hopefully.",
                    "label": 0
                },
                {
                    "sent": "You you are using planning?",
                    "label": 0
                },
                {
                    "sent": "The first question is would need to be more appropriate to use some.",
                    "label": 0
                },
                {
                    "sent": "Something like they play.",
                    "label": 0
                },
                {
                    "sent": "Because the the problem essentially is that of painting.",
                    "label": 0
                },
                {
                    "sent": "I mean what use a game engine?",
                    "label": 0
                },
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Apps to use again Game Engine 2.",
                    "label": 0
                },
                {
                    "sent": "Well, our company, our competition about our competition is essentially a game engine on steroids.",
                    "label": 0
                },
                {
                    "sent": "Yes, so it says the other approaches using numerical simulation and then doing tons and tons Monte Carlo is sort of known to have problems in this domain, so it misses little probability outcomes.",
                    "label": 0
                },
                {
                    "sent": "The amount of stimulation work yet to do is just obscene to actually come anything like close to the quality of coverage.",
                    "label": 0
                },
                {
                    "sent": "So it take out the using qualitative reasoning rocks in terms of.",
                    "label": 1
                },
                {
                    "sent": "Ashley nailing down all the possible behaviors.",
                    "label": 0
                },
                {
                    "sent": "OK, I think it's great.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "I absolutely agree with that.",
                    "label": 0
                },
                {
                    "sent": "Only planning solves problems when you have just.",
                    "label": 0
                },
                {
                    "sent": "One agent with wants to achieve some goals, but you have two agents well.",
                    "label": 0
                },
                {
                    "sent": "Actually here for distance doesn't change your right, but then that's not something.",
                    "label": 0
                },
                {
                    "sent": "Hoping that some of them.",
                    "label": 0
                },
                {
                    "sent": "Reports, so I mean how does it work?",
                    "label": 0
                },
                {
                    "sent": "Maybe Max didn't explain something.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's worth saying at the beginning, but I tried to say is the way the military works is the commander's job to find 3 and they really.",
                    "label": 0
                },
                {
                    "sent": "This is the I mean it at least three different plans for battle.",
                    "label": 0
                },
                {
                    "sent": "And then they imagine three other plans that the enemy might do and our job is to analyze those nine.",
                    "label": 0
                },
                {
                    "sent": "So OK, so until you're given with given plan, yeah, so any other interesting were given?",
                    "label": 0
                },
                {
                    "sent": "There's one more thing that tracker has to do.",
                    "label": 1
                },
                {
                    "sent": "The tracker has to say.",
                    "label": 0
                },
                {
                    "sent": "You're not on any of these three plans.",
                    "label": 0
                },
                {
                    "sent": "Red is doing something different, so that's I didn't say that.",
                    "label": 0
                },
                {
                    "sent": "But we have to raise a flag when the data says that rather, doing something different and then it's the job of the command that we notify the Commander doing something different.",
                    "label": 0
                },
                {
                    "sent": "They really do not want us to do the work for him.",
                    "label": 0
                },
                {
                    "sent": "I'm not alright, baby.",
                    "label": 0
                },
                {
                    "sent": "So there is this so that we have a little problem generating plans in response to things and.",
                    "label": 0
                },
                {
                    "sent": "Frankly, it's not that hard.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is actually the harder part problem to go out and play out.",
                    "label": 0
                },
                {
                    "sent": "Possibly so you can imagine that given it's a couple of minutes now to do.",
                    "label": 0
                },
                {
                    "sent": "I'm afraid my three color comparison that adding something that generated new plans and evaluated it this way would actually be a pretty inexpensive process in military was stunned.",
                    "label": 0
                },
                {
                    "sent": "You know we had 30 minutes to do it, or doing any computation at all, and we have one laptop and it does it in a minute while we one thing I didn't tell you that rain reasoning under harder, so there were nine lot.",
                    "label": 0
                },
                {
                    "sent": "There was nine laptops for the terrain reasoning, one for each combination.",
                    "label": 0
                },
                {
                    "sent": "For the West End laptop.",
                    "label": 0
                },
                {
                    "sent": "Is in the public GIS, right?",
                    "label": 0
                },
                {
                    "sent": "Spatial computations to do the following data spatially.",
                    "label": 0
                },
                {
                    "sent": "And that's why I love them.",
                    "label": 0
                },
                {
                    "sent": "But Buck was beaming like he was mean.",
                    "label": 0
                },
                {
                    "sent": "Fox may be based in time at 29 1/2 minutes.",
                    "label": 0
                },
                {
                    "sent": "And they always take 29th at minutes or whatever they produce to be able to tell if actually and some huge cluster in the background.",
                    "label": 0
                },
                {
                    "sent": "Big cloud computer.",
                    "label": 0
                },
                {
                    "sent": "You wanna ask Bert?",
                    "label": 0
                },
                {
                    "sent": "It's about really understanding this motion affecting real OK.",
                    "label": 0
                },
                {
                    "sent": "Remove, let's say words that you're actually simulating.",
                    "label": 0
                },
                {
                    "sent": "Then I they will actually be simulated independently until there's some spacetime interact intersection.",
                    "label": 0
                },
                {
                    "sent": "I missed how do you know that they will interact at some point or you find out now they don't have.",
                    "label": 0
                },
                {
                    "sent": "OK, there's two different ways to implement this.",
                    "label": 0
                },
                {
                    "sent": "Ken has one.",
                    "label": 0
                },
                {
                    "sent": "I have another, but the one in this one does is I simulate the foot forward.",
                    "label": 0
                },
                {
                    "sent": "I simulate the world forward assuming no interactions all the way to quiescence, and those could create these spacetime tubes like I think for Hayes and then I just compute the intersection when I compute the intersection.",
                    "label": 0
                },
                {
                    "sent": "Then there is something new that can happen at the intersection.",
                    "label": 0
                },
                {
                    "sent": "At the same thing happens in the process oriented when it's just that and so you really are counting on the spatial temporal reasoning to figure out where the intersections are, and then you do temporal reasoning to say OK, given how fast these units can move, do we have to have a branch here?",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "Forward independently and they will find intersection right?",
                    "label": 0
                },
                {
                    "sent": "So like when you see the intersection, then one thing it describes the intersection is that the one of the consequences of the intersection, or more than the consequences of the individual strands like battle.",
                    "label": 0
                },
                {
                    "sent": "Now they're going to start.",
                    "label": 0
                },
                {
                    "sent": "They see each other.",
                    "label": 0
                },
                {
                    "sent": "Now they're going to beat on each other, and one of them probably die.",
                    "label": 0
                },
                {
                    "sent": "Program like a runaway.",
                    "label": 0
                },
                {
                    "sent": "I want two very interesting things for talking to all these generals won the major objective of military met commanders, get the other commander, not decide not to fight today.",
                    "label": 0
                },
                {
                    "sent": "Now it's very it's my pain, my pain with these people is going way up Ken's book, people for years, but I used to sit there bunch of kids running around doing stupid things but I was very naive.",
                    "label": 0
                },
                {
                    "sent": "They were actually very smart people, but I'm very impressed with them.",
                    "label": 0
                },
                {
                    "sent": "I discovered one other interesting.",
                    "label": 0
                },
                {
                    "sent": "What do you think?",
                    "label": 0
                },
                {
                    "sent": "Today is the most common battle management tool in the US Army planning tool.",
                    "label": 0
                },
                {
                    "sent": "You've seen it in front of you.",
                    "label": 0
                },
                {
                    "sent": "PowerPoint.",
                    "label": 0
                },
                {
                    "sent": "We will be auto generating power point.",
                    "label": 0
                },
                {
                    "sent": "I am sure someplace login.",
                    "label": 0
                }
            ]
        }
    }
}