{
    "id": "s5bq5l6ghp43mss4jubhfyjvgwctjgqf",
    "title": "A Semantic Graph-based Approach for Radicalisation Detection on Social Media",
    "info": {
        "author": [
            "Hassan Saif, Knowledge Media Institute (KMI), Open University (OU)"
        ],
        "published": "July 10, 2017",
        "recorded": "May 2017",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2017_saif_social_media/",
    "segmentation": [
        [
            "Right, so to those who don't know me, my name is Hasan Sahih Pharma research associate at the Open University.",
            "In came I and today I'm going to present our work on a semantic graph based approach for radicalization detection on social media.",
            "So."
        ],
        [
            "Online radicalization is the process by which individuals are introduced to mainstream beliefs and views that can move them from their sorry extreme believes that move them from their mainstream beliefs into more extreme views, mainly due to the use of online media.",
            "Now in our work here."
        ],
        [
            "Here we are going to target the problem for radicalization by focusing on this one that is related to ISIS.",
            "So ISIS, everyone knows is that stomach State of Iraq and Syria is at rest jihadist group that managed to capture in less than one year in 2013.",
            "Large Swatch is of lands between Iraq and Syria.",
            "Now what makes ice is very different from other social sort of other terrorist groups is their successful and effective use of social media in order to spread their propaganda and agenda and also to recruit new members.",
            "Now."
        ],
        [
            "So several cyber security and research organisations estimated that as many as 11,000 fighters, foreign fighters from Europe has been radicalized by Pro ISIS propaganda or provider stands, and therefore they moved actually to fight in Iraq and Syria alongside with ISIS.",
            "Now the top three countries as we can see here is Russia, France and the United Kingdom.",
            "And unfortunately, the."
        ],
        [
            "Impact of online radicalization doesn't stop at those who moved to Iraq and Syria to fight with ISIS but also extends to those who have been radicalized but still reside in Europe, and this can be demonstrated by the several attacks that have been carried out in Europe across Europe.",
            "Actually, for the last few years, specially in France, Germany, Belgium and more recently in Manchester in United Kingdom.",
            "Now this has."
        ],
        [
            "Brought attention from both cyber security and research organisations who tried to address this problem by building models that can detect users that are more likely to become radicalized with pro ISIS.",
            "Or with ISIS stands, which we call them pro ISIS users.",
            "They propose several models.",
            "These models can be categorized into two different categories.",
            "First one is lexicon based methods.",
            "Basically they hear they use basically a list of words that normally used among or not very common.",
            "Commonly used among ISIS users or process users, so we call it extremist language for example.",
            "Comic State Surekill offered or the state of Khilafa.",
            "The second."
        ],
        [
            "Approach is machine learning approach.",
            "This approach basically uses supervised machine learning classifier in general such as SVM, naive Bayes etc and trained trained from features extracted from the users timelines who are already annotated with their stance, whether they are pro, ISIS or anti ISIS.",
            "After that, the trained classifier is applied to timelines of other users in order to predict or to detect their radicalization stance."
        ],
        [
            "Now these approaches have shown, like relatively good performance.",
            "However, the problem is they.",
            "Mainly rely on lexical representation of features extracted from the timelines of the users, and this can be problematic sometimes because the radicalization stance of a given user might be represented within the semantic relations between words in his timeline.",
            "For example, the semantic relation symmetric relation between ISIS and Syria could be represented by the military intervention against ISIS, which is located in Syria as well as ISIS is located in Syria.",
            "So in order to address these issue, we."
        ],
        [
            "Suppose our approach, which is which uses.",
            "Basically these semantic relations from tweets, extract them from tweets 1st and then use them as features to improve the performance of the."
        ],
        [
            "The fire detection.",
            "So the approach works simply by first extracting the entities from trees and then map them to their semantic concepts.",
            "For example, ISIS is as jihadists group, Syria is a country and then looking into all possible semantic relations between these words.",
            "For example, again, user intervention against ISIS which place in Syria.",
            "As such, the approach breaks down into or the pipeline of the approach breaks down into four main phases.",
            "Conceptual, semantic extraction, semantic graph representation, frequent semantics.",
            "Graph mining and finally classifier training."
        ],
        [
            "So the first step is basically here we just extract again the named entities and map them to their semantic concepts.",
            "Areas account realises she had this group using the Bedia.",
            "Here a table shows for example the number of unique entities extracted for both Pro ISIS anti ISIS users in the data set we use for evaluation as well as the top 10 most frequent entities and concepts in the data set."
        ],
        [
            "Now after we extracted the named entities and their concepts, we moved into extracting all possible semantic relations between these entities who occur together in each user timeline.",
            "To do that, we simply just query.",
            "DBS yeah, in order to extract all possible paths between two according according entities of a certain length.",
            "In our experiments we used length of two and three.",
            "And here for example some possible relations between ISIS and Syria extracted from the pedia.",
            "For example, ISIS is connected to serial through Arbuckle back Daddy who is the leader of ISIS and birthplace in Syria.",
            "Also ISIS is connected to Syria through Paris Termism which is ideology as well of Muslim Brotherhood who are located in Syria.",
            "So the third step is."
        ],
        [
            "2.",
            "Extract is frequent pattern mining or extract the frequent patterns from these relations.",
            "So after we extract all these relations represent them for a given user actually represent them as a big graph, and then we look into the most frequent and most discriminative subgraphs within this big graph of the user.",
            "To do that, we use the closed graph method, which basically run extensive search within the graph in order to extract these frequent subgraphs from the data.",
            "After we extracted these subgraphs, for example, I will talk about this later.",
            "We use them as features to train machine learning classifiers in order to detect the radicalization stance of the users on Twitter."
        ],
        [
            "So in our experiments we use a balanced data set of a thousand 1132 users, equally divided into 566 Pro ISIS users and 566 anti ISIS users.",
            "This table shows the total number of tweets under each users group.",
            "As we can see here, prices users have almost 600,000 tweets.",
            "On the other hand anti ISIS users have 1.4 million tweets.",
            "Um?"
        ],
        [
            "So the way we collected these data sets which are started by 625 users that we took from a previous work by O'Callaghan.",
            "In 2014, these users were collected.",
            "They are collected based on their Geo location, they authors here focused on users that they reside in Europe.",
            "Sorry they reside in Syria and Iraq and they belong to different political and malicious malicious parties like for example some users support Assad, the Syrian president, some user support.",
            "I said some user support the opposition etc.",
            "So we took this users and then we collected their followers resulting in 2.4 million users.",
            "After that we sense we aim only to basically perform our analysis on those they reside in Europe.",
            "We removed all users that they don't.",
            "They are not located in Europe which resulted in only 1154 thousand EU users.",
            "So we collected their tweets which are 104 million tweets.",
            "Now to take these users are either prices or anti ISIS actually included also a third class which is a neutral.",
            "So to do that we basically relied on two hypothesis.",
            "First one is sharing inside material.",
            "When a user shared materials for example from ISIS accounts like realises that counseling Twitter then they are more likely to become to become radicalized or likely to be are radicalized already.",
            "So the second one is using extreme mental anguish.",
            "If a user use language that comes in line with.",
            "ISIS rhetoric, then he's more likely to become radicalized or being radicalized already."
        ],
        [
            "Um, sorry."
        ],
        [
            "Now.",
            "We compare our features or the sorry something graph features against other for baseline features that are unique around features.",
            "The typical unigram features sentiment features, those are the sentiment of the tweets in each user's timeline.",
            "Features the topics that the user express or discuss in his timeline as well as network features or profile information.",
            "These are the meta information of the user account on Twitter, such as the number of tweets, number of followers, number of following, etc.",
            "Now, after we extracted all these features, we perform feature selection in order to remove those that they have lower discrimination score.",
            "As we can see as well, like here with the feature reduction, we reduced the feature space substantially.",
            "Or all the user for all the feature sets?"
        ],
        [
            "Um?",
            "So we evaluated our features using several classifiers including Naive Bayes, maximum trivias, VMJ 3.",
            "Like all the machine learning classifiers and then we found that SVM with RBF kernel performed the best among the others.",
            "So we take it to in our evaluation as the baseline classifier.",
            "So as we reported, the classification performance in precision, recall F measure for both detecting Pro ISIS stands as well as anti ISIS stands.",
            "We also calculated the average of both tasks and we we run basically 10 fold cross validation over 30 runs for all the experiments we did."
        ],
        [
            "So we're not looking at the numbers because they are boring smooth."
        ],
        [
            "The graphs, right?",
            "So we have subject observations here.",
            "First, as we can see, that semantic features improve performance for detection.",
            "For detecting prices, anti ISIS stands by up to 7% among the average of the performance of other features.",
            "Semantic features here reach 92% in performance or in F measure followed by network features with 86% and then networks or unigrams and sentiment with.",
            "85 and 84 and the topic features produced the lowest performance.",
            "This might be due because the number of topics we extracted were very low, like I think 5000.",
            "As I remember topics.",
            "So the number of topic features were much lower than the other features."
        ],
        [
            "We also reported the performance or measure the performance for detecting Pro ISIS, an anti ISIS users separately.",
            "So here we have the power.",
            "The blue part for anti ISIS and the orange or yellow one for pro ISIS.",
            "What we can observe here is that for unigram sentiment and topic features the performance for detecting anti ISIS users is higher and easier than detecting pro ISIS users and that might be due to the different number of tweets under.",
            "This group as we said Pro ISIS users have only like 600,000 tweets where anti ISIS users has 1.4 million tweets which means that the number of basically tweets under anti ISIS users is 2.4 more than the number of tweets under the process users.",
            "However now when using network and semantic features we see that this type of features are not very affected by the imbalance.",
            "Number of tweets under these groups.",
            "As we can see here like the performance is really almost the same.",
            "With like very subtle difference between them, which might suggest that these type of features are multivalent to the imbalance distribution of tweets among the user groups.",
            "Um?"
        ],
        [
            "Now after we finished with our measurements and evaluation on the performance of our features, we moved into and defining some signals of radicalization.",
            "In other words, what we were trying to do is to find any variations in the semantics that are used among pro ISIS users as well as anti ISIS users and see if there is any difference in these semantics.",
            "So what we did we took the top 50 most frequent, let's say entities that were mentioned by both prices and anti ISIS users.",
            "And then we calculated their sentiment based on the sentiment of the tweets they mentioned in and what we found here is that prices users that focus on religion, ethnicity and historical topics for with words such as alarm, Mohammad, Muslim Islam's etc.",
            "Mentioned in positive sentiment.",
            "On the other hand for price anti ISIS users they mostly focus on political topics and your graphical locations.",
            "With words such as Hillary Clinton, Kurdistan, Iraq, Syria, Iran mentioned with different sentiment so there is no really agreement on the sentiment of these entities among anti ISIS users."
        ],
        [
            "Um?"
        ],
        [
            "So we also took six at six of the top mentioned entities among both the users Group which receive actually the same sentiment, right?",
            "So until I see users and prices users agree on the sentiment of these two of these six entities, these are ISIS, Assad, Syria, Iran and Israel.",
            "Also, they have similar sentiments.",
            "They for example a here is mentioned again most frequently more frequently than in prices users than anti ISIS users.",
            "On the other hand entities like Assad, Syria, Iran and Israel.",
            "They are more mentioned by anti ISIS users than pro ISIS users which also again suggests that there is a different in the topic discussed between all the topics discussed between these two groups."
        ],
        [
            "Um, last thing we did is we actually also look into the sub graphs that we extracted from the data set.",
            "These graphs that I said we use them as features for training the classifiers.",
            "Here the top 3 four prices and then until ISIS subgraphs.",
            "So for prices subgraphs as we can see.",
            "Again, it's mostly focusing on religion or historical events.",
            "For the first graph on the left, there we have Mohammed's connected to United States through our apps.",
            "With the link ethnicity and Arabs are populated in the United States.",
            "On the other hand, actually again another example is invasion of better, which is a battle that happened, you know, like 1000 years in the stomach during their stomach empire age.",
            "So invasion of better the Commander is Mohammed, which ethnicity is Arab populated place again in United States so.",
            "On the other hand, if we look at anti ISIS subgraphs, they focus more on locations and as well as the intervention against ISIS that started in 2014.",
            "So intervention against ISIS Commander or Barack Obama, which is party his party is Democratic Party in United States.",
            "So again, this is also another indicator to say like there are basically different type of semantics discussed among these two users group that we can use as distinct distinctive features.",
            "How for radicalization detection on Twitter."
        ],
        [
            "Now, to conclude, we propose a semantic based approach for radicalization detection on Twitter.",
            "We basically use latent semantic relations in tweets as features to train classifiers in order to better enhance the performance of.",
            "Radicalization stance detection on for Twitter users on Twitter.",
            "We experimented experimented on Twitter data set of 1100 three 32 prices and anti ISIS users and we compare against other baselines using SVM classifier.",
            "We found that semantic features perform up to 7.8% better than the average performance of all other baseline features.",
            "We also performed an analysis on the variation of the semantics used among between the two groups.",
            "And we found that prices users tend to discuss religion, historical events, ethnicity while anti ISIS users focus more in politics, geographical locations, an intervention against ISIS.",
            "That's it 21 minutes."
        ],
        [
            "Thank you."
        ],
        [
            "Thanks for the nice talk.",
            "One simple question, is this data set you mentioned has like a sort of gold standard that.",
            "Clearly defined who is proactive bro.",
            "Yeah, actually the 506 users are manually annotated.",
            "So I mean the filtering from 101 hundred 54,000 users.",
            "We did it automatically based on the hypothesis I mentioned already and then we took these users and we go through and we annotated them basically and my idea is were you able to come up with an F measure for your classifier.",
            "Or the semantic classifier in comparison to other classifiers?",
            "Yeah, I think.",
            "Not sure if I understand you, but we reported the classification performance in F measure actually.",
            "Oh like I missed this operation.",
            "Recall F measure?",
            "OK, thanks.",
            "Always some other questions.",
            "We have time.",
            "I am open to like I've seen quite a bit over the last year about.",
            "Other types of radicalization, like right wing radicalization in the US, particularly young men.",
            "Do you think would be interesting to see?",
            "What do you think?",
            "Do you think this would apply to that, right?",
            "So yeah, there are different forms of of radicalization in general.",
            "You have, for example, the right wing radicalization or even domestic radicalization, and you have to rest radicalization right so they all share.",
            "I think I mean from my experience.",
            "They all share similar characteristics like when you become radicalized, weather with ISIS, weather with.",
            "Political party you tend to move your actually tend to abandon your behavior, your previous behavior and adopt A new behavior, whether in terms of talking about social media here or there in terms of the language that you are using.",
            "Like you start like posting for example new terms or new phrases that come in line with the rhetoric of their group that you are.",
            "Supporting or with your network.",
            "Basically like the shape of the network changes a bit like you start following knew users.",
            "You start Unfollowing other users and so on so the dynamics is really like similar somehow to some extent based on other research.",
            "The difference, one of difference is just like the naming really, and also the terminology used.",
            "I think like I mean, ISIS use different terminology from, for example, Gordon in Greece, right?",
            "So yeah.",
            "Hey so I missed maybe couple of your earlier slides, but maybe you have answered this question earlier.",
            "What was the original motivation of this work?",
            "Is it the part of big project that you guys are running or it's actually it was before any project?",
            "So yeah, at the beginning I said like I said is were very successful in using social media.",
            "Actually they were the most considered the most successful terrorist groups.",
            "Actually it's a new phenomena like Al Qaeda before, never used social media.",
            "Any other terrorist groups, only ISIS.",
            "They were very proficient in using social media to reach people and that was demonstrated by the large number of people that basically they're being radicalized.",
            "Through the use of social media, so there are also like research in social science.",
            "They suggest that there are five stages of radicalization.",
            "Weather with ISIS or ISIS.",
            "So for example they start face like Mystic ISIS, real ISIS user.",
            "He started first by sending posting himself like messages and then targeting users that they have.",
            "For example, low number of followers.",
            "So start pushing them in the tweets.",
            "After that they move into sending them private messages.",
            "Right and try to communicate with them to isolate them from their community.",
            "So that is really professional, so there really there is a systematic way of so regulators standalone work like it's not a part of a huge project that you are having.",
            "It became later OK.",
            "It's a new project called Travel and starting engine OK. Did you determine that all the accounts you know your subset were real Twitter accounts, or at least did people use their identities, their full names on that?",
            "We actually we didn't look into that.",
            "So we looked into only the timelines.",
            "Which I think we should as well.",
            "But also I mean for me was like I think kind of personal issue like I didn't want to know who are they.",
            "Like who they are, these people right?",
            "So I just was looking into the timelines and their tweets when we were checking if the hypothesis were correct or not.",
            "But we didn't look into the identity of these users, but I mean, yeah.",
            "Yeah, it is actually that might be next step, but I'm thinking what we can learn from knowing the identity of these people because we already know like what they post about, so could be useful, yeah?",
            "OK, thank you very much.",
            "Thank you guys."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so to those who don't know me, my name is Hasan Sahih Pharma research associate at the Open University.",
                    "label": 0
                },
                {
                    "sent": "In came I and today I'm going to present our work on a semantic graph based approach for radicalization detection on social media.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Online radicalization is the process by which individuals are introduced to mainstream beliefs and views that can move them from their sorry extreme believes that move them from their mainstream beliefs into more extreme views, mainly due to the use of online media.",
                    "label": 0
                },
                {
                    "sent": "Now in our work here.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here we are going to target the problem for radicalization by focusing on this one that is related to ISIS.",
                    "label": 0
                },
                {
                    "sent": "So ISIS, everyone knows is that stomach State of Iraq and Syria is at rest jihadist group that managed to capture in less than one year in 2013.",
                    "label": 0
                },
                {
                    "sent": "Large Swatch is of lands between Iraq and Syria.",
                    "label": 1
                },
                {
                    "sent": "Now what makes ice is very different from other social sort of other terrorist groups is their successful and effective use of social media in order to spread their propaganda and agenda and also to recruit new members.",
                    "label": 0
                },
                {
                    "sent": "Now.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So several cyber security and research organisations estimated that as many as 11,000 fighters, foreign fighters from Europe has been radicalized by Pro ISIS propaganda or provider stands, and therefore they moved actually to fight in Iraq and Syria alongside with ISIS.",
                    "label": 0
                },
                {
                    "sent": "Now the top three countries as we can see here is Russia, France and the United Kingdom.",
                    "label": 0
                },
                {
                    "sent": "And unfortunately, the.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Impact of online radicalization doesn't stop at those who moved to Iraq and Syria to fight with ISIS but also extends to those who have been radicalized but still reside in Europe, and this can be demonstrated by the several attacks that have been carried out in Europe across Europe.",
                    "label": 0
                },
                {
                    "sent": "Actually, for the last few years, specially in France, Germany, Belgium and more recently in Manchester in United Kingdom.",
                    "label": 0
                },
                {
                    "sent": "Now this has.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Brought attention from both cyber security and research organisations who tried to address this problem by building models that can detect users that are more likely to become radicalized with pro ISIS.",
                    "label": 0
                },
                {
                    "sent": "Or with ISIS stands, which we call them pro ISIS users.",
                    "label": 0
                },
                {
                    "sent": "They propose several models.",
                    "label": 0
                },
                {
                    "sent": "These models can be categorized into two different categories.",
                    "label": 0
                },
                {
                    "sent": "First one is lexicon based methods.",
                    "label": 0
                },
                {
                    "sent": "Basically they hear they use basically a list of words that normally used among or not very common.",
                    "label": 0
                },
                {
                    "sent": "Commonly used among ISIS users or process users, so we call it extremist language for example.",
                    "label": 0
                },
                {
                    "sent": "Comic State Surekill offered or the state of Khilafa.",
                    "label": 0
                },
                {
                    "sent": "The second.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Approach is machine learning approach.",
                    "label": 1
                },
                {
                    "sent": "This approach basically uses supervised machine learning classifier in general such as SVM, naive Bayes etc and trained trained from features extracted from the users timelines who are already annotated with their stance, whether they are pro, ISIS or anti ISIS.",
                    "label": 0
                },
                {
                    "sent": "After that, the trained classifier is applied to timelines of other users in order to predict or to detect their radicalization stance.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now these approaches have shown, like relatively good performance.",
                    "label": 0
                },
                {
                    "sent": "However, the problem is they.",
                    "label": 0
                },
                {
                    "sent": "Mainly rely on lexical representation of features extracted from the timelines of the users, and this can be problematic sometimes because the radicalization stance of a given user might be represented within the semantic relations between words in his timeline.",
                    "label": 1
                },
                {
                    "sent": "For example, the semantic relation symmetric relation between ISIS and Syria could be represented by the military intervention against ISIS, which is located in Syria as well as ISIS is located in Syria.",
                    "label": 0
                },
                {
                    "sent": "So in order to address these issue, we.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Suppose our approach, which is which uses.",
                    "label": 0
                },
                {
                    "sent": "Basically these semantic relations from tweets, extract them from tweets 1st and then use them as features to improve the performance of the.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The fire detection.",
                    "label": 0
                },
                {
                    "sent": "So the approach works simply by first extracting the entities from trees and then map them to their semantic concepts.",
                    "label": 0
                },
                {
                    "sent": "For example, ISIS is as jihadists group, Syria is a country and then looking into all possible semantic relations between these words.",
                    "label": 1
                },
                {
                    "sent": "For example, again, user intervention against ISIS which place in Syria.",
                    "label": 0
                },
                {
                    "sent": "As such, the approach breaks down into or the pipeline of the approach breaks down into four main phases.",
                    "label": 0
                },
                {
                    "sent": "Conceptual, semantic extraction, semantic graph representation, frequent semantics.",
                    "label": 0
                },
                {
                    "sent": "Graph mining and finally classifier training.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the first step is basically here we just extract again the named entities and map them to their semantic concepts.",
                    "label": 0
                },
                {
                    "sent": "Areas account realises she had this group using the Bedia.",
                    "label": 0
                },
                {
                    "sent": "Here a table shows for example the number of unique entities extracted for both Pro ISIS anti ISIS users in the data set we use for evaluation as well as the top 10 most frequent entities and concepts in the data set.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now after we extracted the named entities and their concepts, we moved into extracting all possible semantic relations between these entities who occur together in each user timeline.",
                    "label": 0
                },
                {
                    "sent": "To do that, we simply just query.",
                    "label": 0
                },
                {
                    "sent": "DBS yeah, in order to extract all possible paths between two according according entities of a certain length.",
                    "label": 0
                },
                {
                    "sent": "In our experiments we used length of two and three.",
                    "label": 0
                },
                {
                    "sent": "And here for example some possible relations between ISIS and Syria extracted from the pedia.",
                    "label": 0
                },
                {
                    "sent": "For example, ISIS is connected to serial through Arbuckle back Daddy who is the leader of ISIS and birthplace in Syria.",
                    "label": 0
                },
                {
                    "sent": "Also ISIS is connected to Syria through Paris Termism which is ideology as well of Muslim Brotherhood who are located in Syria.",
                    "label": 0
                },
                {
                    "sent": "So the third step is.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "Extract is frequent pattern mining or extract the frequent patterns from these relations.",
                    "label": 1
                },
                {
                    "sent": "So after we extract all these relations represent them for a given user actually represent them as a big graph, and then we look into the most frequent and most discriminative subgraphs within this big graph of the user.",
                    "label": 0
                },
                {
                    "sent": "To do that, we use the closed graph method, which basically run extensive search within the graph in order to extract these frequent subgraphs from the data.",
                    "label": 0
                },
                {
                    "sent": "After we extracted these subgraphs, for example, I will talk about this later.",
                    "label": 0
                },
                {
                    "sent": "We use them as features to train machine learning classifiers in order to detect the radicalization stance of the users on Twitter.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our experiments we use a balanced data set of a thousand 1132 users, equally divided into 566 Pro ISIS users and 566 anti ISIS users.",
                    "label": 0
                },
                {
                    "sent": "This table shows the total number of tweets under each users group.",
                    "label": 0
                },
                {
                    "sent": "As we can see here, prices users have almost 600,000 tweets.",
                    "label": 0
                },
                {
                    "sent": "On the other hand anti ISIS users have 1.4 million tweets.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the way we collected these data sets which are started by 625 users that we took from a previous work by O'Callaghan.",
                    "label": 0
                },
                {
                    "sent": "In 2014, these users were collected.",
                    "label": 0
                },
                {
                    "sent": "They are collected based on their Geo location, they authors here focused on users that they reside in Europe.",
                    "label": 0
                },
                {
                    "sent": "Sorry they reside in Syria and Iraq and they belong to different political and malicious malicious parties like for example some users support Assad, the Syrian president, some user support.",
                    "label": 0
                },
                {
                    "sent": "I said some user support the opposition etc.",
                    "label": 0
                },
                {
                    "sent": "So we took this users and then we collected their followers resulting in 2.4 million users.",
                    "label": 0
                },
                {
                    "sent": "After that we sense we aim only to basically perform our analysis on those they reside in Europe.",
                    "label": 0
                },
                {
                    "sent": "We removed all users that they don't.",
                    "label": 0
                },
                {
                    "sent": "They are not located in Europe which resulted in only 1154 thousand EU users.",
                    "label": 0
                },
                {
                    "sent": "So we collected their tweets which are 104 million tweets.",
                    "label": 0
                },
                {
                    "sent": "Now to take these users are either prices or anti ISIS actually included also a third class which is a neutral.",
                    "label": 0
                },
                {
                    "sent": "So to do that we basically relied on two hypothesis.",
                    "label": 0
                },
                {
                    "sent": "First one is sharing inside material.",
                    "label": 0
                },
                {
                    "sent": "When a user shared materials for example from ISIS accounts like realises that counseling Twitter then they are more likely to become to become radicalized or likely to be are radicalized already.",
                    "label": 0
                },
                {
                    "sent": "So the second one is using extreme mental anguish.",
                    "label": 0
                },
                {
                    "sent": "If a user use language that comes in line with.",
                    "label": 0
                },
                {
                    "sent": "ISIS rhetoric, then he's more likely to become radicalized or being radicalized already.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, sorry.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now.",
                    "label": 0
                },
                {
                    "sent": "We compare our features or the sorry something graph features against other for baseline features that are unique around features.",
                    "label": 0
                },
                {
                    "sent": "The typical unigram features sentiment features, those are the sentiment of the tweets in each user's timeline.",
                    "label": 1
                },
                {
                    "sent": "Features the topics that the user express or discuss in his timeline as well as network features or profile information.",
                    "label": 0
                },
                {
                    "sent": "These are the meta information of the user account on Twitter, such as the number of tweets, number of followers, number of following, etc.",
                    "label": 0
                },
                {
                    "sent": "Now, after we extracted all these features, we perform feature selection in order to remove those that they have lower discrimination score.",
                    "label": 0
                },
                {
                    "sent": "As we can see as well, like here with the feature reduction, we reduced the feature space substantially.",
                    "label": 0
                },
                {
                    "sent": "Or all the user for all the feature sets?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So we evaluated our features using several classifiers including Naive Bayes, maximum trivias, VMJ 3.",
                    "label": 0
                },
                {
                    "sent": "Like all the machine learning classifiers and then we found that SVM with RBF kernel performed the best among the others.",
                    "label": 0
                },
                {
                    "sent": "So we take it to in our evaluation as the baseline classifier.",
                    "label": 0
                },
                {
                    "sent": "So as we reported, the classification performance in precision, recall F measure for both detecting Pro ISIS stands as well as anti ISIS stands.",
                    "label": 0
                },
                {
                    "sent": "We also calculated the average of both tasks and we we run basically 10 fold cross validation over 30 runs for all the experiments we did.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're not looking at the numbers because they are boring smooth.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The graphs, right?",
                    "label": 0
                },
                {
                    "sent": "So we have subject observations here.",
                    "label": 0
                },
                {
                    "sent": "First, as we can see, that semantic features improve performance for detection.",
                    "label": 0
                },
                {
                    "sent": "For detecting prices, anti ISIS stands by up to 7% among the average of the performance of other features.",
                    "label": 1
                },
                {
                    "sent": "Semantic features here reach 92% in performance or in F measure followed by network features with 86% and then networks or unigrams and sentiment with.",
                    "label": 0
                },
                {
                    "sent": "85 and 84 and the topic features produced the lowest performance.",
                    "label": 0
                },
                {
                    "sent": "This might be due because the number of topics we extracted were very low, like I think 5000.",
                    "label": 0
                },
                {
                    "sent": "As I remember topics.",
                    "label": 0
                },
                {
                    "sent": "So the number of topic features were much lower than the other features.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also reported the performance or measure the performance for detecting Pro ISIS, an anti ISIS users separately.",
                    "label": 0
                },
                {
                    "sent": "So here we have the power.",
                    "label": 0
                },
                {
                    "sent": "The blue part for anti ISIS and the orange or yellow one for pro ISIS.",
                    "label": 0
                },
                {
                    "sent": "What we can observe here is that for unigram sentiment and topic features the performance for detecting anti ISIS users is higher and easier than detecting pro ISIS users and that might be due to the different number of tweets under.",
                    "label": 0
                },
                {
                    "sent": "This group as we said Pro ISIS users have only like 600,000 tweets where anti ISIS users has 1.4 million tweets which means that the number of basically tweets under anti ISIS users is 2.4 more than the number of tweets under the process users.",
                    "label": 0
                },
                {
                    "sent": "However now when using network and semantic features we see that this type of features are not very affected by the imbalance.",
                    "label": 0
                },
                {
                    "sent": "Number of tweets under these groups.",
                    "label": 0
                },
                {
                    "sent": "As we can see here like the performance is really almost the same.",
                    "label": 0
                },
                {
                    "sent": "With like very subtle difference between them, which might suggest that these type of features are multivalent to the imbalance distribution of tweets among the user groups.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now after we finished with our measurements and evaluation on the performance of our features, we moved into and defining some signals of radicalization.",
                    "label": 0
                },
                {
                    "sent": "In other words, what we were trying to do is to find any variations in the semantics that are used among pro ISIS users as well as anti ISIS users and see if there is any difference in these semantics.",
                    "label": 0
                },
                {
                    "sent": "So what we did we took the top 50 most frequent, let's say entities that were mentioned by both prices and anti ISIS users.",
                    "label": 0
                },
                {
                    "sent": "And then we calculated their sentiment based on the sentiment of the tweets they mentioned in and what we found here is that prices users that focus on religion, ethnicity and historical topics for with words such as alarm, Mohammad, Muslim Islam's etc.",
                    "label": 0
                },
                {
                    "sent": "Mentioned in positive sentiment.",
                    "label": 0
                },
                {
                    "sent": "On the other hand for price anti ISIS users they mostly focus on political topics and your graphical locations.",
                    "label": 0
                },
                {
                    "sent": "With words such as Hillary Clinton, Kurdistan, Iraq, Syria, Iran mentioned with different sentiment so there is no really agreement on the sentiment of these entities among anti ISIS users.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we also took six at six of the top mentioned entities among both the users Group which receive actually the same sentiment, right?",
                    "label": 0
                },
                {
                    "sent": "So until I see users and prices users agree on the sentiment of these two of these six entities, these are ISIS, Assad, Syria, Iran and Israel.",
                    "label": 0
                },
                {
                    "sent": "Also, they have similar sentiments.",
                    "label": 0
                },
                {
                    "sent": "They for example a here is mentioned again most frequently more frequently than in prices users than anti ISIS users.",
                    "label": 0
                },
                {
                    "sent": "On the other hand entities like Assad, Syria, Iran and Israel.",
                    "label": 1
                },
                {
                    "sent": "They are more mentioned by anti ISIS users than pro ISIS users which also again suggests that there is a different in the topic discussed between all the topics discussed between these two groups.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, last thing we did is we actually also look into the sub graphs that we extracted from the data set.",
                    "label": 0
                },
                {
                    "sent": "These graphs that I said we use them as features for training the classifiers.",
                    "label": 0
                },
                {
                    "sent": "Here the top 3 four prices and then until ISIS subgraphs.",
                    "label": 0
                },
                {
                    "sent": "So for prices subgraphs as we can see.",
                    "label": 0
                },
                {
                    "sent": "Again, it's mostly focusing on religion or historical events.",
                    "label": 0
                },
                {
                    "sent": "For the first graph on the left, there we have Mohammed's connected to United States through our apps.",
                    "label": 0
                },
                {
                    "sent": "With the link ethnicity and Arabs are populated in the United States.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, actually again another example is invasion of better, which is a battle that happened, you know, like 1000 years in the stomach during their stomach empire age.",
                    "label": 0
                },
                {
                    "sent": "So invasion of better the Commander is Mohammed, which ethnicity is Arab populated place again in United States so.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, if we look at anti ISIS subgraphs, they focus more on locations and as well as the intervention against ISIS that started in 2014.",
                    "label": 0
                },
                {
                    "sent": "So intervention against ISIS Commander or Barack Obama, which is party his party is Democratic Party in United States.",
                    "label": 0
                },
                {
                    "sent": "So again, this is also another indicator to say like there are basically different type of semantics discussed among these two users group that we can use as distinct distinctive features.",
                    "label": 0
                },
                {
                    "sent": "How for radicalization detection on Twitter.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, to conclude, we propose a semantic based approach for radicalization detection on Twitter.",
                    "label": 0
                },
                {
                    "sent": "We basically use latent semantic relations in tweets as features to train classifiers in order to better enhance the performance of.",
                    "label": 0
                },
                {
                    "sent": "Radicalization stance detection on for Twitter users on Twitter.",
                    "label": 0
                },
                {
                    "sent": "We experimented experimented on Twitter data set of 1100 three 32 prices and anti ISIS users and we compare against other baselines using SVM classifier.",
                    "label": 0
                },
                {
                    "sent": "We found that semantic features perform up to 7.8% better than the average performance of all other baseline features.",
                    "label": 0
                },
                {
                    "sent": "We also performed an analysis on the variation of the semantics used among between the two groups.",
                    "label": 0
                },
                {
                    "sent": "And we found that prices users tend to discuss religion, historical events, ethnicity while anti ISIS users focus more in politics, geographical locations, an intervention against ISIS.",
                    "label": 0
                },
                {
                    "sent": "That's it 21 minutes.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thanks for the nice talk.",
                    "label": 0
                },
                {
                    "sent": "One simple question, is this data set you mentioned has like a sort of gold standard that.",
                    "label": 0
                },
                {
                    "sent": "Clearly defined who is proactive bro.",
                    "label": 0
                },
                {
                    "sent": "Yeah, actually the 506 users are manually annotated.",
                    "label": 0
                },
                {
                    "sent": "So I mean the filtering from 101 hundred 54,000 users.",
                    "label": 0
                },
                {
                    "sent": "We did it automatically based on the hypothesis I mentioned already and then we took these users and we go through and we annotated them basically and my idea is were you able to come up with an F measure for your classifier.",
                    "label": 0
                },
                {
                    "sent": "Or the semantic classifier in comparison to other classifiers?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I think.",
                    "label": 0
                },
                {
                    "sent": "Not sure if I understand you, but we reported the classification performance in F measure actually.",
                    "label": 0
                },
                {
                    "sent": "Oh like I missed this operation.",
                    "label": 0
                },
                {
                    "sent": "Recall F measure?",
                    "label": 0
                },
                {
                    "sent": "OK, thanks.",
                    "label": 0
                },
                {
                    "sent": "Always some other questions.",
                    "label": 0
                },
                {
                    "sent": "We have time.",
                    "label": 0
                },
                {
                    "sent": "I am open to like I've seen quite a bit over the last year about.",
                    "label": 0
                },
                {
                    "sent": "Other types of radicalization, like right wing radicalization in the US, particularly young men.",
                    "label": 0
                },
                {
                    "sent": "Do you think would be interesting to see?",
                    "label": 0
                },
                {
                    "sent": "What do you think?",
                    "label": 0
                },
                {
                    "sent": "Do you think this would apply to that, right?",
                    "label": 0
                },
                {
                    "sent": "So yeah, there are different forms of of radicalization in general.",
                    "label": 0
                },
                {
                    "sent": "You have, for example, the right wing radicalization or even domestic radicalization, and you have to rest radicalization right so they all share.",
                    "label": 0
                },
                {
                    "sent": "I think I mean from my experience.",
                    "label": 0
                },
                {
                    "sent": "They all share similar characteristics like when you become radicalized, weather with ISIS, weather with.",
                    "label": 0
                },
                {
                    "sent": "Political party you tend to move your actually tend to abandon your behavior, your previous behavior and adopt A new behavior, whether in terms of talking about social media here or there in terms of the language that you are using.",
                    "label": 0
                },
                {
                    "sent": "Like you start like posting for example new terms or new phrases that come in line with the rhetoric of their group that you are.",
                    "label": 0
                },
                {
                    "sent": "Supporting or with your network.",
                    "label": 0
                },
                {
                    "sent": "Basically like the shape of the network changes a bit like you start following knew users.",
                    "label": 0
                },
                {
                    "sent": "You start Unfollowing other users and so on so the dynamics is really like similar somehow to some extent based on other research.",
                    "label": 0
                },
                {
                    "sent": "The difference, one of difference is just like the naming really, and also the terminology used.",
                    "label": 0
                },
                {
                    "sent": "I think like I mean, ISIS use different terminology from, for example, Gordon in Greece, right?",
                    "label": 0
                },
                {
                    "sent": "So yeah.",
                    "label": 0
                },
                {
                    "sent": "Hey so I missed maybe couple of your earlier slides, but maybe you have answered this question earlier.",
                    "label": 0
                },
                {
                    "sent": "What was the original motivation of this work?",
                    "label": 0
                },
                {
                    "sent": "Is it the part of big project that you guys are running or it's actually it was before any project?",
                    "label": 0
                },
                {
                    "sent": "So yeah, at the beginning I said like I said is were very successful in using social media.",
                    "label": 0
                },
                {
                    "sent": "Actually they were the most considered the most successful terrorist groups.",
                    "label": 0
                },
                {
                    "sent": "Actually it's a new phenomena like Al Qaeda before, never used social media.",
                    "label": 0
                },
                {
                    "sent": "Any other terrorist groups, only ISIS.",
                    "label": 0
                },
                {
                    "sent": "They were very proficient in using social media to reach people and that was demonstrated by the large number of people that basically they're being radicalized.",
                    "label": 0
                },
                {
                    "sent": "Through the use of social media, so there are also like research in social science.",
                    "label": 0
                },
                {
                    "sent": "They suggest that there are five stages of radicalization.",
                    "label": 0
                },
                {
                    "sent": "Weather with ISIS or ISIS.",
                    "label": 0
                },
                {
                    "sent": "So for example they start face like Mystic ISIS, real ISIS user.",
                    "label": 0
                },
                {
                    "sent": "He started first by sending posting himself like messages and then targeting users that they have.",
                    "label": 0
                },
                {
                    "sent": "For example, low number of followers.",
                    "label": 0
                },
                {
                    "sent": "So start pushing them in the tweets.",
                    "label": 0
                },
                {
                    "sent": "After that they move into sending them private messages.",
                    "label": 0
                },
                {
                    "sent": "Right and try to communicate with them to isolate them from their community.",
                    "label": 0
                },
                {
                    "sent": "So that is really professional, so there really there is a systematic way of so regulators standalone work like it's not a part of a huge project that you are having.",
                    "label": 0
                },
                {
                    "sent": "It became later OK.",
                    "label": 0
                },
                {
                    "sent": "It's a new project called Travel and starting engine OK. Did you determine that all the accounts you know your subset were real Twitter accounts, or at least did people use their identities, their full names on that?",
                    "label": 0
                },
                {
                    "sent": "We actually we didn't look into that.",
                    "label": 0
                },
                {
                    "sent": "So we looked into only the timelines.",
                    "label": 0
                },
                {
                    "sent": "Which I think we should as well.",
                    "label": 0
                },
                {
                    "sent": "But also I mean for me was like I think kind of personal issue like I didn't want to know who are they.",
                    "label": 0
                },
                {
                    "sent": "Like who they are, these people right?",
                    "label": 0
                },
                {
                    "sent": "So I just was looking into the timelines and their tweets when we were checking if the hypothesis were correct or not.",
                    "label": 0
                },
                {
                    "sent": "But we didn't look into the identity of these users, but I mean, yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it is actually that might be next step, but I'm thinking what we can learn from knowing the identity of these people because we already know like what they post about, so could be useful, yeah?",
                    "label": 0
                },
                {
                    "sent": "OK, thank you very much.",
                    "label": 1
                },
                {
                    "sent": "Thank you guys.",
                    "label": 0
                }
            ]
        }
    }
}