{
    "id": "samd3ro4ls4v3a32x2efr23xjiosyxjb",
    "title": "YEAR: Initiating the R&D co-operation of Young Researchers through Training and Networking",
    "info": {
        "author": [
            "Jarno Salonen, VTT Technical Research Centre of Finland"
        ],
        "published": "June 19, 2009",
        "recorded": "May 2009",
        "category": [
            "Top->Social Sciences->Education",
            "Top->Science"
        ]
    },
    "url": "http://videolectures.net/rtd09_salonen_yitr/",
    "segmentation": [
        [
            "So I'm from VTT and I'm from here and the name was correctly pronounced.",
            "So first of all, I'd like to thank the organizers for giving me this opportunity to present present year young European associated researchers, and I was also really happy to hear the compliments that you gave about the Nordic countries and especially Finland.",
            "So basically seeing the video of Eschar former Prime Minister and and all the other things compliments it was really, really good for my ears.",
            "On the other hand, I have to I have to say that.",
            "Especially when you said that the collaboration OK between the Nordic countries.",
            "I think this kind of collaboration that you've had here since during this two days has been really nice.",
            "At least I can't say I have to admit I I can't say that I've had any kind of collaboration between the Swedes and Norwegians and Finns.",
            "At least in my research career.",
            "But on the other hand, we have to think that there's Nokia and Ericsson which are competing really, really much against each other and then.",
            "Then also there's the ice hockey teams between Finland and Sweden, as well as the Eurovision contest."
        ],
        [
            "OK, but no to the subject.",
            "So what is year years and growing network of young researchers from artios research and technology organizations and industrial research bodies?",
            "We have formalized in 2007.",
            "You have quite quite exactly two years ago, but on the other hand because of the Belgian government that wasn't established until very was it late 2007 or early 2008 we were officially announced as a as an organization in 2008.",
            "Currently we've got eight member organisations, the latest of which is from the United Kingdom Para who became our member early this year."
        ],
        [
            "So you can be considered as a targeted incentive.",
            "So when we asked our research organisations, our member organizations and also other European artios, we asked what what do you expect from your organisations?",
            "Well, the answers are pretty much the same as all the other employees in the organisations.",
            "However, I must say that the interdisciplinary and international projects there they might be a change as well as the high degree of freedom and responsibilities.",
            "So basically, if you think that currently, currently, and especially in the future, probably the research organizations have to really compete for young young professionals, young experts and that's going to be a major major thing.",
            "So they're not.",
            "Let's say if I might say that the old researchers have settled for a room and under lab seat in the research lab, the future future hopes of the organisations they probably won't do that.",
            "They'll move on to another location.",
            "Unless they get really kind of challenges and freedom."
        ],
        [
            "So that's the year mission.",
            "Actually.",
            "You've got the long version here, which I had, but then I thought that it's a bit because I have to highlight those words in there, and I thought that this is a bit too long, so I made a short version.",
            "So you've got the brochure in your material workshop material.",
            "So basically year takes care of your young researchers and how we do it.",
            "It's through training activities through top class workshops and conferences, and by nibbling their establishment of young professional networks.",
            "For example, this is one of the forums that we've got the create course which is America Re based based concept.",
            "It's an annual 'cause I'm going to tell something more about it, but there's one example.",
            "The youngest person last year in create was 2324 and the oldest one.",
            "The guy taking the picture up on the left left top corner.",
            "He was 45 or so, so it's not just the youngest people, but it's it's a course for all."
        ],
        [
            "So what does gear have to offer?",
            "Perhaps our most important tool is the networking tool in all of our events, we've got a lot of networking and socializing.",
            "It's actually nice to see when I when I've participated, of course, as an organizer, I've participated to these events.",
            "I've seen that yet people are going there.",
            "They're saying hi to a colleague from their own organization, so people from Fraunhofer that haven't seen each other ever.",
            "They they see each other in.",
            "One of our events and I have to admit I found a few new friends from BTT.",
            "Also in some of our events.",
            "So that's basically basically true.",
            "Also within your own organization.",
            "Information and Contacts.",
            "We've got a newsletter that consists of information about the members about the forthcoming events, as well as the past events.",
            "It's currently we are preparing the 6th version of 6th volume of number of the newsletter.",
            "So since 2007, well 2 three times per year and the create course that's America Re supported project that started in 2007.",
            "It consists of four annual training courses.",
            "The first one in 2007.",
            "They're all one week courses, so the first one was in Ayden, in Italy, in Eugene, and it was about from creativity to innovation.",
            "Then the second one was last year about this time in May.",
            "It was about communication and information dissemination and the next create course is going to be about technology and knowledge transfer.",
            "It's going to be held in Munich, hosted by Fraunhofer.",
            "And it's going to be from the 3rd to the 10th of June."
        ],
        [
            "I also mentioned that we had top class events.",
            "Well, events that we've reorganized so far in addition to the create course, the annual conference, which was held in Brussels last year.",
            "It was topic making out of making money out of research, and we had Crystal Chris Hall from Air to label the Middle Air from Arrma, his current or forthcoming president, and for example in the Open Innovation Conference that we organized in Eindhoven in March.",
            "We had us keynote, the guru of open innovation along with Henry Chesbrough.",
            "We had we win one half a Baker there giving a speech.",
            "Then in addition another tool we could mobility.",
            "So we're trying to get researchers more mobilized and we organized the workshop in 90 in 2007.",
            "In November, that consisted of quite a lot of research organization, HR Department managers, and they've started and.",
            "I forwarded this work despite our on our contribution and for example in the next newsletter we're going to have some information regarding the this this information."
        ],
        [
            "Yeah, I'm almost in the last slide, so basically there are a couple of pictures about our events, so we've got small events we've got there.",
            "The networking on the right hand side on the left handers Jean Lou Golf from the European Patent Office giving a speech on patenting.",
            "Whether it's worth doing or not.",
            "And in the bottom there's there's win one Bonhoeffer, Baker.",
            "If you can see and there are the participants for that course and in the center there's the create course participants in the year 2008.",
            "So it was about 40 a bit over 40 people participating."
        ],
        [
            "So last slide how to activate your young professionals?",
            "Well, of course I must say, because I'm presenting here well, why don't you become a partner?",
            "Remember the forthcoming events are going to be create three knowledge transfer in Munich.",
            "Actually, these courses are open also for non members and there are still I think 5 to 10 places left because of the current financial situation.",
            "So if you've got an idea about someone who might be interested then.",
            "Then give me a call.",
            "And in addition, your nail is hosting the year annual conference in 2009.",
            "It's going to be in October, probably the 15th to 16th of October, and the topic will be the recipe of being a smart researcher.",
            "So there's some kind of cooperation that you could do collaboration participating into that.",
            "So basically all of the year organized events they are available for Members for free and for non members.",
            "They were available for a small small price for a small fee.",
            "But in addition, you should what you should do definitely is provide resources and support for activities in for your young researchers.",
            "So establishment of a young network in your own organization is a good thing to do.",
            "Like I heard yesterday in the yesterday's presentations, there are three 404 and a half hundred young researchers in the three organizing organizations artios, and it's it's definitely something that they should start networking.",
            "Between each other also we had good results when VTT included the Young Professionals Network at VTT to the strategy implementation and the strategy process.",
            "Actually we've generated some random launches.",
            "Kind of things where experts talk with young young researchers and stuff like that.",
            "Very good results.",
            "And also last but not least require results from them.",
            "But what you should do is grab them the freedom of execution."
        ],
        [
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm from VTT and I'm from here and the name was correctly pronounced.",
                    "label": 0
                },
                {
                    "sent": "So first of all, I'd like to thank the organizers for giving me this opportunity to present present year young European associated researchers, and I was also really happy to hear the compliments that you gave about the Nordic countries and especially Finland.",
                    "label": 1
                },
                {
                    "sent": "So basically seeing the video of Eschar former Prime Minister and and all the other things compliments it was really, really good for my ears.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, I have to I have to say that.",
                    "label": 0
                },
                {
                    "sent": "Especially when you said that the collaboration OK between the Nordic countries.",
                    "label": 0
                },
                {
                    "sent": "I think this kind of collaboration that you've had here since during this two days has been really nice.",
                    "label": 0
                },
                {
                    "sent": "At least I can't say I have to admit I I can't say that I've had any kind of collaboration between the Swedes and Norwegians and Finns.",
                    "label": 0
                },
                {
                    "sent": "At least in my research career.",
                    "label": 0
                },
                {
                    "sent": "But on the other hand, we have to think that there's Nokia and Ericsson which are competing really, really much against each other and then.",
                    "label": 0
                },
                {
                    "sent": "Then also there's the ice hockey teams between Finland and Sweden, as well as the Eurovision contest.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, but no to the subject.",
                    "label": 0
                },
                {
                    "sent": "So what is year years and growing network of young researchers from artios research and technology organizations and industrial research bodies?",
                    "label": 1
                },
                {
                    "sent": "We have formalized in 2007.",
                    "label": 0
                },
                {
                    "sent": "You have quite quite exactly two years ago, but on the other hand because of the Belgian government that wasn't established until very was it late 2007 or early 2008 we were officially announced as a as an organization in 2008.",
                    "label": 0
                },
                {
                    "sent": "Currently we've got eight member organisations, the latest of which is from the United Kingdom Para who became our member early this year.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So you can be considered as a targeted incentive.",
                    "label": 1
                },
                {
                    "sent": "So when we asked our research organisations, our member organizations and also other European artios, we asked what what do you expect from your organisations?",
                    "label": 0
                },
                {
                    "sent": "Well, the answers are pretty much the same as all the other employees in the organisations.",
                    "label": 0
                },
                {
                    "sent": "However, I must say that the interdisciplinary and international projects there they might be a change as well as the high degree of freedom and responsibilities.",
                    "label": 1
                },
                {
                    "sent": "So basically, if you think that currently, currently, and especially in the future, probably the research organizations have to really compete for young young professionals, young experts and that's going to be a major major thing.",
                    "label": 0
                },
                {
                    "sent": "So they're not.",
                    "label": 0
                },
                {
                    "sent": "Let's say if I might say that the old researchers have settled for a room and under lab seat in the research lab, the future future hopes of the organisations they probably won't do that.",
                    "label": 0
                },
                {
                    "sent": "They'll move on to another location.",
                    "label": 0
                },
                {
                    "sent": "Unless they get really kind of challenges and freedom.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So that's the year mission.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "You've got the long version here, which I had, but then I thought that it's a bit because I have to highlight those words in there, and I thought that this is a bit too long, so I made a short version.",
                    "label": 0
                },
                {
                    "sent": "So you've got the brochure in your material workshop material.",
                    "label": 0
                },
                {
                    "sent": "So basically year takes care of your young researchers and how we do it.",
                    "label": 1
                },
                {
                    "sent": "It's through training activities through top class workshops and conferences, and by nibbling their establishment of young professional networks.",
                    "label": 1
                },
                {
                    "sent": "For example, this is one of the forums that we've got the create course which is America Re based based concept.",
                    "label": 0
                },
                {
                    "sent": "It's an annual 'cause I'm going to tell something more about it, but there's one example.",
                    "label": 0
                },
                {
                    "sent": "The youngest person last year in create was 2324 and the oldest one.",
                    "label": 0
                },
                {
                    "sent": "The guy taking the picture up on the left left top corner.",
                    "label": 0
                },
                {
                    "sent": "He was 45 or so, so it's not just the youngest people, but it's it's a course for all.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what does gear have to offer?",
                    "label": 1
                },
                {
                    "sent": "Perhaps our most important tool is the networking tool in all of our events, we've got a lot of networking and socializing.",
                    "label": 0
                },
                {
                    "sent": "It's actually nice to see when I when I've participated, of course, as an organizer, I've participated to these events.",
                    "label": 0
                },
                {
                    "sent": "I've seen that yet people are going there.",
                    "label": 0
                },
                {
                    "sent": "They're saying hi to a colleague from their own organization, so people from Fraunhofer that haven't seen each other ever.",
                    "label": 0
                },
                {
                    "sent": "They they see each other in.",
                    "label": 0
                },
                {
                    "sent": "One of our events and I have to admit I found a few new friends from BTT.",
                    "label": 0
                },
                {
                    "sent": "Also in some of our events.",
                    "label": 0
                },
                {
                    "sent": "So that's basically basically true.",
                    "label": 0
                },
                {
                    "sent": "Also within your own organization.",
                    "label": 1
                },
                {
                    "sent": "Information and Contacts.",
                    "label": 0
                },
                {
                    "sent": "We've got a newsletter that consists of information about the members about the forthcoming events, as well as the past events.",
                    "label": 0
                },
                {
                    "sent": "It's currently we are preparing the 6th version of 6th volume of number of the newsletter.",
                    "label": 1
                },
                {
                    "sent": "So since 2007, well 2 three times per year and the create course that's America Re supported project that started in 2007.",
                    "label": 0
                },
                {
                    "sent": "It consists of four annual training courses.",
                    "label": 0
                },
                {
                    "sent": "The first one in 2007.",
                    "label": 0
                },
                {
                    "sent": "They're all one week courses, so the first one was in Ayden, in Italy, in Eugene, and it was about from creativity to innovation.",
                    "label": 0
                },
                {
                    "sent": "Then the second one was last year about this time in May.",
                    "label": 0
                },
                {
                    "sent": "It was about communication and information dissemination and the next create course is going to be about technology and knowledge transfer.",
                    "label": 0
                },
                {
                    "sent": "It's going to be held in Munich, hosted by Fraunhofer.",
                    "label": 0
                },
                {
                    "sent": "And it's going to be from the 3rd to the 10th of June.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I also mentioned that we had top class events.",
                    "label": 0
                },
                {
                    "sent": "Well, events that we've reorganized so far in addition to the create course, the annual conference, which was held in Brussels last year.",
                    "label": 0
                },
                {
                    "sent": "It was topic making out of making money out of research, and we had Crystal Chris Hall from Air to label the Middle Air from Arrma, his current or forthcoming president, and for example in the Open Innovation Conference that we organized in Eindhoven in March.",
                    "label": 1
                },
                {
                    "sent": "We had us keynote, the guru of open innovation along with Henry Chesbrough.",
                    "label": 0
                },
                {
                    "sent": "We had we win one half a Baker there giving a speech.",
                    "label": 0
                },
                {
                    "sent": "Then in addition another tool we could mobility.",
                    "label": 0
                },
                {
                    "sent": "So we're trying to get researchers more mobilized and we organized the workshop in 90 in 2007.",
                    "label": 0
                },
                {
                    "sent": "In November, that consisted of quite a lot of research organization, HR Department managers, and they've started and.",
                    "label": 0
                },
                {
                    "sent": "I forwarded this work despite our on our contribution and for example in the next newsletter we're going to have some information regarding the this this information.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, I'm almost in the last slide, so basically there are a couple of pictures about our events, so we've got small events we've got there.",
                    "label": 0
                },
                {
                    "sent": "The networking on the right hand side on the left handers Jean Lou Golf from the European Patent Office giving a speech on patenting.",
                    "label": 0
                },
                {
                    "sent": "Whether it's worth doing or not.",
                    "label": 0
                },
                {
                    "sent": "And in the bottom there's there's win one Bonhoeffer, Baker.",
                    "label": 0
                },
                {
                    "sent": "If you can see and there are the participants for that course and in the center there's the create course participants in the year 2008.",
                    "label": 0
                },
                {
                    "sent": "So it was about 40 a bit over 40 people participating.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So last slide how to activate your young professionals?",
                    "label": 1
                },
                {
                    "sent": "Well, of course I must say, because I'm presenting here well, why don't you become a partner?",
                    "label": 0
                },
                {
                    "sent": "Remember the forthcoming events are going to be create three knowledge transfer in Munich.",
                    "label": 0
                },
                {
                    "sent": "Actually, these courses are open also for non members and there are still I think 5 to 10 places left because of the current financial situation.",
                    "label": 0
                },
                {
                    "sent": "So if you've got an idea about someone who might be interested then.",
                    "label": 0
                },
                {
                    "sent": "Then give me a call.",
                    "label": 0
                },
                {
                    "sent": "And in addition, your nail is hosting the year annual conference in 2009.",
                    "label": 1
                },
                {
                    "sent": "It's going to be in October, probably the 15th to 16th of October, and the topic will be the recipe of being a smart researcher.",
                    "label": 0
                },
                {
                    "sent": "So there's some kind of cooperation that you could do collaboration participating into that.",
                    "label": 0
                },
                {
                    "sent": "So basically all of the year organized events they are available for Members for free and for non members.",
                    "label": 1
                },
                {
                    "sent": "They were available for a small small price for a small fee.",
                    "label": 0
                },
                {
                    "sent": "But in addition, you should what you should do definitely is provide resources and support for activities in for your young researchers.",
                    "label": 0
                },
                {
                    "sent": "So establishment of a young network in your own organization is a good thing to do.",
                    "label": 1
                },
                {
                    "sent": "Like I heard yesterday in the yesterday's presentations, there are three 404 and a half hundred young researchers in the three organizing organizations artios, and it's it's definitely something that they should start networking.",
                    "label": 0
                },
                {
                    "sent": "Between each other also we had good results when VTT included the Young Professionals Network at VTT to the strategy implementation and the strategy process.",
                    "label": 0
                },
                {
                    "sent": "Actually we've generated some random launches.",
                    "label": 0
                },
                {
                    "sent": "Kind of things where experts talk with young young researchers and stuff like that.",
                    "label": 1
                },
                {
                    "sent": "Very good results.",
                    "label": 0
                },
                {
                    "sent": "And also last but not least require results from them.",
                    "label": 0
                },
                {
                    "sent": "But what you should do is grab them the freedom of execution.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}