{
    "id": "sb5lxxfxxgfash7qipf3xvcrtwqdlt7k",
    "title": "Correlation Search in Graph Databases",
    "info": {
        "author": [
            "Yiping Ke, The Hong Kong University of Science and Technology"
        ],
        "published": "Aug. 14, 2007",
        "recorded": "August 2007",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Machine Learning->Structured Data"
        ]
    },
    "url": "http://videolectures.net/kdd07_ke_csgd/",
    "segmentation": [
        [
            "Good morning everyone.",
            "I'm eating Curry from Hong Kong University of Science and Technology.",
            "Copy of my presentation is correlation search.",
            "The topic of my presentation is correlation.",
            "Search in graph databases and this is a joint work with James Strang and my supervisor with."
        ],
        [
            "This is the outline of my talk.",
            "First hour give introduction and I will define a problem and present our solution and then I will show some performance evaluation and finally the conclusions."
        ],
        [
            "Graphs are popularly used to model objects and relationships, and it is everywhere in various scientific domains such as our informatives chemistry, social science and many more."
        ],
        [
            "Existing research on graph search.",
            "Many focus on structural similarity.",
            "Search letters to find the graphs, structural SMS or similar to a given query graph."
        ],
        [
            "However, in some applications, structure similarity search may not be applicable.",
            "There see the following application scenario.",
            "The graph database contains a set of molecules.",
            "Molecular structures, such as the three graphs ABC here and the figure D shows an example query."
        ],
        [
            "For structural similarity search you will retain this tree graphs because the substructures in a blue rectangles are similar to the query graph structurally."
        ],
        [
            "However, if the users need is to find equal current molecular structure for a given molecule, such as the components highlighted by the Replicant ghost."
        ],
        [
            "Here.",
            "The structural similarity search fails to find such results."
        ],
        [
            "However, local occurrence structures may be very important for some applications because it can decide some chemical properties."
        ],
        [
            "To address this problem, we propose a new problem of a correlation searching graph databases and the concept of correlation captures the underlying dependency between the objects and it is very well studied in many contexts such as blended basis, quantitive databases, multimedia databases, data."
        ],
        [
            "Streams and many more.",
            "However, there are some new challenges when applying correlation search in gradually basis due to the diverse nature."
        ],
        [
            "Of the graphs.",
            "The first challenge is its large search base.",
            "Each sub graph of a graph in database is a candidate and there are exponentially many sub."
        ],
        [
            "Graphs.",
            "And the second challenge is.",
            "Expensive crap operations such as subgraphs as amorphism testing it has been proved to be NP complete."
        ],
        [
            "So in our work, we propose the new problem of correlated graph search CGS.",
            "Using Pearson's correlation coefficient as a correlation match."
        ],
        [
            "Sure.",
            "Now we present an effective, inefficient, efficient solution, citysearch.",
            "Most specifically, we derive theoretical bonds for the support or curd occurrence probability of a candidate graph, and then based on these bonds, we propose to generate candidates from the projected database of the query graph.",
            "Furthermore, we developed 3 Hill Ristic rules to further applied on a candidate said to reduce the number of candidates, and therefore the search space."
        ],
        [
            "Before we define the correlation search program, we have to choose a correlation measure and in our work we use Pearsons correlation, efficient because it's popularly used as a major in many other contexts such as stream data and transition databases."
        ],
        [
            "The basis is the definition is given as follows, so essentially it is the covariance of two variables G1 and G2 representing the occurrence of these two graphs in database and divided their covariance divided by the product of the standard deviation."
        ],
        [
            "Intuitively, it measures the departure of two variables from its independence and its value falls within a range of minus one and one.",
            "The value of 0 indicates the independence and positive value indicates positive correlation and negative value in his negative correlation.",
            "And in our work we only focus on positive correlation."
        ],
        [
            "So here are our define our CGS problem.",
            "Given a graph databases DA correlation query graph Q and minimum correlation threshold Theta.",
            "The CGS problem is to find the set of graphs whose Pearson's correlation coefficient with Q is at least."
        ],
        [
            "Data.",
            "The most essential step of the solution is to generate the candidates.",
            "So first we derive the bonds for the support of a candidate graph G as follows.",
            "So here we divide the lower bound on the upper bound."
        ],
        [
            "Based on these two bounds, we can a possible solution is to generate candidates by mining the set of frequent subgraphs from the database using the above 2 bonds as fresh holes.",
            "So we call this approach range because each sub graph each graph in the candidate set actually having support ranging between these."
        ],
        [
            "Two bonds.",
            "However, the range approach has some drawback because all existing after money algorithms generate graphs with higher support before those with lower support.",
            "So as a result, the upper bound cannot help to facilitate the mining process.",
            "So the range approach is not efficient and not scalable, especially when the database is very large or the lower bound is very low."
        ],
        [
            "So to address this problem with further, develop the bond of the joint support of the candidate graph and paragraph in in its projected database.",
            "So the bar the lower bound is given as follows."
        ],
        [
            "Based on response, we propose to generate the candidates from the projected database by mining the set of frequent subgraphs from projected database using this bomb."
        ],
        [
            "So compare with the range query.",
            "The projected database is much smaller than the whole database and the minimal support thresholds use is much."
        ],
        [
            "Tired.",
            "As a result, that candidate generation from projected database is very efficient and Moreover, but candidate said obtained is very small, so it can significantly reduce the search space."
        ],
        [
            "Moreover, we have developed three heuristic rules to be further applied on the candidate set.",
            "The first humoristique rule is to identify the graphs that are guaranteed to be answers selected.",
            "All super graphs of the query graph in the candidate set are in the answer set, so we can directly include them into."
        ],
        [
            "The answer set.",
            "And the second and third, your risk rules is used to get rid of the false positives in the candidate set.",
            "That means if a graph G is not in the answers that we can put in all its sub graphs that have the same support as Q or has support less than his equation in the."
        ],
        [
            "Put it in the base.",
            "So here we present our CGS algorithm.",
            "First we obtain the projected database of the query graph and then we mindset of candidates from the projected database using the bong as the minimum support thread hole.",
            "And finally we check the correlation condition for each candidate.",
            "And at the same time we've refined the candidate set by the fray or your risk."
        ],
        [
            "Gross.",
            "Now I will choose show some performance valuation for the real data set.",
            "We use the 100K compound structures of cancer and AIDS data and we also generate for candidates set As for synthetic datasets for 100K graphs by varying the average number of edges from 40 to 100.",
            "In our implementation we use the SG index to obtain the projected database and we also use G Spain to mine.",
            "The frequent subgraphs for the generation of candidates.",
            "Since there is no existing work on the correlation search in graph databases, we use the range approach we discussed earlier as the baseline of our comparison."
        ],
        [
            "Let's see the effect of candidate generation when we bearing when we very low query support.",
            "So.",
            "From the figure which we find that the decision searches two orders of magnitude faster than the range approach and from the right figure which we find candidates are produced by the city, search is much closer to the the answer set is over an order of magnitude smaller than the candidates are produced by the."
        ],
        [
            "Range approach.",
            "For the effect of graph size, we find the city searches up to orders of magnitude faster and consumes 41 times less memory than range approach.",
            "And Moreover, the city search is much more stable and resource use usage than the range approach."
        ],
        [
            "So in our work, we propose the problem of correlated graph search by taking into account the occurrence pop distribution of graphs using the Pearson's correlation coefficient and then we propose our mining algorithm searches search that has three key components, the theoretical bonds for the support of candidates that candidate generation from the projected database and three here Ristic rules.",
            "Our experiments show verify at the candidate generation from projected database and not realistic rules are very effective and efficient and compare with the range ehlerange approach messages search is orders of magnitude faster and it achieves very stable performance for various parameters."
        ],
        [
            "That's all for my presentation.",
            "Thank you for your attention.",
            "Got a question?",
            "Do you have any sense of what effect varying graph structure would have on the performance of your algorithm?",
            "Actually, for this problem that most made the major factor is the query support.",
            "So if, uh, so if you use issue a query graph if its support is smaller than the candidates, that can be very large, so if it's large then that means it supports more.",
            "So the candidates that produces much smaller.",
            "Other questions.",
            "This guy here.",
            "So I was wondering.",
            "Actually, our work is focused, focused on labeled graph, but it can be easily extended to the unlabeled graph.",
            "So the major difference between the label and unable in our work is just the process of subgraph isomorphism testing.",
            "So you can simply change the labeling information there and the whole framework applies in some way.",
            "Have another, how important was the choice of Pearson's correlation coefficient?",
            "But you would be using almost any measure of correlation.",
            "So in this work, we, oh, we actually use pure sense, but we actually are working on some extensions and we have tried several other correlation measures and actually applies.",
            "So the framework the solution applies for our correlation measure as well.",
            "Choice for that yeah, yeah.",
            "So the question is mining for graph inferences overall.",
            "After not, whether these two structures occur, but whether they occur more often, we would expect that occur.",
            "Type.",
            "So do you have?",
            "No, we only focus on the the occurrence distribution overall, so we don't actually detects a distinguish between significant occurrence or insignificant occurrence.",
            "Speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning everyone.",
                    "label": 0
                },
                {
                    "sent": "I'm eating Curry from Hong Kong University of Science and Technology.",
                    "label": 1
                },
                {
                    "sent": "Copy of my presentation is correlation search.",
                    "label": 0
                },
                {
                    "sent": "The topic of my presentation is correlation.",
                    "label": 0
                },
                {
                    "sent": "Search in graph databases and this is a joint work with James Strang and my supervisor with.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is the outline of my talk.",
                    "label": 0
                },
                {
                    "sent": "First hour give introduction and I will define a problem and present our solution and then I will show some performance evaluation and finally the conclusions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graphs are popularly used to model objects and relationships, and it is everywhere in various scientific domains such as our informatives chemistry, social science and many more.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Existing research on graph search.",
                    "label": 1
                },
                {
                    "sent": "Many focus on structural similarity.",
                    "label": 0
                },
                {
                    "sent": "Search letters to find the graphs, structural SMS or similar to a given query graph.",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "However, in some applications, structure similarity search may not be applicable.",
                    "label": 1
                },
                {
                    "sent": "There see the following application scenario.",
                    "label": 1
                },
                {
                    "sent": "The graph database contains a set of molecules.",
                    "label": 0
                },
                {
                    "sent": "Molecular structures, such as the three graphs ABC here and the figure D shows an example query.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For structural similarity search you will retain this tree graphs because the substructures in a blue rectangles are similar to the query graph structurally.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, if the users need is to find equal current molecular structure for a given molecule, such as the components highlighted by the Replicant ghost.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "The structural similarity search fails to find such results.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "However, local occurrence structures may be very important for some applications because it can decide some chemical properties.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To address this problem, we propose a new problem of a correlation searching graph databases and the concept of correlation captures the underlying dependency between the objects and it is very well studied in many contexts such as blended basis, quantitive databases, multimedia databases, data.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Streams and many more.",
                    "label": 0
                },
                {
                    "sent": "However, there are some new challenges when applying correlation search in gradually basis due to the diverse nature.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of the graphs.",
                    "label": 0
                },
                {
                    "sent": "The first challenge is its large search base.",
                    "label": 1
                },
                {
                    "sent": "Each sub graph of a graph in database is a candidate and there are exponentially many sub.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graphs.",
                    "label": 0
                },
                {
                    "sent": "And the second challenge is.",
                    "label": 0
                },
                {
                    "sent": "Expensive crap operations such as subgraphs as amorphism testing it has been proved to be NP complete.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our work, we propose the new problem of correlated graph search CGS.",
                    "label": 0
                },
                {
                    "sent": "Using Pearson's correlation coefficient as a correlation match.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sure.",
                    "label": 0
                },
                {
                    "sent": "Now we present an effective, inefficient, efficient solution, citysearch.",
                    "label": 0
                },
                {
                    "sent": "Most specifically, we derive theoretical bonds for the support or curd occurrence probability of a candidate graph, and then based on these bonds, we propose to generate candidates from the projected database of the query graph.",
                    "label": 1
                },
                {
                    "sent": "Furthermore, we developed 3 Hill Ristic rules to further applied on a candidate said to reduce the number of candidates, and therefore the search space.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Before we define the correlation search program, we have to choose a correlation measure and in our work we use Pearsons correlation, efficient because it's popularly used as a major in many other contexts such as stream data and transition databases.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The basis is the definition is given as follows, so essentially it is the covariance of two variables G1 and G2 representing the occurrence of these two graphs in database and divided their covariance divided by the product of the standard deviation.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Intuitively, it measures the departure of two variables from its independence and its value falls within a range of minus one and one.",
                    "label": 1
                },
                {
                    "sent": "The value of 0 indicates the independence and positive value indicates positive correlation and negative value in his negative correlation.",
                    "label": 1
                },
                {
                    "sent": "And in our work we only focus on positive correlation.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here are our define our CGS problem.",
                    "label": 0
                },
                {
                    "sent": "Given a graph databases DA correlation query graph Q and minimum correlation threshold Theta.",
                    "label": 1
                },
                {
                    "sent": "The CGS problem is to find the set of graphs whose Pearson's correlation coefficient with Q is at least.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Data.",
                    "label": 0
                },
                {
                    "sent": "The most essential step of the solution is to generate the candidates.",
                    "label": 0
                },
                {
                    "sent": "So first we derive the bonds for the support of a candidate graph G as follows.",
                    "label": 0
                },
                {
                    "sent": "So here we divide the lower bound on the upper bound.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on these two bounds, we can a possible solution is to generate candidates by mining the set of frequent subgraphs from the database using the above 2 bonds as fresh holes.",
                    "label": 0
                },
                {
                    "sent": "So we call this approach range because each sub graph each graph in the candidate set actually having support ranging between these.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Two bonds.",
                    "label": 0
                },
                {
                    "sent": "However, the range approach has some drawback because all existing after money algorithms generate graphs with higher support before those with lower support.",
                    "label": 1
                },
                {
                    "sent": "So as a result, the upper bound cannot help to facilitate the mining process.",
                    "label": 1
                },
                {
                    "sent": "So the range approach is not efficient and not scalable, especially when the database is very large or the lower bound is very low.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to address this problem with further, develop the bond of the joint support of the candidate graph and paragraph in in its projected database.",
                    "label": 0
                },
                {
                    "sent": "So the bar the lower bound is given as follows.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Based on response, we propose to generate the candidates from the projected database by mining the set of frequent subgraphs from projected database using this bomb.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So compare with the range query.",
                    "label": 0
                },
                {
                    "sent": "The projected database is much smaller than the whole database and the minimal support thresholds use is much.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tired.",
                    "label": 0
                },
                {
                    "sent": "As a result, that candidate generation from projected database is very efficient and Moreover, but candidate said obtained is very small, so it can significantly reduce the search space.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Moreover, we have developed three heuristic rules to be further applied on the candidate set.",
                    "label": 0
                },
                {
                    "sent": "The first humoristique rule is to identify the graphs that are guaranteed to be answers selected.",
                    "label": 1
                },
                {
                    "sent": "All super graphs of the query graph in the candidate set are in the answer set, so we can directly include them into.",
                    "label": 1
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The answer set.",
                    "label": 0
                },
                {
                    "sent": "And the second and third, your risk rules is used to get rid of the false positives in the candidate set.",
                    "label": 0
                },
                {
                    "sent": "That means if a graph G is not in the answers that we can put in all its sub graphs that have the same support as Q or has support less than his equation in the.",
                    "label": 1
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Put it in the base.",
                    "label": 0
                },
                {
                    "sent": "So here we present our CGS algorithm.",
                    "label": 0
                },
                {
                    "sent": "First we obtain the projected database of the query graph and then we mindset of candidates from the projected database using the bong as the minimum support thread hole.",
                    "label": 1
                },
                {
                    "sent": "And finally we check the correlation condition for each candidate.",
                    "label": 0
                },
                {
                    "sent": "And at the same time we've refined the candidate set by the fray or your risk.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Gross.",
                    "label": 0
                },
                {
                    "sent": "Now I will choose show some performance valuation for the real data set.",
                    "label": 0
                },
                {
                    "sent": "We use the 100K compound structures of cancer and AIDS data and we also generate for candidates set As for synthetic datasets for 100K graphs by varying the average number of edges from 40 to 100.",
                    "label": 1
                },
                {
                    "sent": "In our implementation we use the SG index to obtain the projected database and we also use G Spain to mine.",
                    "label": 0
                },
                {
                    "sent": "The frequent subgraphs for the generation of candidates.",
                    "label": 0
                },
                {
                    "sent": "Since there is no existing work on the correlation search in graph databases, we use the range approach we discussed earlier as the baseline of our comparison.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's see the effect of candidate generation when we bearing when we very low query support.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "From the figure which we find that the decision searches two orders of magnitude faster than the range approach and from the right figure which we find candidates are produced by the city, search is much closer to the the answer set is over an order of magnitude smaller than the candidates are produced by the.",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Range approach.",
                    "label": 0
                },
                {
                    "sent": "For the effect of graph size, we find the city searches up to orders of magnitude faster and consumes 41 times less memory than range approach.",
                    "label": 1
                },
                {
                    "sent": "And Moreover, the city search is much more stable and resource use usage than the range approach.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in our work, we propose the problem of correlated graph search by taking into account the occurrence pop distribution of graphs using the Pearson's correlation coefficient and then we propose our mining algorithm searches search that has three key components, the theoretical bonds for the support of candidates that candidate generation from the projected database and three here Ristic rules.",
                    "label": 0
                },
                {
                    "sent": "Our experiments show verify at the candidate generation from projected database and not realistic rules are very effective and efficient and compare with the range ehlerange approach messages search is orders of magnitude faster and it achieves very stable performance for various parameters.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's all for my presentation.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 1
                },
                {
                    "sent": "Got a question?",
                    "label": 0
                },
                {
                    "sent": "Do you have any sense of what effect varying graph structure would have on the performance of your algorithm?",
                    "label": 0
                },
                {
                    "sent": "Actually, for this problem that most made the major factor is the query support.",
                    "label": 0
                },
                {
                    "sent": "So if, uh, so if you use issue a query graph if its support is smaller than the candidates, that can be very large, so if it's large then that means it supports more.",
                    "label": 0
                },
                {
                    "sent": "So the candidates that produces much smaller.",
                    "label": 0
                },
                {
                    "sent": "Other questions.",
                    "label": 0
                },
                {
                    "sent": "This guy here.",
                    "label": 0
                },
                {
                    "sent": "So I was wondering.",
                    "label": 0
                },
                {
                    "sent": "Actually, our work is focused, focused on labeled graph, but it can be easily extended to the unlabeled graph.",
                    "label": 0
                },
                {
                    "sent": "So the major difference between the label and unable in our work is just the process of subgraph isomorphism testing.",
                    "label": 0
                },
                {
                    "sent": "So you can simply change the labeling information there and the whole framework applies in some way.",
                    "label": 0
                },
                {
                    "sent": "Have another, how important was the choice of Pearson's correlation coefficient?",
                    "label": 0
                },
                {
                    "sent": "But you would be using almost any measure of correlation.",
                    "label": 0
                },
                {
                    "sent": "So in this work, we, oh, we actually use pure sense, but we actually are working on some extensions and we have tried several other correlation measures and actually applies.",
                    "label": 0
                },
                {
                    "sent": "So the framework the solution applies for our correlation measure as well.",
                    "label": 0
                },
                {
                    "sent": "Choice for that yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "So the question is mining for graph inferences overall.",
                    "label": 0
                },
                {
                    "sent": "After not, whether these two structures occur, but whether they occur more often, we would expect that occur.",
                    "label": 0
                },
                {
                    "sent": "Type.",
                    "label": 0
                },
                {
                    "sent": "So do you have?",
                    "label": 0
                },
                {
                    "sent": "No, we only focus on the the occurrence distribution overall, so we don't actually detects a distinguish between significant occurrence or insignificant occurrence.",
                    "label": 0
                },
                {
                    "sent": "Speaker again.",
                    "label": 0
                }
            ]
        }
    }
}