{
    "id": "sjlme7my2ubtwyev6qt4eheyppdp7zo3",
    "title": "A Data Driven Approach to Diagnosing and Treating Disease",
    "info": {
        "author": [
            "Eric Schadt, Icahn Institute for Genomics and Multiscale Biology, Icahn School of Medicine at Mount Sinai"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_schadt_treating_disease/",
    "segmentation": [
        [
            "It's a pretty striking con."
        ],
        [
            "Price I was just at the Deepack Chopra Foundation for Healing giving.",
            "A talk there and now shifting into to this mode, so I'm going to try to get oriented here and I'm glad I have longer than 30 seconds.",
            "So the thing we have been trying to tackle at Mount Sinai's, so think about you all the transformation that's going on in the big data world and how that can potentially impact human health.",
            "But you have to be able to penetrate that.",
            "People who are practicing the health and doing the diagnosis and treating a patient's.",
            "And one thing I've learned are the type of orthodoxies that are held in this type of arena.",
            "And if you think back about what what is the orthodoxy?",
            "These are long held core beliefs.",
            "That may no longer be true or applicable in the current landscape, and so makes you know that landscape ripe for disruption, but on the other hand, if that disruption doesn't occur, it can be very."
        ],
        [
            "The limiting and of course we see this not just in medicine, but throughout human history.",
            "Really.",
            "You know whether it's Mr. Warner talking about in 1927 who's ever going to want to hear an actor talk and a movie or Mr Watson talking about a world market for maybe 5 computers.",
            "These are the types of narrow thinking, the type of orthodoxies we come to accept and can limit creativity and innovation."
        ],
        [
            "So the question really before us is his medicine really poised for a fundamental transformation?"
        ],
        [
            "And we don't have to look far and you guys you know perhaps better experts than myself at this big data revolution.",
            "And sensors are a big part of that revolution that could have an impact on medicine.",
            "And again, you know seeing the type of things happening, whether it's team Oracle with the big data at America's Cup with their boat that's outfitted with you no more than 300 sensors measuring 3000 different variables at a rate of around 10 Hertz, generating around 300 gigabytes of day, right?",
            "Real time processing of that information too.",
            "You better tune the boat and the crew to optimize performance.",
            "Actually dump those servers off the boat each day and gets picked up by another boat and they do more crunching on that data to improve performance for the next day we see."
        ],
        [
            "The same sort of thing going on with team Honda at the Indy Indy races.",
            "Again 200 sensors monitoring all aspects of the car and the driver you know to again tune performance.",
            "Generating around a GB of data per lap and again tuning in real time as the race is going on."
        ],
        [
            "But what happens?",
            "What about the human machine?",
            "You know something we should care.",
            "If I have bugs everywhere up here.",
            "Flying down my shirt.",
            "So what happens?",
            "What about the?",
            "You know, the human machine?",
            "Probably something we all care deeply about and want to see tuned and optimized for performance.",
            "And So what do we do in the great state of New York, right?",
            "When you have a newborn, what happens to that newborn in the hospital while they get a little heel prick and they smear some blood on a piece of paper?",
            "And then they send that paper through Snail Mail to Albany where they score a few variables, and those variables are important for determining whether you have something pretty horrific going on in your.",
            "System that could be corrected, but it's a pretty limited amount of information.",
            "They score that and then you're pushed out and you never come back to that hospital last year, in some catastrophic state of decline.",
            "So the question is, can we start optimizing the human system, increasing human well being through the same type of censoring and data integration that we see happening with the non human machines of?"
        ],
        [
            "There are lots of different type of devices now coming flooding into the market.",
            "Wearable type devices that are angling to do exactly what's happening with the team.",
            "Honda or the team Oracle for the Americas Cup, the.",
            "Scanadu, one of my favourites.",
            "One of the leaders for the Tricorder X Prize, you know, were handheld device.",
            "You can waive it over the body and its measuring up to 10 different physiological traits on the."
        ],
        [
            "System to help understand Watts."
        ],
        [
            "Going on in the system, we of course have the printable tattoo biosensors.",
            "Some of those Bluetooth enabled to measure different physiological parameters of the system on a real time lanja tude.",
            "No basis."
        ],
        [
            "Even those babies, Pixie scientific create has the sensors now embedded in the diapers of babies too, so you can better understand what's coming out of that little system."
        ],
        [
            "And you know, companies like Farrah Nose popping up really transforming how we can carry out a wider array of medical type tests on your system.",
            "So here the revolution is one of requiring very, very small amounts of blood.",
            "Unlike, you know what you would have to give in the hospital with a 10 mil tube here.",
            "It's micro amounts of blood you can go into Walgreens.",
            "You give that little sample of blood order from the menu.",
            "What kinds of tests you want done in for a pretty small amount of money, you know?",
            "Start learning more about your current state of health."
        ],
        [
            "And of course we have team NSA that's providing lots of different avenues of data collection and aggregation that could inform."
        ],
        [
            "On our systems and one place we see that playing out here even in New York City is at the end why you Center for urban Science and progress where they're taking in a lot of the different data streams that are available from the New York City government where whether it's traffic flow or electricity usage or or pollution, pollen counts, and so on.",
            "All of that information sort of now accessible to perhaps better understand the environment in which you're living.",
            "So all of these different dimensions of data now possible to score on a real time lanja tude.",
            "No basis."
        ],
        [
            "And of course, one of the Holy Grails to all of this is you know, how do you make sense of it?",
            "How do you integrate all that information?",
            "Make the predictive models and provide something meaningful back to the people who who would want to base decisions.",
            "Whether it's a, whether it's a consumer patient or a medical doctor or researcher or a payer.",
            "All the hierarchy of users that we have in the mix.",
            "And what's the right way to present that type of information to facilitate actual decision making.",
            "And of course in the medical arena, that's quite important, right?",
            "All of this big data, all of the different.",
            "Tools available now to better inform your system you aren't going to be very enabling from a human Wellness standpoint.",
            "If your physician in the medical community isn't enabled to understand all of that."
        ],
        [
            "So the main theme here is one of lots of different types of data.",
            "How can we integrate it?",
            "Generate predictive models that you know as somebody walks into, say, a Medical Center, physicians office, or even if you're sitting at home, you know enabling those models to better diagnose and treat whatever condition you."
        ],
        [
            "Going on so again in addition to all the different types of wearable that wearable devices, the environmental context we can ask say we also have deep deep data now available at the individual level on from the DNA to RNA to microbiome, to the functioning of your immune system, to your electronic medical records, and so on.",
            "So a lot of additional information in fact far deeper information available then you can currently collect from wearable devices or the environmental sensing that goes on."
        ],
        [
            "And the main aim is one of how do we take all of that information?",
            "Build these predictive models and connect the molecular biology to the Physiology, right?",
            "We ultimately want to make perturbations right, adjust those molecular networks in ways that manifest in changes in the Physiology of the system, right?",
            "We want to steer the system away from pathophysiology of disease and into a more well state.",
            "How do you?",
            "How do you make those kinds of connections?",
            "And if there's one thing one reason I believe?",
            "Why current pharmaceutical and biotechnology companies have largely failed to live up to the hype of molecular biology?",
            "Sequencing the genome and all the discoveries and making new therapeutics that help people whi that paradigm hasn't worked out as well as we thought it would is again this very reductionist approach.",
            "That said, if we understand every protein and how it functions, then we're going to be able to treat every single disease and that's turned out to be completely false because it's unless you're able to integrate the information, understand it more holistically and how it matches up to the Physiology.",
            "You're just not going to have the.",
            "Kind of benefit.",
            "Save a few."
        ],
        [
            "Examples, so how we view the information is very important against.",
            "I feel like I'm sort of preaching to the choir little bit here because you guys have pioneered a lot of the innovative ways of thinking.",
            "But there was a pretty neat behavioral study that was carried out that I think well exemplifies how we can become really constrained in our thinking and not thinking outside the box and how it affects you.",
            "Know, the way we look at data presented to us and how we solve problems with that.",
            "So here's a problem where two groups were.",
            "Provided with the exact same information, but only in slightly different presentation.",
            "So same data presented to two groups in the top group they were presented.",
            "So the problem these groups had to solve where to take this candle, fix it to the wall, light the candle without wax dripping on the table or the wall.",
            "So that was the problem.",
            "To solve, Group One was presented with the tools available to solve this problem with attacks inside the box and group Two was provided with the same information, but the tax were outside of the box."
        ],
        [
            "An astonishingly group 2 on average came up with a solution twice as fast as Group One, just based on that very subtle presentation of the information.",
            "So how we're presented with data how we perceive it, and how we act on it can have a big impact on our ability to solve."
        ],
        [
            "Problems and so.",
            "It's almost as if the deeper the grooves in our brains become, the more narrow our thinking becomes, the less able we are to innovate or to think outside the box."
        ],
        [
            "And of course, this again isn't constrained to anyone area.",
            "We've seen lots of areas innovate their way out of this sort of narrow thinking.",
            "And here a few of my favourites.",
            "My probably ultimate favorite is BMW.",
            "I'm kind of a speed freak, so I drive an M5 and BMW learned that BMW had basically want to help advance the state of the automobile, improve the performance so they SAT engineer with consumers driving around to understand better what the consumer wanted.",
            "And so, thinking you know, is it better acceleration, better breaking, better cornering, like what are the parameters that the customers are really interested in and to their great surprise and shock the number one concern had nothing to do with the performance of the automobile.",
            "It had to do with concerns about causing damage to the car, pulling into or backing out of parking spaces.",
            "And so is that sort of insight again garnered from very objective assessment of what the consumer wanted.",
            "That led to the Park Assist features that BMW pioneered.",
            "And of course many other such examples.",
            "But again, what help exemplifies what we have to do to sort of break out of our want to tell stories and be very, very narrow once we become expert."
        ],
        [
            "So in the biology field, not unlike all the great talks we're hearing today and in different areas, the aim is taking all these streams of data and applying objective data mining approaches to it to construct these predictive models and the way I like to visualize this is through an animation where we have molecular dimensions that are being."
        ],
        [
            "Scored in populations, DNA and RNA and protein metabolites, and we see that these different variables are not connected in simple, linearly ordered pathways.",
            "They're connected and highly nonlinear networks that define the biological processes, right that if disrupted, cause disease and those networks don't act in isolation either, right?",
            "They act in concert in a network of networks over the entire system.",
            "So if we want to understand the complexity of the system, we need to understand the complexity of those types of molecular networks.",
            "And once we get a handle on that.",
            "We can start resolving down to, you know, the network level for understanding disease as opposed to the single gene view where we can look at how disruptions in one subnetwork propagate through in a given cell or tissue type to affect other subnetworks.",
            "And of course, we're more complicated right then, a single cell or a single tissue.",
            "So we're really interested in is how to do this sort of modeling over the entire system and look at how do changes in one subnetwork in one tissue propagate through to other sub networks and other tissues to have some.",
            "Act on on your physiological state, and then once we have this sort of a model, right now we can learn about biology by querying this type of model directly."
        ],
        [
            "Of course, to carry this out as you all know you need, you know it's a nontrivial computational problem, so we've had to sort of beef up the way we think about big data processing in a Medical Center arena.",
            "You know, we've been able to attract guys to help us solve this kind of problem, like Jeff Hammerbacher, who you may know from, you know, Cloudera, and that amazing success story in a pretty short amount of time.",
            "But bringing him on board to build out the right infrastructures to manage the big data and do the kind of computations we need to build.",
            "The models."
        ],
        [
            "And I had a little problem with some of the flash animations playing on the machine, so these animations aren't going to play, but the way we think about you know the problems we're trying to solve and inferring causality from the type of data we can collect on human systems at the molecular and physiological levels is one of resolving.",
            "Resolving correlation structures that we observed by sampling population.",
            "So what you should be seeing here is a graph of sampling from a population and seeing two variables that are correlated as you sample through the population.",
            "Of course you want to know if there is."
        ],
        [
            "That's correlation whether there's a cause effect relationship between these and then the classic biology you should be seeing another animation.",
            "I think these are the only two animations that won't show, but so you have these two traits that you know are correlated.",
            "You hypothesize that one is causing changes in the other, so this is a classic biology approach and what you do is you perturb you, make an artificial perturbation on the effector variable.",
            "You either knock it down, or you chemically perturb it, or you overexpress it, you.",
            "Perturb it in some way and then you look for a subsequent response and the.",
            "In the dependent very and the hypothesize dependent variable.",
            "And if you see this affect in a series in a time sequence, you can make the causal inference.",
            "So that's how it's been done in the past.",
            "But what were?"
        ],
        [
            "Have sort of pioneered is a way to leverage not the artificial perturbations of biology where you're knocking a gene down to the ground or your overexpressing it at 10,000 times the normal levels.",
            "But in our case we're leveraging naturally occurring DNA variations as the perturbation source resolve causal structures amongst these correlated variables, number of papers written on this and the way the idea works is think about clinical trials where your.",
            "The beauty of a clinical trial and establishing causality.",
            "It's randomization.",
            "It's the ability.",
            "It's the fact that you're randomizing people do a treatment arm or placebo arm, and then you're running the test and seeing whether whether there's a difference between the treatment and the placebo, and if there is given that randomization, you can make the causal inference.",
            "What we can do the same thing, and?"
        ],
        [
            "Biology and that we can leverage the genetic impacts that are occurring on all these different variables.",
            "So will track you know what are the genetic perturbations that are affecting these variables?",
            "Apply some mathematics and then given those genetic impacts, those perturbations, we can start making causal inferences between the variables, just like we do in a clinical trial.",
            "We can apply that systematically over the whole space of variables to get to these networks.",
            "And why does that work?",
            "What is the analogue of the randomization mechanism of a clinical trial in biology?",
            "It's the random assortment of chromosomes.",
            "The madilian segregation of chromosomes during cell divisions.",
            "That gives us that power.",
            "That's a random event.",
            "It randomly assort's different levels that cause these variables to change, just like the clinical trials and so we can employ the same sort of reasoning to make the cause."
        ],
        [
            "Well, in France we can also integrate this type of thinking with time series based information as well.",
            "So longitudinal type data we can integrate with the DNA perturbation based information to again make these predictive models."
        ],
        [
            "This is getting to the point where we are now starting to understand sort of holistic holistic Lee systems being modeled in at every aspect of their molecular being, and one of the guys in my group, Jonathan Car had a paper in cell a year or so ago, presenting the first ever fully computational model for a living system based on all the different molecular dimensions of that system.",
            "From the DNA to the DNA replication to the DNA transcription.",
            "To the translation to the protein state modification to the environmental context, an influx of metabolites into the system and influx out of the system.",
            "All of those different aspects of the system were computationally modeled and then he was able to run that model and simulate a cell behavior and systematically query the system perturbing different genes to learn completely new biology, and one of the things they present."
        ],
        [
            "In the cell paper was was this sort of thing.",
            "We're on the upper left.",
            "You're seeing different cells being simulated overtime, and you're looking at cell growth cell divisions as the phenotype.",
            "There are looking at as an output of the model.",
            "Again, all the different parameters of the system being modeled in the middle.",
            "You see the replication.",
            "The synthesis of the DNA, the transcription, the translation, the protein states the metabolic flux, and in the upper right what you're seeing is the cell actually growing and ultimately dividing.",
            "And this is all being driven completely by the model, right?",
            "There's no trickery here.",
            "It's completely driven by the model in given perturbations that they induced artificially on the different genes and combinations of genes came up with completely novel insights on cell division that had never been known before.",
            "And then of course validated those to show experimentally that they did have the impact on on the cell division.",
            "So this day is coming in biology, where we will have these highly accurate predictive models for this.",
            "This was I should have said.",
            "The beginning was a pretty simple living system, is a very small bacterium with only 600 genes.",
            "So representing, you know, sort of the bottom of the complexity chain, but at least you know demonstrating the first inklings of this sort of power coming to biology.",
            "Just as it occurs in all other complex disciplines.",
            "Whether it's physics or climatology or quantitative finance, or many engineering disip."
        ],
        [
            "Guns.",
            "So the idea is one of moving you have transforming.",
            "We're seeing this wholesale transformation in biology that's going to impact medicine.",
            "Where yesterday we were in this very reductionist mode of looking at single genes, single proteins, single disease conditions, and trying to resolve the complexity of disease in living systems.",
            "In this way, today we have the technologies to get away from that reduction's view and into a more holistic representation of this system.",
            "We have technologies that can sequence entire genomes entire.",
            "Transcriptomes, we're getting closer to systematic, comprehensive surveys of the proteome, and of course, the the Phenome as well.",
            "Again, think of all the different kinds of sensors and stuff that can monitor physiological states of the system so that for tomorrow it's really going to be about the integration of these data and how to make predictions based on that that affect decision making.",
            "Whether you're at the lab bench or in the clinic."
        ],
        [
            "And one of the ways we've done this, I'll take you through a few examples where this is already playing out in complex diseases is with inflammatory bowel diseases, was one of the first where we were able to take 163 jeans that were identified in the big genetic studies.",
            "So again, the big genetic studies are looking at whole genome genotyping or sequencing to identify what are the key variance.",
            "The key changes in genes that cause these disease conditions in the human population.",
            "So from the big study they did on.",
            "50 to 70,000 individuals they came up with 163 loci roughly analogous to genes that were variations in those low side were causing IBD in the human population, and this is representing maybe 10% or so of the full set of factors that cause IBD in the human population.",
            "But with those 163, what did they know they didn't necessarily know what the gene was, and even if they knew what the gene was, they didn't know is the gene activated or suppressed.",
            "From the standpoint of disease.",
            "They didn't know necessarily what's the context in which that gene is operating in, what pathways that operating in weather the networks that pathway operates in, and so on.",
            "So you're not left with much information to help drive novel therapeutics or Diagnostics.",
            "From the standpoint of impacting human well being, we're able to do is take the kinds of models I just showed you that we're building and project this data onto those models to see whether the models can help organize the data in ways that lead to novel discoveries and insights."
        ],
        [
            "So we project this information onto one of the network so we have a series of networks over lots of tissues and lots of conditions and different populations.",
            "And this was one of the networks.",
            "So what you're seeing here is a is a probabilistic causal network.",
            "The blue and pink nodes are DNA variations that cause disease or affect molecular activity, or their molecular activity variables or their clinical variables that reflect physiological States and the green are the causal edges.",
            "Between all these variables, so it's not very informative to look at it in this way.",
            "But one thing to take note of are the pink nodes.",
            "That's the projection of those 163 loci into this particular network.",
            "If the network was effectively random with respect, it wasn't really informing on those jeans that are causing IBD, then you'd expect this uniform distribution of those pink nodes over the entire network.",
            "But that's not what we see.",
            "What we see is a very very significant enrichment in a very specific subnetwork of this network.",
            "That's around 5 fold and rich for jeans at Harbor variants that cause IBD in the human."
        ],
        [
            "Population and when we zoom in on those pink nodes to try to understand some of the structure going on there.",
            "What we?",
            "Pull Out is a is this type of graph where.",
            "Here the big nodes are key driver genes.",
            "These are genes that we predict modulate the state.",
            "The activity state of the network, the jeans to the right of those key driver nodes are the most proxamol responders to the key drivers, so these are the things that are being moved around by the key drivers and then the guys to the right of that are sort of further downstream.",
            "Almost sensors of what's going on from the primary drivers and again the."
        ],
        [
            "Beauty of that sort of model is now we can start querying different nodes systematically in that model to understand which nodes are sort of the key to.",
            "From the therapeutic standpoint to make changes in the network that are going to going to ultimately impact the disease and favorable ways so we can go and systematically query all the genes in the network and at some nodes were going to find this type of behavior where we hit the node and we see that it systematically altering the state of that network and then we can understand whether it's systematically altering in a favorable weight.",
            "You know, away from disease and into Wellness, or is it maintaining this bad trajectory around disease so we can play this sort of game in silico much more quickly than we can by creating a knockout animal or an over expressing a gene in."
        ],
        [
            "So on."
        ],
        [
            "So we've done that for IBD to uncover completely novel genes that are driving not only the novel genes driving it, but what's the context in which they are operating.",
            "But we've also applied this to Alzheimer's disease and other pretty horrible disease that if we don't get a handle on in the next several years, is going to wreak great havoc on our health care system.",
            "I think it's 15 years to 20 years time.",
            "You know, the amount of money it will cost to treat everybody with Alzheimer's will.",
            "Consume the entire Medicare budget, so obviously not a sustainable path.",
            "So there's a big push on to really drill down and understand this disease at a deeper level to get to effective treatments or prevention strategies.",
            "But we do employ this."
        ],
        [
            "Same sort of strategy.",
            "There had a paper in cell last year on this, again where it's integrating lots of different information from brain, different brain regions and forming on the disease condition and comparing that to the normal nondemented states."
        ],
        [
            "And ultimately, getting to you know the same types of networks.",
            "I was just showing you for IBD, but here for Alzheimer's and the beauty here in this model that we had published in Cell was that the mechanisms that it was elucidating for driving Alzheimer's were completely like not plaque related, not related to presanella into a beta.",
            "All the effort that was going on in the drug discovery and research community focused on those mechanisms causing they thought were causing Alzheimer's.",
            "What we identified was it that the plaques maybe one dimension, but the micro glial cells in the brain, the immune system of the brain was actually playing a key driver role and that was something that was not appreciated, wasn't really being pursued.",
            "So again, completely novel insight.",
            "I won't claim that the methods employed were the best that you could do.",
            "I think many of the methods I've heard about here could be superior if applied to this type of problem, but it was the application of the of that type of modeling.",
            "Two really big data.",
            "That created completely novel insights on this disease that are now being very aggressively pursued from a pharmaceutical standpoint standpoint in biomarker standpoint as well.",
            "And basically what you're seeing here are the different subnetworks enriched for different types of disease are biological processes that are also in rich, just like IBD for jeans at harbor variants that cause Alzheimer's in the human population."
        ],
        [
            "And the most important key here, like if you want to be successful right in applying the fancy methods to the big data to generate these novel discoveries is you have to be iterated, iterating with experimentalists to prove that your predictions mean anything.",
            "So the ability to go in to systems in a very informed way and make these artificial perturbations not as a novel discovery engine.",
            "But it's a validation engine for what the modeling is telling you is just critically important, like you will not be successful, you will not have that kind of impact you could have.",
            "On you know these disease conditions if you're not doing this sort of iteration with the X."
        ],
        [
            "Aaron mentalists what was also pretty interesting about this network that we identified for Alzheimer's this network here."
        ],
        [
            "Is that it was nearly completely conserved with the network I just showed you for IBD.",
            "So pretty interesting that these disruptions going on in the gut in the intestine cause IBD and the population.",
            "But these disrupt same disruptions going on in the brain cause Alzheimer's.",
            "So this idea of things, you know, these diseases being independent events driven by independent players we see more and more as completely false, that the system is highly interconnected in that perturbations again in one part of the system can propagate through to other parts of the system the same sorts of processes being disrupted, causing a number of different diseases."
        ],
        [
            "And to validate that we had a paper recently in molecular systems biology where we went in sort of queried a bunch of different diseases with respect to this Alzheimer's IBD network we queried, you know, cardiovascular disease and diabetes and inflammatory pain and chronic obstructive pulmonary disease and asthma.",
            "And what were the other ones?",
            "Stroke, neuro pathic pain sarcopenia.",
            "12 different disease conditions.",
            "We queried.",
            "We generated had models for those diseases and experimental systems, mainly mice.",
            "We profiled the relevant disease tissue for each one of these diseases, and then we compared the molecular states of that disease condition to the wild type healthy state.",
            "And So what you're looking at in the in the heat map plot along the X axis are the different genes that make up that IBD Alzheimer's network and on the Y axis is the different disease models and what you can see from the different disease models across these sets of genes is that the expression.",
            "Changes are super consistent, so we now have locked on to this particular disease based network is impacting a very very wide spectrum of diseases in the human population and that modulating this particular network could have tremendous benefit to human Wellness because it predisposes to so many different disease conditions.",
            "And, incidentally, this was the reason for talking at the Chopra Foundation for Wellness was what we see in their meditation studies when we look at people pre imposed meditation, their molecular states.",
            "And we project those changes onto the different networks.",
            "This is the very network one of the very networks that's perturbed in a favorable way through meditation.",
            "When we look at the placebo arm of clinical trials right, the placebo is the sugar pill.",
            "You shouldn't feel any effect from, but the placebo effect is very, very real.",
            "People absolutely benefiting from taking that sugar pill and feeling like they're going to be healed when we look at the responder's in a clinical trial on the placebo arm versus the non responders and look at the molecular states.",
            "Between them, this is the network that's being affected, so again, a pretty amazing network all involved in inflammation, immune response, defense response, wound healing.",
            "All of these defenses that are raised to prepare you for War battle in your day-to-day lives.",
            "You know if that network is more systematically controlled and suppressed, that it could have amazing benefit for human Wellness.",
            "So I think one of the challenges here it could be help us better understand the structure of this network in how to link it.",
            "Better to all the different diseases and how best to modulate it too.",
            "Achieve the best possible benefit."
        ],
        [
            "One of the ways we're doing that today is depicted in this graph, where the blue nodes in this network are now the genes that make up that what we call it.",
            "We had started calling it the Magic module just because it's so amazingly associated with so many different diseases, so the blue nodes are the special IBD Alzheimer's, all disease network and the green nodes are now all marketed drugs.",
            "All FDA approved compounds or natural products that occur in the foods that you eat or the things you apply on your skin.",
            "That are known or predicted to interact with the coding products of that of that blue network.",
            "And So what you can see is that the solution to how do we modulate this network isn't going to be simple.",
            "It's not going to be.",
            "Here is the drug that can push that network into this state.",
            "Everything that we're eating everything that we're taking or not.",
            "Everything but a big proportion of it is having some impact on this particular network.",
            "So how do we operate in that multivariate space where you have these multi factorial?",
            "Perturbations occurring to that network.",
            "How do you figure out in the context of that multifactorial perturbation state, how to further perturb it in a positive way?",
            "The pink nodes below the blue network graph are the all the different disease phenotypes and physiological states that are associated with disease that are impacted or changed by changes in that particular network.",
            "So you can see even in this sort of simplistic view, that it's a pretty complex.",
            "Interaction of things going on and you know to solve that is going to require."
        ],
        [
            "A lot of work, but the ultimate aim is one of being able to take that network, take subcomponents of the network, and start impacting decision making on individuals by mapping the perturbations that are occurring in an individual, whether it's genetic or environmental to the different molecular states that are can be disrupted by those those factors and start assigning each individual to the molecular states that are being altered in them to cause disease or bad Ness and then map those molecular states to the different treatments.",
            "Whether it's a small molecule drug or some behavior.",
            "Nation exercise or diet that can improve the state of that network or transform it from disease causing to disease protecting."
        ],
        [
            "One of the other dimensions I'll talk about that we've gotten into as well.",
            "In addition to all the molecular information and environmental context data, of course, is imaging data.",
            "The State of imaging, as many of you know, is reaching a pretty amazing point of very high resolution, almost now approaching the single cell single neuron level in brains.",
            "So how can we take imaging data and integrated?"
        ],
        [
            "As well, so one of the areas we're focused on in that area, again related to the brain or psychiatric disorders like schizophrenia and bipolar depression and so on.",
            "And here what we're looking at are just clustering of some of the region from structural MRI data, just clustering based on schizophrenia or not doing any supervision, just clustering over the MRI structural MRI data over all the different regions that are being profiled in the brain and seeing whether in an unsupervised way that can.",
            "Distinguish between cases and controls were the cases in this case or schizophrenia schizophrenics?",
            "And seeing that there was this ability to distinguish schizophrenia from controls based on that image Ng data."
        ],
        [
            "But the question is people who are being imaged aren't the same people whose brains are being sequenced, right?",
            "Because we've not approached the point yet, where people are willing to let us biopsy different parts of their brain while they're still alive.",
            "So there's a limitation in what we can do, so most of the studies on schizophrenia and other psychiatric disorders are based on postmortem tissue collected from brain, and the question is, how do we link up if we're profiling in one cohort, all the DNA, the RNA of the brain and so on in another cohort were.",
            "We're doing the imaging.",
            "How do we sort of bring those two dimensions together to create a more holistic model and one of the ways we're doing that is by linking these cohorts through the DNA dimension.",
            "So the factors that inform on schizophrenia from the image Ng and the factors that inform on the schizophrenia from the expression both have genetic variation components that we can decompose and then start mapping those guys based on the DNA connections and."
        ],
        [
            "And we can also integrate with the holistic body atlases that are being generated by a bunch of different groups, one of them for the brain.",
            "That's pretty extraordinary as the Allen Institute for Brain Sciences Brain Atlas generated on human where they basically took very small voxel sizes from the brain.",
            "All different regions of the brain and profiled each of those regions over a number of individuals to come up with this map of molecular activity that could be isolated to every single part of the brain.",
            "So we want to take those sorts of Maps.",
            "The molecular Maps from the Brain Atlas.",
            "And link them up to the in."
        ],
        [
            "Aging data and one of the ways we're doing that is working with this company.",
            "I Ozzy, who many of you might know a topological data analysis company that has pretty cool ways of visualizing of both making connections among high dimensional space data and then visualizing those in ways that can facilitate engage the human minds pattern recognition capabilities to make discovery.",
            "So what you're looking at here is a representation and one of the OSDI Maps.",
            "Of all the different gene expression activity from the Allen Brain Atlas, where each of the nodes in this case will represent a series of voxels, some number of voxels that are expressing genes that are similar among the different voxels, and then the edges between those nodes of course are representing again shared Co expression of genes over the different brain regions, and you can see it even sort of breaks out into a brain.",
            "Almost a brain like morphology.",
            "And what we can start doing here is isolating what genes are specifically transcribed in different regions."
        ],
        [
            "And then map that to the imaging data for the regions that are different between schizophrenia and controls.",
            "So what you're looking at here is the same type of Ayazi plot we were using here.",
            "Just the gross region data from structural MRI data.",
            "So we've now transformed this to the voxel level data for that.",
            "But what's being plotted here is the higher order region information and what's being highlighted with the arrows or regions of the brain than in the imaging data are different between cases and controls.",
            "But now we can map what genes are specific to those regions.",
            "Based on the map that we created with iOS D right?",
            "So hopefully that's making some sense.",
            "We can merge these two together to come up with."
        ],
        [
            "Genes that are being very specifically transcribed in a given region that's very different between cases and controls to come up with novel gene."
        ],
        [
            "That may be affecting this condition, and So what we can do is now take those genes that we found is expressed in the regions that are different between cases and controls project."
        ],
        [
            "Contour network models."
        ],
        [
            "I'll sort of skip through these."
        ],
        [
            "Project them onto our network models to understand where are those genes specifically located in the network and are they coherent with respect to what the network can say regarding their connectivity and causal drivers and so on.",
            "So here what we've done is projected a specific region of the brain where the imaging data is different between cases and controls.",
            "We've gotten jeans that are specific to that region from the Allen Brain Atlas and now projected those onto one of our brain networks that we used to study different.",
            "Brain related diseases.",
            "And now we've see light up here.",
            "This one subnetwork, that again is very enrich for jeans that are specific to the schizophrenia image in region.",
            "And when we blow up."
        ],
        [
            "That particular network to see how things are structured, we find that it's 40 fold enriched for jeans that harbor variants that cause schizophrenia in the human population.",
            "So again, these are all good validations.",
            "Not that this is the best model, but that we're locking on to the jeans that are most relevant in the region there most relevant in to affect schizophrenia.",
            "And now we can take this into the."
        ],
        [
            "On into the wet lab space to actually start validating and iterating with the experimentalist to refine our model and make it more and more accurate.",
            "Just like you would see done in physics or climatology, we can do the same thing the way we do that with various collaborators like Kristen Brennan at Mount Sinai is we basically contain."
        ],
        [
            "Fibroblast skin cells from schizophrenia patients or blood samples from those patients.",
            "We can reprogram those cells into stem cells.",
            "We can then differentiate those stem cells into neurons, some of them becoming very advanced in age.",
            "So not just representing Fiedel sort of neuron behavior, but more aged like neurons, in get to the point."
        ],
        [
            "We're at 12 weeks after we differentiate the stem cells into neurons.",
            "They have all the electrophysiology active just like your working brain does and we can start studying all of these physiological features on a given patient.",
            "But in the Petri dish right?",
            "We don't need to be operating in the brain.",
            "We can be looking at that patient in the Petri dish because that neuron came from the same genetic background that they have, and that neuron also maintains a lot of the memory that's going on within a given individual.",
            "The epigenetic memory.",
            "So it's a pretty cool.",
            "Way too to iterate very rapidly and so how do we do that?",
            "How do we work with this system to iterate rapidly with the model?"
        ],
        [
            "Well, we follow this sort of paradigm where we have the network that you see.",
            "So first of all we have all the data that we're integrating in ways like you guys do.",
            "Building these predictive models.",
            "The different predictive models can represent different subtypes of the disease, and they don't have to just represent disease.",
            "They can represent Wellness.",
            "They can represent areas of toxicity that drugs we know if drugs hit, these regions are going to cause toxicity in the system, so we can have this map and now what we?",
            "Do is we can have this high throughput screening type assay where remember the different neurons were taking from patients from their stem cells.",
            "We can put those in 96 well plates.",
            "You know 96 different patients on that plate and now we can feed in different drugs or different combinations of drugs into the system.",
            "We can measure the electrophysiology response of those perturbations and we can measure the molecular response to those perturbations and basically based on that combination of physiological changes and molecular changes we can actually identify what are the drugs or combination.",
            "Oceans of drugs that are going to move the networks in the right direction right away from schizophrenia into Wellness, avoiding adverse events and toxicity to make people more well.",
            "So that's one strategy that you can work with experimentalists onto very, very rapidly.",
            "Move over the entire space of jeans or combinations of jeans to get to actual confirmation that people will accept as a step forward in making drugs to actually treat people."
        ],
        [
            "So that's the the end.",
            "Hopefully that made some sense to you.",
            "I do want to just highlight a few of the groups that are important for this work to Mount Sinai Group, particularly with Pamela Scholar and Kristen Brennan.",
            "Some of the key experimentalists and geneticists that we work with to assemble the big data to build these kinds of models in a lot of different universities.",
            "Harvard, UCSF on the Alzheimer's and other types of diseases.",
            "And then some of the other technology groups that help provide technology for us to be able to generate the kind of data I showed you today.",
            "And with that I'll stop, and I guess we'll take questions.",
            "Nice talk Eric.",
            "Going forward, what is it that you see as the main bottleneck in terms of finding a new medicines?",
            "Is it the data?",
            "Is it the methods?",
            "Is it the people?",
            "What you see is the main bottleneck?",
            "Yeah, I see the main bottleneck is one of interfaces, like how do we like?",
            "I think there's not necessarily a shortage of people not to think about big data and generate these models, but what's the right type of interface to present that information in ways that an experimentalist or a physician or other type of researcher can understand and engage?",
            "So how how to basically make these connections to all the different players that need to be weighing in to move different programs forward, so I almost view it as like the Steve Jobs?",
            "Where is the Steve Jobs in this space to create the right kind of user interfaces and user experiences to really make this information more impactful?",
            "I think that's one of the big Holy Grails.",
            "I great doc.",
            "I had a question actually last year.",
            "There was a lot of talk about personalized medicine.",
            "I notice that you didn't actually mention too much on that front.",
            "I also notice that you mentioned one of the biggest challenges is in interfaces and not necessarily in translating it into the individual basis level, right?",
            "So is that something you know that's ongoing, or is that something you see is?",
            "A challenge that we have overcome potentially.",
            "Yeah, I mean so you know, the fact that I didn't mention personalized or precision medicine is maybe just a big mistake on my part.",
            "I'd like to think that all the work we're doing is precision medicine.",
            "You know, the use of the networks to understand on an individual by individual basis.",
            "What are the perturbations in that individual that are disrupting this network so that we can better diagnose like it's not just diabetes, right?",
            "Diabetes is like 100 different diseases, 100 different ways you can.",
            "Have you no insulin resistance and beta cell activity altered and so understanding what's going on in an individual is going to impact what type of treatment they should get.",
            "Personalized cancer therapy is another thing that's super important program we have going on right now is to understand what is the molecular makeup of your tumor.",
            "An what are the drugs?",
            "Or can we innovate?",
            "Completely personalized drug specific to you in real time to treat your tumor?",
            "So I think it's all like I would view is ongoing and just where the field is going to go like it's going to be.",
            "In fact, the field is sort of flipped to this precision medicine concept, which is sort of a personalized medicine realized where the precision comes from.",
            "Having these types of models to better guide the decision making.",
            "Thank you very much for the great talk you talked about the blood based screening for newborn baby has been used for the New York hospitals, so I'm wondering if whether or not this kind of procedure has been approved by FDA or you know, is it making money?",
            "This is the first question.",
            "The second question is that you talked about the.",
            "Biomarker discovery, or some kind of like you know the drug targets from the network level and this has been studied in Banff.",
            "My metrics for long time but the problem for this direction is that it has a long way to have real impact in biomedical practice so I'm wondering what's your new perspective you know or important suggestions to make this kind of research really happen?",
            "In biomedical you know field right.",
            "So good, good points on the first point regarding the blood test.",
            "Yes, I think we are, you know, we're sort of the forefront on that.",
            "Mount Sinai is the number one referral Center for newborn screening in the state of New York.",
            "So we're sort of in the in the mix of everything that's going on.",
            "And whereas today it's the little blood smear on the on the piece of paper with doing some mass spec based profiling to identify a few variables we are moving towards blood based assays where we're looking at the circulating.",
            "Cells of the fetus in the mother and doing far more comprehensive characterization of what might be happening genetically in the fetus at that time, and how those things can map up to disease risk and so on.",
            "That's all work that's ongoing.",
            "I think it is all starting to move through getting regulatory approval.",
            "Some of these tests already have regulatory approval.",
            "We do carrier screening testing, autism based testing, a number of different genetic based tests that we now have.",
            "New York State approval on that or can be run routinely.",
            "So I do see that whole field is transforming, but it's today you know 99% of the people having babies.",
            "That's not happening, so it's a big problem under on the biomarker question.",
            "Another excellent question, like highly nontrivial to make these connections to get them adopted and up be taken up by the physicians or drug researchers.",
            "So where I see this playing out.",
            "The first is in the cancer arena, so you know the beauty of.",
            "You know, not that cancer is beautiful, but one of the beauties of that of that problem is that you get the relevant tissue.",
            "You can do all the molecular profiling on it.",
            "You can use the models to interpret and because the patient that we take into our study aren't responding to standard of care, they have no other options, right?",
            "They will die without you know if they keep receiving the standard of care or do nothing, they'll die within a short period of months.",
            "And So what we're able to do without having to get you know.",
            "The bar for regulatory approval at that point or uptake by other researchers who could affect novel treatments is not as high and so we have probably done around 100 cases so far in a number of those cases we've come up with completely novel treatments.",
            "Whether it's a novel vaccine or a novel drug combination for treating the patient that actually then starts providing the evidence that this modeling decision making those biomarkers can actually have an impact in practice.",
            "So I think it's just a matter of accumulating the right level of evidence in that setting.",
            "That convinces both regulatory agencies in the medical community that that we shouldn't be thinking any longer about randomized control studies.",
            "Trials with with fixed models that you know our snapshot is taken in time and then you do the trial and then you apply that model forever until the new trial is formed that we can't do that any longer.",
            "It has to be a very dynamic adaptive fluid process where we're always refining and enhancing the models and using the patient community as the clinical trial population.",
            "Thank you.",
            "Hi, thanks a great talk.",
            "The idea of connecting connecting the molecular level and imaging level is very fascinating and so one thing that you looked at is this collocation of jeans in particular regions.",
            "The other the other dimension is time.",
            "So I was wondering if for things like shoes are near you.",
            "It might be important how things get fired up or how things are regulated.",
            "The molecular level at the same time you know.",
            "Do you think this this direction is fruitful and what will be the challenges and what kind of models can you envision where you put these two things together with the dynamics?",
            "Yeah, I love it, and I obviously the dynamics are hugely critical to the brain function and just biological systems in general are dynamic and so we need to be modeling at that dimension.",
            "I'm sort of, you know, just.",
            "Bias from the work I've done on the DNA to mention the fact that that's fixed at least in non cancer cells.",
            "So my talking is more towards that angle, but the time is important in the way we are seeing more and more imaging studies carried out longitudinally on populations as they evolve into disease and get more severe.",
            "So really good data showing up on that end and the way we start mapping it dynamically to molecular data.",
            "Or there are emerging good datasets like the brain span.",
            "Data set which did look at brain neuron to function overtime over the development of individuals, and so we can get a sense of how are those neurons maturing, for example.",
            "And what are the what are the protein or gene expression states that are important for that maturation process?",
            "You can even do it in the Petri dish with the differentiation of those neurons neurons from stem cells and they do mature overtime and so profiling those longitudinally can again help.",
            "But it is sort of one of these problems.",
            "And I think until we're actually in the brain with nano robots able only to assay those cells in real time over a longitudinal longitudinally, I think it's going to be difficult to resolve all those processes.",
            "But again, some of the like brain stand brain span resource I talked about I think are pretty interesting that way.",
            "But great point on the unit is all about timing dynamics for sure.",
            "Hi Eric, excellent talk.",
            "I just want you to comment some of the real world data on drug discovery, 'cause nowadays I think interact discovery most data.",
            "Still, the OMICS data and.",
            "The part for the many research here we have a lot of data.",
            "For example, is real world data is maybe the electronic medical record.",
            "Maybe the FDA's adverse event reporting and also social network data.",
            "This data is very easy to access by the data mining researcher.",
            "I think it's.",
            "May be much easier than the OMICS data and biomedical data for us, so could you give some common for this weather this data is very important or is just to verify the drug discovery experiments where it can be a driver to generate the hypothesis for the next generation drug discovery?",
            "Thanks a lot.",
            "Yeah, it's another great point.",
            "I need to have a slide where I'm listing all of the sorts of technologies and approaches because.",
            "Limited and what I talked about.",
            "But absolutely, you know the resources that are now available through central centralized healthcare systems, both outside of the US and even within the US.",
            "And big providers like Kaiser and even Mount Sinai right where the 4th largest network of hospitals in the US, 4 million patient visits a year and a lot of that information and all the information on what's being prescribed is being represented in that database.",
            "The databases are sort of noisy.",
            "They weren't designed from the standpoint of scientific research.",
            "So lots of work from people in this audience, even on how to transform those data in ways that can be used in the research arena.",
            "But but showing really amazing links between how drugs are operating their interactions, what type of genetic background they can operate or be effective in with Mount Sinai?",
            "We have a brain biobank with 30,000 plus individuals.",
            "They've all been XM type.",
            "We have access to all their medical records, so not only can we see what drugs have they been on and for what conditions, but where they flipped off a drug.",
            "Where they having some adverse event on a drug where that was there some sort of drug interaction that caused some comorbid condition, but we can link that back to the genetics as well to start understanding.",
            "Parsing.",
            "Apart that, all the confounding that happens in those type of records, but definitely view the mining of those records is great path forward for how to basically get to lots of features that you're exactly right.",
            "Not going to get from the OMICS data, but maybe very readily available from those data that are collected.",
            "And I think it's a.",
            "Just great area of research that's delivering so.",
            "Thanks a lot.",
            "Is there time for one more question?",
            "Hi Eric, so I'm interested in trying to understand can we quantify progress being made in networking model based inference in the following way so?",
            "If you have a network based model and you make a small intervention, you can make predictions about what's going to happen a little bit downstream of it, but.",
            "You know these models aren't perfect, and so there's going to be some error, and now you start to put things together so you talked about Jonathan cars, work of the cell based model which is putting together many of these different systems, all of which are a little bit wrong, and so you could try to ask.",
            "Well, at some point information, theoretically you lost the signal.",
            "But what is that point where you lost the signal and how is that point transitioned overtime or like over the last 10 years?",
            "Imagine part of that sort of an idea what that would look like.",
            "Yeah, it's a great point and I think it would take a lot to try to address it, and what I'll say is our creation of Sage Bio Networks was specifically intended to address that very problem.",
            "So the idea was none of these models are perfect.",
            "The context in which they are operating or different.",
            "Where you lose the signal where you gain the signal, how long it operates overtime, all of those different dimensions like no single researcher, no single group is going to nail that.",
            "So how do we facilitate a more Open Access platform that facilitates not only sharing of data, but of the models where the model Now becomes the currency by which you grow in your career?",
            "It's no longer papers or sort of an advertisement right?",
            "For for what your actual contribution was to the biology of disease.",
            "But these models you can imagine being represented on a platform where they're unable to compete against one another and to inform in different contexts and see where one works where another one doesn't.",
            "Forming and sambol's of models and so on.",
            "So that whole, like how do we create that kind of architecture?",
            "That kind of framework that facilitates the type of investigations you're talking about?",
            "I think like we need that in the Biological Sciences to be able to get out the kinds of questions more easily that you're thinking about, and so that's where we've dumped a bit of our energy and facilitating right the competitions.",
            "Gaurav Pandey is somewhere here who?",
            "Who's Latin but involved in some of those the dream competitions with Gustavo Solovetsky, like those are going to be the ways I think that we get to the kinds of insights.",
            "OK, well thank you great.",
            "Oh so just don't we have Katie?",
            "Let's thank doctor.",
            "Start again for his insightful talk."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a pretty striking con.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Price I was just at the Deepack Chopra Foundation for Healing giving.",
                    "label": 0
                },
                {
                    "sent": "A talk there and now shifting into to this mode, so I'm going to try to get oriented here and I'm glad I have longer than 30 seconds.",
                    "label": 0
                },
                {
                    "sent": "So the thing we have been trying to tackle at Mount Sinai's, so think about you all the transformation that's going on in the big data world and how that can potentially impact human health.",
                    "label": 0
                },
                {
                    "sent": "But you have to be able to penetrate that.",
                    "label": 0
                },
                {
                    "sent": "People who are practicing the health and doing the diagnosis and treating a patient's.",
                    "label": 0
                },
                {
                    "sent": "And one thing I've learned are the type of orthodoxies that are held in this type of arena.",
                    "label": 0
                },
                {
                    "sent": "And if you think back about what what is the orthodoxy?",
                    "label": 0
                },
                {
                    "sent": "These are long held core beliefs.",
                    "label": 1
                },
                {
                    "sent": "That may no longer be true or applicable in the current landscape, and so makes you know that landscape ripe for disruption, but on the other hand, if that disruption doesn't occur, it can be very.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The limiting and of course we see this not just in medicine, but throughout human history.",
                    "label": 0
                },
                {
                    "sent": "Really.",
                    "label": 0
                },
                {
                    "sent": "You know whether it's Mr. Warner talking about in 1927 who's ever going to want to hear an actor talk and a movie or Mr Watson talking about a world market for maybe 5 computers.",
                    "label": 1
                },
                {
                    "sent": "These are the types of narrow thinking, the type of orthodoxies we come to accept and can limit creativity and innovation.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the question really before us is his medicine really poised for a fundamental transformation?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we don't have to look far and you guys you know perhaps better experts than myself at this big data revolution.",
                    "label": 0
                },
                {
                    "sent": "And sensors are a big part of that revolution that could have an impact on medicine.",
                    "label": 0
                },
                {
                    "sent": "And again, you know seeing the type of things happening, whether it's team Oracle with the big data at America's Cup with their boat that's outfitted with you no more than 300 sensors measuring 3000 different variables at a rate of around 10 Hertz, generating around 300 gigabytes of day, right?",
                    "label": 1
                },
                {
                    "sent": "Real time processing of that information too.",
                    "label": 0
                },
                {
                    "sent": "You better tune the boat and the crew to optimize performance.",
                    "label": 0
                },
                {
                    "sent": "Actually dump those servers off the boat each day and gets picked up by another boat and they do more crunching on that data to improve performance for the next day we see.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The same sort of thing going on with team Honda at the Indy Indy races.",
                    "label": 0
                },
                {
                    "sent": "Again 200 sensors monitoring all aspects of the car and the driver you know to again tune performance.",
                    "label": 0
                },
                {
                    "sent": "Generating around a GB of data per lap and again tuning in real time as the race is going on.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But what happens?",
                    "label": 0
                },
                {
                    "sent": "What about the human machine?",
                    "label": 0
                },
                {
                    "sent": "You know something we should care.",
                    "label": 0
                },
                {
                    "sent": "If I have bugs everywhere up here.",
                    "label": 0
                },
                {
                    "sent": "Flying down my shirt.",
                    "label": 0
                },
                {
                    "sent": "So what happens?",
                    "label": 0
                },
                {
                    "sent": "What about the?",
                    "label": 0
                },
                {
                    "sent": "You know, the human machine?",
                    "label": 0
                },
                {
                    "sent": "Probably something we all care deeply about and want to see tuned and optimized for performance.",
                    "label": 0
                },
                {
                    "sent": "And So what do we do in the great state of New York, right?",
                    "label": 1
                },
                {
                    "sent": "When you have a newborn, what happens to that newborn in the hospital while they get a little heel prick and they smear some blood on a piece of paper?",
                    "label": 0
                },
                {
                    "sent": "And then they send that paper through Snail Mail to Albany where they score a few variables, and those variables are important for determining whether you have something pretty horrific going on in your.",
                    "label": 0
                },
                {
                    "sent": "System that could be corrected, but it's a pretty limited amount of information.",
                    "label": 0
                },
                {
                    "sent": "They score that and then you're pushed out and you never come back to that hospital last year, in some catastrophic state of decline.",
                    "label": 0
                },
                {
                    "sent": "So the question is, can we start optimizing the human system, increasing human well being through the same type of censoring and data integration that we see happening with the non human machines of?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are lots of different type of devices now coming flooding into the market.",
                    "label": 0
                },
                {
                    "sent": "Wearable type devices that are angling to do exactly what's happening with the team.",
                    "label": 0
                },
                {
                    "sent": "Honda or the team Oracle for the Americas Cup, the.",
                    "label": 0
                },
                {
                    "sent": "Scanadu, one of my favourites.",
                    "label": 0
                },
                {
                    "sent": "One of the leaders for the Tricorder X Prize, you know, were handheld device.",
                    "label": 0
                },
                {
                    "sent": "You can waive it over the body and its measuring up to 10 different physiological traits on the.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "System to help understand Watts.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going on in the system, we of course have the printable tattoo biosensors.",
                    "label": 0
                },
                {
                    "sent": "Some of those Bluetooth enabled to measure different physiological parameters of the system on a real time lanja tude.",
                    "label": 0
                },
                {
                    "sent": "No basis.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even those babies, Pixie scientific create has the sensors now embedded in the diapers of babies too, so you can better understand what's coming out of that little system.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you know, companies like Farrah Nose popping up really transforming how we can carry out a wider array of medical type tests on your system.",
                    "label": 0
                },
                {
                    "sent": "So here the revolution is one of requiring very, very small amounts of blood.",
                    "label": 0
                },
                {
                    "sent": "Unlike, you know what you would have to give in the hospital with a 10 mil tube here.",
                    "label": 0
                },
                {
                    "sent": "It's micro amounts of blood you can go into Walgreens.",
                    "label": 0
                },
                {
                    "sent": "You give that little sample of blood order from the menu.",
                    "label": 0
                },
                {
                    "sent": "What kinds of tests you want done in for a pretty small amount of money, you know?",
                    "label": 0
                },
                {
                    "sent": "Start learning more about your current state of health.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course we have team NSA that's providing lots of different avenues of data collection and aggregation that could inform.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On our systems and one place we see that playing out here even in New York City is at the end why you Center for urban Science and progress where they're taking in a lot of the different data streams that are available from the New York City government where whether it's traffic flow or electricity usage or or pollution, pollen counts, and so on.",
                    "label": 1
                },
                {
                    "sent": "All of that information sort of now accessible to perhaps better understand the environment in which you're living.",
                    "label": 0
                },
                {
                    "sent": "So all of these different dimensions of data now possible to score on a real time lanja tude.",
                    "label": 0
                },
                {
                    "sent": "No basis.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, one of the Holy Grails to all of this is you know, how do you make sense of it?",
                    "label": 0
                },
                {
                    "sent": "How do you integrate all that information?",
                    "label": 0
                },
                {
                    "sent": "Make the predictive models and provide something meaningful back to the people who who would want to base decisions.",
                    "label": 0
                },
                {
                    "sent": "Whether it's a, whether it's a consumer patient or a medical doctor or researcher or a payer.",
                    "label": 0
                },
                {
                    "sent": "All the hierarchy of users that we have in the mix.",
                    "label": 0
                },
                {
                    "sent": "And what's the right way to present that type of information to facilitate actual decision making.",
                    "label": 0
                },
                {
                    "sent": "And of course in the medical arena, that's quite important, right?",
                    "label": 0
                },
                {
                    "sent": "All of this big data, all of the different.",
                    "label": 0
                },
                {
                    "sent": "Tools available now to better inform your system you aren't going to be very enabling from a human Wellness standpoint.",
                    "label": 0
                },
                {
                    "sent": "If your physician in the medical community isn't enabled to understand all of that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the main theme here is one of lots of different types of data.",
                    "label": 0
                },
                {
                    "sent": "How can we integrate it?",
                    "label": 0
                },
                {
                    "sent": "Generate predictive models that you know as somebody walks into, say, a Medical Center, physicians office, or even if you're sitting at home, you know enabling those models to better diagnose and treat whatever condition you.",
                    "label": 1
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Going on so again in addition to all the different types of wearable that wearable devices, the environmental context we can ask say we also have deep deep data now available at the individual level on from the DNA to RNA to microbiome, to the functioning of your immune system, to your electronic medical records, and so on.",
                    "label": 0
                },
                {
                    "sent": "So a lot of additional information in fact far deeper information available then you can currently collect from wearable devices or the environmental sensing that goes on.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the main aim is one of how do we take all of that information?",
                    "label": 0
                },
                {
                    "sent": "Build these predictive models and connect the molecular biology to the Physiology, right?",
                    "label": 0
                },
                {
                    "sent": "We ultimately want to make perturbations right, adjust those molecular networks in ways that manifest in changes in the Physiology of the system, right?",
                    "label": 1
                },
                {
                    "sent": "We want to steer the system away from pathophysiology of disease and into a more well state.",
                    "label": 0
                },
                {
                    "sent": "How do you?",
                    "label": 0
                },
                {
                    "sent": "How do you make those kinds of connections?",
                    "label": 0
                },
                {
                    "sent": "And if there's one thing one reason I believe?",
                    "label": 0
                },
                {
                    "sent": "Why current pharmaceutical and biotechnology companies have largely failed to live up to the hype of molecular biology?",
                    "label": 1
                },
                {
                    "sent": "Sequencing the genome and all the discoveries and making new therapeutics that help people whi that paradigm hasn't worked out as well as we thought it would is again this very reductionist approach.",
                    "label": 0
                },
                {
                    "sent": "That said, if we understand every protein and how it functions, then we're going to be able to treat every single disease and that's turned out to be completely false because it's unless you're able to integrate the information, understand it more holistically and how it matches up to the Physiology.",
                    "label": 0
                },
                {
                    "sent": "You're just not going to have the.",
                    "label": 0
                },
                {
                    "sent": "Kind of benefit.",
                    "label": 0
                },
                {
                    "sent": "Save a few.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Examples, so how we view the information is very important against.",
                    "label": 0
                },
                {
                    "sent": "I feel like I'm sort of preaching to the choir little bit here because you guys have pioneered a lot of the innovative ways of thinking.",
                    "label": 0
                },
                {
                    "sent": "But there was a pretty neat behavioral study that was carried out that I think well exemplifies how we can become really constrained in our thinking and not thinking outside the box and how it affects you.",
                    "label": 0
                },
                {
                    "sent": "Know, the way we look at data presented to us and how we solve problems with that.",
                    "label": 0
                },
                {
                    "sent": "So here's a problem where two groups were.",
                    "label": 0
                },
                {
                    "sent": "Provided with the exact same information, but only in slightly different presentation.",
                    "label": 0
                },
                {
                    "sent": "So same data presented to two groups in the top group they were presented.",
                    "label": 0
                },
                {
                    "sent": "So the problem these groups had to solve where to take this candle, fix it to the wall, light the candle without wax dripping on the table or the wall.",
                    "label": 0
                },
                {
                    "sent": "So that was the problem.",
                    "label": 0
                },
                {
                    "sent": "To solve, Group One was presented with the tools available to solve this problem with attacks inside the box and group Two was provided with the same information, but the tax were outside of the box.",
                    "label": 1
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An astonishingly group 2 on average came up with a solution twice as fast as Group One, just based on that very subtle presentation of the information.",
                    "label": 0
                },
                {
                    "sent": "So how we're presented with data how we perceive it, and how we act on it can have a big impact on our ability to solve.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Problems and so.",
                    "label": 0
                },
                {
                    "sent": "It's almost as if the deeper the grooves in our brains become, the more narrow our thinking becomes, the less able we are to innovate or to think outside the box.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course, this again isn't constrained to anyone area.",
                    "label": 0
                },
                {
                    "sent": "We've seen lots of areas innovate their way out of this sort of narrow thinking.",
                    "label": 0
                },
                {
                    "sent": "And here a few of my favourites.",
                    "label": 0
                },
                {
                    "sent": "My probably ultimate favorite is BMW.",
                    "label": 0
                },
                {
                    "sent": "I'm kind of a speed freak, so I drive an M5 and BMW learned that BMW had basically want to help advance the state of the automobile, improve the performance so they SAT engineer with consumers driving around to understand better what the consumer wanted.",
                    "label": 0
                },
                {
                    "sent": "And so, thinking you know, is it better acceleration, better breaking, better cornering, like what are the parameters that the customers are really interested in and to their great surprise and shock the number one concern had nothing to do with the performance of the automobile.",
                    "label": 0
                },
                {
                    "sent": "It had to do with concerns about causing damage to the car, pulling into or backing out of parking spaces.",
                    "label": 0
                },
                {
                    "sent": "And so is that sort of insight again garnered from very objective assessment of what the consumer wanted.",
                    "label": 0
                },
                {
                    "sent": "That led to the Park Assist features that BMW pioneered.",
                    "label": 0
                },
                {
                    "sent": "And of course many other such examples.",
                    "label": 0
                },
                {
                    "sent": "But again, what help exemplifies what we have to do to sort of break out of our want to tell stories and be very, very narrow once we become expert.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the biology field, not unlike all the great talks we're hearing today and in different areas, the aim is taking all these streams of data and applying objective data mining approaches to it to construct these predictive models and the way I like to visualize this is through an animation where we have molecular dimensions that are being.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Scored in populations, DNA and RNA and protein metabolites, and we see that these different variables are not connected in simple, linearly ordered pathways.",
                    "label": 0
                },
                {
                    "sent": "They're connected and highly nonlinear networks that define the biological processes, right that if disrupted, cause disease and those networks don't act in isolation either, right?",
                    "label": 0
                },
                {
                    "sent": "They act in concert in a network of networks over the entire system.",
                    "label": 0
                },
                {
                    "sent": "So if we want to understand the complexity of the system, we need to understand the complexity of those types of molecular networks.",
                    "label": 0
                },
                {
                    "sent": "And once we get a handle on that.",
                    "label": 0
                },
                {
                    "sent": "We can start resolving down to, you know, the network level for understanding disease as opposed to the single gene view where we can look at how disruptions in one subnetwork propagate through in a given cell or tissue type to affect other subnetworks.",
                    "label": 0
                },
                {
                    "sent": "And of course, we're more complicated right then, a single cell or a single tissue.",
                    "label": 0
                },
                {
                    "sent": "So we're really interested in is how to do this sort of modeling over the entire system and look at how do changes in one subnetwork in one tissue propagate through to other sub networks and other tissues to have some.",
                    "label": 0
                },
                {
                    "sent": "Act on on your physiological state, and then once we have this sort of a model, right now we can learn about biology by querying this type of model directly.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course, to carry this out as you all know you need, you know it's a nontrivial computational problem, so we've had to sort of beef up the way we think about big data processing in a Medical Center arena.",
                    "label": 0
                },
                {
                    "sent": "You know, we've been able to attract guys to help us solve this kind of problem, like Jeff Hammerbacher, who you may know from, you know, Cloudera, and that amazing success story in a pretty short amount of time.",
                    "label": 0
                },
                {
                    "sent": "But bringing him on board to build out the right infrastructures to manage the big data and do the kind of computations we need to build.",
                    "label": 0
                },
                {
                    "sent": "The models.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I had a little problem with some of the flash animations playing on the machine, so these animations aren't going to play, but the way we think about you know the problems we're trying to solve and inferring causality from the type of data we can collect on human systems at the molecular and physiological levels is one of resolving.",
                    "label": 0
                },
                {
                    "sent": "Resolving correlation structures that we observed by sampling population.",
                    "label": 0
                },
                {
                    "sent": "So what you should be seeing here is a graph of sampling from a population and seeing two variables that are correlated as you sample through the population.",
                    "label": 0
                },
                {
                    "sent": "Of course you want to know if there is.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's correlation whether there's a cause effect relationship between these and then the classic biology you should be seeing another animation.",
                    "label": 0
                },
                {
                    "sent": "I think these are the only two animations that won't show, but so you have these two traits that you know are correlated.",
                    "label": 0
                },
                {
                    "sent": "You hypothesize that one is causing changes in the other, so this is a classic biology approach and what you do is you perturb you, make an artificial perturbation on the effector variable.",
                    "label": 0
                },
                {
                    "sent": "You either knock it down, or you chemically perturb it, or you overexpress it, you.",
                    "label": 0
                },
                {
                    "sent": "Perturb it in some way and then you look for a subsequent response and the.",
                    "label": 0
                },
                {
                    "sent": "In the dependent very and the hypothesize dependent variable.",
                    "label": 0
                },
                {
                    "sent": "And if you see this affect in a series in a time sequence, you can make the causal inference.",
                    "label": 0
                },
                {
                    "sent": "So that's how it's been done in the past.",
                    "label": 0
                },
                {
                    "sent": "But what were?",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have sort of pioneered is a way to leverage not the artificial perturbations of biology where you're knocking a gene down to the ground or your overexpressing it at 10,000 times the normal levels.",
                    "label": 0
                },
                {
                    "sent": "But in our case we're leveraging naturally occurring DNA variations as the perturbation source resolve causal structures amongst these correlated variables, number of papers written on this and the way the idea works is think about clinical trials where your.",
                    "label": 0
                },
                {
                    "sent": "The beauty of a clinical trial and establishing causality.",
                    "label": 0
                },
                {
                    "sent": "It's randomization.",
                    "label": 0
                },
                {
                    "sent": "It's the ability.",
                    "label": 0
                },
                {
                    "sent": "It's the fact that you're randomizing people do a treatment arm or placebo arm, and then you're running the test and seeing whether whether there's a difference between the treatment and the placebo, and if there is given that randomization, you can make the causal inference.",
                    "label": 0
                },
                {
                    "sent": "What we can do the same thing, and?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Biology and that we can leverage the genetic impacts that are occurring on all these different variables.",
                    "label": 0
                },
                {
                    "sent": "So will track you know what are the genetic perturbations that are affecting these variables?",
                    "label": 0
                },
                {
                    "sent": "Apply some mathematics and then given those genetic impacts, those perturbations, we can start making causal inferences between the variables, just like we do in a clinical trial.",
                    "label": 0
                },
                {
                    "sent": "We can apply that systematically over the whole space of variables to get to these networks.",
                    "label": 0
                },
                {
                    "sent": "And why does that work?",
                    "label": 0
                },
                {
                    "sent": "What is the analogue of the randomization mechanism of a clinical trial in biology?",
                    "label": 0
                },
                {
                    "sent": "It's the random assortment of chromosomes.",
                    "label": 0
                },
                {
                    "sent": "The madilian segregation of chromosomes during cell divisions.",
                    "label": 0
                },
                {
                    "sent": "That gives us that power.",
                    "label": 0
                },
                {
                    "sent": "That's a random event.",
                    "label": 0
                },
                {
                    "sent": "It randomly assort's different levels that cause these variables to change, just like the clinical trials and so we can employ the same sort of reasoning to make the cause.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, in France we can also integrate this type of thinking with time series based information as well.",
                    "label": 0
                },
                {
                    "sent": "So longitudinal type data we can integrate with the DNA perturbation based information to again make these predictive models.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is getting to the point where we are now starting to understand sort of holistic holistic Lee systems being modeled in at every aspect of their molecular being, and one of the guys in my group, Jonathan Car had a paper in cell a year or so ago, presenting the first ever fully computational model for a living system based on all the different molecular dimensions of that system.",
                    "label": 0
                },
                {
                    "sent": "From the DNA to the DNA replication to the DNA transcription.",
                    "label": 0
                },
                {
                    "sent": "To the translation to the protein state modification to the environmental context, an influx of metabolites into the system and influx out of the system.",
                    "label": 0
                },
                {
                    "sent": "All of those different aspects of the system were computationally modeled and then he was able to run that model and simulate a cell behavior and systematically query the system perturbing different genes to learn completely new biology, and one of the things they present.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the cell paper was was this sort of thing.",
                    "label": 0
                },
                {
                    "sent": "We're on the upper left.",
                    "label": 0
                },
                {
                    "sent": "You're seeing different cells being simulated overtime, and you're looking at cell growth cell divisions as the phenotype.",
                    "label": 0
                },
                {
                    "sent": "There are looking at as an output of the model.",
                    "label": 0
                },
                {
                    "sent": "Again, all the different parameters of the system being modeled in the middle.",
                    "label": 0
                },
                {
                    "sent": "You see the replication.",
                    "label": 0
                },
                {
                    "sent": "The synthesis of the DNA, the transcription, the translation, the protein states the metabolic flux, and in the upper right what you're seeing is the cell actually growing and ultimately dividing.",
                    "label": 0
                },
                {
                    "sent": "And this is all being driven completely by the model, right?",
                    "label": 0
                },
                {
                    "sent": "There's no trickery here.",
                    "label": 0
                },
                {
                    "sent": "It's completely driven by the model in given perturbations that they induced artificially on the different genes and combinations of genes came up with completely novel insights on cell division that had never been known before.",
                    "label": 0
                },
                {
                    "sent": "And then of course validated those to show experimentally that they did have the impact on on the cell division.",
                    "label": 0
                },
                {
                    "sent": "So this day is coming in biology, where we will have these highly accurate predictive models for this.",
                    "label": 0
                },
                {
                    "sent": "This was I should have said.",
                    "label": 0
                },
                {
                    "sent": "The beginning was a pretty simple living system, is a very small bacterium with only 600 genes.",
                    "label": 0
                },
                {
                    "sent": "So representing, you know, sort of the bottom of the complexity chain, but at least you know demonstrating the first inklings of this sort of power coming to biology.",
                    "label": 0
                },
                {
                    "sent": "Just as it occurs in all other complex disciplines.",
                    "label": 0
                },
                {
                    "sent": "Whether it's physics or climatology or quantitative finance, or many engineering disip.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guns.",
                    "label": 0
                },
                {
                    "sent": "So the idea is one of moving you have transforming.",
                    "label": 0
                },
                {
                    "sent": "We're seeing this wholesale transformation in biology that's going to impact medicine.",
                    "label": 0
                },
                {
                    "sent": "Where yesterday we were in this very reductionist mode of looking at single genes, single proteins, single disease conditions, and trying to resolve the complexity of disease in living systems.",
                    "label": 0
                },
                {
                    "sent": "In this way, today we have the technologies to get away from that reduction's view and into a more holistic representation of this system.",
                    "label": 0
                },
                {
                    "sent": "We have technologies that can sequence entire genomes entire.",
                    "label": 0
                },
                {
                    "sent": "Transcriptomes, we're getting closer to systematic, comprehensive surveys of the proteome, and of course, the the Phenome as well.",
                    "label": 0
                },
                {
                    "sent": "Again, think of all the different kinds of sensors and stuff that can monitor physiological states of the system so that for tomorrow it's really going to be about the integration of these data and how to make predictions based on that that affect decision making.",
                    "label": 0
                },
                {
                    "sent": "Whether you're at the lab bench or in the clinic.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And one of the ways we've done this, I'll take you through a few examples where this is already playing out in complex diseases is with inflammatory bowel diseases, was one of the first where we were able to take 163 jeans that were identified in the big genetic studies.",
                    "label": 0
                },
                {
                    "sent": "So again, the big genetic studies are looking at whole genome genotyping or sequencing to identify what are the key variance.",
                    "label": 0
                },
                {
                    "sent": "The key changes in genes that cause these disease conditions in the human population.",
                    "label": 0
                },
                {
                    "sent": "So from the big study they did on.",
                    "label": 0
                },
                {
                    "sent": "50 to 70,000 individuals they came up with 163 loci roughly analogous to genes that were variations in those low side were causing IBD in the human population, and this is representing maybe 10% or so of the full set of factors that cause IBD in the human population.",
                    "label": 0
                },
                {
                    "sent": "But with those 163, what did they know they didn't necessarily know what the gene was, and even if they knew what the gene was, they didn't know is the gene activated or suppressed.",
                    "label": 0
                },
                {
                    "sent": "From the standpoint of disease.",
                    "label": 0
                },
                {
                    "sent": "They didn't know necessarily what's the context in which that gene is operating in, what pathways that operating in weather the networks that pathway operates in, and so on.",
                    "label": 0
                },
                {
                    "sent": "So you're not left with much information to help drive novel therapeutics or Diagnostics.",
                    "label": 0
                },
                {
                    "sent": "From the standpoint of impacting human well being, we're able to do is take the kinds of models I just showed you that we're building and project this data onto those models to see whether the models can help organize the data in ways that lead to novel discoveries and insights.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we project this information onto one of the network so we have a series of networks over lots of tissues and lots of conditions and different populations.",
                    "label": 0
                },
                {
                    "sent": "And this was one of the networks.",
                    "label": 0
                },
                {
                    "sent": "So what you're seeing here is a is a probabilistic causal network.",
                    "label": 0
                },
                {
                    "sent": "The blue and pink nodes are DNA variations that cause disease or affect molecular activity, or their molecular activity variables or their clinical variables that reflect physiological States and the green are the causal edges.",
                    "label": 0
                },
                {
                    "sent": "Between all these variables, so it's not very informative to look at it in this way.",
                    "label": 0
                },
                {
                    "sent": "But one thing to take note of are the pink nodes.",
                    "label": 0
                },
                {
                    "sent": "That's the projection of those 163 loci into this particular network.",
                    "label": 0
                },
                {
                    "sent": "If the network was effectively random with respect, it wasn't really informing on those jeans that are causing IBD, then you'd expect this uniform distribution of those pink nodes over the entire network.",
                    "label": 0
                },
                {
                    "sent": "But that's not what we see.",
                    "label": 0
                },
                {
                    "sent": "What we see is a very very significant enrichment in a very specific subnetwork of this network.",
                    "label": 0
                },
                {
                    "sent": "That's around 5 fold and rich for jeans at Harbor variants that cause IBD in the human.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Population and when we zoom in on those pink nodes to try to understand some of the structure going on there.",
                    "label": 0
                },
                {
                    "sent": "What we?",
                    "label": 0
                },
                {
                    "sent": "Pull Out is a is this type of graph where.",
                    "label": 0
                },
                {
                    "sent": "Here the big nodes are key driver genes.",
                    "label": 0
                },
                {
                    "sent": "These are genes that we predict modulate the state.",
                    "label": 0
                },
                {
                    "sent": "The activity state of the network, the jeans to the right of those key driver nodes are the most proxamol responders to the key drivers, so these are the things that are being moved around by the key drivers and then the guys to the right of that are sort of further downstream.",
                    "label": 0
                },
                {
                    "sent": "Almost sensors of what's going on from the primary drivers and again the.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Beauty of that sort of model is now we can start querying different nodes systematically in that model to understand which nodes are sort of the key to.",
                    "label": 1
                },
                {
                    "sent": "From the therapeutic standpoint to make changes in the network that are going to going to ultimately impact the disease and favorable ways so we can go and systematically query all the genes in the network and at some nodes were going to find this type of behavior where we hit the node and we see that it systematically altering the state of that network and then we can understand whether it's systematically altering in a favorable weight.",
                    "label": 0
                },
                {
                    "sent": "You know, away from disease and into Wellness, or is it maintaining this bad trajectory around disease so we can play this sort of game in silico much more quickly than we can by creating a knockout animal or an over expressing a gene in.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So on.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we've done that for IBD to uncover completely novel genes that are driving not only the novel genes driving it, but what's the context in which they are operating.",
                    "label": 0
                },
                {
                    "sent": "But we've also applied this to Alzheimer's disease and other pretty horrible disease that if we don't get a handle on in the next several years, is going to wreak great havoc on our health care system.",
                    "label": 0
                },
                {
                    "sent": "I think it's 15 years to 20 years time.",
                    "label": 0
                },
                {
                    "sent": "You know, the amount of money it will cost to treat everybody with Alzheimer's will.",
                    "label": 0
                },
                {
                    "sent": "Consume the entire Medicare budget, so obviously not a sustainable path.",
                    "label": 0
                },
                {
                    "sent": "So there's a big push on to really drill down and understand this disease at a deeper level to get to effective treatments or prevention strategies.",
                    "label": 0
                },
                {
                    "sent": "But we do employ this.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Same sort of strategy.",
                    "label": 0
                },
                {
                    "sent": "There had a paper in cell last year on this, again where it's integrating lots of different information from brain, different brain regions and forming on the disease condition and comparing that to the normal nondemented states.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And ultimately, getting to you know the same types of networks.",
                    "label": 0
                },
                {
                    "sent": "I was just showing you for IBD, but here for Alzheimer's and the beauty here in this model that we had published in Cell was that the mechanisms that it was elucidating for driving Alzheimer's were completely like not plaque related, not related to presanella into a beta.",
                    "label": 0
                },
                {
                    "sent": "All the effort that was going on in the drug discovery and research community focused on those mechanisms causing they thought were causing Alzheimer's.",
                    "label": 0
                },
                {
                    "sent": "What we identified was it that the plaques maybe one dimension, but the micro glial cells in the brain, the immune system of the brain was actually playing a key driver role and that was something that was not appreciated, wasn't really being pursued.",
                    "label": 0
                },
                {
                    "sent": "So again, completely novel insight.",
                    "label": 0
                },
                {
                    "sent": "I won't claim that the methods employed were the best that you could do.",
                    "label": 0
                },
                {
                    "sent": "I think many of the methods I've heard about here could be superior if applied to this type of problem, but it was the application of the of that type of modeling.",
                    "label": 0
                },
                {
                    "sent": "Two really big data.",
                    "label": 0
                },
                {
                    "sent": "That created completely novel insights on this disease that are now being very aggressively pursued from a pharmaceutical standpoint standpoint in biomarker standpoint as well.",
                    "label": 0
                },
                {
                    "sent": "And basically what you're seeing here are the different subnetworks enriched for different types of disease are biological processes that are also in rich, just like IBD for jeans at harbor variants that cause Alzheimer's in the human population.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the most important key here, like if you want to be successful right in applying the fancy methods to the big data to generate these novel discoveries is you have to be iterated, iterating with experimentalists to prove that your predictions mean anything.",
                    "label": 0
                },
                {
                    "sent": "So the ability to go in to systems in a very informed way and make these artificial perturbations not as a novel discovery engine.",
                    "label": 0
                },
                {
                    "sent": "But it's a validation engine for what the modeling is telling you is just critically important, like you will not be successful, you will not have that kind of impact you could have.",
                    "label": 0
                },
                {
                    "sent": "On you know these disease conditions if you're not doing this sort of iteration with the X.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Aaron mentalists what was also pretty interesting about this network that we identified for Alzheimer's this network here.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that it was nearly completely conserved with the network I just showed you for IBD.",
                    "label": 0
                },
                {
                    "sent": "So pretty interesting that these disruptions going on in the gut in the intestine cause IBD and the population.",
                    "label": 0
                },
                {
                    "sent": "But these disrupt same disruptions going on in the brain cause Alzheimer's.",
                    "label": 0
                },
                {
                    "sent": "So this idea of things, you know, these diseases being independent events driven by independent players we see more and more as completely false, that the system is highly interconnected in that perturbations again in one part of the system can propagate through to other parts of the system the same sorts of processes being disrupted, causing a number of different diseases.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And to validate that we had a paper recently in molecular systems biology where we went in sort of queried a bunch of different diseases with respect to this Alzheimer's IBD network we queried, you know, cardiovascular disease and diabetes and inflammatory pain and chronic obstructive pulmonary disease and asthma.",
                    "label": 0
                },
                {
                    "sent": "And what were the other ones?",
                    "label": 0
                },
                {
                    "sent": "Stroke, neuro pathic pain sarcopenia.",
                    "label": 0
                },
                {
                    "sent": "12 different disease conditions.",
                    "label": 0
                },
                {
                    "sent": "We queried.",
                    "label": 0
                },
                {
                    "sent": "We generated had models for those diseases and experimental systems, mainly mice.",
                    "label": 0
                },
                {
                    "sent": "We profiled the relevant disease tissue for each one of these diseases, and then we compared the molecular states of that disease condition to the wild type healthy state.",
                    "label": 0
                },
                {
                    "sent": "And So what you're looking at in the in the heat map plot along the X axis are the different genes that make up that IBD Alzheimer's network and on the Y axis is the different disease models and what you can see from the different disease models across these sets of genes is that the expression.",
                    "label": 0
                },
                {
                    "sent": "Changes are super consistent, so we now have locked on to this particular disease based network is impacting a very very wide spectrum of diseases in the human population and that modulating this particular network could have tremendous benefit to human Wellness because it predisposes to so many different disease conditions.",
                    "label": 0
                },
                {
                    "sent": "And, incidentally, this was the reason for talking at the Chopra Foundation for Wellness was what we see in their meditation studies when we look at people pre imposed meditation, their molecular states.",
                    "label": 0
                },
                {
                    "sent": "And we project those changes onto the different networks.",
                    "label": 0
                },
                {
                    "sent": "This is the very network one of the very networks that's perturbed in a favorable way through meditation.",
                    "label": 0
                },
                {
                    "sent": "When we look at the placebo arm of clinical trials right, the placebo is the sugar pill.",
                    "label": 0
                },
                {
                    "sent": "You shouldn't feel any effect from, but the placebo effect is very, very real.",
                    "label": 0
                },
                {
                    "sent": "People absolutely benefiting from taking that sugar pill and feeling like they're going to be healed when we look at the responder's in a clinical trial on the placebo arm versus the non responders and look at the molecular states.",
                    "label": 0
                },
                {
                    "sent": "Between them, this is the network that's being affected, so again, a pretty amazing network all involved in inflammation, immune response, defense response, wound healing.",
                    "label": 0
                },
                {
                    "sent": "All of these defenses that are raised to prepare you for War battle in your day-to-day lives.",
                    "label": 0
                },
                {
                    "sent": "You know if that network is more systematically controlled and suppressed, that it could have amazing benefit for human Wellness.",
                    "label": 0
                },
                {
                    "sent": "So I think one of the challenges here it could be help us better understand the structure of this network in how to link it.",
                    "label": 0
                },
                {
                    "sent": "Better to all the different diseases and how best to modulate it too.",
                    "label": 0
                },
                {
                    "sent": "Achieve the best possible benefit.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the ways we're doing that today is depicted in this graph, where the blue nodes in this network are now the genes that make up that what we call it.",
                    "label": 0
                },
                {
                    "sent": "We had started calling it the Magic module just because it's so amazingly associated with so many different diseases, so the blue nodes are the special IBD Alzheimer's, all disease network and the green nodes are now all marketed drugs.",
                    "label": 0
                },
                {
                    "sent": "All FDA approved compounds or natural products that occur in the foods that you eat or the things you apply on your skin.",
                    "label": 0
                },
                {
                    "sent": "That are known or predicted to interact with the coding products of that of that blue network.",
                    "label": 0
                },
                {
                    "sent": "And So what you can see is that the solution to how do we modulate this network isn't going to be simple.",
                    "label": 0
                },
                {
                    "sent": "It's not going to be.",
                    "label": 0
                },
                {
                    "sent": "Here is the drug that can push that network into this state.",
                    "label": 0
                },
                {
                    "sent": "Everything that we're eating everything that we're taking or not.",
                    "label": 0
                },
                {
                    "sent": "Everything but a big proportion of it is having some impact on this particular network.",
                    "label": 0
                },
                {
                    "sent": "So how do we operate in that multivariate space where you have these multi factorial?",
                    "label": 0
                },
                {
                    "sent": "Perturbations occurring to that network.",
                    "label": 0
                },
                {
                    "sent": "How do you figure out in the context of that multifactorial perturbation state, how to further perturb it in a positive way?",
                    "label": 0
                },
                {
                    "sent": "The pink nodes below the blue network graph are the all the different disease phenotypes and physiological states that are associated with disease that are impacted or changed by changes in that particular network.",
                    "label": 0
                },
                {
                    "sent": "So you can see even in this sort of simplistic view, that it's a pretty complex.",
                    "label": 0
                },
                {
                    "sent": "Interaction of things going on and you know to solve that is going to require.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot of work, but the ultimate aim is one of being able to take that network, take subcomponents of the network, and start impacting decision making on individuals by mapping the perturbations that are occurring in an individual, whether it's genetic or environmental to the different molecular states that are can be disrupted by those those factors and start assigning each individual to the molecular states that are being altered in them to cause disease or bad Ness and then map those molecular states to the different treatments.",
                    "label": 0
                },
                {
                    "sent": "Whether it's a small molecule drug or some behavior.",
                    "label": 0
                },
                {
                    "sent": "Nation exercise or diet that can improve the state of that network or transform it from disease causing to disease protecting.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the other dimensions I'll talk about that we've gotten into as well.",
                    "label": 0
                },
                {
                    "sent": "In addition to all the molecular information and environmental context data, of course, is imaging data.",
                    "label": 0
                },
                {
                    "sent": "The State of imaging, as many of you know, is reaching a pretty amazing point of very high resolution, almost now approaching the single cell single neuron level in brains.",
                    "label": 0
                },
                {
                    "sent": "So how can we take imaging data and integrated?",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As well, so one of the areas we're focused on in that area, again related to the brain or psychiatric disorders like schizophrenia and bipolar depression and so on.",
                    "label": 0
                },
                {
                    "sent": "And here what we're looking at are just clustering of some of the region from structural MRI data, just clustering based on schizophrenia or not doing any supervision, just clustering over the MRI structural MRI data over all the different regions that are being profiled in the brain and seeing whether in an unsupervised way that can.",
                    "label": 0
                },
                {
                    "sent": "Distinguish between cases and controls were the cases in this case or schizophrenia schizophrenics?",
                    "label": 1
                },
                {
                    "sent": "And seeing that there was this ability to distinguish schizophrenia from controls based on that image Ng data.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the question is people who are being imaged aren't the same people whose brains are being sequenced, right?",
                    "label": 0
                },
                {
                    "sent": "Because we've not approached the point yet, where people are willing to let us biopsy different parts of their brain while they're still alive.",
                    "label": 0
                },
                {
                    "sent": "So there's a limitation in what we can do, so most of the studies on schizophrenia and other psychiatric disorders are based on postmortem tissue collected from brain, and the question is, how do we link up if we're profiling in one cohort, all the DNA, the RNA of the brain and so on in another cohort were.",
                    "label": 0
                },
                {
                    "sent": "We're doing the imaging.",
                    "label": 0
                },
                {
                    "sent": "How do we sort of bring those two dimensions together to create a more holistic model and one of the ways we're doing that is by linking these cohorts through the DNA dimension.",
                    "label": 0
                },
                {
                    "sent": "So the factors that inform on schizophrenia from the image Ng and the factors that inform on the schizophrenia from the expression both have genetic variation components that we can decompose and then start mapping those guys based on the DNA connections and.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can also integrate with the holistic body atlases that are being generated by a bunch of different groups, one of them for the brain.",
                    "label": 0
                },
                {
                    "sent": "That's pretty extraordinary as the Allen Institute for Brain Sciences Brain Atlas generated on human where they basically took very small voxel sizes from the brain.",
                    "label": 0
                },
                {
                    "sent": "All different regions of the brain and profiled each of those regions over a number of individuals to come up with this map of molecular activity that could be isolated to every single part of the brain.",
                    "label": 0
                },
                {
                    "sent": "So we want to take those sorts of Maps.",
                    "label": 0
                },
                {
                    "sent": "The molecular Maps from the Brain Atlas.",
                    "label": 0
                },
                {
                    "sent": "And link them up to the in.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Aging data and one of the ways we're doing that is working with this company.",
                    "label": 0
                },
                {
                    "sent": "I Ozzy, who many of you might know a topological data analysis company that has pretty cool ways of visualizing of both making connections among high dimensional space data and then visualizing those in ways that can facilitate engage the human minds pattern recognition capabilities to make discovery.",
                    "label": 0
                },
                {
                    "sent": "So what you're looking at here is a representation and one of the OSDI Maps.",
                    "label": 0
                },
                {
                    "sent": "Of all the different gene expression activity from the Allen Brain Atlas, where each of the nodes in this case will represent a series of voxels, some number of voxels that are expressing genes that are similar among the different voxels, and then the edges between those nodes of course are representing again shared Co expression of genes over the different brain regions, and you can see it even sort of breaks out into a brain.",
                    "label": 1
                },
                {
                    "sent": "Almost a brain like morphology.",
                    "label": 0
                },
                {
                    "sent": "And what we can start doing here is isolating what genes are specifically transcribed in different regions.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then map that to the imaging data for the regions that are different between schizophrenia and controls.",
                    "label": 0
                },
                {
                    "sent": "So what you're looking at here is the same type of Ayazi plot we were using here.",
                    "label": 0
                },
                {
                    "sent": "Just the gross region data from structural MRI data.",
                    "label": 0
                },
                {
                    "sent": "So we've now transformed this to the voxel level data for that.",
                    "label": 0
                },
                {
                    "sent": "But what's being plotted here is the higher order region information and what's being highlighted with the arrows or regions of the brain than in the imaging data are different between cases and controls.",
                    "label": 0
                },
                {
                    "sent": "But now we can map what genes are specific to those regions.",
                    "label": 0
                },
                {
                    "sent": "Based on the map that we created with iOS D right?",
                    "label": 0
                },
                {
                    "sent": "So hopefully that's making some sense.",
                    "label": 0
                },
                {
                    "sent": "We can merge these two together to come up with.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Genes that are being very specifically transcribed in a given region that's very different between cases and controls to come up with novel gene.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That may be affecting this condition, and So what we can do is now take those genes that we found is expressed in the regions that are different between cases and controls project.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Contour network models.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll sort of skip through these.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Project them onto our network models to understand where are those genes specifically located in the network and are they coherent with respect to what the network can say regarding their connectivity and causal drivers and so on.",
                    "label": 0
                },
                {
                    "sent": "So here what we've done is projected a specific region of the brain where the imaging data is different between cases and controls.",
                    "label": 0
                },
                {
                    "sent": "We've gotten jeans that are specific to that region from the Allen Brain Atlas and now projected those onto one of our brain networks that we used to study different.",
                    "label": 0
                },
                {
                    "sent": "Brain related diseases.",
                    "label": 0
                },
                {
                    "sent": "And now we've see light up here.",
                    "label": 0
                },
                {
                    "sent": "This one subnetwork, that again is very enrich for jeans that are specific to the schizophrenia image in region.",
                    "label": 0
                },
                {
                    "sent": "And when we blow up.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That particular network to see how things are structured, we find that it's 40 fold enriched for jeans that harbor variants that cause schizophrenia in the human population.",
                    "label": 1
                },
                {
                    "sent": "So again, these are all good validations.",
                    "label": 0
                },
                {
                    "sent": "Not that this is the best model, but that we're locking on to the jeans that are most relevant in the region there most relevant in to affect schizophrenia.",
                    "label": 0
                },
                {
                    "sent": "And now we can take this into the.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On into the wet lab space to actually start validating and iterating with the experimentalist to refine our model and make it more and more accurate.",
                    "label": 0
                },
                {
                    "sent": "Just like you would see done in physics or climatology, we can do the same thing the way we do that with various collaborators like Kristen Brennan at Mount Sinai is we basically contain.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fibroblast skin cells from schizophrenia patients or blood samples from those patients.",
                    "label": 0
                },
                {
                    "sent": "We can reprogram those cells into stem cells.",
                    "label": 0
                },
                {
                    "sent": "We can then differentiate those stem cells into neurons, some of them becoming very advanced in age.",
                    "label": 0
                },
                {
                    "sent": "So not just representing Fiedel sort of neuron behavior, but more aged like neurons, in get to the point.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We're at 12 weeks after we differentiate the stem cells into neurons.",
                    "label": 1
                },
                {
                    "sent": "They have all the electrophysiology active just like your working brain does and we can start studying all of these physiological features on a given patient.",
                    "label": 0
                },
                {
                    "sent": "But in the Petri dish right?",
                    "label": 0
                },
                {
                    "sent": "We don't need to be operating in the brain.",
                    "label": 0
                },
                {
                    "sent": "We can be looking at that patient in the Petri dish because that neuron came from the same genetic background that they have, and that neuron also maintains a lot of the memory that's going on within a given individual.",
                    "label": 0
                },
                {
                    "sent": "The epigenetic memory.",
                    "label": 0
                },
                {
                    "sent": "So it's a pretty cool.",
                    "label": 0
                },
                {
                    "sent": "Way too to iterate very rapidly and so how do we do that?",
                    "label": 0
                },
                {
                    "sent": "How do we work with this system to iterate rapidly with the model?",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, we follow this sort of paradigm where we have the network that you see.",
                    "label": 0
                },
                {
                    "sent": "So first of all we have all the data that we're integrating in ways like you guys do.",
                    "label": 0
                },
                {
                    "sent": "Building these predictive models.",
                    "label": 0
                },
                {
                    "sent": "The different predictive models can represent different subtypes of the disease, and they don't have to just represent disease.",
                    "label": 0
                },
                {
                    "sent": "They can represent Wellness.",
                    "label": 0
                },
                {
                    "sent": "They can represent areas of toxicity that drugs we know if drugs hit, these regions are going to cause toxicity in the system, so we can have this map and now what we?",
                    "label": 0
                },
                {
                    "sent": "Do is we can have this high throughput screening type assay where remember the different neurons were taking from patients from their stem cells.",
                    "label": 0
                },
                {
                    "sent": "We can put those in 96 well plates.",
                    "label": 0
                },
                {
                    "sent": "You know 96 different patients on that plate and now we can feed in different drugs or different combinations of drugs into the system.",
                    "label": 0
                },
                {
                    "sent": "We can measure the electrophysiology response of those perturbations and we can measure the molecular response to those perturbations and basically based on that combination of physiological changes and molecular changes we can actually identify what are the drugs or combination.",
                    "label": 0
                },
                {
                    "sent": "Oceans of drugs that are going to move the networks in the right direction right away from schizophrenia into Wellness, avoiding adverse events and toxicity to make people more well.",
                    "label": 0
                },
                {
                    "sent": "So that's one strategy that you can work with experimentalists onto very, very rapidly.",
                    "label": 0
                },
                {
                    "sent": "Move over the entire space of jeans or combinations of jeans to get to actual confirmation that people will accept as a step forward in making drugs to actually treat people.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So that's the the end.",
                    "label": 0
                },
                {
                    "sent": "Hopefully that made some sense to you.",
                    "label": 0
                },
                {
                    "sent": "I do want to just highlight a few of the groups that are important for this work to Mount Sinai Group, particularly with Pamela Scholar and Kristen Brennan.",
                    "label": 0
                },
                {
                    "sent": "Some of the key experimentalists and geneticists that we work with to assemble the big data to build these kinds of models in a lot of different universities.",
                    "label": 0
                },
                {
                    "sent": "Harvard, UCSF on the Alzheimer's and other types of diseases.",
                    "label": 0
                },
                {
                    "sent": "And then some of the other technology groups that help provide technology for us to be able to generate the kind of data I showed you today.",
                    "label": 0
                },
                {
                    "sent": "And with that I'll stop, and I guess we'll take questions.",
                    "label": 0
                },
                {
                    "sent": "Nice talk Eric.",
                    "label": 0
                },
                {
                    "sent": "Going forward, what is it that you see as the main bottleneck in terms of finding a new medicines?",
                    "label": 0
                },
                {
                    "sent": "Is it the data?",
                    "label": 0
                },
                {
                    "sent": "Is it the methods?",
                    "label": 0
                },
                {
                    "sent": "Is it the people?",
                    "label": 0
                },
                {
                    "sent": "What you see is the main bottleneck?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I see the main bottleneck is one of interfaces, like how do we like?",
                    "label": 0
                },
                {
                    "sent": "I think there's not necessarily a shortage of people not to think about big data and generate these models, but what's the right type of interface to present that information in ways that an experimentalist or a physician or other type of researcher can understand and engage?",
                    "label": 0
                },
                {
                    "sent": "So how how to basically make these connections to all the different players that need to be weighing in to move different programs forward, so I almost view it as like the Steve Jobs?",
                    "label": 0
                },
                {
                    "sent": "Where is the Steve Jobs in this space to create the right kind of user interfaces and user experiences to really make this information more impactful?",
                    "label": 0
                },
                {
                    "sent": "I think that's one of the big Holy Grails.",
                    "label": 0
                },
                {
                    "sent": "I great doc.",
                    "label": 0
                },
                {
                    "sent": "I had a question actually last year.",
                    "label": 0
                },
                {
                    "sent": "There was a lot of talk about personalized medicine.",
                    "label": 0
                },
                {
                    "sent": "I notice that you didn't actually mention too much on that front.",
                    "label": 0
                },
                {
                    "sent": "I also notice that you mentioned one of the biggest challenges is in interfaces and not necessarily in translating it into the individual basis level, right?",
                    "label": 0
                },
                {
                    "sent": "So is that something you know that's ongoing, or is that something you see is?",
                    "label": 0
                },
                {
                    "sent": "A challenge that we have overcome potentially.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean so you know, the fact that I didn't mention personalized or precision medicine is maybe just a big mistake on my part.",
                    "label": 0
                },
                {
                    "sent": "I'd like to think that all the work we're doing is precision medicine.",
                    "label": 0
                },
                {
                    "sent": "You know, the use of the networks to understand on an individual by individual basis.",
                    "label": 0
                },
                {
                    "sent": "What are the perturbations in that individual that are disrupting this network so that we can better diagnose like it's not just diabetes, right?",
                    "label": 0
                },
                {
                    "sent": "Diabetes is like 100 different diseases, 100 different ways you can.",
                    "label": 0
                },
                {
                    "sent": "Have you no insulin resistance and beta cell activity altered and so understanding what's going on in an individual is going to impact what type of treatment they should get.",
                    "label": 0
                },
                {
                    "sent": "Personalized cancer therapy is another thing that's super important program we have going on right now is to understand what is the molecular makeup of your tumor.",
                    "label": 0
                },
                {
                    "sent": "An what are the drugs?",
                    "label": 0
                },
                {
                    "sent": "Or can we innovate?",
                    "label": 0
                },
                {
                    "sent": "Completely personalized drug specific to you in real time to treat your tumor?",
                    "label": 0
                },
                {
                    "sent": "So I think it's all like I would view is ongoing and just where the field is going to go like it's going to be.",
                    "label": 0
                },
                {
                    "sent": "In fact, the field is sort of flipped to this precision medicine concept, which is sort of a personalized medicine realized where the precision comes from.",
                    "label": 0
                },
                {
                    "sent": "Having these types of models to better guide the decision making.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much for the great talk you talked about the blood based screening for newborn baby has been used for the New York hospitals, so I'm wondering if whether or not this kind of procedure has been approved by FDA or you know, is it making money?",
                    "label": 0
                },
                {
                    "sent": "This is the first question.",
                    "label": 0
                },
                {
                    "sent": "The second question is that you talked about the.",
                    "label": 0
                },
                {
                    "sent": "Biomarker discovery, or some kind of like you know the drug targets from the network level and this has been studied in Banff.",
                    "label": 0
                },
                {
                    "sent": "My metrics for long time but the problem for this direction is that it has a long way to have real impact in biomedical practice so I'm wondering what's your new perspective you know or important suggestions to make this kind of research really happen?",
                    "label": 0
                },
                {
                    "sent": "In biomedical you know field right.",
                    "label": 0
                },
                {
                    "sent": "So good, good points on the first point regarding the blood test.",
                    "label": 0
                },
                {
                    "sent": "Yes, I think we are, you know, we're sort of the forefront on that.",
                    "label": 0
                },
                {
                    "sent": "Mount Sinai is the number one referral Center for newborn screening in the state of New York.",
                    "label": 0
                },
                {
                    "sent": "So we're sort of in the in the mix of everything that's going on.",
                    "label": 0
                },
                {
                    "sent": "And whereas today it's the little blood smear on the on the piece of paper with doing some mass spec based profiling to identify a few variables we are moving towards blood based assays where we're looking at the circulating.",
                    "label": 0
                },
                {
                    "sent": "Cells of the fetus in the mother and doing far more comprehensive characterization of what might be happening genetically in the fetus at that time, and how those things can map up to disease risk and so on.",
                    "label": 0
                },
                {
                    "sent": "That's all work that's ongoing.",
                    "label": 0
                },
                {
                    "sent": "I think it is all starting to move through getting regulatory approval.",
                    "label": 0
                },
                {
                    "sent": "Some of these tests already have regulatory approval.",
                    "label": 0
                },
                {
                    "sent": "We do carrier screening testing, autism based testing, a number of different genetic based tests that we now have.",
                    "label": 0
                },
                {
                    "sent": "New York State approval on that or can be run routinely.",
                    "label": 0
                },
                {
                    "sent": "So I do see that whole field is transforming, but it's today you know 99% of the people having babies.",
                    "label": 0
                },
                {
                    "sent": "That's not happening, so it's a big problem under on the biomarker question.",
                    "label": 0
                },
                {
                    "sent": "Another excellent question, like highly nontrivial to make these connections to get them adopted and up be taken up by the physicians or drug researchers.",
                    "label": 0
                },
                {
                    "sent": "So where I see this playing out.",
                    "label": 0
                },
                {
                    "sent": "The first is in the cancer arena, so you know the beauty of.",
                    "label": 0
                },
                {
                    "sent": "You know, not that cancer is beautiful, but one of the beauties of that of that problem is that you get the relevant tissue.",
                    "label": 0
                },
                {
                    "sent": "You can do all the molecular profiling on it.",
                    "label": 0
                },
                {
                    "sent": "You can use the models to interpret and because the patient that we take into our study aren't responding to standard of care, they have no other options, right?",
                    "label": 0
                },
                {
                    "sent": "They will die without you know if they keep receiving the standard of care or do nothing, they'll die within a short period of months.",
                    "label": 0
                },
                {
                    "sent": "And So what we're able to do without having to get you know.",
                    "label": 0
                },
                {
                    "sent": "The bar for regulatory approval at that point or uptake by other researchers who could affect novel treatments is not as high and so we have probably done around 100 cases so far in a number of those cases we've come up with completely novel treatments.",
                    "label": 0
                },
                {
                    "sent": "Whether it's a novel vaccine or a novel drug combination for treating the patient that actually then starts providing the evidence that this modeling decision making those biomarkers can actually have an impact in practice.",
                    "label": 0
                },
                {
                    "sent": "So I think it's just a matter of accumulating the right level of evidence in that setting.",
                    "label": 0
                },
                {
                    "sent": "That convinces both regulatory agencies in the medical community that that we shouldn't be thinking any longer about randomized control studies.",
                    "label": 0
                },
                {
                    "sent": "Trials with with fixed models that you know our snapshot is taken in time and then you do the trial and then you apply that model forever until the new trial is formed that we can't do that any longer.",
                    "label": 0
                },
                {
                    "sent": "It has to be a very dynamic adaptive fluid process where we're always refining and enhancing the models and using the patient community as the clinical trial population.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Hi, thanks a great talk.",
                    "label": 0
                },
                {
                    "sent": "The idea of connecting connecting the molecular level and imaging level is very fascinating and so one thing that you looked at is this collocation of jeans in particular regions.",
                    "label": 0
                },
                {
                    "sent": "The other the other dimension is time.",
                    "label": 0
                },
                {
                    "sent": "So I was wondering if for things like shoes are near you.",
                    "label": 0
                },
                {
                    "sent": "It might be important how things get fired up or how things are regulated.",
                    "label": 0
                },
                {
                    "sent": "The molecular level at the same time you know.",
                    "label": 0
                },
                {
                    "sent": "Do you think this this direction is fruitful and what will be the challenges and what kind of models can you envision where you put these two things together with the dynamics?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I love it, and I obviously the dynamics are hugely critical to the brain function and just biological systems in general are dynamic and so we need to be modeling at that dimension.",
                    "label": 0
                },
                {
                    "sent": "I'm sort of, you know, just.",
                    "label": 0
                },
                {
                    "sent": "Bias from the work I've done on the DNA to mention the fact that that's fixed at least in non cancer cells.",
                    "label": 0
                },
                {
                    "sent": "So my talking is more towards that angle, but the time is important in the way we are seeing more and more imaging studies carried out longitudinally on populations as they evolve into disease and get more severe.",
                    "label": 0
                },
                {
                    "sent": "So really good data showing up on that end and the way we start mapping it dynamically to molecular data.",
                    "label": 0
                },
                {
                    "sent": "Or there are emerging good datasets like the brain span.",
                    "label": 0
                },
                {
                    "sent": "Data set which did look at brain neuron to function overtime over the development of individuals, and so we can get a sense of how are those neurons maturing, for example.",
                    "label": 0
                },
                {
                    "sent": "And what are the what are the protein or gene expression states that are important for that maturation process?",
                    "label": 0
                },
                {
                    "sent": "You can even do it in the Petri dish with the differentiation of those neurons neurons from stem cells and they do mature overtime and so profiling those longitudinally can again help.",
                    "label": 0
                },
                {
                    "sent": "But it is sort of one of these problems.",
                    "label": 0
                },
                {
                    "sent": "And I think until we're actually in the brain with nano robots able only to assay those cells in real time over a longitudinal longitudinally, I think it's going to be difficult to resolve all those processes.",
                    "label": 0
                },
                {
                    "sent": "But again, some of the like brain stand brain span resource I talked about I think are pretty interesting that way.",
                    "label": 0
                },
                {
                    "sent": "But great point on the unit is all about timing dynamics for sure.",
                    "label": 0
                },
                {
                    "sent": "Hi Eric, excellent talk.",
                    "label": 0
                },
                {
                    "sent": "I just want you to comment some of the real world data on drug discovery, 'cause nowadays I think interact discovery most data.",
                    "label": 0
                },
                {
                    "sent": "Still, the OMICS data and.",
                    "label": 0
                },
                {
                    "sent": "The part for the many research here we have a lot of data.",
                    "label": 0
                },
                {
                    "sent": "For example, is real world data is maybe the electronic medical record.",
                    "label": 0
                },
                {
                    "sent": "Maybe the FDA's adverse event reporting and also social network data.",
                    "label": 0
                },
                {
                    "sent": "This data is very easy to access by the data mining researcher.",
                    "label": 0
                },
                {
                    "sent": "I think it's.",
                    "label": 0
                },
                {
                    "sent": "May be much easier than the OMICS data and biomedical data for us, so could you give some common for this weather this data is very important or is just to verify the drug discovery experiments where it can be a driver to generate the hypothesis for the next generation drug discovery?",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's another great point.",
                    "label": 0
                },
                {
                    "sent": "I need to have a slide where I'm listing all of the sorts of technologies and approaches because.",
                    "label": 0
                },
                {
                    "sent": "Limited and what I talked about.",
                    "label": 0
                },
                {
                    "sent": "But absolutely, you know the resources that are now available through central centralized healthcare systems, both outside of the US and even within the US.",
                    "label": 0
                },
                {
                    "sent": "And big providers like Kaiser and even Mount Sinai right where the 4th largest network of hospitals in the US, 4 million patient visits a year and a lot of that information and all the information on what's being prescribed is being represented in that database.",
                    "label": 0
                },
                {
                    "sent": "The databases are sort of noisy.",
                    "label": 0
                },
                {
                    "sent": "They weren't designed from the standpoint of scientific research.",
                    "label": 0
                },
                {
                    "sent": "So lots of work from people in this audience, even on how to transform those data in ways that can be used in the research arena.",
                    "label": 0
                },
                {
                    "sent": "But but showing really amazing links between how drugs are operating their interactions, what type of genetic background they can operate or be effective in with Mount Sinai?",
                    "label": 0
                },
                {
                    "sent": "We have a brain biobank with 30,000 plus individuals.",
                    "label": 0
                },
                {
                    "sent": "They've all been XM type.",
                    "label": 0
                },
                {
                    "sent": "We have access to all their medical records, so not only can we see what drugs have they been on and for what conditions, but where they flipped off a drug.",
                    "label": 0
                },
                {
                    "sent": "Where they having some adverse event on a drug where that was there some sort of drug interaction that caused some comorbid condition, but we can link that back to the genetics as well to start understanding.",
                    "label": 0
                },
                {
                    "sent": "Parsing.",
                    "label": 0
                },
                {
                    "sent": "Apart that, all the confounding that happens in those type of records, but definitely view the mining of those records is great path forward for how to basically get to lots of features that you're exactly right.",
                    "label": 0
                },
                {
                    "sent": "Not going to get from the OMICS data, but maybe very readily available from those data that are collected.",
                    "label": 0
                },
                {
                    "sent": "And I think it's a.",
                    "label": 0
                },
                {
                    "sent": "Just great area of research that's delivering so.",
                    "label": 0
                },
                {
                    "sent": "Thanks a lot.",
                    "label": 0
                },
                {
                    "sent": "Is there time for one more question?",
                    "label": 0
                },
                {
                    "sent": "Hi Eric, so I'm interested in trying to understand can we quantify progress being made in networking model based inference in the following way so?",
                    "label": 0
                },
                {
                    "sent": "If you have a network based model and you make a small intervention, you can make predictions about what's going to happen a little bit downstream of it, but.",
                    "label": 0
                },
                {
                    "sent": "You know these models aren't perfect, and so there's going to be some error, and now you start to put things together so you talked about Jonathan cars, work of the cell based model which is putting together many of these different systems, all of which are a little bit wrong, and so you could try to ask.",
                    "label": 0
                },
                {
                    "sent": "Well, at some point information, theoretically you lost the signal.",
                    "label": 0
                },
                {
                    "sent": "But what is that point where you lost the signal and how is that point transitioned overtime or like over the last 10 years?",
                    "label": 0
                },
                {
                    "sent": "Imagine part of that sort of an idea what that would look like.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's a great point and I think it would take a lot to try to address it, and what I'll say is our creation of Sage Bio Networks was specifically intended to address that very problem.",
                    "label": 0
                },
                {
                    "sent": "So the idea was none of these models are perfect.",
                    "label": 0
                },
                {
                    "sent": "The context in which they are operating or different.",
                    "label": 0
                },
                {
                    "sent": "Where you lose the signal where you gain the signal, how long it operates overtime, all of those different dimensions like no single researcher, no single group is going to nail that.",
                    "label": 0
                },
                {
                    "sent": "So how do we facilitate a more Open Access platform that facilitates not only sharing of data, but of the models where the model Now becomes the currency by which you grow in your career?",
                    "label": 0
                },
                {
                    "sent": "It's no longer papers or sort of an advertisement right?",
                    "label": 0
                },
                {
                    "sent": "For for what your actual contribution was to the biology of disease.",
                    "label": 0
                },
                {
                    "sent": "But these models you can imagine being represented on a platform where they're unable to compete against one another and to inform in different contexts and see where one works where another one doesn't.",
                    "label": 0
                },
                {
                    "sent": "Forming and sambol's of models and so on.",
                    "label": 0
                },
                {
                    "sent": "So that whole, like how do we create that kind of architecture?",
                    "label": 0
                },
                {
                    "sent": "That kind of framework that facilitates the type of investigations you're talking about?",
                    "label": 0
                },
                {
                    "sent": "I think like we need that in the Biological Sciences to be able to get out the kinds of questions more easily that you're thinking about, and so that's where we've dumped a bit of our energy and facilitating right the competitions.",
                    "label": 0
                },
                {
                    "sent": "Gaurav Pandey is somewhere here who?",
                    "label": 0
                },
                {
                    "sent": "Who's Latin but involved in some of those the dream competitions with Gustavo Solovetsky, like those are going to be the ways I think that we get to the kinds of insights.",
                    "label": 0
                },
                {
                    "sent": "OK, well thank you great.",
                    "label": 0
                },
                {
                    "sent": "Oh so just don't we have Katie?",
                    "label": 0
                },
                {
                    "sent": "Let's thank doctor.",
                    "label": 0
                },
                {
                    "sent": "Start again for his insightful talk.",
                    "label": 0
                }
            ]
        }
    }
}