{
    "id": "sl2cbysi3wo4jice6w2kzlxemakngny4",
    "title": "Mapping Factoid Adjective Constraints to Existential Restrictions over Knowledge Bases",
    "info": {
        "author": [
            "Jiwei Ding, State Key Laboratory for Novel Software Technology, Nanjing University"
        ],
        "published": "Nov. 27, 2019",
        "recorded": "October 2019",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2019_ding_factoid_adjective_constraints/",
    "segmentation": [
        [
            "My title is my ping factoid adjective, constraints, two extension restrictions, open order basis.",
            "OK, now let's start with the background."
        ],
        [
            "As we all know that question, answering system of knowledge bases need to transform natural language questions to structural queries such as sparkles and description logics and entity linking and relation mapping are two very essential steps in these systems which Maps proper nouns and relational phrases to entities and the relations in the given knowledge basis.",
            "Many, many people there are almost hundreds of papers studying these two problems in recent years, but we, as far as I know I have found few papers study the problem of how to find appropriate representation for adjectives.",
            "That's really a problem since additives are frequently used in natural questions."
        ],
        [
            "In this slide we show a question with adjectives and is target representation of over DB pedia.",
            "The question is list all American actors who are alive.",
            "The question contains 2 objectives.",
            "For the first one is American and it can be represented easily.",
            "Since American actors can be seen as a subset of actors who have who have affect about their nationality.",
            "With Value United States.",
            "But for actors who are alive, the representation might be a little bit difficult since there isn't affecting the knowledge base which can directly reflect actor is alive or not.",
            "However, for actors who are dead, we can find that there might be a fact about his death data or their discourse in the knowledge base.",
            "So actors who are alive can be represented by those actors who do not have their state in the knowledge base."
        ],
        [
            "In this table we show some other representations for adjectives in the knowledge base for such as married people can be represented as person, the person who have a spouse in the knowledge base, and Chinese cities can be represented by cities which have country China.",
            "We found that in most cases the meaning of input adjectives can be captured by the existence or non existence of a certain fact or a certain property.",
            "So we come up with the idea that to represent additives in form of the extensional restrictions or their negations in the knowledge basis.",
            "We also find that some."
        ],
        [
            "Papers may have different representations when modifying nouns from different classes.",
            "For example, American actors means actors who have nationality, United States and American cities may mean cities which have country United States, so we consider the class as an important factor and put it in the input of our question, and for each, for each adjective and each class, there may have several appropriate representations for, for example, alive actors may mean.",
            "Actors who do not have a death date in the knowledge base and can also be represented by actors who do not have this place in the knowledge basis."
        ],
        [
            "Before we introduce our adjective adjective representation approach, we would like to show how exists shows an existing approaches, some question, answering systems handle adjectives, adjectives just like proper nouns.",
            "For example, it may use an entity linking system to link American to United States, and it's represented American actors as actors who have some relation with the United States, but this approach."
        ],
        [
            "Cannot know whether it means actors who have birthplace, United States or displace United States or or nationality.",
            "United States and the Entity income approach may may fail or alive since.",
            "Similarity between alive and it's targeted representation that is not existed.",
            "Estate is not not.",
            "It's not very similar.",
            "Also some questions."
        ],
        [
            "String system using neural networks to learn the similarity between the objective and the target representation, but they may suffer from the lack of training data and a very large search space.",
            "Consider that knowledge base may contain millions of facts and it is really difficult to find which effect represents the meaning of the adjective.",
            "So two over."
        ],
        [
            "Come the above difficulties we come up.",
            "We propose the new approach to based on the following observation, that is and is that embody the meaning of the input adjective may have some difference.",
            "In fact, distributions with entities that do not, for example, both dead actors and living actors may find may have some fact about their birth date.",
            "So birthdate is not related with the representation of a life, but only that actors have facts about death dates and actors that are like do not.",
            "So that state might be related with the final representation.",
            "Our approach, many containing two step."
        ],
        [
            "So first and why is to collect entity sets, one for living actors and one for dead actors.",
            "And then we calculate the factor distribution over these two entities sets and compare the difference.",
            "Then we find some discriminative facts and generated and generate extension restrictions over these facts.",
            "Now let's move on to some details."
        ],
        [
            "For the first snap, we we collect two sets of adjective rated entity sets of.",
            "Suppose the input of our approach is alive and actor.",
            "Then we get all entities with type actor in knowledge basis such as DB pedia as well as their Wikipedia abstracts."
        ],
        [
            "Then we search the abstract of the search digestive or its synonyms and antonyms.",
            "In the Wikipedia abstracts the first 2 entities are considered to be actors who are dead since they mentioned the keyword which is entered into the life and this is their, their, their state, and the third one is considered to be an actor who are life since it shows it contains a word which is.",
            "Synonym to alive."
        ],
        [
            "After we get the two, these two, these two entities that.",
            "So we calculate the fact that distribution of these two entities sets."
        ],
        [
            "And we found that approximately a 75% of dead actors have affected about their death date, while actors who are alive do not only 2% of actor who are live have a death date, so not exist.",
            "Suggested can be considered as candidates representation for alive and in this way we can generate some candidates representations with large lexical gap."
        ],
        [
            "And the most of that actors and the living actors have a fact about their birth date.",
            "So exist, birth date or not exist birth date would not be considered as a candidate representation for alive.",
            "In this way we can filter out many appropriate representations so that we can reduce the search space."
        ],
        [
            "We passed through all of the facts so that we can get a set of candidate representations.",
            "Before I did the experiment, I think it's this is all of the approach.",
            "However, something strange happens."
        ],
        [
            "We find that we generated this representation for a life, which means each living actor should have a home page.",
            "This is really strange, but it is reasonable why becausw for actors they have.",
            "They are limited in the knowledge base.",
            "They must be very famous and they usually have a."
        ],
        [
            "Home page but for actors.",
            "They are dead.",
            "Maybe at that time Tim Berners Lee have haven't invented the World Wide Web, but so they do not have a home page.",
            "And our approach only considers the difference in fact distribution but ignores the meaning of the input adjective as well as the meaning of the properties and vocabulary and the values in the target representation so."
        ],
        [
            "We add a step to filter out inappropriate candidates.",
            "Extension restrictions by supervised learning method.",
            "We extracted many features such as a lexical similarity between the representation and the input adjective and the adjective popularity and.",
            "After that restriction and use the linear kernel SVM classifier to filter out the appropriate candidates.",
            "And the output of the classifier is considered as our final output."
        ],
        [
            "Now let's come to experiment.",
            "On the 1st experiment is about adjective mapping, which is to verify whether our approach can generate accurate mappings.",
            "For most of adjectives in natural language questions we build opportunities that first one contains 65 adjective, adjective and class pairs collected from question answering over linked data data set and the second one contains 369 pairs are frequently used in Yahoo answers, Yahoo answers correct data set and we ask 5.",
            "Semantic web major student to label the reference answers and for each input in average it has 3 three appropriate representations for comparative approaches.",
            "We consider linking based approach and network based approach."
        ],
        [
            "I have introduced in the beginning.",
            "From the experimental results, we can see that our approach reach F1 score about 50% in overall and gained an improvement of approximately 20% compared with the existing approaches and, which means our approach can generate accurate mappings for most of the adjectives.",
            "In natural language questions and when we see the precision recall curve for our approach, we can see that our approach gained precision for over.",
            "60% when our record varies from zero to 250%, which means our approach is quite stable."
        ],
        [
            "We also did an experiment about question answering to verify if current question answering systems can be banned, can benefit from integrating our approach.",
            "The data set contains 70 questions which contains adjectives from question answering over linked data and 50 questions sampled from Yahoo Answers.",
            "The integrating thread is showing this picture and I will introduce it briefly.",
            "Given an input question, we run our approach to generate a set of two generates representation for our approach, and then we check whether the existing sparkle generated generated by existing approaches contains a correct representation for each objective if the correctly.",
            "Vector representation is not not contained.",
            "We add it into the sparkle."
        ],
        [
            "And the experimental result shows that existing question answering system gave an improvement of about 16% to 18% in F score.",
            "By integrating our approach and the accuracy for integrating adjectives improved from approximately 30% to 60%.",
            "It almost doubled.",
            "OK."
        ],
        [
            "Now let's come.",
            "Now, let's come to the conclusion part.",
            "We put the example here again so that you can directly see what we do.",
            "That is, we propose the approach we should find appropriate representations in form of extension restrictions or their negations for adjectives, open order, basic knowledge basis.",
            "In future work.",
            "We would like to make our approach more universal and release lexicon for adjectives representation over some famous knowledge bases such as DB Pedia and Freebase.",
            "We are also interested in applying our.",
            "Master to some other task such as information extraction and question generation.",
            "That's all for my project."
        ],
        [
            "Nation and the questions.",
            "It's a very interesting work and I just wondered that Win District description of the entity.",
            "It is a very long sentence and for this entity there are many different relations.",
            "How you know that the specific token award in this description has some connection with the entities relation?",
            "You mean the in this step?",
            "Actually, actually we have some some restrictions and some patterns to include two to ensure the accuracy of this step.",
            "We search for example, if the sentence that does not start with.",
            "With this entity we will remove it, and if the sentence contains some negation words such as not, never, we will remove it.",
            "Thank you for your talk.",
            "You had this example where alive actors actors are alive.",
            "If they have a home page and you try to remove that fact.",
            "But if it's an artifact from the database and there is a rule with high confidence.",
            "So I would say you should still use that fact and not remove it.",
            "Yes, in future work we are going to have.",
            "So for example if we want to build a data set lexicon, we will consider adding a confidence score for this fact.",
            "Thank you very much.",
            "Yeah hi, I like your work.",
            "One issue is that you yourself assuming a closed world, becausw the fact that you don't have a death date doesn't mean that it's not.",
            "Then it's just not recorded sometimes.",
            "Yeah, so I mean, you could for example, calculate that nobody lives more than 150 years, and so if they have a birth date and is too old, then that person's dead and so on.",
            "But this becomes hard so.",
            "Have any any thoughts about how to deal with this problem?",
            "Thank you for the apartment for your device and maybe we are considering the future since it needs to add son Adam.",
            "Any constraints and for each for each edge it adject if we haven't considered their property yet, but we will consider in the future.",
            "Thank you very much.",
            "OK, any other questions?",
            "No OK, so then let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "My title is my ping factoid adjective, constraints, two extension restrictions, open order basis.",
                    "label": 0
                },
                {
                    "sent": "OK, now let's start with the background.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we all know that question, answering system of knowledge bases need to transform natural language questions to structural queries such as sparkles and description logics and entity linking and relation mapping are two very essential steps in these systems which Maps proper nouns and relational phrases to entities and the relations in the given knowledge basis.",
                    "label": 0
                },
                {
                    "sent": "Many, many people there are almost hundreds of papers studying these two problems in recent years, but we, as far as I know I have found few papers study the problem of how to find appropriate representation for adjectives.",
                    "label": 0
                },
                {
                    "sent": "That's really a problem since additives are frequently used in natural questions.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this slide we show a question with adjectives and is target representation of over DB pedia.",
                    "label": 0
                },
                {
                    "sent": "The question is list all American actors who are alive.",
                    "label": 0
                },
                {
                    "sent": "The question contains 2 objectives.",
                    "label": 0
                },
                {
                    "sent": "For the first one is American and it can be represented easily.",
                    "label": 0
                },
                {
                    "sent": "Since American actors can be seen as a subset of actors who have who have affect about their nationality.",
                    "label": 0
                },
                {
                    "sent": "With Value United States.",
                    "label": 0
                },
                {
                    "sent": "But for actors who are alive, the representation might be a little bit difficult since there isn't affecting the knowledge base which can directly reflect actor is alive or not.",
                    "label": 0
                },
                {
                    "sent": "However, for actors who are dead, we can find that there might be a fact about his death data or their discourse in the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "So actors who are alive can be represented by those actors who do not have their state in the knowledge base.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this table we show some other representations for adjectives in the knowledge base for such as married people can be represented as person, the person who have a spouse in the knowledge base, and Chinese cities can be represented by cities which have country China.",
                    "label": 0
                },
                {
                    "sent": "We found that in most cases the meaning of input adjectives can be captured by the existence or non existence of a certain fact or a certain property.",
                    "label": 0
                },
                {
                    "sent": "So we come up with the idea that to represent additives in form of the extensional restrictions or their negations in the knowledge basis.",
                    "label": 0
                },
                {
                    "sent": "We also find that some.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Papers may have different representations when modifying nouns from different classes.",
                    "label": 0
                },
                {
                    "sent": "For example, American actors means actors who have nationality, United States and American cities may mean cities which have country United States, so we consider the class as an important factor and put it in the input of our question, and for each, for each adjective and each class, there may have several appropriate representations for, for example, alive actors may mean.",
                    "label": 0
                },
                {
                    "sent": "Actors who do not have a death date in the knowledge base and can also be represented by actors who do not have this place in the knowledge basis.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Before we introduce our adjective adjective representation approach, we would like to show how exists shows an existing approaches, some question, answering systems handle adjectives, adjectives just like proper nouns.",
                    "label": 0
                },
                {
                    "sent": "For example, it may use an entity linking system to link American to United States, and it's represented American actors as actors who have some relation with the United States, but this approach.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cannot know whether it means actors who have birthplace, United States or displace United States or or nationality.",
                    "label": 0
                },
                {
                    "sent": "United States and the Entity income approach may may fail or alive since.",
                    "label": 0
                },
                {
                    "sent": "Similarity between alive and it's targeted representation that is not existed.",
                    "label": 0
                },
                {
                    "sent": "Estate is not not.",
                    "label": 0
                },
                {
                    "sent": "It's not very similar.",
                    "label": 0
                },
                {
                    "sent": "Also some questions.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "String system using neural networks to learn the similarity between the objective and the target representation, but they may suffer from the lack of training data and a very large search space.",
                    "label": 0
                },
                {
                    "sent": "Consider that knowledge base may contain millions of facts and it is really difficult to find which effect represents the meaning of the adjective.",
                    "label": 1
                },
                {
                    "sent": "So two over.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Come the above difficulties we come up.",
                    "label": 0
                },
                {
                    "sent": "We propose the new approach to based on the following observation, that is and is that embody the meaning of the input adjective may have some difference.",
                    "label": 1
                },
                {
                    "sent": "In fact, distributions with entities that do not, for example, both dead actors and living actors may find may have some fact about their birth date.",
                    "label": 1
                },
                {
                    "sent": "So birthdate is not related with the representation of a life, but only that actors have facts about death dates and actors that are like do not.",
                    "label": 1
                },
                {
                    "sent": "So that state might be related with the final representation.",
                    "label": 0
                },
                {
                    "sent": "Our approach, many containing two step.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So first and why is to collect entity sets, one for living actors and one for dead actors.",
                    "label": 1
                },
                {
                    "sent": "And then we calculate the factor distribution over these two entities sets and compare the difference.",
                    "label": 1
                },
                {
                    "sent": "Then we find some discriminative facts and generated and generate extension restrictions over these facts.",
                    "label": 0
                },
                {
                    "sent": "Now let's move on to some details.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the first snap, we we collect two sets of adjective rated entity sets of.",
                    "label": 0
                },
                {
                    "sent": "Suppose the input of our approach is alive and actor.",
                    "label": 0
                },
                {
                    "sent": "Then we get all entities with type actor in knowledge basis such as DB pedia as well as their Wikipedia abstracts.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then we search the abstract of the search digestive or its synonyms and antonyms.",
                    "label": 0
                },
                {
                    "sent": "In the Wikipedia abstracts the first 2 entities are considered to be actors who are dead since they mentioned the keyword which is entered into the life and this is their, their, their state, and the third one is considered to be an actor who are life since it shows it contains a word which is.",
                    "label": 0
                },
                {
                    "sent": "Synonym to alive.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After we get the two, these two, these two entities that.",
                    "label": 0
                },
                {
                    "sent": "So we calculate the fact that distribution of these two entities sets.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we found that approximately a 75% of dead actors have affected about their death date, while actors who are alive do not only 2% of actor who are live have a death date, so not exist.",
                    "label": 0
                },
                {
                    "sent": "Suggested can be considered as candidates representation for alive and in this way we can generate some candidates representations with large lexical gap.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the most of that actors and the living actors have a fact about their birth date.",
                    "label": 0
                },
                {
                    "sent": "So exist, birth date or not exist birth date would not be considered as a candidate representation for alive.",
                    "label": 0
                },
                {
                    "sent": "In this way we can filter out many appropriate representations so that we can reduce the search space.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We passed through all of the facts so that we can get a set of candidate representations.",
                    "label": 0
                },
                {
                    "sent": "Before I did the experiment, I think it's this is all of the approach.",
                    "label": 0
                },
                {
                    "sent": "However, something strange happens.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We find that we generated this representation for a life, which means each living actor should have a home page.",
                    "label": 0
                },
                {
                    "sent": "This is really strange, but it is reasonable why becausw for actors they have.",
                    "label": 0
                },
                {
                    "sent": "They are limited in the knowledge base.",
                    "label": 0
                },
                {
                    "sent": "They must be very famous and they usually have a.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Home page but for actors.",
                    "label": 0
                },
                {
                    "sent": "They are dead.",
                    "label": 0
                },
                {
                    "sent": "Maybe at that time Tim Berners Lee have haven't invented the World Wide Web, but so they do not have a home page.",
                    "label": 0
                },
                {
                    "sent": "And our approach only considers the difference in fact distribution but ignores the meaning of the input adjective as well as the meaning of the properties and vocabulary and the values in the target representation so.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We add a step to filter out inappropriate candidates.",
                    "label": 0
                },
                {
                    "sent": "Extension restrictions by supervised learning method.",
                    "label": 0
                },
                {
                    "sent": "We extracted many features such as a lexical similarity between the representation and the input adjective and the adjective popularity and.",
                    "label": 0
                },
                {
                    "sent": "After that restriction and use the linear kernel SVM classifier to filter out the appropriate candidates.",
                    "label": 1
                },
                {
                    "sent": "And the output of the classifier is considered as our final output.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now let's come to experiment.",
                    "label": 0
                },
                {
                    "sent": "On the 1st experiment is about adjective mapping, which is to verify whether our approach can generate accurate mappings.",
                    "label": 0
                },
                {
                    "sent": "For most of adjectives in natural language questions we build opportunities that first one contains 65 adjective, adjective and class pairs collected from question answering over linked data data set and the second one contains 369 pairs are frequently used in Yahoo answers, Yahoo answers correct data set and we ask 5.",
                    "label": 0
                },
                {
                    "sent": "Semantic web major student to label the reference answers and for each input in average it has 3 three appropriate representations for comparative approaches.",
                    "label": 0
                },
                {
                    "sent": "We consider linking based approach and network based approach.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have introduced in the beginning.",
                    "label": 0
                },
                {
                    "sent": "From the experimental results, we can see that our approach reach F1 score about 50% in overall and gained an improvement of approximately 20% compared with the existing approaches and, which means our approach can generate accurate mappings for most of the adjectives.",
                    "label": 1
                },
                {
                    "sent": "In natural language questions and when we see the precision recall curve for our approach, we can see that our approach gained precision for over.",
                    "label": 0
                },
                {
                    "sent": "60% when our record varies from zero to 250%, which means our approach is quite stable.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also did an experiment about question answering to verify if current question answering systems can be banned, can benefit from integrating our approach.",
                    "label": 1
                },
                {
                    "sent": "The data set contains 70 questions which contains adjectives from question answering over linked data and 50 questions sampled from Yahoo Answers.",
                    "label": 0
                },
                {
                    "sent": "The integrating thread is showing this picture and I will introduce it briefly.",
                    "label": 0
                },
                {
                    "sent": "Given an input question, we run our approach to generate a set of two generates representation for our approach, and then we check whether the existing sparkle generated generated by existing approaches contains a correct representation for each objective if the correctly.",
                    "label": 0
                },
                {
                    "sent": "Vector representation is not not contained.",
                    "label": 0
                },
                {
                    "sent": "We add it into the sparkle.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the experimental result shows that existing question answering system gave an improvement of about 16% to 18% in F score.",
                    "label": 0
                },
                {
                    "sent": "By integrating our approach and the accuracy for integrating adjectives improved from approximately 30% to 60%.",
                    "label": 1
                },
                {
                    "sent": "It almost doubled.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now let's come.",
                    "label": 0
                },
                {
                    "sent": "Now, let's come to the conclusion part.",
                    "label": 0
                },
                {
                    "sent": "We put the example here again so that you can directly see what we do.",
                    "label": 0
                },
                {
                    "sent": "That is, we propose the approach we should find appropriate representations in form of extension restrictions or their negations for adjectives, open order, basic knowledge basis.",
                    "label": 1
                },
                {
                    "sent": "In future work.",
                    "label": 1
                },
                {
                    "sent": "We would like to make our approach more universal and release lexicon for adjectives representation over some famous knowledge bases such as DB Pedia and Freebase.",
                    "label": 0
                },
                {
                    "sent": "We are also interested in applying our.",
                    "label": 1
                },
                {
                    "sent": "Master to some other task such as information extraction and question generation.",
                    "label": 0
                },
                {
                    "sent": "That's all for my project.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nation and the questions.",
                    "label": 0
                },
                {
                    "sent": "It's a very interesting work and I just wondered that Win District description of the entity.",
                    "label": 0
                },
                {
                    "sent": "It is a very long sentence and for this entity there are many different relations.",
                    "label": 0
                },
                {
                    "sent": "How you know that the specific token award in this description has some connection with the entities relation?",
                    "label": 0
                },
                {
                    "sent": "You mean the in this step?",
                    "label": 0
                },
                {
                    "sent": "Actually, actually we have some some restrictions and some patterns to include two to ensure the accuracy of this step.",
                    "label": 0
                },
                {
                    "sent": "We search for example, if the sentence that does not start with.",
                    "label": 0
                },
                {
                    "sent": "With this entity we will remove it, and if the sentence contains some negation words such as not, never, we will remove it.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your talk.",
                    "label": 1
                },
                {
                    "sent": "You had this example where alive actors actors are alive.",
                    "label": 0
                },
                {
                    "sent": "If they have a home page and you try to remove that fact.",
                    "label": 0
                },
                {
                    "sent": "But if it's an artifact from the database and there is a rule with high confidence.",
                    "label": 0
                },
                {
                    "sent": "So I would say you should still use that fact and not remove it.",
                    "label": 0
                },
                {
                    "sent": "Yes, in future work we are going to have.",
                    "label": 0
                },
                {
                    "sent": "So for example if we want to build a data set lexicon, we will consider adding a confidence score for this fact.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Yeah hi, I like your work.",
                    "label": 0
                },
                {
                    "sent": "One issue is that you yourself assuming a closed world, becausw the fact that you don't have a death date doesn't mean that it's not.",
                    "label": 0
                },
                {
                    "sent": "Then it's just not recorded sometimes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so I mean, you could for example, calculate that nobody lives more than 150 years, and so if they have a birth date and is too old, then that person's dead and so on.",
                    "label": 0
                },
                {
                    "sent": "But this becomes hard so.",
                    "label": 0
                },
                {
                    "sent": "Have any any thoughts about how to deal with this problem?",
                    "label": 0
                },
                {
                    "sent": "Thank you for the apartment for your device and maybe we are considering the future since it needs to add son Adam.",
                    "label": 0
                },
                {
                    "sent": "Any constraints and for each for each edge it adject if we haven't considered their property yet, but we will consider in the future.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "OK, any other questions?",
                    "label": 0
                },
                {
                    "sent": "No OK, so then let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}