{
    "id": "somdztnxdquptobwn2l4ysjnxzevh4cf",
    "title": "mOSAIC- facts, objectives and current results",
    "info": {
        "author": [
            "Dana Petcu, West University of Timisoara"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/classconference2012_petcu_results/",
    "segmentation": [
        [
            "Yesterday I had the head of University.",
            "Today I have another hat.",
            "Since I am leading a Research Institute in computer science.",
            "So.",
            "It seems to go straight to make sure it's it's a joint.",
            "A joint activity between three universities.",
            "Mine western ver.",
            "City of Timisoara Polytechnic University of Timisoara and Johannes Kepler, University of Linz.",
            "So how to Institute?",
            "Mainly we have the research activities connected to the three universities involved in European projects.",
            "So the topic of today talk will be about Mosaic and I will compliment the facts that you already know from yesterday from our project coordinator.",
            "I'm just the scientific coordinator of this project.",
            "So I will talk about."
        ],
        [
            "The little bit about vendor lock in and.",
            "Our solution for this problem and that should I'm going in details on the architecture of the platform that we propose.",
            "And I'm pointing also to the role of open source platform.",
            "So I remind you that the problem of vendor lock in is still there.",
            "So if we are writing a kind of application, for example for.",
            "Google application engine.",
            "We cannot move the code in other environments because the code is not compatible with the APIs of that cloud.",
            "So we are really locking on a certain technology and if we have problems with the cloud."
        ],
        [
            "The our codes are or.",
            "We are not satisfied about the condition in which we have contracted the running of the application.",
            "Then we are stuck on that cloud.",
            "So the main idea is to protect the application versus this."
        ],
        [
            "Looking so almost like it's.",
            "Dealing with portability, mainly in the condition that we have already some scenarios of using multiple clouds.",
            "So today we'll hear also about control that it's working in the Federation of Clouds, so in this case we expect to have some agreements between the clouds so that kind of code it's able to migrate from one cloud to another.",
            "According to this agreements.",
            "So the mechanism for moving the overload from one cloud to another are inside the cloud, but Mosaic.",
            "It's addressing mainly the.",
            "Market of clouds.",
            "In which condition we have kind of external broker mechanism brokerage mechanism that according to the requirements of the application, is trying to send parts of the application or the full application to certain cloud.",
            "So in order to solve this portability problem, we need to abstract the programming differences between different clouds.",
            "At this moment and this is surely a part of solving the problem of interoperability that.",
            "It's going be a beyond.",
            "This should go also to the migration support we are.",
            "We have just a few options.",
            "In the case of Mosaic for supporting the migration, support the migration of the codes.",
            "But Moreover, especially in the Federation or clouds, we need to have agreements between the providers that it's quite hard to obtain.",
            "It's more simple to solve the technical problem then the political one.",
            "So."
        ],
        [
            "Looking in details to the solutions that are currently available for solving these problems, we can go on different levels, but surely here we are interested on notice technical aspects, so I'm pointing mainly this one so we have already some unified API's like Cloud Sleep cloud, open stack and so on that are trying to solve the problem of the of different APIs.",
            "But not completely because they are somehow stuck in the way in which the programming programming is done on that API's.",
            "Then we have protocols that are emerging related to how you are dealing with the with VMS.",
            "For example on ACI or how you are dealing with the data in CDMA.",
            "And also they are already from previous projects.",
            "Some some frameworks related to service level agreements.",
            "It also most like to use using partially and you have heard yesterday about the components related to semantic discovery and also semantic engine and cloud ontology that our coordinator bananas point to you.",
            "So in most like we are trying to activate all this stack and to give a kind of integrated solution in one platform so."
        ],
        [
            "I'm saying platform and if we are trying to compare with what we are proposing with what's on the market we should.",
            "Not the fact that if in the field of infrastructure as a service it's a trend to establish some some standards in the platform as a service to the platform as a service, we have a big problem.",
            "Becausw assured it's not compatible with Google with Heroku or something else so.",
            "Are different views how to implement the middleware mainly because of its complexity?",
            "And portability is currently possible, for example.",
            "The Project cloud for SOA it's working to.",
            "Portability between platform as a service, but only between a small number of platform as a service.",
            "So, especially in the case of open source cloud accounts of the property once.",
            "And we know that the number of platforms are service very increase because these are helping the developers to forget about the installations.",
            "So the number of of them will increase and then the problem will become more complex so."
        ],
        [
            "Mosaic is trying to push a kind of open source platform as a service that is quite different from the notion of.",
            "Classical platform as a service that it's a hosting system, so Google Application Engine, Microsoft Azure, Rackspace, Amazon Beanstalk, Salesforce.",
            "Try and have something to say on this with different approaches.",
            "Leaving the control, or at least control to the developer as we have indentified, types of working the applications.",
            "But open source is only to attract the developers in order to allow the customization when we are developing the application but not to the deployment phase.",
            "To the deployment phase you are stuck on on the resources of a certain provider, so the main idea of Mosaic is to come with a deployable solution that can be used by cloud providers and also the developer in the idea to have a kind of middle, not probably not perfect, but one that it's usable.",
            "Looking to what has happened in the field, for example of parallel computing with PVM and MPI, bit several solutions.",
            "Property solution to that moment and also with the defacto standard globals.",
            "So in the great field.",
            "So the."
        ],
        [
            "Mosaic that has acronym coming from the Open Source API and platform for multiple clouds.",
            "It's trying to to offer a tool for the developing portable cloud applications.",
            "That are consuming hardware and software resources offered by different cloud providers.",
            "To offer an open source platform as a service that can be deployable by service providers and which can be because it's open source, customize it and the handset by service providers and also to come with a brokerage system to support the decision of cloud service providers to selection at the deployment phase.",
            "So we are moving in principle the decision of where the code will go.",
            "From the design phase to the deployment phase.",
            "So we are writing in an independent way of our application and to the deployment phase we decide where to go.",
            "Therefore we are trying to ensure the portability.",
            "So, uh, becausw, we need also to market this this.",
            "Offer we had also on motor flying through through the clouds that it's trying to explain that the courts will jump in different."
        ],
        [
            "Clouds, so we have quite big consulting for a small for a strip.",
            "We have started in 2011 with six partners and we have extended it with three partners.",
            "We are very happy of the contribution from Slovenia from ICS.",
            "Laba Niversity of Ljubljana.",
            "And we have been able to deliver earlier than than than requested.",
            "For example, the implementation for Java was in summer of 2011 already there in the open source repository of Bitbucket.",
            "We have a now a stable platform as a service, and in the description not work.",
            "It was stated that we will have a.",
            "Just the proof of concept implementation also in in Python, but currently we have more than that.",
            "We have Java, Python, Erlang and an node JS and we expect to deliver the stable version to the end of February.",
            "But we consider that what it's currently available in Bitbucket.",
            "It's already usable.",
            "So I invite you to consider to work with it.",
            "So I have promised to give some."
        ],
        [
            "Details about.",
            "The insights of the platform so the platform is coming with several components.",
            "It's for application for.",
            "Application that are based on components but itself the architecture of the platform.",
            "It's based on components, so we have support for application.",
            "We have support from the classical platform as a service in blue one we have support for connect connecting and the brokerage system for.",
            "For for different clouds.",
            "So what I have stated as objective are in these three different colors at this moment.",
            "And more details I have said that we have the API implementation.",
            "We have several tools we have.",
            "You have heard about yesterday, semantic engine service discover.",
            "We have the core components of the platform and application service components and on the site of support for finding the right cloud for you.",
            "We have a cloud agency and several agents representing different vendors so.",
            "In I'm pointing just some some few components.",
            "For example portable desk cluster.",
            "It's a component that allows you to simulate the cloud on your desktop, so in the face of debugging your application and writing your application, you can use Eclipse and.",
            "You can launch on your desktop several virtual machines and look test how will will work.",
            "This and also portable display cluster as currently.",
            "Um, some?",
            "A kind of web interface that allows you to.",
            "To deploy your application directly in Amazon and Flexion.",
            "We are working to defer the facility for all providers that we have on our list.",
            "So it's just a matter of providing the credential and and push a button and the application will be deployed on the facilities.",
            "So we have also parts of Salina Goshen as you see here, and we are embracing several existing.",
            "Technologies open source technology in our platform so we have slightly modified versions of React for key value store.",
            "Watch to be.",
            "We have also a photo.",
            "Messaging we are.",
            "We have rabbit MQ and for example if you want to work with a database for example and you want to just do occur some some virtual machine from Amazon then you can put the reac on top of this virtual machine.",
            "It's no need to buy also some space in S3 for example, and you are sure that the data are on that virtual machine, so you do not have problems with transfer.",
            "Of the data from 1 one place to another.",
            "So on the site of providers we have currently a lot of links to different providers that are connected through the vendor agents and we can.",
            "We can as you see we have also tried to promote European providers flexi scale.",
            "Cloud Sigma, Nephites and Hungarian cloud provider actor in high school.",
            "You know our Slovenian odds and also to have connectors to the the technologies that allow you to create private clouds?",
            "And you're on your facilities.",
            "So the we have several strong application that are testing.",
            "Currently the platform and.",
            "We have from different fields also computationally intensive application but also data intensive applications.",
            "The ones from Earth observation sensors also in the intelligent maintenance system.",
            "We have scientific papers exception.",
            "They will hear some data from scientific paper extraction.",
            "So you will hear today about part of this application running on the.",
            "Most like infrastructure, so I invite you to look sorry for this mistake of the line to look to the Bitbucket repository where we have the codes.",
            "That allow you to develop the application.",
            "So her if you want to."
        ],
        [
            "Use it so you can write your application and four languages at this moment in Eclipse interface, for example.",
            "A drawback is the fact that you should use the event driven style of programming.",
            "So we have adopted this in order to avoid the number of messages passing through the cloud.",
            "That is quite different from the current style of synchronization with dark clouds and just Azure.",
            "And the part of messaging systems are doing this in.",
            "Frame of clouds.",
            "So I have already mentioned the personality assessment cluster that you can use and also we have the possibility to assist you in finding the right provider using the cloud agency and broker based on service level agreements and.",
            "When you are monitoring your application, you are able to stop start different components application 'cause we are using message passing systems.",
            "So the messages that are moved from one component to another when the component is down or sitting in the queue and when you are placing the component in principle the application should work.",
            "So we are targeting long running application.",
            "In principle web application.",
            "But also as you have seen on the.",
            "Right side of the of the architecture.",
            "Also scientific application.",
            "So this is a difference from from Google Application Engine.",
            "For example they are targeting only.",
            "Vibe."
        ],
        [
            "Applications, so comparing with what we we have on the on the market now for open source platform that are compatible with Mosaic, I want to point with for example the solution from Contrail because we have today to control here and also to offers from Red Hat and from somewhere.",
            "So for example can shift is just part partially open.",
            "So one of the version of this platform, not complete.",
            "More close, it's the Cloud Foundry and compare with Contrail.",
            "We have you can see on this kind of colon's what we have is.",
            "It's very important is the fact that.",
            "If you're looking on this line, we are able to connect to more more providers, and theoretically it's a matter of one day to make a connector to another provider.",
            "We have templates for this and also we have several kinds of interfaces.",
            "FAB Interfaces, Command line, rest interfaces to work with it.",
            "And more more details on this kind of comparison with."
        ],
        [
            "Country in Openshift you can find here.",
            "So the main issue sister exactly this one.",
            "So if you are putting a Cloud Foundry you need an image of VR machines, virtual machines on the provider and also for open open shift and we are not depending on this so you can install the platform on on any Linux machine at this moment.",
            "And the so what's next?",
            "So as you have."
        ],
        [
            "Seeing how we will have enough in the end of the of the winter, the final version of the platform, hopefully testing and stress it by the application that we have inside the project and we are inviting you to use it.",
            "And also we are trying to improve the path from platform services different.",
            "European and national projects.",
            "I'm not sure I have the size now, so for example, Mosaic will continue to be developed inside the Model Clouds project.",
            "I will put some some Flyers outside.",
            "It's about model driven architecture with cloud, so in principle from models will try to generate automatic clouds for four.",
            "So automatic code for the clouds using also the fact that Mosaic will be the runtime environment.",
            "And combine it also with cloud for solar for platform as a service and Moreover I have already mentioned yesterday that in the project host we are trying to provide some high performance computing services.",
            "This kind of platform we use also mosaic behind and.",
            "Today I will talk from the point of view of a national project Amicus that is trying to improve the Mosaic platform from to be a strong tool for providers."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yesterday I had the head of University.",
                    "label": 0
                },
                {
                    "sent": "Today I have another hat.",
                    "label": 0
                },
                {
                    "sent": "Since I am leading a Research Institute in computer science.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It seems to go straight to make sure it's it's a joint.",
                    "label": 0
                },
                {
                    "sent": "A joint activity between three universities.",
                    "label": 0
                },
                {
                    "sent": "Mine western ver.",
                    "label": 0
                },
                {
                    "sent": "City of Timisoara Polytechnic University of Timisoara and Johannes Kepler, University of Linz.",
                    "label": 1
                },
                {
                    "sent": "So how to Institute?",
                    "label": 0
                },
                {
                    "sent": "Mainly we have the research activities connected to the three universities involved in European projects.",
                    "label": 0
                },
                {
                    "sent": "So the topic of today talk will be about Mosaic and I will compliment the facts that you already know from yesterday from our project coordinator.",
                    "label": 0
                },
                {
                    "sent": "I'm just the scientific coordinator of this project.",
                    "label": 0
                },
                {
                    "sent": "So I will talk about.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The little bit about vendor lock in and.",
                    "label": 0
                },
                {
                    "sent": "Our solution for this problem and that should I'm going in details on the architecture of the platform that we propose.",
                    "label": 0
                },
                {
                    "sent": "And I'm pointing also to the role of open source platform.",
                    "label": 1
                },
                {
                    "sent": "So I remind you that the problem of vendor lock in is still there.",
                    "label": 0
                },
                {
                    "sent": "So if we are writing a kind of application, for example for.",
                    "label": 0
                },
                {
                    "sent": "Google application engine.",
                    "label": 0
                },
                {
                    "sent": "We cannot move the code in other environments because the code is not compatible with the APIs of that cloud.",
                    "label": 0
                },
                {
                    "sent": "So we are really locking on a certain technology and if we have problems with the cloud.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The our codes are or.",
                    "label": 0
                },
                {
                    "sent": "We are not satisfied about the condition in which we have contracted the running of the application.",
                    "label": 0
                },
                {
                    "sent": "Then we are stuck on that cloud.",
                    "label": 0
                },
                {
                    "sent": "So the main idea is to protect the application versus this.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Looking so almost like it's.",
                    "label": 0
                },
                {
                    "sent": "Dealing with portability, mainly in the condition that we have already some scenarios of using multiple clouds.",
                    "label": 1
                },
                {
                    "sent": "So today we'll hear also about control that it's working in the Federation of Clouds, so in this case we expect to have some agreements between the clouds so that kind of code it's able to migrate from one cloud to another.",
                    "label": 0
                },
                {
                    "sent": "According to this agreements.",
                    "label": 0
                },
                {
                    "sent": "So the mechanism for moving the overload from one cloud to another are inside the cloud, but Mosaic.",
                    "label": 0
                },
                {
                    "sent": "It's addressing mainly the.",
                    "label": 0
                },
                {
                    "sent": "Market of clouds.",
                    "label": 0
                },
                {
                    "sent": "In which condition we have kind of external broker mechanism brokerage mechanism that according to the requirements of the application, is trying to send parts of the application or the full application to certain cloud.",
                    "label": 0
                },
                {
                    "sent": "So in order to solve this portability problem, we need to abstract the programming differences between different clouds.",
                    "label": 1
                },
                {
                    "sent": "At this moment and this is surely a part of solving the problem of interoperability that.",
                    "label": 1
                },
                {
                    "sent": "It's going be a beyond.",
                    "label": 0
                },
                {
                    "sent": "This should go also to the migration support we are.",
                    "label": 0
                },
                {
                    "sent": "We have just a few options.",
                    "label": 0
                },
                {
                    "sent": "In the case of Mosaic for supporting the migration, support the migration of the codes.",
                    "label": 0
                },
                {
                    "sent": "But Moreover, especially in the Federation or clouds, we need to have agreements between the providers that it's quite hard to obtain.",
                    "label": 0
                },
                {
                    "sent": "It's more simple to solve the technical problem then the political one.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Looking in details to the solutions that are currently available for solving these problems, we can go on different levels, but surely here we are interested on notice technical aspects, so I'm pointing mainly this one so we have already some unified API's like Cloud Sleep cloud, open stack and so on that are trying to solve the problem of the of different APIs.",
                    "label": 0
                },
                {
                    "sent": "But not completely because they are somehow stuck in the way in which the programming programming is done on that API's.",
                    "label": 0
                },
                {
                    "sent": "Then we have protocols that are emerging related to how you are dealing with the with VMS.",
                    "label": 0
                },
                {
                    "sent": "For example on ACI or how you are dealing with the data in CDMA.",
                    "label": 0
                },
                {
                    "sent": "And also they are already from previous projects.",
                    "label": 0
                },
                {
                    "sent": "Some some frameworks related to service level agreements.",
                    "label": 0
                },
                {
                    "sent": "It also most like to use using partially and you have heard yesterday about the components related to semantic discovery and also semantic engine and cloud ontology that our coordinator bananas point to you.",
                    "label": 0
                },
                {
                    "sent": "So in most like we are trying to activate all this stack and to give a kind of integrated solution in one platform so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm saying platform and if we are trying to compare with what we are proposing with what's on the market we should.",
                    "label": 0
                },
                {
                    "sent": "Not the fact that if in the field of infrastructure as a service it's a trend to establish some some standards in the platform as a service to the platform as a service, we have a big problem.",
                    "label": 0
                },
                {
                    "sent": "Becausw assured it's not compatible with Google with Heroku or something else so.",
                    "label": 0
                },
                {
                    "sent": "Are different views how to implement the middleware mainly because of its complexity?",
                    "label": 0
                },
                {
                    "sent": "And portability is currently possible, for example.",
                    "label": 1
                },
                {
                    "sent": "The Project cloud for SOA it's working to.",
                    "label": 0
                },
                {
                    "sent": "Portability between platform as a service, but only between a small number of platform as a service.",
                    "label": 1
                },
                {
                    "sent": "So, especially in the case of open source cloud accounts of the property once.",
                    "label": 0
                },
                {
                    "sent": "And we know that the number of platforms are service very increase because these are helping the developers to forget about the installations.",
                    "label": 0
                },
                {
                    "sent": "So the number of of them will increase and then the problem will become more complex so.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mosaic is trying to push a kind of open source platform as a service that is quite different from the notion of.",
                    "label": 0
                },
                {
                    "sent": "Classical platform as a service that it's a hosting system, so Google Application Engine, Microsoft Azure, Rackspace, Amazon Beanstalk, Salesforce.",
                    "label": 1
                },
                {
                    "sent": "Try and have something to say on this with different approaches.",
                    "label": 0
                },
                {
                    "sent": "Leaving the control, or at least control to the developer as we have indentified, types of working the applications.",
                    "label": 1
                },
                {
                    "sent": "But open source is only to attract the developers in order to allow the customization when we are developing the application but not to the deployment phase.",
                    "label": 0
                },
                {
                    "sent": "To the deployment phase you are stuck on on the resources of a certain provider, so the main idea of Mosaic is to come with a deployable solution that can be used by cloud providers and also the developer in the idea to have a kind of middle, not probably not perfect, but one that it's usable.",
                    "label": 0
                },
                {
                    "sent": "Looking to what has happened in the field, for example of parallel computing with PVM and MPI, bit several solutions.",
                    "label": 0
                },
                {
                    "sent": "Property solution to that moment and also with the defacto standard globals.",
                    "label": 0
                },
                {
                    "sent": "So in the great field.",
                    "label": 0
                },
                {
                    "sent": "So the.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Mosaic that has acronym coming from the Open Source API and platform for multiple clouds.",
                    "label": 1
                },
                {
                    "sent": "It's trying to to offer a tool for the developing portable cloud applications.",
                    "label": 0
                },
                {
                    "sent": "That are consuming hardware and software resources offered by different cloud providers.",
                    "label": 1
                },
                {
                    "sent": "To offer an open source platform as a service that can be deployable by service providers and which can be because it's open source, customize it and the handset by service providers and also to come with a brokerage system to support the decision of cloud service providers to selection at the deployment phase.",
                    "label": 1
                },
                {
                    "sent": "So we are moving in principle the decision of where the code will go.",
                    "label": 0
                },
                {
                    "sent": "From the design phase to the deployment phase.",
                    "label": 0
                },
                {
                    "sent": "So we are writing in an independent way of our application and to the deployment phase we decide where to go.",
                    "label": 0
                },
                {
                    "sent": "Therefore we are trying to ensure the portability.",
                    "label": 0
                },
                {
                    "sent": "So, uh, becausw, we need also to market this this.",
                    "label": 0
                },
                {
                    "sent": "Offer we had also on motor flying through through the clouds that it's trying to explain that the courts will jump in different.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Clouds, so we have quite big consulting for a small for a strip.",
                    "label": 0
                },
                {
                    "sent": "We have started in 2011 with six partners and we have extended it with three partners.",
                    "label": 0
                },
                {
                    "sent": "We are very happy of the contribution from Slovenia from ICS.",
                    "label": 0
                },
                {
                    "sent": "Laba Niversity of Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "And we have been able to deliver earlier than than than requested.",
                    "label": 0
                },
                {
                    "sent": "For example, the implementation for Java was in summer of 2011 already there in the open source repository of Bitbucket.",
                    "label": 0
                },
                {
                    "sent": "We have a now a stable platform as a service, and in the description not work.",
                    "label": 0
                },
                {
                    "sent": "It was stated that we will have a.",
                    "label": 0
                },
                {
                    "sent": "Just the proof of concept implementation also in in Python, but currently we have more than that.",
                    "label": 0
                },
                {
                    "sent": "We have Java, Python, Erlang and an node JS and we expect to deliver the stable version to the end of February.",
                    "label": 0
                },
                {
                    "sent": "But we consider that what it's currently available in Bitbucket.",
                    "label": 0
                },
                {
                    "sent": "It's already usable.",
                    "label": 0
                },
                {
                    "sent": "So I invite you to consider to work with it.",
                    "label": 0
                },
                {
                    "sent": "So I have promised to give some.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Details about.",
                    "label": 0
                },
                {
                    "sent": "The insights of the platform so the platform is coming with several components.",
                    "label": 0
                },
                {
                    "sent": "It's for application for.",
                    "label": 0
                },
                {
                    "sent": "Application that are based on components but itself the architecture of the platform.",
                    "label": 0
                },
                {
                    "sent": "It's based on components, so we have support for application.",
                    "label": 0
                },
                {
                    "sent": "We have support from the classical platform as a service in blue one we have support for connect connecting and the brokerage system for.",
                    "label": 0
                },
                {
                    "sent": "For for different clouds.",
                    "label": 0
                },
                {
                    "sent": "So what I have stated as objective are in these three different colors at this moment.",
                    "label": 0
                },
                {
                    "sent": "And more details I have said that we have the API implementation.",
                    "label": 0
                },
                {
                    "sent": "We have several tools we have.",
                    "label": 0
                },
                {
                    "sent": "You have heard about yesterday, semantic engine service discover.",
                    "label": 1
                },
                {
                    "sent": "We have the core components of the platform and application service components and on the site of support for finding the right cloud for you.",
                    "label": 0
                },
                {
                    "sent": "We have a cloud agency and several agents representing different vendors so.",
                    "label": 0
                },
                {
                    "sent": "In I'm pointing just some some few components.",
                    "label": 0
                },
                {
                    "sent": "For example portable desk cluster.",
                    "label": 0
                },
                {
                    "sent": "It's a component that allows you to simulate the cloud on your desktop, so in the face of debugging your application and writing your application, you can use Eclipse and.",
                    "label": 0
                },
                {
                    "sent": "You can launch on your desktop several virtual machines and look test how will will work.",
                    "label": 0
                },
                {
                    "sent": "This and also portable display cluster as currently.",
                    "label": 0
                },
                {
                    "sent": "Um, some?",
                    "label": 0
                },
                {
                    "sent": "A kind of web interface that allows you to.",
                    "label": 0
                },
                {
                    "sent": "To deploy your application directly in Amazon and Flexion.",
                    "label": 0
                },
                {
                    "sent": "We are working to defer the facility for all providers that we have on our list.",
                    "label": 0
                },
                {
                    "sent": "So it's just a matter of providing the credential and and push a button and the application will be deployed on the facilities.",
                    "label": 0
                },
                {
                    "sent": "So we have also parts of Salina Goshen as you see here, and we are embracing several existing.",
                    "label": 0
                },
                {
                    "sent": "Technologies open source technology in our platform so we have slightly modified versions of React for key value store.",
                    "label": 0
                },
                {
                    "sent": "Watch to be.",
                    "label": 0
                },
                {
                    "sent": "We have also a photo.",
                    "label": 0
                },
                {
                    "sent": "Messaging we are.",
                    "label": 0
                },
                {
                    "sent": "We have rabbit MQ and for example if you want to work with a database for example and you want to just do occur some some virtual machine from Amazon then you can put the reac on top of this virtual machine.",
                    "label": 1
                },
                {
                    "sent": "It's no need to buy also some space in S3 for example, and you are sure that the data are on that virtual machine, so you do not have problems with transfer.",
                    "label": 0
                },
                {
                    "sent": "Of the data from 1 one place to another.",
                    "label": 0
                },
                {
                    "sent": "So on the site of providers we have currently a lot of links to different providers that are connected through the vendor agents and we can.",
                    "label": 1
                },
                {
                    "sent": "We can as you see we have also tried to promote European providers flexi scale.",
                    "label": 0
                },
                {
                    "sent": "Cloud Sigma, Nephites and Hungarian cloud provider actor in high school.",
                    "label": 0
                },
                {
                    "sent": "You know our Slovenian odds and also to have connectors to the the technologies that allow you to create private clouds?",
                    "label": 0
                },
                {
                    "sent": "And you're on your facilities.",
                    "label": 0
                },
                {
                    "sent": "So the we have several strong application that are testing.",
                    "label": 0
                },
                {
                    "sent": "Currently the platform and.",
                    "label": 0
                },
                {
                    "sent": "We have from different fields also computationally intensive application but also data intensive applications.",
                    "label": 1
                },
                {
                    "sent": "The ones from Earth observation sensors also in the intelligent maintenance system.",
                    "label": 0
                },
                {
                    "sent": "We have scientific papers exception.",
                    "label": 0
                },
                {
                    "sent": "They will hear some data from scientific paper extraction.",
                    "label": 0
                },
                {
                    "sent": "So you will hear today about part of this application running on the.",
                    "label": 0
                },
                {
                    "sent": "Most like infrastructure, so I invite you to look sorry for this mistake of the line to look to the Bitbucket repository where we have the codes.",
                    "label": 0
                },
                {
                    "sent": "That allow you to develop the application.",
                    "label": 0
                },
                {
                    "sent": "So her if you want to.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Use it so you can write your application and four languages at this moment in Eclipse interface, for example.",
                    "label": 0
                },
                {
                    "sent": "A drawback is the fact that you should use the event driven style of programming.",
                    "label": 1
                },
                {
                    "sent": "So we have adopted this in order to avoid the number of messages passing through the cloud.",
                    "label": 0
                },
                {
                    "sent": "That is quite different from the current style of synchronization with dark clouds and just Azure.",
                    "label": 0
                },
                {
                    "sent": "And the part of messaging systems are doing this in.",
                    "label": 0
                },
                {
                    "sent": "Frame of clouds.",
                    "label": 1
                },
                {
                    "sent": "So I have already mentioned the personality assessment cluster that you can use and also we have the possibility to assist you in finding the right provider using the cloud agency and broker based on service level agreements and.",
                    "label": 0
                },
                {
                    "sent": "When you are monitoring your application, you are able to stop start different components application 'cause we are using message passing systems.",
                    "label": 0
                },
                {
                    "sent": "So the messages that are moved from one component to another when the component is down or sitting in the queue and when you are placing the component in principle the application should work.",
                    "label": 0
                },
                {
                    "sent": "So we are targeting long running application.",
                    "label": 1
                },
                {
                    "sent": "In principle web application.",
                    "label": 1
                },
                {
                    "sent": "But also as you have seen on the.",
                    "label": 0
                },
                {
                    "sent": "Right side of the of the architecture.",
                    "label": 0
                },
                {
                    "sent": "Also scientific application.",
                    "label": 0
                },
                {
                    "sent": "So this is a difference from from Google Application Engine.",
                    "label": 0
                },
                {
                    "sent": "For example they are targeting only.",
                    "label": 0
                },
                {
                    "sent": "Vibe.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applications, so comparing with what we we have on the on the market now for open source platform that are compatible with Mosaic, I want to point with for example the solution from Contrail because we have today to control here and also to offers from Red Hat and from somewhere.",
                    "label": 0
                },
                {
                    "sent": "So for example can shift is just part partially open.",
                    "label": 0
                },
                {
                    "sent": "So one of the version of this platform, not complete.",
                    "label": 0
                },
                {
                    "sent": "More close, it's the Cloud Foundry and compare with Contrail.",
                    "label": 0
                },
                {
                    "sent": "We have you can see on this kind of colon's what we have is.",
                    "label": 0
                },
                {
                    "sent": "It's very important is the fact that.",
                    "label": 0
                },
                {
                    "sent": "If you're looking on this line, we are able to connect to more more providers, and theoretically it's a matter of one day to make a connector to another provider.",
                    "label": 0
                },
                {
                    "sent": "We have templates for this and also we have several kinds of interfaces.",
                    "label": 0
                },
                {
                    "sent": "FAB Interfaces, Command line, rest interfaces to work with it.",
                    "label": 0
                },
                {
                    "sent": "And more more details on this kind of comparison with.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Country in Openshift you can find here.",
                    "label": 0
                },
                {
                    "sent": "So the main issue sister exactly this one.",
                    "label": 0
                },
                {
                    "sent": "So if you are putting a Cloud Foundry you need an image of VR machines, virtual machines on the provider and also for open open shift and we are not depending on this so you can install the platform on on any Linux machine at this moment.",
                    "label": 0
                },
                {
                    "sent": "And the so what's next?",
                    "label": 0
                },
                {
                    "sent": "So as you have.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Seeing how we will have enough in the end of the of the winter, the final version of the platform, hopefully testing and stress it by the application that we have inside the project and we are inviting you to use it.",
                    "label": 0
                },
                {
                    "sent": "And also we are trying to improve the path from platform services different.",
                    "label": 0
                },
                {
                    "sent": "European and national projects.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure I have the size now, so for example, Mosaic will continue to be developed inside the Model Clouds project.",
                    "label": 0
                },
                {
                    "sent": "I will put some some Flyers outside.",
                    "label": 0
                },
                {
                    "sent": "It's about model driven architecture with cloud, so in principle from models will try to generate automatic clouds for four.",
                    "label": 0
                },
                {
                    "sent": "So automatic code for the clouds using also the fact that Mosaic will be the runtime environment.",
                    "label": 0
                },
                {
                    "sent": "And combine it also with cloud for solar for platform as a service and Moreover I have already mentioned yesterday that in the project host we are trying to provide some high performance computing services.",
                    "label": 0
                },
                {
                    "sent": "This kind of platform we use also mosaic behind and.",
                    "label": 0
                },
                {
                    "sent": "Today I will talk from the point of view of a national project Amicus that is trying to improve the Mosaic platform from to be a strong tool for providers.",
                    "label": 0
                }
            ]
        }
    }
}