{
    "id": "svyhsjtmlec3r5oeplob446g53lcg4z2",
    "title": "Predicting Employee Expertise for Talent Management in the Enterprise",
    "info": {
        "author": [
            "Kush R. Varshney, IBM Thomas J. Watson Research Center"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_varshney_employee_expertise/",
    "segmentation": [
        [
            "So we have the title is predicting employee expertise for talent management in the expert in the enterprise.",
            "So I'm questioning this is joint work with visual gentleman action.",
            "Scott Fancher, Jun Wang, Duncan Fung and Slash grammar solovic Ann.",
            "Everyone except Scott is here at the conference.",
            "Scott is our collaborator from IBM Corporate headquarters in the HR organization."
        ],
        [
            "Right, so let me start with kind of a historical outlook innocence.",
            "So where data mining and analytics have been used in business before.",
            "So the very first places were with machine parts and supply chains, and that sort of stuff.",
            "And then overtime people started using analytics in finance, so that kind of led to CFO's being more strategic positions in corporations.",
            "Then things moved onto analytics being.",
            "Use for customer relationship management and that sort of stuff and then CMO's actually started getting more strategic sort of roles.",
            "And now these days we can say we're in kind of the talent economy and the idea is that now we're dealing with predictive talent models in HR Analytics, so CHRO's are now kind of the ones that are becoming more and more strategic as we go along.",
            "So this is the space that we're working in, so predictive models for HR."
        ],
        [
            "Right, so the largest worldwide employers today are mostly knowledge based enterprises, so the most important asset for these companies is the human capital and what we mean by that is all of the expertise and skills and knowledge that these workers have.",
            "And the most basic of tasks for a Corporation like this is just inventorying the employees according to their expertise."
        ],
        [
            "So why do why does a company need a talent inventory?",
            "So there's several reasons, so the starting point for this is all that there's a quickening pace of technical technological innovation, so there's new product solutions and acquisitions emerging on a very frequent basis.",
            "So in order to inform decision making within the Corporation, you need a lot of this information on expertise of employees to be complete and precise, and accurate and up to date.",
            "So two example use cases of this sort of scenario, so a tactical example would be so if you're constructing a team for a client engagement, let's say, then how do you construct that team in terms of employees skills?",
            "And so that's one example.",
            "A more strategic example is around Corporation determining which emerging area to get into, and in that glad context as well, the company needs to know which people it has, so it can decide whether or not to.",
            "To go into a certain area."
        ],
        [
            "So specifically, the problem statement the of the topic of this paper is to develop predictive analytics based on employees digital footprints to constantly update the current inventory of expertise across an organization and key fact for us is that we want to do this in a way that kind of jives with existing business processes.",
            "And I'll say more on what that means."
        ],
        [
            "Right, so just a few comments on relationships to prior work, so LinkedIn and other similar skill recommendation systems tend to have freeform skill descriptions and one limitation there for when you want to use this sort of stuff within an enterprise is that you need to be able to integrate with existing ecosystems of processing, business processes and reporting tools that have been built around expertise taxonomies, and I will discuss the IBM Corporation later on and that's.",
            "Mean or motivating example?",
            "And another kind of line of prior work on expertise within an enterprise has been based solely on internal social media data and will be looking at a variety of data sources about employees and that same previous work hasn't really integrated with business processes either.",
            "So I'll explain how we are different."
        ],
        [
            "So yeah, as you can guess, since all of the authors are IBM is so we are focused on diploid system within the IBM Corporation, and some details that are relevant for this discussion.",
            "It's a very large company, over 425 thousand employees worldwide, and there engaged in many different job roles.",
            "So things ranging from hardware and software, consulting, research, sales, support and all sorts of other stuff.",
            "I mean, it's bigger than some countries, so you can imagine you need.",
            "People do a lot of different stuff.",
            "So IBM has an expertise taxonomy which is A5 level categorization of the types of things that people do and I'll show you some examples on the next slide and employees assess themselves on an annual basis against this taxonomy based on kind of what they're doing and what skills that they have.",
            "But the issue is since it's a self assessment, significant fraction of employees have incomplete or incorrect data and.",
            "This also gets out of date very quickly as well."
        ],
        [
            "So here's an example of some sample values of the IBM expertise taxonomy.",
            "So as I mentioned, it's five layers, so you have the course defined differentiation here.",
            "So an example of primary job categories sales, and then you get finer and finer so Jabrill specialty would be brand client representative for Bio advanced analytics and optimization.",
            "Or another one would be like research scientist for computational biology.",
            "So in this work, what we want to do is to predict one of these two levels, so the job role or the job role specialty based on the digital footprints of an employee.",
            "Alright, so we want to treat this as a machine learning problem, specifically supervised multiclass classification problem with a very large number of classes and I forgot to mention so throughout IBM they've defined something around 7000.",
            "Different job role specialties and large number of jobs as well.",
            "I think it's close to 1000."
        ],
        [
            "We can split up the population into homogeneous groups so we don't have to deal with the full 7000 class problem at any one time, but it's still like 500 or 600 class problem, potentially for the finer level prediction problem.",
            "We will get their variety of features from the digital footprints of employees, and I'll mention those the next slide.",
            "We want to present the top K predictions as output along with confidence values and in this case misclassification error is actually the true and most appropriate performance metric, which is not always the case in kind of industrial applications.",
            "And we've experimented with a bunch of different classifiers.",
            "1 first, so based on regularize logistic regression L2 and SVM and naive Bayes and so on."
        ],
        [
            "So the features that we use so they come in four categories.",
            "So the first is employee entered free text on their responsibilities.",
            "The second is basic HR information, so this will inform us of things like group structure or the management chain of an employee as well as other sort of information like that we have access to the internal social media, the corporate social media.",
            "So any posts that you make on there that are public and then job specific data sources.",
            "So depending on what job you do, so if your research.",
            "It could be a publications if you're a salesperson.",
            "It could be your sales opportunities.",
            "If your developer could be the code and documentation that you have.",
            "So these are all the information sources that we start with."
        ],
        [
            "So as I mentioned, we run a supervised classification sort of problem so I can go over.",
            "We've done many, many empirical studies.",
            "We included one of them in the paper, so this one was of predicting job roles of salespeople, so this one was in 11 class problem that was fairly imbalanced.",
            "So these are the 11 class labels that we had to me.",
            "I mean, if I were to read these, I don't know what they really mean, what the differences are between them so much, and a lot of people.",
            "Are the same.",
            "They wouldn't really know, but the algorithm will see does pretty well.",
            "So the set of 37,000 employee training set in 5000."
        ],
        [
            "Set, so here's a table from the paper on accuracy.",
            "I'm not going to delve too much into detail, the main point being we can get around 80% accuracy on the 11 class problem."
        ],
        [
            "And when we present more than one prediction per employee, we can get for example, so with three predictions per employee around 96% accuracy, which is quite reasonable for this application of interest."
        ],
        [
            "So we've been now deploying this throughout the Corporation, so we've built a fairly nice user interface and so on.",
            "So again, as I mentioned, we can give more than one prediction for employees, so this shows 3 the top three predictions for example, and we're in the process of rolling this out.",
            "And in the paper it's mentioned that it's in the process now.",
            "We've gotten pretty far along."
        ],
        [
            "So in terms of impact, the initial deployment that we tried without the interface we were obtaining the correct job roles for approximately 4000 sales people, and we estimated that this saved around one person year of effort, so we could eliminate essentially an entire persons job.",
            "So this translates for sales people into $1,000,000 of revenue and if we expand this to the entire Corporation, that would be 20% years of effort.",
            "And that's assuming that we only do assessments once a year.",
            "But the real value of this this work is that we don't have to limit ourselves to annual assessments, so we can keep this expertise in inventory up to date in a dynamic fashion.",
            "So there's a lot of supply chain things that have been developed, but they haven't been for human capital, so we can do all these sort of things for the expert expertise within the Corporation as well."
        ],
        [
            "So to summarize, so talented human capital is knowledge based companies.",
            "Most valuable resource and to best utilize that resource, we need trusted expertise information about it.",
            "So we've developed a classification methodology to predict the expertise of employees based on features from the digital footprints that they leave behind the specific labels that we are trying to classify.",
            "Is based on an expertise taxonomy that is important for for the use cases that we have within the IBM business and we are in the process of deploying the system for use by IBM worldwide in all the business units.",
            "And as I mentioned just now, so the impact beyond just the 20% years of savings in terms of manual effort is that we've kind of transformed the way IBM thinks about expertise, which is that.",
            "It's a continually updating system with with analytics that can be queried at anytime and be up to date and accurate at that point, so we can kind of do better in dynamic business environments because of that.",
            "So."
        ],
        [
            "That's the main part of the talk, and I'd be happy to take questions as well."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have the title is predicting employee expertise for talent management in the expert in the enterprise.",
                    "label": 1
                },
                {
                    "sent": "So I'm questioning this is joint work with visual gentleman action.",
                    "label": 1
                },
                {
                    "sent": "Scott Fancher, Jun Wang, Duncan Fung and Slash grammar solovic Ann.",
                    "label": 0
                },
                {
                    "sent": "Everyone except Scott is here at the conference.",
                    "label": 0
                },
                {
                    "sent": "Scott is our collaborator from IBM Corporate headquarters in the HR organization.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so let me start with kind of a historical outlook innocence.",
                    "label": 0
                },
                {
                    "sent": "So where data mining and analytics have been used in business before.",
                    "label": 0
                },
                {
                    "sent": "So the very first places were with machine parts and supply chains, and that sort of stuff.",
                    "label": 0
                },
                {
                    "sent": "And then overtime people started using analytics in finance, so that kind of led to CFO's being more strategic positions in corporations.",
                    "label": 0
                },
                {
                    "sent": "Then things moved onto analytics being.",
                    "label": 0
                },
                {
                    "sent": "Use for customer relationship management and that sort of stuff and then CMO's actually started getting more strategic sort of roles.",
                    "label": 0
                },
                {
                    "sent": "And now these days we can say we're in kind of the talent economy and the idea is that now we're dealing with predictive talent models in HR Analytics, so CHRO's are now kind of the ones that are becoming more and more strategic as we go along.",
                    "label": 0
                },
                {
                    "sent": "So this is the space that we're working in, so predictive models for HR.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Right, so the largest worldwide employers today are mostly knowledge based enterprises, so the most important asset for these companies is the human capital and what we mean by that is all of the expertise and skills and knowledge that these workers have.",
                    "label": 0
                },
                {
                    "sent": "And the most basic of tasks for a Corporation like this is just inventorying the employees according to their expertise.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why do why does a company need a talent inventory?",
                    "label": 1
                },
                {
                    "sent": "So there's several reasons, so the starting point for this is all that there's a quickening pace of technical technological innovation, so there's new product solutions and acquisitions emerging on a very frequent basis.",
                    "label": 1
                },
                {
                    "sent": "So in order to inform decision making within the Corporation, you need a lot of this information on expertise of employees to be complete and precise, and accurate and up to date.",
                    "label": 1
                },
                {
                    "sent": "So two example use cases of this sort of scenario, so a tactical example would be so if you're constructing a team for a client engagement, let's say, then how do you construct that team in terms of employees skills?",
                    "label": 0
                },
                {
                    "sent": "And so that's one example.",
                    "label": 0
                },
                {
                    "sent": "A more strategic example is around Corporation determining which emerging area to get into, and in that glad context as well, the company needs to know which people it has, so it can decide whether or not to.",
                    "label": 0
                },
                {
                    "sent": "To go into a certain area.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So specifically, the problem statement the of the topic of this paper is to develop predictive analytics based on employees digital footprints to constantly update the current inventory of expertise across an organization and key fact for us is that we want to do this in a way that kind of jives with existing business processes.",
                    "label": 0
                },
                {
                    "sent": "And I'll say more on what that means.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Right, so just a few comments on relationships to prior work, so LinkedIn and other similar skill recommendation systems tend to have freeform skill descriptions and one limitation there for when you want to use this sort of stuff within an enterprise is that you need to be able to integrate with existing ecosystems of processing, business processes and reporting tools that have been built around expertise taxonomies, and I will discuss the IBM Corporation later on and that's.",
                    "label": 1
                },
                {
                    "sent": "Mean or motivating example?",
                    "label": 1
                },
                {
                    "sent": "And another kind of line of prior work on expertise within an enterprise has been based solely on internal social media data and will be looking at a variety of data sources about employees and that same previous work hasn't really integrated with business processes either.",
                    "label": 0
                },
                {
                    "sent": "So I'll explain how we are different.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So yeah, as you can guess, since all of the authors are IBM is so we are focused on diploid system within the IBM Corporation, and some details that are relevant for this discussion.",
                    "label": 1
                },
                {
                    "sent": "It's a very large company, over 425 thousand employees worldwide, and there engaged in many different job roles.",
                    "label": 1
                },
                {
                    "sent": "So things ranging from hardware and software, consulting, research, sales, support and all sorts of other stuff.",
                    "label": 0
                },
                {
                    "sent": "I mean, it's bigger than some countries, so you can imagine you need.",
                    "label": 1
                },
                {
                    "sent": "People do a lot of different stuff.",
                    "label": 0
                },
                {
                    "sent": "So IBM has an expertise taxonomy which is A5 level categorization of the types of things that people do and I'll show you some examples on the next slide and employees assess themselves on an annual basis against this taxonomy based on kind of what they're doing and what skills that they have.",
                    "label": 0
                },
                {
                    "sent": "But the issue is since it's a self assessment, significant fraction of employees have incomplete or incorrect data and.",
                    "label": 0
                },
                {
                    "sent": "This also gets out of date very quickly as well.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here's an example of some sample values of the IBM expertise taxonomy.",
                    "label": 1
                },
                {
                    "sent": "So as I mentioned, it's five layers, so you have the course defined differentiation here.",
                    "label": 0
                },
                {
                    "sent": "So an example of primary job categories sales, and then you get finer and finer so Jabrill specialty would be brand client representative for Bio advanced analytics and optimization.",
                    "label": 1
                },
                {
                    "sent": "Or another one would be like research scientist for computational biology.",
                    "label": 0
                },
                {
                    "sent": "So in this work, what we want to do is to predict one of these two levels, so the job role or the job role specialty based on the digital footprints of an employee.",
                    "label": 1
                },
                {
                    "sent": "Alright, so we want to treat this as a machine learning problem, specifically supervised multiclass classification problem with a very large number of classes and I forgot to mention so throughout IBM they've defined something around 7000.",
                    "label": 0
                },
                {
                    "sent": "Different job role specialties and large number of jobs as well.",
                    "label": 0
                },
                {
                    "sent": "I think it's close to 1000.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can split up the population into homogeneous groups so we don't have to deal with the full 7000 class problem at any one time, but it's still like 500 or 600 class problem, potentially for the finer level prediction problem.",
                    "label": 0
                },
                {
                    "sent": "We will get their variety of features from the digital footprints of employees, and I'll mention those the next slide.",
                    "label": 0
                },
                {
                    "sent": "We want to present the top K predictions as output along with confidence values and in this case misclassification error is actually the true and most appropriate performance metric, which is not always the case in kind of industrial applications.",
                    "label": 1
                },
                {
                    "sent": "And we've experimented with a bunch of different classifiers.",
                    "label": 0
                },
                {
                    "sent": "1 first, so based on regularize logistic regression L2 and SVM and naive Bayes and so on.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the features that we use so they come in four categories.",
                    "label": 0
                },
                {
                    "sent": "So the first is employee entered free text on their responsibilities.",
                    "label": 1
                },
                {
                    "sent": "The second is basic HR information, so this will inform us of things like group structure or the management chain of an employee as well as other sort of information like that we have access to the internal social media, the corporate social media.",
                    "label": 0
                },
                {
                    "sent": "So any posts that you make on there that are public and then job specific data sources.",
                    "label": 0
                },
                {
                    "sent": "So depending on what job you do, so if your research.",
                    "label": 0
                },
                {
                    "sent": "It could be a publications if you're a salesperson.",
                    "label": 0
                },
                {
                    "sent": "It could be your sales opportunities.",
                    "label": 0
                },
                {
                    "sent": "If your developer could be the code and documentation that you have.",
                    "label": 0
                },
                {
                    "sent": "So these are all the information sources that we start with.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as I mentioned, we run a supervised classification sort of problem so I can go over.",
                    "label": 0
                },
                {
                    "sent": "We've done many, many empirical studies.",
                    "label": 0
                },
                {
                    "sent": "We included one of them in the paper, so this one was of predicting job roles of salespeople, so this one was in 11 class problem that was fairly imbalanced.",
                    "label": 1
                },
                {
                    "sent": "So these are the 11 class labels that we had to me.",
                    "label": 0
                },
                {
                    "sent": "I mean, if I were to read these, I don't know what they really mean, what the differences are between them so much, and a lot of people.",
                    "label": 0
                },
                {
                    "sent": "Are the same.",
                    "label": 0
                },
                {
                    "sent": "They wouldn't really know, but the algorithm will see does pretty well.",
                    "label": 1
                },
                {
                    "sent": "So the set of 37,000 employee training set in 5000.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Set, so here's a table from the paper on accuracy.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to delve too much into detail, the main point being we can get around 80% accuracy on the 11 class problem.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And when we present more than one prediction per employee, we can get for example, so with three predictions per employee around 96% accuracy, which is quite reasonable for this application of interest.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we've been now deploying this throughout the Corporation, so we've built a fairly nice user interface and so on.",
                    "label": 0
                },
                {
                    "sent": "So again, as I mentioned, we can give more than one prediction for employees, so this shows 3 the top three predictions for example, and we're in the process of rolling this out.",
                    "label": 0
                },
                {
                    "sent": "And in the paper it's mentioned that it's in the process now.",
                    "label": 0
                },
                {
                    "sent": "We've gotten pretty far along.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in terms of impact, the initial deployment that we tried without the interface we were obtaining the correct job roles for approximately 4000 sales people, and we estimated that this saved around one person year of effort, so we could eliminate essentially an entire persons job.",
                    "label": 1
                },
                {
                    "sent": "So this translates for sales people into $1,000,000 of revenue and if we expand this to the entire Corporation, that would be 20% years of effort.",
                    "label": 0
                },
                {
                    "sent": "And that's assuming that we only do assessments once a year.",
                    "label": 1
                },
                {
                    "sent": "But the real value of this this work is that we don't have to limit ourselves to annual assessments, so we can keep this expertise in inventory up to date in a dynamic fashion.",
                    "label": 0
                },
                {
                    "sent": "So there's a lot of supply chain things that have been developed, but they haven't been for human capital, so we can do all these sort of things for the expert expertise within the Corporation as well.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to summarize, so talented human capital is knowledge based companies.",
                    "label": 0
                },
                {
                    "sent": "Most valuable resource and to best utilize that resource, we need trusted expertise information about it.",
                    "label": 1
                },
                {
                    "sent": "So we've developed a classification methodology to predict the expertise of employees based on features from the digital footprints that they leave behind the specific labels that we are trying to classify.",
                    "label": 1
                },
                {
                    "sent": "Is based on an expertise taxonomy that is important for for the use cases that we have within the IBM business and we are in the process of deploying the system for use by IBM worldwide in all the business units.",
                    "label": 0
                },
                {
                    "sent": "And as I mentioned just now, so the impact beyond just the 20% years of savings in terms of manual effort is that we've kind of transformed the way IBM thinks about expertise, which is that.",
                    "label": 0
                },
                {
                    "sent": "It's a continually updating system with with analytics that can be queried at anytime and be up to date and accurate at that point, so we can kind of do better in dynamic business environments because of that.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's the main part of the talk, and I'd be happy to take questions as well.",
                    "label": 0
                }
            ]
        }
    }
}