{
    "id": "svzysubqbhcq2btd7m4xcasgvhel7xts",
    "title": "The cognitive complexity of OWL justifications",
    "info": {
        "author": [
            "Matthew Horridge, School of Medicine, Stanford University"
        ],
        "published": "Nov. 25, 2011",
        "recorded": "October 2011",
        "category": [
            "Top->Computer Science->Semantic Web->OWL - Web Ontology Language"
        ]
    },
    "url": "http://videolectures.net/iswc2011_horridge_justifications/",
    "segmentation": [
        [
            "So what are justifications then?",
            "Well, there are popular form of explanation and the whole world and basically a justification is a minimal subset of an ontology that's sufficient for an entailment to hold.",
            "So if we think about an ontology which is really just a set of axioms.",
            "And matching that this represents an ontology.",
            "This diagram here and each block represents an axiom.",
            "And we have some entailment that we're interested in, in this case, that is a subclass of B and this follows from our ontology.",
            "Then we can pick out some minimal subset of the ontology.",
            "That supports this entailment and it's minimal in the sense that if we take one AXI amounts of this subset, it breaks the entailments the entailment no longer follows from the remaining axioms in that subset, and this is quite useful because you can imagine that you pick out a handful of axioms from an ontology that could be very, very large indeed.",
            "And the coming multiple justifications, and these can overlap.",
            "However, in this talk I'm going to focus on single justifications and the problems or issues associated with understanding close."
        ],
        [
            "So Speaking of understanding.",
            "Despite the popularity and usefulness of justifications, there's been some anecdotal evidence that justifications can be hard to understand.",
            "Plenty of them are easier to understand what we get from that, hard to understand, and this was a post onto the public.",
            "Our Commons list for feedback for the L2 standard, and this is the gist of it then.",
            "So I was wondering if our one point 1 effort should also look at Ways and Means of standardizing inference explanations, especially to make them user understandable.",
            "The current version of P4 has functionality that identifies the relevant axioms involved in making an inference, so justification but stop short of explaining how the entailments or consequences of these axioms can be chained together to create an explanation, and we also seen some evidence of users were difficult to understand justifications as well in tutorials and from mailing lists."
        ],
        [
            "So this begs the question, what does make a justification difficult to understand?",
            "And can we determine when this is the case?"
        ],
        [
            "So in other words, can we develop some sort of cognitive complexity model for justifications so that given a justification J the cognitive complexity model assigns it some score that says, OK, this is harder.",
            "This is easy the higher the score, the harder the justification is to understand the lower the score, the easier it is to underst."
        ],
        [
            "And.",
            "And why do we want to do this?",
            "Well, there's some various reasons, and here are some of them.",
            "First off, the because there can be multiple justifications for an entailment.",
            "We may actually want to present them in some kind of ordering, so typically they just presented in some kind of list, and it might be nice actually to present the ones that are easier to understand first, so that the user works with those first and then when they come down to the ones are harder.",
            "They might have more of an inkling way those workout and feel more comfortable about the whole thing.",
            "Second reason is that actually it might just be beneficial to flag that a justification is difficult to understand, so you know neophyte user can come to a tool and look at it and say, OK, I might need to go and seek some help elsewhere.",
            "Email someone who knows about this stuff, so failed to decide when to offer assistance or assistance.",
            "Could be in the form of augmenting the justification with Metra aspects to make it easier to understand.",
            "And in fact that's what we've done in some previous work in justification oriented proofs.",
            "And in this work, not only did we use it to decide when to augment justification with extra steps, we actually use the complexity models to drive the generation of these steps so it can be quite involved there.",
            "So just just some reasons as to why you might want one of these cognitive complex."
        ],
        [
            "Models.",
            "So this was previous work that we did with these justification oriented proofs where we actually had a model.",
            "And it was just a simple complexity model, so I'm not going to go into too much detail here, but I just want to give you the flavor of what was in the model, because the main aspects of the talk is how we should validate and validate one of these models and evolve it.",
            "So basically it consists of several components.",
            "That have weightings, and these together computes value scores for how complex is justification is and then they get summed up the end of it and these components pay attention to various aspects or structural or syntactic aspects of justifications.",
            "For example, the different types of axioms are different types of class expressions.",
            "The model, depth of class expressions in actions and justifications, and then some of them require more reasoning.",
            "So for example.",
            "We found that justifications with implicit synonyms of top and bottom in them, or our thing and all.",
            "Nothing in them could be quite hard to understand, so there's some kind of components that require reasoning in there as well.",
            "This model was developed based on results from an exploratory study, and based on our own intuitions."
        ],
        [
            "So we were thinking more about this and we wanted to know how we should actually validate it, or actually how we could validate any cognitive complexity model for justifications in the future.",
            "So how well does this model or actually indeed any complexity model, predict the hardness of justification?",
            "And how can we validate this model?",
            "Or any complexity model?"
        ],
        [
            "So when we think about this, the way forward is doing some kind of user study becausw.",
            "These complexity models predicts the how difficult it is for people to understand the justifications and to do some validation we need to work with people and do this.",
            "And this is the basic idea then.",
            "So if we have some justification in this case, so take the top one.",
            "There's three blobs, represent it in our Intel and social class AB, and suppose the model spits out a result that says, OK, this thing should be easy to understand where the basic idea is, if we have a cohort of participants for study and we ask them to look at it, then they can all understand it.",
            "So these represent our cohort and that X represents people being able to understand it.",
            "So they kind of.",
            "There's a large proportion of them that can understand it.",
            "On the flip side, if we have a hard justification and we show this that the model says is hard and we show this to our cohort, then there's a large proportion of women that can't understand it represented by these crosses here, and Moreover, there's a significant difference between the easy to understand justifications and hard to understand justifications.",
            "So that's the basic idea.",
            "But the hard problem here is.",
            "How can we test understanding and this is where a lot of the remainder of the talk was?",
            "How can we actually test this?",
            "So."
        ],
        [
            "Just to tell you what we actually did in this exploratory study brief briefly, because this informative, we used the think aloud protocol.",
            "So basically we show people justifications.",
            "We ask them to try and understand these justifications, and in doing this we ask them to talk aloud and explain what they were doing, how they were working through it.",
            "And this was quite nice, because this kind of method allows for which data collection you really get an idea of the aspects of justifications that make them hard to understand where people trip up and also what they actually find easy.",
            "Another important aspect is that this think aloud method supports facilitative verification.",
            "So if someone says they understand the justification.",
            "Then the facilitator in this using this protocol, can actually verify that they really do understand that justification.",
            "However, this protocol experiment protocol is quite resource intensive, so it requires one facilitator per participant.",
            "Actually, quite a lot of facilitative time.",
            "I have also problems with remote deployment, so the number of people who can actually do this study or not do this story, but work with our ontologies in the grand scheme of things is quite small and we wanted to broaden the cohorts from outside or Manchester outside our local area to kind of geographically far away locations.",
            "And this think aloud protocol makes that quite difficult."
        ],
        [
            "So we had to think of something else.",
            "So the first thing is that comes to mind, possibly is we could just have some web based survey tool where we just show people justifications one after the other, and then there's some kind of self reporting.",
            "So we just say OK. Do you understand this justification?",
            "Yes no, not sure.",
            "However, there's problems with self reporting in general, and in our case the participant would know it's a justification, and actually this bias can bias them towards saying that they understand it when they don't really, and we actually observe this in the user study because we had think aloud and the facilitator there we could catch this.",
            "So they might say they understood."
        ],
        [
            "When they really don't, so we've got to switch things around a little bit and use some proxy for understanding.",
            "In our case, we decided to use entailment checking as a proxy for understanding, so we switched this task around.",
            "Instead of saying, do you understand this justification?",
            "We show a set of axioms.",
            "And then we say, does this entailment follow from these axioms which were given a target entailment as well?",
            "Yes no, not sure.",
            "So this makes the task bit more crisp and obviously in this case we've got these axioms and we call these in combination with the target entailment items, because these things sets of axioms can be entailing in regards to the target entailment or other candidates entailment 'cause it might not be an intelligent, or I think will be non entailing, so these things were called items in the basic idea then is that we show people these items and hopefully this reduces this.",
            "Play sing effects of asking him whether do you understand this."
        ],
        [
            "Justification.",
            "So this is a screenshot of the survey tool that we actually used in the end, and this is the tool that presents these items to people.",
            "So it just shows a set of axioms with some kind of presentation aspects in there.",
            "So some kind of ordering an indentation which is fairly standard.",
            "People can change the syntax or if they want to Manchester syntax or the DL syntax that can switch between the two, whichever the most comfortable with and, then we have a question, does the above set of axioms entail the following axiom and five options?",
            "Yes, yes, but not sure.",
            "Not sure.",
            "No, but not sure and.",
            "No.",
            "So in the case of where we have this set of axioms entailing it entailing set of axioms for our target entailments, then if a person selects yes or even yes but not sure they succeeded in identifying and understanding how the entailment follows, if they say not sure no, but not sure or no, then this counts as a failure.",
            "So we've got these two notions of success and failure and we can re code the results from this selection here into success or failure.",
            "So basically experiments that we do present a series of these items."
        ],
        [
            "So the next question is, how do we actually get hold of these items, in particular ones that correspond to justifications.",
            "Well, we decided to draw justifications from published ontologies, Real ontologies that people actually building containing some well known ontology collections and ontology repositories.",
            "And we talk some ontologies.",
            "Therefore from the bio portal, the Dumontier Lab collection and this over XP collection.",
            "To hopefully these represent the entailments are people find when their editing ontologies and the kinds of justifications that people look up, and then what we did was we classify these ontologies and we extracted entailments of the form a subclass of B where these were direct subclass axioms.",
            "Unfezant element we computed as many just justifications as we could within 10 minutes and use these policies towards item construction.",
            "So this gave us a pool of 60, four 1800 justifications.",
            "Of these, for these direct some class subsumption axioms, and obviously this is quite a large pool to randomly select some items from and generate some items from this.",
            "But actually if we look a bit closer at the pool while the pool is very very large, the actual logic."
        ],
        [
            "Diversity of the pool is much smaller, so there's a lot of kind of isomorphs of isomorphism going on in there.",
            "So if you imagine that these two justifications in here J1 and J two were in our pool, well, actually they look the same.",
            "They got the same shape, either isomorphic with each other, 'cause the only difference between them is that the one on the left got filler of C for the restriction, and the one that's got a fellow of F for the restriction.",
            "So disregarding length of names and things, if someone can understand J one, they should be able to understand.",
            "Day 2 as well and we don't want to select duplicate items like this from our sample.",
            "When we generate it.",
            "So."
        ],
        [
            "So what we did then was we reduced this pool by pruning.",
            "So we took all the justifications that were isomorphic and generated a new set that were non isomorphic by just taking one representative from each class of isomorphic justifications.",
            "We also decided to cut down the size.",
            "Into the following range.",
            "So we threw out things that were smaller than four axioms or larger than 10 axioms and the reason was we did this word because when we actually looked at them, the small ones were pretty eyeballed in the small ones were very trivial, like one or two axioms and you'll see a picture in a moment and the large ones.",
            "Some of them could get very large, 20 or 30 axioms, and one of the things we wanted to do was measure reading time.",
            "We wanted to measure time for a person to say that understood it and see if there's any.",
            "Relationship between time and difficulty, and we thought that the large ones were bias in length and the reading time too much.",
            "And also they could cause quite a lot of intimidation.",
            "So while now in this range does limit some of the claims we could make if we just took all of them from the pool, we do."
        ],
        [
            "For this.",
            "So they spoiled the pull down to 11,600 justifications, and then after that we used our model.",
            "The model from previous previous work to compute complexity scores.",
            "And we computed the scores and then we.",
            "The maximum was about 2200 over here on the rides and then we build them into bins of size 200.",
            "So the numbers on this graph at the bottom represent the complexity bin and the number of justifications in the bin.",
            "The number of the bars just explicate the numbers of exact numbers of justifications in each bin.",
            "So they were bidding for selection purposes because it's not clear that the model can distinguish something from 100 to 150, for example.",
            "Anne and then what we did was we selected some justifications from the easy and that were predicted to be easy and some that were predicted to be hard to generate, easy and hard items, easy and hard entailing items.",
            "So we took the bottom three non empty bins here 200 to 800 and the top three hard bins 1200 to 1800 on the right inside here and we used these items from these bins."
        ],
        [
            "In our studies.",
            "We carry out three experiments.",
            "The first one was a pilot study.",
            "This was to investigate the actual overall setup to check timings.",
            "We didn't know how long it would take people to progress through these.",
            "Items, so we gave him a few items and measured the overall time to experiment and we didn't want people to suffer from fatigue so didn't vote to force.",
            "People wanted people to answer all the items we gave them, but we don't want people to go on for like an hour or something because there's problems with that, so I'm only going to describe the main experiment and the follow up X worm.",
            "It 'cause the pilot study was the protocol didn't change between the."
        ],
        [
            "She.",
            "So this was our experimental protocol then for the main experiment we had MSE students from a computer science course at the University of Manchester.",
            "There were 14 of them out about 60.",
            "On these MSE students had taken some lecture courses in knowledge representation and reasoning, so they done 5 lots of eight hour courses over the space of five weeks.",
            "None of them had specific training on justifications, and I'd say none of them are non anything about our before hand.",
            "I'm so over this flow line.",
            "At the bottom represents the flow of the experiment, so there were two phases.",
            "One there was a warm up phase where we gave him some practice items.",
            "Easy practice items to get them used to the tool.",
            "All sorts of things and on the right hand side here represents the start after the practice items through to the end of the experiment where we selected an easy item for them.",
            "And gave that CD that is the first items made and feel comfortable.",
            "And then for the remainder of the next three hard items and the next two hard, easy items.",
            "We randomize the order here, so we had three easy items, EM1M2M3 and three hard items.",
            "HM, One HM2HM3.",
            "And on average the experiment took people about, well, nearly 14 minutes with a standard deviation of nearly five minutes."
        ],
        [
            "Now you might be asking the question.",
            "I was just mentioning items in item generation.",
            "So actually, all of our items were entailing items.",
            "We didn't give any non entirely items.",
            "However, we didn't tell them this.",
            "So they believe they were entailing Anon entirely and we didn't spot any signs in the experiment that indicates that they spotted any kind of pattern that this was the case.",
            "And the reasons for this were because the model only predicts the complexity of justifications.",
            "It doesn't predict the complexity of our bridge sets.",
            "Arbitrary sets of actions for non entailments.",
            "In fact, we believe trying to spawn entailment instead of axioms harder.",
            "And it's also not clear how to construct these sets of non entailing axioms as well without introducing some kind of biasing effects we've got naturally occurring justifications, but we don't have the same in terms of non entailing sets of axioms and finally.",
            "Given that the time was limited, we didn't want to force people to go on for hours.",
            "People could only look at a handful of items and we run to the maximum data information justifications rather than non and telling set."
        ],
        [
            "Chuck seems so.",
            "The good reasons for that in terms of results.",
            "Then here are the results.",
            "So overall the easy to remember failure occurs because they were all entailing items.",
            "Failure occurs if they answered no no, but not sure or not sure for this accidental Bayou sets of axioms, so a failure occurred roughly for the easier ones less than it did for the hard ones, except there were a couple of anomalies that come onto an moment.",
            "I just forgot the times we did measure times 'cause we thought that might be informative, but in actual fact when we performed some tests on this, we performed paired sample to tell T tests, But we didn't spot any significant differences between the easy and hard items in terms of time.",
            "So we didn't look any further at times."
        ],
        [
            "To analyze the errors over proportions, we use something called the Cochran Q test, and this actually comes from, well, a lot of medical experiments use this so.",
            "If you consider various treatments and various participate, various participants in these treatments, then this looks the weather.",
            "These treatments succeed or fail, and whether any difference between the treatments or whether it just it just caused by chance and as far as we're concerned, are treatments really correspond to justifications.",
            "On our success corresponds to someone said yes.",
            "The Interment follows.",
            "In our failure, no, it doesn't.",
            "And the nice thing here is that it really takes into consideration the pairing of the relationship along the top holes here.",
            "So along the different treatments, it's not just OK. We got six failures here.",
            "We got 12 failures here.",
            "Yes, there's a difference.",
            "There really is a relationship and you would be very careful when you're choosing your tests."
        ],
        [
            "To deal with this kind of thing.",
            "So.",
            "For some of the items in one M2 compared to the hard items, HM One and HM Two.",
            "We did the test and the test revealed that this highly significant differences here, so this was quite pleasing, but there were some anomalies so we're looking for anything of a P value below 0.05."
        ],
        [
            "There were some anomalies and these were to do with items M3 and HM3 down here where we really got that there was no significant difference at all and we had some conjectures as to why was this the case, but basically we are model predicted HM Three to be hard, but there was no significant difference in error proportion from easy items and with the M3R model predicted it to be easy, but there was no significant difference.",
            "No proportion from hard items.",
            "So we've got a conjecture that with the hard won the models correct.",
            "You'll see are why we think so, any moment but participants got it right for the wrong reasons, and in some sense this shows up as one of the limitations of the study.",
            "And in the case of M3 we conjectured that actually the model did Phil genuinely here, and I'll show you."
        ],
        [
            "Why So what we did?",
            "We did a follow up study 'cause one of the disadvantages of the kind of standalone study.",
            "Was that we didn't have this think aloud, so we couldn't determine what people actually do, so we took.",
            "We took some other students to raise one PhD student or very experienced with all non taken part in the main experiment or pilot study.",
            "And we use the same protocol but with the addition of the think Aloud protocol, and we also used an eye tracker to look at what they were doing.",
            "Becausw of what we're conjecturing.",
            "So the hard way."
        ],
        [
            "First, where we think the model is correct.",
            "So this shows a heat map of the justification.",
            "And you can see there's a lot of concentration along the bottom axiom here where we've got C2 is equivalent to exist Prop 1C3 and some concentration on the top.",
            "C1 is a subclass of floor prop 1C3.",
            "The entailment the target entailment is is C1 subclass of C2 entailed.",
            "Now there's actually a lot going on in here and what happened in the follow up study was that all three people just focused on this bottom axiom here.",
            "The new life.",
            "The Interment was required.",
            "They needed all of them, but they focused on this bottom Maxim here.",
            "This part of it where you see the red concentration and the top one, and then the think aloud revealed that people were saying OK, see you on I need a prop.",
            "1C3 and C223 did about a bit.",
            "OK yes it's entailed.",
            "So that was quite insightful.",
            "But when we actually showed this to other people.",
            "As well outside.",
            "So all of the three people got this wrong and we showed this other people.",
            "Other people find it really quite difficult as well.",
            "So we believe the models right here, but it's a limitation of the protocol."
        ],
        [
            "All of the main study protocol and for our other one M3, we actually believe the model failed here.",
            "So in this one we have the model predicted.",
            "This was an easy justification and an actual facts.",
            "It turned out to be no different justifications, statistically significant difference, and in the follow up study people had problems with this as well.",
            "So people thought this entailment didn't hold and people got fixated on this third axiom down.",
            "C4 is equivalent to C5 and exist problem.",
            "1C6 kept going over and over that exist.",
            "Prop 1C6 is superfluous as far as the entailment is concerned.",
            "It doesn't matter at all.",
            "But they got fixated on that and then fixated on the other prop one in the existential restriction on the 1234 fifth axiom down and eventually said, OK. Now I don't think the entailment holds, so superfluity here was really, really distracting, and our model doesn't deal with that.",
            "So it highlighted in area for model improvement.",
            "So that was the overall protocol we use.",
            "This kind of standalone protocol where people need supervision and then use this kind of follow up protocol with eye tracking and more followers more think aloud.",
            "To investigate anomaly."
        ],
        [
            "In there.",
            "And in terms of lessons learned and summary well.",
            "I would argue the complexity model performed reasonably well, but there is some areas for improvement and these were highlighted by the study.",
            "In particular the follow up.",
            "So the main study, highlighted anomalies and the follow up.",
            "She gave us more deep, deeper insights.",
            "The reasons why overall would say this cheaper testing is possible.",
            "But provided carries taken when you interpret the results.",
            "So where you see anomalies as is necessary to have some kind of small follow-up studies to find out what's going on, becausw the standalone one where we don't have, think aloud, and obviously doesn't explain why something is difficult or easy.",
            "Overall, this is.",
            "Quite a well defined protocol actually for complexity model testing, and this has several advantages.",
            "Mainly repeatability and comparison.",
            "So third parties can take the protocol and try and repeat it in their labs, which will be really useful.",
            "And also they could use it to refine and extend the model or without the role models.",
            "Also, I think it is a detailed user study with detailed analysis and statistical tools to inferential statistics and hopefully this will give people more of an idea to do these user based studies because of not so many are done in this particular area.",
            "So thanks very much.",
            "So obviously people are very different as United and they think differently when they try to understand results logical inferencing.",
            "So if you supply this tool to something like product which generates justifications, do you think you can use single model regardless of what kind of person is working or your model should require some extensions to separately tuning for specific type of user or something like that so we imagine.",
            "Actually, more model doesn't necessarily fit the bill here.",
            "We don't have resources to test multiple models, but you can imagine a model that's more sensitive to certain patterns of axioms of things for neophyte users who aren't necessarily familiar with things, and then for more advanced users, they could turn bits of it off, or have preconfigured models, and there's too much noise, and it's lagging all the time, so I know this might be difficult.",
            "You could kind of scale it down a little bit.",
            "I think, given the protocol and that everything is there and it should be easy to replicate without too much thinking that they could further people to develop their own models and and try to follow it.",
            "This up because we've got the corpus there now as well and just see how things evolve really.",
            "I take it from what you said that the eye tracking was principally so you could figure out what where they were dwelling.",
            "You didn't make any other use of it.",
            "Is that right?",
            "Yeah, so the eye tracking was used.",
            "'cause we?",
            "Had this idea that this thing contained some superfluous parts and OK to think aloud would reveal that.",
            "People were fixated on this third axiom, but actually the eye tracking was much more revealing and more striking.",
            "'cause as soon as we saw this, it really sort of make things clearer where people were looking and how people actually read through these things, as well as quite really quite interesting.",
            "So you'd think that people experienced in.",
            "Theorem proving who studied that third thing a lot that there are the eye track record would really should reveal that there also looking around where the heck is SI 6 found anywhere else in there you would think so soon, all of whom were involved with theorem proving, but they were very experienced with our but.",
            "Yeah you you might think so.",
            "So usually after some time some people got to that, but.",
            "I know so they never said why they dwelled on.",
            "I think it was one person who said, no, they never said well.",
            "Then we ask them to look at it in a kind of natural possible setting.",
            "As usual, there's no facilitator, intervention or anything like that or specific.",
            "Follow up questions and then most of them afterwards.",
            "Don't remember what they actually actually did anyway, so the tracker was great for capturing this.",
            "We got the audio recordings of it as well.",
            "Alright, got to do some more experiments with my tracker as well.",
            "I you used anonymized terms rather than natural terms, would it have made it?",
            "But why did you do that?",
            "And would it have made a difference with natural terms so?",
            "The reason why we did this was, well, there are a couple of reasons.",
            "One, the natural terms can be really, really long.",
            "Some of these bio ontologies and just get quite big and we didn't want to deal with things outside of presentation of things really.",
            "We want to just just focus on what was going on in the logic.",
            "So we hope that that would prove that.",
            "Would that would help negate that effects.",
            "And also we before the exploratory study we did a pilot study for that as well.",
            "And we found that some of the biologists, bioinformaticians, rather that looks at this, would just block through justifications and things and then use their domain knowledge without actually trying to work through things.",
            "Right?",
            "That would happen in reality as well, but really we wanted to try and make this a little bit more controlled and isolate some of these factors so that didn't come from the results.",
            "So that's why we did it, but I could see pros and cons.",
            "Both sides of things so.",
            "Thanks, Mike."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what are justifications then?",
                    "label": 0
                },
                {
                    "sent": "Well, there are popular form of explanation and the whole world and basically a justification is a minimal subset of an ontology that's sufficient for an entailment to hold.",
                    "label": 0
                },
                {
                    "sent": "So if we think about an ontology which is really just a set of axioms.",
                    "label": 0
                },
                {
                    "sent": "And matching that this represents an ontology.",
                    "label": 0
                },
                {
                    "sent": "This diagram here and each block represents an axiom.",
                    "label": 0
                },
                {
                    "sent": "And we have some entailment that we're interested in, in this case, that is a subclass of B and this follows from our ontology.",
                    "label": 0
                },
                {
                    "sent": "Then we can pick out some minimal subset of the ontology.",
                    "label": 0
                },
                {
                    "sent": "That supports this entailment and it's minimal in the sense that if we take one AXI amounts of this subset, it breaks the entailments the entailment no longer follows from the remaining axioms in that subset, and this is quite useful because you can imagine that you pick out a handful of axioms from an ontology that could be very, very large indeed.",
                    "label": 0
                },
                {
                    "sent": "And the coming multiple justifications, and these can overlap.",
                    "label": 0
                },
                {
                    "sent": "However, in this talk I'm going to focus on single justifications and the problems or issues associated with understanding close.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So Speaking of understanding.",
                    "label": 0
                },
                {
                    "sent": "Despite the popularity and usefulness of justifications, there's been some anecdotal evidence that justifications can be hard to understand.",
                    "label": 0
                },
                {
                    "sent": "Plenty of them are easier to understand what we get from that, hard to understand, and this was a post onto the public.",
                    "label": 0
                },
                {
                    "sent": "Our Commons list for feedback for the L2 standard, and this is the gist of it then.",
                    "label": 0
                },
                {
                    "sent": "So I was wondering if our one point 1 effort should also look at Ways and Means of standardizing inference explanations, especially to make them user understandable.",
                    "label": 1
                },
                {
                    "sent": "The current version of P4 has functionality that identifies the relevant axioms involved in making an inference, so justification but stop short of explaining how the entailments or consequences of these axioms can be chained together to create an explanation, and we also seen some evidence of users were difficult to understand justifications as well in tutorials and from mailing lists.",
                    "label": 1
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this begs the question, what does make a justification difficult to understand?",
                    "label": 0
                },
                {
                    "sent": "And can we determine when this is the case?",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in other words, can we develop some sort of cognitive complexity model for justifications so that given a justification J the cognitive complexity model assigns it some score that says, OK, this is harder.",
                    "label": 0
                },
                {
                    "sent": "This is easy the higher the score, the harder the justification is to understand the lower the score, the easier it is to underst.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And why do we want to do this?",
                    "label": 0
                },
                {
                    "sent": "Well, there's some various reasons, and here are some of them.",
                    "label": 0
                },
                {
                    "sent": "First off, the because there can be multiple justifications for an entailment.",
                    "label": 1
                },
                {
                    "sent": "We may actually want to present them in some kind of ordering, so typically they just presented in some kind of list, and it might be nice actually to present the ones that are easier to understand first, so that the user works with those first and then when they come down to the ones are harder.",
                    "label": 0
                },
                {
                    "sent": "They might have more of an inkling way those workout and feel more comfortable about the whole thing.",
                    "label": 0
                },
                {
                    "sent": "Second reason is that actually it might just be beneficial to flag that a justification is difficult to understand, so you know neophyte user can come to a tool and look at it and say, OK, I might need to go and seek some help elsewhere.",
                    "label": 0
                },
                {
                    "sent": "Email someone who knows about this stuff, so failed to decide when to offer assistance or assistance.",
                    "label": 1
                },
                {
                    "sent": "Could be in the form of augmenting the justification with Metra aspects to make it easier to understand.",
                    "label": 0
                },
                {
                    "sent": "And in fact that's what we've done in some previous work in justification oriented proofs.",
                    "label": 0
                },
                {
                    "sent": "And in this work, not only did we use it to decide when to augment justification with extra steps, we actually use the complexity models to drive the generation of these steps so it can be quite involved there.",
                    "label": 0
                },
                {
                    "sent": "So just just some reasons as to why you might want one of these cognitive complex.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Models.",
                    "label": 0
                },
                {
                    "sent": "So this was previous work that we did with these justification oriented proofs where we actually had a model.",
                    "label": 0
                },
                {
                    "sent": "And it was just a simple complexity model, so I'm not going to go into too much detail here, but I just want to give you the flavor of what was in the model, because the main aspects of the talk is how we should validate and validate one of these models and evolve it.",
                    "label": 0
                },
                {
                    "sent": "So basically it consists of several components.",
                    "label": 0
                },
                {
                    "sent": "That have weightings, and these together computes value scores for how complex is justification is and then they get summed up the end of it and these components pay attention to various aspects or structural or syntactic aspects of justifications.",
                    "label": 0
                },
                {
                    "sent": "For example, the different types of axioms are different types of class expressions.",
                    "label": 1
                },
                {
                    "sent": "The model, depth of class expressions in actions and justifications, and then some of them require more reasoning.",
                    "label": 0
                },
                {
                    "sent": "So for example.",
                    "label": 0
                },
                {
                    "sent": "We found that justifications with implicit synonyms of top and bottom in them, or our thing and all.",
                    "label": 0
                },
                {
                    "sent": "Nothing in them could be quite hard to understand, so there's some kind of components that require reasoning in there as well.",
                    "label": 0
                },
                {
                    "sent": "This model was developed based on results from an exploratory study, and based on our own intuitions.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we were thinking more about this and we wanted to know how we should actually validate it, or actually how we could validate any cognitive complexity model for justifications in the future.",
                    "label": 0
                },
                {
                    "sent": "So how well does this model or actually indeed any complexity model, predict the hardness of justification?",
                    "label": 1
                },
                {
                    "sent": "And how can we validate this model?",
                    "label": 0
                },
                {
                    "sent": "Or any complexity model?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So when we think about this, the way forward is doing some kind of user study becausw.",
                    "label": 0
                },
                {
                    "sent": "These complexity models predicts the how difficult it is for people to understand the justifications and to do some validation we need to work with people and do this.",
                    "label": 0
                },
                {
                    "sent": "And this is the basic idea then.",
                    "label": 0
                },
                {
                    "sent": "So if we have some justification in this case, so take the top one.",
                    "label": 0
                },
                {
                    "sent": "There's three blobs, represent it in our Intel and social class AB, and suppose the model spits out a result that says, OK, this thing should be easy to understand where the basic idea is, if we have a cohort of participants for study and we ask them to look at it, then they can all understand it.",
                    "label": 0
                },
                {
                    "sent": "So these represent our cohort and that X represents people being able to understand it.",
                    "label": 0
                },
                {
                    "sent": "So they kind of.",
                    "label": 0
                },
                {
                    "sent": "There's a large proportion of them that can understand it.",
                    "label": 0
                },
                {
                    "sent": "On the flip side, if we have a hard justification and we show this that the model says is hard and we show this to our cohort, then there's a large proportion of women that can't understand it represented by these crosses here, and Moreover, there's a significant difference between the easy to understand justifications and hard to understand justifications.",
                    "label": 0
                },
                {
                    "sent": "So that's the basic idea.",
                    "label": 1
                },
                {
                    "sent": "But the hard problem here is.",
                    "label": 0
                },
                {
                    "sent": "How can we test understanding and this is where a lot of the remainder of the talk was?",
                    "label": 0
                },
                {
                    "sent": "How can we actually test this?",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to tell you what we actually did in this exploratory study brief briefly, because this informative, we used the think aloud protocol.",
                    "label": 0
                },
                {
                    "sent": "So basically we show people justifications.",
                    "label": 0
                },
                {
                    "sent": "We ask them to try and understand these justifications, and in doing this we ask them to talk aloud and explain what they were doing, how they were working through it.",
                    "label": 0
                },
                {
                    "sent": "And this was quite nice, because this kind of method allows for which data collection you really get an idea of the aspects of justifications that make them hard to understand where people trip up and also what they actually find easy.",
                    "label": 0
                },
                {
                    "sent": "Another important aspect is that this think aloud method supports facilitative verification.",
                    "label": 0
                },
                {
                    "sent": "So if someone says they understand the justification.",
                    "label": 0
                },
                {
                    "sent": "Then the facilitator in this using this protocol, can actually verify that they really do understand that justification.",
                    "label": 0
                },
                {
                    "sent": "However, this protocol experiment protocol is quite resource intensive, so it requires one facilitator per participant.",
                    "label": 0
                },
                {
                    "sent": "Actually, quite a lot of facilitative time.",
                    "label": 0
                },
                {
                    "sent": "I have also problems with remote deployment, so the number of people who can actually do this study or not do this story, but work with our ontologies in the grand scheme of things is quite small and we wanted to broaden the cohorts from outside or Manchester outside our local area to kind of geographically far away locations.",
                    "label": 0
                },
                {
                    "sent": "And this think aloud protocol makes that quite difficult.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we had to think of something else.",
                    "label": 0
                },
                {
                    "sent": "So the first thing is that comes to mind, possibly is we could just have some web based survey tool where we just show people justifications one after the other, and then there's some kind of self reporting.",
                    "label": 0
                },
                {
                    "sent": "So we just say OK. Do you understand this justification?",
                    "label": 1
                },
                {
                    "sent": "Yes no, not sure.",
                    "label": 0
                },
                {
                    "sent": "However, there's problems with self reporting in general, and in our case the participant would know it's a justification, and actually this bias can bias them towards saying that they understand it when they don't really, and we actually observe this in the user study because we had think aloud and the facilitator there we could catch this.",
                    "label": 0
                },
                {
                    "sent": "So they might say they understood.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When they really don't, so we've got to switch things around a little bit and use some proxy for understanding.",
                    "label": 0
                },
                {
                    "sent": "In our case, we decided to use entailment checking as a proxy for understanding, so we switched this task around.",
                    "label": 1
                },
                {
                    "sent": "Instead of saying, do you understand this justification?",
                    "label": 0
                },
                {
                    "sent": "We show a set of axioms.",
                    "label": 1
                },
                {
                    "sent": "And then we say, does this entailment follow from these axioms which were given a target entailment as well?",
                    "label": 0
                },
                {
                    "sent": "Yes no, not sure.",
                    "label": 0
                },
                {
                    "sent": "So this makes the task bit more crisp and obviously in this case we've got these axioms and we call these in combination with the target entailment items, because these things sets of axioms can be entailing in regards to the target entailment or other candidates entailment 'cause it might not be an intelligent, or I think will be non entailing, so these things were called items in the basic idea then is that we show people these items and hopefully this reduces this.",
                    "label": 0
                },
                {
                    "sent": "Play sing effects of asking him whether do you understand this.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Justification.",
                    "label": 0
                },
                {
                    "sent": "So this is a screenshot of the survey tool that we actually used in the end, and this is the tool that presents these items to people.",
                    "label": 0
                },
                {
                    "sent": "So it just shows a set of axioms with some kind of presentation aspects in there.",
                    "label": 0
                },
                {
                    "sent": "So some kind of ordering an indentation which is fairly standard.",
                    "label": 0
                },
                {
                    "sent": "People can change the syntax or if they want to Manchester syntax or the DL syntax that can switch between the two, whichever the most comfortable with and, then we have a question, does the above set of axioms entail the following axiom and five options?",
                    "label": 0
                },
                {
                    "sent": "Yes, yes, but not sure.",
                    "label": 0
                },
                {
                    "sent": "Not sure.",
                    "label": 0
                },
                {
                    "sent": "No, but not sure and.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "So in the case of where we have this set of axioms entailing it entailing set of axioms for our target entailments, then if a person selects yes or even yes but not sure they succeeded in identifying and understanding how the entailment follows, if they say not sure no, but not sure or no, then this counts as a failure.",
                    "label": 0
                },
                {
                    "sent": "So we've got these two notions of success and failure and we can re code the results from this selection here into success or failure.",
                    "label": 0
                },
                {
                    "sent": "So basically experiments that we do present a series of these items.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the next question is, how do we actually get hold of these items, in particular ones that correspond to justifications.",
                    "label": 0
                },
                {
                    "sent": "Well, we decided to draw justifications from published ontologies, Real ontologies that people actually building containing some well known ontology collections and ontology repositories.",
                    "label": 0
                },
                {
                    "sent": "And we talk some ontologies.",
                    "label": 0
                },
                {
                    "sent": "Therefore from the bio portal, the Dumontier Lab collection and this over XP collection.",
                    "label": 0
                },
                {
                    "sent": "To hopefully these represent the entailments are people find when their editing ontologies and the kinds of justifications that people look up, and then what we did was we classify these ontologies and we extracted entailments of the form a subclass of B where these were direct subclass axioms.",
                    "label": 0
                },
                {
                    "sent": "Unfezant element we computed as many just justifications as we could within 10 minutes and use these policies towards item construction.",
                    "label": 1
                },
                {
                    "sent": "So this gave us a pool of 60, four 1800 justifications.",
                    "label": 0
                },
                {
                    "sent": "Of these, for these direct some class subsumption axioms, and obviously this is quite a large pool to randomly select some items from and generate some items from this.",
                    "label": 0
                },
                {
                    "sent": "But actually if we look a bit closer at the pool while the pool is very very large, the actual logic.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Diversity of the pool is much smaller, so there's a lot of kind of isomorphs of isomorphism going on in there.",
                    "label": 0
                },
                {
                    "sent": "So if you imagine that these two justifications in here J1 and J two were in our pool, well, actually they look the same.",
                    "label": 0
                },
                {
                    "sent": "They got the same shape, either isomorphic with each other, 'cause the only difference between them is that the one on the left got filler of C for the restriction, and the one that's got a fellow of F for the restriction.",
                    "label": 0
                },
                {
                    "sent": "So disregarding length of names and things, if someone can understand J one, they should be able to understand.",
                    "label": 0
                },
                {
                    "sent": "Day 2 as well and we don't want to select duplicate items like this from our sample.",
                    "label": 0
                },
                {
                    "sent": "When we generate it.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we did then was we reduced this pool by pruning.",
                    "label": 0
                },
                {
                    "sent": "So we took all the justifications that were isomorphic and generated a new set that were non isomorphic by just taking one representative from each class of isomorphic justifications.",
                    "label": 0
                },
                {
                    "sent": "We also decided to cut down the size.",
                    "label": 0
                },
                {
                    "sent": "Into the following range.",
                    "label": 0
                },
                {
                    "sent": "So we threw out things that were smaller than four axioms or larger than 10 axioms and the reason was we did this word because when we actually looked at them, the small ones were pretty eyeballed in the small ones were very trivial, like one or two axioms and you'll see a picture in a moment and the large ones.",
                    "label": 0
                },
                {
                    "sent": "Some of them could get very large, 20 or 30 axioms, and one of the things we wanted to do was measure reading time.",
                    "label": 0
                },
                {
                    "sent": "We wanted to measure time for a person to say that understood it and see if there's any.",
                    "label": 0
                },
                {
                    "sent": "Relationship between time and difficulty, and we thought that the large ones were bias in length and the reading time too much.",
                    "label": 0
                },
                {
                    "sent": "And also they could cause quite a lot of intimidation.",
                    "label": 0
                },
                {
                    "sent": "So while now in this range does limit some of the claims we could make if we just took all of them from the pool, we do.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For this.",
                    "label": 0
                },
                {
                    "sent": "So they spoiled the pull down to 11,600 justifications, and then after that we used our model.",
                    "label": 0
                },
                {
                    "sent": "The model from previous previous work to compute complexity scores.",
                    "label": 0
                },
                {
                    "sent": "And we computed the scores and then we.",
                    "label": 0
                },
                {
                    "sent": "The maximum was about 2200 over here on the rides and then we build them into bins of size 200.",
                    "label": 0
                },
                {
                    "sent": "So the numbers on this graph at the bottom represent the complexity bin and the number of justifications in the bin.",
                    "label": 0
                },
                {
                    "sent": "The number of the bars just explicate the numbers of exact numbers of justifications in each bin.",
                    "label": 0
                },
                {
                    "sent": "So they were bidding for selection purposes because it's not clear that the model can distinguish something from 100 to 150, for example.",
                    "label": 0
                },
                {
                    "sent": "Anne and then what we did was we selected some justifications from the easy and that were predicted to be easy and some that were predicted to be hard to generate, easy and hard items, easy and hard entailing items.",
                    "label": 0
                },
                {
                    "sent": "So we took the bottom three non empty bins here 200 to 800 and the top three hard bins 1200 to 1800 on the right inside here and we used these items from these bins.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In our studies.",
                    "label": 0
                },
                {
                    "sent": "We carry out three experiments.",
                    "label": 0
                },
                {
                    "sent": "The first one was a pilot study.",
                    "label": 1
                },
                {
                    "sent": "This was to investigate the actual overall setup to check timings.",
                    "label": 0
                },
                {
                    "sent": "We didn't know how long it would take people to progress through these.",
                    "label": 0
                },
                {
                    "sent": "Items, so we gave him a few items and measured the overall time to experiment and we didn't want people to suffer from fatigue so didn't vote to force.",
                    "label": 0
                },
                {
                    "sent": "People wanted people to answer all the items we gave them, but we don't want people to go on for like an hour or something because there's problems with that, so I'm only going to describe the main experiment and the follow up X worm.",
                    "label": 0
                },
                {
                    "sent": "It 'cause the pilot study was the protocol didn't change between the.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "So this was our experimental protocol then for the main experiment we had MSE students from a computer science course at the University of Manchester.",
                    "label": 0
                },
                {
                    "sent": "There were 14 of them out about 60.",
                    "label": 0
                },
                {
                    "sent": "On these MSE students had taken some lecture courses in knowledge representation and reasoning, so they done 5 lots of eight hour courses over the space of five weeks.",
                    "label": 0
                },
                {
                    "sent": "None of them had specific training on justifications, and I'd say none of them are non anything about our before hand.",
                    "label": 1
                },
                {
                    "sent": "I'm so over this flow line.",
                    "label": 0
                },
                {
                    "sent": "At the bottom represents the flow of the experiment, so there were two phases.",
                    "label": 0
                },
                {
                    "sent": "One there was a warm up phase where we gave him some practice items.",
                    "label": 1
                },
                {
                    "sent": "Easy practice items to get them used to the tool.",
                    "label": 0
                },
                {
                    "sent": "All sorts of things and on the right hand side here represents the start after the practice items through to the end of the experiment where we selected an easy item for them.",
                    "label": 0
                },
                {
                    "sent": "And gave that CD that is the first items made and feel comfortable.",
                    "label": 0
                },
                {
                    "sent": "And then for the remainder of the next three hard items and the next two hard, easy items.",
                    "label": 1
                },
                {
                    "sent": "We randomize the order here, so we had three easy items, EM1M2M3 and three hard items.",
                    "label": 0
                },
                {
                    "sent": "HM, One HM2HM3.",
                    "label": 0
                },
                {
                    "sent": "And on average the experiment took people about, well, nearly 14 minutes with a standard deviation of nearly five minutes.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now you might be asking the question.",
                    "label": 0
                },
                {
                    "sent": "I was just mentioning items in item generation.",
                    "label": 0
                },
                {
                    "sent": "So actually, all of our items were entailing items.",
                    "label": 0
                },
                {
                    "sent": "We didn't give any non entirely items.",
                    "label": 0
                },
                {
                    "sent": "However, we didn't tell them this.",
                    "label": 0
                },
                {
                    "sent": "So they believe they were entailing Anon entirely and we didn't spot any signs in the experiment that indicates that they spotted any kind of pattern that this was the case.",
                    "label": 0
                },
                {
                    "sent": "And the reasons for this were because the model only predicts the complexity of justifications.",
                    "label": 0
                },
                {
                    "sent": "It doesn't predict the complexity of our bridge sets.",
                    "label": 0
                },
                {
                    "sent": "Arbitrary sets of actions for non entailments.",
                    "label": 0
                },
                {
                    "sent": "In fact, we believe trying to spawn entailment instead of axioms harder.",
                    "label": 0
                },
                {
                    "sent": "And it's also not clear how to construct these sets of non entailing axioms as well without introducing some kind of biasing effects we've got naturally occurring justifications, but we don't have the same in terms of non entailing sets of axioms and finally.",
                    "label": 0
                },
                {
                    "sent": "Given that the time was limited, we didn't want to force people to go on for hours.",
                    "label": 0
                },
                {
                    "sent": "People could only look at a handful of items and we run to the maximum data information justifications rather than non and telling set.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Chuck seems so.",
                    "label": 0
                },
                {
                    "sent": "The good reasons for that in terms of results.",
                    "label": 0
                },
                {
                    "sent": "Then here are the results.",
                    "label": 0
                },
                {
                    "sent": "So overall the easy to remember failure occurs because they were all entailing items.",
                    "label": 0
                },
                {
                    "sent": "Failure occurs if they answered no no, but not sure or not sure for this accidental Bayou sets of axioms, so a failure occurred roughly for the easier ones less than it did for the hard ones, except there were a couple of anomalies that come onto an moment.",
                    "label": 1
                },
                {
                    "sent": "I just forgot the times we did measure times 'cause we thought that might be informative, but in actual fact when we performed some tests on this, we performed paired sample to tell T tests, But we didn't spot any significant differences between the easy and hard items in terms of time.",
                    "label": 0
                },
                {
                    "sent": "So we didn't look any further at times.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To analyze the errors over proportions, we use something called the Cochran Q test, and this actually comes from, well, a lot of medical experiments use this so.",
                    "label": 0
                },
                {
                    "sent": "If you consider various treatments and various participate, various participants in these treatments, then this looks the weather.",
                    "label": 0
                },
                {
                    "sent": "These treatments succeed or fail, and whether any difference between the treatments or whether it just it just caused by chance and as far as we're concerned, are treatments really correspond to justifications.",
                    "label": 0
                },
                {
                    "sent": "On our success corresponds to someone said yes.",
                    "label": 0
                },
                {
                    "sent": "The Interment follows.",
                    "label": 0
                },
                {
                    "sent": "In our failure, no, it doesn't.",
                    "label": 0
                },
                {
                    "sent": "And the nice thing here is that it really takes into consideration the pairing of the relationship along the top holes here.",
                    "label": 0
                },
                {
                    "sent": "So along the different treatments, it's not just OK. We got six failures here.",
                    "label": 0
                },
                {
                    "sent": "We got 12 failures here.",
                    "label": 0
                },
                {
                    "sent": "Yes, there's a difference.",
                    "label": 0
                },
                {
                    "sent": "There really is a relationship and you would be very careful when you're choosing your tests.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To deal with this kind of thing.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "For some of the items in one M2 compared to the hard items, HM One and HM Two.",
                    "label": 0
                },
                {
                    "sent": "We did the test and the test revealed that this highly significant differences here, so this was quite pleasing, but there were some anomalies so we're looking for anything of a P value below 0.05.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There were some anomalies and these were to do with items M3 and HM3 down here where we really got that there was no significant difference at all and we had some conjectures as to why was this the case, but basically we are model predicted HM Three to be hard, but there was no significant difference in error proportion from easy items and with the M3R model predicted it to be easy, but there was no significant difference.",
                    "label": 1
                },
                {
                    "sent": "No proportion from hard items.",
                    "label": 0
                },
                {
                    "sent": "So we've got a conjecture that with the hard won the models correct.",
                    "label": 0
                },
                {
                    "sent": "You'll see are why we think so, any moment but participants got it right for the wrong reasons, and in some sense this shows up as one of the limitations of the study.",
                    "label": 0
                },
                {
                    "sent": "And in the case of M3 we conjectured that actually the model did Phil genuinely here, and I'll show you.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why So what we did?",
                    "label": 0
                },
                {
                    "sent": "We did a follow up study 'cause one of the disadvantages of the kind of standalone study.",
                    "label": 0
                },
                {
                    "sent": "Was that we didn't have this think aloud, so we couldn't determine what people actually do, so we took.",
                    "label": 0
                },
                {
                    "sent": "We took some other students to raise one PhD student or very experienced with all non taken part in the main experiment or pilot study.",
                    "label": 1
                },
                {
                    "sent": "And we use the same protocol but with the addition of the think Aloud protocol, and we also used an eye tracker to look at what they were doing.",
                    "label": 0
                },
                {
                    "sent": "Becausw of what we're conjecturing.",
                    "label": 0
                },
                {
                    "sent": "So the hard way.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First, where we think the model is correct.",
                    "label": 0
                },
                {
                    "sent": "So this shows a heat map of the justification.",
                    "label": 0
                },
                {
                    "sent": "And you can see there's a lot of concentration along the bottom axiom here where we've got C2 is equivalent to exist Prop 1C3 and some concentration on the top.",
                    "label": 0
                },
                {
                    "sent": "C1 is a subclass of floor prop 1C3.",
                    "label": 0
                },
                {
                    "sent": "The entailment the target entailment is is C1 subclass of C2 entailed.",
                    "label": 0
                },
                {
                    "sent": "Now there's actually a lot going on in here and what happened in the follow up study was that all three people just focused on this bottom axiom here.",
                    "label": 0
                },
                {
                    "sent": "The new life.",
                    "label": 0
                },
                {
                    "sent": "The Interment was required.",
                    "label": 0
                },
                {
                    "sent": "They needed all of them, but they focused on this bottom Maxim here.",
                    "label": 0
                },
                {
                    "sent": "This part of it where you see the red concentration and the top one, and then the think aloud revealed that people were saying OK, see you on I need a prop.",
                    "label": 0
                },
                {
                    "sent": "1C3 and C223 did about a bit.",
                    "label": 0
                },
                {
                    "sent": "OK yes it's entailed.",
                    "label": 0
                },
                {
                    "sent": "So that was quite insightful.",
                    "label": 0
                },
                {
                    "sent": "But when we actually showed this to other people.",
                    "label": 0
                },
                {
                    "sent": "As well outside.",
                    "label": 0
                },
                {
                    "sent": "So all of the three people got this wrong and we showed this other people.",
                    "label": 0
                },
                {
                    "sent": "Other people find it really quite difficult as well.",
                    "label": 0
                },
                {
                    "sent": "So we believe the models right here, but it's a limitation of the protocol.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All of the main study protocol and for our other one M3, we actually believe the model failed here.",
                    "label": 0
                },
                {
                    "sent": "So in this one we have the model predicted.",
                    "label": 0
                },
                {
                    "sent": "This was an easy justification and an actual facts.",
                    "label": 0
                },
                {
                    "sent": "It turned out to be no different justifications, statistically significant difference, and in the follow up study people had problems with this as well.",
                    "label": 0
                },
                {
                    "sent": "So people thought this entailment didn't hold and people got fixated on this third axiom down.",
                    "label": 0
                },
                {
                    "sent": "C4 is equivalent to C5 and exist problem.",
                    "label": 0
                },
                {
                    "sent": "1C6 kept going over and over that exist.",
                    "label": 0
                },
                {
                    "sent": "Prop 1C6 is superfluous as far as the entailment is concerned.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter at all.",
                    "label": 0
                },
                {
                    "sent": "But they got fixated on that and then fixated on the other prop one in the existential restriction on the 1234 fifth axiom down and eventually said, OK. Now I don't think the entailment holds, so superfluity here was really, really distracting, and our model doesn't deal with that.",
                    "label": 0
                },
                {
                    "sent": "So it highlighted in area for model improvement.",
                    "label": 0
                },
                {
                    "sent": "So that was the overall protocol we use.",
                    "label": 0
                },
                {
                    "sent": "This kind of standalone protocol where people need supervision and then use this kind of follow up protocol with eye tracking and more followers more think aloud.",
                    "label": 0
                },
                {
                    "sent": "To investigate anomaly.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In there.",
                    "label": 0
                },
                {
                    "sent": "And in terms of lessons learned and summary well.",
                    "label": 0
                },
                {
                    "sent": "I would argue the complexity model performed reasonably well, but there is some areas for improvement and these were highlighted by the study.",
                    "label": 1
                },
                {
                    "sent": "In particular the follow up.",
                    "label": 0
                },
                {
                    "sent": "So the main study, highlighted anomalies and the follow up.",
                    "label": 0
                },
                {
                    "sent": "She gave us more deep, deeper insights.",
                    "label": 1
                },
                {
                    "sent": "The reasons why overall would say this cheaper testing is possible.",
                    "label": 0
                },
                {
                    "sent": "But provided carries taken when you interpret the results.",
                    "label": 1
                },
                {
                    "sent": "So where you see anomalies as is necessary to have some kind of small follow-up studies to find out what's going on, becausw the standalone one where we don't have, think aloud, and obviously doesn't explain why something is difficult or easy.",
                    "label": 1
                },
                {
                    "sent": "Overall, this is.",
                    "label": 0
                },
                {
                    "sent": "Quite a well defined protocol actually for complexity model testing, and this has several advantages.",
                    "label": 0
                },
                {
                    "sent": "Mainly repeatability and comparison.",
                    "label": 0
                },
                {
                    "sent": "So third parties can take the protocol and try and repeat it in their labs, which will be really useful.",
                    "label": 0
                },
                {
                    "sent": "And also they could use it to refine and extend the model or without the role models.",
                    "label": 0
                },
                {
                    "sent": "Also, I think it is a detailed user study with detailed analysis and statistical tools to inferential statistics and hopefully this will give people more of an idea to do these user based studies because of not so many are done in this particular area.",
                    "label": 0
                },
                {
                    "sent": "So thanks very much.",
                    "label": 0
                },
                {
                    "sent": "So obviously people are very different as United and they think differently when they try to understand results logical inferencing.",
                    "label": 0
                },
                {
                    "sent": "So if you supply this tool to something like product which generates justifications, do you think you can use single model regardless of what kind of person is working or your model should require some extensions to separately tuning for specific type of user or something like that so we imagine.",
                    "label": 0
                },
                {
                    "sent": "Actually, more model doesn't necessarily fit the bill here.",
                    "label": 0
                },
                {
                    "sent": "We don't have resources to test multiple models, but you can imagine a model that's more sensitive to certain patterns of axioms of things for neophyte users who aren't necessarily familiar with things, and then for more advanced users, they could turn bits of it off, or have preconfigured models, and there's too much noise, and it's lagging all the time, so I know this might be difficult.",
                    "label": 0
                },
                {
                    "sent": "You could kind of scale it down a little bit.",
                    "label": 0
                },
                {
                    "sent": "I think, given the protocol and that everything is there and it should be easy to replicate without too much thinking that they could further people to develop their own models and and try to follow it.",
                    "label": 0
                },
                {
                    "sent": "This up because we've got the corpus there now as well and just see how things evolve really.",
                    "label": 0
                },
                {
                    "sent": "I take it from what you said that the eye tracking was principally so you could figure out what where they were dwelling.",
                    "label": 0
                },
                {
                    "sent": "You didn't make any other use of it.",
                    "label": 0
                },
                {
                    "sent": "Is that right?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so the eye tracking was used.",
                    "label": 0
                },
                {
                    "sent": "'cause we?",
                    "label": 0
                },
                {
                    "sent": "Had this idea that this thing contained some superfluous parts and OK to think aloud would reveal that.",
                    "label": 0
                },
                {
                    "sent": "People were fixated on this third axiom, but actually the eye tracking was much more revealing and more striking.",
                    "label": 0
                },
                {
                    "sent": "'cause as soon as we saw this, it really sort of make things clearer where people were looking and how people actually read through these things, as well as quite really quite interesting.",
                    "label": 0
                },
                {
                    "sent": "So you'd think that people experienced in.",
                    "label": 0
                },
                {
                    "sent": "Theorem proving who studied that third thing a lot that there are the eye track record would really should reveal that there also looking around where the heck is SI 6 found anywhere else in there you would think so soon, all of whom were involved with theorem proving, but they were very experienced with our but.",
                    "label": 0
                },
                {
                    "sent": "Yeah you you might think so.",
                    "label": 0
                },
                {
                    "sent": "So usually after some time some people got to that, but.",
                    "label": 0
                },
                {
                    "sent": "I know so they never said why they dwelled on.",
                    "label": 0
                },
                {
                    "sent": "I think it was one person who said, no, they never said well.",
                    "label": 0
                },
                {
                    "sent": "Then we ask them to look at it in a kind of natural possible setting.",
                    "label": 0
                },
                {
                    "sent": "As usual, there's no facilitator, intervention or anything like that or specific.",
                    "label": 0
                },
                {
                    "sent": "Follow up questions and then most of them afterwards.",
                    "label": 0
                },
                {
                    "sent": "Don't remember what they actually actually did anyway, so the tracker was great for capturing this.",
                    "label": 0
                },
                {
                    "sent": "We got the audio recordings of it as well.",
                    "label": 0
                },
                {
                    "sent": "Alright, got to do some more experiments with my tracker as well.",
                    "label": 0
                },
                {
                    "sent": "I you used anonymized terms rather than natural terms, would it have made it?",
                    "label": 0
                },
                {
                    "sent": "But why did you do that?",
                    "label": 0
                },
                {
                    "sent": "And would it have made a difference with natural terms so?",
                    "label": 0
                },
                {
                    "sent": "The reason why we did this was, well, there are a couple of reasons.",
                    "label": 0
                },
                {
                    "sent": "One, the natural terms can be really, really long.",
                    "label": 0
                },
                {
                    "sent": "Some of these bio ontologies and just get quite big and we didn't want to deal with things outside of presentation of things really.",
                    "label": 0
                },
                {
                    "sent": "We want to just just focus on what was going on in the logic.",
                    "label": 0
                },
                {
                    "sent": "So we hope that that would prove that.",
                    "label": 0
                },
                {
                    "sent": "Would that would help negate that effects.",
                    "label": 0
                },
                {
                    "sent": "And also we before the exploratory study we did a pilot study for that as well.",
                    "label": 0
                },
                {
                    "sent": "And we found that some of the biologists, bioinformaticians, rather that looks at this, would just block through justifications and things and then use their domain knowledge without actually trying to work through things.",
                    "label": 0
                },
                {
                    "sent": "Right?",
                    "label": 0
                },
                {
                    "sent": "That would happen in reality as well, but really we wanted to try and make this a little bit more controlled and isolate some of these factors so that didn't come from the results.",
                    "label": 0
                },
                {
                    "sent": "So that's why we did it, but I could see pros and cons.",
                    "label": 0
                },
                {
                    "sent": "Both sides of things so.",
                    "label": 0
                },
                {
                    "sent": "Thanks, Mike.",
                    "label": 0
                }
            ]
        }
    }
}