{
    "id": "swsak2eshfk5uhyggxkezeh54mn6u7x5",
    "title": "ESA future projects and missions opportunity for Slovenia",
    "info": {
        "author": [
            "Marcos Bavdaž, European Space Research & Technology Centre, European Space Agency (ESA)"
        ],
        "published": "April 14, 2010",
        "recorded": "March 2010",
        "category": [
            "Top->Science->Space"
        ]
    },
    "url": "http://videolectures.net/esa2010_bavdaz_esappps/",
    "segmentation": [
        [
            "Smokers lopon osni Norma Part 2 Diva AC Slater nozzle over socket position sensor.",
            "Doctor Mark of Bar Dash have audio dealers in a pregnant technology director at as is Non IST.",
            "Robots can be serious and missing the country, not know Slovenes, as in the Navy ship positive.",
            "A super awesome marker, the.",
            "This work with.",
            "Yeah, about a lipa's approval below in maybe Salida Lakota Q Slovenie Blvd, Mobutu Trust Theater, Java 2D V so Leo Gillham and Bracelet 3 easy nice technical Anscombe protein, Navy content through in missile.",
            "Obviously the bomb they would or trusted solutions may have slow Internet these days is minimal.",
            "Gazik lokos lisha."
        ],
        [
            "Bumper predictable were English, any credit or decoration measure or poor abney's sickness?",
            "Working language into the chip to see more possible value without trustee's name both or you gonna more English.",
            "City, but the local memnor Miriam severe tooth Jewish food North into sprouted Paraba Usyka Casello call no.",
            "Booty.",
            "OK, I will discuss today here.",
            "The role of the space science in ISA.",
            "As you have heard from Pedro, this is the mandatory part of the subscription to ISA.",
            "So that means each Member State has to collaborate there and it is of course in the interest of the Member State to ensure that the proper industrial return can go back to the country in the form of the industrial contracts.",
            "But also in terms of the scientific exploitation, where in fact Slovenia is quite involved already at this time.",
            "The science program is called the Cosmic Vision 2015, Two 25 program.",
            "This covers basically the years that this.",
            "Program will have new launches planned.",
            "You have seen the four missions that are currently in the so called CD face in the building.",
            "High face baby Colombo is one of them.",
            "Lisa Pathfinder another one and so on.",
            "We have to look forward to a longer horizon which is in fact the end of this decade when we will have new missions on the program.",
            "There was a long elaboration of the major science goals for the European Science in space, and that was then formulated actually in these four questions that you see here.",
            "So effectively we want to know more about how life and planetary formation takes place.",
            "We want understand our own solar system better.",
            "We want to know which laws govern the universe and we want to see also what is actually the universe made of and this is actually something that maybe a lots of people on the street are not fully aware of that a lot of things changed in the past two decades when they joined easier.",
            "There was still no idea around about the dark energy or the dark matter, so I still remember when the news came up.",
            "Based on satellite evidence that there must be something in the universe which we have no clue about, and that's when basically a new era of physics started."
        ],
        [
            "We have the call for mission proposals, so the science program is put together effectively together with the European Science Community.",
            "It is not easier who would simply decide which missions easier would build a call for mission proposals was issued in the year 2007, and actually another call for mission proposals will probably be issued torts the end of this year.",
            "And it is important to understand this process because you want to get involved early on to be sure that you can make your interests coherent with what European interests are and to identify the proper contributions that you think you would like to bring to these endeavors.",
            "At the moment we have large class mission candidates and medium class mission candidates.",
            "Medium class candidates mean that the cost to EASA is about half a billion euros, and the L class missions are in the order of three quarter of a billion euros for ether.",
            "Additionally, there of course expenditures done by the National Member States with national contributions to these missions, and Furthermore, many of these missions are done in collaboration.",
            "With international partners mainly, of course NASA but also jacks are the Japanese organization and the Russian organization and other smaller parties.",
            "At the moment we have three candidates in the large class mission category that is the mission Laplace, Lisa, and ISO.",
            "And we will have a down selection of these missions by the end of this year.",
            "So at the moment we are studying these three and preparing the technology for them in order to be able to decide which ones really should go ahead.",
            "Then will be there will be a final selection at the end of 2012, and that will then actually bring one of them into a flight program within envisaged.",
            "Launch in the area of 2020 in 10 years from now.",
            "M Class mission candidates selected were these here.",
            "Seven of them.",
            "And in fact, there was a down selection done in February of this year which actually have identified three of them.",
            "Let's Euclid Plateau and the Solar Orbiter for Speaker, which is a special case submission of opportunity with the Japanese agency Jack for the decision will be taken later on by our program board.",
            "The Science Policy Committee.",
            "Have two of these missions will fly one or it in 2017 and another one in 2018.",
            "I will describe later on the essence of these men."
        ],
        [
            "This.",
            "Before that, however, I would like to describe briefly how actually emission is born in ether.",
            "So we start with a call for mission proposals where the science community tells us these are what they would like to do, which kind of missions they think should be flown.",
            "We then have to carefully analyze what that entails, what requirements have to be fulfilled in order to make sure that such missions actually will be successful.",
            "It is important to note.",
            "That our scientific missions are really on the cutting edge of world science, despite the fact that we have only about effective 5 smaller budget than for example NASA.",
            "Also per capita we're spending much less here in Europe than in the United States.",
            "Our science is still top class.",
            "And we want to ensure that this continues so therefore we have to very carefully select the missions that we want and we can build.",
            "So the first phase is the so-called assessment phase, when in fact we do a few things in parallel.",
            "We look at the spacecraft as a complete system.",
            "We study that in competitive studies, so we have at least two contracts out to industry to design these spacecraft from end to end.",
            "Basically from the development of the technologies to the launch to the operations in space, which kind of ground infrastructure is required?",
            "All the assembly testing facilities that need to be in place.",
            "All that is done here in industrial contracts issued by the agency and controlled by the agency.",
            "Further, it is important to have all the payload preparation activities running at the same time.",
            "I should note here that the payload the instruments on board of our scientific spacecraft are partly delivered to the agency as a national contribution, so.",
            "There could be, for example, a Slovenian group who would like to build an instrument for a scientific satellites, for example to fly to Jupiter.",
            "They could in fact compete.",
            "There would be an announcement of opportunity for the payloads where either would say which kind of spacecraft it is building, and what resources are available, which powered mass, etc.",
            "And then the scientific community is open to propose instrumentation.",
            "These types of instruments are then also funded by national agencies, so this is national money going to national groups many times, mostly actually is a consortia which are multinational and that's activities that have to take place.",
            "Also, in parallel to our activities at an easier on the national level.",
            "For that reason, we need them to enter.",
            "With the letter of endorsement with the cooperation agreement, more or less, to be sure that we are developing nationally and within the EASA structure, the same.",
            "Technology, but we're aiming at this same technology readiness for the same type of mission, so the Member States.",
            "And eiza collaborate throughout all these phases here.",
            "So after the first 2 years, so the M class missions have in fact completed that last year and we have then done this down selection for the M class missions which are now entering the definition faith.",
            "So this will last another two years where much further detailed design is being done on the spacecraft.",
            "So now basically the blueprints are being made with which then the spacecraft can be later built.",
            "And another very important thing is that the technology preparation has to reach a level of the so-called TRL 5 technology Readiness Level 5.",
            "I will come to that later.",
            "Which means that this the technology is demonstrated to sufficient level that we can go further and start building the spacecraft.",
            "Then at that stage before basically starting to build the spacecraft and the final selection is done.",
            "Which spacecraft is to be built and multilateral agreement is required, so it's agreement between all the parties involved.",
            "One of the parties is easier, but there are other parties which are the national entities collaborating or into another Internet.",
            "Other agencies, space agencies with whom we jointly introduce this project."
        ],
        [
            "So we have in summary, the spacecraft assessment studies done, so we typically start them internally easier.",
            "We have a so called concurrent Design facility at Aztec where basically.",
            "All the disciplines of the spacecraft are represented in with engineer sitting in the same room, operating on Internet on a network of computers, so that very quickly within two months you can design A spacecraft that is the starting point so that we can define the statement of work for the industrial studies, which then follow the study the instrument assessment studies are those studies which were similar to the spacecraft, so they regard the complete instrument and ensure that the instrument.",
            "Also are well understood well before the mission can be down selected.",
            "And last not least is the technology preparation.",
            "So we really have to be sure that all the technologies that will be required to build a certain spacecraft are really there at that time.",
            "Our spacecraft extremely capable, so they have inbuilt the latest knowledge later standards and they are providing excellent data down from from space.",
            "And if you now want to launch new spacecraft, these of course have to be to perform better than the previous spacecraft.",
            "At the same time, the budgets, the cost of the missions are not allowed to increase, so the only way out of this is in fact to introduce new technologies to ensure that we have more efficient optics detectors, sensors, which in fact will provide answers to those questions which were raised by the currently operating."
        ],
        [
            "Missions.",
            "So it is very important to understand the technology readiness level of a technology that is required for building a spacecraft.",
            "This is typically measured in this scale from 1 to 9.",
            "Which is standardized.",
            "So also NASA and JAXA use the same nomenclature.",
            "It starts with TRL one where basically the basic idea is known.",
            "And still has to be demonstrated.",
            "Actually it works or not.",
            "If you can build that.",
            "And finally, TRL nine would be a system or a technology which actually has already been demonstrated and flown in space.",
            "You see here the risk level, which is color coded here and you here see here the phase of the mission.",
            "On the top here is a bit difficult to read for those back of the room.",
            "Here is the phase zero.",
            "That's basically when we start to define the idea of which mission we want to have for that.",
            "In fact, we can accept that some technologies are really very low level.",
            "However, even Tyra one would be too low.",
            "It basically to higher risk for such a mission to be even studied.",
            "So we there won't really at least the concept of this technology really being properly formulated and initial tests having haven't been performed.",
            "So that's at least required in order to actually even start to look at the mission.",
            "Phase A is basically the assessment phase, so the 1st two years of a mission and there you see that you really would like to be here.",
            "The green would be effectively ATL three, which means that the technology has already been demonstrated in the laboratory, so you really have build the instrument or the corresponding system or subsystem in your laboratory and you show that this new concept really works, that you have also on paper shown that you could go ahead and.",
            "Space qualified but you have not done this basic qualification yet.",
            "Maybe you have a address to few critical issues, but in general you have demonstrated that this technology works in the ground on the ground in laboratories.",
            "Then if you proceed to the Phase B, which is the definition phase, so the second block her shown before there, you really would like to have your technology here in these two blocks between 5:00 and 6:00 at the end of the definition phase.",
            "So here, L5 technology readiness Level 5 means the component or the breadboard.",
            "And if you need a new subsystem, it has the material 6.",
            "For that you have already validated the technology in the relevant environment.",
            "That means if the technology for example is susceptible to vibration to shock, you have really demonstrated that it can survive the launch.",
            "The launch loads in due to vibration acoustic loads shock because of the separation of the stages of the rocket.",
            "Things like that or if your technology is extremely sensitive to temperatures you have really tested it.",
            "You thermal cycled it shown that what you want to fly actually can survive the environment.",
            "You will expose it to.",
            "Then in the face CD.",
            "But actually when you are building the spacecraft have cutting metal, then you really in fact have to basically ensure that you will go go basically up to the TL 9 effectively really doing the final tests of testing the subsystems up to the complete system.",
            "The complete spacecraft in the relevant environment, and this is actually why we have this large debt facilities at S tag.",
            "There is another message in this view graph which is which are the technology programs that we use to implement these technology preparations.",
            "You can see there here, that in these are there a lot of technology programs.",
            "However, for the science for this mandatory part of the easy subscription there are three which are very important.",
            "One is a TRP.",
            "This is part of the mandatory program as well.",
            "So if there is the 12% or so of the science program and then there is in addition to the technology research program which is also a very important part for us, it deals for the early development stages up to about TRL three.",
            "So up to the laboratories demonstration of technologies and that is then taken over by the core technology program, which then.",
            "Actually, it's basically up to the serial nine that we need for the flight.",
            "This CTP, the core technology program is paid by the mandatory science program, so this is part of our Directorate's money which is used here to develop further the technologies.",
            "It is maybe important to notice that the level of investment required to jump from one step to the next increases.",
            "I would almost say like exponentially.",
            "If when you climb the ladder here, so initially to just demonstrate as an idea and go from one to two, it is usually rather cheap.",
            "Very often this can be done with the own funding of institutions and industry.",
            "However, it is much more expensive than to go, for example to from three to five.",
            "Therefore, if we compare the budgets we actually spent about prom just to come from three to five, we spend about twice as much money as going from one to three.",
            "There is 1/3 program here which is the GSD?",
            "P This is a general studies technology program support program.",
            "This is a program where national Member States decide to put additional money into.",
            "Subscription.",
            "In order to do technology developments where they would like easier to do, the management of that.",
            "So it ensures that the developments that are being done are coherent with all the residual activities taking place in either.",
            "For four hours, just space program space Science program we have here hundreds of contracts running to do the technology preparation for these future missions."
        ],
        [
            "I would now give you a short overview about those missions that are currently in the race to be launched, say at the end of this decade.",
            "That means that these are missions where really Slovenia has a large potential to play an interesting role in them, because it's now still early time.",
            "Those missions which are currently being built, or those that Pedro has presented to you before.",
            "There it is very difficult to now jump on the train because the train is kind of leaving the station already and there are some of you who already collaborating here on the particular science exploitation of these missions, which also require preparation.",
            "But in terms of getting involvement on a hardware level, getting instruments onboard or supplying technologies, supplying subsystems, then I think it is very important to look at the missions which we are currently studying to be launched in 10 years time.",
            "So by that time in due time either could be already a full Member State you know and eligible to full collaboration.",
            "Here in these projects.",
            "Euclid is a dark energy mission, so it should study and to the universe in order to see what actually the dark energy is.",
            "We still have no clue what it could be.",
            "You have maybe read in the news yesterday, but the CERN accelerators have finally produced the first collisions at three and half jiggle ektron bolts.",
            "So that is in fact contributing science.",
            "Also, understanding the same issues.",
            "So we have to attack it from two sides from the microcosm, and from the macrocosm at the same time to understand actually how our universe really works and how it is because the real matter as you know is only a small fraction less than 5% of the total mass of the universe.",
            "So in order to do that this mission, this Euclid mission will serve a very large area of this kind.",
            "And will basically do that by having a reasonably sized telescope actually, but not a very big telescope 1.2 meter.",
            "It will have, however, a very large field of view and you will have very demanding technology on the detectors.",
            "It will have basically two approaches to study the dark energy.",
            "One will be to look at the weak lensing.",
            "This is basically you see these galaxies which are deformed by mass which is in the way.",
            "In the line of sight to those very far and distant galaxies, and then the second one is infrared photometers and spectrometers, which will look at the baryonic acoustic oscillations.",
            "But this is basically studying this structure of how actually the galaxies in the universe are.",
            "Arranged in it's kind of a sponge like structure and not a uniform distribution of matter in the universe.",
            "As we have discovered and we just want to have a map of this foamy structure in EU."
        ],
        [
            "Horse so Euclid will go into an orbit around the L2 point LaGrange .2.",
            "This is the point 1/2 million kilometres away from the sun.",
            "It will have a very complex instrumentation here on the payload to look at the.",
            "The visible and infrared light, and for that we actually really require.",
            "I mean some demanding aspects of the spacecraft, so the point spread function has to be rather good and very symmetric.",
            "Very low literacy ellipticity of the image, the line of sight has to be extremely stable, but maybe the most demanding is that the detectors, the focal plane arrays have to be really highly developed and so this is in principle here.",
            "Component that would come from the national Member States.",
            "However, since these detectors are very expensive programs either has undertaken to lead them."
        ],
        [
            "Effort.",
            "Another very interesting mission, which also I think resonates well here in Slovenia in terms of the science which is already being done in this country, is the study of of exoplanets.",
            "As you know, about 400 planetary systems on planets are known outside our planetary system.",
            "And of course, humanity is very interested to know well.",
            "Is there actually another earth somewhere, and this is particularly difficult to find because it's a rather small planet at a distance which allows water to condense so it is actually difficult to detect it with the methods we have available from ground.",
            "And in fact a lot of discoveries.",
            "Most of the discoveries of these planets are actually done from space, even though the spacecraft at the moment are much smaller than beyond visits.",
            "With this mission plateau.",
            "Effectively it will look at the at the light of stars when the planet actually then or calls them when it passes in front of the star or actually behind the star and it changes the light level of the star and by basically comparing the light functions one can understand which kind of planets must be there.",
            "A second very important function of this mission will be to understand what kind of star is there.",
            "So one really has to know what is the characteristic of that star is stable enough overtime to actually allow, for example, life to emerge on those planets, and to do that, Astro seismology is being done.",
            "This means that the by studying the light curve of the stars over long times, one can understand what the vibrational modes of the stars are and this helps to understand.",
            "How stable they are."
        ],
        [
            "In terms of the payload, there we have very demanding CCDS.",
            "Sorry top class detectors are similar detectors as you have in your photographic cameras.",
            "Probably, however they are much bigger and they have many more pixels and they have to be extremely uniform and they have to have of course robustness in terms of radiation they have to survive this space environment.",
            "So therefore again, it is a rather expensive endeavour, easier has taken disappoint itself to start to develop the technologies, to be ready for a planet, or if it is selected to actually build those 50 a large number of these will be required as well, so the corresponding their production lines have to be build up now.",
            "The other part is the optical system, so these are small telescopes in array of small telescopes, about 3634.",
            "Looking at the same area on the Sky and the reason for that is that with a small system you can actually achieve a much larger larger field of view so that you are observing a large number of stars at the same time."
        ],
        [
            "A further M class mission candidate, the third one selected is the Solar Orbiter.",
            "This is a mission which will be launched to study the sun from close by and you can see that it will go a very complicated orbit around the sun.",
            "In order to observe our star from very different angles and what is really novel compared to any other mission of this type.",
            "Maybe with exception of releases which however state qualifier work far away from this from the sun is that it will achieve also views high up from high latitudes of the sun, so it will not stay in the ecliptic plane where the planets are, but it will actually look at the sun from a rather high high angle.",
            "That means that we will be able to understand better what happens on the poles of our star.",
            "Our son."
        ],
        [
            "Well, the challenges here of course that we come close to the sun, so therefore the spacecraft has effectively a shield which protects it from the very strong radiation from the sun.",
            "And it has of course, all the implications on, for example, the solar race, because they necessarily are exposed.",
            "And it sounds maybe a bit strange, but it's so that the production of electrical power is actually more difficult if you come close to the sun that simply because your solar Rays have to be tilted so that you basically shine on on them almost horizontally, so to speak, not at the right angle incidence as you normally do for solar race in order to keep the thermal control in place for these arrays.",
            "And they're not allowed to cook.",
            "Another complication, for example, is this antenna, which has to be articulated so it has to be able to point to the Earth so that we can send this telemetry down to ground, and because we won't have very high resolutions of the sun, we really need half a lot of telemetry.",
            "A lot of data being sent back.",
            "In order to.",
            "Facilitate implementation of this mission and to keep the cost of this mission under control.",
            "The technologies developed for the Baby Colombo Mission will be used as far as possible.",
            "This is the mission going to the planet Mercury, so also approaching the sun very much."
        ],
        [
            "Moving now to the L class to the large class missions, we first have an X Ray Observatory.",
            "It is important to keep in mind that Europe has a very strong position in terms of the high energy astrophysics.",
            "It has already launched a number of spacecraft which have in fact worked extremely well.",
            "We have currently a big Observatory in space, one of our largest spacecraft.",
            "Currently operation is from here to the door in size about 10 meters length and bought 15 meters long around the solar race.",
            "The Newton Observatory, that is, an operation with ten years, and if you're lucky it will live for another 10 years, but then will stop operating.",
            "So we have a huge science community in Europe, but also worldwide using our asset in space at the moment, and we have to start looking now really in detail about what we would do in order to replace that facility.",
            "And this is called the International Observatory Mathena similar position.",
            "They have also such an Observatory in space.",
            "It is it has completely different characteristics, so they're very complementary to each other.",
            "At the moment the replacing mission will have to be a joint mission with the United States and with Japan.",
            "And so this is effectively then being studied by all the three agencies here together.",
            "It is characterized by a very long spacecraft.",
            "It's about 20 meters in length.",
            "So here actually more the focal length is 20 meters.",
            "It has an optics which is about four meters in diameter and it has to happen for an angular resolution with about 3 times better than that of Newton.",
            "There's a number of instruments here that will be flying that are expected to fly here for this mission, so actually there will be an announcement of opportunity for the selection of this payload.",
            "Each of these instruments here are in the order of 50 to 100 million euros, so it is very expensive instrumentation party that is required.",
            "Therefore, International Consortium typically are working."
        ],
        [
            "These just to mention how dependent emission can be on the technology development.",
            "I think I Excel is a very good example, such a optics or for me to diameters could not be built using any established technology developed anywhere in the world so far.",
            "So a completely new technology had to be invented and further developed.",
            "So this is the so called Silicon power optics which relies on.",
            "Manufacturing techniques that were developed at very high expense for the electronics industry and we are now basically using the same processes and procedures and materials now to produce and optics.",
            "So just to also say how important it is also for Slovenia to understand that although small country can do a large contribution, I would like to mention that the leading company doing this work has 20 people, so you can see that such a company could well be situated on this national territory here.",
            "It is important, however, to have the bright idea at the right time 1st and 2nd we have the commitment to actually really implement that and have the breath to go through all the development stages."
        ],
        [
            "Laplace is the second large class mission candidate.",
            "This is a mission to visit the system of Jupiter.",
            "So not only the planet Jupiter but also its moons.",
            "Actually it will be more concentrated on the moons than on the planet itself.",
            "We know quite well how the planet works compared to what we know about the moons.",
            "This is a mission which is studied in collaboration with NASA.",
            "But they are effectively 22 separate spacecraft, so there's one American spacecraft and one European spacecraft.",
            "However, for the European Science community, it means that they can actually fly on both, so the Europeans would build the so called Ganymede orbiter.",
            "Where the European payload can go on.",
            "But at the same time, we will offer the American friends to actually also embark their payload on this spacecraft in turn to receiving the opportunity to also embark European instruments onto the Europa Orbiter, which is the second one which will go much closer to Jupiter and therefore will be exposed to much higher radiation levels.",
            "There comes in what also was mentioned before the technology independence of Europe.",
            "If we want it, for example to half technologies to fly closer.",
            "If you wanted to go to Europe, Europa, I mean as Europe, we actually should have the target to go through Europa, the moon close to to the planet.",
            "We cannot do it at this time.",
            "It would be too expensive for us because we do not have the radiation heart electronics that is required to do that.",
            "American colleagues are in a better position, becausw.",
            "They have developed such technical technologies for their defense purposes and however, these technologies are not available to us, they impact item protected.",
            "It basically would be impossible for us to design A spacecraft using those technologies.",
            "So we still have to actually work on the deck."
        ],
        [
            "Hold on this radiation hardening.",
            "In fact, this is a major problem or issue that we have to address here.",
            "This just shows you that even after optimizing the orbit, you still have about 150 kW app behind the shielding that your electronics will have to survive.",
            "So we have a complete technology program now gearing up which will be adressing all the critical parts that we want to use.",
            "Beta microcontroller be an optical coupler or specific sensors.",
            "How to see that those in fact are ready for for the mission if it is select?"
        ],
        [
            "The third large class mission candidate is the Lisa mission.",
            "This is the mission which would in fact open a new window to humanity to study the universe that is a mission to study the gravitational waves.",
            "And it consists of three spacecraft in a triangular configuration, about 5,000,000 kilometers here on each side.",
            "And the distance between these three spacecraft is measured too.",
            "Pico meters so extremely demanding measurement, so you measure here the distance is here to 10 to the minus 20's extreme precision.",
            "And in fact, for that reason, because this is so challenging, we are actually building currently a spacecraft to demonstrate the major technologies, which is the Lisa Pathfinder."
        ],
        [
            "The technology is simple.",
            "There are of course different type of lasers, different types of control of the discharge management.",
            "We have metrology systems here to ensure that we can do that.",
            "Methodology that is required.",
            "So this is a really high tech.",
            "Interferometer effective that we will have and it can only be done in space for the frequency range that we're interested in.",
            "I mean, you might have read of course about many interferometers that are being actually developed on ground, the kilometer long arrays of ground based interferometers.",
            "Those are limited to rather high frequencies because simply the ground is vibrating.",
            "Even if you isolate it as much as you can.",
            "But more interesting are sources which typically have frequencies of millihertz, because that would be the frequency of, for example, a binary star which is collapsing to each other to neutron stars, for example, that that would have very strong reputation of signal.",
            "These will actually kind of have rotational speeds and periods of the order of hours or 10s of minutes, so therefore we have to really have a different frequency regime, so it is the major discoveries would be done with the.",
            "Frequency range we discovered by Lisa.",
            "So this would clearly be Nobel Prize type science."
        ],
        [
            "I have one great graph only on the second part of what our director it is covering, so my director is science and robotic exploration.",
            "This is not a mandatory program so this would be free to Slovenia to decide.",
            "Once it is a Member State whether it wants or not to contribute to that.",
            "The example mentioned before on tribology, for example, on ensuring that you have the right way to ensure that the gears don't get stuck, could be very interesting technology for robotic exploration.",
            "At the moment we are losing a lot of power to actually heat up Motors and mechanisms so that we are able to operate them after the Martian winter time.",
            "So here we have a technology program which is coherent with America.",
            "So as you know, United States up to now have visited Mars every two years.",
            "And for the next few years we will actually do this journey together.",
            "So in fact there are many meetings at the moment with United States with NASA to ensure that we have and develop a coherent program.",
            "Nevertheless, we have developed really road Map Technology, road map and we're looking at a short term mission 2020 which would be network Lander system and then also looking at effectively this one.",
            "I mean the MSR, the Mars sample return is the final goal, so we would like to have a sample.",
            "From the Martian surface being launched back to Earth so that we can analyze that sample on ground in our big laboratories, which will allow us to have much more Fidelity and much more sensitive, much higher sensitivity than we can do in C2 instrumentation.",
            "So I would like to conclude then with my main.",
            "Points here, so either has a mandatory program which is the cosmic vision science program.",
            "It consists of very carefully selected missions which are studied in competition and effectively only the best ones really survive and get basically to being launched.",
            "It's also face down selection, so that means that we don't only have announcement of opportunity and then select one and you fly that now we select a number and then give them a chance.",
            "We help to try to see if we can develop that to flight ready position or not.",
            "And so this finally we have a very.",
            "Mature selection that we can do, but Thirdly nevertheless it is such a long term selection process.",
            "It is also a slice program.",
            "That means that every three to four years we allow the program to rejuvenate by announcement by issuing another announcement of opportunity where the science community can propose mission concepts.",
            "As I mentioned, it is expected that such an announcement of opportunity will be issued in the second half of this year, probably in the last quarter of this year.",
            "And I would suggest you to keep an open eye here on this and maybe start, you know, talking to your colleagues, which might be you know.",
            "In the current is a Member States so that you know more eligible to the contributions by the PAX program.",
            "As you will hear as well, you will have certain opportunities already to collaborate in the future missions.",
            "You will be more limited in terms of the technology programs that we have established in our Rd Maps."
        ],
        [
            "It is very important to really get involved very early.",
            "I mean we have experienced this with other Member States that very often.",
            "Countries become Member States and then it is discovered that the return the Geo return the money that goes back to the country is limited because simply there is no heritage which can be demonstrated by the newcomers 'cause they established parties already.",
            "Of course out on the playing field.",
            "So I think first of all it's very important to establish awareness of these programs so so that you know what is being planned for the European science programs, you should define a strategic focus for your own interests, so you should identify what yourself you're interested in doing, what you think you should would like to contribute, what you what.",
            "The position is that you would like to achieve.",
            "You have to identify.",
            "Competitive contribution opportunities.",
            "So you really have to develop something which will stand the competition.",
            "Our contracts are issued normally as invitations to tender which are open competition so you will be competing with all of Europe.",
            "Let this not discourage you.",
            "I'm convinced there are a lot of parties here in entities here in Slovenia which can very well master these ITES and get selected.",
            "It will be very important that the proper heritage is demonstrated.",
            "And the proper connections and teams are built and constructed.",
            "So really, establishing a heritage building on the capabilities existing.",
            "So the technology is a good open door to open, so if you have developed the technology which is effectively, you know in this areas of strategic interest for Slovenia and Slovenia and its institutions, of course, and if these developers are them based on solid expertise which already exists in the country.",
            "And if a strategic commitment is done, a long term commitment, not that we just have, you know, like burning paper, you know big interest at the moment.",
            "But then in five years time this is forgotten we will come back in five years time.",
            "That is when effectively these big money will start flowing in order to build flight flight systems.",
            "And it's also very important to develop really partnerships here.",
            "So to develop really the teams within Europe extending over the borders.",
            "This is the way that actually the work is done on the programs.",
            "If you look at how the spacecraft are built then you have really very international Maps.",
            "And even if you look at the individual instruments you will see here that this is a partnership extending far beyond borders.",
            "So achievement requires audacity, so trust in yourself and go ahead.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Smokers lopon osni Norma Part 2 Diva AC Slater nozzle over socket position sensor.",
                    "label": 0
                },
                {
                    "sent": "Doctor Mark of Bar Dash have audio dealers in a pregnant technology director at as is Non IST.",
                    "label": 0
                },
                {
                    "sent": "Robots can be serious and missing the country, not know Slovenes, as in the Navy ship positive.",
                    "label": 0
                },
                {
                    "sent": "A super awesome marker, the.",
                    "label": 0
                },
                {
                    "sent": "This work with.",
                    "label": 0
                },
                {
                    "sent": "Yeah, about a lipa's approval below in maybe Salida Lakota Q Slovenie Blvd, Mobutu Trust Theater, Java 2D V so Leo Gillham and Bracelet 3 easy nice technical Anscombe protein, Navy content through in missile.",
                    "label": 0
                },
                {
                    "sent": "Obviously the bomb they would or trusted solutions may have slow Internet these days is minimal.",
                    "label": 0
                },
                {
                    "sent": "Gazik lokos lisha.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bumper predictable were English, any credit or decoration measure or poor abney's sickness?",
                    "label": 0
                },
                {
                    "sent": "Working language into the chip to see more possible value without trustee's name both or you gonna more English.",
                    "label": 0
                },
                {
                    "sent": "City, but the local memnor Miriam severe tooth Jewish food North into sprouted Paraba Usyka Casello call no.",
                    "label": 0
                },
                {
                    "sent": "Booty.",
                    "label": 0
                },
                {
                    "sent": "OK, I will discuss today here.",
                    "label": 0
                },
                {
                    "sent": "The role of the space science in ISA.",
                    "label": 1
                },
                {
                    "sent": "As you have heard from Pedro, this is the mandatory part of the subscription to ISA.",
                    "label": 0
                },
                {
                    "sent": "So that means each Member State has to collaborate there and it is of course in the interest of the Member State to ensure that the proper industrial return can go back to the country in the form of the industrial contracts.",
                    "label": 0
                },
                {
                    "sent": "But also in terms of the scientific exploitation, where in fact Slovenia is quite involved already at this time.",
                    "label": 0
                },
                {
                    "sent": "The science program is called the Cosmic Vision 2015, Two 25 program.",
                    "label": 0
                },
                {
                    "sent": "This covers basically the years that this.",
                    "label": 0
                },
                {
                    "sent": "Program will have new launches planned.",
                    "label": 0
                },
                {
                    "sent": "You have seen the four missions that are currently in the so called CD face in the building.",
                    "label": 0
                },
                {
                    "sent": "High face baby Colombo is one of them.",
                    "label": 0
                },
                {
                    "sent": "Lisa Pathfinder another one and so on.",
                    "label": 0
                },
                {
                    "sent": "We have to look forward to a longer horizon which is in fact the end of this decade when we will have new missions on the program.",
                    "label": 0
                },
                {
                    "sent": "There was a long elaboration of the major science goals for the European Science in space, and that was then formulated actually in these four questions that you see here.",
                    "label": 1
                },
                {
                    "sent": "So effectively we want to know more about how life and planetary formation takes place.",
                    "label": 1
                },
                {
                    "sent": "We want understand our own solar system better.",
                    "label": 1
                },
                {
                    "sent": "We want to know which laws govern the universe and we want to see also what is actually the universe made of and this is actually something that maybe a lots of people on the street are not fully aware of that a lot of things changed in the past two decades when they joined easier.",
                    "label": 0
                },
                {
                    "sent": "There was still no idea around about the dark energy or the dark matter, so I still remember when the news came up.",
                    "label": 0
                },
                {
                    "sent": "Based on satellite evidence that there must be something in the universe which we have no clue about, and that's when basically a new era of physics started.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have the call for mission proposals, so the science program is put together effectively together with the European Science Community.",
                    "label": 0
                },
                {
                    "sent": "It is not easier who would simply decide which missions easier would build a call for mission proposals was issued in the year 2007, and actually another call for mission proposals will probably be issued torts the end of this year.",
                    "label": 0
                },
                {
                    "sent": "And it is important to understand this process because you want to get involved early on to be sure that you can make your interests coherent with what European interests are and to identify the proper contributions that you think you would like to bring to these endeavors.",
                    "label": 0
                },
                {
                    "sent": "At the moment we have large class mission candidates and medium class mission candidates.",
                    "label": 0
                },
                {
                    "sent": "Medium class candidates mean that the cost to EASA is about half a billion euros, and the L class missions are in the order of three quarter of a billion euros for ether.",
                    "label": 0
                },
                {
                    "sent": "Additionally, there of course expenditures done by the National Member States with national contributions to these missions, and Furthermore, many of these missions are done in collaboration.",
                    "label": 0
                },
                {
                    "sent": "With international partners mainly, of course NASA but also jacks are the Japanese organization and the Russian organization and other smaller parties.",
                    "label": 0
                },
                {
                    "sent": "At the moment we have three candidates in the large class mission category that is the mission Laplace, Lisa, and ISO.",
                    "label": 0
                },
                {
                    "sent": "And we will have a down selection of these missions by the end of this year.",
                    "label": 0
                },
                {
                    "sent": "So at the moment we are studying these three and preparing the technology for them in order to be able to decide which ones really should go ahead.",
                    "label": 0
                },
                {
                    "sent": "Then will be there will be a final selection at the end of 2012, and that will then actually bring one of them into a flight program within envisaged.",
                    "label": 0
                },
                {
                    "sent": "Launch in the area of 2020 in 10 years from now.",
                    "label": 0
                },
                {
                    "sent": "M Class mission candidates selected were these here.",
                    "label": 0
                },
                {
                    "sent": "Seven of them.",
                    "label": 0
                },
                {
                    "sent": "And in fact, there was a down selection done in February of this year which actually have identified three of them.",
                    "label": 0
                },
                {
                    "sent": "Let's Euclid Plateau and the Solar Orbiter for Speaker, which is a special case submission of opportunity with the Japanese agency Jack for the decision will be taken later on by our program board.",
                    "label": 0
                },
                {
                    "sent": "The Science Policy Committee.",
                    "label": 0
                },
                {
                    "sent": "Have two of these missions will fly one or it in 2017 and another one in 2018.",
                    "label": 0
                },
                {
                    "sent": "I will describe later on the essence of these men.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "Before that, however, I would like to describe briefly how actually emission is born in ether.",
                    "label": 0
                },
                {
                    "sent": "So we start with a call for mission proposals where the science community tells us these are what they would like to do, which kind of missions they think should be flown.",
                    "label": 0
                },
                {
                    "sent": "We then have to carefully analyze what that entails, what requirements have to be fulfilled in order to make sure that such missions actually will be successful.",
                    "label": 0
                },
                {
                    "sent": "It is important to note.",
                    "label": 0
                },
                {
                    "sent": "That our scientific missions are really on the cutting edge of world science, despite the fact that we have only about effective 5 smaller budget than for example NASA.",
                    "label": 0
                },
                {
                    "sent": "Also per capita we're spending much less here in Europe than in the United States.",
                    "label": 0
                },
                {
                    "sent": "Our science is still top class.",
                    "label": 0
                },
                {
                    "sent": "And we want to ensure that this continues so therefore we have to very carefully select the missions that we want and we can build.",
                    "label": 0
                },
                {
                    "sent": "So the first phase is the so-called assessment phase, when in fact we do a few things in parallel.",
                    "label": 0
                },
                {
                    "sent": "We look at the spacecraft as a complete system.",
                    "label": 0
                },
                {
                    "sent": "We study that in competitive studies, so we have at least two contracts out to industry to design these spacecraft from end to end.",
                    "label": 0
                },
                {
                    "sent": "Basically from the development of the technologies to the launch to the operations in space, which kind of ground infrastructure is required?",
                    "label": 0
                },
                {
                    "sent": "All the assembly testing facilities that need to be in place.",
                    "label": 0
                },
                {
                    "sent": "All that is done here in industrial contracts issued by the agency and controlled by the agency.",
                    "label": 0
                },
                {
                    "sent": "Further, it is important to have all the payload preparation activities running at the same time.",
                    "label": 0
                },
                {
                    "sent": "I should note here that the payload the instruments on board of our scientific spacecraft are partly delivered to the agency as a national contribution, so.",
                    "label": 0
                },
                {
                    "sent": "There could be, for example, a Slovenian group who would like to build an instrument for a scientific satellites, for example to fly to Jupiter.",
                    "label": 0
                },
                {
                    "sent": "They could in fact compete.",
                    "label": 0
                },
                {
                    "sent": "There would be an announcement of opportunity for the payloads where either would say which kind of spacecraft it is building, and what resources are available, which powered mass, etc.",
                    "label": 0
                },
                {
                    "sent": "And then the scientific community is open to propose instrumentation.",
                    "label": 0
                },
                {
                    "sent": "These types of instruments are then also funded by national agencies, so this is national money going to national groups many times, mostly actually is a consortia which are multinational and that's activities that have to take place.",
                    "label": 0
                },
                {
                    "sent": "Also, in parallel to our activities at an easier on the national level.",
                    "label": 0
                },
                {
                    "sent": "For that reason, we need them to enter.",
                    "label": 0
                },
                {
                    "sent": "With the letter of endorsement with the cooperation agreement, more or less, to be sure that we are developing nationally and within the EASA structure, the same.",
                    "label": 0
                },
                {
                    "sent": "Technology, but we're aiming at this same technology readiness for the same type of mission, so the Member States.",
                    "label": 0
                },
                {
                    "sent": "And eiza collaborate throughout all these phases here.",
                    "label": 0
                },
                {
                    "sent": "So after the first 2 years, so the M class missions have in fact completed that last year and we have then done this down selection for the M class missions which are now entering the definition faith.",
                    "label": 0
                },
                {
                    "sent": "So this will last another two years where much further detailed design is being done on the spacecraft.",
                    "label": 0
                },
                {
                    "sent": "So now basically the blueprints are being made with which then the spacecraft can be later built.",
                    "label": 0
                },
                {
                    "sent": "And another very important thing is that the technology preparation has to reach a level of the so-called TRL 5 technology Readiness Level 5.",
                    "label": 0
                },
                {
                    "sent": "I will come to that later.",
                    "label": 0
                },
                {
                    "sent": "Which means that this the technology is demonstrated to sufficient level that we can go further and start building the spacecraft.",
                    "label": 0
                },
                {
                    "sent": "Then at that stage before basically starting to build the spacecraft and the final selection is done.",
                    "label": 0
                },
                {
                    "sent": "Which spacecraft is to be built and multilateral agreement is required, so it's agreement between all the parties involved.",
                    "label": 0
                },
                {
                    "sent": "One of the parties is easier, but there are other parties which are the national entities collaborating or into another Internet.",
                    "label": 0
                },
                {
                    "sent": "Other agencies, space agencies with whom we jointly introduce this project.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we have in summary, the spacecraft assessment studies done, so we typically start them internally easier.",
                    "label": 1
                },
                {
                    "sent": "We have a so called concurrent Design facility at Aztec where basically.",
                    "label": 0
                },
                {
                    "sent": "All the disciplines of the spacecraft are represented in with engineer sitting in the same room, operating on Internet on a network of computers, so that very quickly within two months you can design A spacecraft that is the starting point so that we can define the statement of work for the industrial studies, which then follow the study the instrument assessment studies are those studies which were similar to the spacecraft, so they regard the complete instrument and ensure that the instrument.",
                    "label": 1
                },
                {
                    "sent": "Also are well understood well before the mission can be down selected.",
                    "label": 0
                },
                {
                    "sent": "And last not least is the technology preparation.",
                    "label": 0
                },
                {
                    "sent": "So we really have to be sure that all the technologies that will be required to build a certain spacecraft are really there at that time.",
                    "label": 0
                },
                {
                    "sent": "Our spacecraft extremely capable, so they have inbuilt the latest knowledge later standards and they are providing excellent data down from from space.",
                    "label": 0
                },
                {
                    "sent": "And if you now want to launch new spacecraft, these of course have to be to perform better than the previous spacecraft.",
                    "label": 0
                },
                {
                    "sent": "At the same time, the budgets, the cost of the missions are not allowed to increase, so the only way out of this is in fact to introduce new technologies to ensure that we have more efficient optics detectors, sensors, which in fact will provide answers to those questions which were raised by the currently operating.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Missions.",
                    "label": 0
                },
                {
                    "sent": "So it is very important to understand the technology readiness level of a technology that is required for building a spacecraft.",
                    "label": 0
                },
                {
                    "sent": "This is typically measured in this scale from 1 to 9.",
                    "label": 0
                },
                {
                    "sent": "Which is standardized.",
                    "label": 0
                },
                {
                    "sent": "So also NASA and JAXA use the same nomenclature.",
                    "label": 0
                },
                {
                    "sent": "It starts with TRL one where basically the basic idea is known.",
                    "label": 0
                },
                {
                    "sent": "And still has to be demonstrated.",
                    "label": 0
                },
                {
                    "sent": "Actually it works or not.",
                    "label": 0
                },
                {
                    "sent": "If you can build that.",
                    "label": 0
                },
                {
                    "sent": "And finally, TRL nine would be a system or a technology which actually has already been demonstrated and flown in space.",
                    "label": 0
                },
                {
                    "sent": "You see here the risk level, which is color coded here and you here see here the phase of the mission.",
                    "label": 0
                },
                {
                    "sent": "On the top here is a bit difficult to read for those back of the room.",
                    "label": 0
                },
                {
                    "sent": "Here is the phase zero.",
                    "label": 0
                },
                {
                    "sent": "That's basically when we start to define the idea of which mission we want to have for that.",
                    "label": 0
                },
                {
                    "sent": "In fact, we can accept that some technologies are really very low level.",
                    "label": 0
                },
                {
                    "sent": "However, even Tyra one would be too low.",
                    "label": 0
                },
                {
                    "sent": "It basically to higher risk for such a mission to be even studied.",
                    "label": 0
                },
                {
                    "sent": "So we there won't really at least the concept of this technology really being properly formulated and initial tests having haven't been performed.",
                    "label": 0
                },
                {
                    "sent": "So that's at least required in order to actually even start to look at the mission.",
                    "label": 0
                },
                {
                    "sent": "Phase A is basically the assessment phase, so the 1st two years of a mission and there you see that you really would like to be here.",
                    "label": 0
                },
                {
                    "sent": "The green would be effectively ATL three, which means that the technology has already been demonstrated in the laboratory, so you really have build the instrument or the corresponding system or subsystem in your laboratory and you show that this new concept really works, that you have also on paper shown that you could go ahead and.",
                    "label": 0
                },
                {
                    "sent": "Space qualified but you have not done this basic qualification yet.",
                    "label": 0
                },
                {
                    "sent": "Maybe you have a address to few critical issues, but in general you have demonstrated that this technology works in the ground on the ground in laboratories.",
                    "label": 0
                },
                {
                    "sent": "Then if you proceed to the Phase B, which is the definition phase, so the second block her shown before there, you really would like to have your technology here in these two blocks between 5:00 and 6:00 at the end of the definition phase.",
                    "label": 0
                },
                {
                    "sent": "So here, L5 technology readiness Level 5 means the component or the breadboard.",
                    "label": 0
                },
                {
                    "sent": "And if you need a new subsystem, it has the material 6.",
                    "label": 0
                },
                {
                    "sent": "For that you have already validated the technology in the relevant environment.",
                    "label": 0
                },
                {
                    "sent": "That means if the technology for example is susceptible to vibration to shock, you have really demonstrated that it can survive the launch.",
                    "label": 0
                },
                {
                    "sent": "The launch loads in due to vibration acoustic loads shock because of the separation of the stages of the rocket.",
                    "label": 0
                },
                {
                    "sent": "Things like that or if your technology is extremely sensitive to temperatures you have really tested it.",
                    "label": 0
                },
                {
                    "sent": "You thermal cycled it shown that what you want to fly actually can survive the environment.",
                    "label": 0
                },
                {
                    "sent": "You will expose it to.",
                    "label": 0
                },
                {
                    "sent": "Then in the face CD.",
                    "label": 0
                },
                {
                    "sent": "But actually when you are building the spacecraft have cutting metal, then you really in fact have to basically ensure that you will go go basically up to the TL 9 effectively really doing the final tests of testing the subsystems up to the complete system.",
                    "label": 0
                },
                {
                    "sent": "The complete spacecraft in the relevant environment, and this is actually why we have this large debt facilities at S tag.",
                    "label": 0
                },
                {
                    "sent": "There is another message in this view graph which is which are the technology programs that we use to implement these technology preparations.",
                    "label": 0
                },
                {
                    "sent": "You can see there here, that in these are there a lot of technology programs.",
                    "label": 0
                },
                {
                    "sent": "However, for the science for this mandatory part of the easy subscription there are three which are very important.",
                    "label": 0
                },
                {
                    "sent": "One is a TRP.",
                    "label": 0
                },
                {
                    "sent": "This is part of the mandatory program as well.",
                    "label": 0
                },
                {
                    "sent": "So if there is the 12% or so of the science program and then there is in addition to the technology research program which is also a very important part for us, it deals for the early development stages up to about TRL three.",
                    "label": 0
                },
                {
                    "sent": "So up to the laboratories demonstration of technologies and that is then taken over by the core technology program, which then.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's basically up to the serial nine that we need for the flight.",
                    "label": 0
                },
                {
                    "sent": "This CTP, the core technology program is paid by the mandatory science program, so this is part of our Directorate's money which is used here to develop further the technologies.",
                    "label": 0
                },
                {
                    "sent": "It is maybe important to notice that the level of investment required to jump from one step to the next increases.",
                    "label": 0
                },
                {
                    "sent": "I would almost say like exponentially.",
                    "label": 0
                },
                {
                    "sent": "If when you climb the ladder here, so initially to just demonstrate as an idea and go from one to two, it is usually rather cheap.",
                    "label": 0
                },
                {
                    "sent": "Very often this can be done with the own funding of institutions and industry.",
                    "label": 0
                },
                {
                    "sent": "However, it is much more expensive than to go, for example to from three to five.",
                    "label": 0
                },
                {
                    "sent": "Therefore, if we compare the budgets we actually spent about prom just to come from three to five, we spend about twice as much money as going from one to three.",
                    "label": 0
                },
                {
                    "sent": "There is 1/3 program here which is the GSD?",
                    "label": 0
                },
                {
                    "sent": "P This is a general studies technology program support program.",
                    "label": 0
                },
                {
                    "sent": "This is a program where national Member States decide to put additional money into.",
                    "label": 0
                },
                {
                    "sent": "Subscription.",
                    "label": 0
                },
                {
                    "sent": "In order to do technology developments where they would like easier to do, the management of that.",
                    "label": 0
                },
                {
                    "sent": "So it ensures that the developments that are being done are coherent with all the residual activities taking place in either.",
                    "label": 0
                },
                {
                    "sent": "For four hours, just space program space Science program we have here hundreds of contracts running to do the technology preparation for these future missions.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would now give you a short overview about those missions that are currently in the race to be launched, say at the end of this decade.",
                    "label": 0
                },
                {
                    "sent": "That means that these are missions where really Slovenia has a large potential to play an interesting role in them, because it's now still early time.",
                    "label": 0
                },
                {
                    "sent": "Those missions which are currently being built, or those that Pedro has presented to you before.",
                    "label": 0
                },
                {
                    "sent": "There it is very difficult to now jump on the train because the train is kind of leaving the station already and there are some of you who already collaborating here on the particular science exploitation of these missions, which also require preparation.",
                    "label": 0
                },
                {
                    "sent": "But in terms of getting involvement on a hardware level, getting instruments onboard or supplying technologies, supplying subsystems, then I think it is very important to look at the missions which we are currently studying to be launched in 10 years time.",
                    "label": 0
                },
                {
                    "sent": "So by that time in due time either could be already a full Member State you know and eligible to full collaboration.",
                    "label": 0
                },
                {
                    "sent": "Here in these projects.",
                    "label": 0
                },
                {
                    "sent": "Euclid is a dark energy mission, so it should study and to the universe in order to see what actually the dark energy is.",
                    "label": 0
                },
                {
                    "sent": "We still have no clue what it could be.",
                    "label": 0
                },
                {
                    "sent": "You have maybe read in the news yesterday, but the CERN accelerators have finally produced the first collisions at three and half jiggle ektron bolts.",
                    "label": 0
                },
                {
                    "sent": "So that is in fact contributing science.",
                    "label": 0
                },
                {
                    "sent": "Also, understanding the same issues.",
                    "label": 0
                },
                {
                    "sent": "So we have to attack it from two sides from the microcosm, and from the macrocosm at the same time to understand actually how our universe really works and how it is because the real matter as you know is only a small fraction less than 5% of the total mass of the universe.",
                    "label": 0
                },
                {
                    "sent": "So in order to do that this mission, this Euclid mission will serve a very large area of this kind.",
                    "label": 0
                },
                {
                    "sent": "And will basically do that by having a reasonably sized telescope actually, but not a very big telescope 1.2 meter.",
                    "label": 1
                },
                {
                    "sent": "It will have, however, a very large field of view and you will have very demanding technology on the detectors.",
                    "label": 0
                },
                {
                    "sent": "It will have basically two approaches to study the dark energy.",
                    "label": 1
                },
                {
                    "sent": "One will be to look at the weak lensing.",
                    "label": 1
                },
                {
                    "sent": "This is basically you see these galaxies which are deformed by mass which is in the way.",
                    "label": 0
                },
                {
                    "sent": "In the line of sight to those very far and distant galaxies, and then the second one is infrared photometers and spectrometers, which will look at the baryonic acoustic oscillations.",
                    "label": 0
                },
                {
                    "sent": "But this is basically studying this structure of how actually the galaxies in the universe are.",
                    "label": 0
                },
                {
                    "sent": "Arranged in it's kind of a sponge like structure and not a uniform distribution of matter in the universe.",
                    "label": 0
                },
                {
                    "sent": "As we have discovered and we just want to have a map of this foamy structure in EU.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Horse so Euclid will go into an orbit around the L2 point LaGrange .2.",
                    "label": 0
                },
                {
                    "sent": "This is the point 1/2 million kilometres away from the sun.",
                    "label": 0
                },
                {
                    "sent": "It will have a very complex instrumentation here on the payload to look at the.",
                    "label": 0
                },
                {
                    "sent": "The visible and infrared light, and for that we actually really require.",
                    "label": 0
                },
                {
                    "sent": "I mean some demanding aspects of the spacecraft, so the point spread function has to be rather good and very symmetric.",
                    "label": 0
                },
                {
                    "sent": "Very low literacy ellipticity of the image, the line of sight has to be extremely stable, but maybe the most demanding is that the detectors, the focal plane arrays have to be really highly developed and so this is in principle here.",
                    "label": 0
                },
                {
                    "sent": "Component that would come from the national Member States.",
                    "label": 0
                },
                {
                    "sent": "However, since these detectors are very expensive programs either has undertaken to lead them.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Effort.",
                    "label": 0
                },
                {
                    "sent": "Another very interesting mission, which also I think resonates well here in Slovenia in terms of the science which is already being done in this country, is the study of of exoplanets.",
                    "label": 1
                },
                {
                    "sent": "As you know, about 400 planetary systems on planets are known outside our planetary system.",
                    "label": 0
                },
                {
                    "sent": "And of course, humanity is very interested to know well.",
                    "label": 0
                },
                {
                    "sent": "Is there actually another earth somewhere, and this is particularly difficult to find because it's a rather small planet at a distance which allows water to condense so it is actually difficult to detect it with the methods we have available from ground.",
                    "label": 0
                },
                {
                    "sent": "And in fact a lot of discoveries.",
                    "label": 0
                },
                {
                    "sent": "Most of the discoveries of these planets are actually done from space, even though the spacecraft at the moment are much smaller than beyond visits.",
                    "label": 0
                },
                {
                    "sent": "With this mission plateau.",
                    "label": 0
                },
                {
                    "sent": "Effectively it will look at the at the light of stars when the planet actually then or calls them when it passes in front of the star or actually behind the star and it changes the light level of the star and by basically comparing the light functions one can understand which kind of planets must be there.",
                    "label": 1
                },
                {
                    "sent": "A second very important function of this mission will be to understand what kind of star is there.",
                    "label": 0
                },
                {
                    "sent": "So one really has to know what is the characteristic of that star is stable enough overtime to actually allow, for example, life to emerge on those planets, and to do that, Astro seismology is being done.",
                    "label": 0
                },
                {
                    "sent": "This means that the by studying the light curve of the stars over long times, one can understand what the vibrational modes of the stars are and this helps to understand.",
                    "label": 0
                },
                {
                    "sent": "How stable they are.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In terms of the payload, there we have very demanding CCDS.",
                    "label": 0
                },
                {
                    "sent": "Sorry top class detectors are similar detectors as you have in your photographic cameras.",
                    "label": 0
                },
                {
                    "sent": "Probably, however they are much bigger and they have many more pixels and they have to be extremely uniform and they have to have of course robustness in terms of radiation they have to survive this space environment.",
                    "label": 0
                },
                {
                    "sent": "So therefore again, it is a rather expensive endeavour, easier has taken disappoint itself to start to develop the technologies, to be ready for a planet, or if it is selected to actually build those 50 a large number of these will be required as well, so the corresponding their production lines have to be build up now.",
                    "label": 0
                },
                {
                    "sent": "The other part is the optical system, so these are small telescopes in array of small telescopes, about 3634.",
                    "label": 0
                },
                {
                    "sent": "Looking at the same area on the Sky and the reason for that is that with a small system you can actually achieve a much larger larger field of view so that you are observing a large number of stars at the same time.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A further M class mission candidate, the third one selected is the Solar Orbiter.",
                    "label": 0
                },
                {
                    "sent": "This is a mission which will be launched to study the sun from close by and you can see that it will go a very complicated orbit around the sun.",
                    "label": 0
                },
                {
                    "sent": "In order to observe our star from very different angles and what is really novel compared to any other mission of this type.",
                    "label": 0
                },
                {
                    "sent": "Maybe with exception of releases which however state qualifier work far away from this from the sun is that it will achieve also views high up from high latitudes of the sun, so it will not stay in the ecliptic plane where the planets are, but it will actually look at the sun from a rather high high angle.",
                    "label": 0
                },
                {
                    "sent": "That means that we will be able to understand better what happens on the poles of our star.",
                    "label": 0
                },
                {
                    "sent": "Our son.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, the challenges here of course that we come close to the sun, so therefore the spacecraft has effectively a shield which protects it from the very strong radiation from the sun.",
                    "label": 0
                },
                {
                    "sent": "And it has of course, all the implications on, for example, the solar race, because they necessarily are exposed.",
                    "label": 0
                },
                {
                    "sent": "And it sounds maybe a bit strange, but it's so that the production of electrical power is actually more difficult if you come close to the sun that simply because your solar Rays have to be tilted so that you basically shine on on them almost horizontally, so to speak, not at the right angle incidence as you normally do for solar race in order to keep the thermal control in place for these arrays.",
                    "label": 0
                },
                {
                    "sent": "And they're not allowed to cook.",
                    "label": 0
                },
                {
                    "sent": "Another complication, for example, is this antenna, which has to be articulated so it has to be able to point to the Earth so that we can send this telemetry down to ground, and because we won't have very high resolutions of the sun, we really need half a lot of telemetry.",
                    "label": 0
                },
                {
                    "sent": "A lot of data being sent back.",
                    "label": 0
                },
                {
                    "sent": "In order to.",
                    "label": 0
                },
                {
                    "sent": "Facilitate implementation of this mission and to keep the cost of this mission under control.",
                    "label": 0
                },
                {
                    "sent": "The technologies developed for the Baby Colombo Mission will be used as far as possible.",
                    "label": 0
                },
                {
                    "sent": "This is the mission going to the planet Mercury, so also approaching the sun very much.",
                    "label": 1
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Moving now to the L class to the large class missions, we first have an X Ray Observatory.",
                    "label": 0
                },
                {
                    "sent": "It is important to keep in mind that Europe has a very strong position in terms of the high energy astrophysics.",
                    "label": 0
                },
                {
                    "sent": "It has already launched a number of spacecraft which have in fact worked extremely well.",
                    "label": 0
                },
                {
                    "sent": "We have currently a big Observatory in space, one of our largest spacecraft.",
                    "label": 0
                },
                {
                    "sent": "Currently operation is from here to the door in size about 10 meters length and bought 15 meters long around the solar race.",
                    "label": 0
                },
                {
                    "sent": "The Newton Observatory, that is, an operation with ten years, and if you're lucky it will live for another 10 years, but then will stop operating.",
                    "label": 0
                },
                {
                    "sent": "So we have a huge science community in Europe, but also worldwide using our asset in space at the moment, and we have to start looking now really in detail about what we would do in order to replace that facility.",
                    "label": 0
                },
                {
                    "sent": "And this is called the International Observatory Mathena similar position.",
                    "label": 0
                },
                {
                    "sent": "They have also such an Observatory in space.",
                    "label": 0
                },
                {
                    "sent": "It is it has completely different characteristics, so they're very complementary to each other.",
                    "label": 0
                },
                {
                    "sent": "At the moment the replacing mission will have to be a joint mission with the United States and with Japan.",
                    "label": 0
                },
                {
                    "sent": "And so this is effectively then being studied by all the three agencies here together.",
                    "label": 0
                },
                {
                    "sent": "It is characterized by a very long spacecraft.",
                    "label": 0
                },
                {
                    "sent": "It's about 20 meters in length.",
                    "label": 0
                },
                {
                    "sent": "So here actually more the focal length is 20 meters.",
                    "label": 0
                },
                {
                    "sent": "It has an optics which is about four meters in diameter and it has to happen for an angular resolution with about 3 times better than that of Newton.",
                    "label": 0
                },
                {
                    "sent": "There's a number of instruments here that will be flying that are expected to fly here for this mission, so actually there will be an announcement of opportunity for the selection of this payload.",
                    "label": 0
                },
                {
                    "sent": "Each of these instruments here are in the order of 50 to 100 million euros, so it is very expensive instrumentation party that is required.",
                    "label": 0
                },
                {
                    "sent": "Therefore, International Consortium typically are working.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These just to mention how dependent emission can be on the technology development.",
                    "label": 0
                },
                {
                    "sent": "I think I Excel is a very good example, such a optics or for me to diameters could not be built using any established technology developed anywhere in the world so far.",
                    "label": 0
                },
                {
                    "sent": "So a completely new technology had to be invented and further developed.",
                    "label": 0
                },
                {
                    "sent": "So this is the so called Silicon power optics which relies on.",
                    "label": 0
                },
                {
                    "sent": "Manufacturing techniques that were developed at very high expense for the electronics industry and we are now basically using the same processes and procedures and materials now to produce and optics.",
                    "label": 0
                },
                {
                    "sent": "So just to also say how important it is also for Slovenia to understand that although small country can do a large contribution, I would like to mention that the leading company doing this work has 20 people, so you can see that such a company could well be situated on this national territory here.",
                    "label": 0
                },
                {
                    "sent": "It is important, however, to have the bright idea at the right time 1st and 2nd we have the commitment to actually really implement that and have the breath to go through all the development stages.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Laplace is the second large class mission candidate.",
                    "label": 0
                },
                {
                    "sent": "This is a mission to visit the system of Jupiter.",
                    "label": 0
                },
                {
                    "sent": "So not only the planet Jupiter but also its moons.",
                    "label": 0
                },
                {
                    "sent": "Actually it will be more concentrated on the moons than on the planet itself.",
                    "label": 0
                },
                {
                    "sent": "We know quite well how the planet works compared to what we know about the moons.",
                    "label": 0
                },
                {
                    "sent": "This is a mission which is studied in collaboration with NASA.",
                    "label": 0
                },
                {
                    "sent": "But they are effectively 22 separate spacecraft, so there's one American spacecraft and one European spacecraft.",
                    "label": 0
                },
                {
                    "sent": "However, for the European Science community, it means that they can actually fly on both, so the Europeans would build the so called Ganymede orbiter.",
                    "label": 0
                },
                {
                    "sent": "Where the European payload can go on.",
                    "label": 0
                },
                {
                    "sent": "But at the same time, we will offer the American friends to actually also embark their payload on this spacecraft in turn to receiving the opportunity to also embark European instruments onto the Europa Orbiter, which is the second one which will go much closer to Jupiter and therefore will be exposed to much higher radiation levels.",
                    "label": 0
                },
                {
                    "sent": "There comes in what also was mentioned before the technology independence of Europe.",
                    "label": 0
                },
                {
                    "sent": "If we want it, for example to half technologies to fly closer.",
                    "label": 0
                },
                {
                    "sent": "If you wanted to go to Europe, Europa, I mean as Europe, we actually should have the target to go through Europa, the moon close to to the planet.",
                    "label": 0
                },
                {
                    "sent": "We cannot do it at this time.",
                    "label": 0
                },
                {
                    "sent": "It would be too expensive for us because we do not have the radiation heart electronics that is required to do that.",
                    "label": 0
                },
                {
                    "sent": "American colleagues are in a better position, becausw.",
                    "label": 0
                },
                {
                    "sent": "They have developed such technical technologies for their defense purposes and however, these technologies are not available to us, they impact item protected.",
                    "label": 0
                },
                {
                    "sent": "It basically would be impossible for us to design A spacecraft using those technologies.",
                    "label": 0
                },
                {
                    "sent": "So we still have to actually work on the deck.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hold on this radiation hardening.",
                    "label": 1
                },
                {
                    "sent": "In fact, this is a major problem or issue that we have to address here.",
                    "label": 0
                },
                {
                    "sent": "This just shows you that even after optimizing the orbit, you still have about 150 kW app behind the shielding that your electronics will have to survive.",
                    "label": 0
                },
                {
                    "sent": "So we have a complete technology program now gearing up which will be adressing all the critical parts that we want to use.",
                    "label": 0
                },
                {
                    "sent": "Beta microcontroller be an optical coupler or specific sensors.",
                    "label": 0
                },
                {
                    "sent": "How to see that those in fact are ready for for the mission if it is select?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The third large class mission candidate is the Lisa mission.",
                    "label": 0
                },
                {
                    "sent": "This is the mission which would in fact open a new window to humanity to study the universe that is a mission to study the gravitational waves.",
                    "label": 0
                },
                {
                    "sent": "And it consists of three spacecraft in a triangular configuration, about 5,000,000 kilometers here on each side.",
                    "label": 0
                },
                {
                    "sent": "And the distance between these three spacecraft is measured too.",
                    "label": 0
                },
                {
                    "sent": "Pico meters so extremely demanding measurement, so you measure here the distance is here to 10 to the minus 20's extreme precision.",
                    "label": 0
                },
                {
                    "sent": "And in fact, for that reason, because this is so challenging, we are actually building currently a spacecraft to demonstrate the major technologies, which is the Lisa Pathfinder.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The technology is simple.",
                    "label": 0
                },
                {
                    "sent": "There are of course different type of lasers, different types of control of the discharge management.",
                    "label": 0
                },
                {
                    "sent": "We have metrology systems here to ensure that we can do that.",
                    "label": 0
                },
                {
                    "sent": "Methodology that is required.",
                    "label": 0
                },
                {
                    "sent": "So this is a really high tech.",
                    "label": 0
                },
                {
                    "sent": "Interferometer effective that we will have and it can only be done in space for the frequency range that we're interested in.",
                    "label": 0
                },
                {
                    "sent": "I mean, you might have read of course about many interferometers that are being actually developed on ground, the kilometer long arrays of ground based interferometers.",
                    "label": 0
                },
                {
                    "sent": "Those are limited to rather high frequencies because simply the ground is vibrating.",
                    "label": 0
                },
                {
                    "sent": "Even if you isolate it as much as you can.",
                    "label": 0
                },
                {
                    "sent": "But more interesting are sources which typically have frequencies of millihertz, because that would be the frequency of, for example, a binary star which is collapsing to each other to neutron stars, for example, that that would have very strong reputation of signal.",
                    "label": 0
                },
                {
                    "sent": "These will actually kind of have rotational speeds and periods of the order of hours or 10s of minutes, so therefore we have to really have a different frequency regime, so it is the major discoveries would be done with the.",
                    "label": 0
                },
                {
                    "sent": "Frequency range we discovered by Lisa.",
                    "label": 0
                },
                {
                    "sent": "So this would clearly be Nobel Prize type science.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I have one great graph only on the second part of what our director it is covering, so my director is science and robotic exploration.",
                    "label": 0
                },
                {
                    "sent": "This is not a mandatory program so this would be free to Slovenia to decide.",
                    "label": 0
                },
                {
                    "sent": "Once it is a Member State whether it wants or not to contribute to that.",
                    "label": 1
                },
                {
                    "sent": "The example mentioned before on tribology, for example, on ensuring that you have the right way to ensure that the gears don't get stuck, could be very interesting technology for robotic exploration.",
                    "label": 0
                },
                {
                    "sent": "At the moment we are losing a lot of power to actually heat up Motors and mechanisms so that we are able to operate them after the Martian winter time.",
                    "label": 0
                },
                {
                    "sent": "So here we have a technology program which is coherent with America.",
                    "label": 0
                },
                {
                    "sent": "So as you know, United States up to now have visited Mars every two years.",
                    "label": 0
                },
                {
                    "sent": "And for the next few years we will actually do this journey together.",
                    "label": 0
                },
                {
                    "sent": "So in fact there are many meetings at the moment with United States with NASA to ensure that we have and develop a coherent program.",
                    "label": 0
                },
                {
                    "sent": "Nevertheless, we have developed really road Map Technology, road map and we're looking at a short term mission 2020 which would be network Lander system and then also looking at effectively this one.",
                    "label": 1
                },
                {
                    "sent": "I mean the MSR, the Mars sample return is the final goal, so we would like to have a sample.",
                    "label": 0
                },
                {
                    "sent": "From the Martian surface being launched back to Earth so that we can analyze that sample on ground in our big laboratories, which will allow us to have much more Fidelity and much more sensitive, much higher sensitivity than we can do in C2 instrumentation.",
                    "label": 0
                },
                {
                    "sent": "So I would like to conclude then with my main.",
                    "label": 0
                },
                {
                    "sent": "Points here, so either has a mandatory program which is the cosmic vision science program.",
                    "label": 0
                },
                {
                    "sent": "It consists of very carefully selected missions which are studied in competition and effectively only the best ones really survive and get basically to being launched.",
                    "label": 0
                },
                {
                    "sent": "It's also face down selection, so that means that we don't only have announcement of opportunity and then select one and you fly that now we select a number and then give them a chance.",
                    "label": 0
                },
                {
                    "sent": "We help to try to see if we can develop that to flight ready position or not.",
                    "label": 0
                },
                {
                    "sent": "And so this finally we have a very.",
                    "label": 0
                },
                {
                    "sent": "Mature selection that we can do, but Thirdly nevertheless it is such a long term selection process.",
                    "label": 0
                },
                {
                    "sent": "It is also a slice program.",
                    "label": 0
                },
                {
                    "sent": "That means that every three to four years we allow the program to rejuvenate by announcement by issuing another announcement of opportunity where the science community can propose mission concepts.",
                    "label": 0
                },
                {
                    "sent": "As I mentioned, it is expected that such an announcement of opportunity will be issued in the second half of this year, probably in the last quarter of this year.",
                    "label": 0
                },
                {
                    "sent": "And I would suggest you to keep an open eye here on this and maybe start, you know, talking to your colleagues, which might be you know.",
                    "label": 0
                },
                {
                    "sent": "In the current is a Member States so that you know more eligible to the contributions by the PAX program.",
                    "label": 0
                },
                {
                    "sent": "As you will hear as well, you will have certain opportunities already to collaborate in the future missions.",
                    "label": 0
                },
                {
                    "sent": "You will be more limited in terms of the technology programs that we have established in our Rd Maps.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It is very important to really get involved very early.",
                    "label": 0
                },
                {
                    "sent": "I mean we have experienced this with other Member States that very often.",
                    "label": 0
                },
                {
                    "sent": "Countries become Member States and then it is discovered that the return the Geo return the money that goes back to the country is limited because simply there is no heritage which can be demonstrated by the newcomers 'cause they established parties already.",
                    "label": 0
                },
                {
                    "sent": "Of course out on the playing field.",
                    "label": 0
                },
                {
                    "sent": "So I think first of all it's very important to establish awareness of these programs so so that you know what is being planned for the European science programs, you should define a strategic focus for your own interests, so you should identify what yourself you're interested in doing, what you think you should would like to contribute, what you what.",
                    "label": 1
                },
                {
                    "sent": "The position is that you would like to achieve.",
                    "label": 0
                },
                {
                    "sent": "You have to identify.",
                    "label": 0
                },
                {
                    "sent": "Competitive contribution opportunities.",
                    "label": 0
                },
                {
                    "sent": "So you really have to develop something which will stand the competition.",
                    "label": 1
                },
                {
                    "sent": "Our contracts are issued normally as invitations to tender which are open competition so you will be competing with all of Europe.",
                    "label": 0
                },
                {
                    "sent": "Let this not discourage you.",
                    "label": 0
                },
                {
                    "sent": "I'm convinced there are a lot of parties here in entities here in Slovenia which can very well master these ITES and get selected.",
                    "label": 0
                },
                {
                    "sent": "It will be very important that the proper heritage is demonstrated.",
                    "label": 0
                },
                {
                    "sent": "And the proper connections and teams are built and constructed.",
                    "label": 0
                },
                {
                    "sent": "So really, establishing a heritage building on the capabilities existing.",
                    "label": 0
                },
                {
                    "sent": "So the technology is a good open door to open, so if you have developed the technology which is effectively, you know in this areas of strategic interest for Slovenia and Slovenia and its institutions, of course, and if these developers are them based on solid expertise which already exists in the country.",
                    "label": 1
                },
                {
                    "sent": "And if a strategic commitment is done, a long term commitment, not that we just have, you know, like burning paper, you know big interest at the moment.",
                    "label": 0
                },
                {
                    "sent": "But then in five years time this is forgotten we will come back in five years time.",
                    "label": 0
                },
                {
                    "sent": "That is when effectively these big money will start flowing in order to build flight flight systems.",
                    "label": 0
                },
                {
                    "sent": "And it's also very important to develop really partnerships here.",
                    "label": 0
                },
                {
                    "sent": "So to develop really the teams within Europe extending over the borders.",
                    "label": 0
                },
                {
                    "sent": "This is the way that actually the work is done on the programs.",
                    "label": 0
                },
                {
                    "sent": "If you look at how the spacecraft are built then you have really very international Maps.",
                    "label": 1
                },
                {
                    "sent": "And even if you look at the individual instruments you will see here that this is a partnership extending far beyond borders.",
                    "label": 0
                },
                {
                    "sent": "So achievement requires audacity, so trust in yourself and go ahead.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}