{
    "id": "sy2qn2eyqhawstsypm4axnloywxf3rna",
    "title": "Perspective on the Goals and Complexities of Inclusive Design",
    "info": {
        "author": [
            "Annuska Perkins, Microsoft"
        ],
        "published": "Jan. 19, 2010",
        "recorded": "December 2009",
        "category": [
            "Top->Computer Science->Optimization Methods"
        ]
    },
    "url": "http://videolectures.net/nips09_zolyomi_perkins_pgc/",
    "segmentation": [
        [
            "I'm kind of representing a lot of work that happens at Microsoft and is kind of, well, it's very much a bigger picture discussion than what we've seen in the previous papers.",
            "So what I wanted to do was talk about our challenges we have of designing accessible software an where I see some opportunities for machine learning to be applied and help people with disabilities.",
            "Anne."
        ],
        [
            "Our our work that we do encompasses a lot of different hardware from.",
            "Multi monitors and small mobile devices.",
            "Touch screens and voice recognition.",
            "So one of our big challenges is really just understanding how people are using all of these different devices together and trying to make that interaction as natural as possible."
        ],
        [
            "So what I wanted to talk about was the demographics of Accessibility and then talk about how we're mapping the user needs with technology that exists and looking for where there's gaps and opportunities there.",
            "So that's the flow of the presentation, and then I'll end with some websites that we have.",
            "If you want further information.",
            "So for the end users for Accessibility."
        ],
        [
            "We did some research with Forrester Research in 2003 that was the market sizing to understand who are all the people that could benefit from excess."
        ],
        [
            "Old technology and what we found was that 57% of computer users in the US would actually benefit from using assistive technology and what we looked at was a very task based approach for how what people's needs are.",
            "So it wasn't just their physical condition of are you blind or do you consider yourself of having low vision.",
            "But we ask ask people, do you have problems seeing faces on a TV screen or reading newspaper print and so that was like some of the vision?",
            "Questions and for dexterity.",
            "We would ask, do you ever have problems holding a pen?",
            "And things like that.",
            "So it was like everyday task and that's why the number probably seems larger than other numbers that you might have seen in the past.",
            "But that was our methodology and then you can see how it's broken down that one in four have a vision impairment.",
            "One and four have some dexterity or mobility, and hearing is one in five.",
            "And."
        ],
        [
            "We've really brought in our definition and how we think of Accessibility to not just severe disabilities, but also just environmental factors or preferences as well.",
            "So you might have somebody who just had surgery like I was working with somebody who had so shoulder surgery, and then he used voice recognition while he was recovering from that.",
            "Or you could have just people who prefer a simpler display than what the default display is on your PC, so that's the whole range of what we're looking at.",
            "And what I've started in our team started to consolidate all of these various peoples needs and technology that is out there into a matrix.",
            "And I'm going to bring this up and show you just a glimpse of kind of just to show the complexity of the space.",
            "So down the side in column A&BR."
        ],
        [
            "Different types of disabilities and then along the top row number one are different assistive technologies or accommodations or technology that could meet these needs.",
            "So for an example like in an area I'm really interested is in cognitive, so I'll bring the cognitive area up and I'm just starting.",
            "I'm starting to break this out into what does it mean when we talk about cognitive disabilities, so learning disabilities, dyslexia can have difficulty with attention.",
            "Trouble organizing your thoughts, memory loss, etc.",
            "And then where is there a solution today?",
            "Well like and I'm thinking of PC's and mobile devices and gaming devices and all across the border.",
            "So we know that customizing colors can help people with dyslexia or if they can hear a document read out loud to them rather than them having to visually process it.",
            "That can be helpful for them.",
            "But I have another tab here that shows where there's opportunities and so wherever there is an oh here on this chart is where I see an opportunity where there could be some more work done so.",
            "Example for dyslexia, which we were talking about right now.",
            "There's nothing like inmet in magnification that helps people with dyslexia specifically, but there could be something that ties in a multi modal experience where you're.",
            "You're just seeing the words that you're trying to process at the time, and maybe they're being visibly scanned as you're reading along, and that can help people with dyslexia as well.",
            "So that's just and you can see that there's just so much opportunity here with all the.",
            "So my point with this chart, 'cause I know it's quite an eye chart to try to see from the audience, but the point is that we're, I think we're just skimming the surface right now for what can be done for for disabilities.",
            "OK, so to get into opera."
        ],
        [
            "She's with machine learning.",
            "I."
        ],
        [
            "To talk about a few scenarios that are very difficult today and where there's a lot of pain points for people and one is assessing what?",
            "What based on who you are?",
            "What is going to be the best technology solution for you?",
            "And it's right now it's a cumbersome process where if you're a student or you're an adult with a difficulty, there's a lot of research that you have to do to find out what assistive technology is available.",
            "You have to work with or the best bet you have is to go to like an assistive technology center where there is an expert there who knows about the wide range of 80s and can do trial and error and try out different screen, like maybe.",
            "They know you want to screen reader, but there's a lot of screen readers out on the market.",
            "And really, what's going to be the best one?",
            "The easiest one for you to learn, and that's going to work the way that you like, for example.",
            "Or if you have a learning disability, there's not just like one solution that helps everybody that has a learning disability.",
            "And also so the second point is that your characteristics change overtime, so it's not just one snapshot of.",
            "OK today I'm going to configure my machine and my eyesight is fine today and so I set everything up and I'm fine.",
            "But say if you have diabetes and your eyesight is changing overtime and it could be worse the very next day and so it's not just a one time thing.",
            "And that's true for other types of disabilities as well.",
            "And there's also just your cognitive load of if you're feeling overwhelmed at the time or your attention, you're trying to do 5 different things that at once, and that is a problem for typical people, but it's even more so if you have a DD or you have a cognitive disability and that's just something that just depends on your environment that you're in, and what else is going on and what kind of day you're having.",
            "So it's just this dynamic situation we have to take into account."
        ],
        [
            "So, um.",
            "2.",
            "I wanted to show I.",
            "In Windows Vista and in Windows 7, we have actually ease of access center that has.",
            "All of our Accessibility related features in here and they are things for people who are, you know, the wide range of disabilities.",
            "But what we added in Vista was this questionnaire that says not sure where to start.",
            "Get recommendations to make your computer easier to use.",
            "And.",
            "This was our first step in trying to do this assessment in this mapping between peoples needs and people and the assistive technology that's available and we use a lot of that same methodology that we had in the research about a very task based approach.",
            "Like for this one.",
            "This is all about your eyesight.",
            "One of the check boxes here is lighting conditions.",
            "Make it difficult to see images on my monitor.",
            "We also have on here.",
            "I am blind because we heard from people that are blind.",
            "He said if I'm blind I just want to say that I am.",
            "I don't.",
            "Need to be wishy washy around, just let me just indicate that I'm blind and then move on and so this wizard I won't go through it right now because of time but at the end it walks through various types of disabilities and at the end it recommends different settings.",
            "An assistive technology on your computer for you.",
            "But this is a very preliminary and you could probably think of a lot of reasons why it doesn't adjust.",
            "You know all the things I was talking about before, but how?",
            "It's a very dynamic situation.",
            "That solution doesn't account for that at all, so there's a lot of room for improvement there.",
            "So I.",
            "Let's see other scenarios that where I think machine learning could help is, for example with autism, that people with autism often have a hard time reading social cues and understanding people's gestures, and this is something that comes more naturally to some of us that it's something that takes a lot.",
            "We really breakdown the gestures and the facial cues and sentence is tie that to emotion, emotion and then teach that to the like.",
            "A child with autism.",
            "Um?",
            "Another area is with traumatic brain injuries.",
            "People can have a hard time like I was doing some research with somebody who had an injury and he was saying he he's a developer and he can code.",
            "But then the next day when he comes back to it, he can't remember what he was working on the day before an where he was in solving his problem.",
            "And so he uses this a remote helper.",
            "It's a person who he can send tidbits of information and say OK, remind me about this tomorrow or put this on my schedule for tomorrow.",
            "Or this is a new person I just met and they met them at this conference and so put that with all my other information about my conference like he just needs that additional person who is doing that type of task for him.",
            "Um, let's see."
        ],
        [
            "I think I'm going to just move on.",
            "I'm going as I know I don't have a lot of time.",
            "But a few areas I wanted to touch on and some of them we've heard about at presentations earlier today, which I thought was really great.",
            "Iaccessible captures is an area where there's a right now those are the when you log on to a website and you have to prove that you're a human, you have to enter in those characters that look really weird.",
            "Well, that's if you're blind.",
            "You know those aren't usable at all, so some sites have inaudible captcha that you listen to, and then you type in what you're hearing.",
            "But what if you're in a loud environment?",
            "Or what if you're deaf and blind?",
            "Then you're using a refreshable Braille display.",
            "Anne and I just think there's opportunity here for machine learning to.",
            "How does a person prove that there are human?",
            "Like what is could there?",
            "What kind of inputs could the person be giving that only would come from a person and the computer would be able to recognize that?",
            "I don't know what the solution is, but I think somebody could figure that out.",
            "Another problem we have is with online media where there's.",
            "This kind of goes to the adaptive UI.",
            "Environment where it's like.",
            "Here's a screenshot we have of an ad.",
            "And this is one of the prototypes that my team worked."
        ],
        [
            "On an expert, we have on our team that works on media and so he added captions.",
            "This is like an example of how you make this fully accessible.",
            "It has captions along the bottom, it has audio description along the top which is also being spoken out loud.",
            "So this says Bill Gates hold groceries in a parking lot and email address.",
            "Bill at windows.microsoft.com is overlaid.",
            "So that's for somebody who's blind.",
            "And then we also have a sign language interpreter who's signing.",
            "It.",
            "And putting all these pieces together and making this a very usable experience is a challenge, but it's possible with today's technology and that's part of what we try to do is get the word out about how you can make this stuff happen, but right now it's a very manual process from the captions and the audio descriptions to the video of the sign language interpreter one day.",
            "This could all be automated, but the technology isn't there right now to have like a signing avatar.",
            "It's getting a lot better, but it's still not as easy to understand as a huge watching a human's facial expressions are very important when you're signing in the Avatars.",
            "Facial expressions aren't there yet.",
            "So.",
            "OK, this just walks through the different Accessibility parts."
        ],
        [
            "Um?",
            "Here's some other opportunities that are there and I'm happy to share this deck with anybody who would like it or discuss later on.",
            "When?",
            "One thing I wanted to get to for sure was."
        ],
        [
            "Some sources of data that might be helpful for people.",
            "One is called UI automation and this is a way to know what's happening on a PC, so it's a data model of what the interface is.",
            "So for an example here on this address bar that's highlighted in red, that's what the object model would show you.",
            "What the name of the object is, what control type it is, what actions you can do with it, where is it?",
            "What's the bounding rectangle of this.",
            "And so if you were interested in doing any type of application where you're watching what the user is doing.",
            "Doing anything on behalf of the user.",
            "This API is available in Windows to use.",
            "Also, in Windows there is a sense."
        ],
        [
            "Platform, so if your device has any kind of accelerometers on it or location, GPS tracking, ambient light, there's a common application programming interface to use those to collect all that data and create an application that extracts all that data.",
            "And also we've heard about different this entertainement idea of how do we can we?",
            "Data mined what people are doing with in games or music or.",
            "Taking videos of themselves and what's going on around them too.",
            "Extract and this was an earlier point I had on a slide that I'll just mention really quickly that there's some research going on with like trying to detect early onset of disabilities.",
            "So for example like watching a video of a baby with a toddler before they're diagnosed with autism to see if you could have seen early detection of autism so and also with all timers being able to see those early signs through combing through all this video that we have of home videos and things like that."
        ],
        [
            "Kind of an interesting area as well.",
            "So that's."
        ],
        [
            "Just like a ton, I feel like I touched on a ton of different topics, but.",
            "I hope that that gave you just an idea of the breadth of what we're working on, and some scenarios that are really still challenging and Accessibility that I think that machine learning could actually make help make some big progress on an.",
            "Here's a bunch of websites with additional information if anybody wanted it."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm kind of representing a lot of work that happens at Microsoft and is kind of, well, it's very much a bigger picture discussion than what we've seen in the previous papers.",
                    "label": 0
                },
                {
                    "sent": "So what I wanted to do was talk about our challenges we have of designing accessible software an where I see some opportunities for machine learning to be applied and help people with disabilities.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our our work that we do encompasses a lot of different hardware from.",
                    "label": 0
                },
                {
                    "sent": "Multi monitors and small mobile devices.",
                    "label": 0
                },
                {
                    "sent": "Touch screens and voice recognition.",
                    "label": 0
                },
                {
                    "sent": "So one of our big challenges is really just understanding how people are using all of these different devices together and trying to make that interaction as natural as possible.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what I wanted to talk about was the demographics of Accessibility and then talk about how we're mapping the user needs with technology that exists and looking for where there's gaps and opportunities there.",
                    "label": 0
                },
                {
                    "sent": "So that's the flow of the presentation, and then I'll end with some websites that we have.",
                    "label": 0
                },
                {
                    "sent": "If you want further information.",
                    "label": 0
                },
                {
                    "sent": "So for the end users for Accessibility.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We did some research with Forrester Research in 2003 that was the market sizing to understand who are all the people that could benefit from excess.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Old technology and what we found was that 57% of computer users in the US would actually benefit from using assistive technology and what we looked at was a very task based approach for how what people's needs are.",
                    "label": 1
                },
                {
                    "sent": "So it wasn't just their physical condition of are you blind or do you consider yourself of having low vision.",
                    "label": 0
                },
                {
                    "sent": "But we ask ask people, do you have problems seeing faces on a TV screen or reading newspaper print and so that was like some of the vision?",
                    "label": 0
                },
                {
                    "sent": "Questions and for dexterity.",
                    "label": 0
                },
                {
                    "sent": "We would ask, do you ever have problems holding a pen?",
                    "label": 0
                },
                {
                    "sent": "And things like that.",
                    "label": 0
                },
                {
                    "sent": "So it was like everyday task and that's why the number probably seems larger than other numbers that you might have seen in the past.",
                    "label": 0
                },
                {
                    "sent": "But that was our methodology and then you can see how it's broken down that one in four have a vision impairment.",
                    "label": 0
                },
                {
                    "sent": "One and four have some dexterity or mobility, and hearing is one in five.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We've really brought in our definition and how we think of Accessibility to not just severe disabilities, but also just environmental factors or preferences as well.",
                    "label": 1
                },
                {
                    "sent": "So you might have somebody who just had surgery like I was working with somebody who had so shoulder surgery, and then he used voice recognition while he was recovering from that.",
                    "label": 0
                },
                {
                    "sent": "Or you could have just people who prefer a simpler display than what the default display is on your PC, so that's the whole range of what we're looking at.",
                    "label": 0
                },
                {
                    "sent": "And what I've started in our team started to consolidate all of these various peoples needs and technology that is out there into a matrix.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to bring this up and show you just a glimpse of kind of just to show the complexity of the space.",
                    "label": 0
                },
                {
                    "sent": "So down the side in column A&BR.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Different types of disabilities and then along the top row number one are different assistive technologies or accommodations or technology that could meet these needs.",
                    "label": 0
                },
                {
                    "sent": "So for an example like in an area I'm really interested is in cognitive, so I'll bring the cognitive area up and I'm just starting.",
                    "label": 0
                },
                {
                    "sent": "I'm starting to break this out into what does it mean when we talk about cognitive disabilities, so learning disabilities, dyslexia can have difficulty with attention.",
                    "label": 0
                },
                {
                    "sent": "Trouble organizing your thoughts, memory loss, etc.",
                    "label": 0
                },
                {
                    "sent": "And then where is there a solution today?",
                    "label": 0
                },
                {
                    "sent": "Well like and I'm thinking of PC's and mobile devices and gaming devices and all across the border.",
                    "label": 0
                },
                {
                    "sent": "So we know that customizing colors can help people with dyslexia or if they can hear a document read out loud to them rather than them having to visually process it.",
                    "label": 0
                },
                {
                    "sent": "That can be helpful for them.",
                    "label": 0
                },
                {
                    "sent": "But I have another tab here that shows where there's opportunities and so wherever there is an oh here on this chart is where I see an opportunity where there could be some more work done so.",
                    "label": 0
                },
                {
                    "sent": "Example for dyslexia, which we were talking about right now.",
                    "label": 0
                },
                {
                    "sent": "There's nothing like inmet in magnification that helps people with dyslexia specifically, but there could be something that ties in a multi modal experience where you're.",
                    "label": 0
                },
                {
                    "sent": "You're just seeing the words that you're trying to process at the time, and maybe they're being visibly scanned as you're reading along, and that can help people with dyslexia as well.",
                    "label": 0
                },
                {
                    "sent": "So that's just and you can see that there's just so much opportunity here with all the.",
                    "label": 0
                },
                {
                    "sent": "So my point with this chart, 'cause I know it's quite an eye chart to try to see from the audience, but the point is that we're, I think we're just skimming the surface right now for what can be done for for disabilities.",
                    "label": 0
                },
                {
                    "sent": "OK, so to get into opera.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She's with machine learning.",
                    "label": 0
                },
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To talk about a few scenarios that are very difficult today and where there's a lot of pain points for people and one is assessing what?",
                    "label": 0
                },
                {
                    "sent": "What based on who you are?",
                    "label": 0
                },
                {
                    "sent": "What is going to be the best technology solution for you?",
                    "label": 0
                },
                {
                    "sent": "And it's right now it's a cumbersome process where if you're a student or you're an adult with a difficulty, there's a lot of research that you have to do to find out what assistive technology is available.",
                    "label": 0
                },
                {
                    "sent": "You have to work with or the best bet you have is to go to like an assistive technology center where there is an expert there who knows about the wide range of 80s and can do trial and error and try out different screen, like maybe.",
                    "label": 1
                },
                {
                    "sent": "They know you want to screen reader, but there's a lot of screen readers out on the market.",
                    "label": 0
                },
                {
                    "sent": "And really, what's going to be the best one?",
                    "label": 0
                },
                {
                    "sent": "The easiest one for you to learn, and that's going to work the way that you like, for example.",
                    "label": 0
                },
                {
                    "sent": "Or if you have a learning disability, there's not just like one solution that helps everybody that has a learning disability.",
                    "label": 1
                },
                {
                    "sent": "And also so the second point is that your characteristics change overtime, so it's not just one snapshot of.",
                    "label": 0
                },
                {
                    "sent": "OK today I'm going to configure my machine and my eyesight is fine today and so I set everything up and I'm fine.",
                    "label": 0
                },
                {
                    "sent": "But say if you have diabetes and your eyesight is changing overtime and it could be worse the very next day and so it's not just a one time thing.",
                    "label": 0
                },
                {
                    "sent": "And that's true for other types of disabilities as well.",
                    "label": 0
                },
                {
                    "sent": "And there's also just your cognitive load of if you're feeling overwhelmed at the time or your attention, you're trying to do 5 different things that at once, and that is a problem for typical people, but it's even more so if you have a DD or you have a cognitive disability and that's just something that just depends on your environment that you're in, and what else is going on and what kind of day you're having.",
                    "label": 0
                },
                {
                    "sent": "So it's just this dynamic situation we have to take into account.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So, um.",
                    "label": 0
                },
                {
                    "sent": "2.",
                    "label": 0
                },
                {
                    "sent": "I wanted to show I.",
                    "label": 0
                },
                {
                    "sent": "In Windows Vista and in Windows 7, we have actually ease of access center that has.",
                    "label": 0
                },
                {
                    "sent": "All of our Accessibility related features in here and they are things for people who are, you know, the wide range of disabilities.",
                    "label": 0
                },
                {
                    "sent": "But what we added in Vista was this questionnaire that says not sure where to start.",
                    "label": 0
                },
                {
                    "sent": "Get recommendations to make your computer easier to use.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "This was our first step in trying to do this assessment in this mapping between peoples needs and people and the assistive technology that's available and we use a lot of that same methodology that we had in the research about a very task based approach.",
                    "label": 0
                },
                {
                    "sent": "Like for this one.",
                    "label": 0
                },
                {
                    "sent": "This is all about your eyesight.",
                    "label": 0
                },
                {
                    "sent": "One of the check boxes here is lighting conditions.",
                    "label": 0
                },
                {
                    "sent": "Make it difficult to see images on my monitor.",
                    "label": 0
                },
                {
                    "sent": "We also have on here.",
                    "label": 0
                },
                {
                    "sent": "I am blind because we heard from people that are blind.",
                    "label": 0
                },
                {
                    "sent": "He said if I'm blind I just want to say that I am.",
                    "label": 0
                },
                {
                    "sent": "I don't.",
                    "label": 0
                },
                {
                    "sent": "Need to be wishy washy around, just let me just indicate that I'm blind and then move on and so this wizard I won't go through it right now because of time but at the end it walks through various types of disabilities and at the end it recommends different settings.",
                    "label": 0
                },
                {
                    "sent": "An assistive technology on your computer for you.",
                    "label": 0
                },
                {
                    "sent": "But this is a very preliminary and you could probably think of a lot of reasons why it doesn't adjust.",
                    "label": 0
                },
                {
                    "sent": "You know all the things I was talking about before, but how?",
                    "label": 0
                },
                {
                    "sent": "It's a very dynamic situation.",
                    "label": 0
                },
                {
                    "sent": "That solution doesn't account for that at all, so there's a lot of room for improvement there.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                },
                {
                    "sent": "Let's see other scenarios that where I think machine learning could help is, for example with autism, that people with autism often have a hard time reading social cues and understanding people's gestures, and this is something that comes more naturally to some of us that it's something that takes a lot.",
                    "label": 0
                },
                {
                    "sent": "We really breakdown the gestures and the facial cues and sentence is tie that to emotion, emotion and then teach that to the like.",
                    "label": 0
                },
                {
                    "sent": "A child with autism.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Another area is with traumatic brain injuries.",
                    "label": 1
                },
                {
                    "sent": "People can have a hard time like I was doing some research with somebody who had an injury and he was saying he he's a developer and he can code.",
                    "label": 0
                },
                {
                    "sent": "But then the next day when he comes back to it, he can't remember what he was working on the day before an where he was in solving his problem.",
                    "label": 0
                },
                {
                    "sent": "And so he uses this a remote helper.",
                    "label": 1
                },
                {
                    "sent": "It's a person who he can send tidbits of information and say OK, remind me about this tomorrow or put this on my schedule for tomorrow.",
                    "label": 0
                },
                {
                    "sent": "Or this is a new person I just met and they met them at this conference and so put that with all my other information about my conference like he just needs that additional person who is doing that type of task for him.",
                    "label": 0
                },
                {
                    "sent": "Um, let's see.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think I'm going to just move on.",
                    "label": 0
                },
                {
                    "sent": "I'm going as I know I don't have a lot of time.",
                    "label": 0
                },
                {
                    "sent": "But a few areas I wanted to touch on and some of them we've heard about at presentations earlier today, which I thought was really great.",
                    "label": 0
                },
                {
                    "sent": "Iaccessible captures is an area where there's a right now those are the when you log on to a website and you have to prove that you're a human, you have to enter in those characters that look really weird.",
                    "label": 0
                },
                {
                    "sent": "Well, that's if you're blind.",
                    "label": 0
                },
                {
                    "sent": "You know those aren't usable at all, so some sites have inaudible captcha that you listen to, and then you type in what you're hearing.",
                    "label": 0
                },
                {
                    "sent": "But what if you're in a loud environment?",
                    "label": 0
                },
                {
                    "sent": "Or what if you're deaf and blind?",
                    "label": 0
                },
                {
                    "sent": "Then you're using a refreshable Braille display.",
                    "label": 0
                },
                {
                    "sent": "Anne and I just think there's opportunity here for machine learning to.",
                    "label": 0
                },
                {
                    "sent": "How does a person prove that there are human?",
                    "label": 0
                },
                {
                    "sent": "Like what is could there?",
                    "label": 0
                },
                {
                    "sent": "What kind of inputs could the person be giving that only would come from a person and the computer would be able to recognize that?",
                    "label": 0
                },
                {
                    "sent": "I don't know what the solution is, but I think somebody could figure that out.",
                    "label": 0
                },
                {
                    "sent": "Another problem we have is with online media where there's.",
                    "label": 0
                },
                {
                    "sent": "This kind of goes to the adaptive UI.",
                    "label": 0
                },
                {
                    "sent": "Environment where it's like.",
                    "label": 0
                },
                {
                    "sent": "Here's a screenshot we have of an ad.",
                    "label": 0
                },
                {
                    "sent": "And this is one of the prototypes that my team worked.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On an expert, we have on our team that works on media and so he added captions.",
                    "label": 0
                },
                {
                    "sent": "This is like an example of how you make this fully accessible.",
                    "label": 0
                },
                {
                    "sent": "It has captions along the bottom, it has audio description along the top which is also being spoken out loud.",
                    "label": 0
                },
                {
                    "sent": "So this says Bill Gates hold groceries in a parking lot and email address.",
                    "label": 0
                },
                {
                    "sent": "Bill at windows.microsoft.com is overlaid.",
                    "label": 0
                },
                {
                    "sent": "So that's for somebody who's blind.",
                    "label": 0
                },
                {
                    "sent": "And then we also have a sign language interpreter who's signing.",
                    "label": 0
                },
                {
                    "sent": "It.",
                    "label": 0
                },
                {
                    "sent": "And putting all these pieces together and making this a very usable experience is a challenge, but it's possible with today's technology and that's part of what we try to do is get the word out about how you can make this stuff happen, but right now it's a very manual process from the captions and the audio descriptions to the video of the sign language interpreter one day.",
                    "label": 0
                },
                {
                    "sent": "This could all be automated, but the technology isn't there right now to have like a signing avatar.",
                    "label": 0
                },
                {
                    "sent": "It's getting a lot better, but it's still not as easy to understand as a huge watching a human's facial expressions are very important when you're signing in the Avatars.",
                    "label": 0
                },
                {
                    "sent": "Facial expressions aren't there yet.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "OK, this just walks through the different Accessibility parts.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Here's some other opportunities that are there and I'm happy to share this deck with anybody who would like it or discuss later on.",
                    "label": 0
                },
                {
                    "sent": "When?",
                    "label": 0
                },
                {
                    "sent": "One thing I wanted to get to for sure was.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some sources of data that might be helpful for people.",
                    "label": 1
                },
                {
                    "sent": "One is called UI automation and this is a way to know what's happening on a PC, so it's a data model of what the interface is.",
                    "label": 0
                },
                {
                    "sent": "So for an example here on this address bar that's highlighted in red, that's what the object model would show you.",
                    "label": 0
                },
                {
                    "sent": "What the name of the object is, what control type it is, what actions you can do with it, where is it?",
                    "label": 0
                },
                {
                    "sent": "What's the bounding rectangle of this.",
                    "label": 0
                },
                {
                    "sent": "And so if you were interested in doing any type of application where you're watching what the user is doing.",
                    "label": 0
                },
                {
                    "sent": "Doing anything on behalf of the user.",
                    "label": 1
                },
                {
                    "sent": "This API is available in Windows to use.",
                    "label": 0
                },
                {
                    "sent": "Also, in Windows there is a sense.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Platform, so if your device has any kind of accelerometers on it or location, GPS tracking, ambient light, there's a common application programming interface to use those to collect all that data and create an application that extracts all that data.",
                    "label": 0
                },
                {
                    "sent": "And also we've heard about different this entertainement idea of how do we can we?",
                    "label": 0
                },
                {
                    "sent": "Data mined what people are doing with in games or music or.",
                    "label": 0
                },
                {
                    "sent": "Taking videos of themselves and what's going on around them too.",
                    "label": 0
                },
                {
                    "sent": "Extract and this was an earlier point I had on a slide that I'll just mention really quickly that there's some research going on with like trying to detect early onset of disabilities.",
                    "label": 0
                },
                {
                    "sent": "So for example like watching a video of a baby with a toddler before they're diagnosed with autism to see if you could have seen early detection of autism so and also with all timers being able to see those early signs through combing through all this video that we have of home videos and things like that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kind of an interesting area as well.",
                    "label": 0
                },
                {
                    "sent": "So that's.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just like a ton, I feel like I touched on a ton of different topics, but.",
                    "label": 0
                },
                {
                    "sent": "I hope that that gave you just an idea of the breadth of what we're working on, and some scenarios that are really still challenging and Accessibility that I think that machine learning could actually make help make some big progress on an.",
                    "label": 0
                },
                {
                    "sent": "Here's a bunch of websites with additional information if anybody wanted it.",
                    "label": 0
                }
            ]
        }
    }
}