{
    "id": "syaf2u4sc6zs5ilbvvqi2kwpbfanxc55",
    "title": "Probabilistic Latent Network Visualization: Inferring and Embedding Diffusion Networks",
    "info": {
        "author": [
            "Takeshi Kurashima, Nippon Telegraph and Telephone Corporation (NTT)"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_kurashima_network_visualization/",
    "segmentation": [
        [
            "Hello everyone, my name is Turkish Cresima from Entity Corporation Japan.",
            "Today we looked for estimating diffusion networks, which we called probabilistic latent network visualization."
        ],
        [
            "So let me start with the background of our research.",
            "At the hearing, have information can remotes and disease here simply with the probabilistic processes over the network structures.",
            "At the huge instead at one node and then spread to node two node to the edge of the network structure.",
            "Understanding the mechanism to generalized diffusion process can help to predict mean propagation and optimize advertising strategies and counter infection."
        ],
        [
            "And, however, in most cases the network structures generate and that generates the diffusion process is observed.",
            "Personalization becomes possible where no mentions information makes a decision or becomes infected.",
            "For example, 1 cascade is a record of the times where at which at which nodes are influenced by events such as reading a book, watching a movie, and listening to music.",
            "And."
        ],
        [
            "Our task is to estimate and infer diffusion networks based on Cascade data.",
            "And there are some existing model which estimate diffusion networks."
        ],
        [
            "And an important feature of our model.",
            "Is to estimate diffusion networks by embedding it into low dimensional Euclidean space.",
            "Now we assume that.",
            "Each node N has latent coordinates XN and the D dimensional latent space.",
            "And.",
            "Diffusion is more likely to occur between nodes that that are placed close together.",
            "For example, where we analyze the outbreak of influenza, learn space is expected to reflect the geographical closeness and distance between people and real world.",
            "And our model attempt to learn the dating coordinates of nodes that best explains the observed cascade data.",
            "So our model is very simple but effective."
        ],
        [
            "When the number of dimensions in our model is set to two or three, our model suggests a network layout which satisfies the influence preserving principle.",
            "Each node attempt to place each influential node really close and then known influential words.",
            "A rabbit view of the two dimensional and three dimensional layout allows us to identify communities where in the nodes strongly influenced each other."
        ],
        [
            "And another important feature of our model is it robustness.",
            "For example, when we analyzed, we analyzed diffusion process, our new or layer information and disease.",
            "Only a small number of cascades might be available.",
            "Even there are and there are a few cascade data.",
            "The parameters in R model as can be learned accurately because the number of parameters to be estimated by our model is significantly significantly smaller than that existing network inference model.",
            "Why the existing network influence and the number of parameters to be estimated in the existing network inference model increased at the square of the number of nodes?",
            "Up and the number of parameters in our model.",
            "D * N and D is the dimension are key of the latent space, and then it's another nodes.",
            "What's more?",
            "And our model recognize and predict latent relationships between blue and red nodes, even if we.",
            "Cascade data that do not have common nodes are common.",
            "Event linking two nodes.",
            "This should end because the short distance between two nodes in the latent space implies the presence of equal installation."
        ],
        [
            "And our model is based on survival analysis and we introduced three functions.",
            "And the transmission function F is the likelihood of an event happening too.",
            "I at time TI, given that the same event has already happened, happened to J. Ann happened J at time TJ.",
            "And Delta J is the time difference between two timestamps.",
            "Both the survival and hazard functions can be calculated by using the transmission function.",
            "Disable function is the probability that I is not infected by J before time TI.",
            "And how their function is the rate that I becomes infected by J after time TI.",
            "Anne.",
            "In our MoD."
        ],
        [
            "So we use the Weibull model to define the transmission function.",
            "Add Alpha is a parameter, the transmission rate which which type represents how likely not J is to infect node I.",
            "We assumed that.",
            "And the transmission rate is determined by the Euclidean distance between between node J with coordinates XJ and nor do I with coordinate XI and dimensional latent space.",
            "Why the existing network inference model directly infers parameter Alpha?",
            "Our model, in attempt to infer the coordinate X."
        ],
        [
            "And then we use map its mission to learn the unknown parameters.",
            "The unknown parameters set of node coordinates X.",
            "And the negative log likelihood of parameters X was given cascade.",
            "See with prior is as far as calculated by this equation.",
            "And we use a Gaussian prior for coding at X in order to control the size of the desert and embedding embedding."
        ],
        [
            "So the objective function can be minimized through the use of the gradient based numerical optimization method.",
            "The gradient of XN for useful time isation can be calculated by this equation.",
            "So details are given in proceedings."
        ],
        [
            "And we evaluated our model.",
            "By analyzing the information diffusion occurring in web space.",
            "And we used meme to record this it.",
            "In this data set 1 cascade is a record of the timestamps and each time stamps.",
            "Records represents when a news article or blog used keyword.",
            "And we chose eight types of cascade data related related to 8 topics."
        ],
        [
            "And the first experiment evaluated our model in terms of visualization performance.",
            "We first divided Cascade data into training and test set and then evaluate whether or not the visualization spaceland from training data could predict the influence relation in the test data.",
            "And we use F measure as an evaluation metric.",
            "For each node N, we consider the D dimensional bowl B with center XN and radius RM.",
            "And the precision for North is the fraction of nodes that are contained in B and have equal relation to North and the record for node N is the fraction of nodes that have implementation that are successfully contained in B.",
            "And the Greek considered that the influence relation between nodes is true.",
            "If test data has an event wherein both are infected."
        ],
        [
            "And we compared our method against the baseline method existing visualization methodology.",
            "The baseline method consists of two step process.",
            "The base rank first infers that diffusion networks using net rate and then embedded it into two and three dimensional visualization space using MDSS map.",
            "For spring method.",
            "On the other hand, our method.",
            "Estimate the latent coordinates North coordinates into visualization space in one probabilistic framework."
        ],
        [
            "So the figure shows the results.",
            "And in this figures Y axis plot stab Liszt if measure overall nodes.",
            "And our model black growth is better performance than existing baseline methods.",
            "And the results shows that and visualization results over our model.",
            "Satisfied satisfies the influenced preserving principle and the visualization space."
        ],
        [
            "And the two and three dimensional visualization results of methods and each method are compared in these figures.",
            "The baseline method is likely to collapse many nodes to the single point or put them on the circumference of the circles.",
            "On the other hand, our model avoid these problems and exhibit several gently populated areas.",
            "However, our model is approach appropriate for browsing network layout, since we can easily identify communities."
        ],
        [
            "Anne.",
            "Reals evaluated our model in terms of network inference performance.",
            "Although the number of dimensions D in our model is set to two or three for visualization.",
            "A larger number of dimensions D, such as five and 10, can be set for network influence.",
            "And in these previous Y axis both averaged if measure overall nodes and X axis plots number of cascades used for training.",
            "And through some of the proposed model demostrate is better performance than existing network inference model LED product.",
            "Where the number of cascade is less than 300 and the result shows that our proposed model, which we call PMB is appropriate for solving the network inference problem with first Cascade data."
        ],
        [
            "And finally, this right conclude my presentation.",
            "We proposed method for estimating diffusion networks embedding into low dimensional Euclidean space and their model lens rating coordinates of nodes in the latent space that best explains observed Cascade data.",
            "And our model can suggest the network layout and that satisfies the influence preserving principle.",
            "An improved if we can solve the network inference problem with first cascade data.",
            "Anne.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everyone, my name is Turkish Cresima from Entity Corporation Japan.",
                    "label": 0
                },
                {
                    "sent": "Today we looked for estimating diffusion networks, which we called probabilistic latent network visualization.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me start with the background of our research.",
                    "label": 0
                },
                {
                    "sent": "At the hearing, have information can remotes and disease here simply with the probabilistic processes over the network structures.",
                    "label": 1
                },
                {
                    "sent": "At the huge instead at one node and then spread to node two node to the edge of the network structure.",
                    "label": 1
                },
                {
                    "sent": "Understanding the mechanism to generalized diffusion process can help to predict mean propagation and optimize advertising strategies and counter infection.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And, however, in most cases the network structures generate and that generates the diffusion process is observed.",
                    "label": 0
                },
                {
                    "sent": "Personalization becomes possible where no mentions information makes a decision or becomes infected.",
                    "label": 1
                },
                {
                    "sent": "For example, 1 cascade is a record of the times where at which at which nodes are influenced by events such as reading a book, watching a movie, and listening to music.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our task is to estimate and infer diffusion networks based on Cascade data.",
                    "label": 0
                },
                {
                    "sent": "And there are some existing model which estimate diffusion networks.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And an important feature of our model.",
                    "label": 0
                },
                {
                    "sent": "Is to estimate diffusion networks by embedding it into low dimensional Euclidean space.",
                    "label": 0
                },
                {
                    "sent": "Now we assume that.",
                    "label": 0
                },
                {
                    "sent": "Each node N has latent coordinates XN and the D dimensional latent space.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Diffusion is more likely to occur between nodes that that are placed close together.",
                    "label": 0
                },
                {
                    "sent": "For example, where we analyze the outbreak of influenza, learn space is expected to reflect the geographical closeness and distance between people and real world.",
                    "label": 0
                },
                {
                    "sent": "And our model attempt to learn the dating coordinates of nodes that best explains the observed cascade data.",
                    "label": 0
                },
                {
                    "sent": "So our model is very simple but effective.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "When the number of dimensions in our model is set to two or three, our model suggests a network layout which satisfies the influence preserving principle.",
                    "label": 0
                },
                {
                    "sent": "Each node attempt to place each influential node really close and then known influential words.",
                    "label": 1
                },
                {
                    "sent": "A rabbit view of the two dimensional and three dimensional layout allows us to identify communities where in the nodes strongly influenced each other.",
                    "label": 1
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And another important feature of our model is it robustness.",
                    "label": 0
                },
                {
                    "sent": "For example, when we analyzed, we analyzed diffusion process, our new or layer information and disease.",
                    "label": 1
                },
                {
                    "sent": "Only a small number of cascades might be available.",
                    "label": 0
                },
                {
                    "sent": "Even there are and there are a few cascade data.",
                    "label": 0
                },
                {
                    "sent": "The parameters in R model as can be learned accurately because the number of parameters to be estimated by our model is significantly significantly smaller than that existing network inference model.",
                    "label": 0
                },
                {
                    "sent": "Why the existing network influence and the number of parameters to be estimated in the existing network inference model increased at the square of the number of nodes?",
                    "label": 1
                },
                {
                    "sent": "Up and the number of parameters in our model.",
                    "label": 0
                },
                {
                    "sent": "D * N and D is the dimension are key of the latent space, and then it's another nodes.",
                    "label": 0
                },
                {
                    "sent": "What's more?",
                    "label": 0
                },
                {
                    "sent": "And our model recognize and predict latent relationships between blue and red nodes, even if we.",
                    "label": 0
                },
                {
                    "sent": "Cascade data that do not have common nodes are common.",
                    "label": 0
                },
                {
                    "sent": "Event linking two nodes.",
                    "label": 0
                },
                {
                    "sent": "This should end because the short distance between two nodes in the latent space implies the presence of equal installation.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And our model is based on survival analysis and we introduced three functions.",
                    "label": 0
                },
                {
                    "sent": "And the transmission function F is the likelihood of an event happening too.",
                    "label": 0
                },
                {
                    "sent": "I at time TI, given that the same event has already happened, happened to J. Ann happened J at time TJ.",
                    "label": 1
                },
                {
                    "sent": "And Delta J is the time difference between two timestamps.",
                    "label": 0
                },
                {
                    "sent": "Both the survival and hazard functions can be calculated by using the transmission function.",
                    "label": 1
                },
                {
                    "sent": "Disable function is the probability that I is not infected by J before time TI.",
                    "label": 0
                },
                {
                    "sent": "And how their function is the rate that I becomes infected by J after time TI.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "In our MoD.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we use the Weibull model to define the transmission function.",
                    "label": 0
                },
                {
                    "sent": "Add Alpha is a parameter, the transmission rate which which type represents how likely not J is to infect node I.",
                    "label": 1
                },
                {
                    "sent": "We assumed that.",
                    "label": 0
                },
                {
                    "sent": "And the transmission rate is determined by the Euclidean distance between between node J with coordinates XJ and nor do I with coordinate XI and dimensional latent space.",
                    "label": 0
                },
                {
                    "sent": "Why the existing network inference model directly infers parameter Alpha?",
                    "label": 0
                },
                {
                    "sent": "Our model, in attempt to infer the coordinate X.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And then we use map its mission to learn the unknown parameters.",
                    "label": 0
                },
                {
                    "sent": "The unknown parameters set of node coordinates X.",
                    "label": 1
                },
                {
                    "sent": "And the negative log likelihood of parameters X was given cascade.",
                    "label": 1
                },
                {
                    "sent": "See with prior is as far as calculated by this equation.",
                    "label": 0
                },
                {
                    "sent": "And we use a Gaussian prior for coding at X in order to control the size of the desert and embedding embedding.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the objective function can be minimized through the use of the gradient based numerical optimization method.",
                    "label": 1
                },
                {
                    "sent": "The gradient of XN for useful time isation can be calculated by this equation.",
                    "label": 0
                },
                {
                    "sent": "So details are given in proceedings.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we evaluated our model.",
                    "label": 0
                },
                {
                    "sent": "By analyzing the information diffusion occurring in web space.",
                    "label": 1
                },
                {
                    "sent": "And we used meme to record this it.",
                    "label": 0
                },
                {
                    "sent": "In this data set 1 cascade is a record of the timestamps and each time stamps.",
                    "label": 1
                },
                {
                    "sent": "Records represents when a news article or blog used keyword.",
                    "label": 1
                },
                {
                    "sent": "And we chose eight types of cascade data related related to 8 topics.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the first experiment evaluated our model in terms of visualization performance.",
                    "label": 1
                },
                {
                    "sent": "We first divided Cascade data into training and test set and then evaluate whether or not the visualization spaceland from training data could predict the influence relation in the test data.",
                    "label": 1
                },
                {
                    "sent": "And we use F measure as an evaluation metric.",
                    "label": 0
                },
                {
                    "sent": "For each node N, we consider the D dimensional bowl B with center XN and radius RM.",
                    "label": 0
                },
                {
                    "sent": "And the precision for North is the fraction of nodes that are contained in B and have equal relation to North and the record for node N is the fraction of nodes that have implementation that are successfully contained in B.",
                    "label": 0
                },
                {
                    "sent": "And the Greek considered that the influence relation between nodes is true.",
                    "label": 0
                },
                {
                    "sent": "If test data has an event wherein both are infected.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we compared our method against the baseline method existing visualization methodology.",
                    "label": 0
                },
                {
                    "sent": "The baseline method consists of two step process.",
                    "label": 1
                },
                {
                    "sent": "The base rank first infers that diffusion networks using net rate and then embedded it into two and three dimensional visualization space using MDSS map.",
                    "label": 1
                },
                {
                    "sent": "For spring method.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, our method.",
                    "label": 0
                },
                {
                    "sent": "Estimate the latent coordinates North coordinates into visualization space in one probabilistic framework.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the figure shows the results.",
                    "label": 0
                },
                {
                    "sent": "And in this figures Y axis plot stab Liszt if measure overall nodes.",
                    "label": 0
                },
                {
                    "sent": "And our model black growth is better performance than existing baseline methods.",
                    "label": 0
                },
                {
                    "sent": "And the results shows that and visualization results over our model.",
                    "label": 0
                },
                {
                    "sent": "Satisfied satisfies the influenced preserving principle and the visualization space.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the two and three dimensional visualization results of methods and each method are compared in these figures.",
                    "label": 0
                },
                {
                    "sent": "The baseline method is likely to collapse many nodes to the single point or put them on the circumference of the circles.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, our model avoid these problems and exhibit several gently populated areas.",
                    "label": 0
                },
                {
                    "sent": "However, our model is approach appropriate for browsing network layout, since we can easily identify communities.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Reals evaluated our model in terms of network inference performance.",
                    "label": 0
                },
                {
                    "sent": "Although the number of dimensions D in our model is set to two or three for visualization.",
                    "label": 0
                },
                {
                    "sent": "A larger number of dimensions D, such as five and 10, can be set for network influence.",
                    "label": 0
                },
                {
                    "sent": "And in these previous Y axis both averaged if measure overall nodes and X axis plots number of cascades used for training.",
                    "label": 0
                },
                {
                    "sent": "And through some of the proposed model demostrate is better performance than existing network inference model LED product.",
                    "label": 0
                },
                {
                    "sent": "Where the number of cascade is less than 300 and the result shows that our proposed model, which we call PMB is appropriate for solving the network inference problem with first Cascade data.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally, this right conclude my presentation.",
                    "label": 0
                },
                {
                    "sent": "We proposed method for estimating diffusion networks embedding into low dimensional Euclidean space and their model lens rating coordinates of nodes in the latent space that best explains observed Cascade data.",
                    "label": 0
                },
                {
                    "sent": "And our model can suggest the network layout and that satisfies the influence preserving principle.",
                    "label": 1
                },
                {
                    "sent": "An improved if we can solve the network inference problem with first cascade data.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}