{
    "id": "t3sssqbanruclgmtluz34c3ip7ndd3kf",
    "title": "Beyond Active Noun Tagging: Modeling Contextual Interactions for Multi-Class Active Learning",
    "info": {
        "author": [
            "Behjat Siddiquie, Department of Computer Science, University of Maryland"
        ],
        "published": "July 19, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Computer Science->Computer Vision",
            "Top->Computer Science->Machine Learning->Active Learning"
        ]
    },
    "url": "http://videolectures.net/cvpr2010_siddiquie_bant/",
    "segmentation": [
        [
            "Good morning, I'm magically from the University of Maryland and I'll talk about my paper titled Beyond Active Down Tagging.",
            "Modeling contextual interactions for multiclass active learning."
        ],
        [
            "So before starting the talk, I'll give you an introduction about this talk is about.",
            "Um?",
            "We propose an active learning approach for scene understanding problems.",
            "In scene understanding, the goal is to identify all the different objects present in an image.",
            "And scene understanding is a much more difficult problem as compared to image classification problems, where each image consists of just a single object."
        ],
        [
            "There are two main contributions of our work.",
            "The first contribution is that we propose a new criterion for active selection of regions called image entropy.",
            "Here originally selected based on the information it provides about itself as well as the information it provides about other regions in the image."
        ],
        [
            "The second contribution is that we introduce new ways of collecting knowledge by proposing to new kinds of questions."
        ],
        [
            "The first kind of questions are called linguistic questions.",
            "Here, given an image, the system uses high confidence detections as anchors to ask questions about other regions in the image."
        ],
        [
            "For example, in this case, the robot recognizes the floor and it can use floor as an anchor to ask a question such as."
        ],
        [
            "What is on the floor?"
        ],
        [
            "The second kind of questions are contextual questions.",
            "In scene understanding tasks, learning the relationships between pairs of objects is very important.",
            "And.",
            "We propose contextual questions too explicitly as the user relationship questions."
        ],
        [
            "For example, instead of learning the relationship between a pair of objects from thousands of labeled images, we can instead ask the user questions such as what is the relationship between Sky and grass?"
        ],
        [
            "Before going into into the details, I'll give you a motivation of why active learning is required.",
            "For building a scene understanding system consisting of an objects, we need to learn order and appearance models and order and square relationship models.",
            "And change the number of object categories and is very large.",
            "This is a very challenging problem.",
            "And Furthermore, the objects occur in a heavy tail distribution, which means that there are a few object classes which occur very frequently, and the large majority of object classes occur very.",
            "Due to these reasons, randomly annotating training data is extremely inefficient and we need more efficient ways of annotating data."
        ],
        [
            "This brings us to active learning.",
            "The goal of active learning is to learn the best possible classifier while having to annotate the least amount of data.",
            "Given a pool of unlabeled samples, an active learner iteratively chooses sample."
        ],
        [
            "Vision annotation provide them."
        ],
        [
            "Some amount of information.",
            "Active learning has been done for binary classification problems."
        ],
        [
            "And it has also been extended to multiclass problems.",
            "However, in case of multiclass problems, it has been done for Celtic style images, where each image consists of just a single object.",
            "And such an active learning method learns only an appearance model."
        ],
        [
            "But since we are going to see an understanding, we need to actively learn an appearance model as well as a relationship model."
        ],
        [
            "I'll now describe our approach.",
            "Many active learning methods adopted uncertainty based approach.",
            "Here.",
            "The assumption is that the region that the classifier finds the most uncertain will provide the maximum information.",
            "And these methods typically select the region.",
            "The most uncertain region based on based on its appearance."
        ],
        [
            "We propose a new criterion called image entropy, where a region is selected for labeling based on based on the uncertainty in its appearance as well as the uncertainty in the contextual relationships of that region with other regions in the image."
        ],
        [
            "Let's see an example of how image entropy can be better than region entropy.",
            "Consider a system which has an appearance model of both water entry and it also knows that both occurs on water.",
            "And we are given an unlabeled image data set.",
            "No region entropy based method will simply select the most uncertain region in the image which in."
        ],
        [
            "This happens to be the vote on the left.",
            "On the other hand, an image entropy based method will select a different boat."
        ],
        [
            "Cause it can use the relationship information to infer that the region below the."
        ],
        [
            "Is water.",
            "And then you can further infer that other objects on water boats."
        ],
        [
            "And therefore from a single labeling question it can learn the appearance of multiple kinds of birds, and this speeds up the process of active learning."
        ],
        [
            "Or given any image segmented into multiple regions.",
            "It can be enabled by signing an object label to each region.",
            "We define the image entropy as the entropy over the probabilities of all possible labelings of the image.",
            "And since the number of labelings of the image is exponential, we use the 2nd order approximation of entropy."
        ],
        [
            "So this is our active learning framework or training data set is divided into a very large unlabeled set and a small initially label set.",
            "The initially label set is used to learn the preliminary classifier."
        ],
        [
            "Then at each round of active learning we generate sets of questions of all of many of multiple types, and among all these questions we select the best question.",
            "The user then answers the question and the model is updated and this process continues."
        ],
        [
            "We ask the user three kinds of questions.",
            "Region labeling questions, linguistic questions, and contextual questions, and at each stage of active learning from among possible questions of all these three types, we need to select, we need to select the question that will improve the model the most.",
            "I'll now describe each of these three questions in detail and how to select the best question from among them."
        ],
        [
            "The first kind of questions are region labeling questions and most current active learning methods.",
            "US region labeling questions."
        ],
        [
            "Here, given the current appearance model they use."
        ],
        [
            "Be shown an image and it has to label the highlighted region."
        ],
        [
            "In this case, the users answer will be bored and the region is then added to the training set of the corresponding class and the appearance model is updated."
        ],
        [
            "No, corresponding to each unlabeled region in the data set, one can ask a region labeling question and we need to we need to select the most.",
            "The best question from among them.",
            "So we first compute the initial entropy of the image and we compute the final expected entropy of the image given that the region is labeled.",
            "And the expected entropy reduction.",
            "You do originally being question is simply the initial entropy minus the final entropy, and this expected and open reduction represents the importance of originally being question."
        ],
        [
            "We next come to linguistic questions."
        ],
        [
            "Here, given the current appearance model and the contextual model, the user is shown in."
        ],
        [
            "Message is this.",
            "In this case, the system can recognize water with a very high confidence, and so it uses water as an anchor to acquire information about other objects in the scene."
        ],
        [
            "For example, it can ask a question such as what is above the water.",
            "The users response is simply a list of the object classes.",
            "The user does not have to explicitly label the regions in the image."
        ],
        [
            "In this case, the users response would be both entry.",
            "Based on our current model, we can."
        ],
        [
            "Assign these labels to regions in the image."
        ],
        [
            "These regions are then added to the training sets of the corresponding classes and the appearance model is updated.",
            "But apart from this we can also get contextual information by updating the probabilities of both being above water and tipping above water."
        ],
        [
            "There are lots of possible linguistic questions that the system can ask and we need to select the best, best one from among them.",
            "So given an image and any corresponding linguistic question, we first determine the region corresponding to the anchor object."
        ],
        [
            "Once the anchor region has been fixed, then based on the relationship."
        ],
        [
            "We can identify the other regions in the image which are relevant to this question.",
            "We then compute the expected entropy of the image over possible labelings of the relevant regions.",
            "Based on that we can compute the expected entropy reduction due to a linguistic question and this helps us select the most important linguistic question."
        ],
        [
            "So the third kind of questions are contextual questions and in scene understanding it's very important to learn relationships between pairs of objects and current contextual object recognition systems.",
            "Learn the relationships from Co occurrence statistics over thousands of labeled images.",
            "But instead of that we can simply ask the user relation relationship question."
        ],
        [
            "So given the current appearance model and contextual model, the."
        ],
        [
            "The user can be asked questions such as what is the relationship between vote and voter?"
        ],
        [
            "The users response will be that both occurs above water and water is bigger than both.",
            "This information is then used to update the contextual model by adding the relationship between both inverters."
        ],
        [
            "Corresponding to each pair of objects, this the system can ask contextual question and we compute the expected into production due to each of them.",
            "So given a relationship and a pair of objects, we compute the entropy over the data set by setting their relationship prior to high and low.",
            "Now, if there is a strong relationship between a pair of objects, such as between Sky and grass in these images, then correcting the relationship prior will constrain the labeling problem and result in a large reduction in the entropy, and we use this reduction in entropy as a measure of the importance of a contextual question."
        ],
        [
            "We now come to the experiments.",
            "We did experiments on them, SRC data set first using the ground truth segmentations as they help in isolating segmentation errors from active learning."
        ],
        [
            "Starting from the initial model, we plot the accuracy of different approaches after each round of active learning."
        ],
        [
            "We can see that the combined method, which consists of asking all three kinds of questions, is better than."
        ],
        [
            "Region labeling questions Lynn."
        ],
        [
            "Ristic questions.",
            "And contextual questions."
        ],
        [
            "And we can also see that the combined method initially asks contextual questions and this is an, which is why the two cups go inside.",
            "And this is because the relevant contextual questions reduce the system entropy alone and hence they are asked first.",
            "For example, if we get the correct relationship between between a pair of object classes such as Sky and grass, then then that will help correct labelings over the entire data set and that also results in our, you know, large, large increase in accuracy.",
            "Next, the system asks."
        ],
        [
            "Region labeling questions and they help in improving the appearance model of the system.",
            "Once the."
        ],
        [
            "This model improves.",
            "There are lots of high confidence regions which can be used as anchors for asking linguistic questions."
        ],
        [
            "We can also see that for region labeling questions are image entropy based criterion which uses which takes into account both the appearance and certainty as well as the contextual and certainty.",
            "While selecting regions outperforms region in Turkey, which is which simply considers the appearance and certainty."
        ],
        [
            "And here are some sample region labeling questions and we can see that our method which is based on image entropy ask for the label of the building and labeling.",
            "Once the building is labeled."
        ],
        [
            "It's easy to reason that the region above the building is Sky, and the region below the building is either ground or grass, and in this case labeling building provides additional information about the image.",
            "On the other hand.",
            "Original entropy based method ask for the label of the Sky and since most objects generally occur below the Sky, labeling Sky does not provide any additional information.",
            "He"
        ],
        [
            "It is another example in our case, when we label the face once the faces labeled, it's easy to reason that the region below the face is the body and there is additional information coming in from a single label.",
            "On the other hand, in the region entropy case, labeling the face does not provide any additional information."
        ],
        [
            "Here are some sample linguistic questions that were asked and we can see that the system uses high confidence detection such as ground and grass to US linguistic questions about other regions in the image.",
            "And we can also see the system has contextual questions about very relevant pairs of objects such as Cowan, Grass, Sky and Grass Boat in water, and so on."
        ],
        [
            "On the MSR C data set, we also did experiments using the automatic segmentations."
        ],
        [
            "And in this scenario 2 the combined method is better than each of the three kinds of questions and."
        ],
        [
            "Forage enabling questions again.",
            "Imagine Tropis better than region entropy."
        ],
        [
            "In this case, we can see that the rate of increase of performances is not very high and the reason is that due to the airport segmentations, many of the regions do not correspond to objects and hence there is an ambiguity in answering the region labeling questions."
        ],
        [
            "For the linguistic questions, we can see that the performance saturates earlier and this is becausw due to the poor segmentations.",
            "There are very few good anchor regions and they get exhausted very soon."
        ],
        [
            "We also did experiments on the Stanford data set and."
        ],
        [
            "Here again, we can see that the combined method, which consists of asking all three kinds of questions, is better than linguistic questions, region labeling questions and contextual questions."
        ],
        [
            "In this case, there are two interesting things to see.",
            "You do the small number of classes in this data set.",
            "The initial relationship priors are very good and hence asking contextual questions does not help much, and so contextual questions do not perform well.",
            "On the other hand."
        ],
        [
            "You do the high initial accuracy there are there are lots of high confidence good anchor regions, which is why the linguistic questions have a high learning rate."
        ],
        [
            "And finally, to summarize, we have proposed an active learning method for learning contextual object recognition systems which actively learns an appearance model for object categories as well as the relationship model between pairs of objects, activities and to do this, we propose a image entropy based criterion which selects region for for labeling based on the uncertainty in their appearance as well as the uncertainty in the contextual relationships between different regions in the image, and we also propose to new kinds of labeling questions, linguistic questions and contextual questions.",
            "Which help in providing contextual information and speed up the process of active learning."
        ],
        [
            "And thank you all for coming to this talk.",
            "And if you have any questions I'll try to answer.",
            "Missions.",
            "Yes.",
            "There are about there about 270 images in the data set in the SRC data set.",
            "They are spread over different images.",
            "Some images on which there are more questions and some images in which there are no questions at all.",
            "OK, let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Good morning, I'm magically from the University of Maryland and I'll talk about my paper titled Beyond Active Down Tagging.",
                    "label": 0
                },
                {
                    "sent": "Modeling contextual interactions for multiclass active learning.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So before starting the talk, I'll give you an introduction about this talk is about.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "We propose an active learning approach for scene understanding problems.",
                    "label": 1
                },
                {
                    "sent": "In scene understanding, the goal is to identify all the different objects present in an image.",
                    "label": 0
                },
                {
                    "sent": "And scene understanding is a much more difficult problem as compared to image classification problems, where each image consists of just a single object.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There are two main contributions of our work.",
                    "label": 0
                },
                {
                    "sent": "The first contribution is that we propose a new criterion for active selection of regions called image entropy.",
                    "label": 1
                },
                {
                    "sent": "Here originally selected based on the information it provides about itself as well as the information it provides about other regions in the image.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The second contribution is that we introduce new ways of collecting knowledge by proposing to new kinds of questions.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first kind of questions are called linguistic questions.",
                    "label": 0
                },
                {
                    "sent": "Here, given an image, the system uses high confidence detections as anchors to ask questions about other regions in the image.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, in this case, the robot recognizes the floor and it can use floor as an anchor to ask a question such as.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is on the floor?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The second kind of questions are contextual questions.",
                    "label": 1
                },
                {
                    "sent": "In scene understanding tasks, learning the relationships between pairs of objects is very important.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "We propose contextual questions too explicitly as the user relationship questions.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, instead of learning the relationship between a pair of objects from thousands of labeled images, we can instead ask the user questions such as what is the relationship between Sky and grass?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Before going into into the details, I'll give you a motivation of why active learning is required.",
                    "label": 0
                },
                {
                    "sent": "For building a scene understanding system consisting of an objects, we need to learn order and appearance models and order and square relationship models.",
                    "label": 1
                },
                {
                    "sent": "And change the number of object categories and is very large.",
                    "label": 0
                },
                {
                    "sent": "This is a very challenging problem.",
                    "label": 0
                },
                {
                    "sent": "And Furthermore, the objects occur in a heavy tail distribution, which means that there are a few object classes which occur very frequently, and the large majority of object classes occur very.",
                    "label": 1
                },
                {
                    "sent": "Due to these reasons, randomly annotating training data is extremely inefficient and we need more efficient ways of annotating data.",
                    "label": 1
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This brings us to active learning.",
                    "label": 1
                },
                {
                    "sent": "The goal of active learning is to learn the best possible classifier while having to annotate the least amount of data.",
                    "label": 0
                },
                {
                    "sent": "Given a pool of unlabeled samples, an active learner iteratively chooses sample.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Vision annotation provide them.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Some amount of information.",
                    "label": 0
                },
                {
                    "sent": "Active learning has been done for binary classification problems.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And it has also been extended to multiclass problems.",
                    "label": 0
                },
                {
                    "sent": "However, in case of multiclass problems, it has been done for Celtic style images, where each image consists of just a single object.",
                    "label": 0
                },
                {
                    "sent": "And such an active learning method learns only an appearance model.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But since we are going to see an understanding, we need to actively learn an appearance model as well as a relationship model.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'll now describe our approach.",
                    "label": 0
                },
                {
                    "sent": "Many active learning methods adopted uncertainty based approach.",
                    "label": 1
                },
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "The assumption is that the region that the classifier finds the most uncertain will provide the maximum information.",
                    "label": 0
                },
                {
                    "sent": "And these methods typically select the region.",
                    "label": 0
                },
                {
                    "sent": "The most uncertain region based on based on its appearance.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We propose a new criterion called image entropy, where a region is selected for labeling based on based on the uncertainty in its appearance as well as the uncertainty in the contextual relationships of that region with other regions in the image.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's see an example of how image entropy can be better than region entropy.",
                    "label": 1
                },
                {
                    "sent": "Consider a system which has an appearance model of both water entry and it also knows that both occurs on water.",
                    "label": 0
                },
                {
                    "sent": "And we are given an unlabeled image data set.",
                    "label": 0
                },
                {
                    "sent": "No region entropy based method will simply select the most uncertain region in the image which in.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This happens to be the vote on the left.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, an image entropy based method will select a different boat.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cause it can use the relationship information to infer that the region below the.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is water.",
                    "label": 0
                },
                {
                    "sent": "And then you can further infer that other objects on water boats.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And therefore from a single labeling question it can learn the appearance of multiple kinds of birds, and this speeds up the process of active learning.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or given any image segmented into multiple regions.",
                    "label": 0
                },
                {
                    "sent": "It can be enabled by signing an object label to each region.",
                    "label": 0
                },
                {
                    "sent": "We define the image entropy as the entropy over the probabilities of all possible labelings of the image.",
                    "label": 1
                },
                {
                    "sent": "And since the number of labelings of the image is exponential, we use the 2nd order approximation of entropy.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is our active learning framework or training data set is divided into a very large unlabeled set and a small initially label set.",
                    "label": 0
                },
                {
                    "sent": "The initially label set is used to learn the preliminary classifier.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then at each round of active learning we generate sets of questions of all of many of multiple types, and among all these questions we select the best question.",
                    "label": 0
                },
                {
                    "sent": "The user then answers the question and the model is updated and this process continues.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We ask the user three kinds of questions.",
                    "label": 0
                },
                {
                    "sent": "Region labeling questions, linguistic questions, and contextual questions, and at each stage of active learning from among possible questions of all these three types, we need to select, we need to select the question that will improve the model the most.",
                    "label": 1
                },
                {
                    "sent": "I'll now describe each of these three questions in detail and how to select the best question from among them.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The first kind of questions are region labeling questions and most current active learning methods.",
                    "label": 0
                },
                {
                    "sent": "US region labeling questions.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here, given the current appearance model they use.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Be shown an image and it has to label the highlighted region.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case, the users answer will be bored and the region is then added to the training set of the corresponding class and the appearance model is updated.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No, corresponding to each unlabeled region in the data set, one can ask a region labeling question and we need to we need to select the most.",
                    "label": 1
                },
                {
                    "sent": "The best question from among them.",
                    "label": 0
                },
                {
                    "sent": "So we first compute the initial entropy of the image and we compute the final expected entropy of the image given that the region is labeled.",
                    "label": 1
                },
                {
                    "sent": "And the expected entropy reduction.",
                    "label": 0
                },
                {
                    "sent": "You do originally being question is simply the initial entropy minus the final entropy, and this expected and open reduction represents the importance of originally being question.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We next come to linguistic questions.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here, given the current appearance model and the contextual model, the user is shown in.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Message is this.",
                    "label": 0
                },
                {
                    "sent": "In this case, the system can recognize water with a very high confidence, and so it uses water as an anchor to acquire information about other objects in the scene.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For example, it can ask a question such as what is above the water.",
                    "label": 1
                },
                {
                    "sent": "The users response is simply a list of the object classes.",
                    "label": 0
                },
                {
                    "sent": "The user does not have to explicitly label the regions in the image.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case, the users response would be both entry.",
                    "label": 0
                },
                {
                    "sent": "Based on our current model, we can.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assign these labels to regions in the image.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These regions are then added to the training sets of the corresponding classes and the appearance model is updated.",
                    "label": 0
                },
                {
                    "sent": "But apart from this we can also get contextual information by updating the probabilities of both being above water and tipping above water.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are lots of possible linguistic questions that the system can ask and we need to select the best, best one from among them.",
                    "label": 0
                },
                {
                    "sent": "So given an image and any corresponding linguistic question, we first determine the region corresponding to the anchor object.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Once the anchor region has been fixed, then based on the relationship.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We can identify the other regions in the image which are relevant to this question.",
                    "label": 0
                },
                {
                    "sent": "We then compute the expected entropy of the image over possible labelings of the relevant regions.",
                    "label": 1
                },
                {
                    "sent": "Based on that we can compute the expected entropy reduction due to a linguistic question and this helps us select the most important linguistic question.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the third kind of questions are contextual questions and in scene understanding it's very important to learn relationships between pairs of objects and current contextual object recognition systems.",
                    "label": 1
                },
                {
                    "sent": "Learn the relationships from Co occurrence statistics over thousands of labeled images.",
                    "label": 0
                },
                {
                    "sent": "But instead of that we can simply ask the user relation relationship question.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So given the current appearance model and contextual model, the.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The user can be asked questions such as what is the relationship between vote and voter?",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The users response will be that both occurs above water and water is bigger than both.",
                    "label": 0
                },
                {
                    "sent": "This information is then used to update the contextual model by adding the relationship between both inverters.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Corresponding to each pair of objects, this the system can ask contextual question and we compute the expected into production due to each of them.",
                    "label": 0
                },
                {
                    "sent": "So given a relationship and a pair of objects, we compute the entropy over the data set by setting their relationship prior to high and low.",
                    "label": 0
                },
                {
                    "sent": "Now, if there is a strong relationship between a pair of objects, such as between Sky and grass in these images, then correcting the relationship prior will constrain the labeling problem and result in a large reduction in the entropy, and we use this reduction in entropy as a measure of the importance of a contextual question.",
                    "label": 1
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We now come to the experiments.",
                    "label": 0
                },
                {
                    "sent": "We did experiments on them, SRC data set first using the ground truth segmentations as they help in isolating segmentation errors from active learning.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Starting from the initial model, we plot the accuracy of different approaches after each round of active learning.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can see that the combined method, which consists of asking all three kinds of questions, is better than.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Region labeling questions Lynn.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Ristic questions.",
                    "label": 0
                },
                {
                    "sent": "And contextual questions.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can also see that the combined method initially asks contextual questions and this is an, which is why the two cups go inside.",
                    "label": 0
                },
                {
                    "sent": "And this is because the relevant contextual questions reduce the system entropy alone and hence they are asked first.",
                    "label": 0
                },
                {
                    "sent": "For example, if we get the correct relationship between between a pair of object classes such as Sky and grass, then then that will help correct labelings over the entire data set and that also results in our, you know, large, large increase in accuracy.",
                    "label": 0
                },
                {
                    "sent": "Next, the system asks.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Region labeling questions and they help in improving the appearance model of the system.",
                    "label": 0
                },
                {
                    "sent": "Once the.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This model improves.",
                    "label": 0
                },
                {
                    "sent": "There are lots of high confidence regions which can be used as anchors for asking linguistic questions.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We can also see that for region labeling questions are image entropy based criterion which uses which takes into account both the appearance and certainty as well as the contextual and certainty.",
                    "label": 0
                },
                {
                    "sent": "While selecting regions outperforms region in Turkey, which is which simply considers the appearance and certainty.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here are some sample region labeling questions and we can see that our method which is based on image entropy ask for the label of the building and labeling.",
                    "label": 0
                },
                {
                    "sent": "Once the building is labeled.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's easy to reason that the region above the building is Sky, and the region below the building is either ground or grass, and in this case labeling building provides additional information about the image.",
                    "label": 0
                },
                {
                    "sent": "On the other hand.",
                    "label": 0
                },
                {
                    "sent": "Original entropy based method ask for the label of the Sky and since most objects generally occur below the Sky, labeling Sky does not provide any additional information.",
                    "label": 0
                },
                {
                    "sent": "He",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is another example in our case, when we label the face once the faces labeled, it's easy to reason that the region below the face is the body and there is additional information coming in from a single label.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, in the region entropy case, labeling the face does not provide any additional information.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here are some sample linguistic questions that were asked and we can see that the system uses high confidence detection such as ground and grass to US linguistic questions about other regions in the image.",
                    "label": 0
                },
                {
                    "sent": "And we can also see the system has contextual questions about very relevant pairs of objects such as Cowan, Grass, Sky and Grass Boat in water, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On the MSR C data set, we also did experiments using the automatic segmentations.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in this scenario 2 the combined method is better than each of the three kinds of questions and.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Forage enabling questions again.",
                    "label": 0
                },
                {
                    "sent": "Imagine Tropis better than region entropy.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case, we can see that the rate of increase of performances is not very high and the reason is that due to the airport segmentations, many of the regions do not correspond to objects and hence there is an ambiguity in answering the region labeling questions.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the linguistic questions, we can see that the performance saturates earlier and this is becausw due to the poor segmentations.",
                    "label": 0
                },
                {
                    "sent": "There are very few good anchor regions and they get exhausted very soon.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also did experiments on the Stanford data set and.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here again, we can see that the combined method, which consists of asking all three kinds of questions, is better than linguistic questions, region labeling questions and contextual questions.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this case, there are two interesting things to see.",
                    "label": 0
                },
                {
                    "sent": "You do the small number of classes in this data set.",
                    "label": 0
                },
                {
                    "sent": "The initial relationship priors are very good and hence asking contextual questions does not help much, and so contextual questions do not perform well.",
                    "label": 0
                },
                {
                    "sent": "On the other hand.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You do the high initial accuracy there are there are lots of high confidence good anchor regions, which is why the linguistic questions have a high learning rate.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, to summarize, we have proposed an active learning method for learning contextual object recognition systems which actively learns an appearance model for object categories as well as the relationship model between pairs of objects, activities and to do this, we propose a image entropy based criterion which selects region for for labeling based on the uncertainty in their appearance as well as the uncertainty in the contextual relationships between different regions in the image, and we also propose to new kinds of labeling questions, linguistic questions and contextual questions.",
                    "label": 0
                },
                {
                    "sent": "Which help in providing contextual information and speed up the process of active learning.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And thank you all for coming to this talk.",
                    "label": 0
                },
                {
                    "sent": "And if you have any questions I'll try to answer.",
                    "label": 0
                },
                {
                    "sent": "Missions.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "There are about there about 270 images in the data set in the SRC data set.",
                    "label": 0
                },
                {
                    "sent": "They are spread over different images.",
                    "label": 0
                },
                {
                    "sent": "Some images on which there are more questions and some images in which there are no questions at all.",
                    "label": 0
                },
                {
                    "sent": "OK, let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}