{
    "id": "t47pzr6fzmzbetaogsnvowptjiqn7xby",
    "title": "Deducing Local Influence Neighbourhoods With Application to Edge-Preserving Image Denoising",
    "info": {
        "author": [
            "Ashish Raj, University of California, San Francisco"
        ],
        "published": "July 9, 2007",
        "recorded": "June 2007",
        "category": [
            "Top->Computer Science->Image Analysis"
        ]
    },
    "url": "http://videolectures.net/gbr07_raj_dlin/",
    "segmentation": [
        [
            "OK, good morning everyone.",
            "I'm Ashish Raj and today's lecture is going to be do some local influence neighborhoods in images using graph cuts.",
            "Joint work with Carl Jung at UCSF and Kalash Tucker in Wellington, New Zealand."
        ],
        [
            "For no particular reason, I thought I'd start with this.",
            "This is not the view from our lab, but it's close.",
            "We get a really nice view of the bridge."
        ],
        [
            "So to as an overview, are we proposing a new image image structure that I call local influence neighborhoods?",
            "This is not entirely new, but I'll talk about that in a minute and I'm proposing these basically as locally adaptive neighborhoods around every voxel in an image.",
            "And and that's why they're not new, because something like this has appeared before, and it's been called super pixels, which is usually obtained from an over segmentation of an image.",
            "But the idea here is slightly different.",
            "Because first we use a very principle cost minimization approach to obtain these neighborhoods, but also because.",
            "We do want for every voxel in the image.",
            "Each voxel is has associated with it a linear.",
            "A local influence neighborhood that I call Lynn.",
            "And it could be used as a feature vector for each voxel.",
            "And the main point of these neighborhood structures is that they allow you to probe the intermediate structure of local features at various scales.",
            "We initially developed this to address image processing tasks like denoising and interpolation.",
            "However, as local image features, they have much wide."
        ],
        [
            "Applicability.",
            "Just to give a conceptual understanding of what I'm talking about of shown here, a going from a low level to higher level description of images.",
            "The low level description would be completely pixel based.",
            "Hard to show it here Anna.",
            "The problem with the approach.",
            "A low level pixel based approach is that first of all, it's cumbersome.",
            "It's computationally expensive to do a lot of things on pixel based techniques, and really it's not very well suited for a large number of pattern recognition tasks.",
            "And we saw examples of this all day yesterday where you really want to go to a high level description.",
            "For instance region level description.",
            "Which are excellent for graph theoretic and pattern recognition tasks, but they're kind of prone to error propagation.",
            "You need to make sure that the regions are all the features are determined correctly to begin with, and if you made a mistake there, then every subsequent all that fancy graph theoretic work will really not amount to much.",
            "So I want to ask this question of everyone whether there might be some kind of intermediate structure which can act as an intermediary between between low and high level imaging image.",
            "Features and the one possibility that are proposed here today is a neighborhood level.",
            "Features where I've shown in black regions the neighborhoods possible neighborhoods around some voxels I've chosen in their image.",
            "And then there is.",
            "This talk is going to describe how to obtain these neighborhoods and what to do with them."
        ],
        [
            "So the outline of this talk is going to be as follows.",
            "I will start with an introduction to these local influence neighborhoods.",
            "I will then describe how to compute these neighborhoods using graph cut energy minimization.",
            "I'll give some examples of lens in image filtering and denoising and also briefly talk about other possible applications including segmentation, estimation of fractal dimension and as features for tracking and registration.",
            "I don't have results for these other applications, but.",
            "We can, I'll briefly describe what I mean by."
        ],
        [
            "How we can use these things?",
            "Alright, So what are these influence neighborhoods are local neighborhood.",
            "It is a local neighborhood around a voxel X not Y node.",
            "It's defined basically as a set of voxels, which are in some way close to this voxel.",
            "And you can define closeness in geometric space and also in intensity space.",
            "The first attempt to do this would be to use what is known as a space intensity box and this kind of work has has occurred at many points in last 20 years and all follows basically the same formalism where you define a box around X, not Y node with which includes all neighboring voxels within a distance.",
            "Delta geometric, Euclidean distance, Delta and an intensity difference epsilon.",
            "From that voxel.",
            "The trouble with this kind of approach is that what one means by epsilon.",
            "Delta is kind of arbitrary, and it needs to really reflect the local statistics, which is not really being captured in this kind of formalism.",
            "But more disturbingly, produces disjoint non contiguous holy and noisy neighborhoods.",
            "And I'll show an example of that in a second.",
            "The main point is that we define neighborhoods.",
            "We need some some way to capture expectations about continuity and smoothness of these neighborhoods and.",
            "We have developed a principle probabilistic approach using likelihood and prior distributions.",
            "To do this, I'm not.",
            "I'll try not to go into the Bayesian formalism too much, except that as we all know we can reduce it to an energy minimization problem."
        ],
        [
            "Basically focus on that.",
            "To give an example of what I mean by prior likelihoods, suppose you have you receive a noisy facts.",
            "Where some of the black and white image where some of the bits were flipped.",
            "And.",
            "You want to recover the original, which perhaps look like this."
        ],
        [
            "How would you do it?",
            "Well probably most of us will come up with two types of constraints to apply to this problem.",
            "First of all, you say that the likelihood of a pixel being either black or white is.",
            "You know, given from the observed data.",
            "The second constraint is that black and white pixels tend to tend to be grouped together.",
            "So according to these constraints, this here is a good labeling because it satisfies both these constraints.",
            "This is a bad labeling because it satisfies the second smoothness constraint, but it does not satisfy the likelihood.",
            "And this one is a bad labeling because it satisfies the likelihood.",
            "It's probably close to the original, but it really doesn't display much spatial smoothness, so we're trying to come up with solutions which satisfy both the likelihood as well as what I'll refer to these smoothness assumptions as the prior."
        ],
        [
            "In a general way.",
            "To come back, come back to this local influence neighborhoods.",
            "An example of that on a very noisy image, like the kind of shown here.",
            "If you were to just do the box filter I showed earlier on two different places.",
            "So P&Q, you might obtain something like that, and it's as you can see, it's noisy.",
            "It's got holes and it doesn't really satisfy any special contiguous kniss constraints.",
            "What we really want to do is something like this and this is the kind of results that we wish to obtain.",
            "The other ways of doing this, for instance by spatially by varying the radius of the circle around each voxel."
        ],
        [
            "According to the local structure and you can get something like that.",
            "But as you can see it's not quite ideal."
        ],
        [
            "No.",
            "Alright, so a better neighborhood criterion to enable us to do this is something that incorporates both geometric closeness as well as continuity and smoothness assumptions.",
            "What we do is we set this up as a minimization problem, solve it using everyone's favorite minimization algorithm.",
            "Simulator nearly no.",
            "I was actually just kidding.",
            "You really want to use something better than that, and we use graph cuts.",
            "So what are these constraints?",
            "Let me go through them one after the other.",
            "First of all, closeness.",
            "We assume that neighborhoods around each voxel follow somewhat Gaussian shapes.",
            "And you can try and express that as a probability density function with a Gaussian with two terms.",
            "The first term row denotes geometric closeness and the second term denotes intensity, closeness and this basically replicates the box that you saw earlier.",
            "The cut is the Cartesian distance row.",
            "In fact, we use is.",
            "We kind of model.",
            "We kind of change it according to the local intensity gradients as well.",
            "And the intensity distance is simply."
        ],
        [
            "A linear distance.",
            "So this is the kind of geometric contours I'm talking about for row.",
            "As you can see we have introduced some dependence on the local gradient.",
            "Now that's that's well and good, but this kind of simple geometric.",
            "Approach will not capture the actual neighborhood over Voxel very accurately.",
            "What you."
        ],
        [
            "Really want to do on top of that is to introduce these other constraints.",
            "And we encode this penalty terms between all neighboring voxel pairs.",
            "And the best way that we all know to do these is by formally writing this as a macro random feel, part of which is shown here an between any two pixels or voxels.",
            "There exists a potential function, which is some kind of a distance metric.",
            "In our case, almost always we use the pots function, which assigns a constant cost for any adjacent pixel pair, which are different labels.",
            "So.",
            "What we do is we do for each voxel P we define a binary field FP such that zero label zero in that field means it is in that neighborhood and one means sorry it's not in the neighborhood and one means it is in the neighborhood.",
            "As shown here.",
            "And then we can just set up this problem up as a energy minimization problem, which consists of two terms set of terms.",
            "The first set of terms imposes geometric closeness, geometric and intensity closeness.",
            "And this is.",
            "The the size here are taken from the formula in the earlier slide.",
            "And the other set of terms consists of enforces continuity and smoothness, and the way we do that is via these.",
            "Parts functions as shown in that box there, and these parts functions are typically multiplied, weighted by an intensity difference, as shown here.",
            "What this formulation does is.",
            "It basically tries to find a neighborhood which satisfies the closeness constraint as well as the continuity constraints.",
            "There's of course a Bayesian interpretation of this as the log prior of some kind of probability distribution over the lens, but we don't need to go into the."
        ],
        [
            "At this point I just wanted to point out though, that just to reiterate Amalka random field prior imposes spatial coherence, and they've been used in many vision applications very successfully.",
            "And the metric that we use in this work is the parts function.",
            "As you can see, the function is extremely discontinuous non convex and these are known to be really good.",
            "But they also known to be very hard to minimize because of this reason and we need to come up with a smart minimization."
        ],
        [
            "Technique to do this?",
            "So the bottom line is that maximizing Lynn priors corresponds to the minimalization of an energy function consisting of two terms, one that imposes closeness in German geometric space, an intensity space in the other, that imposes smoothness, and Marco Random field prize encode.",
            "These general spatial coherence properties, and this energy function can be minimized using any minimization algorithm you can think of.",
            "However, we think that most of them wouldn't work on sort of challenging.",
            "Cost function, so we use graph cuts."
        ],
        [
            "So let me briefly talk about."
        ],
        [
            "I've cut energy minimization.",
            "Graph cuts are proven to be very popular and powerful for minimization of energy functions, more or less like this one, they were first developed for stereo matching, where most of the top performing algorithms for stereo rely nowadays on graficas or I think, now, belief propagation is also catching up.",
            "What happens is that you build a graph where nodes that are that corresponds to pixels in your image and whose edges have weights obtained from the energy terms in the.",
            "AV of X as shown earlier and you also use two special nodes called terminal nodes and the minimization of the energy.",
            "On this graph is reduced to finding the minimum."
        ],
        [
            "I'm cut of this crap.",
            "Briefly describing the minimum cut problem, as is well known, it can be solved by through the Maxflow algorithm, which simply says.",
            "So here's here's a possible.",
            "Graph for that for a neighborhood system, these are the pixel nodes, and these are special nodes, source and sink, and you're trying to find the cheapest way to cut the edges so that the source is separated from the sink and cut edges going from source side to the sink, side and edge weights are assigned so that they represent the cost of cutting these these edges.",
            "So this is a possible cut.",
            "It may not be the min cut.",
            "But the the task of finding a min cut is known to be polynomial order polynomial time and can be solved very efficiently with the Max flow algorithm, although it's theoretically polynomial time practically, it's almost linear in the number of."
        ],
        [
            "Notes.",
            "So here's the graph construction for our problem for any pixel.",
            "P in the image you first define a bounding box WP around it.",
            "Construct a graph based for each of them an you assign and then introduce the two special nodes source and sink, and then you assign the edges according to some formula.",
            "You assign links corresponding to terms in energy functions.",
            "There are two types of links.",
            "T links going from the terminals to the nodes to the to the pixel nodes and end links going between neighbors in the pixel nodes.",
            "So what happens is that the single pixel terms in your energy function easily represent are going to be represented by these feelings, and double pixel pairs pixel appear terms are represented by end links.",
            "You then construct the graph and then do a min cut on it an the assignment of which pixel belongs to the neighborhood which doesn't is very simple.",
            "After the min cut you just give it, give it the assignment as shown in the picture there therefore.",
            "A minimum cut is equivalent to binary segmentation on this small graph."
        ],
        [
            "These are the edge costs which we assign on the induced graph, and these assignment guarantees that the cost of the min cut is the same as the minimum cost of the energy function."
        ],
        [
            "Alright, so this is the algorithm you form a graph with as shown earlier.",
            "Do a min cut on this graph using the edge assignments and table in the last slide and then finally define the mapping.",
            "Of the neighborhood system of the neighborhood around Pixel P, just as shown here, things that belong to the cut."
        ],
        [
            "So sorry, things that are connected after the."
        ],
        [
            "Things that are connected to this sourceid.",
            "Get assigned.",
            "One and things that are connected to the sink side get assigned zero and that gives you the local influenced neighborhood around that pixel, which I'm going to call B sub P."
        ],
        [
            "Can you repeat this graph min cut for each voxel in the image?",
            "You really don't have to repeat everything from scratch because it can use reuse edges in the graph, so it's."
        ],
        [
            "More eficient than it appears.",
            "Some examples of detected lens showing.",
            "One example on the linear image you can see how the neighborhood adapt itself to the local structure."
        ],
        [
            "Some of the most popular lens I've run this on many images.",
            "As you can see there are no surprises here.",
            "Things are just symmetric or elongated or diagonal end up being the most popular.",
            "You can do a lot of things with these."
        ],
        [
            "Neighbors structures you can do filtering where the extent of the filtering is bounded by influence neighborhood.",
            "Convolutional filters could be implemented like this where you only sum up.",
            "Things that belong in that neighborhood and not go past this is a good way of doing edge preserving filtering.",
            "It's a big problem in image processing because filtering tends to smooth things and this is one way of making sure that things don't get over smooth.",
            "You can also do rank order filters and this is a very interesting bit of experimentation.",
            "I did where you can define the percentile rank not on a uniform neighborhood around a voxel but but using just the.",
            "Local influence neighborhood for the percentile rank."
        ],
        [
            "For instance, you can do maximum filters using this and let me show you some exam.",
            "This is a part of the lighthouse image Original and if you did a maximum filter with a three by three window you get something that looks like that.",
            "Now, if you do the same thing but this time restrict the maximum filter effect, the domain of the maximum filter to the local influence neighborhood around each voxel.",
            "What's your pain?",
            "Is this?",
            "It's?",
            "I really don't know how to interpret this, but it seems like it's very different from the."
        ],
        [
            "Normal maximum filter.",
            "More interesting is the median filter.",
            "The same thing again, and this is a median filter using standard median filter and this is the median filter using lens you can see the main effect I wanted to point out is that this has a much higher edge preserving property.",
            "I'm hoping you can see that from the back there.",
            "So."
        ],
        [
            "That's one of the users of these.",
            "Neighbor structures but.",
            "To do it, we also tried to do image denoising using this approach and we came up with an expectation maximization style algorithm for this, whoops.",
            "Yeah, ignore that second line for a minute.",
            "Suppose you have a noise model which where the observed image is simply the actual image I plus some noise.",
            "And suppose we introduce an image prior where given the F denotes the set of all influence neighborhoods.",
            "So, given knowledge of all the influence neighborhoods or across the whole image, we can introduce an image prior which is basically.",
            "A kind of a convolutional lowpass prior, but the difference this time is that.",
            "You only you restrict the lowpass operation to the for each voxel.",
            "Two it's Lynn.",
            "And that way you can make sure that this image prior is not going to give you blurry images, which is generally the case.",
            "So, and the likelihood for this particular noise model with assuming IID Gaussian noise is simply.",
            "The Gaussian shown here and the denoising problem is therefore to maximize the post."
        ],
        [
            "Area.",
            "I think you'll know what the what, that where that comes from is just it comes from Bayes theorem, so I'll just skip this."
        ],
        [
            "The trouble is that the joint maximization of that posterior is extremely hard, and therefore we propose an OEM style approach whereby we start with an initial estimate of the image which is actually just the same as the noisy image and then iterate.",
            "Through 2 alternative steps for the first step, you try to find the best local inference neighborhoods given the old.",
            "The earlier estimate of the image, and this step is performed using graph cuts as described earlier.",
            "But for the second step.",
            "You then given knowledge of the influence neighborhoods.",
            "You then maximize the probability of I given the influence neighborhoods.",
            "And that's a posterior.",
            "And you maximize that until some criterion convergence criterion is met in the.",
            "A paper and in the in the book you have, we show how it's very easy to prove that for the second step you can reduce this argmax to very simple linear combination, shown there, which by the way also involves these Lynn restricted filtering operations."
        ],
        [
            "So some results.",
            "Again on Lena this is noisy Lena image.",
            "This was denoised, using a Gaussian filtering kernel.",
            "And this was done was using our Lynn restricted filters.",
            "The EM algorithm for it.",
            "So the differences are that it mostly preserves local structures and also preserves all the dominant edges."
        ],
        [
            "Another example on the biker image.",
            "This is noisy biker image.",
            "This was done by.",
            "This is denoised by a gas in kernel this is denoised by an alternative technique I tried where they set the the support of the filter varies according to the local structure and it doesn't find job.",
            "It preserves some dominant edges but it smells out a lot of the texture and if you compare that with what we obtain.",
            "This seems to be."
        ],
        [
            "You have some amount of improvement.",
            "I did this for a number of images and here are the results.",
            "In most cases I obtain a.",
            "Both are better.",
            "Signal to noise ratio as well as peak SNR."
        ],
        [
            "So let me now briefly talk about some other applications of these neighborhoods, which are, after all, intermediate structures.",
            "And therefore they can be used to probe the scale space of image data by varying the scale parameters of.",
            "I'm not sure if I've defined this before.",
            "These two Sigma X and Sigma N are basically the geometric Euclidean distance factor and the intensity difference, distance factor and by changing these you can model.",
            "Change the effect of your neighborhoods and these can be used to probe very interesting fractal properties of of images, including brain images, which is what I'm primarily interested in this point.",
            "You can also do a segment hierarchical segmentation, which is similar to the superpixel concept and can talk about that.",
            "You can also use these inference neighborhoods as feature vectors for image, image, registration, object recognition."
        ],
        [
            "And and tracking.",
            "Just to briefly describe what I mean by this, you begin with links at a fine scale and hierarchically fuse finer links to obtain coarser lens and obtain a segmentation, kind of like what the previous speaker was describing.",
            "For instance, you could start with a finer neighbor structure and."
        ],
        [
            "Go up to something closer.",
            "I don't have very much time, but this is a very interesting project we've just embarked upon, where by changing the scales associated with the intensity and geometry we can.",
            "Prove the factor dimension of multi dimension."
        ],
        [
            "Which is like the brain.",
            "And I'll show you what I mean for each voxel, and for each value of these parameters, you just count the number of voxels included in its neighborhood.",
            "Say I'm showing a zoomed AB portion of a brain image.",
            "And suppose you had a voxel there and you started by.",
            "A very small Sigma X and try to increase it.",
            "What would be the effect on its local neighborhood?",
            "Very small Lambda, so Sigma X will give you something like this.",
            "Slightly bigger will give you that.",
            "That that so you can see it's a linear structure there locally, so it's going to grow linearly, so.",
            "It will continue to grow linearly until a point where it gets out of that local structure, and then it starts to grow, you know.",
            "In two dimensions.",
            "And maybe in some more complicated ways as shown here.",
            "And finally, if you increase the factor large enough, it basically gets you one of those Gaussians.",
            "If I plotted the number of pixels in the neighborhood, I'll probably see something like this.",
            "Where there appears that there will be some phase transitions given by this critical .1 critical .2.",
            "Also, the slope of each segment is basically the local fractal dimension, so between the slopes and the critical points, these quantities are very important to determine the fractal dimension or complexity of fractal structures, and we intend to use these things for detecting disease states in brain image."
        ],
        [
            "So.",
            "Basically, the advantage of current FD measurements is that you get a link and FD for each voxel, whereas current techniques give you a fractal dimension for the whole thing at the same time we can capture the FDF local as well as global regions.",
            "In this idea, for direction structures and oriented features is far less susceptible to noise.",
            "Because we explicitly modeled insensitive scale, which can be news to the tune to the noise level."
        ],
        [
            "It enables the probing of phase transition and.",
            "Put some possible applications include.",
            "Possible that the fractal dimension measurements using this technique can give better discriminators of neurodegeneration.",
            "For instance, Alzheimer's disease, frontotemporal dementia, mild commuter disorder, normal aging, and so on.",
            "So we propose to use the mean FD.",
            "This is going into fractal theory, so I'm not going to go into too much detail, except to note that the quantities I described in the previous slide are the ones which are very relevant to detect disease states.",
            "Alright, now I'm skipping through these.",
            "The take home messages as these quantities may be very efficiently probed by this graph.",
            "Cut based local influence neighborhood structures.",
            "And they may consequently provide greater just discriminability between normal."
        ],
        [
            "A DfT D and so on.",
            "So to summarize, we propose a general method for estimating local influence neighborhoods which are based on an optimal energy minimization approach, and these links are intermediaries between purely pixel based an region based methods and some applications include denoising, filtering, recognition, fractal, dimension estimation, an so on, and in other words the best thing since sliced bread."
        ],
        [
            "Thank."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, good morning everyone.",
                    "label": 0
                },
                {
                    "sent": "I'm Ashish Raj and today's lecture is going to be do some local influence neighborhoods in images using graph cuts.",
                    "label": 1
                },
                {
                    "sent": "Joint work with Carl Jung at UCSF and Kalash Tucker in Wellington, New Zealand.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For no particular reason, I thought I'd start with this.",
                    "label": 0
                },
                {
                    "sent": "This is not the view from our lab, but it's close.",
                    "label": 0
                },
                {
                    "sent": "We get a really nice view of the bridge.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to as an overview, are we proposing a new image image structure that I call local influence neighborhoods?",
                    "label": 1
                },
                {
                    "sent": "This is not entirely new, but I'll talk about that in a minute and I'm proposing these basically as locally adaptive neighborhoods around every voxel in an image.",
                    "label": 0
                },
                {
                    "sent": "And and that's why they're not new, because something like this has appeared before, and it's been called super pixels, which is usually obtained from an over segmentation of an image.",
                    "label": 0
                },
                {
                    "sent": "But the idea here is slightly different.",
                    "label": 0
                },
                {
                    "sent": "Because first we use a very principle cost minimization approach to obtain these neighborhoods, but also because.",
                    "label": 1
                },
                {
                    "sent": "We do want for every voxel in the image.",
                    "label": 0
                },
                {
                    "sent": "Each voxel is has associated with it a linear.",
                    "label": 0
                },
                {
                    "sent": "A local influence neighborhood that I call Lynn.",
                    "label": 0
                },
                {
                    "sent": "And it could be used as a feature vector for each voxel.",
                    "label": 0
                },
                {
                    "sent": "And the main point of these neighborhood structures is that they allow you to probe the intermediate structure of local features at various scales.",
                    "label": 1
                },
                {
                    "sent": "We initially developed this to address image processing tasks like denoising and interpolation.",
                    "label": 0
                },
                {
                    "sent": "However, as local image features, they have much wide.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Applicability.",
                    "label": 0
                },
                {
                    "sent": "Just to give a conceptual understanding of what I'm talking about of shown here, a going from a low level to higher level description of images.",
                    "label": 0
                },
                {
                    "sent": "The low level description would be completely pixel based.",
                    "label": 0
                },
                {
                    "sent": "Hard to show it here Anna.",
                    "label": 0
                },
                {
                    "sent": "The problem with the approach.",
                    "label": 0
                },
                {
                    "sent": "A low level pixel based approach is that first of all, it's cumbersome.",
                    "label": 0
                },
                {
                    "sent": "It's computationally expensive to do a lot of things on pixel based techniques, and really it's not very well suited for a large number of pattern recognition tasks.",
                    "label": 0
                },
                {
                    "sent": "And we saw examples of this all day yesterday where you really want to go to a high level description.",
                    "label": 0
                },
                {
                    "sent": "For instance region level description.",
                    "label": 0
                },
                {
                    "sent": "Which are excellent for graph theoretic and pattern recognition tasks, but they're kind of prone to error propagation.",
                    "label": 1
                },
                {
                    "sent": "You need to make sure that the regions are all the features are determined correctly to begin with, and if you made a mistake there, then every subsequent all that fancy graph theoretic work will really not amount to much.",
                    "label": 0
                },
                {
                    "sent": "So I want to ask this question of everyone whether there might be some kind of intermediate structure which can act as an intermediary between between low and high level imaging image.",
                    "label": 0
                },
                {
                    "sent": "Features and the one possibility that are proposed here today is a neighborhood level.",
                    "label": 0
                },
                {
                    "sent": "Features where I've shown in black regions the neighborhoods possible neighborhoods around some voxels I've chosen in their image.",
                    "label": 0
                },
                {
                    "sent": "And then there is.",
                    "label": 0
                },
                {
                    "sent": "This talk is going to describe how to obtain these neighborhoods and what to do with them.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the outline of this talk is going to be as follows.",
                    "label": 0
                },
                {
                    "sent": "I will start with an introduction to these local influence neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "I will then describe how to compute these neighborhoods using graph cut energy minimization.",
                    "label": 1
                },
                {
                    "sent": "I'll give some examples of lens in image filtering and denoising and also briefly talk about other possible applications including segmentation, estimation of fractal dimension and as features for tracking and registration.",
                    "label": 1
                },
                {
                    "sent": "I don't have results for these other applications, but.",
                    "label": 0
                },
                {
                    "sent": "We can, I'll briefly describe what I mean by.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How we can use these things?",
                    "label": 0
                },
                {
                    "sent": "Alright, So what are these influence neighborhoods are local neighborhood.",
                    "label": 0
                },
                {
                    "sent": "It is a local neighborhood around a voxel X not Y node.",
                    "label": 1
                },
                {
                    "sent": "It's defined basically as a set of voxels, which are in some way close to this voxel.",
                    "label": 0
                },
                {
                    "sent": "And you can define closeness in geometric space and also in intensity space.",
                    "label": 1
                },
                {
                    "sent": "The first attempt to do this would be to use what is known as a space intensity box and this kind of work has has occurred at many points in last 20 years and all follows basically the same formalism where you define a box around X, not Y node with which includes all neighboring voxels within a distance.",
                    "label": 0
                },
                {
                    "sent": "Delta geometric, Euclidean distance, Delta and an intensity difference epsilon.",
                    "label": 0
                },
                {
                    "sent": "From that voxel.",
                    "label": 0
                },
                {
                    "sent": "The trouble with this kind of approach is that what one means by epsilon.",
                    "label": 0
                },
                {
                    "sent": "Delta is kind of arbitrary, and it needs to really reflect the local statistics, which is not really being captured in this kind of formalism.",
                    "label": 0
                },
                {
                    "sent": "But more disturbingly, produces disjoint non contiguous holy and noisy neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "And I'll show an example of that in a second.",
                    "label": 0
                },
                {
                    "sent": "The main point is that we define neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "We need some some way to capture expectations about continuity and smoothness of these neighborhoods and.",
                    "label": 0
                },
                {
                    "sent": "We have developed a principle probabilistic approach using likelihood and prior distributions.",
                    "label": 1
                },
                {
                    "sent": "To do this, I'm not.",
                    "label": 0
                },
                {
                    "sent": "I'll try not to go into the Bayesian formalism too much, except that as we all know we can reduce it to an energy minimization problem.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Basically focus on that.",
                    "label": 0
                },
                {
                    "sent": "To give an example of what I mean by prior likelihoods, suppose you have you receive a noisy facts.",
                    "label": 1
                },
                {
                    "sent": "Where some of the black and white image where some of the bits were flipped.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "You want to recover the original, which perhaps look like this.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How would you do it?",
                    "label": 0
                },
                {
                    "sent": "Well probably most of us will come up with two types of constraints to apply to this problem.",
                    "label": 0
                },
                {
                    "sent": "First of all, you say that the likelihood of a pixel being either black or white is.",
                    "label": 0
                },
                {
                    "sent": "You know, given from the observed data.",
                    "label": 0
                },
                {
                    "sent": "The second constraint is that black and white pixels tend to tend to be grouped together.",
                    "label": 1
                },
                {
                    "sent": "So according to these constraints, this here is a good labeling because it satisfies both these constraints.",
                    "label": 0
                },
                {
                    "sent": "This is a bad labeling because it satisfies the second smoothness constraint, but it does not satisfy the likelihood.",
                    "label": 1
                },
                {
                    "sent": "And this one is a bad labeling because it satisfies the likelihood.",
                    "label": 0
                },
                {
                    "sent": "It's probably close to the original, but it really doesn't display much spatial smoothness, so we're trying to come up with solutions which satisfy both the likelihood as well as what I'll refer to these smoothness assumptions as the prior.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In a general way.",
                    "label": 0
                },
                {
                    "sent": "To come back, come back to this local influence neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "An example of that on a very noisy image, like the kind of shown here.",
                    "label": 1
                },
                {
                    "sent": "If you were to just do the box filter I showed earlier on two different places.",
                    "label": 0
                },
                {
                    "sent": "So P&Q, you might obtain something like that, and it's as you can see, it's noisy.",
                    "label": 0
                },
                {
                    "sent": "It's got holes and it doesn't really satisfy any special contiguous kniss constraints.",
                    "label": 0
                },
                {
                    "sent": "What we really want to do is something like this and this is the kind of results that we wish to obtain.",
                    "label": 0
                },
                {
                    "sent": "The other ways of doing this, for instance by spatially by varying the radius of the circle around each voxel.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "According to the local structure and you can get something like that.",
                    "label": 0
                },
                {
                    "sent": "But as you can see it's not quite ideal.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Alright, so a better neighborhood criterion to enable us to do this is something that incorporates both geometric closeness as well as continuity and smoothness assumptions.",
                    "label": 1
                },
                {
                    "sent": "What we do is we set this up as a minimization problem, solve it using everyone's favorite minimization algorithm.",
                    "label": 1
                },
                {
                    "sent": "Simulator nearly no.",
                    "label": 1
                },
                {
                    "sent": "I was actually just kidding.",
                    "label": 0
                },
                {
                    "sent": "You really want to use something better than that, and we use graph cuts.",
                    "label": 0
                },
                {
                    "sent": "So what are these constraints?",
                    "label": 0
                },
                {
                    "sent": "Let me go through them one after the other.",
                    "label": 0
                },
                {
                    "sent": "First of all, closeness.",
                    "label": 0
                },
                {
                    "sent": "We assume that neighborhoods around each voxel follow somewhat Gaussian shapes.",
                    "label": 0
                },
                {
                    "sent": "And you can try and express that as a probability density function with a Gaussian with two terms.",
                    "label": 0
                },
                {
                    "sent": "The first term row denotes geometric closeness and the second term denotes intensity, closeness and this basically replicates the box that you saw earlier.",
                    "label": 0
                },
                {
                    "sent": "The cut is the Cartesian distance row.",
                    "label": 0
                },
                {
                    "sent": "In fact, we use is.",
                    "label": 0
                },
                {
                    "sent": "We kind of model.",
                    "label": 0
                },
                {
                    "sent": "We kind of change it according to the local intensity gradients as well.",
                    "label": 0
                },
                {
                    "sent": "And the intensity distance is simply.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A linear distance.",
                    "label": 0
                },
                {
                    "sent": "So this is the kind of geometric contours I'm talking about for row.",
                    "label": 0
                },
                {
                    "sent": "As you can see we have introduced some dependence on the local gradient.",
                    "label": 0
                },
                {
                    "sent": "Now that's that's well and good, but this kind of simple geometric.",
                    "label": 0
                },
                {
                    "sent": "Approach will not capture the actual neighborhood over Voxel very accurately.",
                    "label": 0
                },
                {
                    "sent": "What you.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Really want to do on top of that is to introduce these other constraints.",
                    "label": 0
                },
                {
                    "sent": "And we encode this penalty terms between all neighboring voxel pairs.",
                    "label": 1
                },
                {
                    "sent": "And the best way that we all know to do these is by formally writing this as a macro random feel, part of which is shown here an between any two pixels or voxels.",
                    "label": 0
                },
                {
                    "sent": "There exists a potential function, which is some kind of a distance metric.",
                    "label": 0
                },
                {
                    "sent": "In our case, almost always we use the pots function, which assigns a constant cost for any adjacent pixel pair, which are different labels.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 1
                },
                {
                    "sent": "What we do is we do for each voxel P we define a binary field FP such that zero label zero in that field means it is in that neighborhood and one means sorry it's not in the neighborhood and one means it is in the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "As shown here.",
                    "label": 0
                },
                {
                    "sent": "And then we can just set up this problem up as a energy minimization problem, which consists of two terms set of terms.",
                    "label": 0
                },
                {
                    "sent": "The first set of terms imposes geometric closeness, geometric and intensity closeness.",
                    "label": 0
                },
                {
                    "sent": "And this is.",
                    "label": 0
                },
                {
                    "sent": "The the size here are taken from the formula in the earlier slide.",
                    "label": 0
                },
                {
                    "sent": "And the other set of terms consists of enforces continuity and smoothness, and the way we do that is via these.",
                    "label": 0
                },
                {
                    "sent": "Parts functions as shown in that box there, and these parts functions are typically multiplied, weighted by an intensity difference, as shown here.",
                    "label": 0
                },
                {
                    "sent": "What this formulation does is.",
                    "label": 0
                },
                {
                    "sent": "It basically tries to find a neighborhood which satisfies the closeness constraint as well as the continuity constraints.",
                    "label": 0
                },
                {
                    "sent": "There's of course a Bayesian interpretation of this as the log prior of some kind of probability distribution over the lens, but we don't need to go into the.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At this point I just wanted to point out though, that just to reiterate Amalka random field prior imposes spatial coherence, and they've been used in many vision applications very successfully.",
                    "label": 1
                },
                {
                    "sent": "And the metric that we use in this work is the parts function.",
                    "label": 0
                },
                {
                    "sent": "As you can see, the function is extremely discontinuous non convex and these are known to be really good.",
                    "label": 0
                },
                {
                    "sent": "But they also known to be very hard to minimize because of this reason and we need to come up with a smart minimization.",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Technique to do this?",
                    "label": 0
                },
                {
                    "sent": "So the bottom line is that maximizing Lynn priors corresponds to the minimalization of an energy function consisting of two terms, one that imposes closeness in German geometric space, an intensity space in the other, that imposes smoothness, and Marco Random field prize encode.",
                    "label": 0
                },
                {
                    "sent": "These general spatial coherence properties, and this energy function can be minimized using any minimization algorithm you can think of.",
                    "label": 1
                },
                {
                    "sent": "However, we think that most of them wouldn't work on sort of challenging.",
                    "label": 1
                },
                {
                    "sent": "Cost function, so we use graph cuts.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me briefly talk about.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I've cut energy minimization.",
                    "label": 0
                },
                {
                    "sent": "Graph cuts are proven to be very popular and powerful for minimization of energy functions, more or less like this one, they were first developed for stereo matching, where most of the top performing algorithms for stereo rely nowadays on graficas or I think, now, belief propagation is also catching up.",
                    "label": 1
                },
                {
                    "sent": "What happens is that you build a graph where nodes that are that corresponds to pixels in your image and whose edges have weights obtained from the energy terms in the.",
                    "label": 1
                },
                {
                    "sent": "AV of X as shown earlier and you also use two special nodes called terminal nodes and the minimization of the energy.",
                    "label": 0
                },
                {
                    "sent": "On this graph is reduced to finding the minimum.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm cut of this crap.",
                    "label": 0
                },
                {
                    "sent": "Briefly describing the minimum cut problem, as is well known, it can be solved by through the Maxflow algorithm, which simply says.",
                    "label": 0
                },
                {
                    "sent": "So here's here's a possible.",
                    "label": 0
                },
                {
                    "sent": "Graph for that for a neighborhood system, these are the pixel nodes, and these are special nodes, source and sink, and you're trying to find the cheapest way to cut the edges so that the source is separated from the sink and cut edges going from source side to the sink, side and edge weights are assigned so that they represent the cost of cutting these these edges.",
                    "label": 1
                },
                {
                    "sent": "So this is a possible cut.",
                    "label": 0
                },
                {
                    "sent": "It may not be the min cut.",
                    "label": 0
                },
                {
                    "sent": "But the the task of finding a min cut is known to be polynomial order polynomial time and can be solved very efficiently with the Max flow algorithm, although it's theoretically polynomial time practically, it's almost linear in the number of.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Notes.",
                    "label": 0
                },
                {
                    "sent": "So here's the graph construction for our problem for any pixel.",
                    "label": 0
                },
                {
                    "sent": "P in the image you first define a bounding box WP around it.",
                    "label": 0
                },
                {
                    "sent": "Construct a graph based for each of them an you assign and then introduce the two special nodes source and sink, and then you assign the edges according to some formula.",
                    "label": 0
                },
                {
                    "sent": "You assign links corresponding to terms in energy functions.",
                    "label": 1
                },
                {
                    "sent": "There are two types of links.",
                    "label": 0
                },
                {
                    "sent": "T links going from the terminals to the nodes to the to the pixel nodes and end links going between neighbors in the pixel nodes.",
                    "label": 0
                },
                {
                    "sent": "So what happens is that the single pixel terms in your energy function easily represent are going to be represented by these feelings, and double pixel pairs pixel appear terms are represented by end links.",
                    "label": 0
                },
                {
                    "sent": "You then construct the graph and then do a min cut on it an the assignment of which pixel belongs to the neighborhood which doesn't is very simple.",
                    "label": 0
                },
                {
                    "sent": "After the min cut you just give it, give it the assignment as shown in the picture there therefore.",
                    "label": 1
                },
                {
                    "sent": "A minimum cut is equivalent to binary segmentation on this small graph.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These are the edge costs which we assign on the induced graph, and these assignment guarantees that the cost of the min cut is the same as the minimum cost of the energy function.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Alright, so this is the algorithm you form a graph with as shown earlier.",
                    "label": 0
                },
                {
                    "sent": "Do a min cut on this graph using the edge assignments and table in the last slide and then finally define the mapping.",
                    "label": 0
                },
                {
                    "sent": "Of the neighborhood system of the neighborhood around Pixel P, just as shown here, things that belong to the cut.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So sorry, things that are connected after the.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things that are connected to this sourceid.",
                    "label": 0
                },
                {
                    "sent": "Get assigned.",
                    "label": 0
                },
                {
                    "sent": "One and things that are connected to the sink side get assigned zero and that gives you the local influenced neighborhood around that pixel, which I'm going to call B sub P.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Can you repeat this graph min cut for each voxel in the image?",
                    "label": 0
                },
                {
                    "sent": "You really don't have to repeat everything from scratch because it can use reuse edges in the graph, so it's.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More eficient than it appears.",
                    "label": 0
                },
                {
                    "sent": "Some examples of detected lens showing.",
                    "label": 1
                },
                {
                    "sent": "One example on the linear image you can see how the neighborhood adapt itself to the local structure.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some of the most popular lens I've run this on many images.",
                    "label": 1
                },
                {
                    "sent": "As you can see there are no surprises here.",
                    "label": 0
                },
                {
                    "sent": "Things are just symmetric or elongated or diagonal end up being the most popular.",
                    "label": 0
                },
                {
                    "sent": "You can do a lot of things with these.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Neighbors structures you can do filtering where the extent of the filtering is bounded by influence neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Convolutional filters could be implemented like this where you only sum up.",
                    "label": 1
                },
                {
                    "sent": "Things that belong in that neighborhood and not go past this is a good way of doing edge preserving filtering.",
                    "label": 0
                },
                {
                    "sent": "It's a big problem in image processing because filtering tends to smooth things and this is one way of making sure that things don't get over smooth.",
                    "label": 0
                },
                {
                    "sent": "You can also do rank order filters and this is a very interesting bit of experimentation.",
                    "label": 0
                },
                {
                    "sent": "I did where you can define the percentile rank not on a uniform neighborhood around a voxel but but using just the.",
                    "label": 0
                },
                {
                    "sent": "Local influence neighborhood for the percentile rank.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "For instance, you can do maximum filters using this and let me show you some exam.",
                    "label": 0
                },
                {
                    "sent": "This is a part of the lighthouse image Original and if you did a maximum filter with a three by three window you get something that looks like that.",
                    "label": 1
                },
                {
                    "sent": "Now, if you do the same thing but this time restrict the maximum filter effect, the domain of the maximum filter to the local influence neighborhood around each voxel.",
                    "label": 0
                },
                {
                    "sent": "What's your pain?",
                    "label": 0
                },
                {
                    "sent": "Is this?",
                    "label": 0
                },
                {
                    "sent": "It's?",
                    "label": 0
                },
                {
                    "sent": "I really don't know how to interpret this, but it seems like it's very different from the.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Normal maximum filter.",
                    "label": 0
                },
                {
                    "sent": "More interesting is the median filter.",
                    "label": 1
                },
                {
                    "sent": "The same thing again, and this is a median filter using standard median filter and this is the median filter using lens you can see the main effect I wanted to point out is that this has a much higher edge preserving property.",
                    "label": 0
                },
                {
                    "sent": "I'm hoping you can see that from the back there.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That's one of the users of these.",
                    "label": 0
                },
                {
                    "sent": "Neighbor structures but.",
                    "label": 0
                },
                {
                    "sent": "To do it, we also tried to do image denoising using this approach and we came up with an expectation maximization style algorithm for this, whoops.",
                    "label": 0
                },
                {
                    "sent": "Yeah, ignore that second line for a minute.",
                    "label": 0
                },
                {
                    "sent": "Suppose you have a noise model which where the observed image is simply the actual image I plus some noise.",
                    "label": 0
                },
                {
                    "sent": "And suppose we introduce an image prior where given the F denotes the set of all influence neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "So, given knowledge of all the influence neighborhoods or across the whole image, we can introduce an image prior which is basically.",
                    "label": 0
                },
                {
                    "sent": "A kind of a convolutional lowpass prior, but the difference this time is that.",
                    "label": 0
                },
                {
                    "sent": "You only you restrict the lowpass operation to the for each voxel.",
                    "label": 0
                },
                {
                    "sent": "Two it's Lynn.",
                    "label": 0
                },
                {
                    "sent": "And that way you can make sure that this image prior is not going to give you blurry images, which is generally the case.",
                    "label": 0
                },
                {
                    "sent": "So, and the likelihood for this particular noise model with assuming IID Gaussian noise is simply.",
                    "label": 1
                },
                {
                    "sent": "The Gaussian shown here and the denoising problem is therefore to maximize the post.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Area.",
                    "label": 0
                },
                {
                    "sent": "I think you'll know what the what, that where that comes from is just it comes from Bayes theorem, so I'll just skip this.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The trouble is that the joint maximization of that posterior is extremely hard, and therefore we propose an OEM style approach whereby we start with an initial estimate of the image which is actually just the same as the noisy image and then iterate.",
                    "label": 1
                },
                {
                    "sent": "Through 2 alternative steps for the first step, you try to find the best local inference neighborhoods given the old.",
                    "label": 0
                },
                {
                    "sent": "The earlier estimate of the image, and this step is performed using graph cuts as described earlier.",
                    "label": 0
                },
                {
                    "sent": "But for the second step.",
                    "label": 0
                },
                {
                    "sent": "You then given knowledge of the influence neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "You then maximize the probability of I given the influence neighborhoods.",
                    "label": 0
                },
                {
                    "sent": "And that's a posterior.",
                    "label": 0
                },
                {
                    "sent": "And you maximize that until some criterion convergence criterion is met in the.",
                    "label": 0
                },
                {
                    "sent": "A paper and in the in the book you have, we show how it's very easy to prove that for the second step you can reduce this argmax to very simple linear combination, shown there, which by the way also involves these Lynn restricted filtering operations.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So some results.",
                    "label": 0
                },
                {
                    "sent": "Again on Lena this is noisy Lena image.",
                    "label": 0
                },
                {
                    "sent": "This was denoised, using a Gaussian filtering kernel.",
                    "label": 0
                },
                {
                    "sent": "And this was done was using our Lynn restricted filters.",
                    "label": 0
                },
                {
                    "sent": "The EM algorithm for it.",
                    "label": 0
                },
                {
                    "sent": "So the differences are that it mostly preserves local structures and also preserves all the dominant edges.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another example on the biker image.",
                    "label": 0
                },
                {
                    "sent": "This is noisy biker image.",
                    "label": 0
                },
                {
                    "sent": "This was done by.",
                    "label": 0
                },
                {
                    "sent": "This is denoised by a gas in kernel this is denoised by an alternative technique I tried where they set the the support of the filter varies according to the local structure and it doesn't find job.",
                    "label": 0
                },
                {
                    "sent": "It preserves some dominant edges but it smells out a lot of the texture and if you compare that with what we obtain.",
                    "label": 0
                },
                {
                    "sent": "This seems to be.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You have some amount of improvement.",
                    "label": 0
                },
                {
                    "sent": "I did this for a number of images and here are the results.",
                    "label": 0
                },
                {
                    "sent": "In most cases I obtain a.",
                    "label": 0
                },
                {
                    "sent": "Both are better.",
                    "label": 0
                },
                {
                    "sent": "Signal to noise ratio as well as peak SNR.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So let me now briefly talk about some other applications of these neighborhoods, which are, after all, intermediate structures.",
                    "label": 0
                },
                {
                    "sent": "And therefore they can be used to probe the scale space of image data by varying the scale parameters of.",
                    "label": 1
                },
                {
                    "sent": "I'm not sure if I've defined this before.",
                    "label": 0
                },
                {
                    "sent": "These two Sigma X and Sigma N are basically the geometric Euclidean distance factor and the intensity difference, distance factor and by changing these you can model.",
                    "label": 0
                },
                {
                    "sent": "Change the effect of your neighborhoods and these can be used to probe very interesting fractal properties of of images, including brain images, which is what I'm primarily interested in this point.",
                    "label": 0
                },
                {
                    "sent": "You can also do a segment hierarchical segmentation, which is similar to the superpixel concept and can talk about that.",
                    "label": 1
                },
                {
                    "sent": "You can also use these inference neighborhoods as feature vectors for image, image, registration, object recognition.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And and tracking.",
                    "label": 0
                },
                {
                    "sent": "Just to briefly describe what I mean by this, you begin with links at a fine scale and hierarchically fuse finer links to obtain coarser lens and obtain a segmentation, kind of like what the previous speaker was describing.",
                    "label": 1
                },
                {
                    "sent": "For instance, you could start with a finer neighbor structure and.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Go up to something closer.",
                    "label": 0
                },
                {
                    "sent": "I don't have very much time, but this is a very interesting project we've just embarked upon, where by changing the scales associated with the intensity and geometry we can.",
                    "label": 0
                },
                {
                    "sent": "Prove the factor dimension of multi dimension.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is like the brain.",
                    "label": 0
                },
                {
                    "sent": "And I'll show you what I mean for each voxel, and for each value of these parameters, you just count the number of voxels included in its neighborhood.",
                    "label": 1
                },
                {
                    "sent": "Say I'm showing a zoomed AB portion of a brain image.",
                    "label": 0
                },
                {
                    "sent": "And suppose you had a voxel there and you started by.",
                    "label": 0
                },
                {
                    "sent": "A very small Sigma X and try to increase it.",
                    "label": 0
                },
                {
                    "sent": "What would be the effect on its local neighborhood?",
                    "label": 0
                },
                {
                    "sent": "Very small Lambda, so Sigma X will give you something like this.",
                    "label": 0
                },
                {
                    "sent": "Slightly bigger will give you that.",
                    "label": 0
                },
                {
                    "sent": "That that so you can see it's a linear structure there locally, so it's going to grow linearly, so.",
                    "label": 0
                },
                {
                    "sent": "It will continue to grow linearly until a point where it gets out of that local structure, and then it starts to grow, you know.",
                    "label": 0
                },
                {
                    "sent": "In two dimensions.",
                    "label": 0
                },
                {
                    "sent": "And maybe in some more complicated ways as shown here.",
                    "label": 0
                },
                {
                    "sent": "And finally, if you increase the factor large enough, it basically gets you one of those Gaussians.",
                    "label": 0
                },
                {
                    "sent": "If I plotted the number of pixels in the neighborhood, I'll probably see something like this.",
                    "label": 0
                },
                {
                    "sent": "Where there appears that there will be some phase transitions given by this critical .1 critical .2.",
                    "label": 0
                },
                {
                    "sent": "Also, the slope of each segment is basically the local fractal dimension, so between the slopes and the critical points, these quantities are very important to determine the fractal dimension or complexity of fractal structures, and we intend to use these things for detecting disease states in brain image.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Basically, the advantage of current FD measurements is that you get a link and FD for each voxel, whereas current techniques give you a fractal dimension for the whole thing at the same time we can capture the FDF local as well as global regions.",
                    "label": 1
                },
                {
                    "sent": "In this idea, for direction structures and oriented features is far less susceptible to noise.",
                    "label": 1
                },
                {
                    "sent": "Because we explicitly modeled insensitive scale, which can be news to the tune to the noise level.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It enables the probing of phase transition and.",
                    "label": 0
                },
                {
                    "sent": "Put some possible applications include.",
                    "label": 0
                },
                {
                    "sent": "Possible that the fractal dimension measurements using this technique can give better discriminators of neurodegeneration.",
                    "label": 0
                },
                {
                    "sent": "For instance, Alzheimer's disease, frontotemporal dementia, mild commuter disorder, normal aging, and so on.",
                    "label": 1
                },
                {
                    "sent": "So we propose to use the mean FD.",
                    "label": 0
                },
                {
                    "sent": "This is going into fractal theory, so I'm not going to go into too much detail, except to note that the quantities I described in the previous slide are the ones which are very relevant to detect disease states.",
                    "label": 0
                },
                {
                    "sent": "Alright, now I'm skipping through these.",
                    "label": 1
                },
                {
                    "sent": "The take home messages as these quantities may be very efficiently probed by this graph.",
                    "label": 0
                },
                {
                    "sent": "Cut based local influence neighborhood structures.",
                    "label": 0
                },
                {
                    "sent": "And they may consequently provide greater just discriminability between normal.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A DfT D and so on.",
                    "label": 0
                },
                {
                    "sent": "So to summarize, we propose a general method for estimating local influence neighborhoods which are based on an optimal energy minimization approach, and these links are intermediaries between purely pixel based an region based methods and some applications include denoising, filtering, recognition, fractal, dimension estimation, an so on, and in other words the best thing since sliced bread.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank.",
                    "label": 0
                }
            ]
        }
    }
}