{
    "id": "t5xq7ky3nt6aiugwyzro6zmesbcczc54",
    "title": "Special Session: Projects in Multimodal Interaction - AMI",
    "info": {
        "author": [
            "Steve Renals, University of Edinburgh"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "May 2006",
        "category": [
            "Top->Computer Science->Information Retrieval->Multimedia Retrieval"
        ]
    },
    "url": "http://videolectures.net/mlmi06_renals_pmia/",
    "segmentation": [
        [
            "So OK.",
            "So this is an overview of the AMI project which has been going for about 2 and a two and a bit years now."
        ],
        [
            "So as Alex said in the introduction to this session, AMI is one of these European Union integrated projects and we have 14 or 15 partners, depending how you count them running and it's started in January of 2004.",
            "And the Army project will finish and at the end of this year and the second phase project, will will kind of nicely overlap and continue through 209.",
            "So Amy is very much a project about multimodal interaction, but specifically we're looking at human human interaction rather than human computer interaction, and we have a fairly specific focus in particular within within me, looking at business meetings with Co located participants.",
            "So talking in some kind of instrumented meeting room and we're increasingly looking to do research where we have meetings with remote participants.",
            "So in particular, people interacting over video conferences and so on.",
            "And as is common to all these integrated projects, it's not just a research project, there is a training aspect to it, and a technology transfer aspect to it.",
            "And the progress.",
            "The main sort of progress and outputs.",
            "That's that we're making.",
            "So Mark talked very nicely before lunch about the work we're doing in multimodal recognition, and what he referred to as the higher level processing or the kind of content abstraction and automatic struction of meetings, is another main aspect of me.",
            "We've collected a large corpus of data, 100 hours of meetings, and this is all being heavily annotated and you can find out more about that at certainly the poster, and you can get the DVD as well and there's a number of demonstrations you can see in the session after this."
        ],
        [
            "And there's a whole bunch of partners, so it's it's an essence.",
            "We think there's a nice balance between research institutes and universities and various various companies, ranging from the kind of large ones like Philips two smaller ones like Real VNC and Spider Phone.",
            "So the company, the small companies in particular like VNC who are interested in and kind of.",
            "I guess you could call it collaborative environments and Spider Phone and Visual Nexos who work on teleconferencing and video conferencing.",
            "OK, so why this is this?"
        ],
        [
            "Is this is one of these kind of high level and slightly meaningless slides, but it's but it sort of gives you the kind of picture of the environment we're hoping to work in or we are working in where we have people interacting and maybe a lot of the content in the interaction comes through speech.",
            "But of course the speech signal itself covers many different modalities.",
            "It's a, it's a multi sensory signal because you're speaking, but there's the lip movement and then you're gesturing with your hands and this facial expression.",
            "And that is not just the person who's speaking is important, there's the other people in the room, and they may be there may be attending to the speaker, or they may not be attending to the speaker.",
            "And in many meetings there's lots of other data around, which is extremely important, such as documents, slides, being presented, and so on."
        ],
        [
            "So why are we concerned in particular with Co located meetings?",
            "I mean, you might think that maybe remote meetings are really where where technology can really play a big part and and and I think that's true, but but just meetings in the same room are important, and one of the kind of motivations we had is we've all those of us from European projects have worked in many European projects, and you go to project meetings.",
            "And basically, if you've got 15 people in the meeting, this is a few person weeks garment.",
            "I don't know where the travel budget is, it depends.",
            "It depends how budget the airlines are that week.",
            "You've got a lot of disruption to your family life.",
            "You kind of spend time in transit because it's not a direct flight from Edinburgh to I don't know these are broken.",
            "And so I'm so.",
            "Project.",
            "Family and friends.",
            "Yeah, well, there's a certain trend to change your partners and sound.",
            "You're kind of dancing metaphor anyway."
        ],
        [
            "So if you're investing, if you're investing all this, if investing all this, all this money and and all this time and all this disruption to your life, then you better have some really good outputs and you better you know better.",
            "Be really worth attending these meetings.",
            "And of course you know apps absolutely come away with excellent records from these meetings and it's very valuable.",
            "So in me, what we what we what we were thinking about is, well, what sort of questions do you have after you've attended such a meeting?",
            "So next week?"
        ],
        [
            "Maybe your colleagues who weren't at the meeting or asking you well what happened at the WP meeting next month.",
            "Maybe the people who were there are kind of having having some sort of local meeting or having a chat and you know they're saying well what exactly did did the other people say about on your algorithm next year for his review meeting you better remember what the precise criticisms that the reviewers have so you can show that you've got you've addressed them an maybe.",
            "Today we've got some.",
            "We've got some partners in our new project from Australia, and it would have been very nice for them to participate, but it's kind of.",
            "A bigger cost for them than for most of us to come here.",
            "It would be nice if they could somehow remotely participate in a much richer way than just a video stream at the moment gives you.",
            "So this is.",
            "These are the sort of things that we're looking at in me."
        ],
        [
            "So we think that by addressing these problems were actually addressing the kind of wider problem of just kind of getting technology to support human interaction.",
            "But by focusing on on the specific issue of meetings, we can actually get a good validation of the technology we have, and we can.",
            "Also, we can also evaluate it in many different levels, both at the technology level where we're thinking just in terms maybe of how many words or speech recognizer gets right or wrong, and also maybe at some much higher level.",
            "Of application, maybe you want to see if the meeting browses.",
            "You construct other remote meeting assistance you construct can actually in some way you can demonstrate that they make the meetings more efficient or give greater satisfaction to the participants or somehow give give some sort of richness that wasn't that wasn't available.",
            "So.",
            "What are the sort of researchers you?"
        ],
        [
            "So we're looking at so there is many of the things that Mark was talking about in an audio and visual processing, and I think there is a very much well.",
            "Those are very much quarter this workshop and we see them as very much core to me because because that's the raw material of.",
            "Human interaction if you're.",
            "If you're coming from a signal processing background than the raw material of human interaction of the signals, you can collect in the way and the way you can.",
            "The way you can process them.",
            "I think one of the sort of pervasive intellectual themes that cut across many of the things we do in me is the development of models to deal with multiple streams of data.",
            "So dealing with asynchronous data and maybe video it, maybe audio, maybe text, but if you can have a consistent statistical model to deal with this, then it's our belief that you can do.",
            "You can do.",
            "You can do much more sophisticated processing and you can understand what's going on, and you can combine things and you have a principled way of bringing in new modalities.",
            "There's also one of the things that we that we learned in doing the project is that what sort of engineers think of as a softer stuff, and that turns out to be extremely important.",
            "So modeling, modeling the dynamics of groups and the intergroup dynamics and the way the technology can affect that, I think, becomes very important, and indeed, it's absolutely critical to the way we end up to finally evaluate the technology that we do develop, because it's it's the way the people.",
            "Interaction meetings and the outcomes of the meetings that is that in the final analysis is is what we care about.",
            "So these are the sort of things these are sort of things.",
            "We're working on content extraction, structuring as well, and underlying that we want to collect data because because, certainly start with we want to have data of what actually happens in meetings and.",
            "In particular, I think the kind of speech recognition approach to the world has been has been quite successful, which is you collect data and you annotate it very well, and then you build statistical models on that data.",
            "And that's the approach that we've adopted an army, and I think it's the standard way."
        ],
        [
            "So this is this is this is the sort of very high level kind of illustration of that with that W that we that we capture data and we annotate it and we train our models and then we can, then we can.",
            "Then we can use it in final applications.",
            "So with an army, we've we've."
        ],
        [
            "We've constructed three standardized meeting rooms through the partners in the app in Switzerland to know in the Netherlands and Edinburgh in the UK, the standardized, in terms of the equipment rather than the rooms.",
            "The rooms are very different geometries and have very different room acoustics actually and within.",
            "Each room we've we've, we've collected a number of four person meetings using a number of cameras you saw in marks in Mark's presentation, a quick output of some of those cameras just for ground truth.",
            "We used headset microphones and all the meetings, but our target is that we don't want people to be wearing headset microphones.",
            "We want to be using distant microphones.",
            "The tabletop microphones, for example.",
            "So all our meetings we use circular microphone arrays of eight about about mikes we capture what goes on.",
            "Through the data projector, we captured the whiteboard.",
            "All participants in meetings have these digital pens, that kind of Logitech Anoto pens so you know they right and they fill it with XML.",
            "And then you see and you see what they're doing.",
            "So you've got a good idea of what's going on there, and there's a few extra site dependent devices.",
            "So, for example, added the app, there's a binaural mannequin.",
            "Other sites are using lapel, mikes or second microphone array and so on.",
            "So."
        ],
        [
            "Just the those are just a set of skills from.",
            "From one of the main reasons such as the measurement in breast, you can get an idea of the of the of the room geometry, and if you look you can see this is this is the.",
            "This is a microphone array with four cameras underneath, giving giving closeups and course we have an overhead camera in the room view camera as well."
        ],
        [
            "So to talk a little bit about the data that we've collected, so we have about 100 our corpus of four participant meetings, and this corpus is annotated many different levels, so of course we transcribe the speech.",
            "We transcribe the words that were spoken.",
            "Then there are other linguistic transcriptions such as dialogue acts, segmentation into topics.",
            "Then we have video annotation, essentially head, hands and feet.",
            "And certainly for the speech annotation, the whole corpus has been annotated in this way in this way for most of the corpus has been annotated with most of the linguistic annotations.",
            "An less of the corpus has been has been annotated at the video level because that's the most costly annotation to do.",
            "It's an expensive ground truth and you can find out a lot more about that at the the poster.",
            "Now, one of the things we did in this and this, I think, is quite interesting 'cause it relates to some of the discussion this morning is that we we made the decision that we weren't going to collect all real meetings, so a previous project that one of our partners were involved with was the was the EXE meetings corpus and that was a corpus of real meetings and it's and it's a very good corpus.",
            "Audio only, but it's a very nice corpus of how people interact, but if you try to do start to try to do content extraction on it, then you find that you have this big problem that you're completely out of context, and in some of the meetings it was actually very hard to get annotators to actually to be able to annotate them.",
            "So even for topic segmentation, for some of the meetings with and we were using linguistic students as annotators, and these were kind of speech research meetings, they were finding it tough to do topic segmentation summarization very, very tough.",
            "So real meeting and so maybe this is extreme these research meetings, but it's still the case that in real meetings there's a whole lot of stuff that exists that you don't know about.",
            "This can relate to the content it can relate to the way the participants interact.",
            "It can relate to ongoing interactions.",
            "There could be an interaction that's been going on for 25 years between two participants, and you're just capturing this little snapshot of a few meetings, and then it's very difficult to do research on that.",
            "So we made the decision to to record the bulk of our corpus using what we call scenario meetings and I'll talk more about those in a moment.",
            "Addition, in addition, we did record some real meetings which ranged from sort of social groups discussing, discussing well like a cinema club.",
            "Through to Student design, project meetings and so on.",
            "And we also recorded for.",
            "For I guess technology reasons specific spoke corpora.",
            "So for example, we recorded a corpus which is particularly useful for audio visual localization and tracking, and we recorded another corpus for microphone array stuff.",
            "And yeah, you can.",
            "I encourage you as I said them, to get the taste of DVD from the poster from one of the demos this afternoon and that can.",
            "That just gives you a few of the meetings in the corpus, but it does give you the full set of annotations over those meetings.",
            "You can get a very good idea of what we have.",
            "So."
        ],
        [
            "About 70% of the meetings are based on based on the scenario of a design team and this is a kind of role play scenario, but the participants of the meeting are given given kind of very strong background for their roles in terms of real time emails through the day, constructed websites that they browse, and so on.",
            "The reason and there's a series of four meetings culminating in the design in fact have a remote control and they have real work to do between the meetings and events happen such as the project manager.",
            "Finds out that the budgets being cut and the marketing person get certain certain kind of consumer marketing reports and so on.",
            "There's a number of advantages to the scenario meetings.",
            "Importantly, we've got we've.",
            "We can control the domain so it's easier to understand what people are talking about.",
            "It's also easier if you want to do more if you want to use more complex models for content extraction.",
            "For example, if you want to construct an ontology of what's going on, then it's much easier if you know the domain, what of which the participants are speaking.",
            "It's also possible that you can control the knowledge and the motivation of the participants, because the way we recorded it, they typically didn't really know each other before, so all their all their motivation was supposedly coming from the briefing notes they had and from the emails that they were getting and from the from the websites that they were browsing.",
            "So this means that we have a much better control over over what's going on in these meetings, and by having this constructed scenario is possible to to run replicates of it, which we did multiple times at the different sites.",
            "So then it's possible to actually do something more scientific in terms of the outcome measures, and you've controlled a lot of the variables, so the cost of the diversity you've got control over variables, so perhaps you can.",
            "Actually you can actually get some more significant, some more significant answers coming out."
        ],
        [
            "So as I said, we've done a lot of annotation and I encourage you to look at the next demo.",
            "The Nite XML toolkit in the next session, so.",
            "Of course we do speech transcription.",
            "We do other signal labeling, so this one."
        ],
        [
            "Thanks.",
            "Showing various actions that people are making, such as such as standing up and sitting down, and so on."
        ],
        [
            "We we label dialogue acts and we also."
        ],
        [
            "Do summaries.",
            "Of the meetings and the summaries are produced both by the participants and by external observers playing the role.",
            "Perhaps of the line manager of the project manager."
        ],
        [
            "So how do we put all this stuff together?",
            "It's all put together, so our main current demonstration application to pull these things together is a meeting browser.",
            "This is a screenshot, a fairly old screenshot actually of a browser called J Ferret, and you can see that demo dinner, next session and J Ferret gives you has a nice plugin architecture so it gives us a way to pull things together to pull to pull in topic segmentation.",
            "The slides presented.",
            "Speech transcripts.",
            "Keyword spotted some work people do on on kind of the kind of interaction in terms of how much somebody is speaking and so on.",
            "And by constructing this browser then it's possible and this is something that's ongoing at the moment.",
            "It's possible to design new experiments where we rerun these scenarios and we can rerun the same scenario is so we have the same knowledge of what the participants are doing.",
            "But we can run them with the browser in the loop, so the participants are able to use the browser and maybe a new participant comes in to replace to replace previous participant and then we can.",
            "We can actually validate whether the meeting browser in fact.",
            "Helps us or helps the participants to be more efficient in the meeting and to perhaps a greater satisfaction.",
            "And, you know, one of the questions that we have to ask is, is there?",
            "We assume that since organisations invest so much in meetings that there must be some value in the meetings and the question is is the value in the content of the meetings or is it just in the social interaction?",
            "If it's just in a social interaction, it may be that the meetings on the best thing to do so you assume there must be some value in the content.",
            "So if you can access the content in a better way than just through meeting minutes then this should be reflected in some sort of outcome measure.",
            "But we don't know this and this is and this is and this is something.",
            "So I think it's very important to find out and and in some cases in some ways you know.",
            "I think a negative result would be even more interesting in some way because it kind of you know why are we wasting our time in meetings.",
            "I'm not going to talk too much about the audio."
        ],
        [
            "Processing marked it very well this morning, I will say.",
            "I am the two.",
            "Bottom bullets are what we see as the big challenges coming up.",
            "So getting our model scalable and getting them to run in real time I think is very important.",
            "If we're ever going to see some kind of some kind of commercial deployment of these things and the real time aspect is interesting as well, because when you come to online collaboration.",
            "It has a big effect on some of the algorithms we use, so in the speech recognition evaluations we computer real time factor.",
            "But that's just basically length of speech divided by length of processing time.",
            "So or the other way around.",
            "So this is this is all very well, but it doesn't include any latency.",
            "So if you need to have all the speech so you can run your adaptation algorithm, this is fine.",
            "It may be a real time, maybe a real time system, but in video conferencing maximum acceptable latency is 250 milliseconds.",
            "So this this real time aspect, actually I think has an effect on the algorithms and the models that you might want to look at.",
            "The other issue is that although we had lots of fun collecting the data and perhaps less fun, annotating the data, we really don't want to do it again.",
            "So if we move to a different domain, we really don't want to have to go through collecting 100 hours of data.",
            "So the issue of adaptation to new domains without an extensive data collection, and certainly without extensive annotation links are crucial one."
        ],
        [
            "You can see I think there's a good example in some of the talks and posters at the meeting of some of the work we're doing, the structure and content extraction.",
            "It ranges from structuring by meeting events through to automatic summarization through to a dialogue, act, segmentation and annotation."
        ],
        [
            "So in the.",
            "Last few minutes, I'd like to.",
            "I'd like to talk about where we're going with this project.",
            "So in the AMI project, as you've seen, we've been.",
            "Essentially, looking at technologies to create an access archives efficiently.",
            "So an army we recording meetings and then seeing if these if we get rich multimodal records of meetings, can we use the can we use these records somehow to improve whatever process is going on or to improve people's satisfaction with the process that's going on?",
            "Now this is this is interesting, but I think it's it's just.",
            "It's just one small area of what we really could be doing and in the in the following project we call we call Ameter where we're starting to extend things to looking at how we can use these technologies for for online meetings where some of the participants may be remote.",
            "There's also, I think there's certainly possibilities for using the technology online for face to face meetings.",
            "For example, you could."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So OK.",
                    "label": 0
                },
                {
                    "sent": "So this is an overview of the AMI project which has been going for about 2 and a two and a bit years now.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So as Alex said in the introduction to this session, AMI is one of these European Union integrated projects and we have 14 or 15 partners, depending how you count them running and it's started in January of 2004.",
                    "label": 0
                },
                {
                    "sent": "And the Army project will finish and at the end of this year and the second phase project, will will kind of nicely overlap and continue through 209.",
                    "label": 0
                },
                {
                    "sent": "So Amy is very much a project about multimodal interaction, but specifically we're looking at human human interaction rather than human computer interaction, and we have a fairly specific focus in particular within within me, looking at business meetings with Co located participants.",
                    "label": 0
                },
                {
                    "sent": "So talking in some kind of instrumented meeting room and we're increasingly looking to do research where we have meetings with remote participants.",
                    "label": 0
                },
                {
                    "sent": "So in particular, people interacting over video conferences and so on.",
                    "label": 0
                },
                {
                    "sent": "And as is common to all these integrated projects, it's not just a research project, there is a training aspect to it, and a technology transfer aspect to it.",
                    "label": 0
                },
                {
                    "sent": "And the progress.",
                    "label": 0
                },
                {
                    "sent": "The main sort of progress and outputs.",
                    "label": 0
                },
                {
                    "sent": "That's that we're making.",
                    "label": 0
                },
                {
                    "sent": "So Mark talked very nicely before lunch about the work we're doing in multimodal recognition, and what he referred to as the higher level processing or the kind of content abstraction and automatic struction of meetings, is another main aspect of me.",
                    "label": 0
                },
                {
                    "sent": "We've collected a large corpus of data, 100 hours of meetings, and this is all being heavily annotated and you can find out more about that at certainly the poster, and you can get the DVD as well and there's a number of demonstrations you can see in the session after this.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's a whole bunch of partners, so it's it's an essence.",
                    "label": 0
                },
                {
                    "sent": "We think there's a nice balance between research institutes and universities and various various companies, ranging from the kind of large ones like Philips two smaller ones like Real VNC and Spider Phone.",
                    "label": 0
                },
                {
                    "sent": "So the company, the small companies in particular like VNC who are interested in and kind of.",
                    "label": 0
                },
                {
                    "sent": "I guess you could call it collaborative environments and Spider Phone and Visual Nexos who work on teleconferencing and video conferencing.",
                    "label": 0
                },
                {
                    "sent": "OK, so why this is this?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is this is one of these kind of high level and slightly meaningless slides, but it's but it sort of gives you the kind of picture of the environment we're hoping to work in or we are working in where we have people interacting and maybe a lot of the content in the interaction comes through speech.",
                    "label": 0
                },
                {
                    "sent": "But of course the speech signal itself covers many different modalities.",
                    "label": 0
                },
                {
                    "sent": "It's a, it's a multi sensory signal because you're speaking, but there's the lip movement and then you're gesturing with your hands and this facial expression.",
                    "label": 1
                },
                {
                    "sent": "And that is not just the person who's speaking is important, there's the other people in the room, and they may be there may be attending to the speaker, or they may not be attending to the speaker.",
                    "label": 0
                },
                {
                    "sent": "And in many meetings there's lots of other data around, which is extremely important, such as documents, slides, being presented, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So why are we concerned in particular with Co located meetings?",
                    "label": 0
                },
                {
                    "sent": "I mean, you might think that maybe remote meetings are really where where technology can really play a big part and and and I think that's true, but but just meetings in the same room are important, and one of the kind of motivations we had is we've all those of us from European projects have worked in many European projects, and you go to project meetings.",
                    "label": 0
                },
                {
                    "sent": "And basically, if you've got 15 people in the meeting, this is a few person weeks garment.",
                    "label": 1
                },
                {
                    "sent": "I don't know where the travel budget is, it depends.",
                    "label": 1
                },
                {
                    "sent": "It depends how budget the airlines are that week.",
                    "label": 1
                },
                {
                    "sent": "You've got a lot of disruption to your family life.",
                    "label": 0
                },
                {
                    "sent": "You kind of spend time in transit because it's not a direct flight from Edinburgh to I don't know these are broken.",
                    "label": 0
                },
                {
                    "sent": "And so I'm so.",
                    "label": 0
                },
                {
                    "sent": "Project.",
                    "label": 0
                },
                {
                    "sent": "Family and friends.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well, there's a certain trend to change your partners and sound.",
                    "label": 0
                },
                {
                    "sent": "You're kind of dancing metaphor anyway.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you're investing, if you're investing all this, if investing all this, all this money and and all this time and all this disruption to your life, then you better have some really good outputs and you better you know better.",
                    "label": 0
                },
                {
                    "sent": "Be really worth attending these meetings.",
                    "label": 0
                },
                {
                    "sent": "And of course you know apps absolutely come away with excellent records from these meetings and it's very valuable.",
                    "label": 0
                },
                {
                    "sent": "So in me, what we what we what we were thinking about is, well, what sort of questions do you have after you've attended such a meeting?",
                    "label": 0
                },
                {
                    "sent": "So next week?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe your colleagues who weren't at the meeting or asking you well what happened at the WP meeting next month.",
                    "label": 0
                },
                {
                    "sent": "Maybe the people who were there are kind of having having some sort of local meeting or having a chat and you know they're saying well what exactly did did the other people say about on your algorithm next year for his review meeting you better remember what the precise criticisms that the reviewers have so you can show that you've got you've addressed them an maybe.",
                    "label": 0
                },
                {
                    "sent": "Today we've got some.",
                    "label": 0
                },
                {
                    "sent": "We've got some partners in our new project from Australia, and it would have been very nice for them to participate, but it's kind of.",
                    "label": 0
                },
                {
                    "sent": "A bigger cost for them than for most of us to come here.",
                    "label": 0
                },
                {
                    "sent": "It would be nice if they could somehow remotely participate in a much richer way than just a video stream at the moment gives you.",
                    "label": 0
                },
                {
                    "sent": "So this is.",
                    "label": 0
                },
                {
                    "sent": "These are the sort of things that we're looking at in me.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we think that by addressing these problems were actually addressing the kind of wider problem of just kind of getting technology to support human interaction.",
                    "label": 0
                },
                {
                    "sent": "But by focusing on on the specific issue of meetings, we can actually get a good validation of the technology we have, and we can.",
                    "label": 0
                },
                {
                    "sent": "Also, we can also evaluate it in many different levels, both at the technology level where we're thinking just in terms maybe of how many words or speech recognizer gets right or wrong, and also maybe at some much higher level.",
                    "label": 0
                },
                {
                    "sent": "Of application, maybe you want to see if the meeting browses.",
                    "label": 0
                },
                {
                    "sent": "You construct other remote meeting assistance you construct can actually in some way you can demonstrate that they make the meetings more efficient or give greater satisfaction to the participants or somehow give give some sort of richness that wasn't that wasn't available.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What are the sort of researchers you?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we're looking at so there is many of the things that Mark was talking about in an audio and visual processing, and I think there is a very much well.",
                    "label": 0
                },
                {
                    "sent": "Those are very much quarter this workshop and we see them as very much core to me because because that's the raw material of.",
                    "label": 0
                },
                {
                    "sent": "Human interaction if you're.",
                    "label": 0
                },
                {
                    "sent": "If you're coming from a signal processing background than the raw material of human interaction of the signals, you can collect in the way and the way you can.",
                    "label": 0
                },
                {
                    "sent": "The way you can process them.",
                    "label": 0
                },
                {
                    "sent": "I think one of the sort of pervasive intellectual themes that cut across many of the things we do in me is the development of models to deal with multiple streams of data.",
                    "label": 0
                },
                {
                    "sent": "So dealing with asynchronous data and maybe video it, maybe audio, maybe text, but if you can have a consistent statistical model to deal with this, then it's our belief that you can do.",
                    "label": 0
                },
                {
                    "sent": "You can do.",
                    "label": 0
                },
                {
                    "sent": "You can do much more sophisticated processing and you can understand what's going on, and you can combine things and you have a principled way of bringing in new modalities.",
                    "label": 0
                },
                {
                    "sent": "There's also one of the things that we that we learned in doing the project is that what sort of engineers think of as a softer stuff, and that turns out to be extremely important.",
                    "label": 0
                },
                {
                    "sent": "So modeling, modeling the dynamics of groups and the intergroup dynamics and the way the technology can affect that, I think, becomes very important, and indeed, it's absolutely critical to the way we end up to finally evaluate the technology that we do develop, because it's it's the way the people.",
                    "label": 0
                },
                {
                    "sent": "Interaction meetings and the outcomes of the meetings that is that in the final analysis is is what we care about.",
                    "label": 0
                },
                {
                    "sent": "So these are the sort of things these are sort of things.",
                    "label": 0
                },
                {
                    "sent": "We're working on content extraction, structuring as well, and underlying that we want to collect data because because, certainly start with we want to have data of what actually happens in meetings and.",
                    "label": 0
                },
                {
                    "sent": "In particular, I think the kind of speech recognition approach to the world has been has been quite successful, which is you collect data and you annotate it very well, and then you build statistical models on that data.",
                    "label": 0
                },
                {
                    "sent": "And that's the approach that we've adopted an army, and I think it's the standard way.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is this is this is the sort of very high level kind of illustration of that with that W that we that we capture data and we annotate it and we train our models and then we can, then we can.",
                    "label": 0
                },
                {
                    "sent": "Then we can use it in final applications.",
                    "label": 0
                },
                {
                    "sent": "So with an army, we've we've.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We've constructed three standardized meeting rooms through the partners in the app in Switzerland to know in the Netherlands and Edinburgh in the UK, the standardized, in terms of the equipment rather than the rooms.",
                    "label": 1
                },
                {
                    "sent": "The rooms are very different geometries and have very different room acoustics actually and within.",
                    "label": 1
                },
                {
                    "sent": "Each room we've we've, we've collected a number of four person meetings using a number of cameras you saw in marks in Mark's presentation, a quick output of some of those cameras just for ground truth.",
                    "label": 0
                },
                {
                    "sent": "We used headset microphones and all the meetings, but our target is that we don't want people to be wearing headset microphones.",
                    "label": 0
                },
                {
                    "sent": "We want to be using distant microphones.",
                    "label": 0
                },
                {
                    "sent": "The tabletop microphones, for example.",
                    "label": 0
                },
                {
                    "sent": "So all our meetings we use circular microphone arrays of eight about about mikes we capture what goes on.",
                    "label": 0
                },
                {
                    "sent": "Through the data projector, we captured the whiteboard.",
                    "label": 1
                },
                {
                    "sent": "All participants in meetings have these digital pens, that kind of Logitech Anoto pens so you know they right and they fill it with XML.",
                    "label": 0
                },
                {
                    "sent": "And then you see and you see what they're doing.",
                    "label": 0
                },
                {
                    "sent": "So you've got a good idea of what's going on there, and there's a few extra site dependent devices.",
                    "label": 0
                },
                {
                    "sent": "So, for example, added the app, there's a binaural mannequin.",
                    "label": 0
                },
                {
                    "sent": "Other sites are using lapel, mikes or second microphone array and so on.",
                    "label": 1
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just the those are just a set of skills from.",
                    "label": 0
                },
                {
                    "sent": "From one of the main reasons such as the measurement in breast, you can get an idea of the of the of the room geometry, and if you look you can see this is this is the.",
                    "label": 0
                },
                {
                    "sent": "This is a microphone array with four cameras underneath, giving giving closeups and course we have an overhead camera in the room view camera as well.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So to talk a little bit about the data that we've collected, so we have about 100 our corpus of four participant meetings, and this corpus is annotated many different levels, so of course we transcribe the speech.",
                    "label": 0
                },
                {
                    "sent": "We transcribe the words that were spoken.",
                    "label": 0
                },
                {
                    "sent": "Then there are other linguistic transcriptions such as dialogue acts, segmentation into topics.",
                    "label": 0
                },
                {
                    "sent": "Then we have video annotation, essentially head, hands and feet.",
                    "label": 0
                },
                {
                    "sent": "And certainly for the speech annotation, the whole corpus has been annotated in this way in this way for most of the corpus has been annotated with most of the linguistic annotations.",
                    "label": 0
                },
                {
                    "sent": "An less of the corpus has been has been annotated at the video level because that's the most costly annotation to do.",
                    "label": 0
                },
                {
                    "sent": "It's an expensive ground truth and you can find out a lot more about that at the the poster.",
                    "label": 0
                },
                {
                    "sent": "Now, one of the things we did in this and this, I think, is quite interesting 'cause it relates to some of the discussion this morning is that we we made the decision that we weren't going to collect all real meetings, so a previous project that one of our partners were involved with was the was the EXE meetings corpus and that was a corpus of real meetings and it's and it's a very good corpus.",
                    "label": 0
                },
                {
                    "sent": "Audio only, but it's a very nice corpus of how people interact, but if you try to do start to try to do content extraction on it, then you find that you have this big problem that you're completely out of context, and in some of the meetings it was actually very hard to get annotators to actually to be able to annotate them.",
                    "label": 0
                },
                {
                    "sent": "So even for topic segmentation, for some of the meetings with and we were using linguistic students as annotators, and these were kind of speech research meetings, they were finding it tough to do topic segmentation summarization very, very tough.",
                    "label": 0
                },
                {
                    "sent": "So real meeting and so maybe this is extreme these research meetings, but it's still the case that in real meetings there's a whole lot of stuff that exists that you don't know about.",
                    "label": 0
                },
                {
                    "sent": "This can relate to the content it can relate to the way the participants interact.",
                    "label": 0
                },
                {
                    "sent": "It can relate to ongoing interactions.",
                    "label": 0
                },
                {
                    "sent": "There could be an interaction that's been going on for 25 years between two participants, and you're just capturing this little snapshot of a few meetings, and then it's very difficult to do research on that.",
                    "label": 0
                },
                {
                    "sent": "So we made the decision to to record the bulk of our corpus using what we call scenario meetings and I'll talk more about those in a moment.",
                    "label": 0
                },
                {
                    "sent": "Addition, in addition, we did record some real meetings which ranged from sort of social groups discussing, discussing well like a cinema club.",
                    "label": 0
                },
                {
                    "sent": "Through to Student design, project meetings and so on.",
                    "label": 0
                },
                {
                    "sent": "And we also recorded for.",
                    "label": 0
                },
                {
                    "sent": "For I guess technology reasons specific spoke corpora.",
                    "label": 0
                },
                {
                    "sent": "So for example, we recorded a corpus which is particularly useful for audio visual localization and tracking, and we recorded another corpus for microphone array stuff.",
                    "label": 0
                },
                {
                    "sent": "And yeah, you can.",
                    "label": 0
                },
                {
                    "sent": "I encourage you as I said them, to get the taste of DVD from the poster from one of the demos this afternoon and that can.",
                    "label": 0
                },
                {
                    "sent": "That just gives you a few of the meetings in the corpus, but it does give you the full set of annotations over those meetings.",
                    "label": 0
                },
                {
                    "sent": "You can get a very good idea of what we have.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About 70% of the meetings are based on based on the scenario of a design team and this is a kind of role play scenario, but the participants of the meeting are given given kind of very strong background for their roles in terms of real time emails through the day, constructed websites that they browse, and so on.",
                    "label": 0
                },
                {
                    "sent": "The reason and there's a series of four meetings culminating in the design in fact have a remote control and they have real work to do between the meetings and events happen such as the project manager.",
                    "label": 0
                },
                {
                    "sent": "Finds out that the budgets being cut and the marketing person get certain certain kind of consumer marketing reports and so on.",
                    "label": 0
                },
                {
                    "sent": "There's a number of advantages to the scenario meetings.",
                    "label": 0
                },
                {
                    "sent": "Importantly, we've got we've.",
                    "label": 0
                },
                {
                    "sent": "We can control the domain so it's easier to understand what people are talking about.",
                    "label": 0
                },
                {
                    "sent": "It's also easier if you want to do more if you want to use more complex models for content extraction.",
                    "label": 0
                },
                {
                    "sent": "For example, if you want to construct an ontology of what's going on, then it's much easier if you know the domain, what of which the participants are speaking.",
                    "label": 0
                },
                {
                    "sent": "It's also possible that you can control the knowledge and the motivation of the participants, because the way we recorded it, they typically didn't really know each other before, so all their all their motivation was supposedly coming from the briefing notes they had and from the emails that they were getting and from the from the websites that they were browsing.",
                    "label": 0
                },
                {
                    "sent": "So this means that we have a much better control over over what's going on in these meetings, and by having this constructed scenario is possible to to run replicates of it, which we did multiple times at the different sites.",
                    "label": 0
                },
                {
                    "sent": "So then it's possible to actually do something more scientific in terms of the outcome measures, and you've controlled a lot of the variables, so the cost of the diversity you've got control over variables, so perhaps you can.",
                    "label": 0
                },
                {
                    "sent": "Actually you can actually get some more significant, some more significant answers coming out.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as I said, we've done a lot of annotation and I encourage you to look at the next demo.",
                    "label": 0
                },
                {
                    "sent": "The Nite XML toolkit in the next session, so.",
                    "label": 1
                },
                {
                    "sent": "Of course we do speech transcription.",
                    "label": 0
                },
                {
                    "sent": "We do other signal labeling, so this one.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "Showing various actions that people are making, such as such as standing up and sitting down, and so on.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We we label dialogue acts and we also.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do summaries.",
                    "label": 0
                },
                {
                    "sent": "Of the meetings and the summaries are produced both by the participants and by external observers playing the role.",
                    "label": 0
                },
                {
                    "sent": "Perhaps of the line manager of the project manager.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how do we put all this stuff together?",
                    "label": 0
                },
                {
                    "sent": "It's all put together, so our main current demonstration application to pull these things together is a meeting browser.",
                    "label": 0
                },
                {
                    "sent": "This is a screenshot, a fairly old screenshot actually of a browser called J Ferret, and you can see that demo dinner, next session and J Ferret gives you has a nice plugin architecture so it gives us a way to pull things together to pull to pull in topic segmentation.",
                    "label": 0
                },
                {
                    "sent": "The slides presented.",
                    "label": 0
                },
                {
                    "sent": "Speech transcripts.",
                    "label": 0
                },
                {
                    "sent": "Keyword spotted some work people do on on kind of the kind of interaction in terms of how much somebody is speaking and so on.",
                    "label": 0
                },
                {
                    "sent": "And by constructing this browser then it's possible and this is something that's ongoing at the moment.",
                    "label": 0
                },
                {
                    "sent": "It's possible to design new experiments where we rerun these scenarios and we can rerun the same scenario is so we have the same knowledge of what the participants are doing.",
                    "label": 0
                },
                {
                    "sent": "But we can run them with the browser in the loop, so the participants are able to use the browser and maybe a new participant comes in to replace to replace previous participant and then we can.",
                    "label": 0
                },
                {
                    "sent": "We can actually validate whether the meeting browser in fact.",
                    "label": 1
                },
                {
                    "sent": "Helps us or helps the participants to be more efficient in the meeting and to perhaps a greater satisfaction.",
                    "label": 0
                },
                {
                    "sent": "And, you know, one of the questions that we have to ask is, is there?",
                    "label": 0
                },
                {
                    "sent": "We assume that since organisations invest so much in meetings that there must be some value in the meetings and the question is is the value in the content of the meetings or is it just in the social interaction?",
                    "label": 0
                },
                {
                    "sent": "If it's just in a social interaction, it may be that the meetings on the best thing to do so you assume there must be some value in the content.",
                    "label": 0
                },
                {
                    "sent": "So if you can access the content in a better way than just through meeting minutes then this should be reflected in some sort of outcome measure.",
                    "label": 0
                },
                {
                    "sent": "But we don't know this and this is and this is and this is something.",
                    "label": 0
                },
                {
                    "sent": "So I think it's very important to find out and and in some cases in some ways you know.",
                    "label": 0
                },
                {
                    "sent": "I think a negative result would be even more interesting in some way because it kind of you know why are we wasting our time in meetings.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to talk too much about the audio.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Processing marked it very well this morning, I will say.",
                    "label": 0
                },
                {
                    "sent": "I am the two.",
                    "label": 0
                },
                {
                    "sent": "Bottom bullets are what we see as the big challenges coming up.",
                    "label": 0
                },
                {
                    "sent": "So getting our model scalable and getting them to run in real time I think is very important.",
                    "label": 0
                },
                {
                    "sent": "If we're ever going to see some kind of some kind of commercial deployment of these things and the real time aspect is interesting as well, because when you come to online collaboration.",
                    "label": 0
                },
                {
                    "sent": "It has a big effect on some of the algorithms we use, so in the speech recognition evaluations we computer real time factor.",
                    "label": 0
                },
                {
                    "sent": "But that's just basically length of speech divided by length of processing time.",
                    "label": 0
                },
                {
                    "sent": "So or the other way around.",
                    "label": 0
                },
                {
                    "sent": "So this is this is all very well, but it doesn't include any latency.",
                    "label": 0
                },
                {
                    "sent": "So if you need to have all the speech so you can run your adaptation algorithm, this is fine.",
                    "label": 0
                },
                {
                    "sent": "It may be a real time, maybe a real time system, but in video conferencing maximum acceptable latency is 250 milliseconds.",
                    "label": 0
                },
                {
                    "sent": "So this this real time aspect, actually I think has an effect on the algorithms and the models that you might want to look at.",
                    "label": 0
                },
                {
                    "sent": "The other issue is that although we had lots of fun collecting the data and perhaps less fun, annotating the data, we really don't want to do it again.",
                    "label": 0
                },
                {
                    "sent": "So if we move to a different domain, we really don't want to have to go through collecting 100 hours of data.",
                    "label": 0
                },
                {
                    "sent": "So the issue of adaptation to new domains without an extensive data collection, and certainly without extensive annotation links are crucial one.",
                    "label": 1
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can see I think there's a good example in some of the talks and posters at the meeting of some of the work we're doing, the structure and content extraction.",
                    "label": 0
                },
                {
                    "sent": "It ranges from structuring by meeting events through to automatic summarization through to a dialogue, act, segmentation and annotation.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in the.",
                    "label": 0
                },
                {
                    "sent": "Last few minutes, I'd like to.",
                    "label": 0
                },
                {
                    "sent": "I'd like to talk about where we're going with this project.",
                    "label": 0
                },
                {
                    "sent": "So in the AMI project, as you've seen, we've been.",
                    "label": 0
                },
                {
                    "sent": "Essentially, looking at technologies to create an access archives efficiently.",
                    "label": 0
                },
                {
                    "sent": "So an army we recording meetings and then seeing if these if we get rich multimodal records of meetings, can we use the can we use these records somehow to improve whatever process is going on or to improve people's satisfaction with the process that's going on?",
                    "label": 0
                },
                {
                    "sent": "Now this is this is interesting, but I think it's it's just.",
                    "label": 0
                },
                {
                    "sent": "It's just one small area of what we really could be doing and in the in the following project we call we call Ameter where we're starting to extend things to looking at how we can use these technologies for for online meetings where some of the participants may be remote.",
                    "label": 0
                },
                {
                    "sent": "There's also, I think there's certainly possibilities for using the technology online for face to face meetings.",
                    "label": 0
                },
                {
                    "sent": "For example, you could.",
                    "label": 0
                }
            ]
        }
    }
}