{
    "id": "tanpmxdodihcked6fdsqwzlzstxkxdzq",
    "title": "Analysing Meeting Records: An Ethnographic Study and Technological Implications",
    "info": {
        "author": [
            "Steve Whittaker, Department of Molecular Biology and Biotechnology, University of Sheffield"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "June 2005",
        "category": [
            "Top->Computer Science->Machine Learning",
            "Top->Computers->Multimedia"
        ]
    },
    "url": "http://videolectures.net/mlmi04uk_whittaker_esti/",
    "segmentation": [
        [
            "Technology could indications and the talk is given by Simon.",
            "OK, so as I said, the title of the talk is analyzing meeting records and after graphic study and technological implications."
        ],
        [
            "So we all know and we all know that meetings are inefficient.",
            "Managers estimate of productivity ranges from 33 to 47%.",
            "And the source of this inefficient is quite numerous.",
            "There's a lot of process losses, for example free riding and conformance pressure, but there's also information loss."
        ],
        [
            "A lot of previous work has developed technology for capturing and reviewing meetings discussions, but the predominant technologies in use today are still very low tech like pen and paper.",
            "So we feel it's important to revisit the issue of information capture and also to examine representations and processing of meeting informations, and we can then use this information and use this examination to evaluate the current meeting access technology."
        ],
        [
            "So this is a quick outline of the talking today I'm going to describe the study we carried out into looking at meeting records, and then I'm going to talk a bit about the most common records, taking amount meetings, which is public records and personal records or private records.",
            "And then I'm going to quickly just look at the technological implications of this study and then a quick conclusion."
        ],
        [
            "So we looked at two different UK service firms, one responsible for Mail deliveries and one supplying software services.",
            "In both cases we observed a series of meetings of teams of single teams and.",
            "In both cases, teams had between 5:00 and seven members.",
            "And the meetings examined range from 3 to 16 participants.",
            "Obviously people were very excited about these meetings.",
            "And the meetings were generally task oriented rather than idea oriented.",
            "I'm from these meetings weekly."
        ],
        [
            "Quite a lot of data we had someone in the meetings observing participants behavior.",
            "We analyzed their personal notes.",
            "We took interviews at all stages throughout the series of meetings.",
            "We also made transcripts of some of the meetings and discuss them with the participants and throughout we can preserve their confidentiality of the personal records and the meetings themselves.",
            "And So what we found was that generally two types of meeting records, generated public records and private records.",
            "So I'm going to talk about each intern."
        ],
        [
            "Public meeting records were generally minutes.",
            "This is a shared record of decision and action points for a single meeting.",
            "Now these are generally produced by a single person who is designated a minister.",
            "And the minutes are a highly abstract representation of the events of a meeting."
        ],
        [
            "And public records have a number of functions within the teams we looked at.",
            "First of all, they can be used to track group progress and meetings were often start by running through the minutes of the previous meeting to see what stage of the project the teams are at.",
            "They also serve to assist individuals and coordinate their actions so people are able to collaborate between each other.",
            "They also act as a public record of past actions and decisions.",
            "So very occasionally the minutes would be dived into and old miss would be proved out, pulled out to see what the previous decisions were made."
        ],
        [
            "They also serve as a public To Do List, so a means of them reminding people about their commitments and what they have to do for for the coming meeting.",
            "And they can also be used to resolve disputes about commitments, so the minutes of their acting as an implicit contract between group members.",
            "And this is quite a formal contract in as far as often.",
            "In these meetings we looked at the minutes were formally signed off so that everyone agreed that they had to do these certain tasks, and so they could be used to determine who was assigned to what task.",
            "And this was formally agreed."
        ],
        [
            "Now public records as they stand have a few limitations.",
            "Obviously if you have to have a designated Minister, you can't always have this person available to you, so not all meetings were limited.",
            "And the minutes were also occasionally inaccurate, which means that the participants had to take their own personal notes and then check the minutes to ensure their accuracy.",
            "The minutes also lacked contextual information, which is why people have to take their own personal notes to provide that information.",
            "The minutes are selective and are not timely in some of the cases that we looked at, it would take a number of days to produce the minutes.",
            "And obviously."
        ],
        [
            "Like what the board is to produce, you need the designated Minister and that person has reduced contributions to the meeting.",
            "Furthermore, and this was quite a sort of Iraq occurrence, but it did come up the meters don't capture the meeting experience.",
            "The participants may require a richer record of the meeting, and also they don't and capture peripheral aspects of the meeting.",
            "They only record decisions and actions.",
            "So information about a party going on would not be reflecting on the minutes.",
            "So we also looked at personal."
        ],
        [
            "In records which are generally people's notes.",
            "So pit participants of the meetings would use their personal notes to address the limitations of the public meeting records.",
            "Now these notes were highly valued, often stored for a number of years, and often participants would rewrite their notes to ensure that they had a good and accurate record.",
            "And the notes reflect their personal perspectives, so they were really only interested in the things they are interested in, unsurprisingly.",
            "But they largely consist of decisions, actions, and contact surrounding these decisions and actions.",
            "And as we all know, they're often cryptic and used more as a memory aid.",
            "But they can also be used as a means of informing non attendees if if you've ever handed your notes to someone and they come back to you saying I don't understand a word of this, they might explain the last two points on the slide."
        ],
        [
            "So personal records serve a number of functions.",
            "The access personal reminders for participants of the meetings they provide contextual information so that they can carry out their actions whilst having full knowledge of them.",
            "There also as I as I said, they used to check the accuracy of the minutes and also to brief other but other non attendees of the meeting on the contents of the meeting."
        ],
        [
            "Also, personal records have limitations as well.",
            "Obviously, taking notes reduces your ability to contribute, hence the cryptic and memory aid like nature of these things.",
            "They often are inaccurate and incomprehensible.",
            "Naturally, and as I said, this attack nature of the notes make it quite difficult sometimes for non attendees to understand.",
            "So now that we understand the kind of meeting records that are taken, we can look at how current technology."
        ],
        [
            "Addresses limitations and supplemented these meeting records.",
            "Concurrent technologies does quite well in addressing the limitations of public records.",
            "Since we have a full meeting record, we no longer require contextual information for since the record has this for us and it's no longer laborious or untimely to produce public records because the recordings of our immediately.",
            "There's still some problems present with.",
            "The technologies addressing of public records.",
            "Generally, meeting browsers have no abstraction facilities, and so it's a very rich full record.",
            "But sometimes you want to have that sort of abstract representation, which current meeting browsers don't really give you.",
            "And there's also a question of the formality of current technological meeting records.",
            "In that, as I said, public records are often signed off, and it's it's an open question as to whether a full and detailed meeting record would have that same level of formality.",
            "As the public records."
        ],
        [
            "Technology also addresses the limitations and probably possibilities of personal records.",
            "If you have a meeting recording it, there's no longer that burden of producing contextual notes and conceptual records, and the non attendees are now no longer hindered by the satanic nature of these public personal records.",
            "But there are still problems.",
            "Most meeting browsers don't exploit the progress made in notetaking technology.",
            "And quite a few systems that will link your personal notes against the meeting record, and then you could.",
            "You could clarify any of the personal notes you've made by examining the meeting record, but most current browsers don't really do this, and there's also again coming back to the abstraction problem.",
            "There's a lack of direct access to decisions and actions, so you have this full rich meeting record, but there's no real way of easily grasping the decisions and actions made."
        ],
        [
            "A quick summary of my quick speech.",
            "We examined meeting records in two firms, generally two types of records were made, a public record, which was generally meeting minutes and private records, which were generally personal notes.",
            "We looked at the advantages and disadvantages of each set of records and we briefly examined how technology addressed the limitations of these records.",
            "So we did.",
            "Yeah.",
            "So here this this.",
            "But did you say that the technology study was analytical?",
            "Just thinking about what technologies might exist and how they might be used.",
            "Or was it observation it was based on an analysis of current technology.",
            "Without seeing people using, yeah yeah it was analytical yeah yeah.",
            "Any other?",
            "So thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology could indications and the talk is given by Simon.",
                    "label": 0
                },
                {
                    "sent": "OK, so as I said, the title of the talk is analyzing meeting records and after graphic study and technological implications.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we all know and we all know that meetings are inefficient.",
                    "label": 0
                },
                {
                    "sent": "Managers estimate of productivity ranges from 33 to 47%.",
                    "label": 0
                },
                {
                    "sent": "And the source of this inefficient is quite numerous.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of process losses, for example free riding and conformance pressure, but there's also information loss.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot of previous work has developed technology for capturing and reviewing meetings discussions, but the predominant technologies in use today are still very low tech like pen and paper.",
                    "label": 0
                },
                {
                    "sent": "So we feel it's important to revisit the issue of information capture and also to examine representations and processing of meeting informations, and we can then use this information and use this examination to evaluate the current meeting access technology.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is a quick outline of the talking today I'm going to describe the study we carried out into looking at meeting records, and then I'm going to talk a bit about the most common records, taking amount meetings, which is public records and personal records or private records.",
                    "label": 0
                },
                {
                    "sent": "And then I'm going to quickly just look at the technological implications of this study and then a quick conclusion.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we looked at two different UK service firms, one responsible for Mail deliveries and one supplying software services.",
                    "label": 1
                },
                {
                    "sent": "In both cases we observed a series of meetings of teams of single teams and.",
                    "label": 0
                },
                {
                    "sent": "In both cases, teams had between 5:00 and seven members.",
                    "label": 1
                },
                {
                    "sent": "And the meetings examined range from 3 to 16 participants.",
                    "label": 0
                },
                {
                    "sent": "Obviously people were very excited about these meetings.",
                    "label": 0
                },
                {
                    "sent": "And the meetings were generally task oriented rather than idea oriented.",
                    "label": 0
                },
                {
                    "sent": "I'm from these meetings weekly.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Quite a lot of data we had someone in the meetings observing participants behavior.",
                    "label": 1
                },
                {
                    "sent": "We analyzed their personal notes.",
                    "label": 0
                },
                {
                    "sent": "We took interviews at all stages throughout the series of meetings.",
                    "label": 0
                },
                {
                    "sent": "We also made transcripts of some of the meetings and discuss them with the participants and throughout we can preserve their confidentiality of the personal records and the meetings themselves.",
                    "label": 0
                },
                {
                    "sent": "And So what we found was that generally two types of meeting records, generated public records and private records.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to talk about each intern.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Public meeting records were generally minutes.",
                    "label": 1
                },
                {
                    "sent": "This is a shared record of decision and action points for a single meeting.",
                    "label": 1
                },
                {
                    "sent": "Now these are generally produced by a single person who is designated a minister.",
                    "label": 0
                },
                {
                    "sent": "And the minutes are a highly abstract representation of the events of a meeting.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And public records have a number of functions within the teams we looked at.",
                    "label": 1
                },
                {
                    "sent": "First of all, they can be used to track group progress and meetings were often start by running through the minutes of the previous meeting to see what stage of the project the teams are at.",
                    "label": 1
                },
                {
                    "sent": "They also serve to assist individuals and coordinate their actions so people are able to collaborate between each other.",
                    "label": 0
                },
                {
                    "sent": "They also act as a public record of past actions and decisions.",
                    "label": 1
                },
                {
                    "sent": "So very occasionally the minutes would be dived into and old miss would be proved out, pulled out to see what the previous decisions were made.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They also serve as a public To Do List, so a means of them reminding people about their commitments and what they have to do for for the coming meeting.",
                    "label": 0
                },
                {
                    "sent": "And they can also be used to resolve disputes about commitments, so the minutes of their acting as an implicit contract between group members.",
                    "label": 1
                },
                {
                    "sent": "And this is quite a formal contract in as far as often.",
                    "label": 1
                },
                {
                    "sent": "In these meetings we looked at the minutes were formally signed off so that everyone agreed that they had to do these certain tasks, and so they could be used to determine who was assigned to what task.",
                    "label": 0
                },
                {
                    "sent": "And this was formally agreed.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now public records as they stand have a few limitations.",
                    "label": 1
                },
                {
                    "sent": "Obviously if you have to have a designated Minister, you can't always have this person available to you, so not all meetings were limited.",
                    "label": 0
                },
                {
                    "sent": "And the minutes were also occasionally inaccurate, which means that the participants had to take their own personal notes and then check the minutes to ensure their accuracy.",
                    "label": 0
                },
                {
                    "sent": "The minutes also lacked contextual information, which is why people have to take their own personal notes to provide that information.",
                    "label": 1
                },
                {
                    "sent": "The minutes are selective and are not timely in some of the cases that we looked at, it would take a number of days to produce the minutes.",
                    "label": 0
                },
                {
                    "sent": "And obviously.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like what the board is to produce, you need the designated Minister and that person has reduced contributions to the meeting.",
                    "label": 0
                },
                {
                    "sent": "Furthermore, and this was quite a sort of Iraq occurrence, but it did come up the meters don't capture the meeting experience.",
                    "label": 0
                },
                {
                    "sent": "The participants may require a richer record of the meeting, and also they don't and capture peripheral aspects of the meeting.",
                    "label": 1
                },
                {
                    "sent": "They only record decisions and actions.",
                    "label": 1
                },
                {
                    "sent": "So information about a party going on would not be reflecting on the minutes.",
                    "label": 0
                },
                {
                    "sent": "So we also looked at personal.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In records which are generally people's notes.",
                    "label": 0
                },
                {
                    "sent": "So pit participants of the meetings would use their personal notes to address the limitations of the public meeting records.",
                    "label": 1
                },
                {
                    "sent": "Now these notes were highly valued, often stored for a number of years, and often participants would rewrite their notes to ensure that they had a good and accurate record.",
                    "label": 0
                },
                {
                    "sent": "And the notes reflect their personal perspectives, so they were really only interested in the things they are interested in, unsurprisingly.",
                    "label": 1
                },
                {
                    "sent": "But they largely consist of decisions, actions, and contact surrounding these decisions and actions.",
                    "label": 1
                },
                {
                    "sent": "And as we all know, they're often cryptic and used more as a memory aid.",
                    "label": 0
                },
                {
                    "sent": "But they can also be used as a means of informing non attendees if if you've ever handed your notes to someone and they come back to you saying I don't understand a word of this, they might explain the last two points on the slide.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So personal records serve a number of functions.",
                    "label": 1
                },
                {
                    "sent": "The access personal reminders for participants of the meetings they provide contextual information so that they can carry out their actions whilst having full knowledge of them.",
                    "label": 1
                },
                {
                    "sent": "There also as I as I said, they used to check the accuracy of the minutes and also to brief other but other non attendees of the meeting on the contents of the meeting.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Also, personal records have limitations as well.",
                    "label": 1
                },
                {
                    "sent": "Obviously, taking notes reduces your ability to contribute, hence the cryptic and memory aid like nature of these things.",
                    "label": 1
                },
                {
                    "sent": "They often are inaccurate and incomprehensible.",
                    "label": 1
                },
                {
                    "sent": "Naturally, and as I said, this attack nature of the notes make it quite difficult sometimes for non attendees to understand.",
                    "label": 0
                },
                {
                    "sent": "So now that we understand the kind of meeting records that are taken, we can look at how current technology.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Addresses limitations and supplemented these meeting records.",
                    "label": 0
                },
                {
                    "sent": "Concurrent technologies does quite well in addressing the limitations of public records.",
                    "label": 1
                },
                {
                    "sent": "Since we have a full meeting record, we no longer require contextual information for since the record has this for us and it's no longer laborious or untimely to produce public records because the recordings of our immediately.",
                    "label": 0
                },
                {
                    "sent": "There's still some problems present with.",
                    "label": 0
                },
                {
                    "sent": "The technologies addressing of public records.",
                    "label": 0
                },
                {
                    "sent": "Generally, meeting browsers have no abstraction facilities, and so it's a very rich full record.",
                    "label": 0
                },
                {
                    "sent": "But sometimes you want to have that sort of abstract representation, which current meeting browsers don't really give you.",
                    "label": 0
                },
                {
                    "sent": "And there's also a question of the formality of current technological meeting records.",
                    "label": 0
                },
                {
                    "sent": "In that, as I said, public records are often signed off, and it's it's an open question as to whether a full and detailed meeting record would have that same level of formality.",
                    "label": 0
                },
                {
                    "sent": "As the public records.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Technology also addresses the limitations and probably possibilities of personal records.",
                    "label": 1
                },
                {
                    "sent": "If you have a meeting recording it, there's no longer that burden of producing contextual notes and conceptual records, and the non attendees are now no longer hindered by the satanic nature of these public personal records.",
                    "label": 1
                },
                {
                    "sent": "But there are still problems.",
                    "label": 0
                },
                {
                    "sent": "Most meeting browsers don't exploit the progress made in notetaking technology.",
                    "label": 0
                },
                {
                    "sent": "And quite a few systems that will link your personal notes against the meeting record, and then you could.",
                    "label": 0
                },
                {
                    "sent": "You could clarify any of the personal notes you've made by examining the meeting record, but most current browsers don't really do this, and there's also again coming back to the abstraction problem.",
                    "label": 1
                },
                {
                    "sent": "There's a lack of direct access to decisions and actions, so you have this full rich meeting record, but there's no real way of easily grasping the decisions and actions made.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A quick summary of my quick speech.",
                    "label": 0
                },
                {
                    "sent": "We examined meeting records in two firms, generally two types of records were made, a public record, which was generally meeting minutes and private records, which were generally personal notes.",
                    "label": 1
                },
                {
                    "sent": "We looked at the advantages and disadvantages of each set of records and we briefly examined how technology addressed the limitations of these records.",
                    "label": 1
                },
                {
                    "sent": "So we did.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So here this this.",
                    "label": 0
                },
                {
                    "sent": "But did you say that the technology study was analytical?",
                    "label": 0
                },
                {
                    "sent": "Just thinking about what technologies might exist and how they might be used.",
                    "label": 0
                },
                {
                    "sent": "Or was it observation it was based on an analysis of current technology.",
                    "label": 0
                },
                {
                    "sent": "Without seeing people using, yeah yeah it was analytical yeah yeah.",
                    "label": 0
                },
                {
                    "sent": "Any other?",
                    "label": 0
                },
                {
                    "sent": "So thank you.",
                    "label": 0
                }
            ]
        }
    }
}