{
    "id": "tbpno22ootc2mxy7h4o5lixyh7vvsjtg",
    "title": "eLexicography, collaboration, bilingual corpora - all in one!",
    "info": {
        "author": [
            "Vera Kuzmina, ABBYY"
        ],
        "published": "Dec. 2, 2011",
        "recorded": "November 2011",
        "category": [
            "Top->Humanities->Linguistics->Lexicography"
        ]
    },
    "url": "http://videolectures.net/elex2011_kuzmina_corpora/",
    "segmentation": [
        [
            "Thank you very much to everyone and I would like to thank Michael for his wonderful presentation just in the morning today I will continue speaking about online and E lexicography.",
            "Collaboration between users and lexicographers, and bilingual corpora."
        ],
        [
            "My paper is devoted to my billing or pro, which is a dictionary portal online portal and it is a single access point for different type of usage for the dictionaries and corpora.",
            "So you may look up and search in dictionary sources you make will make, acquires and searches in bilingual corpora and monolingual corpora and.",
            "There is another model of collaboration with dictionary users, and there are so many interesting things like text alignment and term extraction.",
            "So I will show a step by step each of these features within our software and I will of course show the software itself for the web portal."
        ],
        [
            "OK, and some background around this product and this project.",
            "I come from a big company.",
            "This is a software company and we are concentrated on languages and language technologies.",
            "We are operating for 20 three years in the market.",
            "We started with creation electronic dictionary.",
            "It was that time for DOS and after that we upgraded the dictionary version.",
            "Today we have a desktop version, mobile versions and online version of Electronic Dictionary Linguam.",
            "We have several experiences within our company and with our partners and authors in lexicography and language investigations.",
            "So we see that the typical tasks of lexical lexicographer or language resource are the following.",
            "I need to identify new words in different subject areas, then identify their meanings.",
            "Different meanings of this word.",
            "Compare the usage of this word in different contexts in different meanings.",
            "Find translations to each meaning or definition.",
            "Stooge, meaning it really depends and find some locations to this words, word, phrases and other things.",
            "A right now in our company we have professional users and creators of dictionaries, lexicographers, and linguists.",
            "First of all, have our subsidiary company, Arbor Press publishing House.",
            "They are concentrated on publishing dictionaries, general lexicon, dictionaries, pocket sized dictionaries for Russian based English to Russian, German to Russian, and other size.",
            "Right now there are about 25 in-house lexicographers and round 60 outsources who work together with our publishing house in our software division.",
            "We have linguists and lexicographers who work in our research and development Department, so there about 100 people working in it and we actively collaborate and work with private authors author groups.",
            "And editors, so we have different types of users of professional users, users for language resources."
        ],
        [
            "So based on this experience, we created a blink of pro portal.",
            "The concept of the portal is that it is a complete set of language data and technology tools that used for the following cases.",
            "So it's a web based linguist and lexicographer Workbench working environment.",
            "Right now it's also online portal with about 1 1/2 million queries per day, and it's a solution for language resources man."
        ],
        [
            "Edgmont the main features are so it is a set of different language data, dictionaries, text corpora and there is connection to external resources and different tools which help managing.",
            "Looking through searching through this language data so there are different types of searches.",
            "Choirs we have a liner for a learning curve.",
            "For creating bilingual text aligned parallel texts, we have collaboration modeling where the users collaborate with lexicographers.",
            "People can discuss different words, so suggesting words in song and very soon we are implementing terminology extraction.",
            "I will tell about this in detail."
        ],
        [
            "OK so I will start with dictionaries with the content.",
            "Right now Lingo Pro supports about 20 language directions.",
            "English, Russian, English, German, English, French, English, Chinese, Russian, German and vice versa.",
            "So both sides.",
            "And the technology is multilingual, so many other languages can be easily added.",
            "So we're working on this now.",
            "There are about 1 million entries in the whole set of dictionaries, and the number is growing.",
            "There are different types of viewing options, so the user which comes from just the web will see the dictionary and some samples, but in very close future we will have access.",
            "Special access for lexicographers and linguists.",
            "For them to work."
        ],
        [
            "Within the portal.",
            "Um, continuing with the text call prom, they are both bilingual and monolingual.",
            "I will show bilingual corpora today.",
            "Right now we support more than 10 language directions for the corpora.",
            "The hugest one is English, Russian, both ways, then we support English, German, English, French, English, Chinese, and the some other language directions and the same as of the technology is multilingual.",
            "We may add as more languages as it needed.",
            "Right now it has about 1 billion words.",
            "And the database is growing, so it's it's living more and more texts are being added constantly and one more very important thing.",
            "I think that the user might add their own corpora to the system and use it within us."
        ],
        [
            "Your interface.",
            "We support different types of searches, just simple search in a dictionary, bilingual search, advanced searches, for example, searches of exact phrases, morphology, searches, searches of words in different distance from each other.",
            "Specify part of speeches and grammar.",
            "Features match case.",
            "For example, look for words only in capitalized letters.",
            "Then fast search will be supported and semantic search.",
            "Is also coming soon."
        ],
        [
            "OK, right now I'm switching to the portal.",
            "I will check if Internet connections here.",
            "I hope so.",
            "Yeah, so this portal is a part of our large global company website.",
            "Which is called I'd be online.com.",
            "Here we have different tools which our company provides to the users.",
            "For example, Finereader Online is here, translations and interpreting and text alignment.",
            "Right now I'm here in the dictionary.",
            "Lincoln Pro is really an online dictionary, so it's very simple to use and users like this portal and call more and more friends to come here.",
            "OK, here we see that there are different options to translate words to find some examples to add your own translations or add groceries.",
            "I will try on English Russian so you see, this is the list of languages which are supported now.",
            "Um, OK.",
            "I can take any word, for example gets it's very rich word just to show you the number of content which we have.",
            "Yeah, here we have dictionary entries coming from abling the universal.",
            "The dictionary created by Abbey Press publishing House and we see different types of spelling.",
            "We may listen to this word in British, British and American variants.",
            "Then I go down, see all the senses, see different examples from dictionary entry.",
            "It's very long article here.",
            "Then I see another dictionary.",
            "It's for learner's dictionary for Russian people who learn English.",
            "It gives some translations and examples also.",
            "Can I get I dums so I have a large list of dictionaries installed here on the portal.",
            "When I got to the end, I see that there is a possibility to check how get will watch translated within Russian entries in another dictionaries so I can just press here and see how the dictionary entry looks like in Russian English direction.",
            "I will come back to this so it's so many examples here, and this part is.",
            "Devoted to what users add, so translations contributed by users, I can see that, for example, this translation was added by.",
            "Do all demands by any user OK and this pop up window is given examples of parallel examples from the corpus.",
            "If I click on any meaning I will see English example and Russian equivalent for this meaning for this appropriate meaning and I can do this for any meaning from here.",
            "Or it will automatically check the corpus and give it on the fly.",
            "Give further examples on the fly.",
            "I can go back to the dictionary and check.",
            "The first meaning to get it's like to have something to you.",
            "And using this tool, first of all, I can see the frequency of each meaning.",
            "Here it says how many examples were found so I can compare.",
            "So this this isn't meaning to buy something, it was less so it's not so much popular than the get the initial meaning, and for each example I can check the source so these are little quotes coming from bilingual texts and hearsay.",
            "I see that it comes from a book from a literature, so it's not like Internet crawler but we collect corpora from different sources.",
            "Um, OK, what can I do here?",
            "I can just look only for examples.",
            "For the word get so it will give all the meanings.",
            "So not only one meaning but all of them.",
            "And here is the huge list of examples found more than 10,000, so that doesn't give the exact number.",
            "Even I can check and how it looks like I can check phrases in which the word get is coming.",
            "OK, get a bill discount at your very good example.",
            "Get the Commission and so so different types of phrases and locations and the default option is to check definitions so as it is English language we support Oxford Dictionaries.",
            "Here we work with Oxford University Press.",
            "We will check the definition from Oxford Dictionary of English.",
            "In OK one more thing I wanted to show it is possible to make advanced searches.",
            "For example bilingual search.",
            "I will switch to German.",
            "And I will try to do translate the word construction.",
            "Guns.",
            "Ruction as of bow.",
            "It will find only those examples where they will.",
            "Word Construction is was translated like our Bow.",
            "OK, I'm going back to my presentation.",
            "And."
        ],
        [
            "So this was the example about bilingual storage and I would like to speak more about this corpus, query system and sophisticated searches.",
            "So we could make different types of searches.",
            "For example this advanced search when I would like to find the verb take plus now plus preposition.",
            "Any noun, any proposition.",
            "It's very simple to make such kind of queries, so it's you don't need to know this query language, you just need to press the buttons and I found take account of something taken in implementation of.",
            "And so on.",
            "So all the phrases of such current will be found.",
            "The second option is morphologist search, so it's Russian.",
            "Example I'm sorry for this, but I would like to find a verb in third person plus the word examination.",
            "And here I found some phrases the examination came.",
            "For examination you will need this and that, so in Russian it will be worked in third person.",
            "And, uh, this model is currently being implemented into the portal we are working on it.",
            "Additionally to this we will insert sophisticated searchers of do not use this word, use only that words search for words.",
            "Which are sent along far away from each other and so on."
        ],
        [
            "Yeah, one more interesting thing which is already there it is Abby aligner.",
            "It is our technologies or which help aligning text to create your own bilingual call prom.",
            "This is a professional tool for making this things to create this bilingual corpora.",
            "The thing is that you already may use it right now on the website.",
            "First of all, it is very easy to use.",
            "It's integrated into Abby online, so it's very close to Lingo Pro.",
            "You may just use it in the same window.",
            "And yeah, I will show how it looks like."
        ],
        [
            "This is a screenshot.",
            "There's a source text and there is a target text.",
            "It takes tests in different languages in two languages and makes the alignment on the website.",
            "It looks in the following way, so I switched to a liner here.",
            "Yeah, it's yeah, it's English.",
            "It's OK so we just upload two documents to some not very long documents just for test and you can try it.",
            "OK, and one more thing which is."
        ],
        [
            "Coming very soon is term extraction.",
            "Uh, it will allow extracting potential terms, both form from bilingual texts and monolingual texts, so it could be very good pool of list of term candidates for creating a dictionary subject or specialized dictionary, so it will be a very nice feature for lexing."
        ],
        [
            "1st and the last one, but of course also very important is collaboration and community options within Lingo Prom.",
            "Now there are forums or on in Russian for our Russian users who constantly add new words to our dictionaries, propose some new terms, or discuss something there.",
            "It is also possible to add translations directly within Lingual prom with the interface, so it's very quick and in future we plan to make dictionary different discussions of dictionary entries.",
            "It's like wiki model, then immediate feedback from the community and question and answering service.",
            "So I just wanted to show.",
            "This is our forum very shortly, so this is the list of words which are constantly proposed by the users, so we need to do to add this on that into your dictionary portal.",
            "And there there are so many topics here for discussion for English language, for German language, for other languages.",
            "So you see, it's very active here in English discussion so.",
            "Yeah.",
            "OK, um I think."
        ],
        [
            "It's time to conclude.",
            "My presentation in my presentation.",
            "I wanted to show you that.",
            "They knew Portal link pro.",
            "It's actually appeared web for only four months ago.",
            "Really it's in you own one workspace for language Resources, which offers dictionary entries and translations from authors, publishers and users.",
            "Large monolingual and bilingual.",
            "Corpora and quiet to the school, prom and other linguistic advanced linguistic tools like.",
            "Alignment and term extraction, and of course very important thing is collaboration and discussion.",
            "Discussions within this portal."
        ],
        [
            "Thank you very much for your attention, and please do you have any questions?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much to everyone and I would like to thank Michael for his wonderful presentation just in the morning today I will continue speaking about online and E lexicography.",
                    "label": 0
                },
                {
                    "sent": "Collaboration between users and lexicographers, and bilingual corpora.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "My paper is devoted to my billing or pro, which is a dictionary portal online portal and it is a single access point for different type of usage for the dictionaries and corpora.",
                    "label": 0
                },
                {
                    "sent": "So you may look up and search in dictionary sources you make will make, acquires and searches in bilingual corpora and monolingual corpora and.",
                    "label": 1
                },
                {
                    "sent": "There is another model of collaboration with dictionary users, and there are so many interesting things like text alignment and term extraction.",
                    "label": 0
                },
                {
                    "sent": "So I will show a step by step each of these features within our software and I will of course show the software itself for the web portal.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, and some background around this product and this project.",
                    "label": 0
                },
                {
                    "sent": "I come from a big company.",
                    "label": 0
                },
                {
                    "sent": "This is a software company and we are concentrated on languages and language technologies.",
                    "label": 0
                },
                {
                    "sent": "We are operating for 20 three years in the market.",
                    "label": 0
                },
                {
                    "sent": "We started with creation electronic dictionary.",
                    "label": 0
                },
                {
                    "sent": "It was that time for DOS and after that we upgraded the dictionary version.",
                    "label": 0
                },
                {
                    "sent": "Today we have a desktop version, mobile versions and online version of Electronic Dictionary Linguam.",
                    "label": 0
                },
                {
                    "sent": "We have several experiences within our company and with our partners and authors in lexicography and language investigations.",
                    "label": 0
                },
                {
                    "sent": "So we see that the typical tasks of lexical lexicographer or language resource are the following.",
                    "label": 0
                },
                {
                    "sent": "I need to identify new words in different subject areas, then identify their meanings.",
                    "label": 1
                },
                {
                    "sent": "Different meanings of this word.",
                    "label": 1
                },
                {
                    "sent": "Compare the usage of this word in different contexts in different meanings.",
                    "label": 1
                },
                {
                    "sent": "Find translations to each meaning or definition.",
                    "label": 0
                },
                {
                    "sent": "Stooge, meaning it really depends and find some locations to this words, word, phrases and other things.",
                    "label": 0
                },
                {
                    "sent": "A right now in our company we have professional users and creators of dictionaries, lexicographers, and linguists.",
                    "label": 0
                },
                {
                    "sent": "First of all, have our subsidiary company, Arbor Press publishing House.",
                    "label": 0
                },
                {
                    "sent": "They are concentrated on publishing dictionaries, general lexicon, dictionaries, pocket sized dictionaries for Russian based English to Russian, German to Russian, and other size.",
                    "label": 0
                },
                {
                    "sent": "Right now there are about 25 in-house lexicographers and round 60 outsources who work together with our publishing house in our software division.",
                    "label": 0
                },
                {
                    "sent": "We have linguists and lexicographers who work in our research and development Department, so there about 100 people working in it and we actively collaborate and work with private authors author groups.",
                    "label": 0
                },
                {
                    "sent": "And editors, so we have different types of users of professional users, users for language resources.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So based on this experience, we created a blink of pro portal.",
                    "label": 0
                },
                {
                    "sent": "The concept of the portal is that it is a complete set of language data and technology tools that used for the following cases.",
                    "label": 1
                },
                {
                    "sent": "So it's a web based linguist and lexicographer Workbench working environment.",
                    "label": 1
                },
                {
                    "sent": "Right now it's also online portal with about 1 1/2 million queries per day, and it's a solution for language resources man.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Edgmont the main features are so it is a set of different language data, dictionaries, text corpora and there is connection to external resources and different tools which help managing.",
                    "label": 1
                },
                {
                    "sent": "Looking through searching through this language data so there are different types of searches.",
                    "label": 0
                },
                {
                    "sent": "Choirs we have a liner for a learning curve.",
                    "label": 0
                },
                {
                    "sent": "For creating bilingual text aligned parallel texts, we have collaboration modeling where the users collaborate with lexicographers.",
                    "label": 1
                },
                {
                    "sent": "People can discuss different words, so suggesting words in song and very soon we are implementing terminology extraction.",
                    "label": 0
                },
                {
                    "sent": "I will tell about this in detail.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK so I will start with dictionaries with the content.",
                    "label": 0
                },
                {
                    "sent": "Right now Lingo Pro supports about 20 language directions.",
                    "label": 1
                },
                {
                    "sent": "English, Russian, English, German, English, French, English, Chinese, Russian, German and vice versa.",
                    "label": 0
                },
                {
                    "sent": "So both sides.",
                    "label": 1
                },
                {
                    "sent": "And the technology is multilingual, so many other languages can be easily added.",
                    "label": 0
                },
                {
                    "sent": "So we're working on this now.",
                    "label": 0
                },
                {
                    "sent": "There are about 1 million entries in the whole set of dictionaries, and the number is growing.",
                    "label": 0
                },
                {
                    "sent": "There are different types of viewing options, so the user which comes from just the web will see the dictionary and some samples, but in very close future we will have access.",
                    "label": 1
                },
                {
                    "sent": "Special access for lexicographers and linguists.",
                    "label": 0
                },
                {
                    "sent": "For them to work.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Within the portal.",
                    "label": 0
                },
                {
                    "sent": "Um, continuing with the text call prom, they are both bilingual and monolingual.",
                    "label": 1
                },
                {
                    "sent": "I will show bilingual corpora today.",
                    "label": 0
                },
                {
                    "sent": "Right now we support more than 10 language directions for the corpora.",
                    "label": 1
                },
                {
                    "sent": "The hugest one is English, Russian, both ways, then we support English, German, English, French, English, Chinese, and the some other language directions and the same as of the technology is multilingual.",
                    "label": 0
                },
                {
                    "sent": "We may add as more languages as it needed.",
                    "label": 0
                },
                {
                    "sent": "Right now it has about 1 billion words.",
                    "label": 0
                },
                {
                    "sent": "And the database is growing, so it's it's living more and more texts are being added constantly and one more very important thing.",
                    "label": 1
                },
                {
                    "sent": "I think that the user might add their own corpora to the system and use it within us.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Your interface.",
                    "label": 0
                },
                {
                    "sent": "We support different types of searches, just simple search in a dictionary, bilingual search, advanced searches, for example, searches of exact phrases, morphology, searches, searches of words in different distance from each other.",
                    "label": 1
                },
                {
                    "sent": "Specify part of speeches and grammar.",
                    "label": 0
                },
                {
                    "sent": "Features match case.",
                    "label": 1
                },
                {
                    "sent": "For example, look for words only in capitalized letters.",
                    "label": 0
                },
                {
                    "sent": "Then fast search will be supported and semantic search.",
                    "label": 0
                },
                {
                    "sent": "Is also coming soon.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, right now I'm switching to the portal.",
                    "label": 0
                },
                {
                    "sent": "I will check if Internet connections here.",
                    "label": 0
                },
                {
                    "sent": "I hope so.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this portal is a part of our large global company website.",
                    "label": 0
                },
                {
                    "sent": "Which is called I'd be online.com.",
                    "label": 0
                },
                {
                    "sent": "Here we have different tools which our company provides to the users.",
                    "label": 0
                },
                {
                    "sent": "For example, Finereader Online is here, translations and interpreting and text alignment.",
                    "label": 0
                },
                {
                    "sent": "Right now I'm here in the dictionary.",
                    "label": 0
                },
                {
                    "sent": "Lincoln Pro is really an online dictionary, so it's very simple to use and users like this portal and call more and more friends to come here.",
                    "label": 0
                },
                {
                    "sent": "OK, here we see that there are different options to translate words to find some examples to add your own translations or add groceries.",
                    "label": 0
                },
                {
                    "sent": "I will try on English Russian so you see, this is the list of languages which are supported now.",
                    "label": 0
                },
                {
                    "sent": "Um, OK.",
                    "label": 0
                },
                {
                    "sent": "I can take any word, for example gets it's very rich word just to show you the number of content which we have.",
                    "label": 0
                },
                {
                    "sent": "Yeah, here we have dictionary entries coming from abling the universal.",
                    "label": 0
                },
                {
                    "sent": "The dictionary created by Abbey Press publishing House and we see different types of spelling.",
                    "label": 0
                },
                {
                    "sent": "We may listen to this word in British, British and American variants.",
                    "label": 0
                },
                {
                    "sent": "Then I go down, see all the senses, see different examples from dictionary entry.",
                    "label": 0
                },
                {
                    "sent": "It's very long article here.",
                    "label": 0
                },
                {
                    "sent": "Then I see another dictionary.",
                    "label": 0
                },
                {
                    "sent": "It's for learner's dictionary for Russian people who learn English.",
                    "label": 0
                },
                {
                    "sent": "It gives some translations and examples also.",
                    "label": 0
                },
                {
                    "sent": "Can I get I dums so I have a large list of dictionaries installed here on the portal.",
                    "label": 0
                },
                {
                    "sent": "When I got to the end, I see that there is a possibility to check how get will watch translated within Russian entries in another dictionaries so I can just press here and see how the dictionary entry looks like in Russian English direction.",
                    "label": 0
                },
                {
                    "sent": "I will come back to this so it's so many examples here, and this part is.",
                    "label": 0
                },
                {
                    "sent": "Devoted to what users add, so translations contributed by users, I can see that, for example, this translation was added by.",
                    "label": 0
                },
                {
                    "sent": "Do all demands by any user OK and this pop up window is given examples of parallel examples from the corpus.",
                    "label": 0
                },
                {
                    "sent": "If I click on any meaning I will see English example and Russian equivalent for this meaning for this appropriate meaning and I can do this for any meaning from here.",
                    "label": 0
                },
                {
                    "sent": "Or it will automatically check the corpus and give it on the fly.",
                    "label": 0
                },
                {
                    "sent": "Give further examples on the fly.",
                    "label": 0
                },
                {
                    "sent": "I can go back to the dictionary and check.",
                    "label": 0
                },
                {
                    "sent": "The first meaning to get it's like to have something to you.",
                    "label": 0
                },
                {
                    "sent": "And using this tool, first of all, I can see the frequency of each meaning.",
                    "label": 0
                },
                {
                    "sent": "Here it says how many examples were found so I can compare.",
                    "label": 0
                },
                {
                    "sent": "So this this isn't meaning to buy something, it was less so it's not so much popular than the get the initial meaning, and for each example I can check the source so these are little quotes coming from bilingual texts and hearsay.",
                    "label": 0
                },
                {
                    "sent": "I see that it comes from a book from a literature, so it's not like Internet crawler but we collect corpora from different sources.",
                    "label": 0
                },
                {
                    "sent": "Um, OK, what can I do here?",
                    "label": 0
                },
                {
                    "sent": "I can just look only for examples.",
                    "label": 0
                },
                {
                    "sent": "For the word get so it will give all the meanings.",
                    "label": 0
                },
                {
                    "sent": "So not only one meaning but all of them.",
                    "label": 0
                },
                {
                    "sent": "And here is the huge list of examples found more than 10,000, so that doesn't give the exact number.",
                    "label": 0
                },
                {
                    "sent": "Even I can check and how it looks like I can check phrases in which the word get is coming.",
                    "label": 0
                },
                {
                    "sent": "OK, get a bill discount at your very good example.",
                    "label": 0
                },
                {
                    "sent": "Get the Commission and so so different types of phrases and locations and the default option is to check definitions so as it is English language we support Oxford Dictionaries.",
                    "label": 0
                },
                {
                    "sent": "Here we work with Oxford University Press.",
                    "label": 0
                },
                {
                    "sent": "We will check the definition from Oxford Dictionary of English.",
                    "label": 0
                },
                {
                    "sent": "In OK one more thing I wanted to show it is possible to make advanced searches.",
                    "label": 0
                },
                {
                    "sent": "For example bilingual search.",
                    "label": 0
                },
                {
                    "sent": "I will switch to German.",
                    "label": 0
                },
                {
                    "sent": "And I will try to do translate the word construction.",
                    "label": 0
                },
                {
                    "sent": "Guns.",
                    "label": 0
                },
                {
                    "sent": "Ruction as of bow.",
                    "label": 0
                },
                {
                    "sent": "It will find only those examples where they will.",
                    "label": 0
                },
                {
                    "sent": "Word Construction is was translated like our Bow.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm going back to my presentation.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this was the example about bilingual storage and I would like to speak more about this corpus, query system and sophisticated searches.",
                    "label": 1
                },
                {
                    "sent": "So we could make different types of searches.",
                    "label": 0
                },
                {
                    "sent": "For example this advanced search when I would like to find the verb take plus now plus preposition.",
                    "label": 0
                },
                {
                    "sent": "Any noun, any proposition.",
                    "label": 0
                },
                {
                    "sent": "It's very simple to make such kind of queries, so it's you don't need to know this query language, you just need to press the buttons and I found take account of something taken in implementation of.",
                    "label": 0
                },
                {
                    "sent": "And so on.",
                    "label": 0
                },
                {
                    "sent": "So all the phrases of such current will be found.",
                    "label": 0
                },
                {
                    "sent": "The second option is morphologist search, so it's Russian.",
                    "label": 0
                },
                {
                    "sent": "Example I'm sorry for this, but I would like to find a verb in third person plus the word examination.",
                    "label": 0
                },
                {
                    "sent": "And here I found some phrases the examination came.",
                    "label": 0
                },
                {
                    "sent": "For examination you will need this and that, so in Russian it will be worked in third person.",
                    "label": 0
                },
                {
                    "sent": "And, uh, this model is currently being implemented into the portal we are working on it.",
                    "label": 0
                },
                {
                    "sent": "Additionally to this we will insert sophisticated searchers of do not use this word, use only that words search for words.",
                    "label": 0
                },
                {
                    "sent": "Which are sent along far away from each other and so on.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, one more interesting thing which is already there it is Abby aligner.",
                    "label": 0
                },
                {
                    "sent": "It is our technologies or which help aligning text to create your own bilingual call prom.",
                    "label": 0
                },
                {
                    "sent": "This is a professional tool for making this things to create this bilingual corpora.",
                    "label": 1
                },
                {
                    "sent": "The thing is that you already may use it right now on the website.",
                    "label": 1
                },
                {
                    "sent": "First of all, it is very easy to use.",
                    "label": 0
                },
                {
                    "sent": "It's integrated into Abby online, so it's very close to Lingo Pro.",
                    "label": 0
                },
                {
                    "sent": "You may just use it in the same window.",
                    "label": 0
                },
                {
                    "sent": "And yeah, I will show how it looks like.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is a screenshot.",
                    "label": 0
                },
                {
                    "sent": "There's a source text and there is a target text.",
                    "label": 0
                },
                {
                    "sent": "It takes tests in different languages in two languages and makes the alignment on the website.",
                    "label": 0
                },
                {
                    "sent": "It looks in the following way, so I switched to a liner here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's yeah, it's English.",
                    "label": 0
                },
                {
                    "sent": "It's OK so we just upload two documents to some not very long documents just for test and you can try it.",
                    "label": 0
                },
                {
                    "sent": "OK, and one more thing which is.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Coming very soon is term extraction.",
                    "label": 0
                },
                {
                    "sent": "Uh, it will allow extracting potential terms, both form from bilingual texts and monolingual texts, so it could be very good pool of list of term candidates for creating a dictionary subject or specialized dictionary, so it will be a very nice feature for lexing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st and the last one, but of course also very important is collaboration and community options within Lingo Prom.",
                    "label": 0
                },
                {
                    "sent": "Now there are forums or on in Russian for our Russian users who constantly add new words to our dictionaries, propose some new terms, or discuss something there.",
                    "label": 0
                },
                {
                    "sent": "It is also possible to add translations directly within Lingual prom with the interface, so it's very quick and in future we plan to make dictionary different discussions of dictionary entries.",
                    "label": 1
                },
                {
                    "sent": "It's like wiki model, then immediate feedback from the community and question and answering service.",
                    "label": 0
                },
                {
                    "sent": "So I just wanted to show.",
                    "label": 0
                },
                {
                    "sent": "This is our forum very shortly, so this is the list of words which are constantly proposed by the users, so we need to do to add this on that into your dictionary portal.",
                    "label": 0
                },
                {
                    "sent": "And there there are so many topics here for discussion for English language, for German language, for other languages.",
                    "label": 0
                },
                {
                    "sent": "So you see, it's very active here in English discussion so.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "OK, um I think.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's time to conclude.",
                    "label": 0
                },
                {
                    "sent": "My presentation in my presentation.",
                    "label": 0
                },
                {
                    "sent": "I wanted to show you that.",
                    "label": 0
                },
                {
                    "sent": "They knew Portal link pro.",
                    "label": 0
                },
                {
                    "sent": "It's actually appeared web for only four months ago.",
                    "label": 0
                },
                {
                    "sent": "Really it's in you own one workspace for language Resources, which offers dictionary entries and translations from authors, publishers and users.",
                    "label": 1
                },
                {
                    "sent": "Large monolingual and bilingual.",
                    "label": 1
                },
                {
                    "sent": "Corpora and quiet to the school, prom and other linguistic advanced linguistic tools like.",
                    "label": 0
                },
                {
                    "sent": "Alignment and term extraction, and of course very important thing is collaboration and discussion.",
                    "label": 0
                },
                {
                    "sent": "Discussions within this portal.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you very much for your attention, and please do you have any questions?",
                    "label": 0
                }
            ]
        }
    }
}