{
    "id": "tdautjozisbrglmwnvwvctkkjxnk2o4q",
    "title": "Possible futures",
    "info": {
        "author": [
            "Jan Boelen, Z33 House for Contemporary Art"
        ],
        "published": "Dec. 24, 2014",
        "recorded": "December 2014",
        "category": [
            "Top->Architecture",
            "Top->Arts->Visual Arts->Design->Graphic Design",
            "Top->Arts->Visual Arts->Design->Industrial Design"
        ]
    },
    "url": "http://videolectures.net/bio2014_boelen_possible_futures/",
    "segmentation": [
        [
            "I will give another perspective, a perspective about the changing nature of design.",
            "And but there are many links with what we heard before.",
            "How would that technology slash engineering sustainability on the level of the planet?",
            "And also how that we interpret maybe profit and economic values may be different in the future.",
            "So I see a lot of parallel, although there may be on a kind of metal."
        ],
        [
            "Level.",
            "So if you're talking about design, we should know that design is in flux.",
            "Design is not a kind of definition that was over is there from 100 years every year in fact, and especially the last 2030 years.",
            "Design is in flux because the world is."
        ],
        [
            "Changing you could see that already, like maybe 10 years ago.",
            "Critical Design was founded an."
        ],
        [
            "Effect if you looked very good also to what nano tourism was using as a kind of definition of what tourism could be, you can apply this on a lot of topics in it's more kind of attitude on your left side you see a traditional interpretation of design, which is still valuable, so it's not that this interpretation of design is not making.",
            "It's not there anymore, but there are other forms how that design can be interpreted.",
            "Design can be critical, it can be instead of solving problems, it can also be problem finding it is maybe not only about users anymore, or customers.",
            "It's maybe also about persons, it's about implications.",
            "It is there to create fictions.",
            "Sometimes to understand scenarios or future possibilities."
        ],
        [
            "I don't go into detail of all the all the proposals but Dunne and Raby are like two key figures at the Royal College of Art who are instigating this debate around critical design.",
            "They are not the only one."
        ],
        [
            "I think also Rihanna marking was one of the mentors in affordable living, and Jurgen Bey are in the Netherlands with studio marking Bay, the.",
            "Main players there around critical design and in fact showing that attitude.",
            "This is a dustbin.",
            "Back piece of furniture piece that is using the dust as a kind of.",
            "A piece of furniture that is producing itself.",
            "It started with the research a research on how that furniture industry could infect.",
            "Use the leftovers and they saw that the leftovers in the furniture industry was where most of the time was the dust.",
            "So why not using instead of always using the leftovers?",
            "The pieces using the dust of the sewing.",
            "Of the wood itself as a material to construct, and then later on maybe just do it at home.",
            "Make your own piece of furniture by vacuum cleaning your living room."
        ],
        [
            "A car mirror by Marta Guichet.",
            "I don't go into."
        ],
        [
            "All the details design is not only a kind of statement or becoming critical, it is also becoming performative.",
            "So technology like was mentioned before, technology has huge impact.",
            "That means that we are talking nowadays, not anymore, about products only.",
            "We see them as a platform.",
            "We talk about product as a hub or iPhone becomes a platform where all kind of applications.",
            "Are allowed are qualified to be put on and that means that every platform, every product that you have is are made by collaborative process of all people that are participating in debt and you allow on your platform what you want or what you need."
        ],
        [
            "So the product is not anymore just there as an object, it becomes an act.",
            "It's a performance.",
            "It's also relating interaction with the space with an audience.",
            "It's continuously in flux, it's changing, and it is also there is also a lot of randomness in and designers are not.",
            "Completely in control produces or.",
            "Manufacturers are not completely under control of their own products because they just launch like these platforms which can be filled in by cost customers.",
            "But they also can be used and abused by the people by the customers that become infected.",
            "Better users."
        ],
        [
            "So we design performances.",
            "We make perform objects with even the machines or the production system itself becomes a kind of performing machine and the space itself, where things are will be projected become performing spaces."
        ],
        [
            "This is not, and this is maybe a funny example, but this is not only happening nowadays, true technology.",
            "It's an attitude that designers already had for longer times.",
            "This is a reenactment of Bruno Munari's seeking comfort in an uncomfortable chair, and I see you all trying to set comfort rible on these chairs, so you're also performing here.",
            "In front of me and I in front of you."
        ],
        [
            "Um, I don't.",
            "I won't show all the examples, but."
        ],
        [
            "What is what is really happening is that the roles the models of manufacturing producing, designing, consuming that is changing and there we have new relations that are occurring mainly through again through technology."
        ],
        [
            "Technology which is not only implanting on objects and machines but is also having impact on nature and.",
            "To understand how that nature is changing and we go to a next nature and Alton nature of future or past nature."
        ],
        [
            "That is something what is going on.",
            "Also not for now and which is not recent or not, only by.",
            "Just technological development.",
            "We are in fact designing nature already for ages.",
            "This is an example.",
            "The Carrot William of Orange King.",
            "Had a law where that the orange carrot could be the only one that could be sold on the market, so we eat today.",
            "Mainly orange carrots so we natural selected we cultivated.",
            "We designed the nature and we only have mainly the orange carrot."
        ],
        [
            "So what we do in fact this and then you see really the changing role of design itself.",
            "We still will have.",
            "Need to understand how that science is functioning in order to design so we still need to have that knowledge, but what is happening now is you need need to design in order to understand science and what is possible to create for the engineers.",
            "For scientists possibilities to see what they can do with the solutions they have.",
            "To come up with problems that can be applied to everyday life."
        ],
        [
            "If I give you an example, this is an example of tiles, and the tiles are it's done by Allison Kudla.",
            "It's growth pattern there are bacteria are on the tiles and it's done together with the scientists, and they grow and they change.",
            "So the pattern is done by living material."
        ],
        [
            "Or another one is a two different balance is in Belgian designer also related to the Royal College of Art Beyond?",
            "Or is the project and there he was changing the bacteria in the germs?",
            "And where that the pigeon could produce instead of poo that it could produce soap.",
            "So at that moment the pigeons start to clean the city.",
            "And to change our environment but also change our relation with nature itself.",
            "That moment we don't want to get rid of these pigeons, but we want to embrace them.",
            "We will take them on our holiday.",
            "They will come into our house.",
            "But this is really what is happening now and at the Imperial College in London, scientists are working on how can we change the bacteria?",
            "How can we change the bacteria that makes us digest food, but it's in envisioned by designers to show how that reality can change and what kind of impact design can have on every day."
        ],
        [
            "So design itself is developing new performative, but also pragmatic, process orientated.",
            "Open ended process is and it's completely different than just there as a product with a with an end.",
            "It has an open end.",
            "It is going on, it becomes, the product, becomes a process and so on."
        ],
        [
            "So in fact what we are doing, it's not copying our.",
            "We are not just as designers integrating.",
            "Software in products we are not making just product smarter.",
            "We are bringing the thinking and the philosophy of how that we deal with software into the world of hardware.",
            "So we are shifting also the way we work out that we create.",
            "For instance software, how that in different parts of the world we are developping.",
            "For instance modules of software, how that?",
            "That is open open source, exchanged by people there.",
            "Also designers in the future of hardware will start using these kind of collaborative open methods and ways of working together."
        ],
        [
            "So this is what is going to happen happen.",
            "I think I'm quite sure and that is more or less that fourth industrial revolution or a new industrial revolution and where that.",
            "Uh, the big change will happen."
        ],
        [
            "One of the projects that made me aware of that most was the open Structures project of Thomas Lomay.",
            "He gave a brilliant presentation in the beginning I on the kickoff of the biannual."
        ],
        [
            "And there with this drawing you see exactly what is going to shift.",
            "That means this left side is the traditional model.",
            "The top down model and.",
            "On the right side you see that in the middle there is a kind of code language that we try to speak where we try to find the common ground to exchange, and then you have the different people that can be the customer, the manufacturer, the designer, different designers, but maybe also scientists come together and start to collaborate together around a certain topic object process and so on."
        ],
        [
            "And he created another thing, and that is in the middle kind of open grid grid like.",
            "Open, make a note alego to connect stuff."
        ],
        [
            "Together and became his open structures project."
        ],
        [
            "Where you have different parts."
        ],
        [
            "That you connect into, for instance, a bike and bike."
        ],
        [
            "Become a kitchen and the kitchen can become a house.",
            "You can re assemble it.",
            "You can take it out of each other and you can start to reuse it.",
            "So we get rid of the closed systems that are there today and where you start.",
            "Start combining things and then you get companies like local motor that are able to to go into decentralized production because this is what will happen.",
            "Everywhere smaller companies start to produce parts of finished products and they start to collaborate together to create products that will be produced locally and used locally with different parts.",
            "But in an international."
        ],
        [
            "Network."
        ],
        [
            "So this is something we researched in the machine designing new Revolution Industrial revolution."
        ],
        [
            "Where that designers are reappropriating several things, materials, tools and also systems.",
            "If Marco was saying the engineer will be on the forefront, I have of course saying that the designer will be in the forefront of that new industrial revolution.",
            "But maybe they will join forces.",
            "And I think that that will be the key so.",
            "Our hair is carattini.",
            "You can add that with some chemicals and you can produce a bioplastic out of it.",
            "You can look into your body and you produce yourself electricity and you can charge your phone.",
            "Why not?"
        ],
        [
            "Systems making the the tools are producing itself and reproducing itself, and are open source in RF."
        ],
        [
            "Sailable, but also more complex systems with complex shapes due to the development in materials can be can go back to the designer if this would be done nowadays still in a in an industrial traditional production facility that would demand a high capital invest investment, but.",
            "By the knowledge and the sharing of knowledge you can start making very complex shapes of plastic bioplastics yourself nowadays."
        ],
        [
            "So.",
            "It's like the technology is changing, but also the due dates, the internal human relation.",
            "Let's say the technology, but on one side but on the other side the peoples the capital of the people and also their things are shifting mainly again true."
        ],
        [
            "Technology, and so I called that social design with a question mark because we don't know yet what that's really could mean and how that could make new connections.",
            "So it's not only about products anymore and this is the work of Eugenia Morpurgo, who also was in the fashion system where that the exchange of parts becomes a kind of dialogue between people.",
            "It's not just selling.",
            "Apart, but it's a negotiation.",
            "She developed a new shoe shoe that started from the the observation that we have mainly plastic soles and that these plastic soles cannot be repaired and that the plastic soles are make that we throw away our shoes.",
            "But the moment that you see the shoe and again we are using the word platform, the soul is a platform that you can build.",
            "On that issue with different designers that you exchange that you could get very easily and very fast collection and everybody can using the material that is around him, you print it.",
            "You cut it S you want and you get a whole different approach of how that you maybe can brand this and share it and sell it."
        ],
        [
            "Another one I'm not going into detail was one of the mentors of the end."
        ],
        [
            "Blocks addressing environmental issues of."
        ],
        [
            "Course I don't go into."
        ],
        [
            "All the details now.",
            "So what I want to say, in fact it's not about the world of design itself, and I'm saying that quite often."
        ],
        [
            "But it's about designing the world and life and society, so it's shifting in.",
            "Also, in these BI annuals the focus from design and design object to the world to life to society and the consequences the implications because then we are really creating a kind of sustainability."
        ],
        [
            "And another way to putting it is paraphrasing Cedric Price."
        ],
        [
            "And he is choosing that with architecture.",
            "If design is the answer, what was the question again?"
        ],
        [
            "So what we're doing continuously is, and that's the trap we are in, and that's typical for crisis.",
            "Moments of crisis is that we try to try to reuse or to recycle the problems we have now with 28 medicines with the medicines of the 20th century.",
            "But we have to answer them completely different in the 21st century.",
            "Because the problems are really different there, I have another complexity.",
            "They have another nature, so we have to address them differently.",
            "We cannot just keep on going what we already did and we have to re question it."
        ],
        [
            "One of the things is, and it's also the issue with design itself is property authorship.",
            "The ego of the designer was already addressed here.",
            "Authorship is fundamentally changing ownership.",
            "What is from me we did with BYOE alot of things on Facebook on Skype on Google Hangout so we posted their enormous amounts of research.",
            "But who's infector owner?",
            "Is that the one who put it on?",
            "Is IT company?",
            "Is it the data center where it's in somewhere in a server who's the owner of this?",
            "So addressing these kind of issues will become a topic for the future and also to go to that 4th Fourth Industrial Revolution to solve the issue that there is not one person involved anymore or not one company, but always like a lot.",
            "Of companies and people will be involved around topics.",
            "So that becomes very hybrid.",
            "It become fake.",
            "We don't know yet how that we deal with it."
        ],
        [
            "This was addressed in a little present."
        ],
        [
            "Asian man, I just show you.",
            "Of course you this isn't the open Structures project here of Thomas Lemay there it is addressed.",
            "But mainly the theory is in the peer to peer foundation.",
            "You can find that is in a very interesting.",
            "Way of thinking about how we can reorganize our SoC or everything can be decentralized but connected in other ways.",
            "And how that we can embrace diversity and connect it.",
            "An act in networks and organize not only our economy but also maybe our policy in completely different ways and how that you can create platforms to.",
            "Enabled that they have a very good interesting Wikipedia, and of course I have to say there is.",
            "There's a Belgian guy who is the founder of debt, so I'm also a little bit proud of that.",
            "It's Michelle Bowens, anusa, super interesting.",
            "Theoretician who is dealing with that."
        ],
        [
            "It's not only how that.",
            "We as designers are addressing our.",
            "We will have to address the issue of property out authorship and.",
            "Ownership itself, but also how that we deal with limited resources, and this is not only material as a as a resource in itself.",
            "It is also like I think Stanage was giving a very interesting example how that systems or laws are sometimes limiting.",
            "Other evolution, so we create a society continuously.",
            "Limits we implement standards, laws and norms and they create an enormous.",
            "Dillett in acting and reacting.",
            "We think that everybody to give them a diploma.",
            "Out of school, infected and then protecting a profession like design, which is probably what every designer would like that his profession is really protected completely and that he only can be a designer.",
            "This is in fact kind of problem.",
            "So then we create scarcity.",
            "What would happen if everybody could participate in process is and things?",
            "Stay open."
        ],
        [
            "So recycling, reusing, substituting, imitating, repairing, protecting, cooperating, informing these are kind of strategies that designers are continuously using, and the tree as human beings all use every day again to overcome scarcity.",
            "If Stein each was talking about desire and need, there we society.",
            "As individuals, we continuously address these.",
            "These needs and desires with these."
        ],
        [
            "Find strategies I don't go in."
        ],
        [
            "To detail, but what I want to say is that."
        ],
        [
            "The what I hope is that true.",
            "The things what I heard before and what we are.",
            "Doing ordets inbio that we hopefully connected technology.",
            "Know how people the planet sustainability and culture again in a new way and that maybe these platforms that we temporarily platforms that were the teams and groups created a possible future.",
            "I think the next step or 4B O will be to re evaluate it a little bit.",
            "I'm was really, positively and now we come to a first kind of roundup of this morning and I hope we can use that as a kind of introduction for this afternoon, is that?",
            "Maybe to go on with this kind of platforms where that's?",
            "That could end in a biannual, like every two years of presentation could.",
            "Catalyze and stimulate the Slovenian design fields, where the local international collaboration and everyday topics could stay the core, where maybe with mid term juries or a kind of school.",
            "Um format.",
            "It could work where that designers will be more challenged and not be state under challenged just by creating a product, but that they are have to deal with complex issues where they have the opportunity to reformulate the design brief to question and I refer to hide in item was asking what is the right question.",
            "And where that the designers also take an active role, and I'm now paraphrasing Ileana an active role and doesn't wait to the government as an individual.",
            "And where the data could be gathered as a kind of basis for that larger.",
            "Maybe policy in itself where that.",
            "We define better what are the different benefits where the personal meeting stays in the middle.",
            "And we don't only Skype or only Facebook with each other.",
            "Where that we try that, designers become makers and makers become designers but then step back in the role as designer and Maker because that was where they were good in.",
            "But they learned from each other where we question what are the borders of design and where it becomes something else.",
            "And also not just doing things in itself and that we enter a new fields that we don't keep up with making just the traditional fields that we know as the industrial products, but that we maybe go into really science and other technologies and that we dare to.",
            "Maybe also in a future bio try to come up with different methods of matchmaking.",
            "Rather than the one that we used now at this moment, so I hope this this inspired me this morning and I hope that this afternoon also will inspire us ourselves to look forward.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I will give another perspective, a perspective about the changing nature of design.",
                    "label": 0
                },
                {
                    "sent": "And but there are many links with what we heard before.",
                    "label": 0
                },
                {
                    "sent": "How would that technology slash engineering sustainability on the level of the planet?",
                    "label": 0
                },
                {
                    "sent": "And also how that we interpret maybe profit and economic values may be different in the future.",
                    "label": 0
                },
                {
                    "sent": "So I see a lot of parallel, although there may be on a kind of metal.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Level.",
                    "label": 0
                },
                {
                    "sent": "So if you're talking about design, we should know that design is in flux.",
                    "label": 0
                },
                {
                    "sent": "Design is not a kind of definition that was over is there from 100 years every year in fact, and especially the last 2030 years.",
                    "label": 0
                },
                {
                    "sent": "Design is in flux because the world is.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Changing you could see that already, like maybe 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "Critical Design was founded an.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Effect if you looked very good also to what nano tourism was using as a kind of definition of what tourism could be, you can apply this on a lot of topics in it's more kind of attitude on your left side you see a traditional interpretation of design, which is still valuable, so it's not that this interpretation of design is not making.",
                    "label": 0
                },
                {
                    "sent": "It's not there anymore, but there are other forms how that design can be interpreted.",
                    "label": 0
                },
                {
                    "sent": "Design can be critical, it can be instead of solving problems, it can also be problem finding it is maybe not only about users anymore, or customers.",
                    "label": 1
                },
                {
                    "sent": "It's maybe also about persons, it's about implications.",
                    "label": 0
                },
                {
                    "sent": "It is there to create fictions.",
                    "label": 1
                },
                {
                    "sent": "Sometimes to understand scenarios or future possibilities.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't go into detail of all the all the proposals but Dunne and Raby are like two key figures at the Royal College of Art who are instigating this debate around critical design.",
                    "label": 0
                },
                {
                    "sent": "They are not the only one.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think also Rihanna marking was one of the mentors in affordable living, and Jurgen Bey are in the Netherlands with studio marking Bay, the.",
                    "label": 0
                },
                {
                    "sent": "Main players there around critical design and in fact showing that attitude.",
                    "label": 1
                },
                {
                    "sent": "This is a dustbin.",
                    "label": 0
                },
                {
                    "sent": "Back piece of furniture piece that is using the dust as a kind of.",
                    "label": 0
                },
                {
                    "sent": "A piece of furniture that is producing itself.",
                    "label": 0
                },
                {
                    "sent": "It started with the research a research on how that furniture industry could infect.",
                    "label": 0
                },
                {
                    "sent": "Use the leftovers and they saw that the leftovers in the furniture industry was where most of the time was the dust.",
                    "label": 0
                },
                {
                    "sent": "So why not using instead of always using the leftovers?",
                    "label": 0
                },
                {
                    "sent": "The pieces using the dust of the sewing.",
                    "label": 0
                },
                {
                    "sent": "Of the wood itself as a material to construct, and then later on maybe just do it at home.",
                    "label": 0
                },
                {
                    "sent": "Make your own piece of furniture by vacuum cleaning your living room.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A car mirror by Marta Guichet.",
                    "label": 0
                },
                {
                    "sent": "I don't go into.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All the details design is not only a kind of statement or becoming critical, it is also becoming performative.",
                    "label": 0
                },
                {
                    "sent": "So technology like was mentioned before, technology has huge impact.",
                    "label": 0
                },
                {
                    "sent": "That means that we are talking nowadays, not anymore, about products only.",
                    "label": 0
                },
                {
                    "sent": "We see them as a platform.",
                    "label": 0
                },
                {
                    "sent": "We talk about product as a hub or iPhone becomes a platform where all kind of applications.",
                    "label": 0
                },
                {
                    "sent": "Are allowed are qualified to be put on and that means that every platform, every product that you have is are made by collaborative process of all people that are participating in debt and you allow on your platform what you want or what you need.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the product is not anymore just there as an object, it becomes an act.",
                    "label": 0
                },
                {
                    "sent": "It's a performance.",
                    "label": 0
                },
                {
                    "sent": "It's also relating interaction with the space with an audience.",
                    "label": 0
                },
                {
                    "sent": "It's continuously in flux, it's changing, and it is also there is also a lot of randomness in and designers are not.",
                    "label": 0
                },
                {
                    "sent": "Completely in control produces or.",
                    "label": 0
                },
                {
                    "sent": "Manufacturers are not completely under control of their own products because they just launch like these platforms which can be filled in by cost customers.",
                    "label": 0
                },
                {
                    "sent": "But they also can be used and abused by the people by the customers that become infected.",
                    "label": 0
                },
                {
                    "sent": "Better users.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we design performances.",
                    "label": 0
                },
                {
                    "sent": "We make perform objects with even the machines or the production system itself becomes a kind of performing machine and the space itself, where things are will be projected become performing spaces.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is not, and this is maybe a funny example, but this is not only happening nowadays, true technology.",
                    "label": 0
                },
                {
                    "sent": "It's an attitude that designers already had for longer times.",
                    "label": 0
                },
                {
                    "sent": "This is a reenactment of Bruno Munari's seeking comfort in an uncomfortable chair, and I see you all trying to set comfort rible on these chairs, so you're also performing here.",
                    "label": 1
                },
                {
                    "sent": "In front of me and I in front of you.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um, I don't.",
                    "label": 0
                },
                {
                    "sent": "I won't show all the examples, but.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is what is really happening is that the roles the models of manufacturing producing, designing, consuming that is changing and there we have new relations that are occurring mainly through again through technology.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology which is not only implanting on objects and machines but is also having impact on nature and.",
                    "label": 0
                },
                {
                    "sent": "To understand how that nature is changing and we go to a next nature and Alton nature of future or past nature.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That is something what is going on.",
                    "label": 0
                },
                {
                    "sent": "Also not for now and which is not recent or not, only by.",
                    "label": 0
                },
                {
                    "sent": "Just technological development.",
                    "label": 0
                },
                {
                    "sent": "We are in fact designing nature already for ages.",
                    "label": 0
                },
                {
                    "sent": "This is an example.",
                    "label": 0
                },
                {
                    "sent": "The Carrot William of Orange King.",
                    "label": 0
                },
                {
                    "sent": "Had a law where that the orange carrot could be the only one that could be sold on the market, so we eat today.",
                    "label": 0
                },
                {
                    "sent": "Mainly orange carrots so we natural selected we cultivated.",
                    "label": 0
                },
                {
                    "sent": "We designed the nature and we only have mainly the orange carrot.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we do in fact this and then you see really the changing role of design itself.",
                    "label": 0
                },
                {
                    "sent": "We still will have.",
                    "label": 0
                },
                {
                    "sent": "Need to understand how that science is functioning in order to design so we still need to have that knowledge, but what is happening now is you need need to design in order to understand science and what is possible to create for the engineers.",
                    "label": 1
                },
                {
                    "sent": "For scientists possibilities to see what they can do with the solutions they have.",
                    "label": 0
                },
                {
                    "sent": "To come up with problems that can be applied to everyday life.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If I give you an example, this is an example of tiles, and the tiles are it's done by Allison Kudla.",
                    "label": 1
                },
                {
                    "sent": "It's growth pattern there are bacteria are on the tiles and it's done together with the scientists, and they grow and they change.",
                    "label": 0
                },
                {
                    "sent": "So the pattern is done by living material.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or another one is a two different balance is in Belgian designer also related to the Royal College of Art Beyond?",
                    "label": 0
                },
                {
                    "sent": "Or is the project and there he was changing the bacteria in the germs?",
                    "label": 0
                },
                {
                    "sent": "And where that the pigeon could produce instead of poo that it could produce soap.",
                    "label": 0
                },
                {
                    "sent": "So at that moment the pigeons start to clean the city.",
                    "label": 0
                },
                {
                    "sent": "And to change our environment but also change our relation with nature itself.",
                    "label": 0
                },
                {
                    "sent": "That moment we don't want to get rid of these pigeons, but we want to embrace them.",
                    "label": 0
                },
                {
                    "sent": "We will take them on our holiday.",
                    "label": 0
                },
                {
                    "sent": "They will come into our house.",
                    "label": 0
                },
                {
                    "sent": "But this is really what is happening now and at the Imperial College in London, scientists are working on how can we change the bacteria?",
                    "label": 0
                },
                {
                    "sent": "How can we change the bacteria that makes us digest food, but it's in envisioned by designers to show how that reality can change and what kind of impact design can have on every day.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So design itself is developing new performative, but also pragmatic, process orientated.",
                    "label": 1
                },
                {
                    "sent": "Open ended process is and it's completely different than just there as a product with a with an end.",
                    "label": 0
                },
                {
                    "sent": "It has an open end.",
                    "label": 0
                },
                {
                    "sent": "It is going on, it becomes, the product, becomes a process and so on.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in fact what we are doing, it's not copying our.",
                    "label": 0
                },
                {
                    "sent": "We are not just as designers integrating.",
                    "label": 0
                },
                {
                    "sent": "Software in products we are not making just product smarter.",
                    "label": 1
                },
                {
                    "sent": "We are bringing the thinking and the philosophy of how that we deal with software into the world of hardware.",
                    "label": 0
                },
                {
                    "sent": "So we are shifting also the way we work out that we create.",
                    "label": 0
                },
                {
                    "sent": "For instance software, how that in different parts of the world we are developping.",
                    "label": 0
                },
                {
                    "sent": "For instance modules of software, how that?",
                    "label": 0
                },
                {
                    "sent": "That is open open source, exchanged by people there.",
                    "label": 0
                },
                {
                    "sent": "Also designers in the future of hardware will start using these kind of collaborative open methods and ways of working together.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is what is going to happen happen.",
                    "label": 0
                },
                {
                    "sent": "I think I'm quite sure and that is more or less that fourth industrial revolution or a new industrial revolution and where that.",
                    "label": 0
                },
                {
                    "sent": "Uh, the big change will happen.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the projects that made me aware of that most was the open Structures project of Thomas Lomay.",
                    "label": 0
                },
                {
                    "sent": "He gave a brilliant presentation in the beginning I on the kickoff of the biannual.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there with this drawing you see exactly what is going to shift.",
                    "label": 0
                },
                {
                    "sent": "That means this left side is the traditional model.",
                    "label": 0
                },
                {
                    "sent": "The top down model and.",
                    "label": 0
                },
                {
                    "sent": "On the right side you see that in the middle there is a kind of code language that we try to speak where we try to find the common ground to exchange, and then you have the different people that can be the customer, the manufacturer, the designer, different designers, but maybe also scientists come together and start to collaborate together around a certain topic object process and so on.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he created another thing, and that is in the middle kind of open grid grid like.",
                    "label": 0
                },
                {
                    "sent": "Open, make a note alego to connect stuff.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Together and became his open structures project.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where you have different parts.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That you connect into, for instance, a bike and bike.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Become a kitchen and the kitchen can become a house.",
                    "label": 0
                },
                {
                    "sent": "You can re assemble it.",
                    "label": 0
                },
                {
                    "sent": "You can take it out of each other and you can start to reuse it.",
                    "label": 0
                },
                {
                    "sent": "So we get rid of the closed systems that are there today and where you start.",
                    "label": 0
                },
                {
                    "sent": "Start combining things and then you get companies like local motor that are able to to go into decentralized production because this is what will happen.",
                    "label": 0
                },
                {
                    "sent": "Everywhere smaller companies start to produce parts of finished products and they start to collaborate together to create products that will be produced locally and used locally with different parts.",
                    "label": 0
                },
                {
                    "sent": "But in an international.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Network.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this is something we researched in the machine designing new Revolution Industrial revolution.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where that designers are reappropriating several things, materials, tools and also systems.",
                    "label": 0
                },
                {
                    "sent": "If Marco was saying the engineer will be on the forefront, I have of course saying that the designer will be in the forefront of that new industrial revolution.",
                    "label": 0
                },
                {
                    "sent": "But maybe they will join forces.",
                    "label": 0
                },
                {
                    "sent": "And I think that that will be the key so.",
                    "label": 0
                },
                {
                    "sent": "Our hair is carattini.",
                    "label": 0
                },
                {
                    "sent": "You can add that with some chemicals and you can produce a bioplastic out of it.",
                    "label": 0
                },
                {
                    "sent": "You can look into your body and you produce yourself electricity and you can charge your phone.",
                    "label": 0
                },
                {
                    "sent": "Why not?",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Systems making the the tools are producing itself and reproducing itself, and are open source in RF.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sailable, but also more complex systems with complex shapes due to the development in materials can be can go back to the designer if this would be done nowadays still in a in an industrial traditional production facility that would demand a high capital invest investment, but.",
                    "label": 0
                },
                {
                    "sent": "By the knowledge and the sharing of knowledge you can start making very complex shapes of plastic bioplastics yourself nowadays.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It's like the technology is changing, but also the due dates, the internal human relation.",
                    "label": 0
                },
                {
                    "sent": "Let's say the technology, but on one side but on the other side the peoples the capital of the people and also their things are shifting mainly again true.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Technology, and so I called that social design with a question mark because we don't know yet what that's really could mean and how that could make new connections.",
                    "label": 0
                },
                {
                    "sent": "So it's not only about products anymore and this is the work of Eugenia Morpurgo, who also was in the fashion system where that the exchange of parts becomes a kind of dialogue between people.",
                    "label": 0
                },
                {
                    "sent": "It's not just selling.",
                    "label": 0
                },
                {
                    "sent": "Apart, but it's a negotiation.",
                    "label": 0
                },
                {
                    "sent": "She developed a new shoe shoe that started from the the observation that we have mainly plastic soles and that these plastic soles cannot be repaired and that the plastic soles are make that we throw away our shoes.",
                    "label": 0
                },
                {
                    "sent": "But the moment that you see the shoe and again we are using the word platform, the soul is a platform that you can build.",
                    "label": 0
                },
                {
                    "sent": "On that issue with different designers that you exchange that you could get very easily and very fast collection and everybody can using the material that is around him, you print it.",
                    "label": 0
                },
                {
                    "sent": "You cut it S you want and you get a whole different approach of how that you maybe can brand this and share it and sell it.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Another one I'm not going into detail was one of the mentors of the end.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Blocks addressing environmental issues of.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Course I don't go into.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "All the details now.",
                    "label": 0
                },
                {
                    "sent": "So what I want to say, in fact it's not about the world of design itself, and I'm saying that quite often.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it's about designing the world and life and society, so it's shifting in.",
                    "label": 0
                },
                {
                    "sent": "Also, in these BI annuals the focus from design and design object to the world to life to society and the consequences the implications because then we are really creating a kind of sustainability.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And another way to putting it is paraphrasing Cedric Price.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And he is choosing that with architecture.",
                    "label": 0
                },
                {
                    "sent": "If design is the answer, what was the question again?",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what we're doing continuously is, and that's the trap we are in, and that's typical for crisis.",
                    "label": 0
                },
                {
                    "sent": "Moments of crisis is that we try to try to reuse or to recycle the problems we have now with 28 medicines with the medicines of the 20th century.",
                    "label": 0
                },
                {
                    "sent": "But we have to answer them completely different in the 21st century.",
                    "label": 1
                },
                {
                    "sent": "Because the problems are really different there, I have another complexity.",
                    "label": 0
                },
                {
                    "sent": "They have another nature, so we have to address them differently.",
                    "label": 0
                },
                {
                    "sent": "We cannot just keep on going what we already did and we have to re question it.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One of the things is, and it's also the issue with design itself is property authorship.",
                    "label": 0
                },
                {
                    "sent": "The ego of the designer was already addressed here.",
                    "label": 0
                },
                {
                    "sent": "Authorship is fundamentally changing ownership.",
                    "label": 0
                },
                {
                    "sent": "What is from me we did with BYOE alot of things on Facebook on Skype on Google Hangout so we posted their enormous amounts of research.",
                    "label": 0
                },
                {
                    "sent": "But who's infector owner?",
                    "label": 0
                },
                {
                    "sent": "Is that the one who put it on?",
                    "label": 0
                },
                {
                    "sent": "Is IT company?",
                    "label": 0
                },
                {
                    "sent": "Is it the data center where it's in somewhere in a server who's the owner of this?",
                    "label": 0
                },
                {
                    "sent": "So addressing these kind of issues will become a topic for the future and also to go to that 4th Fourth Industrial Revolution to solve the issue that there is not one person involved anymore or not one company, but always like a lot.",
                    "label": 0
                },
                {
                    "sent": "Of companies and people will be involved around topics.",
                    "label": 0
                },
                {
                    "sent": "So that becomes very hybrid.",
                    "label": 0
                },
                {
                    "sent": "It become fake.",
                    "label": 0
                },
                {
                    "sent": "We don't know yet how that we deal with it.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This was addressed in a little present.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Asian man, I just show you.",
                    "label": 0
                },
                {
                    "sent": "Of course you this isn't the open Structures project here of Thomas Lemay there it is addressed.",
                    "label": 0
                },
                {
                    "sent": "But mainly the theory is in the peer to peer foundation.",
                    "label": 0
                },
                {
                    "sent": "You can find that is in a very interesting.",
                    "label": 0
                },
                {
                    "sent": "Way of thinking about how we can reorganize our SoC or everything can be decentralized but connected in other ways.",
                    "label": 0
                },
                {
                    "sent": "And how that we can embrace diversity and connect it.",
                    "label": 0
                },
                {
                    "sent": "An act in networks and organize not only our economy but also maybe our policy in completely different ways and how that you can create platforms to.",
                    "label": 0
                },
                {
                    "sent": "Enabled that they have a very good interesting Wikipedia, and of course I have to say there is.",
                    "label": 0
                },
                {
                    "sent": "There's a Belgian guy who is the founder of debt, so I'm also a little bit proud of that.",
                    "label": 0
                },
                {
                    "sent": "It's Michelle Bowens, anusa, super interesting.",
                    "label": 0
                },
                {
                    "sent": "Theoretician who is dealing with that.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's not only how that.",
                    "label": 0
                },
                {
                    "sent": "We as designers are addressing our.",
                    "label": 0
                },
                {
                    "sent": "We will have to address the issue of property out authorship and.",
                    "label": 0
                },
                {
                    "sent": "Ownership itself, but also how that we deal with limited resources, and this is not only material as a as a resource in itself.",
                    "label": 0
                },
                {
                    "sent": "It is also like I think Stanage was giving a very interesting example how that systems or laws are sometimes limiting.",
                    "label": 0
                },
                {
                    "sent": "Other evolution, so we create a society continuously.",
                    "label": 0
                },
                {
                    "sent": "Limits we implement standards, laws and norms and they create an enormous.",
                    "label": 0
                },
                {
                    "sent": "Dillett in acting and reacting.",
                    "label": 0
                },
                {
                    "sent": "We think that everybody to give them a diploma.",
                    "label": 0
                },
                {
                    "sent": "Out of school, infected and then protecting a profession like design, which is probably what every designer would like that his profession is really protected completely and that he only can be a designer.",
                    "label": 0
                },
                {
                    "sent": "This is in fact kind of problem.",
                    "label": 0
                },
                {
                    "sent": "So then we create scarcity.",
                    "label": 0
                },
                {
                    "sent": "What would happen if everybody could participate in process is and things?",
                    "label": 0
                },
                {
                    "sent": "Stay open.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So recycling, reusing, substituting, imitating, repairing, protecting, cooperating, informing these are kind of strategies that designers are continuously using, and the tree as human beings all use every day again to overcome scarcity.",
                    "label": 0
                },
                {
                    "sent": "If Stein each was talking about desire and need, there we society.",
                    "label": 0
                },
                {
                    "sent": "As individuals, we continuously address these.",
                    "label": 0
                },
                {
                    "sent": "These needs and desires with these.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Find strategies I don't go in.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To detail, but what I want to say is that.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The what I hope is that true.",
                    "label": 0
                },
                {
                    "sent": "The things what I heard before and what we are.",
                    "label": 0
                },
                {
                    "sent": "Doing ordets inbio that we hopefully connected technology.",
                    "label": 0
                },
                {
                    "sent": "Know how people the planet sustainability and culture again in a new way and that maybe these platforms that we temporarily platforms that were the teams and groups created a possible future.",
                    "label": 0
                },
                {
                    "sent": "I think the next step or 4B O will be to re evaluate it a little bit.",
                    "label": 0
                },
                {
                    "sent": "I'm was really, positively and now we come to a first kind of roundup of this morning and I hope we can use that as a kind of introduction for this afternoon, is that?",
                    "label": 0
                },
                {
                    "sent": "Maybe to go on with this kind of platforms where that's?",
                    "label": 0
                },
                {
                    "sent": "That could end in a biannual, like every two years of presentation could.",
                    "label": 0
                },
                {
                    "sent": "Catalyze and stimulate the Slovenian design fields, where the local international collaboration and everyday topics could stay the core, where maybe with mid term juries or a kind of school.",
                    "label": 0
                },
                {
                    "sent": "Um format.",
                    "label": 0
                },
                {
                    "sent": "It could work where that designers will be more challenged and not be state under challenged just by creating a product, but that they are have to deal with complex issues where they have the opportunity to reformulate the design brief to question and I refer to hide in item was asking what is the right question.",
                    "label": 0
                },
                {
                    "sent": "And where that the designers also take an active role, and I'm now paraphrasing Ileana an active role and doesn't wait to the government as an individual.",
                    "label": 0
                },
                {
                    "sent": "And where the data could be gathered as a kind of basis for that larger.",
                    "label": 0
                },
                {
                    "sent": "Maybe policy in itself where that.",
                    "label": 0
                },
                {
                    "sent": "We define better what are the different benefits where the personal meeting stays in the middle.",
                    "label": 0
                },
                {
                    "sent": "And we don't only Skype or only Facebook with each other.",
                    "label": 0
                },
                {
                    "sent": "Where that we try that, designers become makers and makers become designers but then step back in the role as designer and Maker because that was where they were good in.",
                    "label": 0
                },
                {
                    "sent": "But they learned from each other where we question what are the borders of design and where it becomes something else.",
                    "label": 0
                },
                {
                    "sent": "And also not just doing things in itself and that we enter a new fields that we don't keep up with making just the traditional fields that we know as the industrial products, but that we maybe go into really science and other technologies and that we dare to.",
                    "label": 0
                },
                {
                    "sent": "Maybe also in a future bio try to come up with different methods of matchmaking.",
                    "label": 0
                },
                {
                    "sent": "Rather than the one that we used now at this moment, so I hope this this inspired me this morning and I hope that this afternoon also will inspire us ourselves to look forward.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}