{
    "id": "tdrbmzo4fstufm4eyc253lkwz7yfopct",
    "title": "That's Interesting, Tell Me More! Finding Descriptive Support Passages for Explaining Knowledge Graph Relationships",
    "info": {
        "author": [
            "Sumit Bhatia, IBM Research"
        ],
        "published": "Nov. 22, 2018",
        "recorded": "October 2018",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/iswc2018_bhatia_interesting_tell_me_more/",
    "segmentation": [
        [
            "Hello everyone, so this is the work joint work carried with students from Tripplite Deli."
        ],
        [
            "So the motivation behind this work, so all of us use search engine's right?",
            "And we're used to seeing so our search results along with accompanying snippets, right?",
            "And what these snippets do is they basically help you understand, like, let's say this famous Indian botanist John Campbell.",
            "If you see all these different search results, these snippets tell you what exactly is present in these documents, and then based on this you decide which document to click or not so."
        ],
        [
            "Why not we have similar functionality for facts that are stored in knowledge graphs, right?",
            "So if you want a biologist, let's say and you were exploring health, health care related knowledge graph and you see this fact, protein P. 21 binds to GDC two.",
            "So unless you have a very specific domain expertise, you might have some trouble understanding or believing this fact right?",
            "But if you show you an accomplished description, that P21 is a potent cyclin dependent kinase.",
            "Inhibitor.",
            "It binds to an, inhibits the activity of CDK two CDK one and functions as a regulated of cell etc etc.",
            "It will help you understand what you are dealing with, right?"
        ],
        [
            "So based on our experience with different clients and the domain applications that we have been building at IBM IBM, we have realized that such kind of functionality is really useful in exploratory search systems where users are exploring about entities or you know properties of these entities they are interested in, and they probably don't know what they'll see, right?",
            "So these kind of descriptions really help them.",
            "It also increases the trust and confidence that users place in their systems, right?",
            "Because if you see a description they can make better.",
            "Sense of the results they're seeing and such a functionality is very crucial for those domains where the cost of making errors is really high.",
            "Bit healthcare, finance or security and intelligence applications.",
            "In fact, there have been certain studies that have found that when people are working with uncertain information, presenting them with natural language descriptions, it aids in their decision-making process.",
            "And nowadays, when we're seeing knowledge graphs that are constructed automatically using neural networks and other machine learning systems where the workings might be opaque to the end user who is not a machine learning expert, such a description really helps them understand what they're saying on the screen.",
            "So."
        ],
        [
            "What has been done in the past so a large body of work exists in the context of web search engines where there exist work on finding sentences or descriptions for explaining why a specific entity was showed as a result to the end users.",
            "Specifically in context of knowledge graphs, people have tried using templates for expanding relationships and some machine learning methods.",
            "For example this learning to rank method to rank sentences based on their relevance to a given relationship.",
            "But there are certain limitations.",
            "First of all, the body of work that exist in context of search engines.",
            "They are very specific to, you know, search engine search engines and web based systems.",
            "They rely on external resources like query logs which are not generally available when you are building domain specific applications you might need, but you might not even have a large user population to have sufficient amount of query logs.",
            "And the problem with template based approaches for every new graph for every new application you build, you need to come up with a new set of templates, right?",
            "And this is a tremendous effort because the number of possible relationship types it could.",
            "It could increase.",
            "It could increase a lot an also having a template, a set template forgiven relationship type.",
            "It doesn't offer users some description, it essentially a different representation of the same fact, so it's not as useful.",
            "And the problem with machine learning based methods is that often the training data is not readily available, right so?"
        ],
        [
            "Do we do it?",
            "Well, we make a very simple and a very naive assumption that any system that we are building will have access to a background text corpus which will use to extract description of the facts that are being shown to the user.",
            "So let's say we have this text corpus and what we do is, as a first step, we create a set of passages from this text corpus an you can have multiple ways of creating these passages, but the way we create it, specially in this work is we used a sliding window overlapping sliding window and created passages that are three sentences log.",
            "We found that it's a nice balance between the amount of information you want to convey to the user and the screen real estate.",
            "So."
        ],
        [
            "Once you have this set of messages, let's say you see this relationship P. 21 binds to CDK two.",
            "Whenever you encounter a new relationship, you ask this question.",
            "Given this relationship, what is the probability of generating a given passage P from this passage set?",
            "So essentially you compute this probability for each passage in your passage set and justice rank them based on the probabilities.",
            "So after doing some probabilistic manipulations, this probability actually decomposes into these two components, which essentially measures given the passage P. What is the probability of observing the source and target entities as well as the relationship you are seeing in the form of the triple.",
            "So note that we have reversed the direction of probability, the direction of the passage.",
            "Now what you are doing is you are using the passage in formation to compute probabilities of observing the.",
            "Entities and relationships that you have seen in the triple.",
            "So after some further manipulations, essentially the whole equation reduces to computing the probability of observing a specific word in a given passage, and these words basically come from the names of your entities and the relationship labels.",
            "You can use an entity synonyms as well as relationship synonyms.",
            "Also to expand this set, but essentially the computations remain same.",
            "So how do we compute this crucial parameter?"
        ],
        [
            "So estimating this probability, there are certain challenges, right?",
            "Note that we are computing these probabilities from passages which are very small, exactly 3 sentences in our case, and that poses certain problems.",
            "So first of all, these passages are small, so you don't have enough data enough evidence to compute this probability reliably.",
            "So what happens is terms that are present in your passages.",
            "You overestimate their probabilities and terms that are not present in the.",
            "In your passage, you assign zero probabilities, and note that our formulation involving product or probabilities.",
            "So having zero basically makes the whole product term 0, so."
        ],
        [
            "How do we overcome that?",
            "Well, we use a smooth mixture model for computing these probabilities, and essentially what the formulation finally derives it too.",
            "It decomposes into three types of evidence.",
            "Is passage level evidence or document level evidence and a collection level evidence.",
            "So you compute the probability of observing a word in your passage as a mixture of three probability distributions.",
            "So one is derived from the passage itself.",
            "One probability distribution is derived from the document.",
            "And one is from the whole text corpus.",
            "Formulating in this way has certain advantages.",
            "So first of all, it helps you overcome data sparsity issues right?",
            "So even if the term is not present in your passage, it will be present in the document as well as it will always be present in the collection, so the probability will never go to zero.",
            "And second thing is, passages that come from documents that talk mainly about the entities that are involved in the triple.",
            "They do get a lot of boost from this document, level level evidence factor.",
            "And essentially what it does it image?",
            "Let's say if you're.",
            "Text corpus is based on Wikipedia and you are shown a triple about Barack Obama.",
            "So all the documents.",
            "So all the passages that come from the source article of Barack Obama, they automatically get a boost, which is what you desire and it actually helps you in performing coreference resolution indirectly.",
            "So even if you're passages using pronouns like he or she to refer to named entities because of this document level boost, those passages will get certain post."
        ],
        [
            "So how does this method perform well for our experiments?",
            "We used a Wikipedia as our source corpus and we also need a set of relationship triples for which we want to generate these descriptions.",
            "So for that what we did is we selected the top 25 most viewed viewed pages in Wikipedia and use that to create a set of seed entities, and for those seed entities we extracted relationships from wiki data and we use those relationship triples as server.",
            "Queries for baselines.",
            "We use the state of the art passage retrieval model based on inference network, and then we use another variation of the same model but with relationship synonyms added.",
            "So essentially what we do is in the second, in the second method we do query expansion by using synonyms of the relationships.",
            "For creating the relevance judgments we took help or five human evaluators who told us whether a given passage for a relationship, whether it is useful or not, all the data that we created, the relevance judgments, and over implementation.",
            "It's available from the GitHub repository, so you are free to try it and use it in your systems too."
        ],
        [
            "So in the first set of experiments, basically we didn't.",
            "It's your classical IR based evaluation.",
            "Given a query, what's the precision or what's the accuracy of the results that are being shown to you?",
            "So note that the proposed solution that I just described it performs really well compared to the baselines, and about 8586% of the times P at one.",
            "That's the precision at one.",
            "The Top Rank passage that is being shown to the user.",
            "It's the correct word.",
            "It was a useful word, an about 72% of the times over all the users found the passage is found by the proposed system, useful compared to about 15% in just 8% of the baseline methods."
        ],
        [
            "Then we also did a preference evaluation where users were shown different passages generated by different methods side by side and they were asked to choose which of the method, which of the passage appears better.",
            "So for this we had three evaluators.",
            "At each of them were shown about 50 relationship triples and their description side-by-side.",
            "So once again, about 50% of the times the evaluators pick the method that we had proposed.",
            "So."
        ],
        [
            "Overall, the method works really well.",
            "The results are promising, but let's have a look at some of the examples that can give you some insights about where the method is performing well and where it is not.",
            "So consider this relationship.",
            "John Cena, WWE wrestler has the nickname, the prototype.",
            "So one of the passage that was found by the baseline method is this.",
            "So if you see this method, this passage is not at all relevant for this specific relationship triple and the reason this passage was shown at the top by the baseline method is because this passage contains multiple mentions of the term prototype.",
            "So prototype is relatively rare term in your corpus.",
            "An thinking about in information retrieval terms.",
            "This term prototype gets a high ideas.",
            "Value, and since it is present multiple times in this passage, so the TF value also becomes high, so this passage gets a very high score.",
            "And remember you are working with simple text documents.",
            "You don't have any other information like page rank or other stuff that generally are present in web search engines.",
            "That alleviates a lot of these problems.",
            "So these these type of passages often we have observed that he never experiments, they come at top by the baseline methods.",
            "And here's the message that our system found.",
            "So if you see this describes a brief history about John Cena and it says that Cena wrestle under the ring name the prototype.",
            "So here what's happening is, even though if you notice the term prototype is only present once in this passage, this passage still got a very high score, and the reason being that this talk about this passage was present in the document of John Sarah.",
            "So the document level evidence component of our ranking formulation.",
            "Has actually boosted this score, so this passage came from that Johnson's document, and because of the presence of a rare term prototype, it came at the top."
        ],
        [
            "But also not well.",
            "We did make some errors also, so for this specific example, Alan Combs employer, Fox News here, the passage if you see it contains a lot of mention of Fox News.",
            "It also contains mention of Alan Combs.",
            "The Alan Combs showed, but it doesn't provide explicitly mentions his employed by Fox News or his president.",
            "He's a he works at Fox News.",
            "So this was not a good passage.",
            "So because of references to Combs and Fox News.",
            "Evidence was very high.",
            "This document from where this passage came from had a lot of mentions about Fox News.",
            "So document level component also give a high score to this passage, but this was not a.",
            "This is not a good passage, so it was a false positive that our system found."
        ],
        [
            "So to conclude, we basically have proposed a probabilistic ranking method to find supporting passages that can help describe knowledge graph relationships that are shown to the users.",
            "The advantage of our method is that it's unsupervised and it has no dependence on any external sources, so it's really useful for.",
            "Building various domain specific implementations, our code is also available, so we hope that it can help you come up with a quick, easy first cut solution and then you can add domain specific refinements on top of it an some interesting further directions will be.",
            "First of all, what we want to do is to handle numeric relationships.",
            "For example this triple Bush Khalifa height 828 meters.",
            "This term 828 meters.",
            "It could be represented in multiple ways in your text documents.",
            "It could be represented.",
            "As numerals or in words, or maybe different units where 828 meters become some XY, zed yards or something like that, right?",
            "So these type of things.",
            "Currently we are not able to handle.",
            "And also we suffer from the classical problem in text understanding that we are not able to handle negations as of now.",
            "So if for a Triple X spouse of why there is a passage that says X is not spouse of, I will probably give it a very high score, right?",
            "Because we cannot handle negations as of now.",
            "And one interesting application we believe worth exploring is how can this method be integrated with fact checking systems right where users are shown facts and some supporting.",
            "Evidence or some provenance information so they can make sense of the information."
        ],
        [
            "It is being shown to the users.",
            "Yeah, that's it.",
            "Thank you any questions?"
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello everyone, so this is the work joint work carried with students from Tripplite Deli.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the motivation behind this work, so all of us use search engine's right?",
                    "label": 0
                },
                {
                    "sent": "And we're used to seeing so our search results along with accompanying snippets, right?",
                    "label": 1
                },
                {
                    "sent": "And what these snippets do is they basically help you understand, like, let's say this famous Indian botanist John Campbell.",
                    "label": 0
                },
                {
                    "sent": "If you see all these different search results, these snippets tell you what exactly is present in these documents, and then based on this you decide which document to click or not so.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Why not we have similar functionality for facts that are stored in knowledge graphs, right?",
                    "label": 1
                },
                {
                    "sent": "So if you want a biologist, let's say and you were exploring health, health care related knowledge graph and you see this fact, protein P. 21 binds to GDC two.",
                    "label": 0
                },
                {
                    "sent": "So unless you have a very specific domain expertise, you might have some trouble understanding or believing this fact right?",
                    "label": 0
                },
                {
                    "sent": "But if you show you an accomplished description, that P21 is a potent cyclin dependent kinase.",
                    "label": 0
                },
                {
                    "sent": "Inhibitor.",
                    "label": 0
                },
                {
                    "sent": "It binds to an, inhibits the activity of CDK two CDK one and functions as a regulated of cell etc etc.",
                    "label": 1
                },
                {
                    "sent": "It will help you understand what you are dealing with, right?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So based on our experience with different clients and the domain applications that we have been building at IBM IBM, we have realized that such kind of functionality is really useful in exploratory search systems where users are exploring about entities or you know properties of these entities they are interested in, and they probably don't know what they'll see, right?",
                    "label": 0
                },
                {
                    "sent": "So these kind of descriptions really help them.",
                    "label": 0
                },
                {
                    "sent": "It also increases the trust and confidence that users place in their systems, right?",
                    "label": 1
                },
                {
                    "sent": "Because if you see a description they can make better.",
                    "label": 0
                },
                {
                    "sent": "Sense of the results they're seeing and such a functionality is very crucial for those domains where the cost of making errors is really high.",
                    "label": 0
                },
                {
                    "sent": "Bit healthcare, finance or security and intelligence applications.",
                    "label": 1
                },
                {
                    "sent": "In fact, there have been certain studies that have found that when people are working with uncertain information, presenting them with natural language descriptions, it aids in their decision-making process.",
                    "label": 1
                },
                {
                    "sent": "And nowadays, when we're seeing knowledge graphs that are constructed automatically using neural networks and other machine learning systems where the workings might be opaque to the end user who is not a machine learning expert, such a description really helps them understand what they're saying on the screen.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What has been done in the past so a large body of work exists in the context of web search engines where there exist work on finding sentences or descriptions for explaining why a specific entity was showed as a result to the end users.",
                    "label": 0
                },
                {
                    "sent": "Specifically in context of knowledge graphs, people have tried using templates for expanding relationships and some machine learning methods.",
                    "label": 1
                },
                {
                    "sent": "For example this learning to rank method to rank sentences based on their relevance to a given relationship.",
                    "label": 0
                },
                {
                    "sent": "But there are certain limitations.",
                    "label": 0
                },
                {
                    "sent": "First of all, the body of work that exist in context of search engines.",
                    "label": 0
                },
                {
                    "sent": "They are very specific to, you know, search engine search engines and web based systems.",
                    "label": 0
                },
                {
                    "sent": "They rely on external resources like query logs which are not generally available when you are building domain specific applications you might need, but you might not even have a large user population to have sufficient amount of query logs.",
                    "label": 1
                },
                {
                    "sent": "And the problem with template based approaches for every new graph for every new application you build, you need to come up with a new set of templates, right?",
                    "label": 0
                },
                {
                    "sent": "And this is a tremendous effort because the number of possible relationship types it could.",
                    "label": 1
                },
                {
                    "sent": "It could increase.",
                    "label": 0
                },
                {
                    "sent": "It could increase a lot an also having a template, a set template forgiven relationship type.",
                    "label": 0
                },
                {
                    "sent": "It doesn't offer users some description, it essentially a different representation of the same fact, so it's not as useful.",
                    "label": 0
                },
                {
                    "sent": "And the problem with machine learning based methods is that often the training data is not readily available, right so?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do we do it?",
                    "label": 0
                },
                {
                    "sent": "Well, we make a very simple and a very naive assumption that any system that we are building will have access to a background text corpus which will use to extract description of the facts that are being shown to the user.",
                    "label": 0
                },
                {
                    "sent": "So let's say we have this text corpus and what we do is, as a first step, we create a set of passages from this text corpus an you can have multiple ways of creating these passages, but the way we create it, specially in this work is we used a sliding window overlapping sliding window and created passages that are three sentences log.",
                    "label": 1
                },
                {
                    "sent": "We found that it's a nice balance between the amount of information you want to convey to the user and the screen real estate.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Once you have this set of messages, let's say you see this relationship P. 21 binds to CDK two.",
                    "label": 0
                },
                {
                    "sent": "Whenever you encounter a new relationship, you ask this question.",
                    "label": 0
                },
                {
                    "sent": "Given this relationship, what is the probability of generating a given passage P from this passage set?",
                    "label": 1
                },
                {
                    "sent": "So essentially you compute this probability for each passage in your passage set and justice rank them based on the probabilities.",
                    "label": 0
                },
                {
                    "sent": "So after doing some probabilistic manipulations, this probability actually decomposes into these two components, which essentially measures given the passage P. What is the probability of observing the source and target entities as well as the relationship you are seeing in the form of the triple.",
                    "label": 0
                },
                {
                    "sent": "So note that we have reversed the direction of probability, the direction of the passage.",
                    "label": 0
                },
                {
                    "sent": "Now what you are doing is you are using the passage in formation to compute probabilities of observing the.",
                    "label": 0
                },
                {
                    "sent": "Entities and relationships that you have seen in the triple.",
                    "label": 0
                },
                {
                    "sent": "So after some further manipulations, essentially the whole equation reduces to computing the probability of observing a specific word in a given passage, and these words basically come from the names of your entities and the relationship labels.",
                    "label": 0
                },
                {
                    "sent": "You can use an entity synonyms as well as relationship synonyms.",
                    "label": 0
                },
                {
                    "sent": "Also to expand this set, but essentially the computations remain same.",
                    "label": 0
                },
                {
                    "sent": "So how do we compute this crucial parameter?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So estimating this probability, there are certain challenges, right?",
                    "label": 0
                },
                {
                    "sent": "Note that we are computing these probabilities from passages which are very small, exactly 3 sentences in our case, and that poses certain problems.",
                    "label": 0
                },
                {
                    "sent": "So first of all, these passages are small, so you don't have enough data enough evidence to compute this probability reliably.",
                    "label": 1
                },
                {
                    "sent": "So what happens is terms that are present in your passages.",
                    "label": 0
                },
                {
                    "sent": "You overestimate their probabilities and terms that are not present in the.",
                    "label": 0
                },
                {
                    "sent": "In your passage, you assign zero probabilities, and note that our formulation involving product or probabilities.",
                    "label": 0
                },
                {
                    "sent": "So having zero basically makes the whole product term 0, so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "How do we overcome that?",
                    "label": 0
                },
                {
                    "sent": "Well, we use a smooth mixture model for computing these probabilities, and essentially what the formulation finally derives it too.",
                    "label": 1
                },
                {
                    "sent": "It decomposes into three types of evidence.",
                    "label": 0
                },
                {
                    "sent": "Is passage level evidence or document level evidence and a collection level evidence.",
                    "label": 0
                },
                {
                    "sent": "So you compute the probability of observing a word in your passage as a mixture of three probability distributions.",
                    "label": 0
                },
                {
                    "sent": "So one is derived from the passage itself.",
                    "label": 0
                },
                {
                    "sent": "One probability distribution is derived from the document.",
                    "label": 0
                },
                {
                    "sent": "And one is from the whole text corpus.",
                    "label": 0
                },
                {
                    "sent": "Formulating in this way has certain advantages.",
                    "label": 0
                },
                {
                    "sent": "So first of all, it helps you overcome data sparsity issues right?",
                    "label": 1
                },
                {
                    "sent": "So even if the term is not present in your passage, it will be present in the document as well as it will always be present in the collection, so the probability will never go to zero.",
                    "label": 0
                },
                {
                    "sent": "And second thing is, passages that come from documents that talk mainly about the entities that are involved in the triple.",
                    "label": 0
                },
                {
                    "sent": "They do get a lot of boost from this document, level level evidence factor.",
                    "label": 0
                },
                {
                    "sent": "And essentially what it does it image?",
                    "label": 0
                },
                {
                    "sent": "Let's say if you're.",
                    "label": 0
                },
                {
                    "sent": "Text corpus is based on Wikipedia and you are shown a triple about Barack Obama.",
                    "label": 0
                },
                {
                    "sent": "So all the documents.",
                    "label": 0
                },
                {
                    "sent": "So all the passages that come from the source article of Barack Obama, they automatically get a boost, which is what you desire and it actually helps you in performing coreference resolution indirectly.",
                    "label": 1
                },
                {
                    "sent": "So even if you're passages using pronouns like he or she to refer to named entities because of this document level boost, those passages will get certain post.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how does this method perform well for our experiments?",
                    "label": 0
                },
                {
                    "sent": "We used a Wikipedia as our source corpus and we also need a set of relationship triples for which we want to generate these descriptions.",
                    "label": 0
                },
                {
                    "sent": "So for that what we did is we selected the top 25 most viewed viewed pages in Wikipedia and use that to create a set of seed entities, and for those seed entities we extracted relationships from wiki data and we use those relationship triples as server.",
                    "label": 1
                },
                {
                    "sent": "Queries for baselines.",
                    "label": 1
                },
                {
                    "sent": "We use the state of the art passage retrieval model based on inference network, and then we use another variation of the same model but with relationship synonyms added.",
                    "label": 0
                },
                {
                    "sent": "So essentially what we do is in the second, in the second method we do query expansion by using synonyms of the relationships.",
                    "label": 0
                },
                {
                    "sent": "For creating the relevance judgments we took help or five human evaluators who told us whether a given passage for a relationship, whether it is useful or not, all the data that we created, the relevance judgments, and over implementation.",
                    "label": 0
                },
                {
                    "sent": "It's available from the GitHub repository, so you are free to try it and use it in your systems too.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in the first set of experiments, basically we didn't.",
                    "label": 0
                },
                {
                    "sent": "It's your classical IR based evaluation.",
                    "label": 0
                },
                {
                    "sent": "Given a query, what's the precision or what's the accuracy of the results that are being shown to you?",
                    "label": 0
                },
                {
                    "sent": "So note that the proposed solution that I just described it performs really well compared to the baselines, and about 8586% of the times P at one.",
                    "label": 1
                },
                {
                    "sent": "That's the precision at one.",
                    "label": 0
                },
                {
                    "sent": "The Top Rank passage that is being shown to the user.",
                    "label": 0
                },
                {
                    "sent": "It's the correct word.",
                    "label": 0
                },
                {
                    "sent": "It was a useful word, an about 72% of the times over all the users found the passage is found by the proposed system, useful compared to about 15% in just 8% of the baseline methods.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then we also did a preference evaluation where users were shown different passages generated by different methods side by side and they were asked to choose which of the method, which of the passage appears better.",
                    "label": 1
                },
                {
                    "sent": "So for this we had three evaluators.",
                    "label": 0
                },
                {
                    "sent": "At each of them were shown about 50 relationship triples and their description side-by-side.",
                    "label": 0
                },
                {
                    "sent": "So once again, about 50% of the times the evaluators pick the method that we had proposed.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Overall, the method works really well.",
                    "label": 0
                },
                {
                    "sent": "The results are promising, but let's have a look at some of the examples that can give you some insights about where the method is performing well and where it is not.",
                    "label": 0
                },
                {
                    "sent": "So consider this relationship.",
                    "label": 0
                },
                {
                    "sent": "John Cena, WWE wrestler has the nickname, the prototype.",
                    "label": 1
                },
                {
                    "sent": "So one of the passage that was found by the baseline method is this.",
                    "label": 0
                },
                {
                    "sent": "So if you see this method, this passage is not at all relevant for this specific relationship triple and the reason this passage was shown at the top by the baseline method is because this passage contains multiple mentions of the term prototype.",
                    "label": 0
                },
                {
                    "sent": "So prototype is relatively rare term in your corpus.",
                    "label": 0
                },
                {
                    "sent": "An thinking about in information retrieval terms.",
                    "label": 0
                },
                {
                    "sent": "This term prototype gets a high ideas.",
                    "label": 0
                },
                {
                    "sent": "Value, and since it is present multiple times in this passage, so the TF value also becomes high, so this passage gets a very high score.",
                    "label": 0
                },
                {
                    "sent": "And remember you are working with simple text documents.",
                    "label": 0
                },
                {
                    "sent": "You don't have any other information like page rank or other stuff that generally are present in web search engines.",
                    "label": 0
                },
                {
                    "sent": "That alleviates a lot of these problems.",
                    "label": 0
                },
                {
                    "sent": "So these these type of passages often we have observed that he never experiments, they come at top by the baseline methods.",
                    "label": 0
                },
                {
                    "sent": "And here's the message that our system found.",
                    "label": 1
                },
                {
                    "sent": "So if you see this describes a brief history about John Cena and it says that Cena wrestle under the ring name the prototype.",
                    "label": 1
                },
                {
                    "sent": "So here what's happening is, even though if you notice the term prototype is only present once in this passage, this passage still got a very high score, and the reason being that this talk about this passage was present in the document of John Sarah.",
                    "label": 0
                },
                {
                    "sent": "So the document level evidence component of our ranking formulation.",
                    "label": 0
                },
                {
                    "sent": "Has actually boosted this score, so this passage came from that Johnson's document, and because of the presence of a rare term prototype, it came at the top.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But also not well.",
                    "label": 0
                },
                {
                    "sent": "We did make some errors also, so for this specific example, Alan Combs employer, Fox News here, the passage if you see it contains a lot of mention of Fox News.",
                    "label": 0
                },
                {
                    "sent": "It also contains mention of Alan Combs.",
                    "label": 0
                },
                {
                    "sent": "The Alan Combs showed, but it doesn't provide explicitly mentions his employed by Fox News or his president.",
                    "label": 0
                },
                {
                    "sent": "He's a he works at Fox News.",
                    "label": 0
                },
                {
                    "sent": "So this was not a good passage.",
                    "label": 0
                },
                {
                    "sent": "So because of references to Combs and Fox News.",
                    "label": 0
                },
                {
                    "sent": "Evidence was very high.",
                    "label": 0
                },
                {
                    "sent": "This document from where this passage came from had a lot of mentions about Fox News.",
                    "label": 0
                },
                {
                    "sent": "So document level component also give a high score to this passage, but this was not a.",
                    "label": 0
                },
                {
                    "sent": "This is not a good passage, so it was a false positive that our system found.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So to conclude, we basically have proposed a probabilistic ranking method to find supporting passages that can help describe knowledge graph relationships that are shown to the users.",
                    "label": 1
                },
                {
                    "sent": "The advantage of our method is that it's unsupervised and it has no dependence on any external sources, so it's really useful for.",
                    "label": 0
                },
                {
                    "sent": "Building various domain specific implementations, our code is also available, so we hope that it can help you come up with a quick, easy first cut solution and then you can add domain specific refinements on top of it an some interesting further directions will be.",
                    "label": 0
                },
                {
                    "sent": "First of all, what we want to do is to handle numeric relationships.",
                    "label": 1
                },
                {
                    "sent": "For example this triple Bush Khalifa height 828 meters.",
                    "label": 0
                },
                {
                    "sent": "This term 828 meters.",
                    "label": 0
                },
                {
                    "sent": "It could be represented in multiple ways in your text documents.",
                    "label": 0
                },
                {
                    "sent": "It could be represented.",
                    "label": 0
                },
                {
                    "sent": "As numerals or in words, or maybe different units where 828 meters become some XY, zed yards or something like that, right?",
                    "label": 0
                },
                {
                    "sent": "So these type of things.",
                    "label": 0
                },
                {
                    "sent": "Currently we are not able to handle.",
                    "label": 0
                },
                {
                    "sent": "And also we suffer from the classical problem in text understanding that we are not able to handle negations as of now.",
                    "label": 0
                },
                {
                    "sent": "So if for a Triple X spouse of why there is a passage that says X is not spouse of, I will probably give it a very high score, right?",
                    "label": 0
                },
                {
                    "sent": "Because we cannot handle negations as of now.",
                    "label": 0
                },
                {
                    "sent": "And one interesting application we believe worth exploring is how can this method be integrated with fact checking systems right where users are shown facts and some supporting.",
                    "label": 0
                },
                {
                    "sent": "Evidence or some provenance information so they can make sense of the information.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is being shown to the users.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's it.",
                    "label": 0
                },
                {
                    "sent": "Thank you any questions?",
                    "label": 0
                }
            ]
        }
    }
}