{
    "id": "tdxpo6xb2qbtd256b6dhibqdrvauq7j7",
    "title": "Altered white matter microstructure in mild cognitive impairment and Parkinson's disease",
    "info": {
        "author": [
            "Indre Pileckyte, Department of Neurology, University Medical Centre Ljubljana"
        ],
        "published": "Sept. 7, 2015",
        "recorded": "May 2015",
        "category": [
            "Top->Medicine->Neuroscience",
            "Top->Medicine->Psychiatry",
            "Top->Biology->Neuroscience",
            "Top->Social Sciences->Psychology"
        ]
    },
    "url": "http://videolectures.net/snc2015_pileckyte_white_matter/",
    "segmentation": [
        [
            "Yes, indeed, I'm going to talk about altered white matter microstructure in Parkinson's disease.",
            "And probably the first question that might appear is why are we talking about white matter in Parkinson's disease?",
            "There is a wonderful research going on on this disease and there is a research going on on the underlying mechanisms of the disease on the progression of it.",
            "There are pretty well established stages, so we know that the disease progress is from the brainstem towards where cortical areas we know a lot about the focus of the motor symptoms in the disease about the substantial Niagara and the damage that happens in there.",
            "But white matter is not really mentioned a lot in this picture, so why should we talk about it?",
            "And there are probably many reasons, but I would like to mention two of them.",
            "So the first one would be I could call it a general shift of the research in terms of interest in a Parkinson disease.",
            "And this probably happens becausw.",
            "Lately we have a great advancement in dealing with the motor symptoms of the disease that are the most visible and very debilitating and stressful for the patients.",
            "But with more successful management of these symptoms, scientists get more and more interested in non motor symptoms.",
            "In the cognitive, emotional psychiatric symptoms.",
            "And we also know that the disease.",
            "Touches many areas in the brain, so of course scientists started to look using multimodal approaches.",
            "What is really happening apart from the motor symptoms?",
            "So we have a data coming in.",
            "It will be also presented today in the later lectures."
        ],
        [
            "And we know that there is a functional disruption in Parkinson disease, as revealed by functional magnetic resonance imaging.",
            "We know that there are widespread metabolic changes.",
            "We also know that there are some kind of subtle Gray matter atrophy.",
            "And all this if we know that there are functional disruption.",
            "If we know that there are metabolic changes and the different areas are affected, it all points to the.",
            "To the question.",
            "So what is happening with the structural connectivity?",
            "Because probably something is happening there as well, so this would be the first reason to look into a white matter.",
            "Well we have.",
            "Is there other reasons?",
            "Probably much more practical and?"
        ],
        [
            "This is a development of a technique diffusion tensor imaging.",
            "That allows to actually investigate the white matter.",
            "So the definition would be that it is noninvasive imaging technique that allows in vivo quantification of water diffusion magnitude and direction ality in tissue.",
            "So it is very.",
            "Thanks and pretentious definition, but let me just illustrate what is the basic idea behind this method so."
        ],
        [
            "So we know that.",
            "Liquid or gas?",
            "Molecules of let's put it like this, but the particles suspended in liquid or gas would undergo constant random motion known as Brownian motion.",
            "And here it is illustrated by suspending a fluorescent Latics particles of tiny tiny diameter into water, and we can see this motion.",
            "And this constant random motion allows a process known as diffusion to happen.",
            "What is diffusion?",
            "Well, the best illustration is a classical example.",
            "If you put a drop of ink in a glass of water and you don't move at glass, it is still.",
            "The ink will diffuse what it means.",
            "It means the particles of the ink due to this random constant motion.",
            "We will intermingle with water molecules.",
            "Um, it is the same in the brain.",
            "What they're also diffuses in the brain.",
            "But it's a bit more complicated because brain is not a glass of simple pure water.",
            "There are a lot of micro structure and.",
            "There are a lot of micro structure in the brain tissue and this impedes the natural diffusion of the water molecules.",
            "And.",
            "So there are two points.",
            "So first of all, yes there is a lot of stuff in the brain that would impede with natural diffusion, so the magnitude would not be the same as in a glass of water.",
            "But there is another thing.",
            "So even if you have environment with a lot of microstructure, the diffusion would still happen is a tropically.",
            "It means the same in all directions, creating the model of diffusion that would look like as fair, but that's a cool thing about white matter because white matter.",
            "Is an ordered structure.",
            "And diffusion in a white matter tends to happen along the.",
            "Principle axis of this ordered structure.",
            "So we have the Fusion lot of this fair anymore.",
            "We have actually direction of the diffusion, the preferred direction, so the diffusion would look more like an ellipsoid.",
            "So this actually the principles of the diffusion tensor imaging that allows us to probe the white matter.",
            "Will talk about."
        ],
        [
            "Later about this so.",
            "These are the reasons why scientists should look into the white matter and we do.",
            "There is a boom of research white matter changes in Parkinson disease that started, let's say from about 2012.",
            "And what we find so far is that for sure there are some kind of global white matter microstructural changes in individuals with Parkinson disease.",
            "Dementia, which is not argue anymore.",
            "We also know that white matter microstructural damage.",
            "Changes with the progress of the severity of the disease.",
            "So it is possible to measure that as well.",
            "And the later interest was to actually try to correlate the white matter changes with different cognitive deficits.",
            "And here the results are.",
            "There are various, so it's not that big consensus so.",
            "And despite what's happening research, they're usually pretty recent all of them.",
            "But it's still only very few studies that tried to look into the differences.",
            "Between white matter alterations in Parkinson disease, and Parkinson disease with mild cognitive impairment, should we try to look into Parkinson's disease dementia?",
            "And it's actually what we're trying to do."
        ],
        [
            "So what we're trying to do is we use the standard diffusion weighted imaging protocol.",
            "We included 14 Parkinson's disease patients with mild cognitive impairment, and we had 13 Parkinson disease patients with no cognitive impairment.",
            "We had 18 controls we used for our analysis, truck bid, special statistics, and just few words about this technique is a technique that allows 2.",
            "Evaluate the status of the white matter in the whole brain and it works very simply or the brains are code registered.",
            "And when the so called mean skeleton of white matter is being created that in the picture is indicated by green, it is supposed to represent where the very means of the white matter tracks.",
            "But most important white matter tracts of the group that you are interested in.",
            "Anne, this skeleton can be later used to project onto different diffusion parameter Maps.",
            "I will present them in a moment and then you can run statistics and make your interferences.",
            "So the parameters that we are looking in.",
            "Is so called fractional and is a drop it and basically it is a measure of directionality, order or structure of a white metal, and the question that fractional another drop it helps to answer is do you have aquatic structure of your white matter or do you have more organized?",
            "We also looked into mean diffusivity that is kind of a measure, very simplifying it.",
            "It's kind of a measure of the magnitude of diffusion, how far your water molecules managed to diffuse independent of direction.",
            "When you are measuring it.",
            "We also look into radial diffusivity and this is a measure that assess the facility perpendicular to the main.",
            "Axis of the diffusion.",
            "And it is a sign usually that something is happening with the either membrane of the taxon, either myelin sheath, so with some for some reason the perpendicular diffusion becomes more prominent.",
            "And finally, we also looked into axial diffusivity.",
            "It is a measure of how is the diffusivity along the principle.",
            "Principle axis of the facility.",
            "So usually we see it increased or decreased.",
            "It doesn't matter if it's increased or decreased, it's usually a sign that there is something happening with accents themselves.",
            "So these are the measures we took all that we're looking into."
        ],
        [
            "And what did they find?",
            "So here on the left you have the.",
            "Differences of fractional and user trouble between the.",
            "Control group and all the patient group together and on the right there is a effect size map.",
            "So what did we find?",
            "We find that yes indeed.",
            "Differences in fractional news atropa so instruction order or directionality of the diffusion of water molecules.",
            "It was mostly lateralized to the right side, and it actually was detected in multiple areas.",
            "On the other hand, we find no differences in mean diffusivity or radial deficit or axle diffusivity.",
            "So we could not say a lot about why we see this picture of decreased fractional and is a drop.",
            "So naturally because we found that there was a difference between control and patient group, we decided to divide the patient group into smaller sub groups so."
        ],
        [
            "First of all, we tried to compare the controls versus Parkinson disease patients with normal cognitive impairment and we found no differences.",
            "This is not actually that surprising, because it's pretty well established finding and it is often reported in the literature."
        ],
        [
            "When we try to look into Parkinson disease with mild cognitive impairment group against control group, and we found differences and actually plenty of them.",
            "So first of all, we saw with the fractional and is atropia is decreased in the patient group.",
            "That is a common finding.",
            "On the other hand, we saw that the mean diffusivity is not that different.",
            "But the exciting finding was that the radial diffusivity, a measure of the perpendicular diffusivity, was increased in a patient group.",
            "So this tells us that probably the huge differences in fractional and is a Tropic are probably highly related to the big differences that we see in radial diffusivity.",
            "And finally, this so almost no differences in axial diffusivity.",
            "OK, let's say receive this differences between controls and patient group.",
            "But can we actually see something like this?",
            "Also if we look.",
            "The Parkinson disease.",
            "Patients with mild mild cognitive impairment versus the Parkinson's disease patients with no Malcolm native impairment can be even more.",
            "Differentiate with two groups, so we did this analysis.",
            "And yes, not surprisingly.",
            "Again, we find that Parkinson disease patients with mild cognitive impairment, had all these parameters that usually indicate some kind of microstructural changes in white matter, so we had decreased fractional another therapy.",
            "They had increased mean diffusivity.",
            "We had increased radial diffusivity and they had increased axonal diffusivity."
        ],
        [
            "Oh, always find exactly told us that.",
            "All these findings tells us that.",
            "Most of what we found about the white matter alterations, indeed indeed points toward this group of patients that had not just Parkinson disease, but mild cognitive impairment as well as we did not find these differences in a pure Parkinson Disease group, so of course, but we're doing right now.",
            "We're very excited to find this differences in slightly this group in Parkinson's disease with mild cognitive impairment and what we're doing at this moment, actually."
        ],
        [
            "It is we're trying to correlate the.",
            "The data that we got with behavioral measures, but this is what we're doing right now.",
            "So unfortunately I cannot present you a lot.",
            "But basically the results came in yesterday, but I'm extremely excited to share that with you because we already found that if we try to correlate fractional linear therapy values with.",
            "And compare them in controls and.",
            "Old patient group together.",
            "We already found that there are differences in short delay, three recall and a digit span book backwards.",
            "What it tells us that probably we can expect if we pursue this line of research, we can expect to find some more correlations, and probably, especially in a patient group of mild cognitive impairment with a certain behavioral measures and.",
            "What we're looking at right now, so we're looking just for some scales of working memory.",
            "Executive functions memory so.",
            "OK."
        ],
        [
            "So just to make some final concluding points.",
            "We found that there are widespread white matter alterations and we identified it in different brain areas.",
            "We also saw that.",
            "We compare Parkinson disease with no mild cognitive impairment and controls.",
            "We found no differences.",
            "And the exciting thing that we're seeing is with white matter alterations that we're identifying appointing.",
            "The more prominent in Parkinson disease patients with mild cognitive impairment.",
            "Of course, there are limitations.",
            "There are always limitations and the limitation of this study is that even if we manage to quantify these differences.",
            "We cannot say a lot about the underlying mechanisms of this changes, so we can identify them.",
            "We can quantify.",
            "We can say that something is happening.",
            "Unfortunately, the method and technique is not probably sensitive enough to say.",
            "A lot about what's really happening."
        ],
        [
            "So I would like to thank for everyone involved in the study and working on this study.",
            "I would like especially thank to my colleague Rob Barlow, who is really contributing a lot and helped me a lot and that's it.",
            "I thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yes, indeed, I'm going to talk about altered white matter microstructure in Parkinson's disease.",
                    "label": 1
                },
                {
                    "sent": "And probably the first question that might appear is why are we talking about white matter in Parkinson's disease?",
                    "label": 0
                },
                {
                    "sent": "There is a wonderful research going on on this disease and there is a research going on on the underlying mechanisms of the disease on the progression of it.",
                    "label": 0
                },
                {
                    "sent": "There are pretty well established stages, so we know that the disease progress is from the brainstem towards where cortical areas we know a lot about the focus of the motor symptoms in the disease about the substantial Niagara and the damage that happens in there.",
                    "label": 0
                },
                {
                    "sent": "But white matter is not really mentioned a lot in this picture, so why should we talk about it?",
                    "label": 0
                },
                {
                    "sent": "And there are probably many reasons, but I would like to mention two of them.",
                    "label": 0
                },
                {
                    "sent": "So the first one would be I could call it a general shift of the research in terms of interest in a Parkinson disease.",
                    "label": 0
                },
                {
                    "sent": "And this probably happens becausw.",
                    "label": 0
                },
                {
                    "sent": "Lately we have a great advancement in dealing with the motor symptoms of the disease that are the most visible and very debilitating and stressful for the patients.",
                    "label": 0
                },
                {
                    "sent": "But with more successful management of these symptoms, scientists get more and more interested in non motor symptoms.",
                    "label": 0
                },
                {
                    "sent": "In the cognitive, emotional psychiatric symptoms.",
                    "label": 0
                },
                {
                    "sent": "And we also know that the disease.",
                    "label": 0
                },
                {
                    "sent": "Touches many areas in the brain, so of course scientists started to look using multimodal approaches.",
                    "label": 0
                },
                {
                    "sent": "What is really happening apart from the motor symptoms?",
                    "label": 0
                },
                {
                    "sent": "So we have a data coming in.",
                    "label": 0
                },
                {
                    "sent": "It will be also presented today in the later lectures.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we know that there is a functional disruption in Parkinson disease, as revealed by functional magnetic resonance imaging.",
                    "label": 0
                },
                {
                    "sent": "We know that there are widespread metabolic changes.",
                    "label": 1
                },
                {
                    "sent": "We also know that there are some kind of subtle Gray matter atrophy.",
                    "label": 1
                },
                {
                    "sent": "And all this if we know that there are functional disruption.",
                    "label": 0
                },
                {
                    "sent": "If we know that there are metabolic changes and the different areas are affected, it all points to the.",
                    "label": 1
                },
                {
                    "sent": "To the question.",
                    "label": 0
                },
                {
                    "sent": "So what is happening with the structural connectivity?",
                    "label": 0
                },
                {
                    "sent": "Because probably something is happening there as well, so this would be the first reason to look into a white matter.",
                    "label": 0
                },
                {
                    "sent": "Well we have.",
                    "label": 0
                },
                {
                    "sent": "Is there other reasons?",
                    "label": 0
                },
                {
                    "sent": "Probably much more practical and?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is a development of a technique diffusion tensor imaging.",
                    "label": 0
                },
                {
                    "sent": "That allows to actually investigate the white matter.",
                    "label": 0
                },
                {
                    "sent": "So the definition would be that it is noninvasive imaging technique that allows in vivo quantification of water diffusion magnitude and direction ality in tissue.",
                    "label": 1
                },
                {
                    "sent": "So it is very.",
                    "label": 0
                },
                {
                    "sent": "Thanks and pretentious definition, but let me just illustrate what is the basic idea behind this method so.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we know that.",
                    "label": 0
                },
                {
                    "sent": "Liquid or gas?",
                    "label": 0
                },
                {
                    "sent": "Molecules of let's put it like this, but the particles suspended in liquid or gas would undergo constant random motion known as Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "And here it is illustrated by suspending a fluorescent Latics particles of tiny tiny diameter into water, and we can see this motion.",
                    "label": 0
                },
                {
                    "sent": "And this constant random motion allows a process known as diffusion to happen.",
                    "label": 0
                },
                {
                    "sent": "What is diffusion?",
                    "label": 0
                },
                {
                    "sent": "Well, the best illustration is a classical example.",
                    "label": 0
                },
                {
                    "sent": "If you put a drop of ink in a glass of water and you don't move at glass, it is still.",
                    "label": 0
                },
                {
                    "sent": "The ink will diffuse what it means.",
                    "label": 0
                },
                {
                    "sent": "It means the particles of the ink due to this random constant motion.",
                    "label": 0
                },
                {
                    "sent": "We will intermingle with water molecules.",
                    "label": 0
                },
                {
                    "sent": "Um, it is the same in the brain.",
                    "label": 0
                },
                {
                    "sent": "What they're also diffuses in the brain.",
                    "label": 0
                },
                {
                    "sent": "But it's a bit more complicated because brain is not a glass of simple pure water.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of micro structure and.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of micro structure in the brain tissue and this impedes the natural diffusion of the water molecules.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So there are two points.",
                    "label": 0
                },
                {
                    "sent": "So first of all, yes there is a lot of stuff in the brain that would impede with natural diffusion, so the magnitude would not be the same as in a glass of water.",
                    "label": 0
                },
                {
                    "sent": "But there is another thing.",
                    "label": 0
                },
                {
                    "sent": "So even if you have environment with a lot of microstructure, the diffusion would still happen is a tropically.",
                    "label": 0
                },
                {
                    "sent": "It means the same in all directions, creating the model of diffusion that would look like as fair, but that's a cool thing about white matter because white matter.",
                    "label": 0
                },
                {
                    "sent": "Is an ordered structure.",
                    "label": 0
                },
                {
                    "sent": "And diffusion in a white matter tends to happen along the.",
                    "label": 0
                },
                {
                    "sent": "Principle axis of this ordered structure.",
                    "label": 0
                },
                {
                    "sent": "So we have the Fusion lot of this fair anymore.",
                    "label": 0
                },
                {
                    "sent": "We have actually direction of the diffusion, the preferred direction, so the diffusion would look more like an ellipsoid.",
                    "label": 0
                },
                {
                    "sent": "So this actually the principles of the diffusion tensor imaging that allows us to probe the white matter.",
                    "label": 0
                },
                {
                    "sent": "Will talk about.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Later about this so.",
                    "label": 0
                },
                {
                    "sent": "These are the reasons why scientists should look into the white matter and we do.",
                    "label": 0
                },
                {
                    "sent": "There is a boom of research white matter changes in Parkinson disease that started, let's say from about 2012.",
                    "label": 0
                },
                {
                    "sent": "And what we find so far is that for sure there are some kind of global white matter microstructural changes in individuals with Parkinson disease.",
                    "label": 1
                },
                {
                    "sent": "Dementia, which is not argue anymore.",
                    "label": 1
                },
                {
                    "sent": "We also know that white matter microstructural damage.",
                    "label": 0
                },
                {
                    "sent": "Changes with the progress of the severity of the disease.",
                    "label": 1
                },
                {
                    "sent": "So it is possible to measure that as well.",
                    "label": 0
                },
                {
                    "sent": "And the later interest was to actually try to correlate the white matter changes with different cognitive deficits.",
                    "label": 0
                },
                {
                    "sent": "And here the results are.",
                    "label": 0
                },
                {
                    "sent": "There are various, so it's not that big consensus so.",
                    "label": 0
                },
                {
                    "sent": "And despite what's happening research, they're usually pretty recent all of them.",
                    "label": 0
                },
                {
                    "sent": "But it's still only very few studies that tried to look into the differences.",
                    "label": 0
                },
                {
                    "sent": "Between white matter alterations in Parkinson disease, and Parkinson disease with mild cognitive impairment, should we try to look into Parkinson's disease dementia?",
                    "label": 0
                },
                {
                    "sent": "And it's actually what we're trying to do.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we're trying to do is we use the standard diffusion weighted imaging protocol.",
                    "label": 0
                },
                {
                    "sent": "We included 14 Parkinson's disease patients with mild cognitive impairment, and we had 13 Parkinson disease patients with no cognitive impairment.",
                    "label": 0
                },
                {
                    "sent": "We had 18 controls we used for our analysis, truck bid, special statistics, and just few words about this technique is a technique that allows 2.",
                    "label": 0
                },
                {
                    "sent": "Evaluate the status of the white matter in the whole brain and it works very simply or the brains are code registered.",
                    "label": 0
                },
                {
                    "sent": "And when the so called mean skeleton of white matter is being created that in the picture is indicated by green, it is supposed to represent where the very means of the white matter tracks.",
                    "label": 0
                },
                {
                    "sent": "But most important white matter tracts of the group that you are interested in.",
                    "label": 0
                },
                {
                    "sent": "Anne, this skeleton can be later used to project onto different diffusion parameter Maps.",
                    "label": 0
                },
                {
                    "sent": "I will present them in a moment and then you can run statistics and make your interferences.",
                    "label": 0
                },
                {
                    "sent": "So the parameters that we are looking in.",
                    "label": 0
                },
                {
                    "sent": "Is so called fractional and is a drop it and basically it is a measure of directionality, order or structure of a white metal, and the question that fractional another drop it helps to answer is do you have aquatic structure of your white matter or do you have more organized?",
                    "label": 0
                },
                {
                    "sent": "We also looked into mean diffusivity that is kind of a measure, very simplifying it.",
                    "label": 0
                },
                {
                    "sent": "It's kind of a measure of the magnitude of diffusion, how far your water molecules managed to diffuse independent of direction.",
                    "label": 0
                },
                {
                    "sent": "When you are measuring it.",
                    "label": 0
                },
                {
                    "sent": "We also look into radial diffusivity and this is a measure that assess the facility perpendicular to the main.",
                    "label": 0
                },
                {
                    "sent": "Axis of the diffusion.",
                    "label": 0
                },
                {
                    "sent": "And it is a sign usually that something is happening with the either membrane of the taxon, either myelin sheath, so with some for some reason the perpendicular diffusion becomes more prominent.",
                    "label": 0
                },
                {
                    "sent": "And finally, we also looked into axial diffusivity.",
                    "label": 0
                },
                {
                    "sent": "It is a measure of how is the diffusivity along the principle.",
                    "label": 0
                },
                {
                    "sent": "Principle axis of the facility.",
                    "label": 0
                },
                {
                    "sent": "So usually we see it increased or decreased.",
                    "label": 0
                },
                {
                    "sent": "It doesn't matter if it's increased or decreased, it's usually a sign that there is something happening with accents themselves.",
                    "label": 0
                },
                {
                    "sent": "So these are the measures we took all that we're looking into.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And what did they find?",
                    "label": 0
                },
                {
                    "sent": "So here on the left you have the.",
                    "label": 0
                },
                {
                    "sent": "Differences of fractional and user trouble between the.",
                    "label": 0
                },
                {
                    "sent": "Control group and all the patient group together and on the right there is a effect size map.",
                    "label": 0
                },
                {
                    "sent": "So what did we find?",
                    "label": 0
                },
                {
                    "sent": "We find that yes indeed.",
                    "label": 0
                },
                {
                    "sent": "Differences in fractional news atropa so instruction order or directionality of the diffusion of water molecules.",
                    "label": 0
                },
                {
                    "sent": "It was mostly lateralized to the right side, and it actually was detected in multiple areas.",
                    "label": 1
                },
                {
                    "sent": "On the other hand, we find no differences in mean diffusivity or radial deficit or axle diffusivity.",
                    "label": 0
                },
                {
                    "sent": "So we could not say a lot about why we see this picture of decreased fractional and is a drop.",
                    "label": 0
                },
                {
                    "sent": "So naturally because we found that there was a difference between control and patient group, we decided to divide the patient group into smaller sub groups so.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First of all, we tried to compare the controls versus Parkinson disease patients with normal cognitive impairment and we found no differences.",
                    "label": 0
                },
                {
                    "sent": "This is not actually that surprising, because it's pretty well established finding and it is often reported in the literature.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When we try to look into Parkinson disease with mild cognitive impairment group against control group, and we found differences and actually plenty of them.",
                    "label": 0
                },
                {
                    "sent": "So first of all, we saw with the fractional and is atropia is decreased in the patient group.",
                    "label": 0
                },
                {
                    "sent": "That is a common finding.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, we saw that the mean diffusivity is not that different.",
                    "label": 0
                },
                {
                    "sent": "But the exciting finding was that the radial diffusivity, a measure of the perpendicular diffusivity, was increased in a patient group.",
                    "label": 0
                },
                {
                    "sent": "So this tells us that probably the huge differences in fractional and is a Tropic are probably highly related to the big differences that we see in radial diffusivity.",
                    "label": 0
                },
                {
                    "sent": "And finally, this so almost no differences in axial diffusivity.",
                    "label": 0
                },
                {
                    "sent": "OK, let's say receive this differences between controls and patient group.",
                    "label": 0
                },
                {
                    "sent": "But can we actually see something like this?",
                    "label": 0
                },
                {
                    "sent": "Also if we look.",
                    "label": 0
                },
                {
                    "sent": "The Parkinson disease.",
                    "label": 0
                },
                {
                    "sent": "Patients with mild mild cognitive impairment versus the Parkinson's disease patients with no Malcolm native impairment can be even more.",
                    "label": 0
                },
                {
                    "sent": "Differentiate with two groups, so we did this analysis.",
                    "label": 0
                },
                {
                    "sent": "And yes, not surprisingly.",
                    "label": 0
                },
                {
                    "sent": "Again, we find that Parkinson disease patients with mild cognitive impairment, had all these parameters that usually indicate some kind of microstructural changes in white matter, so we had decreased fractional another therapy.",
                    "label": 0
                },
                {
                    "sent": "They had increased mean diffusivity.",
                    "label": 0
                },
                {
                    "sent": "We had increased radial diffusivity and they had increased axonal diffusivity.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Oh, always find exactly told us that.",
                    "label": 0
                },
                {
                    "sent": "All these findings tells us that.",
                    "label": 0
                },
                {
                    "sent": "Most of what we found about the white matter alterations, indeed indeed points toward this group of patients that had not just Parkinson disease, but mild cognitive impairment as well as we did not find these differences in a pure Parkinson Disease group, so of course, but we're doing right now.",
                    "label": 0
                },
                {
                    "sent": "We're very excited to find this differences in slightly this group in Parkinson's disease with mild cognitive impairment and what we're doing at this moment, actually.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is we're trying to correlate the.",
                    "label": 0
                },
                {
                    "sent": "The data that we got with behavioral measures, but this is what we're doing right now.",
                    "label": 0
                },
                {
                    "sent": "So unfortunately I cannot present you a lot.",
                    "label": 0
                },
                {
                    "sent": "But basically the results came in yesterday, but I'm extremely excited to share that with you because we already found that if we try to correlate fractional linear therapy values with.",
                    "label": 0
                },
                {
                    "sent": "And compare them in controls and.",
                    "label": 0
                },
                {
                    "sent": "Old patient group together.",
                    "label": 0
                },
                {
                    "sent": "We already found that there are differences in short delay, three recall and a digit span book backwards.",
                    "label": 0
                },
                {
                    "sent": "What it tells us that probably we can expect if we pursue this line of research, we can expect to find some more correlations, and probably, especially in a patient group of mild cognitive impairment with a certain behavioral measures and.",
                    "label": 0
                },
                {
                    "sent": "What we're looking at right now, so we're looking just for some scales of working memory.",
                    "label": 0
                },
                {
                    "sent": "Executive functions memory so.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So just to make some final concluding points.",
                    "label": 0
                },
                {
                    "sent": "We found that there are widespread white matter alterations and we identified it in different brain areas.",
                    "label": 1
                },
                {
                    "sent": "We also saw that.",
                    "label": 0
                },
                {
                    "sent": "We compare Parkinson disease with no mild cognitive impairment and controls.",
                    "label": 0
                },
                {
                    "sent": "We found no differences.",
                    "label": 0
                },
                {
                    "sent": "And the exciting thing that we're seeing is with white matter alterations that we're identifying appointing.",
                    "label": 1
                },
                {
                    "sent": "The more prominent in Parkinson disease patients with mild cognitive impairment.",
                    "label": 0
                },
                {
                    "sent": "Of course, there are limitations.",
                    "label": 1
                },
                {
                    "sent": "There are always limitations and the limitation of this study is that even if we manage to quantify these differences.",
                    "label": 0
                },
                {
                    "sent": "We cannot say a lot about the underlying mechanisms of this changes, so we can identify them.",
                    "label": 0
                },
                {
                    "sent": "We can quantify.",
                    "label": 0
                },
                {
                    "sent": "We can say that something is happening.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately, the method and technique is not probably sensitive enough to say.",
                    "label": 0
                },
                {
                    "sent": "A lot about what's really happening.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I would like to thank for everyone involved in the study and working on this study.",
                    "label": 0
                },
                {
                    "sent": "I would like especially thank to my colleague Rob Barlow, who is really contributing a lot and helped me a lot and that's it.",
                    "label": 0
                },
                {
                    "sent": "I thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}