{
    "id": "tf3qto5vawvrvqe6mqjz7vahlilp3ym6",
    "title": "Context-specific transcriptional regulatory network inference from global gene expression maps using double two-way t-tests",
    "info": {
        "author": [
            "Jianlong Qi, Freiburg Institute for Advanced Studies (FRIAS)"
        ],
        "published": "Oct. 23, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Biology->Genetics",
            "Top->Computer Science->Bioinformatics"
        ]
    },
    "url": "http://videolectures.net/mlsb2012_qi_context/",
    "segmentation": [
        [
            "Presentation topic is contact specific transcriptional regulatory network inference from global gene expression map using double 280 tests and the title is a long but you will see the method is quite simple."
        ],
        [
            "And in this presentation, at first I will give a brief introduction about what is transcriptional regulatory network and then I will introduce a method which use T test to infer regulator interactions.",
            "At the end I will show the experiment to result of the proposed method E. Coli yeast and human data site."
        ],
        [
            "So what is the transcriptional regulator in network?"
        ],
        [
            "We know cell can perform a very complex site of biological process.",
            "The regulation of this process consists of many different mechanisms such as transcriptional regulation, posttranscriptional regulation, translational regulation, transcriptional regulation controls, which genes are transcribed into M RNA.",
            "Transcription factors are special type of proteins.",
            "They prove very important role in.",
            "Transcriptional regulation and they can bend to the upstream region of other genes and then influence the expression of these genes."
        ],
        [
            "In this slide, I show a part of the Regulation Regulation for nutrition utilization in East and DL2, and there are similar to yeast genes.",
            "Their activity, many controlled as a transcriptional level.",
            "Dot DLL 3.",
            "Anna JT van are they are transcription factors when the non preferred natural resources is available is a 2DL2 and L center highly expressed.",
            "Jail three is translocated to cytoplasm due to the protein.",
            "Protein interactions with Ure true, then preferred nitrogen sources, is present in the environment when.",
            "Only now only non preferred sources available, Jalen Three is released from his interactions and enter the nucleus where it band to the upstream region of DL2DL7 and activate their expression.",
            "The regulatory relationships between transcription factors and their targets can be considered as a network called transcriptional regulatory network.",
            "Regulatory network their chance of regulatory interactions.",
            "For example, Jalen 322 J TMG 81, two DL2.",
            "In addition, the gene might be regulated by multiple transcription factors.",
            "For example the DL7 DL two is regulated by GTR GT band, GLN 3 so the structure of a regulatory network is.",
            "Not simple."
        ],
        [
            "So how can we reconstruct regulatory?"
        ],
        [
            "At work, my solution is we can use gene expression data to reconstruct the regulatory network.",
            "The basic idea of this approach is molecular interaction between transcription factors and touches or depending activity of transcription factors to the upstream region of their target.",
            "Mecosta Co expression between the expression profiles of transcription factors and their target.",
            "Right now we look now we look at an example.",
            "This figure shows the expression value for Easter gene DL, DL tool and DL7 and their transcription factors.",
            "JT 1 GRN 3 in East Data site is Yellow line separate conditions.",
            "There only non only non preferred.",
            "Nitrogen sources is available from conditions where preferred nitrogen sources is available.",
            "We can see that the expression profile of these two genes and there are two transcription factors share a common pattern.",
            "That is the only highly expressed in non preferred nitrogen sources, not express or an organic surprised and preferred nitrogen sources."
        ],
        [
            "So many algorithms have been proposed to inform regulatory network from expression data.",
            "Essentially, they use a different technique to detect correlation between regulator and gene pairs."
        ],
        [
            "And.",
            "And a the older two type of two inputs.",
            "The first one is a gene matrix of expression data, the 2nd is a list of candidate transcription factor.",
            "The output of algorithm is an ordered list of putative regulator gene interactions given a set of known interactions, we can evaluate the performance of the algorithm using the precision and recall curves and the precision for the top K prediction in the order list is.",
            "Defined as the number of true positives from Mr. K interactions divided by the number of K and corresponding recall is defined as the number of true positives from is K interactions divided by the total number of known interactions."
        ],
        [
            "There are also many benchmark data site for evaluating the performance of this algorithm.",
            "Here I at least two.",
            "The first line is Easter data site which measures East response to different environmental stress.",
            "The second is equal.",
            "I decide which consists of expression, value collected and different goals condition and genetic mutation.",
            "And I we also use this two decide to evaluate the performance of the proposed method.",
            "A match of cellular response in E. Coli is controlled at transcriptional level, so the so the transcription factor and target in E. Coli is more coexpressed than that in East, so most algorithm obtain better performance in E. COLI data site."
        ],
        [
            "And for most network reconstruction method rely on very complex mathematic models such as differential equation and Bayesian networks, and they perform very well but.",
            "It may be difficult for non by informatic user to apply them because the configuration of this program is is not easy, such as how to improve convergence rate or how to avoid local optimum.",
            "We apply a very simple static Model T test 22 info regulatory interaction, forgiven gene.",
            "We first determine the critical contrast of this gene, which consists of two sides of conditions and.",
            "This gene is differentially expressed between these two sides."
        ],
        [
            "And given a data set with K samples, we first ordered the expression value of R gene G into an ordered list.",
            "So then we can build partition with two condition clusters C1 and C2.",
            "From this ordered list an the maximum expression value in silver is not more than the minimum expression value in C2.",
            "Then we can.",
            "Differential expression of G between 7:00 and C2 can be determined by T statistic.",
            "So by this way we can extract K minus land partitions from Lisa.",
            "Ordered list among key management positions.",
            "We select one in which G has the maximum T statistic as the critical contrast for G."
        ],
        [
            "Now we look at an example to illustrate the idea of critical contrast.",
            "At least figure showed sorted expression value of East Gene DL two from the East Data Site.",
            "This black line separated condition into two condition clusters.",
            "They represent the critical contrast.",
            "We can see the DL two is highly expressed in one condition.",
            "Cluster will not express or down expressed in the other.",
            "Condition cluster."
        ],
        [
            "Really use expression data to inform regulatory interaction.",
            "Essentially we want to detect the Co expression between transcription factor and jeans.",
            "So in this work we and codes fashion means the transcription factor of a gene is also differentially expressed in the critical contrast of this train."
        ],
        [
            "So, so we defined regulatory score between transcription factor F&G as the T statistic of F in the critical contrast of G. So the higher regulatory scored more confidence will assign to the interaction between F&G and in order to make the regulatory score from different statistique come parable, we normalize this regulatory score by.",
            "Substracting the mean and standard deviation of regulatory scores for all candidate transcription factor in this critical contrast."
        ],
        [
            "So this method doesn't assume the Co expression between the transcription factors and their target is linear or will nonlinear, but it's required the transcription factor of a given gene is a more differentially expressed in the critical contrast of this gene compared to other candidate transcription factors.",
            "So this design make this method able to detect locally coexpressed regulator gene pairs.",
            "We will see it in the experimental results section."
        ],
        [
            "So we first apply this method in the two benchmark data side, the colon, the East Data site and also."
        ],
        [
            "We compared its performance with several existing algorithm.",
            "This page list algorithm included in the comparison.",
            "Also we include the Pearson Correlation and Spearman color relation into the comparison as a baseline because they probably is the most simple network reconstruction method."
        ],
        [
            "And this figure shows the recall precision curve from the top 500 prediction given by each method in the E. Coli data side.",
            "Identified the gene three and CR outperformed the others, and also we notice the Pearson correlation also obtained really good good performance public.",
            "This means because in the equal added site transcription factors and their target are strongly hikes priced.",
            "So we can use a very simple method like Pearson correlation to get a good performance."
        ],
        [
            "This figure shows the recall precision curve.",
            "In the in the Easter date aside, in this data side, the Clr and T test based method of obtaining better performance than the other algorithms.",
            "So the figure is a public is a very hard to make a conclusion.",
            "So here we calculate the area and recall precision curves from the previous two figures.",
            "the T test based method is the third best in the equal at the site published.",
            "The second best in the East data set.",
            "So normally when we propose a new method, we want to want it to be it.",
            "All existing method.",
            "Unfortunately this is not the case for here, but the difference between the performance of this algorithm is not very significant, especially for the Easter data site.",
            "So here we."
        ],
        [
            "I'm more interested if the prediction given by the our algorithm is different from the prediction by the other algorithm and how they are different."
        ],
        [
            "So so now we forced to defend distance between two algorithm as the number of non overlap interactions from their top 500 predictions.",
            "This figure shows the distance between algorithm in the East Data Site and Jeffrey and infer later are very close because they both based on regression tree, two info regulatory interactions in free later cell R&T test based method occupy.",
            "Relative more more unique locations and the T test based method rely on differential expression testing.",
            "It is a more sensitive to locally locally expressed regulator gene pairs.",
            "We suspect this make the result of the test based method different from others."
        ],
        [
            "This figure shows the distribution of Pearson correlation between the transcription factors and their target from the five top 500 top predictions in the Easter data side you can see the prediction given by the T test based method.",
            "Have a lower Pearson correlations, so indicating the transcription factor locally cold pressed with their targets.",
            "Yeah."
        ],
        [
            "Addition, we also apply this method on the big human data."
        ],
        [
            "At least they decided consist of modern thousand samples collected from 64 tissues.",
            "So this data site is a very good place to test if the method can detect a tissue specific regulatory interaction.",
            "Here we show the top 2 predictions from the T test based method.",
            "The predictions include transcription factor, TBX 5 which is.",
            "Related to heart development and the transcription factor GCN one which is play central transformation factors also is.",
            "Here we show the top two transcription factor top two regulations from Clr.",
            "The transcription factors selected by cell R is ABBX and then 24.",
            "Both of them related cell cycle.",
            "Development."
        ],
        [
            "So in this figure we show the expression value for the interactions described in the previous page and in the predictions selected by the T test based method, which in the right and blue color the transcription factor.",
            "Only Cody surprised we are with their target in a small number of samples.",
            "Actually, it's samples are collected from a particular tissue type.",
            "For example, for the DBX 5, this transcription factor is only coincides with their target in the heart tissue samples.",
            "And also here we see the prediction for from Clr.",
            "Predict Lisa interactions.",
            "The transcription factors are globally coexpressed with their target across samples from different tissue types."
        ],
        [
            "So so here I give a brief summary about the proposed method.",
            "So actually this method uses a very simple static model, the T test.",
            "So it's quite fast even in the huge human data set is take a last minute to get the result.",
            "For other method included in the in the comparison there are can take maybe several hours, but the other method we have to.",
            "Get help from cluster.",
            "Otherwise we cannot run it in a decent time and also it's a method can detect locally coexpressed regulator gene pairs.",
            "The limitation of this method is its main missed.",
            "Some Global Co Express regulatory interaction and this type of interaction is quite popular.",
            "For example in E. Coli.",
            "So the performance of this method in equalized not very good.",
            "We think this method can provide complementary information for existing network algorithm, so probably integrating its result with the existing algorithm in mental linear approach is a very promising directions.",
            "And.",
            "So.",
            "So any questions?",
            "I have a couple of concern with the T test because when using the T stat T test assumption you make, this data is normally distributed.",
            "There are so many papers it said that there we it's assumption for normal normality of the expression data set.",
            "It's not optimal because sometimes even my personal experiences when I see that the expression data, sometimes it's really deviate from the normal distribution, sometimes cured.",
            "It's not symmetrical in heavy tail or something like that.",
            "Do you think that's because of that you're violating the normality assumption, or that's why your method is not show up orbiting them?",
            "The pre existing approaches.",
            "Do you think that's one of the reason maybe?",
            "And maybe maybe, but I think the normality is from my opinion is not a big concern because if you have a.",
            "A big enough number of data and normal life more than 10 or something.",
            "I think normality is is OK is.",
            "Yeah, probably.",
            "You can use other types like ranking based test.",
            "Yeah, probably make it for example like the Kruskal Wallis test.",
            "Maybe you can get more reliable reliable result, but.",
            "I don't think we can get a big improvement in the result because when I see that user data sort of huge sample size, sample size is really big according to the power law.",
            "If you have enough sample size, you can reject any null hypothesis that everyone knows, so maybe that's one of the reasons.",
            "Help you method gain little bit up because maybe that's it makes a violation of the assumption of normality.",
            "It makes help you to overcome this problem because we are using the huge sample size data set.",
            "Maybe that's one of the reason?",
            "Yeah, I agree.",
            "The big sample size definitely will help the program.",
            "Yeah, definitely you showed results on better the predictions of different methods overlap.",
            "You know, there they correlate Invensense or the other.",
            "Did you also check whether the intersection of the predictions of two or more methods is more accurate than one single method alone?",
            "That would be a very easy way of combining different methods an.",
            "Intersection I did some similar work.",
            "Is the direction, but it's not integrated result from this method, but it is from module network learning, but surprising intersection is not good choice.",
            "Union is better than intersection and there are some other more sophisticated method for integrating ranking list such as.",
            "Which is the best?",
            "Markov Monte Carlo or something, and probably they can improve performance a little bit, but generally I feel the union is the best one in terms of the speed and performance that would be interesting to examine.",
            "Yes, how much better the Unionists and the intersection, yes, at least two or more methods?",
            "Yes, exactly.",
            "Put more questions for Young.",
            "I'm.",
            "OK, if not then we will go then we first of all thank young for his talk.",
            "Thank you and OK."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Presentation topic is contact specific transcriptional regulatory network inference from global gene expression map using double 280 tests and the title is a long but you will see the method is quite simple.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in this presentation, at first I will give a brief introduction about what is transcriptional regulatory network and then I will introduce a method which use T test to infer regulator interactions.",
                    "label": 0
                },
                {
                    "sent": "At the end I will show the experiment to result of the proposed method E. Coli yeast and human data site.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is the transcriptional regulator in network?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We know cell can perform a very complex site of biological process.",
                    "label": 0
                },
                {
                    "sent": "The regulation of this process consists of many different mechanisms such as transcriptional regulation, posttranscriptional regulation, translational regulation, transcriptional regulation controls, which genes are transcribed into M RNA.",
                    "label": 1
                },
                {
                    "sent": "Transcription factors are special type of proteins.",
                    "label": 0
                },
                {
                    "sent": "They prove very important role in.",
                    "label": 0
                },
                {
                    "sent": "Transcriptional regulation and they can bend to the upstream region of other genes and then influence the expression of these genes.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In this slide, I show a part of the Regulation Regulation for nutrition utilization in East and DL2, and there are similar to yeast genes.",
                    "label": 0
                },
                {
                    "sent": "Their activity, many controlled as a transcriptional level.",
                    "label": 0
                },
                {
                    "sent": "Dot DLL 3.",
                    "label": 0
                },
                {
                    "sent": "Anna JT van are they are transcription factors when the non preferred natural resources is available is a 2DL2 and L center highly expressed.",
                    "label": 0
                },
                {
                    "sent": "Jail three is translocated to cytoplasm due to the protein.",
                    "label": 0
                },
                {
                    "sent": "Protein interactions with Ure true, then preferred nitrogen sources, is present in the environment when.",
                    "label": 0
                },
                {
                    "sent": "Only now only non preferred sources available, Jalen Three is released from his interactions and enter the nucleus where it band to the upstream region of DL2DL7 and activate their expression.",
                    "label": 0
                },
                {
                    "sent": "The regulatory relationships between transcription factors and their targets can be considered as a network called transcriptional regulatory network.",
                    "label": 1
                },
                {
                    "sent": "Regulatory network their chance of regulatory interactions.",
                    "label": 0
                },
                {
                    "sent": "For example, Jalen 322 J TMG 81, two DL2.",
                    "label": 0
                },
                {
                    "sent": "In addition, the gene might be regulated by multiple transcription factors.",
                    "label": 0
                },
                {
                    "sent": "For example the DL7 DL two is regulated by GTR GT band, GLN 3 so the structure of a regulatory network is.",
                    "label": 0
                },
                {
                    "sent": "Not simple.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how can we reconstruct regulatory?",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At work, my solution is we can use gene expression data to reconstruct the regulatory network.",
                    "label": 1
                },
                {
                    "sent": "The basic idea of this approach is molecular interaction between transcription factors and touches or depending activity of transcription factors to the upstream region of their target.",
                    "label": 0
                },
                {
                    "sent": "Mecosta Co expression between the expression profiles of transcription factors and their target.",
                    "label": 1
                },
                {
                    "sent": "Right now we look now we look at an example.",
                    "label": 0
                },
                {
                    "sent": "This figure shows the expression value for Easter gene DL, DL tool and DL7 and their transcription factors.",
                    "label": 0
                },
                {
                    "sent": "JT 1 GRN 3 in East Data site is Yellow line separate conditions.",
                    "label": 0
                },
                {
                    "sent": "There only non only non preferred.",
                    "label": 0
                },
                {
                    "sent": "Nitrogen sources is available from conditions where preferred nitrogen sources is available.",
                    "label": 0
                },
                {
                    "sent": "We can see that the expression profile of these two genes and there are two transcription factors share a common pattern.",
                    "label": 0
                },
                {
                    "sent": "That is the only highly expressed in non preferred nitrogen sources, not express or an organic surprised and preferred nitrogen sources.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So many algorithms have been proposed to inform regulatory network from expression data.",
                    "label": 0
                },
                {
                    "sent": "Essentially, they use a different technique to detect correlation between regulator and gene pairs.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And a the older two type of two inputs.",
                    "label": 0
                },
                {
                    "sent": "The first one is a gene matrix of expression data, the 2nd is a list of candidate transcription factor.",
                    "label": 1
                },
                {
                    "sent": "The output of algorithm is an ordered list of putative regulator gene interactions given a set of known interactions, we can evaluate the performance of the algorithm using the precision and recall curves and the precision for the top K prediction in the order list is.",
                    "label": 1
                },
                {
                    "sent": "Defined as the number of true positives from Mr. K interactions divided by the number of K and corresponding recall is defined as the number of true positives from is K interactions divided by the total number of known interactions.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There are also many benchmark data site for evaluating the performance of this algorithm.",
                    "label": 0
                },
                {
                    "sent": "Here I at least two.",
                    "label": 0
                },
                {
                    "sent": "The first line is Easter data site which measures East response to different environmental stress.",
                    "label": 0
                },
                {
                    "sent": "The second is equal.",
                    "label": 0
                },
                {
                    "sent": "I decide which consists of expression, value collected and different goals condition and genetic mutation.",
                    "label": 0
                },
                {
                    "sent": "And I we also use this two decide to evaluate the performance of the proposed method.",
                    "label": 0
                },
                {
                    "sent": "A match of cellular response in E. Coli is controlled at transcriptional level, so the so the transcription factor and target in E. Coli is more coexpressed than that in East, so most algorithm obtain better performance in E. COLI data site.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for most network reconstruction method rely on very complex mathematic models such as differential equation and Bayesian networks, and they perform very well but.",
                    "label": 0
                },
                {
                    "sent": "It may be difficult for non by informatic user to apply them because the configuration of this program is is not easy, such as how to improve convergence rate or how to avoid local optimum.",
                    "label": 0
                },
                {
                    "sent": "We apply a very simple static Model T test 22 info regulatory interaction, forgiven gene.",
                    "label": 0
                },
                {
                    "sent": "We first determine the critical contrast of this gene, which consists of two sides of conditions and.",
                    "label": 0
                },
                {
                    "sent": "This gene is differentially expressed between these two sides.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And given a data set with K samples, we first ordered the expression value of R gene G into an ordered list.",
                    "label": 0
                },
                {
                    "sent": "So then we can build partition with two condition clusters C1 and C2.",
                    "label": 0
                },
                {
                    "sent": "From this ordered list an the maximum expression value in silver is not more than the minimum expression value in C2.",
                    "label": 0
                },
                {
                    "sent": "Then we can.",
                    "label": 0
                },
                {
                    "sent": "Differential expression of G between 7:00 and C2 can be determined by T statistic.",
                    "label": 1
                },
                {
                    "sent": "So by this way we can extract K minus land partitions from Lisa.",
                    "label": 0
                },
                {
                    "sent": "Ordered list among key management positions.",
                    "label": 0
                },
                {
                    "sent": "We select one in which G has the maximum T statistic as the critical contrast for G.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we look at an example to illustrate the idea of critical contrast.",
                    "label": 1
                },
                {
                    "sent": "At least figure showed sorted expression value of East Gene DL two from the East Data Site.",
                    "label": 0
                },
                {
                    "sent": "This black line separated condition into two condition clusters.",
                    "label": 0
                },
                {
                    "sent": "They represent the critical contrast.",
                    "label": 1
                },
                {
                    "sent": "We can see the DL two is highly expressed in one condition.",
                    "label": 0
                },
                {
                    "sent": "Cluster will not express or down expressed in the other.",
                    "label": 0
                },
                {
                    "sent": "Condition cluster.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Really use expression data to inform regulatory interaction.",
                    "label": 0
                },
                {
                    "sent": "Essentially we want to detect the Co expression between transcription factor and jeans.",
                    "label": 0
                },
                {
                    "sent": "So in this work we and codes fashion means the transcription factor of a gene is also differentially expressed in the critical contrast of this train.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So, so we defined regulatory score between transcription factor F&G as the T statistic of F in the critical contrast of G. So the higher regulatory scored more confidence will assign to the interaction between F&G and in order to make the regulatory score from different statistique come parable, we normalize this regulatory score by.",
                    "label": 0
                },
                {
                    "sent": "Substracting the mean and standard deviation of regulatory scores for all candidate transcription factor in this critical contrast.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this method doesn't assume the Co expression between the transcription factors and their target is linear or will nonlinear, but it's required the transcription factor of a given gene is a more differentially expressed in the critical contrast of this gene compared to other candidate transcription factors.",
                    "label": 1
                },
                {
                    "sent": "So this design make this method able to detect locally coexpressed regulator gene pairs.",
                    "label": 1
                },
                {
                    "sent": "We will see it in the experimental results section.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we first apply this method in the two benchmark data side, the colon, the East Data site and also.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We compared its performance with several existing algorithm.",
                    "label": 0
                },
                {
                    "sent": "This page list algorithm included in the comparison.",
                    "label": 0
                },
                {
                    "sent": "Also we include the Pearson Correlation and Spearman color relation into the comparison as a baseline because they probably is the most simple network reconstruction method.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this figure shows the recall precision curve from the top 500 prediction given by each method in the E. Coli data side.",
                    "label": 0
                },
                {
                    "sent": "Identified the gene three and CR outperformed the others, and also we notice the Pearson correlation also obtained really good good performance public.",
                    "label": 0
                },
                {
                    "sent": "This means because in the equal added site transcription factors and their target are strongly hikes priced.",
                    "label": 0
                },
                {
                    "sent": "So we can use a very simple method like Pearson correlation to get a good performance.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This figure shows the recall precision curve.",
                    "label": 0
                },
                {
                    "sent": "In the in the Easter date aside, in this data side, the Clr and T test based method of obtaining better performance than the other algorithms.",
                    "label": 0
                },
                {
                    "sent": "So the figure is a public is a very hard to make a conclusion.",
                    "label": 0
                },
                {
                    "sent": "So here we calculate the area and recall precision curves from the previous two figures.",
                    "label": 0
                },
                {
                    "sent": "the T test based method is the third best in the equal at the site published.",
                    "label": 0
                },
                {
                    "sent": "The second best in the East data set.",
                    "label": 0
                },
                {
                    "sent": "So normally when we propose a new method, we want to want it to be it.",
                    "label": 0
                },
                {
                    "sent": "All existing method.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately this is not the case for here, but the difference between the performance of this algorithm is not very significant, especially for the Easter data site.",
                    "label": 0
                },
                {
                    "sent": "So here we.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm more interested if the prediction given by the our algorithm is different from the prediction by the other algorithm and how they are different.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So so now we forced to defend distance between two algorithm as the number of non overlap interactions from their top 500 predictions.",
                    "label": 1
                },
                {
                    "sent": "This figure shows the distance between algorithm in the East Data Site and Jeffrey and infer later are very close because they both based on regression tree, two info regulatory interactions in free later cell R&T test based method occupy.",
                    "label": 0
                },
                {
                    "sent": "Relative more more unique locations and the T test based method rely on differential expression testing.",
                    "label": 0
                },
                {
                    "sent": "It is a more sensitive to locally locally expressed regulator gene pairs.",
                    "label": 0
                },
                {
                    "sent": "We suspect this make the result of the test based method different from others.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This figure shows the distribution of Pearson correlation between the transcription factors and their target from the five top 500 top predictions in the Easter data side you can see the prediction given by the T test based method.",
                    "label": 1
                },
                {
                    "sent": "Have a lower Pearson correlations, so indicating the transcription factor locally cold pressed with their targets.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Addition, we also apply this method on the big human data.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "At least they decided consist of modern thousand samples collected from 64 tissues.",
                    "label": 1
                },
                {
                    "sent": "So this data site is a very good place to test if the method can detect a tissue specific regulatory interaction.",
                    "label": 0
                },
                {
                    "sent": "Here we show the top 2 predictions from the T test based method.",
                    "label": 1
                },
                {
                    "sent": "The predictions include transcription factor, TBX 5 which is.",
                    "label": 1
                },
                {
                    "sent": "Related to heart development and the transcription factor GCN one which is play central transformation factors also is.",
                    "label": 0
                },
                {
                    "sent": "Here we show the top two transcription factor top two regulations from Clr.",
                    "label": 0
                },
                {
                    "sent": "The transcription factors selected by cell R is ABBX and then 24.",
                    "label": 0
                },
                {
                    "sent": "Both of them related cell cycle.",
                    "label": 1
                },
                {
                    "sent": "Development.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this figure we show the expression value for the interactions described in the previous page and in the predictions selected by the T test based method, which in the right and blue color the transcription factor.",
                    "label": 0
                },
                {
                    "sent": "Only Cody surprised we are with their target in a small number of samples.",
                    "label": 0
                },
                {
                    "sent": "Actually, it's samples are collected from a particular tissue type.",
                    "label": 0
                },
                {
                    "sent": "For example, for the DBX 5, this transcription factor is only coincides with their target in the heart tissue samples.",
                    "label": 0
                },
                {
                    "sent": "And also here we see the prediction for from Clr.",
                    "label": 0
                },
                {
                    "sent": "Predict Lisa interactions.",
                    "label": 0
                },
                {
                    "sent": "The transcription factors are globally coexpressed with their target across samples from different tissue types.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So so here I give a brief summary about the proposed method.",
                    "label": 0
                },
                {
                    "sent": "So actually this method uses a very simple static model, the T test.",
                    "label": 0
                },
                {
                    "sent": "So it's quite fast even in the huge human data set is take a last minute to get the result.",
                    "label": 0
                },
                {
                    "sent": "For other method included in the in the comparison there are can take maybe several hours, but the other method we have to.",
                    "label": 0
                },
                {
                    "sent": "Get help from cluster.",
                    "label": 0
                },
                {
                    "sent": "Otherwise we cannot run it in a decent time and also it's a method can detect locally coexpressed regulator gene pairs.",
                    "label": 0
                },
                {
                    "sent": "The limitation of this method is its main missed.",
                    "label": 0
                },
                {
                    "sent": "Some Global Co Express regulatory interaction and this type of interaction is quite popular.",
                    "label": 0
                },
                {
                    "sent": "For example in E. Coli.",
                    "label": 0
                },
                {
                    "sent": "So the performance of this method in equalized not very good.",
                    "label": 0
                },
                {
                    "sent": "We think this method can provide complementary information for existing network algorithm, so probably integrating its result with the existing algorithm in mental linear approach is a very promising directions.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "So any questions?",
                    "label": 0
                },
                {
                    "sent": "I have a couple of concern with the T test because when using the T stat T test assumption you make, this data is normally distributed.",
                    "label": 0
                },
                {
                    "sent": "There are so many papers it said that there we it's assumption for normal normality of the expression data set.",
                    "label": 0
                },
                {
                    "sent": "It's not optimal because sometimes even my personal experiences when I see that the expression data, sometimes it's really deviate from the normal distribution, sometimes cured.",
                    "label": 0
                },
                {
                    "sent": "It's not symmetrical in heavy tail or something like that.",
                    "label": 0
                },
                {
                    "sent": "Do you think that's because of that you're violating the normality assumption, or that's why your method is not show up orbiting them?",
                    "label": 0
                },
                {
                    "sent": "The pre existing approaches.",
                    "label": 0
                },
                {
                    "sent": "Do you think that's one of the reason maybe?",
                    "label": 0
                },
                {
                    "sent": "And maybe maybe, but I think the normality is from my opinion is not a big concern because if you have a.",
                    "label": 0
                },
                {
                    "sent": "A big enough number of data and normal life more than 10 or something.",
                    "label": 0
                },
                {
                    "sent": "I think normality is is OK is.",
                    "label": 0
                },
                {
                    "sent": "Yeah, probably.",
                    "label": 0
                },
                {
                    "sent": "You can use other types like ranking based test.",
                    "label": 0
                },
                {
                    "sent": "Yeah, probably make it for example like the Kruskal Wallis test.",
                    "label": 0
                },
                {
                    "sent": "Maybe you can get more reliable reliable result, but.",
                    "label": 0
                },
                {
                    "sent": "I don't think we can get a big improvement in the result because when I see that user data sort of huge sample size, sample size is really big according to the power law.",
                    "label": 0
                },
                {
                    "sent": "If you have enough sample size, you can reject any null hypothesis that everyone knows, so maybe that's one of the reasons.",
                    "label": 0
                },
                {
                    "sent": "Help you method gain little bit up because maybe that's it makes a violation of the assumption of normality.",
                    "label": 0
                },
                {
                    "sent": "It makes help you to overcome this problem because we are using the huge sample size data set.",
                    "label": 0
                },
                {
                    "sent": "Maybe that's one of the reason?",
                    "label": 0
                },
                {
                    "sent": "Yeah, I agree.",
                    "label": 0
                },
                {
                    "sent": "The big sample size definitely will help the program.",
                    "label": 0
                },
                {
                    "sent": "Yeah, definitely you showed results on better the predictions of different methods overlap.",
                    "label": 0
                },
                {
                    "sent": "You know, there they correlate Invensense or the other.",
                    "label": 0
                },
                {
                    "sent": "Did you also check whether the intersection of the predictions of two or more methods is more accurate than one single method alone?",
                    "label": 0
                },
                {
                    "sent": "That would be a very easy way of combining different methods an.",
                    "label": 0
                },
                {
                    "sent": "Intersection I did some similar work.",
                    "label": 0
                },
                {
                    "sent": "Is the direction, but it's not integrated result from this method, but it is from module network learning, but surprising intersection is not good choice.",
                    "label": 0
                },
                {
                    "sent": "Union is better than intersection and there are some other more sophisticated method for integrating ranking list such as.",
                    "label": 0
                },
                {
                    "sent": "Which is the best?",
                    "label": 0
                },
                {
                    "sent": "Markov Monte Carlo or something, and probably they can improve performance a little bit, but generally I feel the union is the best one in terms of the speed and performance that would be interesting to examine.",
                    "label": 0
                },
                {
                    "sent": "Yes, how much better the Unionists and the intersection, yes, at least two or more methods?",
                    "label": 0
                },
                {
                    "sent": "Yes, exactly.",
                    "label": 0
                },
                {
                    "sent": "Put more questions for Young.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                },
                {
                    "sent": "OK, if not then we will go then we first of all thank young for his talk.",
                    "label": 0
                },
                {
                    "sent": "Thank you and OK.",
                    "label": 0
                }
            ]
        }
    }
}