{
    "id": "tlqok7eaz645fh4a7xjpdlgn5iyqm54g",
    "title": "Ranking by Stealing Human Cycles",
    "info": {
        "author": [
            "Tingfan Wu, UC San Diego"
        ],
        "published": "Feb. 25, 2007",
        "recorded": "August 2006",
        "category": [
            "Top->Computer Science"
        ]
    },
    "url": "http://videolectures.net/mlss06tw_wu_rshc/",
    "segmentation": [
        [
            "I come from National Taiwan University.",
            "And today I'm going to talk about the topic ranking by stealing human cycles.",
            "And this is a joint work with my classmate funds equal and the two professors, doctor Dean and Data World."
        ],
        [
            "Our friends will.",
            "I will introduce the problem we are going to solve given a Dutch number of photos, how can we obtain the global ranking effectively and efficiently?",
            "Here I'm going to address that a class of problem you see.",
            "Currently this problem cannot solve be solved by efficient vision algorithms because.",
            "Tailoring a photo is hot or not.",
            "Currently only human can do this.",
            "But if there are a large number of photos.",
            "You cannot hire A secretary to sort the feature for you if we hire.",
            "If you hire me, maybe I will be happy to see many of beautiful girls at first, but finally I will be bold to see too many pictures.",
            "So we developed an algorithm that we can combine the power of human to tell hot or not and also user computer computation of computers to combine the human power into server.",
            "Dutch problem.",
            "Let's see how hard will not solve this problem."
        ],
        [
            "Basically, the founders of Harden on hotornot.",
            "They create a website and when there is a.",
            "We Internet visitor come in, they randomly showed a photo to a visitor and ask for a visitor to score it from one to 10.",
            "So they successfully divide a large ranking problem in too many scoring subproblems and ask Internet visitors to contribute their human cycle to solve the scoring problem, and they can obtain the global ranking by sorting the average score.",
            "This sounds really good."
        ],
        [
            "But there are some drawbacks of the scoring method.",
            "Please check these three photos.",
            "We assume that this girl is the hardest one so.",
            "Maybe you guys have different opinions, but here I say she is practice one and so we have assumed the real score 6, five and four and there is a nice voter.",
            "I mean some guys very nice so he or she is always saying good of others so he always gives higher score than real score seven and six.",
            "So in this case it is.",
            "2 two points higher than real score, but On the contrary, they will be tough voted for this top voters.",
            "That is, he always give those goals that is full and three.",
            "So by using the scoring method, we calculate the average score, but there is the problem happens that the order of every score is completely different from the real score.",
            "So the scoring method doesn't does not work here.",
            "OK, so what's the problem?",
            "That risk think how you give a score when human.",
            "OK, if I see a photo, how can I give a scored?",
            "Basically we compare the photo with previous scene once.",
            "So from the time that we were born until now I see so many faces and bodies of people.",
            "There was actually a photo.",
            "I compare it with the previous scene once.",
            "But different people may have different backgrounds coming from different parts of the world, so the model in our minds are different and so different people may have different scale, thus give different label of scores.",
            "So scoring method may not work in this situation, even especially the number of votes is small."
        ],
        [
            "But the other problem, scoring versus that set up here are not easy to score.",
            "For example, this is a picture generated from mathematical fractal Ann.",
            "I think many people I don't think injury we don't see.",
            "We have never seen such kind of photo, so we don't have the previous simple pictures.",
            "We don't have internal models in our mind, so we don't know how to give.",
            "A scorer to such photo.",
            "But if if we have two photos.",
            "It might be easier for you to say, oh, I prefer East Wilder than this one.",
            "So we hold that opinion that comparison is easier and more objective."
        ],
        [
            "Hey so in our system we decided to divide the drinking problem in too many pair comparisons and ask into the visitor to help us tell which page which one of the pair is better so that we can compare the subproblem combiner subproblems into a global ranking.",
            "But there are some new challenges.",
            "First, the number of objects is very large.",
            "For example, in hot or not till now they claim that they have 20 four millions of photos.",
            "If we simply take all K choose two pairs that will be so we had to tear out pairs.",
            "It is not possible.",
            "It is not easy for computer to store such big problems and solving such a big optimization problem would be a travel.",
            "So the more practical ways that we only select.",
            "A small subset of pairs.",
            "So they can purchase virtually select imperious may not be used, may may not work.",
            "The students who passed missed following two conditions.",
            "First is connectivity conditions that is in our assistant.",
            "Given any two photo.",
            "Even they were not directly compared.",
            "And they must be at least indirectly compared.",
            "That is, there must exist some intermediate photos.",
            "Say I want I do I3 etc S. That they act X intermediate photo so that I compare to.",
            "I want I want compared to I2.",
            "Jane, so these two I2 photos I NJR indirectly compared.",
            "Second, this.",
            "Actually must meet that fairness condition.",
            "We wanted the photos in our system.",
            "Each photo is compared to send number of opponents.",
            "This is because if one photo is completely only to 1 to the active one, opponents he or she may argue that.",
            "The opponent is too strong or too weak so that he or she get best score.",
            "So if everybody every photo gets equal number of opponents, the result will be more fair."
        ],
        [
            "So we decided to use a design code secret design that is OK. Take this for example.",
            "There is 7 objects.",
            "Remember it from zero to 6.",
            "And then the secret of step one will be paired 011223344556 and six back to zero, and the secret of step three will be released so that check if this design flow field two conditions.",
            "First, the connectivity conditions.",
            "Well from this connection using 0 connected 11 connector, two at the back to zero forming a cycle.",
            "So the collectively condition is guaranteed.",
            "Then we check the fairness condition.",
            "Take these two objects zero and one for example.",
            "They all compared to the other four different opponents from 440 is compared to what one?",
            "At zero computers three and here compared to six and compared to four.",
            "And this design has been, well, we started in a field in statistics called experimental design and in this field.",
            "Took a measurement code efficiency to say whether a design is a good or not because we can choose what was step one.",
            "Step 3.",
            "Maybe step one Step 2 so they have a measurement to say what you want.",
            "Selection is better, so in our system we always use the most efficient."
        ],
        [
            "Design.",
            "OK, so as soon as we have children pairs, how can we combine two global ranking here we applied so famous Bradley Terry model for each photo or each object.",
            "We have a hard hardness score for it.",
            "That is PJ.",
            "And we assume that probability after I beat up JJ is P. I / P I plus PJ.",
            "And in our experiment, we observed that our project updates.",
            "I please update the IG times.",
            "So we can draw a maximum like back in the hood like this and this optimization has a unique global maximum.",
            "If the previous connectivity condition holds."
        ],
        [
            "OK, now we are going to the real experiment.",
            "To compare the two methods scoring and paired, we ask several.",
            "That is 60 volunteers to answer 50 each for each voter.",
            "Answer 50 Scoring question and 50 pairs comparison question.",
            "So we actually build a website that looked like hot or not and the other websites have shown two picture at one time.",
            "Ask the voters, choose tell which ones better from a pair.",
            "And then we divide voters into two independent groups.",
            "What the first one act as training data and secular ethics testing data?",
            "Then we in the training phase we use the results from training data to calculate ranking using scoring method and pair comparison method.",
            "Then each instance in the testing data are used to test whether the drinking is good or not.",
            "So for example this ranking if if in this ranking object 5 bits after three bits after four and two one and the inner testing test data we have all this.",
            "This pair of two bits, one and then we check this pair against drinking.",
            "If it is convinced if they are consistent.",
            "So for this one, 2 bits, 12 bits one.",
            "So this is a correct prediction for this one three, 4.3.",
            "And here these two is different, so this is incorrect prediction and so on.",
            "So in this case we can calculate the accuracy will be 3 correct and one error that is 75%."
        ],
        [
            "So here is our experimental result.",
            "If the if there are sufficient training data?",
            "So that is every voter contributes 50 web clicks human cycle and we can see the accuracy of.",
            "Pair comparison and scoring is very odd.",
            "Knows there is no significant difference between them because if there are insufficient number of training data.",
            "The voter variation of will be illuminated in from the story method, but if we subsample the training data to 20, web crisper voter or even fewer, we can see that the prior comparative method beats the scoring method largely.",
            "So we argue that.",
            "Our her computer method will perform better in real situation because.",
            "On the Internet, in general of Visitor will not answering the pair comparison or scoring question 450 times.",
            "Nobody has so many so much time usually.",
            "Voter or visitor only do 10 or 20 questions.",
            "So in this case our method would be."
        ],
        [
            "Better so here comes the conclusion.",
            "If there if voter only give a low number of clicks per voter, the pair comparison measure outperforms the scoring.",
            "2nd.",
            "In our design, the pair come here isn't a voter only have to make a choice between two photos telling which one is better in the pair, but in the scoring method of voter has to has to decide from score one to score 10, so we assume that binary choices will be easier for easier than 10.",
            "Joyce is in our experiment, we do measure.",
            "The time required for each voter to do quite weather question, so obviously that each player takes less time than each scoring problem.",
            "But we are not satisfied with such small scale.",
            "We want to do more to do a real experiment and then make more contributions to steal the motorcycles around the world.",
            "So we build a website called harder or larger.",
            "And so please help us to get more votes.",
            "And here we are.",
            "I want to each address the issue, which would be a research problem in the future that is in our experiments the number of objects is fixed 250.",
            "That is, in our experience there are only 50 photos.",
            "So we can use constant players.",
            "Select constant pairs are actually in our experiment, and secret desire will be no problem.",
            "But in real in real application every day there will be user that ask to add their photo or delete a photo from our system.",
            "So how to design a pair selection that can act well in the incremental and decremental scenarios in important?",
            "So thank you everyone.",
            "So you want to show the website to you.",
            "So here is the website.",
            "So you can see Brendan shows two photos so you can click.",
            "For example, I think this one looks better, so I click it.",
            "So here you will show OK. She wins one time because we only have we have.",
            "How have we have 10,100 thousands of pictures?",
            "So not only there are too many people help us till only a few people help us.",
            "So you see this pair in this pair.",
            "She wins only one time.",
            "And here is a whole thin.",
            "So you can see in our city we drink these photos.",
            "Is top 10.",
            "The other codes are they?",
            "OK, so thank you very much.",
            "Rolling thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I come from National Taiwan University.",
                    "label": 1
                },
                {
                    "sent": "And today I'm going to talk about the topic ranking by stealing human cycles.",
                    "label": 1
                },
                {
                    "sent": "And this is a joint work with my classmate funds equal and the two professors, doctor Dean and Data World.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our friends will.",
                    "label": 0
                },
                {
                    "sent": "I will introduce the problem we are going to solve given a Dutch number of photos, how can we obtain the global ranking effectively and efficiently?",
                    "label": 1
                },
                {
                    "sent": "Here I'm going to address that a class of problem you see.",
                    "label": 0
                },
                {
                    "sent": "Currently this problem cannot solve be solved by efficient vision algorithms because.",
                    "label": 0
                },
                {
                    "sent": "Tailoring a photo is hot or not.",
                    "label": 0
                },
                {
                    "sent": "Currently only human can do this.",
                    "label": 0
                },
                {
                    "sent": "But if there are a large number of photos.",
                    "label": 0
                },
                {
                    "sent": "You cannot hire A secretary to sort the feature for you if we hire.",
                    "label": 0
                },
                {
                    "sent": "If you hire me, maybe I will be happy to see many of beautiful girls at first, but finally I will be bold to see too many pictures.",
                    "label": 0
                },
                {
                    "sent": "So we developed an algorithm that we can combine the power of human to tell hot or not and also user computer computation of computers to combine the human power into server.",
                    "label": 0
                },
                {
                    "sent": "Dutch problem.",
                    "label": 0
                },
                {
                    "sent": "Let's see how hard will not solve this problem.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Basically, the founders of Harden on hotornot.",
                    "label": 0
                },
                {
                    "sent": "They create a website and when there is a.",
                    "label": 0
                },
                {
                    "sent": "We Internet visitor come in, they randomly showed a photo to a visitor and ask for a visitor to score it from one to 10.",
                    "label": 0
                },
                {
                    "sent": "So they successfully divide a large ranking problem in too many scoring subproblems and ask Internet visitors to contribute their human cycle to solve the scoring problem, and they can obtain the global ranking by sorting the average score.",
                    "label": 0
                },
                {
                    "sent": "This sounds really good.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But there are some drawbacks of the scoring method.",
                    "label": 1
                },
                {
                    "sent": "Please check these three photos.",
                    "label": 0
                },
                {
                    "sent": "We assume that this girl is the hardest one so.",
                    "label": 0
                },
                {
                    "sent": "Maybe you guys have different opinions, but here I say she is practice one and so we have assumed the real score 6, five and four and there is a nice voter.",
                    "label": 1
                },
                {
                    "sent": "I mean some guys very nice so he or she is always saying good of others so he always gives higher score than real score seven and six.",
                    "label": 0
                },
                {
                    "sent": "So in this case it is.",
                    "label": 0
                },
                {
                    "sent": "2 two points higher than real score, but On the contrary, they will be tough voted for this top voters.",
                    "label": 0
                },
                {
                    "sent": "That is, he always give those goals that is full and three.",
                    "label": 0
                },
                {
                    "sent": "So by using the scoring method, we calculate the average score, but there is the problem happens that the order of every score is completely different from the real score.",
                    "label": 0
                },
                {
                    "sent": "So the scoring method doesn't does not work here.",
                    "label": 0
                },
                {
                    "sent": "OK, so what's the problem?",
                    "label": 0
                },
                {
                    "sent": "That risk think how you give a score when human.",
                    "label": 1
                },
                {
                    "sent": "OK, if I see a photo, how can I give a scored?",
                    "label": 0
                },
                {
                    "sent": "Basically we compare the photo with previous scene once.",
                    "label": 0
                },
                {
                    "sent": "So from the time that we were born until now I see so many faces and bodies of people.",
                    "label": 0
                },
                {
                    "sent": "There was actually a photo.",
                    "label": 0
                },
                {
                    "sent": "I compare it with the previous scene once.",
                    "label": 0
                },
                {
                    "sent": "But different people may have different backgrounds coming from different parts of the world, so the model in our minds are different and so different people may have different scale, thus give different label of scores.",
                    "label": 0
                },
                {
                    "sent": "So scoring method may not work in this situation, even especially the number of votes is small.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But the other problem, scoring versus that set up here are not easy to score.",
                    "label": 0
                },
                {
                    "sent": "For example, this is a picture generated from mathematical fractal Ann.",
                    "label": 0
                },
                {
                    "sent": "I think many people I don't think injury we don't see.",
                    "label": 0
                },
                {
                    "sent": "We have never seen such kind of photo, so we don't have the previous simple pictures.",
                    "label": 0
                },
                {
                    "sent": "We don't have internal models in our mind, so we don't know how to give.",
                    "label": 0
                },
                {
                    "sent": "A scorer to such photo.",
                    "label": 0
                },
                {
                    "sent": "But if if we have two photos.",
                    "label": 0
                },
                {
                    "sent": "It might be easier for you to say, oh, I prefer East Wilder than this one.",
                    "label": 0
                },
                {
                    "sent": "So we hold that opinion that comparison is easier and more objective.",
                    "label": 1
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hey so in our system we decided to divide the drinking problem in too many pair comparisons and ask into the visitor to help us tell which page which one of the pair is better so that we can compare the subproblem combiner subproblems into a global ranking.",
                    "label": 0
                },
                {
                    "sent": "But there are some new challenges.",
                    "label": 1
                },
                {
                    "sent": "First, the number of objects is very large.",
                    "label": 1
                },
                {
                    "sent": "For example, in hot or not till now they claim that they have 20 four millions of photos.",
                    "label": 0
                },
                {
                    "sent": "If we simply take all K choose two pairs that will be so we had to tear out pairs.",
                    "label": 0
                },
                {
                    "sent": "It is not possible.",
                    "label": 0
                },
                {
                    "sent": "It is not easy for computer to store such big problems and solving such a big optimization problem would be a travel.",
                    "label": 0
                },
                {
                    "sent": "So the more practical ways that we only select.",
                    "label": 0
                },
                {
                    "sent": "A small subset of pairs.",
                    "label": 1
                },
                {
                    "sent": "So they can purchase virtually select imperious may not be used, may may not work.",
                    "label": 0
                },
                {
                    "sent": "The students who passed missed following two conditions.",
                    "label": 0
                },
                {
                    "sent": "First is connectivity conditions that is in our assistant.",
                    "label": 0
                },
                {
                    "sent": "Given any two photo.",
                    "label": 0
                },
                {
                    "sent": "Even they were not directly compared.",
                    "label": 0
                },
                {
                    "sent": "And they must be at least indirectly compared.",
                    "label": 0
                },
                {
                    "sent": "That is, there must exist some intermediate photos.",
                    "label": 0
                },
                {
                    "sent": "Say I want I do I3 etc S. That they act X intermediate photo so that I compare to.",
                    "label": 0
                },
                {
                    "sent": "I want I want compared to I2.",
                    "label": 0
                },
                {
                    "sent": "Jane, so these two I2 photos I NJR indirectly compared.",
                    "label": 0
                },
                {
                    "sent": "Second, this.",
                    "label": 0
                },
                {
                    "sent": "Actually must meet that fairness condition.",
                    "label": 1
                },
                {
                    "sent": "We wanted the photos in our system.",
                    "label": 0
                },
                {
                    "sent": "Each photo is compared to send number of opponents.",
                    "label": 0
                },
                {
                    "sent": "This is because if one photo is completely only to 1 to the active one, opponents he or she may argue that.",
                    "label": 0
                },
                {
                    "sent": "The opponent is too strong or too weak so that he or she get best score.",
                    "label": 0
                },
                {
                    "sent": "So if everybody every photo gets equal number of opponents, the result will be more fair.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we decided to use a design code secret design that is OK. Take this for example.",
                    "label": 0
                },
                {
                    "sent": "There is 7 objects.",
                    "label": 0
                },
                {
                    "sent": "Remember it from zero to 6.",
                    "label": 0
                },
                {
                    "sent": "And then the secret of step one will be paired 011223344556 and six back to zero, and the secret of step three will be released so that check if this design flow field two conditions.",
                    "label": 0
                },
                {
                    "sent": "First, the connectivity conditions.",
                    "label": 0
                },
                {
                    "sent": "Well from this connection using 0 connected 11 connector, two at the back to zero forming a cycle.",
                    "label": 0
                },
                {
                    "sent": "So the collectively condition is guaranteed.",
                    "label": 0
                },
                {
                    "sent": "Then we check the fairness condition.",
                    "label": 0
                },
                {
                    "sent": "Take these two objects zero and one for example.",
                    "label": 0
                },
                {
                    "sent": "They all compared to the other four different opponents from 440 is compared to what one?",
                    "label": 0
                },
                {
                    "sent": "At zero computers three and here compared to six and compared to four.",
                    "label": 0
                },
                {
                    "sent": "And this design has been, well, we started in a field in statistics called experimental design and in this field.",
                    "label": 0
                },
                {
                    "sent": "Took a measurement code efficiency to say whether a design is a good or not because we can choose what was step one.",
                    "label": 0
                },
                {
                    "sent": "Step 3.",
                    "label": 0
                },
                {
                    "sent": "Maybe step one Step 2 so they have a measurement to say what you want.",
                    "label": 0
                },
                {
                    "sent": "Selection is better, so in our system we always use the most efficient.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Design.",
                    "label": 0
                },
                {
                    "sent": "OK, so as soon as we have children pairs, how can we combine two global ranking here we applied so famous Bradley Terry model for each photo or each object.",
                    "label": 0
                },
                {
                    "sent": "We have a hard hardness score for it.",
                    "label": 0
                },
                {
                    "sent": "That is PJ.",
                    "label": 0
                },
                {
                    "sent": "And we assume that probability after I beat up JJ is P. I / P I plus PJ.",
                    "label": 0
                },
                {
                    "sent": "And in our experiment, we observed that our project updates.",
                    "label": 0
                },
                {
                    "sent": "I please update the IG times.",
                    "label": 0
                },
                {
                    "sent": "So we can draw a maximum like back in the hood like this and this optimization has a unique global maximum.",
                    "label": 1
                },
                {
                    "sent": "If the previous connectivity condition holds.",
                    "label": 1
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, now we are going to the real experiment.",
                    "label": 0
                },
                {
                    "sent": "To compare the two methods scoring and paired, we ask several.",
                    "label": 0
                },
                {
                    "sent": "That is 60 volunteers to answer 50 each for each voter.",
                    "label": 0
                },
                {
                    "sent": "Answer 50 Scoring question and 50 pairs comparison question.",
                    "label": 0
                },
                {
                    "sent": "So we actually build a website that looked like hot or not and the other websites have shown two picture at one time.",
                    "label": 0
                },
                {
                    "sent": "Ask the voters, choose tell which ones better from a pair.",
                    "label": 0
                },
                {
                    "sent": "And then we divide voters into two independent groups.",
                    "label": 0
                },
                {
                    "sent": "What the first one act as training data and secular ethics testing data?",
                    "label": 1
                },
                {
                    "sent": "Then we in the training phase we use the results from training data to calculate ranking using scoring method and pair comparison method.",
                    "label": 1
                },
                {
                    "sent": "Then each instance in the testing data are used to test whether the drinking is good or not.",
                    "label": 0
                },
                {
                    "sent": "So for example this ranking if if in this ranking object 5 bits after three bits after four and two one and the inner testing test data we have all this.",
                    "label": 0
                },
                {
                    "sent": "This pair of two bits, one and then we check this pair against drinking.",
                    "label": 0
                },
                {
                    "sent": "If it is convinced if they are consistent.",
                    "label": 0
                },
                {
                    "sent": "So for this one, 2 bits, 12 bits one.",
                    "label": 0
                },
                {
                    "sent": "So this is a correct prediction for this one three, 4.3.",
                    "label": 1
                },
                {
                    "sent": "And here these two is different, so this is incorrect prediction and so on.",
                    "label": 0
                },
                {
                    "sent": "So in this case we can calculate the accuracy will be 3 correct and one error that is 75%.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here is our experimental result.",
                    "label": 0
                },
                {
                    "sent": "If the if there are sufficient training data?",
                    "label": 1
                },
                {
                    "sent": "So that is every voter contributes 50 web clicks human cycle and we can see the accuracy of.",
                    "label": 0
                },
                {
                    "sent": "Pair comparison and scoring is very odd.",
                    "label": 0
                },
                {
                    "sent": "Knows there is no significant difference between them because if there are insufficient number of training data.",
                    "label": 0
                },
                {
                    "sent": "The voter variation of will be illuminated in from the story method, but if we subsample the training data to 20, web crisper voter or even fewer, we can see that the prior comparative method beats the scoring method largely.",
                    "label": 0
                },
                {
                    "sent": "So we argue that.",
                    "label": 0
                },
                {
                    "sent": "Our her computer method will perform better in real situation because.",
                    "label": 0
                },
                {
                    "sent": "On the Internet, in general of Visitor will not answering the pair comparison or scoring question 450 times.",
                    "label": 0
                },
                {
                    "sent": "Nobody has so many so much time usually.",
                    "label": 0
                },
                {
                    "sent": "Voter or visitor only do 10 or 20 questions.",
                    "label": 0
                },
                {
                    "sent": "So in this case our method would be.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Better so here comes the conclusion.",
                    "label": 0
                },
                {
                    "sent": "If there if voter only give a low number of clicks per voter, the pair comparison measure outperforms the scoring.",
                    "label": 0
                },
                {
                    "sent": "2nd.",
                    "label": 0
                },
                {
                    "sent": "In our design, the pair come here isn't a voter only have to make a choice between two photos telling which one is better in the pair, but in the scoring method of voter has to has to decide from score one to score 10, so we assume that binary choices will be easier for easier than 10.",
                    "label": 0
                },
                {
                    "sent": "Joyce is in our experiment, we do measure.",
                    "label": 0
                },
                {
                    "sent": "The time required for each voter to do quite weather question, so obviously that each player takes less time than each scoring problem.",
                    "label": 0
                },
                {
                    "sent": "But we are not satisfied with such small scale.",
                    "label": 0
                },
                {
                    "sent": "We want to do more to do a real experiment and then make more contributions to steal the motorcycles around the world.",
                    "label": 0
                },
                {
                    "sent": "So we build a website called harder or larger.",
                    "label": 0
                },
                {
                    "sent": "And so please help us to get more votes.",
                    "label": 1
                },
                {
                    "sent": "And here we are.",
                    "label": 0
                },
                {
                    "sent": "I want to each address the issue, which would be a research problem in the future that is in our experiments the number of objects is fixed 250.",
                    "label": 0
                },
                {
                    "sent": "That is, in our experience there are only 50 photos.",
                    "label": 0
                },
                {
                    "sent": "So we can use constant players.",
                    "label": 0
                },
                {
                    "sent": "Select constant pairs are actually in our experiment, and secret desire will be no problem.",
                    "label": 0
                },
                {
                    "sent": "But in real in real application every day there will be user that ask to add their photo or delete a photo from our system.",
                    "label": 1
                },
                {
                    "sent": "So how to design a pair selection that can act well in the incremental and decremental scenarios in important?",
                    "label": 0
                },
                {
                    "sent": "So thank you everyone.",
                    "label": 0
                },
                {
                    "sent": "So you want to show the website to you.",
                    "label": 0
                },
                {
                    "sent": "So here is the website.",
                    "label": 0
                },
                {
                    "sent": "So you can see Brendan shows two photos so you can click.",
                    "label": 0
                },
                {
                    "sent": "For example, I think this one looks better, so I click it.",
                    "label": 0
                },
                {
                    "sent": "So here you will show OK. She wins one time because we only have we have.",
                    "label": 0
                },
                {
                    "sent": "How have we have 10,100 thousands of pictures?",
                    "label": 0
                },
                {
                    "sent": "So not only there are too many people help us till only a few people help us.",
                    "label": 0
                },
                {
                    "sent": "So you see this pair in this pair.",
                    "label": 0
                },
                {
                    "sent": "She wins only one time.",
                    "label": 0
                },
                {
                    "sent": "And here is a whole thin.",
                    "label": 0
                },
                {
                    "sent": "So you can see in our city we drink these photos.",
                    "label": 0
                },
                {
                    "sent": "Is top 10.",
                    "label": 0
                },
                {
                    "sent": "The other codes are they?",
                    "label": 0
                },
                {
                    "sent": "OK, so thank you very much.",
                    "label": 0
                },
                {
                    "sent": "Rolling thank you.",
                    "label": 0
                }
            ]
        }
    }
}