{
    "id": "tm7xw7sq4isiecgtuia3lqa6vaia45kz",
    "title": "Testimonies on Nazi Forced Labour and the Holocaust: Building Digital Environments for Research and Education",
    "info": {
        "author": [
            "Cord Pagenstecher, Freie Universität Berlin"
        ],
        "published": "Aug. 21, 2017",
        "recorded": "April 2016",
        "category": [
            "Top->Humanities->History",
            "Top->Humanities->Languages",
            "Top->Computers->Digital Media"
        ]
    },
    "url": "http://videolectures.net/clarinplusworkshop2016_pagenstecher_testimonies/",
    "segmentation": [
        [
            "Talking about building digital environments for research and education.",
            "So this is really a bit more about education than most of the other projects we heard until now."
        ],
        [
            "Starting with a brief quotation, which I don't play out but just read in the English translation, this costs me a lot of nerves and pain, but I see it as my duty because there are fewer and fewer survivors and testimonies in records are needed for other people and other generations.",
            "This is a bit Helena Polish schatzki, one of the narrators in the interview collection forced labor.",
            "What I'm talking about and she reflects on the pain on the work that she's been undergoing.",
            "To give this interview, and which also voices her obligation, which is also kind of an obligation for us to make it hurt and accessible and understandable.",
            "For future generations, and we've been talking about how to do that over the last two days, I think."
        ],
        [
            "I'm working at the Center for Digital Systems at Frione visited Berlin.",
            "Apart from many other projects we're doing there in the field of E learning and digital humanities, Open Access solutions and secure pedias.",
            "On the First World War, etc.",
            "We have been hosting 3 larger interview collections and partly creating educational material to these collections.",
            "The first has already been described in some detail by Katerina.",
            "The Visual History Archive of the USC Shoah Foundation.",
            "With these 53,000 interviews there, we transcribed the 900 German language interviews and 50 foreign language interviews as well an created educational material with the name witnesses of the shorter English or from this collection.",
            "And giving access to them in building an advising researchers on how to use them in integrating it into teaching at University, etc.",
            "And the second collection is about forced labor.",
            "1939 Nineteen 45 memory in history, about 600 interviews collected in 2005.",
            "2006 Life story interviews.",
            "And this was.",
            "The major project that I was working on and I'm going to present also.",
            "And then we have a collection from Britain actually from the Association of Jewish Refugees.",
            "150 interviews with Kindertransport and other people survivors talking a lot.",
            "Also about post war immigration experience in Great Britain.",
            "And this is of course accessible so here.",
            "But in in Germany, it's in edifying visited."
        ],
        [
            "So.",
            "We did for these three different collections.",
            "They come in different statuses and we did different additional projects, partly transcriptions, partly also translations, annotations, various educational materials and approaches.",
            "Or in the example of the refugee voices, we only organized the integration into our library catalog so it's easier for fundable then.",
            "We are working on other collections currently together with the fan Universitet Harding.",
            "I have a huge collection of audio interviews since the 1970s eighties and we're trying to use our first labor platform to make them accessible online as well.",
            "And this is an ongoing project not not yet online, will be and we will start this year and interview collection about the occupation German occupation of Greece."
        ],
        [
            "So I'm going to present you the first labor archive its website, which is in German and English and large part also in Russian.",
            "So.",
            "Because of the main, the largest group of interviews is in Russian and we're on the way to a multi lingual website and platform and cooperating with partners in Russia and also in the Czech Republic then."
        ],
        [
            "The collection comprises.",
            "600 almost 600 interviews in 25 different languages, mainly East European, but not only.",
            "We have transcripts that were segmented on a sentence based level manually.",
            "And also indexed for certain terms specific to the field of research like camps, companies, places and persons."
        ],
        [
            "The interviews are online available on the web, but we ask foreign registration pretty similar like you would register in a normal archive because it's quite personal narratives and we want to have the users agree to the terms of use.",
            "And also we want to have some information about their field of research.",
            "We do.",
            "Manual control of the registration, which is not very detailed so but we up till now managed that there was no misuse and if there would be one we would be able to track down and hopefully stop it."
        ],
        [
            "When you registered, you can.",
            "Search in the interviews either through different categories, groups of persecution, of the languages, or the area of deployment.",
            "In this example, I looked for prisoners of war and political persecuted interviewees, and there are 111 that fit into this category."
        ],
        [
            "And also we have a full text search through all the interviews or within individual interviews and we have kind of revolving subtitles.",
            "The segmented transcript is being shown underneath the video either in the original language or in the German translation.",
            "And then you can search through.",
            "In this case, I search for the German company wrestling and she talks several times about this person and then you click on the on the segment and you jump directly to the specific segment of the interview.",
            "I think this option to jump directly to a specific spot in the interview is brilliant for research, but it's also problematic because you don't understand where you are when you find this specific segment.",
            "And as a school student, but I think also a lot of researchers would take the opportunity.",
            "They find a nice quotation, copy paste and go on, and they did not.",
            "Even understand what was she talking about?",
            "Are we in the beginning of the narration at the end?",
            "What is this narrative structure all about?",
            "Because actually it's."
        ],
        [
            "These interviews people don't talk chronologically.",
            "Sometimes they do, but they have their meaning.",
            "They have their connections and that's part of the Jacobin.",
            "The beginning set all history as a as a method.",
            "As an interesting object of research.",
            "We tried to help.",
            "Users, researchers, students, teaches whomever by making available a table of contents.",
            "In this case, it's in in German.",
            "For the English language interviews, it's also in English for the Russian language interviews.",
            "It's also in Russian to find where you are and this is clickable so you can navigate through the interview.",
            "Actually, this is a bit pretty similar to book.",
            "In the beginning you have a table of contents.",
            "At the end you have the the index and those two I think have worked pretty well over the last century so.",
            "Maybe we could use them in the digital world as well."
        ],
        [
            "We also have a user's workbook or an area where you can tag.",
            "Save your searches tag parts of the interviews so this is a little step towards a virtual research environment.",
            "It's not really fully developed, so there's no sharing.",
            "Between different users currently I mean we."
        ],
        [
            "We have little part of a collaborative development.",
            "You can make notes to a specific segment and this.",
            "These will then be visible for other users of the registered users of the archive, and we develop that and we discussed a lot of it and we thought, well, we need to moderate this 'cause you don't know what the people writing bullshit and.",
            "Maybe we did not advocate it enough, but it's used very little.",
            "Very, very few remarks there, so.",
            "I think this collaborative.",
            "Curation of collections is a beautiful idea.",
            "Crowdsourcing or however you would call it.",
            "I mean, this is a bit crowdsourcing.",
            "It's maybe even wider.",
            "This is really the idea of a community of users that is registered and they are experts.",
            "I mean we don't know about all these places and persons that are but they they do and so they can share their knowledge.",
            "But few of them do because why should they?",
            "I mean what do they gain from it and?",
            "We this is a bit needs more thinking how to organize something that this really works.",
            "Yeah, it's the time.",
            "Will mind but keep on.",
            "Several examples of crowd.",
            "Find some reward.",
            "Benefit in.",
            "In general it is difficult.",
            "No, no, no, I'm not.",
            "Not against it in general I was just saying that in this case I think there's little contribution an maybe it depends on various factors.",
            "You have to start maybe right from the beginning.",
            "We added this element a bit later on.",
            "You have to really advocate for it and and then you have this debate.",
            "Should it be easy and open or do you have to control it and.",
            "All these issues, so it's I would want to present it as an and what we should discuss about more in the future also."
        ],
        [
            "We created a map out of these.",
            "All these places that were mentioned at birth places as camps as prisons, etc.",
            "See quite good the European dimension of forced Labour's blue.",
            "Are their birth places and read the comments and companies.",
            "We decided to take Google Maps instead of some serious concerns about data privacy because Google has this.",
            "Beautiful."
        ],
        [
            "Satellite imagery, and then for example, you can find that the ammunition factory where this Polish survivor was working, and in this describe pretty detailed in the in the archive is still existing here in cars, which is today this centrum for constant median one of the major museums and also technical part of Technical University of Karlsruhe I think.",
            "Until you you get this.",
            "Today's perspective on on the.",
            "And the of course for for school projects it's very interesting or to see all this is in our city, in my school, in my street there's this happened.",
            "There's a connection to be made there.",
            "We did."
        ],
        [
            "This main process between 2008 and 2012 and thing an.",
            "We at the time we were putting you to the field and we did not find really.",
            "Maybe we did not look enough, but at the time these different tools that we had presented today maybe even went in that state of the art.",
            "So we developed something for our own.",
            "A system back end, editing software, workflow management.",
            "With these hundreds of interviews in different languages, you need different people to to process it, and you need to know who's doing what at which time and."
        ],
        [
            "And then this.",
            "System has video playing and then the the segmented transcript in the original language in the translation and then you can do this table of contents chapters an the indexing for places, persons, camps and make additional remarks or content annotations.",
            "This worked pretty well.",
            "I think Ann created this archive that I showed you in the beginning.",
            "From a pretty early stage on we also started on educational material and published this first learning software."
        ],
        [
            "In 2010 we."
        ],
        [
            "Which is now currently being transferred into an online learning environment which will be presented in June.",
            "Think we're in the last steps.",
            "And the idea is really to to make oral history interviews iaccessible for high school students from the age of 14 till 18.",
            "So they get 1/2 hour.",
            "Biographical short film with transcription and translation and several suggestions how to work with that material to understand not only the history what is forced labor was the experience of forced labor, but also the source, the oral history as an approach.",
            "Way to construct the past and understanding.",
            "Today as an aeration and also as an aeration embedded in.",
            "General discourse in society, individual memories and color Remembrance cultures, and then these very."
        ],
        [
            "Tasks, for example Eleanor Bully Schatzki was an artist after the war.",
            "She made a lot of graphic art graphics.",
            "A paintings also and then we suggest the students could look at these pieces of art and watch the interview and bring these together and make their own comments on it.",
            "Comment in the editor and then they create something like a portfolio which they in the end can present to their peers in the school or print out and give to the teacher and bring home also.",
            "This is a project that we're developing now together, also with colleagues in PROC.",
            "So we're creating a German environment and they are creating a check environment with other interviews, but the same technical basis and a lot of similar didactical approaches, and this they will be presenting it in the beginning of May, and we're currently also since January cooperating.",
            "With a partner in Russia in Voronezh and want to create a learning environment in Russian.",
            "This is of course interesting also in giving the political dimensions of history between Europe and Russia, it's.",
            "I might be not easy, but for sure it will be interesting project."
        ],
        [
            "Or it is already?",
            "We also tried to support and connect to some other existing educational approaches.",
            "Reach out, for example bowling History, Workshop created and a testimony app about forced labor and balloons so you can walk through the city and with pieces of the interviews and written testimonies.",
            "Understand the experiences of the forced laborers in the city.",
            "And we're working together with memorials and exhibitions to make this interviews visible and and."
        ],
        [
            "Used so this is a bit what we've been doing.",
            "I made some.",
            "Brief ideas what we could do and part of it was only already mentioned in the last discussion that we had here.",
            "I was thinking about one aspect would be connecting this different interview."
        ],
        [
            "Curves.",
            "In our work and some conferences we organized also some of you were present in these events.",
            "We discovered how many of these collections are out there in Europe and how many of them are online and are currently being developed in really very beautiful form with different platform systems.",
            "So I mean, there are a lot of.",
            "There's a lot of work going on now in different countries, and especially also in Minsk, in Moscow, in Barcelona, in places.",
            "And none of them are connected with universities, not to speak about European infrastructures, but just civil SoC different fundings.",
            "And so it would be important to.",
            "Connect them somehow, not bring everything together, but make it.",
            "Findable, searchable and of course also to look at their technological solutions and the method methodical methodological approaches if we can learn something from them."
        ],
        [
            "What we could?",
            "Benefit from the discussions.",
            "Also we had in the last two days.",
            "Can be may be divided into two major parts.",
            "One is the curation of collections and the other is the analyzing collections.",
            "I mean, that's maybe a repetition that I thought this speech recognition obviously is not able to deliver deliver transcripts, which really readable, maybe in English.",
            "If it's very good pronunciation.",
            "But in the other language is still probably something of the future, but it can allow the searching.",
            "We talked about alignment, automatic translation, named entity recognition.",
            "And we talked a little bit also, but this is also something that needs more exploration.",
            "Identifying speaker changes, identifying silences, identifying gestures, etc.",
            "And I think this is something that even oral historians must still have a long way to go to to understand these interviews for one as multimodal events so visual gesture nonverbal.",
            "Parts of the speech etc.",
            "And also understand this dialogical.",
            "Character of an interview.",
            "The role of the interviewer is has been little reflected on I think.",
            "And then of course there is a wealth of possible.",
            "Research questions.",
            "I would say that most of our users.",
            "We have like.",
            "6007 thousand registered users in the archive.",
            "Talking about users again.",
            "So let me think I didn't bring the graph, but there's I would say about 1/4 is researchers.",
            "University teachers etc.",
            "PHD's 1/4.",
            "Is Education student school Teachers, Memorial museum guides, etc.",
            "1/4 is journalists general, public artists whatever, and a quarter, and that was a bit astonishing.",
            "First, in the beginning is family research, so people, let's say either my.",
            "Grand Father was a forced laborer.",
            "And I want to know about him and then we usually say sorry.",
            "I mean we have 600 interviews but there were 12 million forced laborers, so it's highly unlikely that your grand Father was part of it.",
            "But then they say, well, never mind, I'm not interested in this and I want to listen to stories similar and so they're interested so you really can approach people that would never go to an oral history archive.",
            "And in Germany, of course, there are many people who say my grand Father had forced laborers.",
            "He had a farm and you never talked about it, and I want to know a little bit.",
            "So.",
            "But looking now at the researchers process."
        ],
        [
            "Bible research questions that could be tackled with our new.",
            "Tools of connecting collections and what we were talking about in what we want to create in the future is.",
            "For example, comparing interviews in different years.",
            "We have this example of young pass find who was interviewed by David Boulder in 1946 in the Displaced Persons camp, which the Sporter interviews are online now and it's the same person but called Jack Bass interviewed in the Visual History Archive an 50 years later and then let's of course interesting comparisons and we had some other examples of this as well."
        ],
        [
            "You can work for and search for specific terms which are interesting in the debate on false labor so.",
            "I made a little just in the beginning of the project without any technical aid.",
            "I just looked do the first labels themselves talk about slavery or slave labor.",
            "I mean, you know, maybe that in the compensation debate this was an argument and this was an ad in the New York Times too.",
            "Support.",
            "Let's say dispense in participating in the compensation scheme.",
            "But it was already a major term that was used in the Nuremberg Tribunal.",
            "Newburgh tribunal did not talk about the Holocaust role almost, but the main focus was forced labor and it was called slave labor at the time.",
            "So I was looking about what do the people say themselves and what kind of which groups in which occasions talk about slavery and what's not.",
            "And and this is something, of course, which would be very much easier and and reliable by the digital techniques.",
            "Now we have a small film on the Public Works website with some examples of that so.",
            "Don't have the time now, but you can even without register and have a look at this."
        ],
        [
            "And actually, I just briefly looked at 136 interviews.",
            "Talk about.",
            "Well, I looked for in the German translation, of course, then we have this whole issue of.",
            "Can you translate transcripts and analyze them?",
            "I mean these terms like slavery have very different meanings in different languages so.",
            "This is another thing then.",
            "I think it helps us a lot to find what's there and then if you really want to.",
            "Interpretes you you need to go to the detailed sources you will.",
            "Become more qualitative again, so I think quantitative qualitative always.",
            "You need both approaches."
        ],
        [
            "We have quite a few pictures of the interview settings there.",
            "I would love to have more recordings of the interview settings.",
            "Also we have only the generator and usually you don't see the interviewer in.",
            "Obviously you don't see the cameraman and the whole setting which.",
            "Anyway, would be very interesting to understand these sources as a dialogue between narrator and interview.",
            "And there are a lot of options to analyze that more in detail depending on the gender on the 8:00 and the ethnicity of the interview, etc."
        ],
        [
            "Gender is an issue that has been little researched, I think in in oral Elinor history, yes, all history developped pretty close together with feminist studies etc.",
            "But in this."
        ],
        [
            "Only when we look at the digital large digital archives, there has been one volume in Germany published last year about it, but not much else.",
            "And I think, of course, the digital tools would offer very interesting ways to compare ways, modes, patterns of Remembrance, patterns of numeration.",
            "In"
        ],
        [
            "Gender relation.",
            "OK, that's just some general ideas what.",
            "I will as an historian, but working in such a digital field would find interesting and looking very forward to have more options for me and for my historical colleagues to use this.",
            "Platforms and tools that we have been discussing here for these questions.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Talking about building digital environments for research and education.",
                    "label": 0
                },
                {
                    "sent": "So this is really a bit more about education than most of the other projects we heard until now.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Starting with a brief quotation, which I don't play out but just read in the English translation, this costs me a lot of nerves and pain, but I see it as my duty because there are fewer and fewer survivors and testimonies in records are needed for other people and other generations.",
                    "label": 1
                },
                {
                    "sent": "This is a bit Helena Polish schatzki, one of the narrators in the interview collection forced labor.",
                    "label": 0
                },
                {
                    "sent": "What I'm talking about and she reflects on the pain on the work that she's been undergoing.",
                    "label": 0
                },
                {
                    "sent": "To give this interview, and which also voices her obligation, which is also kind of an obligation for us to make it hurt and accessible and understandable.",
                    "label": 0
                },
                {
                    "sent": "For future generations, and we've been talking about how to do that over the last two days, I think.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm working at the Center for Digital Systems at Frione visited Berlin.",
                    "label": 1
                },
                {
                    "sent": "Apart from many other projects we're doing there in the field of E learning and digital humanities, Open Access solutions and secure pedias.",
                    "label": 0
                },
                {
                    "sent": "On the First World War, etc.",
                    "label": 0
                },
                {
                    "sent": "We have been hosting 3 larger interview collections and partly creating educational material to these collections.",
                    "label": 0
                },
                {
                    "sent": "The first has already been described in some detail by Katerina.",
                    "label": 0
                },
                {
                    "sent": "The Visual History Archive of the USC Shoah Foundation.",
                    "label": 0
                },
                {
                    "sent": "With these 53,000 interviews there, we transcribed the 900 German language interviews and 50 foreign language interviews as well an created educational material with the name witnesses of the shorter English or from this collection.",
                    "label": 0
                },
                {
                    "sent": "And giving access to them in building an advising researchers on how to use them in integrating it into teaching at University, etc.",
                    "label": 0
                },
                {
                    "sent": "And the second collection is about forced labor.",
                    "label": 0
                },
                {
                    "sent": "1939 Nineteen 45 memory in history, about 600 interviews collected in 2005.",
                    "label": 0
                },
                {
                    "sent": "2006 Life story interviews.",
                    "label": 0
                },
                {
                    "sent": "And this was.",
                    "label": 0
                },
                {
                    "sent": "The major project that I was working on and I'm going to present also.",
                    "label": 0
                },
                {
                    "sent": "And then we have a collection from Britain actually from the Association of Jewish Refugees.",
                    "label": 0
                },
                {
                    "sent": "150 interviews with Kindertransport and other people survivors talking a lot.",
                    "label": 0
                },
                {
                    "sent": "Also about post war immigration experience in Great Britain.",
                    "label": 0
                },
                {
                    "sent": "And this is of course accessible so here.",
                    "label": 0
                },
                {
                    "sent": "But in in Germany, it's in edifying visited.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We did for these three different collections.",
                    "label": 0
                },
                {
                    "sent": "They come in different statuses and we did different additional projects, partly transcriptions, partly also translations, annotations, various educational materials and approaches.",
                    "label": 0
                },
                {
                    "sent": "Or in the example of the refugee voices, we only organized the integration into our library catalog so it's easier for fundable then.",
                    "label": 0
                },
                {
                    "sent": "We are working on other collections currently together with the fan Universitet Harding.",
                    "label": 0
                },
                {
                    "sent": "I have a huge collection of audio interviews since the 1970s eighties and we're trying to use our first labor platform to make them accessible online as well.",
                    "label": 0
                },
                {
                    "sent": "And this is an ongoing project not not yet online, will be and we will start this year and interview collection about the occupation German occupation of Greece.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to present you the first labor archive its website, which is in German and English and large part also in Russian.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Because of the main, the largest group of interviews is in Russian and we're on the way to a multi lingual website and platform and cooperating with partners in Russia and also in the Czech Republic then.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The collection comprises.",
                    "label": 0
                },
                {
                    "sent": "600 almost 600 interviews in 25 different languages, mainly East European, but not only.",
                    "label": 1
                },
                {
                    "sent": "We have transcripts that were segmented on a sentence based level manually.",
                    "label": 0
                },
                {
                    "sent": "And also indexed for certain terms specific to the field of research like camps, companies, places and persons.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The interviews are online available on the web, but we ask foreign registration pretty similar like you would register in a normal archive because it's quite personal narratives and we want to have the users agree to the terms of use.",
                    "label": 0
                },
                {
                    "sent": "And also we want to have some information about their field of research.",
                    "label": 0
                },
                {
                    "sent": "We do.",
                    "label": 0
                },
                {
                    "sent": "Manual control of the registration, which is not very detailed so but we up till now managed that there was no misuse and if there would be one we would be able to track down and hopefully stop it.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "When you registered, you can.",
                    "label": 0
                },
                {
                    "sent": "Search in the interviews either through different categories, groups of persecution, of the languages, or the area of deployment.",
                    "label": 0
                },
                {
                    "sent": "In this example, I looked for prisoners of war and political persecuted interviewees, and there are 111 that fit into this category.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And also we have a full text search through all the interviews or within individual interviews and we have kind of revolving subtitles.",
                    "label": 1
                },
                {
                    "sent": "The segmented transcript is being shown underneath the video either in the original language or in the German translation.",
                    "label": 1
                },
                {
                    "sent": "And then you can search through.",
                    "label": 0
                },
                {
                    "sent": "In this case, I search for the German company wrestling and she talks several times about this person and then you click on the on the segment and you jump directly to the specific segment of the interview.",
                    "label": 0
                },
                {
                    "sent": "I think this option to jump directly to a specific spot in the interview is brilliant for research, but it's also problematic because you don't understand where you are when you find this specific segment.",
                    "label": 0
                },
                {
                    "sent": "And as a school student, but I think also a lot of researchers would take the opportunity.",
                    "label": 0
                },
                {
                    "sent": "They find a nice quotation, copy paste and go on, and they did not.",
                    "label": 0
                },
                {
                    "sent": "Even understand what was she talking about?",
                    "label": 0
                },
                {
                    "sent": "Are we in the beginning of the narration at the end?",
                    "label": 0
                },
                {
                    "sent": "What is this narrative structure all about?",
                    "label": 0
                },
                {
                    "sent": "Because actually it's.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These interviews people don't talk chronologically.",
                    "label": 0
                },
                {
                    "sent": "Sometimes they do, but they have their meaning.",
                    "label": 0
                },
                {
                    "sent": "They have their connections and that's part of the Jacobin.",
                    "label": 0
                },
                {
                    "sent": "The beginning set all history as a as a method.",
                    "label": 0
                },
                {
                    "sent": "As an interesting object of research.",
                    "label": 0
                },
                {
                    "sent": "We tried to help.",
                    "label": 0
                },
                {
                    "sent": "Users, researchers, students, teaches whomever by making available a table of contents.",
                    "label": 0
                },
                {
                    "sent": "In this case, it's in in German.",
                    "label": 0
                },
                {
                    "sent": "For the English language interviews, it's also in English for the Russian language interviews.",
                    "label": 0
                },
                {
                    "sent": "It's also in Russian to find where you are and this is clickable so you can navigate through the interview.",
                    "label": 0
                },
                {
                    "sent": "Actually, this is a bit pretty similar to book.",
                    "label": 0
                },
                {
                    "sent": "In the beginning you have a table of contents.",
                    "label": 1
                },
                {
                    "sent": "At the end you have the the index and those two I think have worked pretty well over the last century so.",
                    "label": 0
                },
                {
                    "sent": "Maybe we could use them in the digital world as well.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We also have a user's workbook or an area where you can tag.",
                    "label": 1
                },
                {
                    "sent": "Save your searches tag parts of the interviews so this is a little step towards a virtual research environment.",
                    "label": 0
                },
                {
                    "sent": "It's not really fully developed, so there's no sharing.",
                    "label": 0
                },
                {
                    "sent": "Between different users currently I mean we.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have little part of a collaborative development.",
                    "label": 0
                },
                {
                    "sent": "You can make notes to a specific segment and this.",
                    "label": 0
                },
                {
                    "sent": "These will then be visible for other users of the registered users of the archive, and we develop that and we discussed a lot of it and we thought, well, we need to moderate this 'cause you don't know what the people writing bullshit and.",
                    "label": 0
                },
                {
                    "sent": "Maybe we did not advocate it enough, but it's used very little.",
                    "label": 0
                },
                {
                    "sent": "Very, very few remarks there, so.",
                    "label": 0
                },
                {
                    "sent": "I think this collaborative.",
                    "label": 0
                },
                {
                    "sent": "Curation of collections is a beautiful idea.",
                    "label": 0
                },
                {
                    "sent": "Crowdsourcing or however you would call it.",
                    "label": 0
                },
                {
                    "sent": "I mean, this is a bit crowdsourcing.",
                    "label": 0
                },
                {
                    "sent": "It's maybe even wider.",
                    "label": 0
                },
                {
                    "sent": "This is really the idea of a community of users that is registered and they are experts.",
                    "label": 0
                },
                {
                    "sent": "I mean we don't know about all these places and persons that are but they they do and so they can share their knowledge.",
                    "label": 0
                },
                {
                    "sent": "But few of them do because why should they?",
                    "label": 0
                },
                {
                    "sent": "I mean what do they gain from it and?",
                    "label": 0
                },
                {
                    "sent": "We this is a bit needs more thinking how to organize something that this really works.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's the time.",
                    "label": 0
                },
                {
                    "sent": "Will mind but keep on.",
                    "label": 0
                },
                {
                    "sent": "Several examples of crowd.",
                    "label": 0
                },
                {
                    "sent": "Find some reward.",
                    "label": 0
                },
                {
                    "sent": "Benefit in.",
                    "label": 0
                },
                {
                    "sent": "In general it is difficult.",
                    "label": 0
                },
                {
                    "sent": "No, no, no, I'm not.",
                    "label": 0
                },
                {
                    "sent": "Not against it in general I was just saying that in this case I think there's little contribution an maybe it depends on various factors.",
                    "label": 0
                },
                {
                    "sent": "You have to start maybe right from the beginning.",
                    "label": 0
                },
                {
                    "sent": "We added this element a bit later on.",
                    "label": 0
                },
                {
                    "sent": "You have to really advocate for it and and then you have this debate.",
                    "label": 0
                },
                {
                    "sent": "Should it be easy and open or do you have to control it and.",
                    "label": 0
                },
                {
                    "sent": "All these issues, so it's I would want to present it as an and what we should discuss about more in the future also.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We created a map out of these.",
                    "label": 0
                },
                {
                    "sent": "All these places that were mentioned at birth places as camps as prisons, etc.",
                    "label": 0
                },
                {
                    "sent": "See quite good the European dimension of forced Labour's blue.",
                    "label": 0
                },
                {
                    "sent": "Are their birth places and read the comments and companies.",
                    "label": 1
                },
                {
                    "sent": "We decided to take Google Maps instead of some serious concerns about data privacy because Google has this.",
                    "label": 0
                },
                {
                    "sent": "Beautiful.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Satellite imagery, and then for example, you can find that the ammunition factory where this Polish survivor was working, and in this describe pretty detailed in the in the archive is still existing here in cars, which is today this centrum for constant median one of the major museums and also technical part of Technical University of Karlsruhe I think.",
                    "label": 0
                },
                {
                    "sent": "Until you you get this.",
                    "label": 0
                },
                {
                    "sent": "Today's perspective on on the.",
                    "label": 0
                },
                {
                    "sent": "And the of course for for school projects it's very interesting or to see all this is in our city, in my school, in my street there's this happened.",
                    "label": 0
                },
                {
                    "sent": "There's a connection to be made there.",
                    "label": 0
                },
                {
                    "sent": "We did.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This main process between 2008 and 2012 and thing an.",
                    "label": 0
                },
                {
                    "sent": "We at the time we were putting you to the field and we did not find really.",
                    "label": 0
                },
                {
                    "sent": "Maybe we did not look enough, but at the time these different tools that we had presented today maybe even went in that state of the art.",
                    "label": 0
                },
                {
                    "sent": "So we developed something for our own.",
                    "label": 0
                },
                {
                    "sent": "A system back end, editing software, workflow management.",
                    "label": 1
                },
                {
                    "sent": "With these hundreds of interviews in different languages, you need different people to to process it, and you need to know who's doing what at which time and.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then this.",
                    "label": 0
                },
                {
                    "sent": "System has video playing and then the the segmented transcript in the original language in the translation and then you can do this table of contents chapters an the indexing for places, persons, camps and make additional remarks or content annotations.",
                    "label": 0
                },
                {
                    "sent": "This worked pretty well.",
                    "label": 0
                },
                {
                    "sent": "I think Ann created this archive that I showed you in the beginning.",
                    "label": 0
                },
                {
                    "sent": "From a pretty early stage on we also started on educational material and published this first learning software.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In 2010 we.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Which is now currently being transferred into an online learning environment which will be presented in June.",
                    "label": 0
                },
                {
                    "sent": "Think we're in the last steps.",
                    "label": 0
                },
                {
                    "sent": "And the idea is really to to make oral history interviews iaccessible for high school students from the age of 14 till 18.",
                    "label": 0
                },
                {
                    "sent": "So they get 1/2 hour.",
                    "label": 0
                },
                {
                    "sent": "Biographical short film with transcription and translation and several suggestions how to work with that material to understand not only the history what is forced labor was the experience of forced labor, but also the source, the oral history as an approach.",
                    "label": 0
                },
                {
                    "sent": "Way to construct the past and understanding.",
                    "label": 0
                },
                {
                    "sent": "Today as an aeration and also as an aeration embedded in.",
                    "label": 0
                },
                {
                    "sent": "General discourse in society, individual memories and color Remembrance cultures, and then these very.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tasks, for example Eleanor Bully Schatzki was an artist after the war.",
                    "label": 0
                },
                {
                    "sent": "She made a lot of graphic art graphics.",
                    "label": 0
                },
                {
                    "sent": "A paintings also and then we suggest the students could look at these pieces of art and watch the interview and bring these together and make their own comments on it.",
                    "label": 0
                },
                {
                    "sent": "Comment in the editor and then they create something like a portfolio which they in the end can present to their peers in the school or print out and give to the teacher and bring home also.",
                    "label": 0
                },
                {
                    "sent": "This is a project that we're developing now together, also with colleagues in PROC.",
                    "label": 0
                },
                {
                    "sent": "So we're creating a German environment and they are creating a check environment with other interviews, but the same technical basis and a lot of similar didactical approaches, and this they will be presenting it in the beginning of May, and we're currently also since January cooperating.",
                    "label": 0
                },
                {
                    "sent": "With a partner in Russia in Voronezh and want to create a learning environment in Russian.",
                    "label": 0
                },
                {
                    "sent": "This is of course interesting also in giving the political dimensions of history between Europe and Russia, it's.",
                    "label": 0
                },
                {
                    "sent": "I might be not easy, but for sure it will be interesting project.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or it is already?",
                    "label": 0
                },
                {
                    "sent": "We also tried to support and connect to some other existing educational approaches.",
                    "label": 0
                },
                {
                    "sent": "Reach out, for example bowling History, Workshop created and a testimony app about forced labor and balloons so you can walk through the city and with pieces of the interviews and written testimonies.",
                    "label": 0
                },
                {
                    "sent": "Understand the experiences of the forced laborers in the city.",
                    "label": 0
                },
                {
                    "sent": "And we're working together with memorials and exhibitions to make this interviews visible and and.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Used so this is a bit what we've been doing.",
                    "label": 0
                },
                {
                    "sent": "I made some.",
                    "label": 0
                },
                {
                    "sent": "Brief ideas what we could do and part of it was only already mentioned in the last discussion that we had here.",
                    "label": 0
                },
                {
                    "sent": "I was thinking about one aspect would be connecting this different interview.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Curves.",
                    "label": 0
                },
                {
                    "sent": "In our work and some conferences we organized also some of you were present in these events.",
                    "label": 0
                },
                {
                    "sent": "We discovered how many of these collections are out there in Europe and how many of them are online and are currently being developed in really very beautiful form with different platform systems.",
                    "label": 0
                },
                {
                    "sent": "So I mean, there are a lot of.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of work going on now in different countries, and especially also in Minsk, in Moscow, in Barcelona, in places.",
                    "label": 0
                },
                {
                    "sent": "And none of them are connected with universities, not to speak about European infrastructures, but just civil SoC different fundings.",
                    "label": 0
                },
                {
                    "sent": "And so it would be important to.",
                    "label": 0
                },
                {
                    "sent": "Connect them somehow, not bring everything together, but make it.",
                    "label": 0
                },
                {
                    "sent": "Findable, searchable and of course also to look at their technological solutions and the method methodical methodological approaches if we can learn something from them.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What we could?",
                    "label": 0
                },
                {
                    "sent": "Benefit from the discussions.",
                    "label": 0
                },
                {
                    "sent": "Also we had in the last two days.",
                    "label": 0
                },
                {
                    "sent": "Can be may be divided into two major parts.",
                    "label": 0
                },
                {
                    "sent": "One is the curation of collections and the other is the analyzing collections.",
                    "label": 0
                },
                {
                    "sent": "I mean, that's maybe a repetition that I thought this speech recognition obviously is not able to deliver deliver transcripts, which really readable, maybe in English.",
                    "label": 0
                },
                {
                    "sent": "If it's very good pronunciation.",
                    "label": 0
                },
                {
                    "sent": "But in the other language is still probably something of the future, but it can allow the searching.",
                    "label": 0
                },
                {
                    "sent": "We talked about alignment, automatic translation, named entity recognition.",
                    "label": 1
                },
                {
                    "sent": "And we talked a little bit also, but this is also something that needs more exploration.",
                    "label": 0
                },
                {
                    "sent": "Identifying speaker changes, identifying silences, identifying gestures, etc.",
                    "label": 0
                },
                {
                    "sent": "And I think this is something that even oral historians must still have a long way to go to to understand these interviews for one as multimodal events so visual gesture nonverbal.",
                    "label": 0
                },
                {
                    "sent": "Parts of the speech etc.",
                    "label": 0
                },
                {
                    "sent": "And also understand this dialogical.",
                    "label": 0
                },
                {
                    "sent": "Character of an interview.",
                    "label": 0
                },
                {
                    "sent": "The role of the interviewer is has been little reflected on I think.",
                    "label": 0
                },
                {
                    "sent": "And then of course there is a wealth of possible.",
                    "label": 0
                },
                {
                    "sent": "Research questions.",
                    "label": 0
                },
                {
                    "sent": "I would say that most of our users.",
                    "label": 0
                },
                {
                    "sent": "We have like.",
                    "label": 0
                },
                {
                    "sent": "6007 thousand registered users in the archive.",
                    "label": 0
                },
                {
                    "sent": "Talking about users again.",
                    "label": 0
                },
                {
                    "sent": "So let me think I didn't bring the graph, but there's I would say about 1/4 is researchers.",
                    "label": 0
                },
                {
                    "sent": "University teachers etc.",
                    "label": 0
                },
                {
                    "sent": "PHD's 1/4.",
                    "label": 0
                },
                {
                    "sent": "Is Education student school Teachers, Memorial museum guides, etc.",
                    "label": 0
                },
                {
                    "sent": "1/4 is journalists general, public artists whatever, and a quarter, and that was a bit astonishing.",
                    "label": 0
                },
                {
                    "sent": "First, in the beginning is family research, so people, let's say either my.",
                    "label": 0
                },
                {
                    "sent": "Grand Father was a forced laborer.",
                    "label": 0
                },
                {
                    "sent": "And I want to know about him and then we usually say sorry.",
                    "label": 0
                },
                {
                    "sent": "I mean we have 600 interviews but there were 12 million forced laborers, so it's highly unlikely that your grand Father was part of it.",
                    "label": 0
                },
                {
                    "sent": "But then they say, well, never mind, I'm not interested in this and I want to listen to stories similar and so they're interested so you really can approach people that would never go to an oral history archive.",
                    "label": 0
                },
                {
                    "sent": "And in Germany, of course, there are many people who say my grand Father had forced laborers.",
                    "label": 0
                },
                {
                    "sent": "He had a farm and you never talked about it, and I want to know a little bit.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "But looking now at the researchers process.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Bible research questions that could be tackled with our new.",
                    "label": 0
                },
                {
                    "sent": "Tools of connecting collections and what we were talking about in what we want to create in the future is.",
                    "label": 0
                },
                {
                    "sent": "For example, comparing interviews in different years.",
                    "label": 1
                },
                {
                    "sent": "We have this example of young pass find who was interviewed by David Boulder in 1946 in the Displaced Persons camp, which the Sporter interviews are online now and it's the same person but called Jack Bass interviewed in the Visual History Archive an 50 years later and then let's of course interesting comparisons and we had some other examples of this as well.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You can work for and search for specific terms which are interesting in the debate on false labor so.",
                    "label": 0
                },
                {
                    "sent": "I made a little just in the beginning of the project without any technical aid.",
                    "label": 0
                },
                {
                    "sent": "I just looked do the first labels themselves talk about slavery or slave labor.",
                    "label": 1
                },
                {
                    "sent": "I mean, you know, maybe that in the compensation debate this was an argument and this was an ad in the New York Times too.",
                    "label": 0
                },
                {
                    "sent": "Support.",
                    "label": 0
                },
                {
                    "sent": "Let's say dispense in participating in the compensation scheme.",
                    "label": 0
                },
                {
                    "sent": "But it was already a major term that was used in the Nuremberg Tribunal.",
                    "label": 0
                },
                {
                    "sent": "Newburgh tribunal did not talk about the Holocaust role almost, but the main focus was forced labor and it was called slave labor at the time.",
                    "label": 0
                },
                {
                    "sent": "So I was looking about what do the people say themselves and what kind of which groups in which occasions talk about slavery and what's not.",
                    "label": 0
                },
                {
                    "sent": "And and this is something, of course, which would be very much easier and and reliable by the digital techniques.",
                    "label": 0
                },
                {
                    "sent": "Now we have a small film on the Public Works website with some examples of that so.",
                    "label": 0
                },
                {
                    "sent": "Don't have the time now, but you can even without register and have a look at this.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And actually, I just briefly looked at 136 interviews.",
                    "label": 1
                },
                {
                    "sent": "Talk about.",
                    "label": 0
                },
                {
                    "sent": "Well, I looked for in the German translation, of course, then we have this whole issue of.",
                    "label": 0
                },
                {
                    "sent": "Can you translate transcripts and analyze them?",
                    "label": 0
                },
                {
                    "sent": "I mean these terms like slavery have very different meanings in different languages so.",
                    "label": 0
                },
                {
                    "sent": "This is another thing then.",
                    "label": 0
                },
                {
                    "sent": "I think it helps us a lot to find what's there and then if you really want to.",
                    "label": 0
                },
                {
                    "sent": "Interpretes you you need to go to the detailed sources you will.",
                    "label": 0
                },
                {
                    "sent": "Become more qualitative again, so I think quantitative qualitative always.",
                    "label": 0
                },
                {
                    "sent": "You need both approaches.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We have quite a few pictures of the interview settings there.",
                    "label": 0
                },
                {
                    "sent": "I would love to have more recordings of the interview settings.",
                    "label": 0
                },
                {
                    "sent": "Also we have only the generator and usually you don't see the interviewer in.",
                    "label": 1
                },
                {
                    "sent": "Obviously you don't see the cameraman and the whole setting which.",
                    "label": 0
                },
                {
                    "sent": "Anyway, would be very interesting to understand these sources as a dialogue between narrator and interview.",
                    "label": 0
                },
                {
                    "sent": "And there are a lot of options to analyze that more in detail depending on the gender on the 8:00 and the ethnicity of the interview, etc.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gender is an issue that has been little researched, I think in in oral Elinor history, yes, all history developped pretty close together with feminist studies etc.",
                    "label": 0
                },
                {
                    "sent": "But in this.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Only when we look at the digital large digital archives, there has been one volume in Germany published last year about it, but not much else.",
                    "label": 0
                },
                {
                    "sent": "And I think, of course, the digital tools would offer very interesting ways to compare ways, modes, patterns of Remembrance, patterns of numeration.",
                    "label": 0
                },
                {
                    "sent": "In",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Gender relation.",
                    "label": 0
                },
                {
                    "sent": "OK, that's just some general ideas what.",
                    "label": 0
                },
                {
                    "sent": "I will as an historian, but working in such a digital field would find interesting and looking very forward to have more options for me and for my historical colleagues to use this.",
                    "label": 0
                },
                {
                    "sent": "Platforms and tools that we have been discussing here for these questions.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}