{
    "id": "to3xciccsiqsudctezwbvqvcw5oy4dzx",
    "title": "Teaching Climate Change: The Role of Tertiary Education Institutions and Barriers to Effective Curriculum Transformation",
    "info": {
        "author": [
            "Prvoslav Marjanović, EDUCONS University"
        ],
        "published": "June 21, 2010",
        "recorded": "May 2010",
        "category": [
            "Top->Environment->Climate Change",
            "Top->Social Sciences->Education"
        ]
    },
    "url": "http://videolectures.net/ccandun2010_marjanovic_rtei/",
    "segmentation": [
        [
            "And now I called to the floor professor purpose.",
            "Love my yanovich from Ada Queens University.",
            "Tentative title, teaching climate change the role of tertiary education institutions and barriers to effective curriculum transformation.",
            "At the.",
            "OK, thank you Mr Chairman.",
            "Again.",
            "Yeah it is.",
            "It is working but they have to be close to it.",
            "That's fine, OK.",
            "Thank you Mr Chairman.",
            "It's my pleasure to be able to address you again.",
            "Anne, Happy play a role for Devil's advocate.",
            "Today I'm gonna disagree.",
            "A lot has been said and I'm gonna post some questions.",
            "We have to erase it, so we agreed.",
            "We agreed.",
            "I think one thing to ask ourselves right from the beginning is let me talk about teaching climate change.",
            "And we talk about University level.",
            "Anemia.",
            "I was talking about teaching the experts to study climate change.",
            "Are we talking about teaching all the University students?",
            "About the main concepts in changing their behavior and thinking.",
            "Becauses without changing their thinking and behavior, no matter how many scientists on climate change we have, you know, going to solve the problem.",
            "So I'm going to take the second position and I'm not going to focus on teaching climate change, but there are some critical questions along the way."
        ],
        [
            "First, we have to recognize climate change for what it really is.",
            "Therefore, a station dying of the forest.",
            "The cartoon is.",
            "Amenable to transforming into the climate change context.",
            "Comes from Africa.",
            "They used to go to reveal themselves into the Bush and then suddenly the Bush disappeared.",
            "Is no place.",
            "Is the problem the Bush?",
            "What is the problem with indigenous knowledge?",
            "They had the knowledge.",
            "Go away from home.",
            "Dispose of your waste.",
            "Then we removed the place and we didn't provide an alternative.",
            "So when we talk about climate change and teaching climate change, we have to ask actually the right questions and put that in the right context, why?"
        ],
        [
            "Are we doing this?",
            "We also have to recognize.",
            "The real practicalities of this.",
            "We heard the.",
            "The experiences from IPC.",
            "We heard the copy hard again outcomes and so on.",
            "We come in.",
            "We make all these promises.",
            "We will do that.",
            "We set the goals.",
            "the UN system is very good at this.",
            "And you come 20 years later.",
            "And you say we solve the problem and you look around, then you're really recognizing the public isn't so.",
            "And there's something to have in mind when we start talking about teaching climate change."
        ],
        [
            "So was the climate change problem?",
            "Is it the problem of this kid not having water?",
            "To wash due to the changes in the weather patterns or whatever is it the problem of the bad governance on the side of the government and inability to provide the infrastructure?",
            "Because too much money is going into other issues or whatever.",
            "What is the real problem and how do we all see this?"
        ],
        [
            "And is this the way we see the climate change problem as a football bowl?",
            "And no matter who you are, you look at it and you see the same cross section.",
            "Everybody seals around.",
            "Thing doesn't matter from which angle you look at.",
            "I show you this, what do you see?",
            "I see this.",
            "Changes.",
            "What do we teach?",
            "Or is."
        ],
        [
            "Climate change really a very complex problem and we agreed yesterday I think.",
            "And it's clear I don't think we need to discuss this further, that it is indeed a very complex problem.",
            "And we manifested yesterday in the different views.",
            "We expressed the depending who you are.",
            "And how you look at that problem?",
            "You see different things.",
            "The government is the politicians will see one thing, one kind of problem we need to put money into this we're on X1 or running 0 cost money.",
            "The academia starts debating is it climatologies it's weather is it chemistry?",
            "Is it physics?",
            "The mitigation guys say no.",
            "It's a theology.",
            "Also.",
            "It's all kinds of different things.",
            "So I thinking at the tertiary level institutions we have to come up with teaching programs that recognize the problem for the Coke complexity it is and we have to provide the tools.",
            "And knowledge for all these different layers.",
            "Sorry to see the full complexity of the problem and understand it, not necessarily have solutions for it.",
            "The solutions will come maybe from one side or the other.",
            "How common language?",
            "Has to be such that we have the understanding of the complexity of the problem and the manifestations of that problem to society at large.",
            "And as we heard this morning.",
            "Ann is VR experience there.",
            "If you haven't found the right tools to do that."
        ],
        [
            "The next question I want to ask, what really is climate change science?",
            "We heard his methodology is modeling its chemistry is physics of the air.",
            "Why not ocean?",
            "Why chemistry physics various biology doesn't know biology happen?",
            "The greatest carbon sink is the ocean.",
            "And is the biological process which is the sink.",
            "So what is climate change science?",
            "Is it anything different than the science we already are well?",
            "Gear to teach at the science faculties around the world.",
            "What is missing?",
            "From our teaching of the fundamental science disciplines across the world.",
            "Is that missing link?",
            "How humans affect.",
            "The patterns.",
            "And cyclists that operate in nature.",
            "And what the manifestations of that?",
            "So I think what's missing is assistance thinking.",
            "That integrates these different disciplines and puts us in a position to understand the very complex problem.",
            "And I don't prescribe to the proposition.",
            "The policy and economics is not really science.",
            "And policy and.",
            "Management.",
            "Requires fundamental Sciences.",
            "As inputs into their decisions and so.",
            "But then they also understand required the understanding of that complex problem."
        ],
        [
            "Well.",
            "Unfortunately.",
            "Historically.",
            "We tend to take a little piece of that problem and cut it into disciplinary divides, and I'm going to do the modeling of the carbon transport tank.",
            "Wanna do the modeling of permissions?",
            "I'm going to measure chemistry.",
            "I'm gonna measure physics.",
            "I'm gonna look at decision-making.",
            "I'm going to talk to the people and you take that piece in isolation of the real problem."
        ],
        [
            "And you go and try to find the solution for that problem.",
            "Yet your problem is dynamic.",
            "Time is very important.",
            "Component is the crucial component.",
            "Your problem keeps changing in time.",
            "Is not 350 micrograms or milligrams anymore is 430.",
            "And by the time your partial solution comes, the problem shape that you extracted, that probably changed.",
            "Your solution doesn't fit, it's only partial.",
            "And then he said he made a mistake.",
            "It's our destiny.",
            "We always make mistakes.",
            "But we have to learn from them.",
            "And I don't."
        ],
        [
            "If you're doing enough of that.",
            "And yesterday we saw this garden diagram.",
            "What climate change is all about what we need to do?",
            "What are the requirements?",
            "What do we need to teach is all there, but is there anything wrong with this picture?",
            "Blastopore different symbol yes Thank you.",
            "What is wrong with this picture?",
            "Can you see anything fundamentally wrong with this picture?",
            "The house, which has a number of Florida, has the roof.",
            "Maybe some windows from the side, but what you don't see here?",
            "Sorry.",
            "Now the doors are taken out so we can see inside.",
            "Where is the foundation?",
            "What is the foundation of this house?",
            "Do you build a house without the foundations?",
            "You can, but you need to know how.",
            "And that's the missing link from our education also.",
            "The foundation for this science.",
            "Our ability to see this complex problem, and I again think is that ability to develop critical thinking skills in our students to take the data to take the information that is available from science.",
            "And understand the implications of that.",
            "We don't each very effectively that component, and I don't think you're doing a good job.",
            "So the foundation is missing, and that's systems thinking."
        ],
        [
            "So.",
            "The questions still remain.",
            "Who do we teach?"
        ],
        [
            "Movie theaters scientists.",
            "Economists, social scientists governance, the low people that the patient with people litigation people, those poor folks in the bottom.",
            "The people working in industry who do we teach?",
            "What is our role?",
            "What do we need to do?"
        ],
        [
            "What do we teach?",
            "I don't think we need to remind the teaching of physics, mathematics, biology that's very well done.",
            "Science has developed its way of quality control.",
            "Everything.",
            "Maybe you approaches to teaching better techniques you tools for the mentors are in place.",
            "What is what is missing from our teacher so?",
            "Sorry."
        ],
        [
            "So at this at the bottom layer we need new tools to synthesize the information to generate more data.",
            "To understand it better to create that big picture to make him make better forecasts and so.",
            "But that's going along anyway.",
            "The middle floor, the SoC there and the economy have a lot to learn yet.",
            "The economy has to learn about being sustainable.",
            "The society needs to learn about going away from consumer mentality.",
            "The politicians need to have to manage that.",
            "They need to learn.",
            "And we all need.",
            "Learn how to adapt to the coming change because you don't stop it or how to mitigate.",
            "Some of the elements of the Covenant change.",
            "So in our curricula as if there should be level institutions.",
            "Those things happen from the mentors that need to be covered."
        ],
        [
            "So where we are?",
            "There is a group discussing the primary education.",
            "Do you teach kids in primary schools in first and second garden?",
            "Yeah or studies?",
            "Do you teach them or do you preach to them?",
            "We have to make a difference.",
            "Teaching and preaching are two different things.",
            "At that early age.",
            "You preach to them.",
            "You get their commitment to go and tell their father, mother.",
            "Don't throw the paper in the desert, the street, pick it up and put it in the hospital.",
            "Getting the right framework opine.",
            "Getting the right attitudes, then you begin to introduce them to the fundamentals, the Sciences, mathematics, the literacy, the biology ography.",
            "In the secondary school.",
            "We teach, but again we need to teach fundamentals with some of the system level thinking.",
            "Their ability to understand the bigger picture in the and more the consequences of the changes of impact impacts of the human behavior.",
            "And in the third year 11 I said what we need to change.",
            "I'm not sure you can teach the policymakers.",
            "That's my personal.",
            "Value.",
            "That's the next step, public pressure.",
            "That's that's the next step.",
            "And where are we now?",
            "We each further along the way is getting bigger and bigger and the problem is getting bigger and bigger and it's getting more urgently.",
            "And I don't think that you in original program on climate change science is going to change much in the region.",
            "Well, that changes when everybody starts thinking.",
            "About the implications of their behavior on the bigger picture in the regional bigger global scale.",
            "Changing the mindset.",
            "Then we know that.",
            "So is longer running to do and a lot of hurdles to jump."
        ],
        [
            "Hey.",
            "And was there all of their share education?"
        ],
        [
            "Well.",
            "We can be the sheep that follow somebody.",
            "Is that photo share?",
            "Education is about."
        ],
        [
            "Or we can believe this lonely.",
            "The ships are behind them.",
            "Now the fishing education sector has to provide that leadership.",
            "They need to lead the transformation.",
            "The leadership in the needed transformation is not going to come from political sphere.",
            "The support Ville.",
            "But you have.",
            "Is it the sharing institutions you have to provide it leadership for?"
        ],
        [
            "Change.",
            "We have lost the right person.",
            "They have to teach the right concepts and I'm going to give you one example which is related to climate change because you're talking about emissions, but it's not really ready to teach.",
            "Answer A book called natural capitalism.",
            "Some of you may have read it.",
            "Their previous to turn limestone into structural material, lime stories, stuff rocking.",
            "You can cut it into blocks and you can make a payment on the street and that's nice.",
            "It can look nice.",
            "It's not really interesting.",
            "People have been doing this.",
            "You're in Roman times they'll be cutting rocks and building buildings so.",
            "It's more exciting to grind it up, burn it at 2700 degrees Fahrenheit or 1500 Celsius.",
            "Internet into Portland cement and then mix it with some.",
            "Gravel and make blocks and do the same that the Romans did.",
            "That's intelligent, that's industry you're employing people.",
            "But it's also very energy intensive, and it's the third biggest emission source cement production.",
            "Or you can feed it to chicken.",
            "And hours back.",
            "Get a strong eggshell.",
            "Which is made the same as assinment.",
            "And he's a global excellent.",
            "That much stronger.",
            "And manufactured at 37 degrees Centigrade.",
            "Why are we not as smart as chickens?",
            "Why don't we ask the right question?",
            "How does a chicken do that?",
            "That's a solution that's a mitigation solution.",
            "Change the way you're making cement.",
            "We need the group.",
            "We need some time not.",
            "At, the solution is coming up with new solutions to the.",
            "Things that we already do in the wrong way."
        ],
        [
            "Never have to do that I think, and I alluded to this yesterday.",
            "Instead of focusing on applying knowledge to do more of the same but better, more efficient to increase the productivity.",
            "We have to apply our knowledge to do things that we've never done before.",
            "There's that innovation.",
            "Learning how the chicken makes a man."
        ],
        [
            "Have we need to use the right approach?",
            "Especially in education?",
            "You know the old paradigm there.",
            "Ford Model T was being built and somebody phone Ford and said we want to buy a car and they put it on an order and it comes a month later.",
            "Is the car out of the factory even though they used to make them in two days?",
            "You build on demands and you manufacture from scratch.",
            "That's the old paradigm in education.",
            "You develop curricula.",
            "If there is a demand and you start new programs.",
            "So the new paradigm when you assemble the components, there are courses out there.",
            "On climate change on methodology modeling and there are beautiful and excellent courses right across Europe.",
            "At individual prices.",
            "Is packing them together?",
            "Bologna process allows for this.",
            "Why don't we put a program out of existing?",
            "Strong points, strong courses pulling together in the regional so we cannot do it all at one place.",
            "Through cooperation.",
            "Same engine.",
            "Same size.",
            "Yes.",
            "Packing in a better way."
        ],
        [
            "More efficient and better.",
            "We have to teach ourselves first to be able to do this and to go away from protecting your turf.",
            "I don't want to do something 'cause.",
            "Yes, you understand what they're saying."
        ],
        [
            "And we have, as I said, distinctly differentiate between teaching and preaching.",
            "If there should be level institutions, we should not preach.",
            "There is a role for preaching.",
            "In all this climate change solutions.",
            "We have to be given we have to win flexibility and freedom to change.",
            "The Bologna process, at least in this country, has led through a process of accreditation of University programs and degrees.",
            "You submit the application.",
            "The Accreditation Committee says, yeah, you don't have enough chemistry.",
            "You don't have enough this you don't have enough that you repackage it in order to pass.",
            "And on the end of the day, you get the Hodge.",
            "Omesh things that they're not really appropriate.",
            "That they don't meet the requirements we ended up ourselves with the program that gets 4 courses in chemistry at undergraduate level and not the one on climate change or aspects of climate change over there.",
            "So we need that flexibility and freedom to change.",
            "The administrative procedures are not geared to that.",
            "Institutional settings are not geared to death.",
            "We have to overcome those selfish disciplinary interests.",
            "If you don't have a critical mass.",
            "Yeah, no preachers.",
            "You don't know how to convince people.",
            "We need to learn more and is better, Shore said.",
            "Is we tend to think that we completed the communication that we accomplished the results, but in more often than not.",
            "That's an illusion.",
            "When you get the student at the exam.",
            "He's fails, don't always blame the student.",
            "It may be our fault.",
            "If you haven't managed to transfer the necessary knowledge and commitment.",
            "And across the board, in all the departments in all the schools that they should have in each to teach the foundations of sighting of sustainability of climate change, some fundamentals that's changing the mindset.",
            "The courses listed here are irrelevant.",
            "You can do it in many different ways.",
            "This is out."
        ],
        [
            "Masters program would be happy.",
            "But in each to teach."
        ],
        [
            "Fundamentals amini things that will change their mindsets the way they look at life, the way they look for Commerce, the way they look at the economy.",
            "And everything else.",
            "And we."
        ],
        [
            "Also meet these people.",
            "How to make a business case out of this climate change business?",
            "If there is no benefit, that's tangible.",
            "I don't think we stand a chance and finally change is a big business.",
            "And there is money to be made out of it.",
            "And those that are at the forefront of the activity are already making money off of it.",
            "And we're here.",
            "Because we want to start the project, we want to get some money to do something, so we're in the same business.",
            "We're not making profit that you're making money.",
            "OK. And those are the fundamentals that need to prove that it really is."
        ],
        [
            "Is really is very very simple.",
            "He is a society, individuals, corporations, institutions spend money on two things.",
            "We buy energy materials.",
            "And we only take to make two things.",
            "It only took we make product and I'm not brother.",
            "We do this because we want to create value for our family for ourselves, for our customers, for shareholders.",
            "The question is why do we spend money on inputs?",
            "To create CO2 as output that we don't need.",
            "Why do we spend money on input?",
            "To throw it away down the chimney.",
            "CO2 is carbon.",
            "Carbon is the main source of our fuels.",
            "The damage carry there must be a better way to deal with it.",
            "Check."
        ],
        [
            "Any conclusion?",
            "I think we need to plant the seeds first.",
            "And that's what we been trying to do for many years.",
            "Through the IPC.",
            "We're planting the seeds Sciences behind there.",
            "And the roots have begin to grow and the three slowly developing.",
            "That's when you plant the seed.",
            "You need to fertilize it.",
            "You need to water it.",
            "You need to nurture it.",
            "You need to get a pass out.",
            "If you're going to pick the fruit.",
            "And I don't think we're doing enough of this nurturing watering.",
            "And everything else.",
            "So the fruit is not there yet.",
            "The tree is growing, but the fruit is not there yet."
        ],
        [
            "It's a long way to go.",
            "Thank you.",
            "Thank you very much professor.",
            "My Android for this inspiring presentations.",
            "Are there any questions, comments please?",
            "Thank you first of all, I would like to thank Professor my on which this was really an into an interesting presentation and it seems that we have two different sets of opinions about teaching climate change.",
            "One is what Lucas said yesterday and today and the other one is what professor may I know which is saying and I must say I agree with both.",
            "I learned from Luedtke that we definitely need.",
            "Climate change scientists from physics and chemistry point of view, but as one of the teachers who is teaching sustainable development, I really, strongly agree with Professor my on which, and I think that everyone.",
            "In every school on all the levels that you have mentioned should learn about climate change in some way that is comprehensible for that level.",
            "So I think we we don't have to actually two opinions.",
            "We have one synergic opinion and I think we should both have high high level research and science and.",
            "Strong bases for teaching climate change at.",
            "All available institutions and an even even further out of education.",
            "We have to educate business as you said and and we have to educate people that we are in contact with.",
            "If we are teachers.",
            "And I do agree.",
            "We need strong commitment.",
            "About what we teach, what you called preaching.",
            "But let's maybe we should phrase it, not just let not preach, just let make it as.",
            "Maybe a mindset or a cultivating cultivating the mind.",
            "Which is, uh, some definition of culture.",
            "To get.",
            "Young children to think the way we think they should be going in the right direction about sustainability.",
            "Think I'm not going to comment about teaching or preaching.",
            "I think it's semantics is the warning you use.",
            "I don't think it's is that important, but what's important is there are different different aspects of aggressive one group versus target group versus the others you know.",
            "We listen to the preachers all the time, from the politics to the priest, it doesn't matter.",
            "We all have all those things have to role to play and I agree with you, I don't think we're disagreeing.",
            "I'm just that I saw my role here.",
            "Is generating some critical thinking and.",
            "Thank you come to something that will be beneficial to the region and the people in the region trying to pull the resources which are limited.",
            "The few people people are limited and see how can we maximize the impact we as a group.",
            "Involved in teaching climate change can maximize our impact to get get there, but we all know is is needed to get.",
            "So I got that there was no intention to create it.",
            "I agree with him.",
            "I mean is there is not to two schools of thinking but you know there there are.",
            "Why I'm I'm talking about physics and mathematics all the time is when you when you saw that slide about how did you say science and economy and so on.",
            "We must be aware of the processes that took place in our education system for the last 20 or 30 years.",
            "It used to be.",
            "That science was OK, so there was a curriculum in mathematics in physics in James, in the primary level, but no longer.",
            "These can change dramatically, because all these hours have shrink, and so nowadays you get with Matura student who doesn't know as much more than a matics as much as physics as much as chemistry as we did in our times.",
            "So this is the first problem, and the science is not necessarily there.",
            "The second problem is look at the the background education of policymakers.",
            "How many engineers are there?",
            "Very few economists lawyers, so actually with we used to say, well, they got their primary education fine, so they know the physics chemistry up to matura level no longer.",
            "And then they study below.",
            "Then this study economy and then they make decision about climate change about giga Watts.",
            "About energy.",
            "They don't have a clue what PPM is.",
            "The National Assembly.",
            "I've been there I've talked to them and they did.",
            "They don't say that in front of the microphone, but back then with coffee.",
            "Actually, they don't know what we were saying, so science is not OK. You cannot say you say do everything is fine, it is not longer being told that way and also in the Western world the majority of students switched all of the natural science.",
            "And you know this is a problem with this with Lisbon Strategy to pull again people in the field of natural science that this is what was my point, not about.",
            "I totally agree with it.",
            "But you know what actually bothers me a lot is.",
            "Using climate change for promoting some goals and you know to teach sustainable living, you don't have to teach climate change at all because it's it's about consumption.",
            "It's about poverty, so please don't use climate change for that reason, and also in the business using climate changes for greenwashing.",
            "Come on, let's not wait and the my last point is again to the education system.",
            "Years ago century ago.",
            "You know, I believe that Gaussian distribution still is valid.",
            "We have very few smart people.",
            "We have a lot of average people and a few very dumb.",
            "But today everybody has to study and a lot of schools have changed.",
            "The criteria is because we are paid per per per student head.",
            "So we enroll everybody and the bonus system forced us that we will be financed by diploma.",
            "So if we want University to leave, we have to give diploma to.",
            "Those who are not always necessarily able to provide the knowledge.",
            "This is the truth, and in this part of the world this was especially true.",
            "And you know, I am actually now speaking into my own Cup.",
            "But I mean, this is all interconnected and that's why I'm emphasizing physics, natural science so much.",
            "'cause to to to make good decisions?",
            "You have to have this balance.",
            "Balance just said.",
            "I agree, of course, but I just said that practice you told me previously that we're pretty late and it is now fashionable.",
            "To use climate change for a lot of things, and they found some cool terms of references for some project.",
            "I was looking yesterday and there were two qualification there looking climate change.",
            "Economists and climate change environmentalists.",
            "I just I'm just.",
            "This is a practice and they don't know what the person should be.",
            "Any idea and this is what is going on.",
            "It is now fashionable.",
            "OK, I could come with such a climate change economists, but kind of change environmentalists.",
            "I just don't have any idea.",
            "And this is the point.",
            "This is very good that we have this, but this is the last moment the practice is already have some moments then in front of us.",
            "This is exactly the basic question.",
            "What is the difference between climate change economists and climate change environmentalists?",
            "If we're professors here, I don't know if anybody has a clue what is.",
            "Yeah.",
            "It's an economist with the trend in climate change.",
            "Yes, yeah, they have at the end or relevant experience.",
            "It is a request is natural science economy or relevant experience.",
            "There's one thing I have, you know.",
            "I used to travel a lot and people at the Belgrade customs at the airport.",
            "Police managed to at some time remember my face.",
            "Yeah.",
            "And once I came in, there was a guy who has seen me 5 six times ago I came to the passport desk and say hi morning.",
            "And he says your passport is who are you?",
            "I said no.",
            "My father comes from a village of so and so is the famous family.",
            "I'm his son.",
            "You know me?",
            "What are you playing?",
            "He said my give me your passport.",
            "I don't care who you are so I give him my ideal passport.",
            "He likes it and let you bro.",
            "And you suddenly realize that it doesn't matter who you really are.",
            "What matters is what the paper says you are.",
            "And the same happens when you go to hotel.",
            "They ask how you going to base there.",
            "From playing and there is George, so give me your credit card.",
            "This tells them who I am or how much money I have.",
            "They don't care who you are as a person.",
            "So if the paper says environmental or climate change economists that works what you know it doesn't.",
            "I will start for the end.",
            "I also disagree with you because I just remember few years ago we tried to establish one you project and it was basically climate change project but we have we need somebody to deal with social economic aspects.",
            "Of climate change and we find few people with some reference.",
            "Some papers as you said.",
            "But when I told them what we expect, what kind of analysis calculations impact studies, I mean numbers and results.",
            "They said that they are really not sure that they can do this so we can have paper, but you couldn't get money from the project if behind.",
            "This paper is not knowledge, I'm absolutely sure about this that maybe once.",
            "Maybe once.",
            "You could cheat somebody, but you know everybody knows after that that you do this, but you was not effective on this project and nobody will invite you again.",
            "I have that experience with some people, but they would like just to add some sentences with this.",
            "With Luedtke said, I think that when we are teaching climate change, faculty or floor economics or agriculture have that kind of experience.",
            "We have to put some science in this.",
            "I mean, adaptation is not enough, but question is how we teach science.",
            "I'm physicist, I know that when I start to talk from completely physically based my lectures to students of every culture, first year of agriculture now they came from different very different backgrounds but they do not study agriculture because they love mathematics, physics, things like this.",
            "If I write any equation on this blackboard, I just can find this view.",
            "We cause some somewhere else.",
            "You know they do not.",
            "Yes, I lose them completely.",
            "So I think that we have to teach climate change on that kind of faculties completely on final logical way.",
            "And that's the way because some science have to be put on this curricula, of course, but with very, very strong impact studies.",
            "And we need bank people in economy, banking, stock market, which knows something about climate change.",
            "I mean how somebody who's.",
            "Studying economy can make assessment of climate change, impact of trading or stock market and prices if he do not know what kind of exchange environment he can expect.",
            "So I think that's very, very important.",
            "And this Vienna Venice.",
            "Studying Gandak doctoral level is great one, but I'm afraid one thing if we organize that only at first sight on the doctoral level, we have to wait at least four years.",
            "Did somebody finish this doctoral studies to finish PTTS?",
            "Then we have to wait at least three or four years that this person start to teach something about climate change at University, and after that we need, for example, next three or four or five years to have first experts on Bachelor level which are teached by somebody who finished this climate change study.",
            "So for example we have 10 or 15 years between.",
            "Now and 1st Battle students which have that kind of knowledge and experience.",
            "So I think that we of course have to participate in that kind of doctoral studies.",
            "But we have to introduce climate change in all curicculum on all faculties.",
            "Question is only how it's very difficult, and I believe I believe on interactive studies.",
            "Maybe it's one way.",
            "I don't know.",
            "There is a lot of recording.",
            "Recorded the lessons on YouTube on Internet.",
            "Maybe we can organize something like this to to establish for license on certain topics to merge all of them for faculty of Flow for Faculty of Economix, for Faculty of Agriculture, whatever, and then share that kind of material.",
            "I think that in southeastern Europe we can collect 20 or 30 or 50 people, which are really, really experts in some area of of climate change impact studies.",
            "I think that when we are speaking about scientific base, it will be a little bit easier to find paper.",
            "I don't know.",
            "I have that kind of impression, maybe because I'm from this field, but impact studies in social scientists in medicine and economics.",
            "I think it will be.",
            "Really, really difficult to find people.",
            "Thank you.",
            "OK, I got it.",
            "Mr Doug was faster.",
            "In cards we have since eight years and interdisciplinary environmental system science study.",
            "It integrates several disciplines, chemistry, physics, economy and the aim was to create an understanding of the Inter relationships.",
            "But it didn't work because because the teachers professors have no experience in system science in understanding the interrelationships themselves.",
            "So I think we have to educate the teachers we have to educate the professors in teaching in understanding the interdependencies.",
            "Yeah, teaching the educators first, yes.",
            "Systems level approach I think is missing right across the border.",
            "By the way, I am climate economists.",
            "If anybody, if anybody, wants to meet the climate economists.",
            "It works for you.",
            "Just a touch.",
            "Just giving a comment that and a little bit jealous to people who are from physics or simple natural science.",
            "My background is chemical engineering thermodynamics, but I'm not working dead for about 20 years and.",
            "I'm having the problems for about 20 years.",
            "What is environmental science in the region?",
            "Because they put us.",
            "In the Rose are are you natural science environment is natural science.",
            "Environmental engineering is engineering science and I'm having the same role of think the battle for decade like we are now talking about climate change because I'm not.",
            "I would like to be physics or chemists and but I'm not and this is always with this interdisciplinary issue.",
            "We're always having the problem.",
            "What we?",
            "What are the competences for us?",
            "What it is very difficult to to to reach any consensus.",
            "You know, medical doctors are teaching a lot of environmental issues and they just.",
            "We have a lot of problems in my life with medical doctors teaching environmental impact assessment, but this is now we're starting by climate change.",
            "It is really.",
            "We don't have the the the language between different Sciences to understand each other.",
            "It is not issue that I know everything.",
            "It is the issue to know what you know and you know who else knows.",
            "Yes and this is I just would like to.",
            "Like that you know that's easy for you.",
            "Science for our science.",
            "It's not easy.",
            "It's not easy.",
            "We are now preparing for this new round of research projects for MNIST recall and we are trying to figure out where we are.",
            "Becausw ecologiste biologist.",
            "You know this is is.",
            "Yes, this is a something that just to add his account.",
            "I will try to be brief in my PhD paper is written political geographer, but I'm a strange breed, which makes me very happy indeed.",
            "An talking about passport.",
            "My Italian passport was much better than my UN passport, at least in this region.",
            "So sometimes I also have some crisis of identity and listening to you is it's bringing me back to my.",
            "Ask a context where we have this so called scientific meeting where we invite scientists from different disciplines to tell us what we better should do and the discussion is always getting lossed in defining what is science and what is not.",
            "What is serious science in what is not serious.",
            "So this summary assembled to me with all the respect.",
            "So without repeating what I said yesterday, I think a very good contribution before we got totally lost with this ship somewhere.",
            "And then the breaker will tell you joke.",
            "At night, certain contribution of this critical mass of beautiful minds as you are would be to try to put down at the end of today something that looks like a rational and possibly tentative program.",
            "A concrete proposal that we could really use in the decade to advance when I say to advance, I mean I respect the plurality of Sciences as a respect the plurality of other human expressions.",
            "With all the difficult this implies of course, and climate change is one of these big discourses as it was the one on sustainable development where at different opinions can be accommodated.",
            "And I'd like to see them all equally legitimate.",
            "Then we can discuss how to advance what I don't see at all is a scientific approach in place, and that's what I'm expecting from scientists.",
            "Can we try to measure?",
            "At the best extent possible, what we're talking about.",
            "I mean, if he created an interdisciplinary project, the doctoral undergrad doesn't really matter.",
            "Can we try to measure what's happening?",
            "People's brain at the end of the process, because that's what we need.",
            "Otherwise we can be really lost in the epistemological confrontation, which is good once in awhile.",
            "I always recommend people to have this brainstorming, maybe to end up in Cabana, but then we have to try what I did in the two years project.",
            "Devoted to education for sustainable development was in this region and I'm happy to share with you.",
            "The results was to hire an expert in learning process.",
            "I said don't need an expert in climate change.",
            "I don't need an expert in biology.",
            "I need an expert in learning process and with these gentlemen we measure what was happening in people's mind when we organize summer school for students of different disciplines, for example, or for students of different countries.",
            "In other way, those hypothesis has to be tested.",
            "Is this really working in terms of regional integration to put Bosnian student together with Serbian student together we creation so it doesn't work or not what's happening in their minds?",
            "Is it really OK to have different disciplines attacking one case study and dismantling what's happening in their brain etc etc.",
            "And we ended up with a project on teaching the teachers as we like to color and the manual is available free of charge.",
            "Find the website of the Sun Devil Right Center, because that's how you have to get started.",
            "So a system approach is not something that you invent if you don't have it in your mind and you have to cultivate it as many other approaches.",
            "So we ended up with that.",
            "Maybe we should have started with it anyway.",
            "It's part of the experimentation so conclusion, help me to help you.",
            "I mean from the UNESCO POV and try, let's be scientifically approached.",
            "I mean, let's try to put down something to test some of these hypothesis and then we all give you an excellent contribution to the advancement of this.",
            "Doesn't matter if it's applied to climate change, I hope it's clear.",
            "Thank you.",
            "Thank you very much, Roger.",
            "Do we have volunteers who would help in such an endeavor to put something together?",
            "Good great.",
            "Very good somebody's also.",
            "That would be good.",
            "So we will try to come together then perhaps.",
            "After the closing of the conference, also sit together for some 1015 minutes trying to put something together."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And now I called to the floor professor purpose.",
                    "label": 0
                },
                {
                    "sent": "Love my yanovich from Ada Queens University.",
                    "label": 0
                },
                {
                    "sent": "Tentative title, teaching climate change the role of tertiary education institutions and barriers to effective curriculum transformation.",
                    "label": 1
                },
                {
                    "sent": "At the.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you Mr Chairman.",
                    "label": 0
                },
                {
                    "sent": "Again.",
                    "label": 0
                },
                {
                    "sent": "Yeah it is.",
                    "label": 0
                },
                {
                    "sent": "It is working but they have to be close to it.",
                    "label": 0
                },
                {
                    "sent": "That's fine, OK.",
                    "label": 0
                },
                {
                    "sent": "Thank you Mr Chairman.",
                    "label": 0
                },
                {
                    "sent": "It's my pleasure to be able to address you again.",
                    "label": 0
                },
                {
                    "sent": "Anne, Happy play a role for Devil's advocate.",
                    "label": 0
                },
                {
                    "sent": "Today I'm gonna disagree.",
                    "label": 0
                },
                {
                    "sent": "A lot has been said and I'm gonna post some questions.",
                    "label": 0
                },
                {
                    "sent": "We have to erase it, so we agreed.",
                    "label": 0
                },
                {
                    "sent": "We agreed.",
                    "label": 0
                },
                {
                    "sent": "I think one thing to ask ourselves right from the beginning is let me talk about teaching climate change.",
                    "label": 0
                },
                {
                    "sent": "And we talk about University level.",
                    "label": 0
                },
                {
                    "sent": "Anemia.",
                    "label": 0
                },
                {
                    "sent": "I was talking about teaching the experts to study climate change.",
                    "label": 0
                },
                {
                    "sent": "Are we talking about teaching all the University students?",
                    "label": 0
                },
                {
                    "sent": "About the main concepts in changing their behavior and thinking.",
                    "label": 0
                },
                {
                    "sent": "Becauses without changing their thinking and behavior, no matter how many scientists on climate change we have, you know, going to solve the problem.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to take the second position and I'm not going to focus on teaching climate change, but there are some critical questions along the way.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First, we have to recognize climate change for what it really is.",
                    "label": 1
                },
                {
                    "sent": "Therefore, a station dying of the forest.",
                    "label": 0
                },
                {
                    "sent": "The cartoon is.",
                    "label": 0
                },
                {
                    "sent": "Amenable to transforming into the climate change context.",
                    "label": 0
                },
                {
                    "sent": "Comes from Africa.",
                    "label": 0
                },
                {
                    "sent": "They used to go to reveal themselves into the Bush and then suddenly the Bush disappeared.",
                    "label": 0
                },
                {
                    "sent": "Is no place.",
                    "label": 0
                },
                {
                    "sent": "Is the problem the Bush?",
                    "label": 0
                },
                {
                    "sent": "What is the problem with indigenous knowledge?",
                    "label": 0
                },
                {
                    "sent": "They had the knowledge.",
                    "label": 0
                },
                {
                    "sent": "Go away from home.",
                    "label": 0
                },
                {
                    "sent": "Dispose of your waste.",
                    "label": 0
                },
                {
                    "sent": "Then we removed the place and we didn't provide an alternative.",
                    "label": 0
                },
                {
                    "sent": "So when we talk about climate change and teaching climate change, we have to ask actually the right questions and put that in the right context, why?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Are we doing this?",
                    "label": 0
                },
                {
                    "sent": "We also have to recognize.",
                    "label": 0
                },
                {
                    "sent": "The real practicalities of this.",
                    "label": 1
                },
                {
                    "sent": "We heard the.",
                    "label": 0
                },
                {
                    "sent": "The experiences from IPC.",
                    "label": 0
                },
                {
                    "sent": "We heard the copy hard again outcomes and so on.",
                    "label": 0
                },
                {
                    "sent": "We come in.",
                    "label": 0
                },
                {
                    "sent": "We make all these promises.",
                    "label": 0
                },
                {
                    "sent": "We will do that.",
                    "label": 0
                },
                {
                    "sent": "We set the goals.",
                    "label": 0
                },
                {
                    "sent": "the UN system is very good at this.",
                    "label": 0
                },
                {
                    "sent": "And you come 20 years later.",
                    "label": 0
                },
                {
                    "sent": "And you say we solve the problem and you look around, then you're really recognizing the public isn't so.",
                    "label": 0
                },
                {
                    "sent": "And there's something to have in mind when we start talking about teaching climate change.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So was the climate change problem?",
                    "label": 0
                },
                {
                    "sent": "Is it the problem of this kid not having water?",
                    "label": 0
                },
                {
                    "sent": "To wash due to the changes in the weather patterns or whatever is it the problem of the bad governance on the side of the government and inability to provide the infrastructure?",
                    "label": 0
                },
                {
                    "sent": "Because too much money is going into other issues or whatever.",
                    "label": 0
                },
                {
                    "sent": "What is the real problem and how do we all see this?",
                    "label": 1
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And is this the way we see the climate change problem as a football bowl?",
                    "label": 1
                },
                {
                    "sent": "And no matter who you are, you look at it and you see the same cross section.",
                    "label": 0
                },
                {
                    "sent": "Everybody seals around.",
                    "label": 0
                },
                {
                    "sent": "Thing doesn't matter from which angle you look at.",
                    "label": 0
                },
                {
                    "sent": "I show you this, what do you see?",
                    "label": 0
                },
                {
                    "sent": "I see this.",
                    "label": 0
                },
                {
                    "sent": "Changes.",
                    "label": 0
                },
                {
                    "sent": "What do we teach?",
                    "label": 0
                },
                {
                    "sent": "Or is.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Climate change really a very complex problem and we agreed yesterday I think.",
                    "label": 0
                },
                {
                    "sent": "And it's clear I don't think we need to discuss this further, that it is indeed a very complex problem.",
                    "label": 0
                },
                {
                    "sent": "And we manifested yesterday in the different views.",
                    "label": 0
                },
                {
                    "sent": "We expressed the depending who you are.",
                    "label": 0
                },
                {
                    "sent": "And how you look at that problem?",
                    "label": 0
                },
                {
                    "sent": "You see different things.",
                    "label": 0
                },
                {
                    "sent": "The government is the politicians will see one thing, one kind of problem we need to put money into this we're on X1 or running 0 cost money.",
                    "label": 0
                },
                {
                    "sent": "The academia starts debating is it climatologies it's weather is it chemistry?",
                    "label": 0
                },
                {
                    "sent": "Is it physics?",
                    "label": 0
                },
                {
                    "sent": "The mitigation guys say no.",
                    "label": 0
                },
                {
                    "sent": "It's a theology.",
                    "label": 0
                },
                {
                    "sent": "Also.",
                    "label": 0
                },
                {
                    "sent": "It's all kinds of different things.",
                    "label": 0
                },
                {
                    "sent": "So I thinking at the tertiary level institutions we have to come up with teaching programs that recognize the problem for the Coke complexity it is and we have to provide the tools.",
                    "label": 0
                },
                {
                    "sent": "And knowledge for all these different layers.",
                    "label": 0
                },
                {
                    "sent": "Sorry to see the full complexity of the problem and understand it, not necessarily have solutions for it.",
                    "label": 0
                },
                {
                    "sent": "The solutions will come maybe from one side or the other.",
                    "label": 0
                },
                {
                    "sent": "How common language?",
                    "label": 0
                },
                {
                    "sent": "Has to be such that we have the understanding of the complexity of the problem and the manifestations of that problem to society at large.",
                    "label": 0
                },
                {
                    "sent": "And as we heard this morning.",
                    "label": 0
                },
                {
                    "sent": "Ann is VR experience there.",
                    "label": 0
                },
                {
                    "sent": "If you haven't found the right tools to do that.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The next question I want to ask, what really is climate change science?",
                    "label": 1
                },
                {
                    "sent": "We heard his methodology is modeling its chemistry is physics of the air.",
                    "label": 0
                },
                {
                    "sent": "Why not ocean?",
                    "label": 0
                },
                {
                    "sent": "Why chemistry physics various biology doesn't know biology happen?",
                    "label": 0
                },
                {
                    "sent": "The greatest carbon sink is the ocean.",
                    "label": 0
                },
                {
                    "sent": "And is the biological process which is the sink.",
                    "label": 0
                },
                {
                    "sent": "So what is climate change science?",
                    "label": 0
                },
                {
                    "sent": "Is it anything different than the science we already are well?",
                    "label": 0
                },
                {
                    "sent": "Gear to teach at the science faculties around the world.",
                    "label": 0
                },
                {
                    "sent": "What is missing?",
                    "label": 1
                },
                {
                    "sent": "From our teaching of the fundamental science disciplines across the world.",
                    "label": 0
                },
                {
                    "sent": "Is that missing link?",
                    "label": 0
                },
                {
                    "sent": "How humans affect.",
                    "label": 0
                },
                {
                    "sent": "The patterns.",
                    "label": 0
                },
                {
                    "sent": "And cyclists that operate in nature.",
                    "label": 0
                },
                {
                    "sent": "And what the manifestations of that?",
                    "label": 0
                },
                {
                    "sent": "So I think what's missing is assistance thinking.",
                    "label": 0
                },
                {
                    "sent": "That integrates these different disciplines and puts us in a position to understand the very complex problem.",
                    "label": 0
                },
                {
                    "sent": "And I don't prescribe to the proposition.",
                    "label": 1
                },
                {
                    "sent": "The policy and economics is not really science.",
                    "label": 0
                },
                {
                    "sent": "And policy and.",
                    "label": 0
                },
                {
                    "sent": "Management.",
                    "label": 1
                },
                {
                    "sent": "Requires fundamental Sciences.",
                    "label": 0
                },
                {
                    "sent": "As inputs into their decisions and so.",
                    "label": 0
                },
                {
                    "sent": "But then they also understand required the understanding of that complex problem.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "Unfortunately.",
                    "label": 0
                },
                {
                    "sent": "Historically.",
                    "label": 0
                },
                {
                    "sent": "We tend to take a little piece of that problem and cut it into disciplinary divides, and I'm going to do the modeling of the carbon transport tank.",
                    "label": 1
                },
                {
                    "sent": "Wanna do the modeling of permissions?",
                    "label": 0
                },
                {
                    "sent": "I'm going to measure chemistry.",
                    "label": 0
                },
                {
                    "sent": "I'm gonna measure physics.",
                    "label": 0
                },
                {
                    "sent": "I'm gonna look at decision-making.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk to the people and you take that piece in isolation of the real problem.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you go and try to find the solution for that problem.",
                    "label": 0
                },
                {
                    "sent": "Yet your problem is dynamic.",
                    "label": 0
                },
                {
                    "sent": "Time is very important.",
                    "label": 0
                },
                {
                    "sent": "Component is the crucial component.",
                    "label": 0
                },
                {
                    "sent": "Your problem keeps changing in time.",
                    "label": 0
                },
                {
                    "sent": "Is not 350 micrograms or milligrams anymore is 430.",
                    "label": 0
                },
                {
                    "sent": "And by the time your partial solution comes, the problem shape that you extracted, that probably changed.",
                    "label": 0
                },
                {
                    "sent": "Your solution doesn't fit, it's only partial.",
                    "label": 0
                },
                {
                    "sent": "And then he said he made a mistake.",
                    "label": 0
                },
                {
                    "sent": "It's our destiny.",
                    "label": 0
                },
                {
                    "sent": "We always make mistakes.",
                    "label": 0
                },
                {
                    "sent": "But we have to learn from them.",
                    "label": 0
                },
                {
                    "sent": "And I don't.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "If you're doing enough of that.",
                    "label": 0
                },
                {
                    "sent": "And yesterday we saw this garden diagram.",
                    "label": 0
                },
                {
                    "sent": "What climate change is all about what we need to do?",
                    "label": 0
                },
                {
                    "sent": "What are the requirements?",
                    "label": 0
                },
                {
                    "sent": "What do we need to teach is all there, but is there anything wrong with this picture?",
                    "label": 1
                },
                {
                    "sent": "Blastopore different symbol yes Thank you.",
                    "label": 0
                },
                {
                    "sent": "What is wrong with this picture?",
                    "label": 0
                },
                {
                    "sent": "Can you see anything fundamentally wrong with this picture?",
                    "label": 0
                },
                {
                    "sent": "The house, which has a number of Florida, has the roof.",
                    "label": 0
                },
                {
                    "sent": "Maybe some windows from the side, but what you don't see here?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Now the doors are taken out so we can see inside.",
                    "label": 0
                },
                {
                    "sent": "Where is the foundation?",
                    "label": 0
                },
                {
                    "sent": "What is the foundation of this house?",
                    "label": 0
                },
                {
                    "sent": "Do you build a house without the foundations?",
                    "label": 0
                },
                {
                    "sent": "You can, but you need to know how.",
                    "label": 0
                },
                {
                    "sent": "And that's the missing link from our education also.",
                    "label": 0
                },
                {
                    "sent": "The foundation for this science.",
                    "label": 0
                },
                {
                    "sent": "Our ability to see this complex problem, and I again think is that ability to develop critical thinking skills in our students to take the data to take the information that is available from science.",
                    "label": 0
                },
                {
                    "sent": "And understand the implications of that.",
                    "label": 0
                },
                {
                    "sent": "We don't each very effectively that component, and I don't think you're doing a good job.",
                    "label": 0
                },
                {
                    "sent": "So the foundation is missing, and that's systems thinking.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The questions still remain.",
                    "label": 0
                },
                {
                    "sent": "Who do we teach?",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Movie theaters scientists.",
                    "label": 0
                },
                {
                    "sent": "Economists, social scientists governance, the low people that the patient with people litigation people, those poor folks in the bottom.",
                    "label": 0
                },
                {
                    "sent": "The people working in industry who do we teach?",
                    "label": 0
                },
                {
                    "sent": "What is our role?",
                    "label": 0
                },
                {
                    "sent": "What do we need to do?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What do we teach?",
                    "label": 0
                },
                {
                    "sent": "I don't think we need to remind the teaching of physics, mathematics, biology that's very well done.",
                    "label": 0
                },
                {
                    "sent": "Science has developed its way of quality control.",
                    "label": 0
                },
                {
                    "sent": "Everything.",
                    "label": 0
                },
                {
                    "sent": "Maybe you approaches to teaching better techniques you tools for the mentors are in place.",
                    "label": 0
                },
                {
                    "sent": "What is what is missing from our teacher so?",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So at this at the bottom layer we need new tools to synthesize the information to generate more data.",
                    "label": 0
                },
                {
                    "sent": "To understand it better to create that big picture to make him make better forecasts and so.",
                    "label": 0
                },
                {
                    "sent": "But that's going along anyway.",
                    "label": 0
                },
                {
                    "sent": "The middle floor, the SoC there and the economy have a lot to learn yet.",
                    "label": 0
                },
                {
                    "sent": "The economy has to learn about being sustainable.",
                    "label": 0
                },
                {
                    "sent": "The society needs to learn about going away from consumer mentality.",
                    "label": 0
                },
                {
                    "sent": "The politicians need to have to manage that.",
                    "label": 0
                },
                {
                    "sent": "They need to learn.",
                    "label": 0
                },
                {
                    "sent": "And we all need.",
                    "label": 0
                },
                {
                    "sent": "Learn how to adapt to the coming change because you don't stop it or how to mitigate.",
                    "label": 0
                },
                {
                    "sent": "Some of the elements of the Covenant change.",
                    "label": 0
                },
                {
                    "sent": "So in our curricula as if there should be level institutions.",
                    "label": 0
                },
                {
                    "sent": "Those things happen from the mentors that need to be covered.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So where we are?",
                    "label": 0
                },
                {
                    "sent": "There is a group discussing the primary education.",
                    "label": 0
                },
                {
                    "sent": "Do you teach kids in primary schools in first and second garden?",
                    "label": 0
                },
                {
                    "sent": "Yeah or studies?",
                    "label": 0
                },
                {
                    "sent": "Do you teach them or do you preach to them?",
                    "label": 0
                },
                {
                    "sent": "We have to make a difference.",
                    "label": 0
                },
                {
                    "sent": "Teaching and preaching are two different things.",
                    "label": 0
                },
                {
                    "sent": "At that early age.",
                    "label": 0
                },
                {
                    "sent": "You preach to them.",
                    "label": 0
                },
                {
                    "sent": "You get their commitment to go and tell their father, mother.",
                    "label": 0
                },
                {
                    "sent": "Don't throw the paper in the desert, the street, pick it up and put it in the hospital.",
                    "label": 0
                },
                {
                    "sent": "Getting the right framework opine.",
                    "label": 0
                },
                {
                    "sent": "Getting the right attitudes, then you begin to introduce them to the fundamentals, the Sciences, mathematics, the literacy, the biology ography.",
                    "label": 0
                },
                {
                    "sent": "In the secondary school.",
                    "label": 0
                },
                {
                    "sent": "We teach, but again we need to teach fundamentals with some of the system level thinking.",
                    "label": 0
                },
                {
                    "sent": "Their ability to understand the bigger picture in the and more the consequences of the changes of impact impacts of the human behavior.",
                    "label": 0
                },
                {
                    "sent": "And in the third year 11 I said what we need to change.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure you can teach the policymakers.",
                    "label": 0
                },
                {
                    "sent": "That's my personal.",
                    "label": 0
                },
                {
                    "sent": "Value.",
                    "label": 0
                },
                {
                    "sent": "That's the next step, public pressure.",
                    "label": 0
                },
                {
                    "sent": "That's that's the next step.",
                    "label": 0
                },
                {
                    "sent": "And where are we now?",
                    "label": 1
                },
                {
                    "sent": "We each further along the way is getting bigger and bigger and the problem is getting bigger and bigger and it's getting more urgently.",
                    "label": 0
                },
                {
                    "sent": "And I don't think that you in original program on climate change science is going to change much in the region.",
                    "label": 0
                },
                {
                    "sent": "Well, that changes when everybody starts thinking.",
                    "label": 0
                },
                {
                    "sent": "About the implications of their behavior on the bigger picture in the regional bigger global scale.",
                    "label": 0
                },
                {
                    "sent": "Changing the mindset.",
                    "label": 0
                },
                {
                    "sent": "Then we know that.",
                    "label": 0
                },
                {
                    "sent": "So is longer running to do and a lot of hurdles to jump.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "And was there all of their share education?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well.",
                    "label": 0
                },
                {
                    "sent": "We can be the sheep that follow somebody.",
                    "label": 0
                },
                {
                    "sent": "Is that photo share?",
                    "label": 0
                },
                {
                    "sent": "Education is about.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or we can believe this lonely.",
                    "label": 0
                },
                {
                    "sent": "The ships are behind them.",
                    "label": 0
                },
                {
                    "sent": "Now the fishing education sector has to provide that leadership.",
                    "label": 0
                },
                {
                    "sent": "They need to lead the transformation.",
                    "label": 0
                },
                {
                    "sent": "The leadership in the needed transformation is not going to come from political sphere.",
                    "label": 0
                },
                {
                    "sent": "The support Ville.",
                    "label": 0
                },
                {
                    "sent": "But you have.",
                    "label": 0
                },
                {
                    "sent": "Is it the sharing institutions you have to provide it leadership for?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Change.",
                    "label": 0
                },
                {
                    "sent": "We have lost the right person.",
                    "label": 0
                },
                {
                    "sent": "They have to teach the right concepts and I'm going to give you one example which is related to climate change because you're talking about emissions, but it's not really ready to teach.",
                    "label": 0
                },
                {
                    "sent": "Answer A book called natural capitalism.",
                    "label": 0
                },
                {
                    "sent": "Some of you may have read it.",
                    "label": 0
                },
                {
                    "sent": "Their previous to turn limestone into structural material, lime stories, stuff rocking.",
                    "label": 1
                },
                {
                    "sent": "You can cut it into blocks and you can make a payment on the street and that's nice.",
                    "label": 0
                },
                {
                    "sent": "It can look nice.",
                    "label": 0
                },
                {
                    "sent": "It's not really interesting.",
                    "label": 0
                },
                {
                    "sent": "People have been doing this.",
                    "label": 1
                },
                {
                    "sent": "You're in Roman times they'll be cutting rocks and building buildings so.",
                    "label": 1
                },
                {
                    "sent": "It's more exciting to grind it up, burn it at 2700 degrees Fahrenheit or 1500 Celsius.",
                    "label": 0
                },
                {
                    "sent": "Internet into Portland cement and then mix it with some.",
                    "label": 0
                },
                {
                    "sent": "Gravel and make blocks and do the same that the Romans did.",
                    "label": 0
                },
                {
                    "sent": "That's intelligent, that's industry you're employing people.",
                    "label": 1
                },
                {
                    "sent": "But it's also very energy intensive, and it's the third biggest emission source cement production.",
                    "label": 0
                },
                {
                    "sent": "Or you can feed it to chicken.",
                    "label": 0
                },
                {
                    "sent": "And hours back.",
                    "label": 0
                },
                {
                    "sent": "Get a strong eggshell.",
                    "label": 0
                },
                {
                    "sent": "Which is made the same as assinment.",
                    "label": 0
                },
                {
                    "sent": "And he's a global excellent.",
                    "label": 0
                },
                {
                    "sent": "That much stronger.",
                    "label": 0
                },
                {
                    "sent": "And manufactured at 37 degrees Centigrade.",
                    "label": 1
                },
                {
                    "sent": "Why are we not as smart as chickens?",
                    "label": 0
                },
                {
                    "sent": "Why don't we ask the right question?",
                    "label": 0
                },
                {
                    "sent": "How does a chicken do that?",
                    "label": 0
                },
                {
                    "sent": "That's a solution that's a mitigation solution.",
                    "label": 0
                },
                {
                    "sent": "Change the way you're making cement.",
                    "label": 0
                },
                {
                    "sent": "We need the group.",
                    "label": 0
                },
                {
                    "sent": "We need some time not.",
                    "label": 0
                },
                {
                    "sent": "At, the solution is coming up with new solutions to the.",
                    "label": 0
                },
                {
                    "sent": "Things that we already do in the wrong way.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Never have to do that I think, and I alluded to this yesterday.",
                    "label": 0
                },
                {
                    "sent": "Instead of focusing on applying knowledge to do more of the same but better, more efficient to increase the productivity.",
                    "label": 0
                },
                {
                    "sent": "We have to apply our knowledge to do things that we've never done before.",
                    "label": 0
                },
                {
                    "sent": "There's that innovation.",
                    "label": 0
                },
                {
                    "sent": "Learning how the chicken makes a man.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have we need to use the right approach?",
                    "label": 1
                },
                {
                    "sent": "Especially in education?",
                    "label": 1
                },
                {
                    "sent": "You know the old paradigm there.",
                    "label": 0
                },
                {
                    "sent": "Ford Model T was being built and somebody phone Ford and said we want to buy a car and they put it on an order and it comes a month later.",
                    "label": 1
                },
                {
                    "sent": "Is the car out of the factory even though they used to make them in two days?",
                    "label": 0
                },
                {
                    "sent": "You build on demands and you manufacture from scratch.",
                    "label": 0
                },
                {
                    "sent": "That's the old paradigm in education.",
                    "label": 0
                },
                {
                    "sent": "You develop curricula.",
                    "label": 0
                },
                {
                    "sent": "If there is a demand and you start new programs.",
                    "label": 0
                },
                {
                    "sent": "So the new paradigm when you assemble the components, there are courses out there.",
                    "label": 0
                },
                {
                    "sent": "On climate change on methodology modeling and there are beautiful and excellent courses right across Europe.",
                    "label": 0
                },
                {
                    "sent": "At individual prices.",
                    "label": 0
                },
                {
                    "sent": "Is packing them together?",
                    "label": 0
                },
                {
                    "sent": "Bologna process allows for this.",
                    "label": 0
                },
                {
                    "sent": "Why don't we put a program out of existing?",
                    "label": 0
                },
                {
                    "sent": "Strong points, strong courses pulling together in the regional so we cannot do it all at one place.",
                    "label": 0
                },
                {
                    "sent": "Through cooperation.",
                    "label": 0
                },
                {
                    "sent": "Same engine.",
                    "label": 0
                },
                {
                    "sent": "Same size.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Packing in a better way.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "More efficient and better.",
                    "label": 0
                },
                {
                    "sent": "We have to teach ourselves first to be able to do this and to go away from protecting your turf.",
                    "label": 0
                },
                {
                    "sent": "I don't want to do something 'cause.",
                    "label": 0
                },
                {
                    "sent": "Yes, you understand what they're saying.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we have, as I said, distinctly differentiate between teaching and preaching.",
                    "label": 0
                },
                {
                    "sent": "If there should be level institutions, we should not preach.",
                    "label": 0
                },
                {
                    "sent": "There is a role for preaching.",
                    "label": 0
                },
                {
                    "sent": "In all this climate change solutions.",
                    "label": 0
                },
                {
                    "sent": "We have to be given we have to win flexibility and freedom to change.",
                    "label": 0
                },
                {
                    "sent": "The Bologna process, at least in this country, has led through a process of accreditation of University programs and degrees.",
                    "label": 0
                },
                {
                    "sent": "You submit the application.",
                    "label": 0
                },
                {
                    "sent": "The Accreditation Committee says, yeah, you don't have enough chemistry.",
                    "label": 0
                },
                {
                    "sent": "You don't have enough this you don't have enough that you repackage it in order to pass.",
                    "label": 0
                },
                {
                    "sent": "And on the end of the day, you get the Hodge.",
                    "label": 0
                },
                {
                    "sent": "Omesh things that they're not really appropriate.",
                    "label": 0
                },
                {
                    "sent": "That they don't meet the requirements we ended up ourselves with the program that gets 4 courses in chemistry at undergraduate level and not the one on climate change or aspects of climate change over there.",
                    "label": 0
                },
                {
                    "sent": "So we need that flexibility and freedom to change.",
                    "label": 1
                },
                {
                    "sent": "The administrative procedures are not geared to that.",
                    "label": 0
                },
                {
                    "sent": "Institutional settings are not geared to death.",
                    "label": 1
                },
                {
                    "sent": "We have to overcome those selfish disciplinary interests.",
                    "label": 0
                },
                {
                    "sent": "If you don't have a critical mass.",
                    "label": 0
                },
                {
                    "sent": "Yeah, no preachers.",
                    "label": 0
                },
                {
                    "sent": "You don't know how to convince people.",
                    "label": 0
                },
                {
                    "sent": "We need to learn more and is better, Shore said.",
                    "label": 0
                },
                {
                    "sent": "Is we tend to think that we completed the communication that we accomplished the results, but in more often than not.",
                    "label": 0
                },
                {
                    "sent": "That's an illusion.",
                    "label": 0
                },
                {
                    "sent": "When you get the student at the exam.",
                    "label": 0
                },
                {
                    "sent": "He's fails, don't always blame the student.",
                    "label": 0
                },
                {
                    "sent": "It may be our fault.",
                    "label": 0
                },
                {
                    "sent": "If you haven't managed to transfer the necessary knowledge and commitment.",
                    "label": 0
                },
                {
                    "sent": "And across the board, in all the departments in all the schools that they should have in each to teach the foundations of sighting of sustainability of climate change, some fundamentals that's changing the mindset.",
                    "label": 0
                },
                {
                    "sent": "The courses listed here are irrelevant.",
                    "label": 0
                },
                {
                    "sent": "You can do it in many different ways.",
                    "label": 0
                },
                {
                    "sent": "This is out.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Masters program would be happy.",
                    "label": 0
                },
                {
                    "sent": "But in each to teach.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Fundamentals amini things that will change their mindsets the way they look at life, the way they look for Commerce, the way they look at the economy.",
                    "label": 0
                },
                {
                    "sent": "And everything else.",
                    "label": 0
                },
                {
                    "sent": "And we.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also meet these people.",
                    "label": 0
                },
                {
                    "sent": "How to make a business case out of this climate change business?",
                    "label": 0
                },
                {
                    "sent": "If there is no benefit, that's tangible.",
                    "label": 0
                },
                {
                    "sent": "I don't think we stand a chance and finally change is a big business.",
                    "label": 0
                },
                {
                    "sent": "And there is money to be made out of it.",
                    "label": 0
                },
                {
                    "sent": "And those that are at the forefront of the activity are already making money off of it.",
                    "label": 0
                },
                {
                    "sent": "And we're here.",
                    "label": 0
                },
                {
                    "sent": "Because we want to start the project, we want to get some money to do something, so we're in the same business.",
                    "label": 0
                },
                {
                    "sent": "We're not making profit that you're making money.",
                    "label": 0
                },
                {
                    "sent": "OK. And those are the fundamentals that need to prove that it really is.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is really is very very simple.",
                    "label": 0
                },
                {
                    "sent": "He is a society, individuals, corporations, institutions spend money on two things.",
                    "label": 1
                },
                {
                    "sent": "We buy energy materials.",
                    "label": 0
                },
                {
                    "sent": "And we only take to make two things.",
                    "label": 1
                },
                {
                    "sent": "It only took we make product and I'm not brother.",
                    "label": 0
                },
                {
                    "sent": "We do this because we want to create value for our family for ourselves, for our customers, for shareholders.",
                    "label": 1
                },
                {
                    "sent": "The question is why do we spend money on inputs?",
                    "label": 1
                },
                {
                    "sent": "To create CO2 as output that we don't need.",
                    "label": 1
                },
                {
                    "sent": "Why do we spend money on input?",
                    "label": 0
                },
                {
                    "sent": "To throw it away down the chimney.",
                    "label": 0
                },
                {
                    "sent": "CO2 is carbon.",
                    "label": 0
                },
                {
                    "sent": "Carbon is the main source of our fuels.",
                    "label": 0
                },
                {
                    "sent": "The damage carry there must be a better way to deal with it.",
                    "label": 0
                },
                {
                    "sent": "Check.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any conclusion?",
                    "label": 0
                },
                {
                    "sent": "I think we need to plant the seeds first.",
                    "label": 0
                },
                {
                    "sent": "And that's what we been trying to do for many years.",
                    "label": 0
                },
                {
                    "sent": "Through the IPC.",
                    "label": 0
                },
                {
                    "sent": "We're planting the seeds Sciences behind there.",
                    "label": 0
                },
                {
                    "sent": "And the roots have begin to grow and the three slowly developing.",
                    "label": 0
                },
                {
                    "sent": "That's when you plant the seed.",
                    "label": 0
                },
                {
                    "sent": "You need to fertilize it.",
                    "label": 0
                },
                {
                    "sent": "You need to water it.",
                    "label": 0
                },
                {
                    "sent": "You need to nurture it.",
                    "label": 0
                },
                {
                    "sent": "You need to get a pass out.",
                    "label": 0
                },
                {
                    "sent": "If you're going to pick the fruit.",
                    "label": 0
                },
                {
                    "sent": "And I don't think we're doing enough of this nurturing watering.",
                    "label": 0
                },
                {
                    "sent": "And everything else.",
                    "label": 0
                },
                {
                    "sent": "So the fruit is not there yet.",
                    "label": 0
                },
                {
                    "sent": "The tree is growing, but the fruit is not there yet.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a long way to go.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much professor.",
                    "label": 0
                },
                {
                    "sent": "My Android for this inspiring presentations.",
                    "label": 0
                },
                {
                    "sent": "Are there any questions, comments please?",
                    "label": 0
                },
                {
                    "sent": "Thank you first of all, I would like to thank Professor my on which this was really an into an interesting presentation and it seems that we have two different sets of opinions about teaching climate change.",
                    "label": 0
                },
                {
                    "sent": "One is what Lucas said yesterday and today and the other one is what professor may I know which is saying and I must say I agree with both.",
                    "label": 0
                },
                {
                    "sent": "I learned from Luedtke that we definitely need.",
                    "label": 0
                },
                {
                    "sent": "Climate change scientists from physics and chemistry point of view, but as one of the teachers who is teaching sustainable development, I really, strongly agree with Professor my on which, and I think that everyone.",
                    "label": 0
                },
                {
                    "sent": "In every school on all the levels that you have mentioned should learn about climate change in some way that is comprehensible for that level.",
                    "label": 0
                },
                {
                    "sent": "So I think we we don't have to actually two opinions.",
                    "label": 0
                },
                {
                    "sent": "We have one synergic opinion and I think we should both have high high level research and science and.",
                    "label": 0
                },
                {
                    "sent": "Strong bases for teaching climate change at.",
                    "label": 0
                },
                {
                    "sent": "All available institutions and an even even further out of education.",
                    "label": 0
                },
                {
                    "sent": "We have to educate business as you said and and we have to educate people that we are in contact with.",
                    "label": 0
                },
                {
                    "sent": "If we are teachers.",
                    "label": 0
                },
                {
                    "sent": "And I do agree.",
                    "label": 0
                },
                {
                    "sent": "We need strong commitment.",
                    "label": 0
                },
                {
                    "sent": "About what we teach, what you called preaching.",
                    "label": 0
                },
                {
                    "sent": "But let's maybe we should phrase it, not just let not preach, just let make it as.",
                    "label": 0
                },
                {
                    "sent": "Maybe a mindset or a cultivating cultivating the mind.",
                    "label": 0
                },
                {
                    "sent": "Which is, uh, some definition of culture.",
                    "label": 0
                },
                {
                    "sent": "To get.",
                    "label": 0
                },
                {
                    "sent": "Young children to think the way we think they should be going in the right direction about sustainability.",
                    "label": 0
                },
                {
                    "sent": "Think I'm not going to comment about teaching or preaching.",
                    "label": 0
                },
                {
                    "sent": "I think it's semantics is the warning you use.",
                    "label": 0
                },
                {
                    "sent": "I don't think it's is that important, but what's important is there are different different aspects of aggressive one group versus target group versus the others you know.",
                    "label": 0
                },
                {
                    "sent": "We listen to the preachers all the time, from the politics to the priest, it doesn't matter.",
                    "label": 0
                },
                {
                    "sent": "We all have all those things have to role to play and I agree with you, I don't think we're disagreeing.",
                    "label": 0
                },
                {
                    "sent": "I'm just that I saw my role here.",
                    "label": 0
                },
                {
                    "sent": "Is generating some critical thinking and.",
                    "label": 0
                },
                {
                    "sent": "Thank you come to something that will be beneficial to the region and the people in the region trying to pull the resources which are limited.",
                    "label": 0
                },
                {
                    "sent": "The few people people are limited and see how can we maximize the impact we as a group.",
                    "label": 0
                },
                {
                    "sent": "Involved in teaching climate change can maximize our impact to get get there, but we all know is is needed to get.",
                    "label": 0
                },
                {
                    "sent": "So I got that there was no intention to create it.",
                    "label": 0
                },
                {
                    "sent": "I agree with him.",
                    "label": 0
                },
                {
                    "sent": "I mean is there is not to two schools of thinking but you know there there are.",
                    "label": 0
                },
                {
                    "sent": "Why I'm I'm talking about physics and mathematics all the time is when you when you saw that slide about how did you say science and economy and so on.",
                    "label": 0
                },
                {
                    "sent": "We must be aware of the processes that took place in our education system for the last 20 or 30 years.",
                    "label": 0
                },
                {
                    "sent": "It used to be.",
                    "label": 0
                },
                {
                    "sent": "That science was OK, so there was a curriculum in mathematics in physics in James, in the primary level, but no longer.",
                    "label": 0
                },
                {
                    "sent": "These can change dramatically, because all these hours have shrink, and so nowadays you get with Matura student who doesn't know as much more than a matics as much as physics as much as chemistry as we did in our times.",
                    "label": 0
                },
                {
                    "sent": "So this is the first problem, and the science is not necessarily there.",
                    "label": 0
                },
                {
                    "sent": "The second problem is look at the the background education of policymakers.",
                    "label": 0
                },
                {
                    "sent": "How many engineers are there?",
                    "label": 0
                },
                {
                    "sent": "Very few economists lawyers, so actually with we used to say, well, they got their primary education fine, so they know the physics chemistry up to matura level no longer.",
                    "label": 0
                },
                {
                    "sent": "And then they study below.",
                    "label": 0
                },
                {
                    "sent": "Then this study economy and then they make decision about climate change about giga Watts.",
                    "label": 0
                },
                {
                    "sent": "About energy.",
                    "label": 0
                },
                {
                    "sent": "They don't have a clue what PPM is.",
                    "label": 0
                },
                {
                    "sent": "The National Assembly.",
                    "label": 0
                },
                {
                    "sent": "I've been there I've talked to them and they did.",
                    "label": 0
                },
                {
                    "sent": "They don't say that in front of the microphone, but back then with coffee.",
                    "label": 0
                },
                {
                    "sent": "Actually, they don't know what we were saying, so science is not OK. You cannot say you say do everything is fine, it is not longer being told that way and also in the Western world the majority of students switched all of the natural science.",
                    "label": 0
                },
                {
                    "sent": "And you know this is a problem with this with Lisbon Strategy to pull again people in the field of natural science that this is what was my point, not about.",
                    "label": 0
                },
                {
                    "sent": "I totally agree with it.",
                    "label": 0
                },
                {
                    "sent": "But you know what actually bothers me a lot is.",
                    "label": 0
                },
                {
                    "sent": "Using climate change for promoting some goals and you know to teach sustainable living, you don't have to teach climate change at all because it's it's about consumption.",
                    "label": 0
                },
                {
                    "sent": "It's about poverty, so please don't use climate change for that reason, and also in the business using climate changes for greenwashing.",
                    "label": 0
                },
                {
                    "sent": "Come on, let's not wait and the my last point is again to the education system.",
                    "label": 0
                },
                {
                    "sent": "Years ago century ago.",
                    "label": 0
                },
                {
                    "sent": "You know, I believe that Gaussian distribution still is valid.",
                    "label": 0
                },
                {
                    "sent": "We have very few smart people.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of average people and a few very dumb.",
                    "label": 0
                },
                {
                    "sent": "But today everybody has to study and a lot of schools have changed.",
                    "label": 0
                },
                {
                    "sent": "The criteria is because we are paid per per per student head.",
                    "label": 0
                },
                {
                    "sent": "So we enroll everybody and the bonus system forced us that we will be financed by diploma.",
                    "label": 0
                },
                {
                    "sent": "So if we want University to leave, we have to give diploma to.",
                    "label": 0
                },
                {
                    "sent": "Those who are not always necessarily able to provide the knowledge.",
                    "label": 0
                },
                {
                    "sent": "This is the truth, and in this part of the world this was especially true.",
                    "label": 0
                },
                {
                    "sent": "And you know, I am actually now speaking into my own Cup.",
                    "label": 0
                },
                {
                    "sent": "But I mean, this is all interconnected and that's why I'm emphasizing physics, natural science so much.",
                    "label": 0
                },
                {
                    "sent": "'cause to to to make good decisions?",
                    "label": 0
                },
                {
                    "sent": "You have to have this balance.",
                    "label": 0
                },
                {
                    "sent": "Balance just said.",
                    "label": 0
                },
                {
                    "sent": "I agree, of course, but I just said that practice you told me previously that we're pretty late and it is now fashionable.",
                    "label": 0
                },
                {
                    "sent": "To use climate change for a lot of things, and they found some cool terms of references for some project.",
                    "label": 0
                },
                {
                    "sent": "I was looking yesterday and there were two qualification there looking climate change.",
                    "label": 0
                },
                {
                    "sent": "Economists and climate change environmentalists.",
                    "label": 0
                },
                {
                    "sent": "I just I'm just.",
                    "label": 0
                },
                {
                    "sent": "This is a practice and they don't know what the person should be.",
                    "label": 0
                },
                {
                    "sent": "Any idea and this is what is going on.",
                    "label": 0
                },
                {
                    "sent": "It is now fashionable.",
                    "label": 0
                },
                {
                    "sent": "OK, I could come with such a climate change economists, but kind of change environmentalists.",
                    "label": 0
                },
                {
                    "sent": "I just don't have any idea.",
                    "label": 0
                },
                {
                    "sent": "And this is the point.",
                    "label": 0
                },
                {
                    "sent": "This is very good that we have this, but this is the last moment the practice is already have some moments then in front of us.",
                    "label": 0
                },
                {
                    "sent": "This is exactly the basic question.",
                    "label": 0
                },
                {
                    "sent": "What is the difference between climate change economists and climate change environmentalists?",
                    "label": 0
                },
                {
                    "sent": "If we're professors here, I don't know if anybody has a clue what is.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "It's an economist with the trend in climate change.",
                    "label": 0
                },
                {
                    "sent": "Yes, yeah, they have at the end or relevant experience.",
                    "label": 0
                },
                {
                    "sent": "It is a request is natural science economy or relevant experience.",
                    "label": 0
                },
                {
                    "sent": "There's one thing I have, you know.",
                    "label": 0
                },
                {
                    "sent": "I used to travel a lot and people at the Belgrade customs at the airport.",
                    "label": 0
                },
                {
                    "sent": "Police managed to at some time remember my face.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "And once I came in, there was a guy who has seen me 5 six times ago I came to the passport desk and say hi morning.",
                    "label": 0
                },
                {
                    "sent": "And he says your passport is who are you?",
                    "label": 0
                },
                {
                    "sent": "I said no.",
                    "label": 0
                },
                {
                    "sent": "My father comes from a village of so and so is the famous family.",
                    "label": 0
                },
                {
                    "sent": "I'm his son.",
                    "label": 0
                },
                {
                    "sent": "You know me?",
                    "label": 0
                },
                {
                    "sent": "What are you playing?",
                    "label": 0
                },
                {
                    "sent": "He said my give me your passport.",
                    "label": 0
                },
                {
                    "sent": "I don't care who you are so I give him my ideal passport.",
                    "label": 0
                },
                {
                    "sent": "He likes it and let you bro.",
                    "label": 0
                },
                {
                    "sent": "And you suddenly realize that it doesn't matter who you really are.",
                    "label": 0
                },
                {
                    "sent": "What matters is what the paper says you are.",
                    "label": 0
                },
                {
                    "sent": "And the same happens when you go to hotel.",
                    "label": 0
                },
                {
                    "sent": "They ask how you going to base there.",
                    "label": 0
                },
                {
                    "sent": "From playing and there is George, so give me your credit card.",
                    "label": 0
                },
                {
                    "sent": "This tells them who I am or how much money I have.",
                    "label": 0
                },
                {
                    "sent": "They don't care who you are as a person.",
                    "label": 0
                },
                {
                    "sent": "So if the paper says environmental or climate change economists that works what you know it doesn't.",
                    "label": 0
                },
                {
                    "sent": "I will start for the end.",
                    "label": 0
                },
                {
                    "sent": "I also disagree with you because I just remember few years ago we tried to establish one you project and it was basically climate change project but we have we need somebody to deal with social economic aspects.",
                    "label": 0
                },
                {
                    "sent": "Of climate change and we find few people with some reference.",
                    "label": 0
                },
                {
                    "sent": "Some papers as you said.",
                    "label": 0
                },
                {
                    "sent": "But when I told them what we expect, what kind of analysis calculations impact studies, I mean numbers and results.",
                    "label": 0
                },
                {
                    "sent": "They said that they are really not sure that they can do this so we can have paper, but you couldn't get money from the project if behind.",
                    "label": 0
                },
                {
                    "sent": "This paper is not knowledge, I'm absolutely sure about this that maybe once.",
                    "label": 0
                },
                {
                    "sent": "Maybe once.",
                    "label": 0
                },
                {
                    "sent": "You could cheat somebody, but you know everybody knows after that that you do this, but you was not effective on this project and nobody will invite you again.",
                    "label": 0
                },
                {
                    "sent": "I have that experience with some people, but they would like just to add some sentences with this.",
                    "label": 0
                },
                {
                    "sent": "With Luedtke said, I think that when we are teaching climate change, faculty or floor economics or agriculture have that kind of experience.",
                    "label": 0
                },
                {
                    "sent": "We have to put some science in this.",
                    "label": 0
                },
                {
                    "sent": "I mean, adaptation is not enough, but question is how we teach science.",
                    "label": 0
                },
                {
                    "sent": "I'm physicist, I know that when I start to talk from completely physically based my lectures to students of every culture, first year of agriculture now they came from different very different backgrounds but they do not study agriculture because they love mathematics, physics, things like this.",
                    "label": 0
                },
                {
                    "sent": "If I write any equation on this blackboard, I just can find this view.",
                    "label": 0
                },
                {
                    "sent": "We cause some somewhere else.",
                    "label": 0
                },
                {
                    "sent": "You know they do not.",
                    "label": 0
                },
                {
                    "sent": "Yes, I lose them completely.",
                    "label": 0
                },
                {
                    "sent": "So I think that we have to teach climate change on that kind of faculties completely on final logical way.",
                    "label": 0
                },
                {
                    "sent": "And that's the way because some science have to be put on this curricula, of course, but with very, very strong impact studies.",
                    "label": 0
                },
                {
                    "sent": "And we need bank people in economy, banking, stock market, which knows something about climate change.",
                    "label": 0
                },
                {
                    "sent": "I mean how somebody who's.",
                    "label": 0
                },
                {
                    "sent": "Studying economy can make assessment of climate change, impact of trading or stock market and prices if he do not know what kind of exchange environment he can expect.",
                    "label": 0
                },
                {
                    "sent": "So I think that's very, very important.",
                    "label": 0
                },
                {
                    "sent": "And this Vienna Venice.",
                    "label": 0
                },
                {
                    "sent": "Studying Gandak doctoral level is great one, but I'm afraid one thing if we organize that only at first sight on the doctoral level, we have to wait at least four years.",
                    "label": 0
                },
                {
                    "sent": "Did somebody finish this doctoral studies to finish PTTS?",
                    "label": 0
                },
                {
                    "sent": "Then we have to wait at least three or four years that this person start to teach something about climate change at University, and after that we need, for example, next three or four or five years to have first experts on Bachelor level which are teached by somebody who finished this climate change study.",
                    "label": 0
                },
                {
                    "sent": "So for example we have 10 or 15 years between.",
                    "label": 0
                },
                {
                    "sent": "Now and 1st Battle students which have that kind of knowledge and experience.",
                    "label": 0
                },
                {
                    "sent": "So I think that we of course have to participate in that kind of doctoral studies.",
                    "label": 0
                },
                {
                    "sent": "But we have to introduce climate change in all curicculum on all faculties.",
                    "label": 0
                },
                {
                    "sent": "Question is only how it's very difficult, and I believe I believe on interactive studies.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's one way.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "There is a lot of recording.",
                    "label": 0
                },
                {
                    "sent": "Recorded the lessons on YouTube on Internet.",
                    "label": 0
                },
                {
                    "sent": "Maybe we can organize something like this to to establish for license on certain topics to merge all of them for faculty of Flow for Faculty of Economix, for Faculty of Agriculture, whatever, and then share that kind of material.",
                    "label": 0
                },
                {
                    "sent": "I think that in southeastern Europe we can collect 20 or 30 or 50 people, which are really, really experts in some area of of climate change impact studies.",
                    "label": 0
                },
                {
                    "sent": "I think that when we are speaking about scientific base, it will be a little bit easier to find paper.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "I have that kind of impression, maybe because I'm from this field, but impact studies in social scientists in medicine and economics.",
                    "label": 0
                },
                {
                    "sent": "I think it will be.",
                    "label": 0
                },
                {
                    "sent": "Really, really difficult to find people.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "OK, I got it.",
                    "label": 0
                },
                {
                    "sent": "Mr Doug was faster.",
                    "label": 0
                },
                {
                    "sent": "In cards we have since eight years and interdisciplinary environmental system science study.",
                    "label": 0
                },
                {
                    "sent": "It integrates several disciplines, chemistry, physics, economy and the aim was to create an understanding of the Inter relationships.",
                    "label": 0
                },
                {
                    "sent": "But it didn't work because because the teachers professors have no experience in system science in understanding the interrelationships themselves.",
                    "label": 0
                },
                {
                    "sent": "So I think we have to educate the teachers we have to educate the professors in teaching in understanding the interdependencies.",
                    "label": 0
                },
                {
                    "sent": "Yeah, teaching the educators first, yes.",
                    "label": 0
                },
                {
                    "sent": "Systems level approach I think is missing right across the border.",
                    "label": 0
                },
                {
                    "sent": "By the way, I am climate economists.",
                    "label": 0
                },
                {
                    "sent": "If anybody, if anybody, wants to meet the climate economists.",
                    "label": 0
                },
                {
                    "sent": "It works for you.",
                    "label": 0
                },
                {
                    "sent": "Just a touch.",
                    "label": 0
                },
                {
                    "sent": "Just giving a comment that and a little bit jealous to people who are from physics or simple natural science.",
                    "label": 0
                },
                {
                    "sent": "My background is chemical engineering thermodynamics, but I'm not working dead for about 20 years and.",
                    "label": 0
                },
                {
                    "sent": "I'm having the problems for about 20 years.",
                    "label": 0
                },
                {
                    "sent": "What is environmental science in the region?",
                    "label": 0
                },
                {
                    "sent": "Because they put us.",
                    "label": 0
                },
                {
                    "sent": "In the Rose are are you natural science environment is natural science.",
                    "label": 0
                },
                {
                    "sent": "Environmental engineering is engineering science and I'm having the same role of think the battle for decade like we are now talking about climate change because I'm not.",
                    "label": 0
                },
                {
                    "sent": "I would like to be physics or chemists and but I'm not and this is always with this interdisciplinary issue.",
                    "label": 0
                },
                {
                    "sent": "We're always having the problem.",
                    "label": 0
                },
                {
                    "sent": "What we?",
                    "label": 0
                },
                {
                    "sent": "What are the competences for us?",
                    "label": 0
                },
                {
                    "sent": "What it is very difficult to to to reach any consensus.",
                    "label": 0
                },
                {
                    "sent": "You know, medical doctors are teaching a lot of environmental issues and they just.",
                    "label": 0
                },
                {
                    "sent": "We have a lot of problems in my life with medical doctors teaching environmental impact assessment, but this is now we're starting by climate change.",
                    "label": 0
                },
                {
                    "sent": "It is really.",
                    "label": 0
                },
                {
                    "sent": "We don't have the the the language between different Sciences to understand each other.",
                    "label": 0
                },
                {
                    "sent": "It is not issue that I know everything.",
                    "label": 0
                },
                {
                    "sent": "It is the issue to know what you know and you know who else knows.",
                    "label": 0
                },
                {
                    "sent": "Yes and this is I just would like to.",
                    "label": 0
                },
                {
                    "sent": "Like that you know that's easy for you.",
                    "label": 0
                },
                {
                    "sent": "Science for our science.",
                    "label": 0
                },
                {
                    "sent": "It's not easy.",
                    "label": 0
                },
                {
                    "sent": "It's not easy.",
                    "label": 0
                },
                {
                    "sent": "We are now preparing for this new round of research projects for MNIST recall and we are trying to figure out where we are.",
                    "label": 0
                },
                {
                    "sent": "Becausw ecologiste biologist.",
                    "label": 0
                },
                {
                    "sent": "You know this is is.",
                    "label": 0
                },
                {
                    "sent": "Yes, this is a something that just to add his account.",
                    "label": 0
                },
                {
                    "sent": "I will try to be brief in my PhD paper is written political geographer, but I'm a strange breed, which makes me very happy indeed.",
                    "label": 0
                },
                {
                    "sent": "An talking about passport.",
                    "label": 0
                },
                {
                    "sent": "My Italian passport was much better than my UN passport, at least in this region.",
                    "label": 0
                },
                {
                    "sent": "So sometimes I also have some crisis of identity and listening to you is it's bringing me back to my.",
                    "label": 0
                },
                {
                    "sent": "Ask a context where we have this so called scientific meeting where we invite scientists from different disciplines to tell us what we better should do and the discussion is always getting lossed in defining what is science and what is not.",
                    "label": 0
                },
                {
                    "sent": "What is serious science in what is not serious.",
                    "label": 0
                },
                {
                    "sent": "So this summary assembled to me with all the respect.",
                    "label": 0
                },
                {
                    "sent": "So without repeating what I said yesterday, I think a very good contribution before we got totally lost with this ship somewhere.",
                    "label": 0
                },
                {
                    "sent": "And then the breaker will tell you joke.",
                    "label": 0
                },
                {
                    "sent": "At night, certain contribution of this critical mass of beautiful minds as you are would be to try to put down at the end of today something that looks like a rational and possibly tentative program.",
                    "label": 0
                },
                {
                    "sent": "A concrete proposal that we could really use in the decade to advance when I say to advance, I mean I respect the plurality of Sciences as a respect the plurality of other human expressions.",
                    "label": 0
                },
                {
                    "sent": "With all the difficult this implies of course, and climate change is one of these big discourses as it was the one on sustainable development where at different opinions can be accommodated.",
                    "label": 0
                },
                {
                    "sent": "And I'd like to see them all equally legitimate.",
                    "label": 0
                },
                {
                    "sent": "Then we can discuss how to advance what I don't see at all is a scientific approach in place, and that's what I'm expecting from scientists.",
                    "label": 0
                },
                {
                    "sent": "Can we try to measure?",
                    "label": 0
                },
                {
                    "sent": "At the best extent possible, what we're talking about.",
                    "label": 0
                },
                {
                    "sent": "I mean, if he created an interdisciplinary project, the doctoral undergrad doesn't really matter.",
                    "label": 0
                },
                {
                    "sent": "Can we try to measure what's happening?",
                    "label": 0
                },
                {
                    "sent": "People's brain at the end of the process, because that's what we need.",
                    "label": 0
                },
                {
                    "sent": "Otherwise we can be really lost in the epistemological confrontation, which is good once in awhile.",
                    "label": 0
                },
                {
                    "sent": "I always recommend people to have this brainstorming, maybe to end up in Cabana, but then we have to try what I did in the two years project.",
                    "label": 0
                },
                {
                    "sent": "Devoted to education for sustainable development was in this region and I'm happy to share with you.",
                    "label": 0
                },
                {
                    "sent": "The results was to hire an expert in learning process.",
                    "label": 0
                },
                {
                    "sent": "I said don't need an expert in climate change.",
                    "label": 0
                },
                {
                    "sent": "I don't need an expert in biology.",
                    "label": 0
                },
                {
                    "sent": "I need an expert in learning process and with these gentlemen we measure what was happening in people's mind when we organize summer school for students of different disciplines, for example, or for students of different countries.",
                    "label": 0
                },
                {
                    "sent": "In other way, those hypothesis has to be tested.",
                    "label": 0
                },
                {
                    "sent": "Is this really working in terms of regional integration to put Bosnian student together with Serbian student together we creation so it doesn't work or not what's happening in their minds?",
                    "label": 0
                },
                {
                    "sent": "Is it really OK to have different disciplines attacking one case study and dismantling what's happening in their brain etc etc.",
                    "label": 0
                },
                {
                    "sent": "And we ended up with a project on teaching the teachers as we like to color and the manual is available free of charge.",
                    "label": 0
                },
                {
                    "sent": "Find the website of the Sun Devil Right Center, because that's how you have to get started.",
                    "label": 0
                },
                {
                    "sent": "So a system approach is not something that you invent if you don't have it in your mind and you have to cultivate it as many other approaches.",
                    "label": 0
                },
                {
                    "sent": "So we ended up with that.",
                    "label": 0
                },
                {
                    "sent": "Maybe we should have started with it anyway.",
                    "label": 0
                },
                {
                    "sent": "It's part of the experimentation so conclusion, help me to help you.",
                    "label": 0
                },
                {
                    "sent": "I mean from the UNESCO POV and try, let's be scientifically approached.",
                    "label": 0
                },
                {
                    "sent": "I mean, let's try to put down something to test some of these hypothesis and then we all give you an excellent contribution to the advancement of this.",
                    "label": 0
                },
                {
                    "sent": "Doesn't matter if it's applied to climate change, I hope it's clear.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, Roger.",
                    "label": 0
                },
                {
                    "sent": "Do we have volunteers who would help in such an endeavor to put something together?",
                    "label": 0
                },
                {
                    "sent": "Good great.",
                    "label": 0
                },
                {
                    "sent": "Very good somebody's also.",
                    "label": 0
                },
                {
                    "sent": "That would be good.",
                    "label": 0
                },
                {
                    "sent": "So we will try to come together then perhaps.",
                    "label": 0
                },
                {
                    "sent": "After the closing of the conference, also sit together for some 1015 minutes trying to put something together.",
                    "label": 0
                }
            ]
        }
    }
}