{
    "id": "tz4n6wt357e65dfyasulhn6uqjb23gy4",
    "title": "Growing a Tree in the Forest: Constructing Folksonomies by Integrating Structured Metadata",
    "info": {
        "author": [
            "Anon Plangprasopchok, Information Sciences Institute (ISI), University of Southern California"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Artificial Intelligence"
        ]
    },
    "url": "http://videolectures.net/kdd2010_plangprasopchok_gtf/",
    "segmentation": [
        [
            "So today is that I work with Christina Luminale ski tour.",
            "Anne."
        ],
        [
            "And so OK, there is an explosion of the user generated content on the web recently.",
            "For example images, video, Maps and so on.",
            "And this content also comes with user generated semantics in terms of annotation and meter data an the type of this kind of annotation.",
            "For example, we have unstructured metadata, such attacks and Geo tags and we have more structure one like personal hierarchies.",
            "An over long term goal is to try to from this meta data we want to infer user knowledge or what we call folk knowledge."
        ],
        [
            "So in this work we are focusing on the foreknowledge in terms of the three.",
            "So basically we assume that you still have a categorisation scheme in terms of the tree like this an when the user.",
            "I know that a certain content they pick up our share of the tree and then what we offer is just a partial of the tree Ann and what we also is just a personal hierarchy which is kind of like shallow, noisy, sparse and inconsistent.",
            "So what we want to do is to from this observation we want to infer it back.",
            "And we call this process as forcing me learning."
        ],
        [
            "So before I go our approach, I would like to explain a little bit more about the personal hierarchies in social web.",
            "So I'm going to take the personal hierarchies from Flickr, and I'm going to use it also as a evaluation."
        ],
        [
            "So in Flickr basically user can post the photo and they can put wires kind of metadata and well known form of the metadata is the tax and also user can also group similar photos together into the folder and group similar folder together into the Super folder.",
            "And this is a form of the Channel 3 on the right an where each node represent.",
            "In the photo.",
            "And the name of the further also the name of the note and the link between the note is the hierarchical relation between the photos.",
            "So the idea is we want to integrate, learn the forcing me from this kind of hierarchies."
        ],
        [
            "And before we go to the approach, I would like to explain a little bit about the challenges for the first enemy learning.",
            "So basically we are going to have the problem with the sparseness.",
            "So in general we found that in our data set there are a lot of the hierarchy personal hierarchy that contain only like two or three students, so we just can rely on the few hierarchies and there is no single unified structure that represent the rest.",
            "Of the hierarchy and the next one is of course, the ambiguity, so we just can't rely on the name of the folder.",
            "For example, we are not going to merge Turkey and Turkey there because it's different concept has different meaning and the next one is there conflict.",
            "So basically the conflict appeared 'cause you still have different categories and scheme, so one user may start categorized in by using the activity 1st and then use the Geo information.",
            "But the other user may use the different way.",
            "He started with the other two location 1st and currently categorized specific aspect of within that location and the last one is a varying can reality.",
            "So this problem occur because user has different degree of expressiveness.",
            "So one user may start from categorized from UK to Scotland and Scotland to Glasgow.",
            "Meanwhile the other user jump from UK to Glasgow.",
            "So we need to approach that.",
            "Take into account these challenges."
        ],
        [
            "So our idea is quite simple.",
            "So basically, since we want to from the Middle East shallow hierarchy, we want to learn the deep hierarchy.",
            "So basically we simply aggregate the hierarchies together in the horizontal and vertical direction.",
            "So by hierarchical direction I mean we collapse the node that has the same row.",
            "So here we merge the route to route so much the root root and would leave to live is going to expand.",
            "The bread of the tree.",
            "The width of the tree.",
            "Meanwhile, we also do in the other direction, the water coloration.",
            "If we do so, we're going to spend the depth of the tree."
        ],
        [
            "And the second idea is that.",
            "In order to consider whether we're going to merge in or not, so we need some to make some decision so the recent can be based on the contextual information.",
            "For example, in the future that attached to the node and we also use the relational information such as the neighbor of the node."
        ],
        [
            "And that can be formulated into the similarity function in relational clustering.",
            "So basically the similarity function is going to be composed from two part one is from the local similarity and the other from the structure of similarity, which is based on the neighbor and basically the similarity is just a linear combination between these two parts.",
            "And we just going to decide to merge the node if the two nodes are similar enough."
        ],
        [
            "So now we already define the similarity function to decide whether we should merge or split the hierarchies and now we present the incremental approach.",
            "Which is based on such similarity function.",
            "So basically we assume that user or also specify the C term.",
            "That is going to be the root of the hierarchy, so we start from the feet.",
            "For example.",
            "In this case we have Canada and then we just simply use the Canada to opt in the personal hierarchy that has their root name as Canada.",
            "And then we're going to use the same dissimilarity function that I presented earlier.",
            "To combine them to be to get the broader hierarchy.",
            "Meanwhile, when we merge them together, we also collapse.",
            "I mean, we also accurate the static on the tech distribution and the number of users who specifies such node.",
            "And then we can use that information to remove some noisy node and in this case which we simply use and known as specified by very few users.",
            "And the next.",
            "We're going to pick one of the students and then.",
            "Use the term for example.",
            "Here we use Victoria and then we use this term to grab.",
            "To grab more personal hierarchies that name by Victoria and we do the same.",
            "And we're going to get the we're going to get the cluster of the Victoria and then we pick the Victoria that similar enough to that Victoria.",
            "And we do this on a dog and so on so we can keep extending the breadth and depth of the tree.",
            "Meanwhile, when we attach.",
            "The Victoria to the victory up top.",
            "We have to remove some structural inconsistency that I'm going to explain next."
        ],
        [
            "So basically suppose that we have following the following hierarchies and we want to merge them together.",
            "If we simply merge them.",
            "We're going to have the shortcut from UK to London so that account is the happen because you have the several path from one note to the other.",
            "So since we want to get the tree not there, I will try to graph.",
            "So basically what we do is in following strategy.",
            "We basically under the UK.",
            "We basically measure the similarity between England and to the UK and London to the UK and we pick the one that is more similar to the other.",
            "And then we simply merge denote the England, because England is more similar to UK.",
            "So we start with the closer 1 first.",
            "And then we know that if it attached England to the hierarchy, we're going to get some shortcut and then over heuristic is that we keep the longer paths in it, capture more specific knowledge."
        ],
        [
            "And then finally the London is just attached to the right place."
        ],
        [
            "So now comes through the evaluation.",
            "So basically we picked the 32 C terms and use the personal hierarchies from the Flickr as in previous work, actually is our previous work at Dub Dub 09 and we use the three different methodology's one is we compare the learn hierarchy against the reference hierarchy.",
            "And we also measure how expressive of the learn hierarchy is, which I'm going to expand next.",
            "And the last one is for the part that cannot comperable to the reference hierarchy.",
            "I've just was just going to ask you, Sir.",
            "Weather is correct or not, and the best I approach is from our previous work as well.",
            "So basically in that world we assume that the node having the same name just refer to the same concept.",
            "And basically we use the statiscal test to measure whether the relation is noisy or not.",
            "So basically we assume that.",
            "If the relational noisy.",
            "It's kind of generated from some random process, so we use a statiscal test and we just going to remove the note that we consider it as noisy and then we combine them together into the single tree.",
            "So this is the best sign approach."
        ],
        [
            "And for each methodology I'm use different metrics.",
            "So basically the first metric is the taxonomic overlap which measure the correctness of the structure.",
            "So basically in this metric is considered the order of the node.",
            "But the next one is the metric measure the how well the approach can recover the concept comparison.",
            "Comparing to the reference hierarchy.",
            "And the next one is we would like to measure the expressiveness of the learn folksonomy.",
            "So basically we basically consider the Bush Ness and the deep then the depth of the tree.",
            "So basically we would like to have a single number that like take these two into account which I'm going to explain next.",
            "How to calculate that and the last one is as I mentioned we have to measure the for the part that cannot come parable to the reference Iraqi we just asked.",
            "You submitted the path from the root to the leave.",
            "If the whole part are correct.",
            "If some of them just have the order, we just mark, we just ask user to market as incorrect.",
            "So now I would like to explain a little bit more about over.",
            "Our metric on this."
        ],
        [
            "Operation, so basically we suppose that we have these different trees when we want to to say which one is the best in terms of expressiveness and deepness at in the single number.",
            "So basically what we do is we plot the distribution of the node at each depth.",
            "And The thing is.",
            "The three that keep spending at each level.",
            "You're going to get higher area under the distribution, so we use this number to roughly measure the expressiveness of the tree."
        ],
        [
            "So go back to the example.",
            "We have.",
            "the C has the highest, the value of the AUT.",
            "So now comes to the reef."
        ],
        [
            "Experimental results, so basically we use as I mentioned earlier, we use 32C terms and we let the approach Road 3 from 32 systems an basically rather than report here with the absolute number, I'm just like compare to approach and to say which approach is better than the other.",
            "I just counting the how many cases which one is better than the other and it's clearly that our approach outperforms the other in terms of the structure correctness.",
            "And the number of the term that can recover and in terms of the expressiveness, and Moreover our push.",
            "Is superior to the other in when we consider these three metrics at the same time.",
            "So basically we consider if the approach perform better in our metrics to the other."
        ],
        [
            "So now here is an example of the folks only that we learn, so this one is quite shallow.",
            "But it's according to the what users specify on the web.",
            "So this one is like the combination of several personal hierarchy like hundreds personal hierarchy and what interesting the interesting thing about this is the week and learns the fork knowledge.",
            "So basically for example we use are mostly know that Spider.",
            "Is insect, but actually it's not because Spider has a click.",
            "So, so this is the good thing about the folksonomy."
        ],
        [
            "And so it is the other example of the.",
            "Learn for tsunami.",
            "So basically people are good in the categorizing using the Geo information so we can learn quiet detail hierarchy."
        ],
        [
            "So our approach is to really went to many other words in terms for in the info hierarchy from the text data and text.",
            "So, but basically our effort is funded fundamentally different cause the relation between the term.",
            "I already specified by the user, but what we have to do is to since the relation can be inconsistent and noisy, we have to somewhere too late, align them together and correct the inconsistent an our approach.",
            "Our work is also similar to the ontology alignment, but in that setting we only have very few structure and consistent structure to a lie.",
            "But in our setting we have a bunch of.",
            "Shallow and noisy high rank structure to align and the last hour of course is similar to the.",
            "Some of the world that exploit users specify hierarchy, but that word is used.",
            "The hierarchy for recommendation."
        ],
        [
            "So finally our approach is can create more accurate and more detail for Sonam ES than the current state of the ASK approach.",
            "Since exploits structural information during the merging process and the person will is more scalable is incrementally growing their fossil mean rather than using the exhaustive search.",
            "So you can refer to the previous work in network, we use the exhaustive search to find the best path from one to the other.",
            "For the future work, we would like to separate the broader and narrower from related to religion or we would like to learn the facets and we also want to combine more source of evidence such as geospace geographical information as well as we would like to apply on different datasets.",
            "For example in the personal workspace or the personal folder or semantic network and that's it.",
            "I would like to take question.",
            "Find interesting work.",
            "I just have one question database.",
            "There are a lot of work about ontology, so how is work different from them?",
            "Or can you like educate us like what the new side you can gain from this folksonomies like different pathology integration, database field.",
            "So basically in our setting we have a bunch of what you guys call schema something like.",
            "That and basically our setting is quite different because the schema is quite it's generated by user and sometimes it's not complete and The thing is we just cannot rely on a few structure.",
            "But we have to collapse incrementally.",
            "Combine the compatible structure together and keep going and going to make effective more complete.",
            "But in India, for example, in ontology alignment, you have a bunch of.",
            "I mean the detailed structure, right?",
            "You can rely a lot more on the structure and you don't have to take into account some noisy data.",
            "Because.",
            "Just wondering, have you tried to compare any other method from that field?",
            "Yeah so so basically.",
            "No, a previous work we compare aware push against the.",
            "Assumption approach we infer the hierarchical relation by using the the frequency, and in that work we offer from the previous.",
            "Quite a lot, but I would like to like if you have more questions, I quite happy to like discuss with you offline.",
            "Yeah next week.",
            "So when you construct the hierarchy you seem to be using some different rules to expand the tree directions.",
            "So how do you determine the priority of different rules and database in order to avoid the confusion?",
            "Yeah, basically we we we based on we use to heuristics to consider next next node to be explore.",
            "One is the number of Reducer, the popular one is going to be explore first.",
            "But The thing is, when we combine, when we attach the hierarchy into the tree, since we have to correct the inconsistency, so we use the closeness to the to the ancestor node, the closer one for the cost of 1.",
            "We're going to consider attach that one first and then correct the inconsistent.",
            "But actually we are working on the approach that required, like incrementally one.",
            "But we are working on their porch that kind of like.",
            "Through the hierarchy at the same time, and then let everything aligned together with some concern.",
            "That the conflict will not happier at the final hierarchy.",
            "Alright, let's thank our speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So today is that I work with Christina Luminale ski tour.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so OK, there is an explosion of the user generated content on the web recently.",
                    "label": 1
                },
                {
                    "sent": "For example images, video, Maps and so on.",
                    "label": 0
                },
                {
                    "sent": "And this content also comes with user generated semantics in terms of annotation and meter data an the type of this kind of annotation.",
                    "label": 0
                },
                {
                    "sent": "For example, we have unstructured metadata, such attacks and Geo tags and we have more structure one like personal hierarchies.",
                    "label": 1
                },
                {
                    "sent": "An over long term goal is to try to from this meta data we want to infer user knowledge or what we call folk knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in this work we are focusing on the foreknowledge in terms of the three.",
                    "label": 0
                },
                {
                    "sent": "So basically we assume that you still have a categorisation scheme in terms of the tree like this an when the user.",
                    "label": 0
                },
                {
                    "sent": "I know that a certain content they pick up our share of the tree and then what we offer is just a partial of the tree Ann and what we also is just a personal hierarchy which is kind of like shallow, noisy, sparse and inconsistent.",
                    "label": 0
                },
                {
                    "sent": "So what we want to do is to from this observation we want to infer it back.",
                    "label": 0
                },
                {
                    "sent": "And we call this process as forcing me learning.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So before I go our approach, I would like to explain a little bit more about the personal hierarchies in social web.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to take the personal hierarchies from Flickr, and I'm going to use it also as a evaluation.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So in Flickr basically user can post the photo and they can put wires kind of metadata and well known form of the metadata is the tax and also user can also group similar photos together into the folder and group similar folder together into the Super folder.",
                    "label": 0
                },
                {
                    "sent": "And this is a form of the Channel 3 on the right an where each node represent.",
                    "label": 0
                },
                {
                    "sent": "In the photo.",
                    "label": 0
                },
                {
                    "sent": "And the name of the further also the name of the note and the link between the note is the hierarchical relation between the photos.",
                    "label": 0
                },
                {
                    "sent": "So the idea is we want to integrate, learn the forcing me from this kind of hierarchies.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And before we go to the approach, I would like to explain a little bit about the challenges for the first enemy learning.",
                    "label": 0
                },
                {
                    "sent": "So basically we are going to have the problem with the sparseness.",
                    "label": 0
                },
                {
                    "sent": "So in general we found that in our data set there are a lot of the hierarchy personal hierarchy that contain only like two or three students, so we just can rely on the few hierarchies and there is no single unified structure that represent the rest.",
                    "label": 0
                },
                {
                    "sent": "Of the hierarchy and the next one is of course, the ambiguity, so we just can't rely on the name of the folder.",
                    "label": 0
                },
                {
                    "sent": "For example, we are not going to merge Turkey and Turkey there because it's different concept has different meaning and the next one is there conflict.",
                    "label": 0
                },
                {
                    "sent": "So basically the conflict appeared 'cause you still have different categories and scheme, so one user may start categorized in by using the activity 1st and then use the Geo information.",
                    "label": 0
                },
                {
                    "sent": "But the other user may use the different way.",
                    "label": 0
                },
                {
                    "sent": "He started with the other two location 1st and currently categorized specific aspect of within that location and the last one is a varying can reality.",
                    "label": 0
                },
                {
                    "sent": "So this problem occur because user has different degree of expressiveness.",
                    "label": 0
                },
                {
                    "sent": "So one user may start from categorized from UK to Scotland and Scotland to Glasgow.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile the other user jump from UK to Glasgow.",
                    "label": 0
                },
                {
                    "sent": "So we need to approach that.",
                    "label": 0
                },
                {
                    "sent": "Take into account these challenges.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our idea is quite simple.",
                    "label": 0
                },
                {
                    "sent": "So basically, since we want to from the Middle East shallow hierarchy, we want to learn the deep hierarchy.",
                    "label": 0
                },
                {
                    "sent": "So basically we simply aggregate the hierarchies together in the horizontal and vertical direction.",
                    "label": 1
                },
                {
                    "sent": "So by hierarchical direction I mean we collapse the node that has the same row.",
                    "label": 0
                },
                {
                    "sent": "So here we merge the route to route so much the root root and would leave to live is going to expand.",
                    "label": 0
                },
                {
                    "sent": "The bread of the tree.",
                    "label": 0
                },
                {
                    "sent": "The width of the tree.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, we also do in the other direction, the water coloration.",
                    "label": 0
                },
                {
                    "sent": "If we do so, we're going to spend the depth of the tree.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the second idea is that.",
                    "label": 0
                },
                {
                    "sent": "In order to consider whether we're going to merge in or not, so we need some to make some decision so the recent can be based on the contextual information.",
                    "label": 0
                },
                {
                    "sent": "For example, in the future that attached to the node and we also use the relational information such as the neighbor of the node.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that can be formulated into the similarity function in relational clustering.",
                    "label": 1
                },
                {
                    "sent": "So basically the similarity function is going to be composed from two part one is from the local similarity and the other from the structure of similarity, which is based on the neighbor and basically the similarity is just a linear combination between these two parts.",
                    "label": 0
                },
                {
                    "sent": "And we just going to decide to merge the node if the two nodes are similar enough.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now we already define the similarity function to decide whether we should merge or split the hierarchies and now we present the incremental approach.",
                    "label": 0
                },
                {
                    "sent": "Which is based on such similarity function.",
                    "label": 0
                },
                {
                    "sent": "So basically we assume that user or also specify the C term.",
                    "label": 0
                },
                {
                    "sent": "That is going to be the root of the hierarchy, so we start from the feet.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "In this case we have Canada and then we just simply use the Canada to opt in the personal hierarchy that has their root name as Canada.",
                    "label": 0
                },
                {
                    "sent": "And then we're going to use the same dissimilarity function that I presented earlier.",
                    "label": 0
                },
                {
                    "sent": "To combine them to be to get the broader hierarchy.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, when we merge them together, we also collapse.",
                    "label": 0
                },
                {
                    "sent": "I mean, we also accurate the static on the tech distribution and the number of users who specifies such node.",
                    "label": 0
                },
                {
                    "sent": "And then we can use that information to remove some noisy node and in this case which we simply use and known as specified by very few users.",
                    "label": 0
                },
                {
                    "sent": "And the next.",
                    "label": 0
                },
                {
                    "sent": "We're going to pick one of the students and then.",
                    "label": 0
                },
                {
                    "sent": "Use the term for example.",
                    "label": 0
                },
                {
                    "sent": "Here we use Victoria and then we use this term to grab.",
                    "label": 0
                },
                {
                    "sent": "To grab more personal hierarchies that name by Victoria and we do the same.",
                    "label": 0
                },
                {
                    "sent": "And we're going to get the we're going to get the cluster of the Victoria and then we pick the Victoria that similar enough to that Victoria.",
                    "label": 0
                },
                {
                    "sent": "And we do this on a dog and so on so we can keep extending the breadth and depth of the tree.",
                    "label": 0
                },
                {
                    "sent": "Meanwhile, when we attach.",
                    "label": 0
                },
                {
                    "sent": "The Victoria to the victory up top.",
                    "label": 0
                },
                {
                    "sent": "We have to remove some structural inconsistency that I'm going to explain next.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So basically suppose that we have following the following hierarchies and we want to merge them together.",
                    "label": 1
                },
                {
                    "sent": "If we simply merge them.",
                    "label": 0
                },
                {
                    "sent": "We're going to have the shortcut from UK to London so that account is the happen because you have the several path from one note to the other.",
                    "label": 0
                },
                {
                    "sent": "So since we want to get the tree not there, I will try to graph.",
                    "label": 0
                },
                {
                    "sent": "So basically what we do is in following strategy.",
                    "label": 0
                },
                {
                    "sent": "We basically under the UK.",
                    "label": 0
                },
                {
                    "sent": "We basically measure the similarity between England and to the UK and London to the UK and we pick the one that is more similar to the other.",
                    "label": 0
                },
                {
                    "sent": "And then we simply merge denote the England, because England is more similar to UK.",
                    "label": 0
                },
                {
                    "sent": "So we start with the closer 1 first.",
                    "label": 0
                },
                {
                    "sent": "And then we know that if it attached England to the hierarchy, we're going to get some shortcut and then over heuristic is that we keep the longer paths in it, capture more specific knowledge.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then finally the London is just attached to the right place.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now comes through the evaluation.",
                    "label": 0
                },
                {
                    "sent": "So basically we picked the 32 C terms and use the personal hierarchies from the Flickr as in previous work, actually is our previous work at Dub Dub 09 and we use the three different methodology's one is we compare the learn hierarchy against the reference hierarchy.",
                    "label": 1
                },
                {
                    "sent": "And we also measure how expressive of the learn hierarchy is, which I'm going to expand next.",
                    "label": 0
                },
                {
                    "sent": "And the last one is for the part that cannot comperable to the reference hierarchy.",
                    "label": 0
                },
                {
                    "sent": "I've just was just going to ask you, Sir.",
                    "label": 0
                },
                {
                    "sent": "Weather is correct or not, and the best I approach is from our previous work as well.",
                    "label": 0
                },
                {
                    "sent": "So basically in that world we assume that the node having the same name just refer to the same concept.",
                    "label": 1
                },
                {
                    "sent": "And basically we use the statiscal test to measure whether the relation is noisy or not.",
                    "label": 0
                },
                {
                    "sent": "So basically we assume that.",
                    "label": 0
                },
                {
                    "sent": "If the relational noisy.",
                    "label": 0
                },
                {
                    "sent": "It's kind of generated from some random process, so we use a statiscal test and we just going to remove the note that we consider it as noisy and then we combine them together into the single tree.",
                    "label": 0
                },
                {
                    "sent": "So this is the best sign approach.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And for each methodology I'm use different metrics.",
                    "label": 1
                },
                {
                    "sent": "So basically the first metric is the taxonomic overlap which measure the correctness of the structure.",
                    "label": 0
                },
                {
                    "sent": "So basically in this metric is considered the order of the node.",
                    "label": 0
                },
                {
                    "sent": "But the next one is the metric measure the how well the approach can recover the concept comparison.",
                    "label": 1
                },
                {
                    "sent": "Comparing to the reference hierarchy.",
                    "label": 1
                },
                {
                    "sent": "And the next one is we would like to measure the expressiveness of the learn folksonomy.",
                    "label": 1
                },
                {
                    "sent": "So basically we basically consider the Bush Ness and the deep then the depth of the tree.",
                    "label": 1
                },
                {
                    "sent": "So basically we would like to have a single number that like take these two into account which I'm going to explain next.",
                    "label": 1
                },
                {
                    "sent": "How to calculate that and the last one is as I mentioned we have to measure the for the part that cannot come parable to the reference Iraqi we just asked.",
                    "label": 0
                },
                {
                    "sent": "You submitted the path from the root to the leave.",
                    "label": 0
                },
                {
                    "sent": "If the whole part are correct.",
                    "label": 0
                },
                {
                    "sent": "If some of them just have the order, we just mark, we just ask user to market as incorrect.",
                    "label": 0
                },
                {
                    "sent": "So now I would like to explain a little bit more about over.",
                    "label": 0
                },
                {
                    "sent": "Our metric on this.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Operation, so basically we suppose that we have these different trees when we want to to say which one is the best in terms of expressiveness and deepness at in the single number.",
                    "label": 0
                },
                {
                    "sent": "So basically what we do is we plot the distribution of the node at each depth.",
                    "label": 1
                },
                {
                    "sent": "And The thing is.",
                    "label": 0
                },
                {
                    "sent": "The three that keep spending at each level.",
                    "label": 0
                },
                {
                    "sent": "You're going to get higher area under the distribution, so we use this number to roughly measure the expressiveness of the tree.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So go back to the example.",
                    "label": 0
                },
                {
                    "sent": "We have.",
                    "label": 0
                },
                {
                    "sent": "the C has the highest, the value of the AUT.",
                    "label": 0
                },
                {
                    "sent": "So now comes to the reef.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Experimental results, so basically we use as I mentioned earlier, we use 32C terms and we let the approach Road 3 from 32 systems an basically rather than report here with the absolute number, I'm just like compare to approach and to say which approach is better than the other.",
                    "label": 0
                },
                {
                    "sent": "I just counting the how many cases which one is better than the other and it's clearly that our approach outperforms the other in terms of the structure correctness.",
                    "label": 0
                },
                {
                    "sent": "And the number of the term that can recover and in terms of the expressiveness, and Moreover our push.",
                    "label": 0
                },
                {
                    "sent": "Is superior to the other in when we consider these three metrics at the same time.",
                    "label": 1
                },
                {
                    "sent": "So basically we consider if the approach perform better in our metrics to the other.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now here is an example of the folks only that we learn, so this one is quite shallow.",
                    "label": 1
                },
                {
                    "sent": "But it's according to the what users specify on the web.",
                    "label": 0
                },
                {
                    "sent": "So this one is like the combination of several personal hierarchy like hundreds personal hierarchy and what interesting the interesting thing about this is the week and learns the fork knowledge.",
                    "label": 0
                },
                {
                    "sent": "So basically for example we use are mostly know that Spider.",
                    "label": 0
                },
                {
                    "sent": "Is insect, but actually it's not because Spider has a click.",
                    "label": 0
                },
                {
                    "sent": "So, so this is the good thing about the folksonomy.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And so it is the other example of the.",
                    "label": 1
                },
                {
                    "sent": "Learn for tsunami.",
                    "label": 0
                },
                {
                    "sent": "So basically people are good in the categorizing using the Geo information so we can learn quiet detail hierarchy.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So our approach is to really went to many other words in terms for in the info hierarchy from the text data and text.",
                    "label": 1
                },
                {
                    "sent": "So, but basically our effort is funded fundamentally different cause the relation between the term.",
                    "label": 0
                },
                {
                    "sent": "I already specified by the user, but what we have to do is to since the relation can be inconsistent and noisy, we have to somewhere too late, align them together and correct the inconsistent an our approach.",
                    "label": 1
                },
                {
                    "sent": "Our work is also similar to the ontology alignment, but in that setting we only have very few structure and consistent structure to a lie.",
                    "label": 0
                },
                {
                    "sent": "But in our setting we have a bunch of.",
                    "label": 0
                },
                {
                    "sent": "Shallow and noisy high rank structure to align and the last hour of course is similar to the.",
                    "label": 0
                },
                {
                    "sent": "Some of the world that exploit users specify hierarchy, but that word is used.",
                    "label": 0
                },
                {
                    "sent": "The hierarchy for recommendation.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So finally our approach is can create more accurate and more detail for Sonam ES than the current state of the ASK approach.",
                    "label": 1
                },
                {
                    "sent": "Since exploits structural information during the merging process and the person will is more scalable is incrementally growing their fossil mean rather than using the exhaustive search.",
                    "label": 1
                },
                {
                    "sent": "So you can refer to the previous work in network, we use the exhaustive search to find the best path from one to the other.",
                    "label": 0
                },
                {
                    "sent": "For the future work, we would like to separate the broader and narrower from related to religion or we would like to learn the facets and we also want to combine more source of evidence such as geospace geographical information as well as we would like to apply on different datasets.",
                    "label": 0
                },
                {
                    "sent": "For example in the personal workspace or the personal folder or semantic network and that's it.",
                    "label": 0
                },
                {
                    "sent": "I would like to take question.",
                    "label": 0
                },
                {
                    "sent": "Find interesting work.",
                    "label": 0
                },
                {
                    "sent": "I just have one question database.",
                    "label": 0
                },
                {
                    "sent": "There are a lot of work about ontology, so how is work different from them?",
                    "label": 0
                },
                {
                    "sent": "Or can you like educate us like what the new side you can gain from this folksonomies like different pathology integration, database field.",
                    "label": 0
                },
                {
                    "sent": "So basically in our setting we have a bunch of what you guys call schema something like.",
                    "label": 0
                },
                {
                    "sent": "That and basically our setting is quite different because the schema is quite it's generated by user and sometimes it's not complete and The thing is we just cannot rely on a few structure.",
                    "label": 0
                },
                {
                    "sent": "But we have to collapse incrementally.",
                    "label": 0
                },
                {
                    "sent": "Combine the compatible structure together and keep going and going to make effective more complete.",
                    "label": 0
                },
                {
                    "sent": "But in India, for example, in ontology alignment, you have a bunch of.",
                    "label": 0
                },
                {
                    "sent": "I mean the detailed structure, right?",
                    "label": 0
                },
                {
                    "sent": "You can rely a lot more on the structure and you don't have to take into account some noisy data.",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "Just wondering, have you tried to compare any other method from that field?",
                    "label": 0
                },
                {
                    "sent": "Yeah so so basically.",
                    "label": 0
                },
                {
                    "sent": "No, a previous work we compare aware push against the.",
                    "label": 0
                },
                {
                    "sent": "Assumption approach we infer the hierarchical relation by using the the frequency, and in that work we offer from the previous.",
                    "label": 0
                },
                {
                    "sent": "Quite a lot, but I would like to like if you have more questions, I quite happy to like discuss with you offline.",
                    "label": 0
                },
                {
                    "sent": "Yeah next week.",
                    "label": 0
                },
                {
                    "sent": "So when you construct the hierarchy you seem to be using some different rules to expand the tree directions.",
                    "label": 0
                },
                {
                    "sent": "So how do you determine the priority of different rules and database in order to avoid the confusion?",
                    "label": 0
                },
                {
                    "sent": "Yeah, basically we we we based on we use to heuristics to consider next next node to be explore.",
                    "label": 0
                },
                {
                    "sent": "One is the number of Reducer, the popular one is going to be explore first.",
                    "label": 0
                },
                {
                    "sent": "But The thing is, when we combine, when we attach the hierarchy into the tree, since we have to correct the inconsistency, so we use the closeness to the to the ancestor node, the closer one for the cost of 1.",
                    "label": 0
                },
                {
                    "sent": "We're going to consider attach that one first and then correct the inconsistent.",
                    "label": 0
                },
                {
                    "sent": "But actually we are working on the approach that required, like incrementally one.",
                    "label": 0
                },
                {
                    "sent": "But we are working on their porch that kind of like.",
                    "label": 0
                },
                {
                    "sent": "Through the hierarchy at the same time, and then let everything aligned together with some concern.",
                    "label": 0
                },
                {
                    "sent": "That the conflict will not happier at the final hierarchy.",
                    "label": 0
                },
                {
                    "sent": "Alright, let's thank our speaker again.",
                    "label": 0
                }
            ]
        }
    }
}