{
    "id": "u2oqxqgmgnznxgzrkb7zs7zh6kjf3tym",
    "title": "Knowledge Engineering and the Web",
    "info": {
        "author": [
            "Guus Schreiber, Vrije Universiteit Amsterdam (VU)"
        ],
        "published": "Oct. 19, 2014",
        "recorded": "September 2014",
        "category": [
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2014_schreiber_knowledge_engineering/",
    "segmentation": [
        [
            "I think I've been happy enough not to be trained as a computer scientist because computer science is actually very easy people to work with.",
            "They have so many researchers, have large egos, but they're easy, easily satisfied with simple things and getting people together in greeting is actually quite easy.",
            "Much easier than doctors group.",
            "I use OK."
        ],
        [
            "And I should say that almost all the things that John mentioned were things where most achievements were actually reached by other people.",
            "So I was only there.",
            "Maybe at the right time?",
            "OK, my talk.",
            "Will not be talking that much about cultural heritage of some of the examples will come from the area.",
            "I've tried to focus it on.",
            "Well, what are my own observations about how we handle semantics?",
            "Knowledge on the web?",
            "So I'll talk a bit about representation, but maybe give you my view my meta field.",
            "So what do we have learned over the years?",
            "I'll start with that, so that's my work on sharing of the different semantic web standards of trying to give you a meta perspective on that.",
            "Then I will go into one aspect.",
            "In particular, the whole notion of categorization, which is so central to semantics.",
            "I'll talk a bit about its nature, just limitations, main sources and one of the key issues that is.",
            "There, namely, the notion of alignments.",
            "So, because the web has many.",
            "Of these pieces of semantics and the whole problem is the interoperability.",
            "How do we link them together?",
            "And finally I'll take a short look at that.",
            "Once we have this kind of categories, once we have these labels of graphs, what we can we do with them?",
            "Because I think it will not exploiting them enough.",
            "OK, so that's.",
            "Now the 1st three slides I care more less."
        ],
        [
            "Now, given after the introduction, I can skip because I usually start with my journey because it gives you some context on where this speaker comes from.",
            "So you understand a bit better.",
            "So I did this in the 90s and 2000s.",
            "We finalize the textbook so I could put this behind me.",
            "So there's one thing you have to learn as a researcher once you become associated with the label, you have to get rid of it.",
            "I became associated with this label and at some point I couldn't say anything anymore at the conference without being attacked.",
            "But in your book you wrote this investment, so people are going to treat it as a kind of Bible, and that's the worst thing you can have.",
            "I don't like the Scientology church.",
            "So that's.",
            "What it it didn't?"
        ],
        [
            "In 2000 then I thought I started to work in this very small niche, namely cultural heritage.",
            "So all the projects at the time were in banking and other areas.",
            "It seemed like a small niche, but that was that was a mistake in actually turned out to be a lot of quite a lot of people who are interested in making the information in museum archives and libraries available online as well, very active research area.",
            "And now you see also the scientists from the humanities joining this, and this creates this.",
            "Digital humanity space which Dominic has talked about in Extenso."
        ],
        [
            "And finally.",
            "Since 2001, for about 30 years I've been involved in WC work.",
            "So I started with the outgroup with Jim Hendler.",
            "Then I did some best practice groups.",
            "As one of the groups produced this cost model, which I talked briefly about, we also produce our DFA.",
            "This is this.",
            "HTML embedding of RDF and over the last three years I chaired the group that just published its.",
            "Recommendations, namely, the revision of RDF standard of 2004.",
            "OK."
        ],
        [
            "A few words about standardization because it's a big issue, so I'm going to make 2 points.",
            "One is the languages that I'm going to talk about and that are just talked about RDF owl.",
            "They don't matter.",
            "So what?",
            "It is so the you have some people really deeply believe in things like our RDF.",
            "I'm not one of those people thought I'd share these groups.",
            "On the other hand, I've strongly believe in open standards.",
            "It's been the key success factor of the web.",
            "So, and I think that's a nice point about WC.",
            "If you've never seen that process, it's a public process where consensus really works.",
            "It's sometimes tough and it takes some time.",
            "Don't expect it to finish in a few weeks, but it's really nice to see an it's.",
            "Most of you well are too young to remember the time before the web when we had the Microsoft of the world, which were always having all these proprietary formats.",
            "You could never do anything with data even if there was no web you couldn't even even if there had been a web, there would be no way to integrate all the information we had.",
            "Because they were all in different binary formats.",
            "The fact that we now have all these interoperable textual, at least at syntactic level compatible formats, is due to the web.",
            "And as you do to the fact that we have open standards, so that's really very important.",
            "However, that's the danger will come back to a number of times.",
            "This talk with computer scientists.",
            "If we go into standardization, we tend to over design.",
            "We are always would've called trigger happy.",
            "We want to we have all our techniques and want to apply them.",
            "So being laid back being just very.",
            "Where of?",
            "The minimal you need to do and just doing that is very important.",
            "Just to give you some."
        ],
        [
            "Idea of what a process like this large group entails, and all the groups are more or less similar.",
            "So you get something like 8000 messages within the list.",
            "You get about 2000 messages about external comments from people.",
            "We had more than 125 teleconference is one of our and we had quite a number of issues that we had to resolve.",
            "So this is a complex process.",
            "And it's nice that it always comes together.",
            "OK."
        ],
        [
            "Enough about WC.",
            "I'm going to talk about web."
        ],
        [
            "Data representation.",
            "Again, this warning sign representation languages are there for you.",
            "And not the other way around.",
            "When we designed our remembered very well, there were some people who try to begin stage with try to use all to represent word net.",
            "And they had decided that had to use LDL.",
            "And of course, Wordnet has a built-in meta level.",
            "So there's no way in the first version of the later on has been repaired, but the first version of LDL didn't allow meta level and they were trying to do it.",
            "Of course, if you try to do that then you always have to force to make one or more decisions that are wrong and you can do it one way or the other way, but so is wrong and they were literally trembling.",
            "And the fact that they were not able to use this language and thought it was their fault.",
            "So that's that's very important to realize.",
            "Rep stations are just tools.",
            "The only thing they are and if they don't fit well, well, maybe just have to live with it or take another two.",
            "OK."
        ],
        [
            "But before I go into this membranes, I think it's also good to realize that other places in the web semantics have become more important or a different kind of semantics.",
            "HTML5, which by the way was enormous fight in the end became a. I think a really nice thing with a lot of semantics.",
            "It's what we call structural semantics.",
            "It has all these new notions that tell us something about how a document is structured.",
            "This notion of article section so and.",
            "This actually completes the whole idea of Tim Berners Lee when he designed the web to have this complete separation of content and mark and Style style markup.",
            "So this is the content.",
            "This is stuff so now HTML5 purely does the content, markup, and CSS completely used for style.",
            "HTML5 is, I think, a big leap forward and it's very easy to use.",
            "I teach this first Web technology course to students of computer science curriculum.",
            "Very different backgrounds and now I find it much easier to give the course then the times when we had to teach HTML 4.",
            "And something so this is also very semantic actually."
        ],
        [
            "Also a different type.",
            "OK, moving to RDF.",
            "So what do we do in the.",
            "In the last revision group.",
            "Well, not much to be honest we.",
            "We particularly designed new syntaxes, but the abstract model of RDF stayed the same, so that means so you have many ways of writing down graphs, But this kind of pictures you can always drop them.",
            "By the way, this is a picture from the primer.",
            "Um?",
            "Going to make some self promotion by saying that we have a new primer which is very short.",
            "You can read it within an hour.",
            "As written by Ephraim or myself, and we have all these nice examples which are very understandable, I think.",
            "So I advise that to you as a kind of easy introduction if you want to have it.",
            "OK, so we have this kind of."
        ],
        [
            "Graphs the main conceptual new thing that we introduced in RDF 1.1 is the fact that you can carve up graphs in subgraphs.",
            "Yeah, so here.",
            "Well this is not very nice to to cut Mona Lisa.",
            "It's meant that she is actually part of two different graphs, but on the left we have a graph on the right we have a graph.",
            "OK, this actually also makes very clear that RDF the only thing that it does it's type information.",
            "It labels the graph the web resources with type information, web resources and web links with type information.",
            "But what you can do now is you can say OK this is a sub graph and you can give it a name WHI is that important?",
            "Well this important because you want to have a structured way of saying something about a sub graph.",
            "Think of, for instance, the Bridge Museum wanting to say something about a book or.",
            "The Rosetta, the Rosetta Stone.",
            "They want to attach.",
            "Metadata provenance information.",
            "All kinds of stuff to this, so the fact that you can talk about subgraphs, give them a name, and then have other statements that say something about the graph.",
            "That's crucial, new distinction in the RDF model, by the way, this led to endless discussions in the group about the formal meaning of this.",
            "I won't bother you with that.",
            "If you're interested, look up the discussions actually from a social scientist would be very interesting to study.",
            "The interactions that occur in such groups."
        ],
        [
            "Um?",
            "Yeah syntax, so syntax is just the vehicle here.",
            "They used to be only XML syntax with everybody cursed.",
            "There now in total 5 two of them already were developed overtime.",
            "I think the main addition is number 4.",
            "So the Jason based syntax is really something that helps opening this.",
            "The whole RDF worlds to the general web world, and I see.",
            "So I think of these 5 Jason one is the one that has the highest number of new adopters.",
            "I see many people trying, so to give you some idea for people who are aware of Jason will have to.",
            "OK can you see this?",
            "OK, so this is.",
            "This is really kind of piece which almost looks like Jason.",
            "There's actually a couple of things that are specific, But most Jason developers will will have a good sense of what it means, but it stands for so Jason for who?",
            "For those who don't know, this is really a very simple kind of property value kind of notation.",
            "Which is which is widely used, so I think this is one of the biggest steps.",
            "It's very practical in the sense it is.",
            "And.",
            "Lot of the definitions are actually hidden in the context, so if you there is ways of using Jason, but I think the best way is actually to make it look very much like common Jason with only a few special things like you see the one with the ampersands.",
            "But the.",
            "@ sorry.",
            "And the.",
            "Just keep it looking like Jason, so I think that's one of the main things that we.",
            "Practical products that we delivered."
        ],
        [
            "So this is something you heard earlier this week.",
            "So what the various things that you have in RDF and OWL to model.",
            "So assuming that you can do this typing, So what kind of modeling constructs do you have for?",
            "Those types you see the list of RDF and write the list of all on the sorry.",
            "The list of RDF on the left.",
            "The other list on the right.",
            "One of the most powerful features of RDF is this whole notion of property hierarchy.",
            "There's actually something you don't see in database modeling in most systems, so into a male you have the notion of Association class.",
            "That's comes close, not really, but it's a very powerful mechanism, in particular because it allows you to specialize properties.",
            "Yeah, if you have specific things you can specialize properties and attach your own domain specific ones, but in general.",
            "I strongly prefer that you not look at this as two different 2 languages.",
            "You have to choose one in practice.",
            "Well, I should say that there's hardly any pickup of Al as a whole.",
            "How I view hours?",
            "It's useful to pick a few parts that you can use, for instance, a mass of transitive or infers are very useful.",
            "Some people use other parts, but using it as a whole I think is so.",
            "Maybe there's some applications, but there's certainly not large.",
            "Take up of that.",
            "So just take the selection that you need for your particular problem and that you'll be fine usually."
        ],
        [
            "OK, this is actually very old slide of mine, but it's worth repeating.",
            "So anything you've heard about ontology engineering, so ontologies are there for sharing.",
            "That means that creating your own ontology is, in a sense a contradiction in terms.",
            "Well, you shared with yourself, but that's not really much sharing.",
            "And.",
            "The language security Ontology and is completely independent of whether it is an ontology, whether some people.",
            "Think that if they write something and now they create an ontology, that's that's a complete falsehood.",
            "Yeah, so that's.",
            "You can write it in texts and it will still if other people share.",
            "These concepts will still be ontology.",
            "That's that's the key thing, and now it's activating a bit, but that's how it works."
        ],
        [
            "OK, for this I think the so this is probably.",
            "Something that, in terms of sharing knowledge, has been become one of the key vehicles this course.",
            "Was actually started whole negative by Libby Miller, Dan Brickley, another miles in one of the small, very small European projects, which is actually some point cut short by the Commission.",
            "Think very wrongly, because the Commission actually funded many semantic web projects in Europe that had hardly any impact on the world discussed project did have that was, but they were captured.",
            "So so much for the Commission to understand what kind of EU research said that they should fund scores is very important because it does a very simple thing.",
            "There is on the web and also off the web.",
            "There is a lot of information already available about categories that we can use to describe our resources to label our graphs and those things have been gathered over years by.",
            "The British Museum by many.",
            "By libraries.",
            "By archives.",
            "But by many organizations almost.",
            "Any organization or government will have some kind of a cabarita to describe his business, its concepts and so on.",
            "What's cause does it have provides a very simple way of making those.",
            "Classification schemes, as they are usually called available on the web.",
            "Yeah, and so it very quickly quite a number of those were published.",
            "It's the biggest shakeup has been in the library world.",
            "On the key resources, for instance, is that the whole Library of Congress subject names are available.",
            "Through skulls, that means you can use all these labels that fly with Congress has to tag books.",
            "On the web, that's really great.",
            "OK."
        ],
        [
            "I think the.",
            "The whole key success factor of skulls has been its simplicity.",
            "It's very easy actually.",
            "The main things are here.",
            "You can do some simple.",
            "A hierarchical ordering without it's having the specific subclass interpretation usually has, but it's not required and there are a number of pragmatic documentation properties and so on.",
            "There also separate linking properties or come back to those that the basis is extremely simple and people who are used to work in vocabulary fields and.",
            "Organizations typically have people that maintain their for calories.",
            "Are doing this like routinely actually in the?",
            "In the library, world's people talk about Scots ification of their recovery, but people make a verb out of your.",
            "Representation language that means is a good thing.",
            "Now they're really using it."
        ],
        [
            "But again, here, so that has been, I think.",
            "This simplicity is again here the key factor, so we have to be.",
            "Aware of our tendency to over design and to limit ourselves to the key thing.",
            "So in this nice German phrase in the Bush ranking site leader Mr Germans here run.",
            "In the limit, in the limit, yes.",
            "The the master shows himself him or herself.",
            "Through his slimming through the way he limits himself so it's much longer in English, I don't know in English, but that's that's very important."
        ],
        [
            "OK, so that about representation language, so be sure to view them as a tool and use them as.",
            "As restrained as possible.",
            "OK."
        ],
        [
            "Thinking about.",
            "So when we apply them to a real domain.",
            "We always have to be aware of this notion if we apply.",
            "Our language is to labeling graphs and we want to have categories we have to understand that categories are actually.",
            "There are a thing with three dimensions, so if you think about the concept, something we use to describe some of the world, like this chair or our laptop.",
            "We have labels for this.",
            "Like here for example musical instrument.",
            "We have definitions for this.",
            "This is called the intention.",
            "We can describe what it is, but a chair is and we can give examples.",
            "Yeah, that's the three ways we can define.",
            "Many people use only one of the dimensions.",
            "For example the name.",
            "If you just use the name, you hope that other people will have the same Association with the name.",
            "OK, better keep this in mind if you."
        ],
        [
            "Owl but you have to understand very well from Al is Al takes only the right hand view.",
            "So the only thing that counts as a class definition or category definition now is the fact that you gave a number of examples that are part of the sets that forms this class.",
            "You can call it an extensional definition an so you really put the emphasis on what a boundary is, so you assume that every category has a clear boundary in which members of that class fit members of the category, and members that, and Members who are not part of their class don't fit.",
            "So there outside the boundary.",
            "OK, that's a very you could almost say a philosophical stance on how you model the world.",
            "It's I want to point you to one particular piece of work from cognitive psychology, which takes a slightly different standard, which I think is useful to view to."
        ],
        [
            "Be aware of.",
            "So who's 30 of Russian categories?",
            "Soda two OK.",
            "So this comes more from the psychology fields so.",
            "Eleanor Rosch takes the view that you categories are there for you to help organize the world.",
            "We as we grow up, we learn categories to understand what's going on in our environment.",
            "So there are tools for perception as well.",
            "So a child learns, does this Papa this is Mama.",
            "These are the categories and Russia's introduces, I think, very important notion of the basic level categories.",
            "Those are the primary things that people use to categorize things.",
            "It's the.",
            "Um?",
            "Chair stuff like that and so that you can actually find these by looking at the number of properties that various characteristics have not going to interval theory.",
            "But it's important because if you look at some kind of high key categories that usually organized hierarchy, it's very useful to find what the basic level categories are.",
            "There, not always."
        ],
        [
            "Same, but OK. Let's hear this is an example from her original article.",
            "So things like chairs and table lamps.",
            "That's what she calls basic level categories now.",
            "Then there are two.",
            "Types of other categories one is.",
            "The categories that come on top of this, which are more abstractions like furniture?",
            "French selves an abstraction and you have specific get reset go below this now.",
            "What is interesting for this specific categories?",
            "They might require specific knowledge to for you to understand if you go, for instance for chairs and you go to a person who knows a lot about chairs, you might talk talk to you about Windsor chairs and then 15 subtypes of Windsor chairs.",
            "So then you're outside any understanding of normal people.",
            "You really need to be an expert, so understanding where is basic level categories.",
            "Helps you to say to find the things that you should talk about with your audience and to also understand what kind of people what the normal people understand.",
            "And the domain specific things.",
            "If you want to use this, you have to be have to be sure that the person you're talking to is actually someone who is more knowledge than the common person about a particular.",
            "About it about a particular category.",
            "OK, so there's sometimes discussion.",
            "She also gives.",
            "The second example is actually always been a discussion.",
            "Is the normal thing that people talk about the type of tree or a tree in itself?",
            "Yeah, tree is a so I'm personally I'm very bad in anything that has to do with Flora.",
            "So if you ask me, well maybe I will be able to do.",
            "Birch maybe as well, but the rest of them.",
            "A Maple three, probably not.",
            "So so it can depend a bit on where you actually put the exact boundary, but it's it's a very interesting."
        ],
        [
            "A distinction, and it's useful for you to have, so this also helps you to judge what are useful general category systems.",
            "Yes, do you think that?",
            "These are similar to Birkenstein.",
            "Dissemblance yes, well, that's a long discussion to go more.",
            "Yes, probably yes, but Russian comes from a very different perspective.",
            "She comes really from the practical cognitive psychology experiments.",
            "Yes.",
            "But I think so, but it's good to realize all the popular.",
            "Um, vocabularies that people use a lot sandwich if overs.",
            "I think the prime example that's more or less the basis of many social networks.",
            "Also popular because they're exactly specifying specified categories on these basic level.",
            "Yeah, so when we talk about people, their Mail accounts, all those are part of our common language.",
            "Everybody understands this and that's, uh, so that's.",
            "That's very important, by the way.",
            "Here you see an important example of what I think makes.",
            "They were.",
            "RDF is really powerful, So what you can do?",
            "Is that you can say OK, actually I have specific relationships here.",
            "It's called, has parents.",
            "And then say it's a it's a type of.",
            "Nos relation Sonos is the general friend.",
            "Relation Info Folk Knows is a kind of.",
            "Phrasing itself, but both is defined at the level of basic level categories.",
            "That's one of the reasons it's such a.",
            "Well understood for kabeli.",
            "It holds actually from."
        ],
        [
            "Many of the others.",
            "So for Dublin Core is maybe a bit more particular, but it's.",
            "Is focused on people that do library descriptions.",
            "So every person who is used to describing features of books and so on will recognize the features of Dublin Core and also there they've limited themselves to 15.",
            "Actually.",
            "Well nowadays are more.",
            "Also some specializations, but they have limited themselves to a useful subset which works well.",
            "OK, those are, So what?"
        ],
        [
            "Currently I give you an example of very specific one.",
            "This is one I do a lot of projects with museum.",
            "That they use.",
            "And to give you also some.",
            "Indication of the richness of vocab list.",
            "It is iconclass eyeglasses, a whole scheme actual grammar for describing scenes is biased towards Western scenes like religious scenes or mythological scenes and it allows you to describe things like what it says here says.",
            "Bearing the head so so lifting the hat, one of my first applications was describing photographs of apes and I could describe the photograph that the eight was scratching his head.",
            "So you know this funny pose that apes can have.",
            "So there are these very rich description format set of categories that you can use, But this is particularly used by.",
            "People who.",
            "I describe Prince images in museum place like this.",
            "This is not.",
            "This is not basic level category, it's more what people use in specific environments.",
            "OK."
        ],
        [
            "So one of the key vocabularies that is currently under discussion is what Google has done with schema.org.",
            "So in schema default DEF incorporated.",
            "Actually many different vocabularies, so this is an example where they incorporated the BBC program ontology into schema.org.",
            "Very interesting because it has been very successful in describing TV programs.",
            "Of course, TV programs are very important part of the entertainment industry and of the web to be in the web is a very important theme at the moment, so they have.",
            "What I've done in schema Doctor tried to characterize a lot of things that are useful for general search.",
            "Yeah.",
            "Yeah, radio programs.",
            "The BBC and radio problems.",
            "Yes, sure yeah."
        ],
        [
            "OK.",
            "So one of the issues there.",
            "Well, first is what do you do with such kind of large schemas are they should be designed and top down.",
            "Or bottom up so the web approach always been been a bit more bottom up, so there's no single architect who designs this, but people bring it together.",
            "Of course, Google has done the opposite.",
            "A bit, but they're not trying to incorporate things that are already available like I just saw, so there's a debate going on.",
            "The second is who owns this and who controls this, and we can hook and extend it.",
            "So that's I think one of the key battles that that needs to be thought about this.",
            "So if we we don't want to get back to the situation pre Web, whether particular companies controlling how we look at data.",
            "Yeah, on the other hand, schemes efforts like this are very worthwhile.",
            "The Wonder people now behind this is Dan Brickley and he's.",
            "He's one of the one of the people behind the semantic weapon, the weapon general.",
            "So that's the person you can trust, but on the other hand is also.",
            "Well, there's a whole issue set of political issues involved in designing these vocabularies and.",
            "You also have to realize that what these things are used for at the moment I've mainly to support general search.",
            "So there is a bias in there.",
            "OK, so schema dork is is very useful in the beginning.",
            "People in the Semantic web area was more or less discarding it as when they heard of it.",
            "But I think it's a much more nuanced thing.",
            "You have to really carefully look at this.",
            "This is sort of.",
            "This discussion is not over."
        ],
        [
            "But we have to be very careful in thinking that vocabulary like schema or any other vocabularies solves our role.",
            "Category problem.",
            "So in in culture heritage have been many people have been designing the overall unified vocabulary like the Grand Unified theory of in physics, and they never achieve that.",
            "I think, at least in our lifetimes, we have to live with the fact that we have many different views on the world and those fit with many different vocabularies.",
            "And.",
            "The only thing you can do.",
            "Is do them partially align them where possible?",
            "And that's already difficult enough.",
            "So that's all you should try to achieve.",
            "So if you have recovery, always assume it is limited, is biased in his limited, nothing wrong with that.",
            "That's not a negative statement."
        ],
        [
            "OK.",
            "So alignment, so that's a very so you will see in computer science there quite a number of people who worked on alignment techniques.",
            "How can we automatically find links between categories in one vocabulary and catches another account?",
            "Because once we have these these alignments week and that helps a lot, that will show that later applications for using the semantics in practice.",
            "So that's.",
            "But if you think of alignment, you have to think of two different types of alignments, and those are very different in its nature.",
            "In their nature, one is if you want to define alignments in categories.",
            "Then you get confronted with a specific class of problems that I will talk about in a minute.",
            "You also have alignments between real things in the world that have some identifier.",
            "You, me.",
            "Amaki so you might have to need for disintegration, but it's a thing that you can establish this well.",
            "At least given the Observatory powers that we as humans have.",
            "We just we assume we can establish with some certainty that today we are in kalamaki.",
            "And not in a vacuum.",
            "So things where you have to find identity so those are different in their nature.",
            "They have a different type of alignment techniques.",
            "I'll"
        ],
        [
            "So there's a whole set of techniques that people work to bomb.",
            "Again, here is.",
            "Use these if you want to use.",
            "If you're going to do some link data, want to align particular datasets ticker calories?",
            "You should study these techniques but also use them as a kind of tools.",
            "Yeah, I've noticed that the most important part of using these techniques is to think about methodology.",
            "When should I use what technique?",
            "So some of these techniques are very complex.",
            "Also very simple.",
            "In some cases the simple techniques actually work best.",
            "You also have to think of if you do alignments.",
            "You always have this notion of the whole problem of.",
            "Precision versus recall.",
            "Yeah, how do you balance the two?",
            "In that very much depends on the domain, so I've just been working in domain of.",
            "Culture has domain of ults, archives of ships where we could, but we will.",
            "We're finding alignments and the domain experts said, OK, we are interested only alignment sense almost absolutely right.",
            "Surely rights.",
            "So that means you go for very high precision and just accept that you don't find quite a number of.",
            "Quite a number of links will be hidden, so using these techniques don't just go for one.",
            "Don't be a kind of.",
            "Apostle of 1 particular technique.",
            "Just apply them and typically apply them maybe.",
            "In repetition, several.",
            "Different ones that you have.",
            "You can find various papers for people who try to do this and apply this in a very kind of methodological way.",
            "OK, so alignment techniques are very important, but."
        ],
        [
            "Applied it with a kind of meta view.",
            "If you do evaluation of alignments and I'm not talking about alignment information for the category level, you will notice that is actually not that easy if you ask people to say OK, I give you this picture and what do you see here?",
            "Computer science typically assume that everybody will agree.",
            "I've seen many alignment papers where there is one evaluator.",
            "Namely, the person who wrote the paper he's looked at the pictures and said that this is a.",
            "This is a Castle, this is.",
            "This is not if you actually going to do that with several people.",
            "You will notice that there is inherent difference between how people look at for example pictures.",
            "There's a, there's a variety.",
            "And this is actually well known in psychology research.",
            "They even have measures for dislike, interobserver agreement, and so on in the beginning, certainly.",
            "And we had a large alignment initiative in the semantic Web.",
            "Many people were doing there.",
            "Align with the information without even bothering about that.",
            "So it is difficult for people."
        ],
        [
            "To agree on categories.",
            "And that's is another point.",
            "I want to make about cat about categories.",
            "There is a limit to.",
            "Categorical thinking, so most people and is actually an extension theory of Roshan.",
            "Well well phrased by Lakoff later.",
            "They don't think of categories as things with sharp boundaries.",
            "They think of categories as prototypes where things in reality are.",
            "Closer or farther away from a particular prototype, you can see there's a Platonic idea.",
            "Just never fully realized that you can get close to it.",
            "Yeah, so that's so.",
            "The whole notion of category as we humans uses is not like the notion of category in description logic.",
            "Humans are not description logic machines.",
            "Please realize that.",
            "So if you do some kind of category alignments, be aware that the few evaluate the results that there will be different interpretations an that's fine.",
            "That's how it works.",
            "Yeah."
        ],
        [
            "OK, so.",
            "Here's another few lessons that I've learned while I'm doing this.",
            "So I've been.",
            "I've been designing myself quite a lot of hierarchies and so on.",
            "In practice, I notice that on the web, if you do this kind of stuff on the web, you know hardly ever.",
            "Readesign you use stuff that's available there and you're going to extend it specializes, alignment, whatever, but you leave it as it is.",
            "Rule #1 leave it as it is.",
            "There's a lot of information out there.",
            "Don't think that people have made mistakes in the past.",
            "There's usually very good idea where something is modeled with a particular way.",
            "OK, so use things as they are enriched in the line."
        ],
        [
            "OK.",
            "So if we do link data.",
            "You have to do some conversion from the existing format, could be some database make smell to link data formats.",
            "We've done it.",
            "Many people have done it.",
            "If you want to do this that quite a number of toolsets available nowadays that can help you do this.",
            "Also there the main message is.",
            "Indischen verse."
        ],
        [
            "Process to link data.",
            "Keep the original information.",
            "Don't throw out things.",
            "I mean when I did in 2005, the first conversion of the rights museum data, we got all the Rijksmuseum data.",
            "Of Amsterdam converted them and we saw this property information.",
            "I thought that's bullshit.",
            "I don't need that.",
            "I throw it away.",
            "That was one of the biggest errors ever made, so be aware of that.",
            "So keep was there.",
            "And there's actually various mechanisms that allow you to do that.",
            "One of the key decisions have to take is the whole URL, but it's outside the scope of this talk.",
            "Their various nice best practice papers on this on what you should do in this conversion process.",
            "Just want to point you to this overall issue.",
            "OK."
        ],
        [
            "And what you also want to do is involve people, so this is an example where sorry, this is a Dutch website.",
            "We we worked with the so we have this national broadcasting archive.",
            "Like any country has they used.",
            "They used to be very small organizations nowadays.",
            "You know the archives of TV and Radio are the new broadcasters.",
            "With all these catch up services and everything, they are the main organizations.",
            "Now in the TV landscape and.",
            "They still have this tradition of describing all their programs.",
            "And it typically takes if program one hour will typically take 4 hours of annotation efforts.",
            "So.",
            "In this digital world, what it archive everything.",
            "Nowadays, that's not a sustainable scheme.",
            "So crowdsourcing you've seen this.",
            "You've heard about.",
            "This is typically now used to describe such programs and involve people, so this is also a very important semantic web activity that you can help designing such tools, making sure people are motivated that I get something back from annotating these programs and also.",
            "But there's also technical challenges there once people describe this, how do we?",
            "How do we match that?",
            "Again, alignment problem with the current existing practice for documenting TV programs in archives, which is typically also recovery based, so there's quite a number of interesting technological challenges there.",
            "To do."
        ],
        [
            "In terms of categorization, in fact, when you get labels, you have to think of how they match to categories and then maybe presented back.",
            "Ask people.",
            "So we for instance here, decided that we do two things.",
            "We had games for people with tag, the video and other games so people could disambiguate the categories that we derived from this CEO.",
            "Is this right?",
            "Yes, OK, and that people would call this gardening.",
            "So this is a various way two ways in which the crowd sourcing techniques that you talked.",
            "That you talked earlier about this week can be applied in this way to improve semantics."
        ],
        [
            "They also so.",
            "One advantage here in this particular case was that we also have now information about when something happens, typically when video TV archives check their programs.",
            "They don't tag it time and time to just say something about the program as a whole.",
            "OK one.",
            "More recent."
        ],
        [
            "Object.",
            "It's which we are now doing with the Rice Museum is also using this crowdsourcing, but actually in a slightly different fashion, and I've turned the Tierney sourcing.",
            "You see this picture.",
            "Yeah.",
            "We are the racism is not interested in knowing that this is a woman there.",
            "Yeah, leave out the kind of more obscure remark at the bottom.",
            "They are interested in a few pockets of people who know a lot about this.",
            "Now, apparently there should be a frog there by my side count.",
            "The flock at the bottom of the picture, yeah?",
            "Experts tell me the fork stands for rejected lover under the woman represents the court's arm.",
            "Yeah, so the regular team is not interested in the majority vote on this would be interested in the minority vote.",
            "The few people who actually know this.",
            "So this is also actually very interesting research issue.",
            "It touches on trust.",
            "How can we derive from behavior of annotators, whether they are trustworthy?",
            "So there's a whole range of computer science things that you can study for this particular problem.",
            "Yeah, and it turns out to actually quite a lot of people who like to do this.",
            "Yeah, so this right, some doesn't have the people to do all these annotations to have 700,000 prints that they want to digitize and describe.",
            "They don't have the resources.",
            "No museum nowadays has these resources.",
            "This is the way to involve users with it, and we just compute Sciences can help.",
            "This invigorating the semantics that is provided by those users.",
            "OK."
        ],
        [
            "And this is our interface."
        ],
        [
            "Soul."
        ],
        [
            "Briefly, go through is something so OK. We have all these categories an Please remember all the caveats I gave you.",
            "So we have a number of.",
            "We have a graph.",
            "That provides labels type information of.",
            "Resources and links between them.",
            "What do we do with them?",
            "Not one so.",
            "One thing is that we can do is do visualization.",
            "Yeah, that's the simplest way.",
            "Often we add to visualization some kind of selection based on, for instance, personal preferences.",
            "This is 1.",
            "The first demos are made for the Rights Museum.",
            "So if you go.",
            "I'm not sure what you do when you go to a museum.",
            "But often you see that people who go to a museum, they start at the beginning and then go through the whole museum and the second part is just walking quickly through rooms because they're too tired to look at anything.",
            "Yeah, it would be much nicer if you can have a real walk through a selected part of the museum that you are well so we have still have many museums.",
            "Still have these audio tools.",
            "But of course it would be very easy.",
            "Technically it's very simple to all these paintings.",
            "Usually it's very easy to attach some kind of RFID.",
            "Sends it to them and then use.",
            "A mobile phone to navigate to the right parts of the museum to give people a personalized tour.",
            "So that's actually technically that turns out to be very easy.",
            "Still practically, it has to be realized in many cases, but it's certainly something where visualization of semantics can enormously help."
        ],
        [
            "This is another case where we used semantics and visualization.",
            "You remember all the piracy attacks in the Red Sea?",
            "Yeah, so this is a you should see this life.",
            "Sorry I've not didn't dare to do a live connection here, but this is actually alive simulation of what happened to piracy attacks in the Red Sea when the corridor was formed.",
            "At some point the nations that were.",
            "That were.",
            "Did like the ships being attacked.",
            "They formed a corridor with military ships guarding the trade ships.",
            "What do you think happened to piracy attacks?",
            "You could have shown in assimilation?",
            "What do you think would happen?",
            "What did it do with the parts?",
            "That jumped on it, so they because the corridor was just too big, then we're not even off ships to protect them.",
            "So certainly the parts knew exactly where the ships were jumping on this corridor, and there was enormous increase in attacks.",
            "It's very nice to do this.",
            "This simulation was made purely by scraping web data and putting things together, so that's the things kind of things we can do.",
            "With our date."
        ],
        [
            "By the way, very important, and I think I saw people already mentioning this, certainly was a markers talk.",
            "Very much.",
            "So.",
            "If you look at the kind of representations we need, we tend to think of objects that we need to describe, maybe even more important is the notion of events.",
            "What happens at a particular point in time?",
            "So at the moment you see various different descriptions on the web version of how you should describe events.",
            "Typically very simple with some kind of time and place an actor and but event models at this moment are very important, describing what happens in the web, so that's why you see next to him.",
            "Objects many types of event descriptions nowadays.",
            "Sis."
        ],
        [
            "Anne.",
            "Also something which you can do with semantics is this is.",
            "You could have this as a kind of general description of a of a museum.",
            "This is actually one of the nicest.",
            "I'm not such a Picasso fan, but this one room with a fan I really like was in Amsterdam.",
            "The museum a few years ago.",
            "What you can do with your semantics is add to the current presentation that museum done so you would click on this and can't give the demo here.",
            "You will actually get to a whole web of information.",
            "About because so and the various aspects, and that's the kind of things we can do so.",
            "Without semantics."
        ],
        [
            "But more interesting, and I think this is really an unexplored area, and if you want to do some extra work in your thesis on this kind of stuff, I think there's plenty of opportunity is thinking how you use the semantics for search.",
            "What everybody tries to do is to kind of mimic Google.",
            "I don't think that's a good idea.",
            "There's many reasons why you would be able to do other types of things.",
            "Other types of search.",
            "This is 1 search algorithm, but I'm not saying this is.",
            "This is the best or just an example.",
            "There are many alternatives for this that we have used to explore graphs that describe large virtual museum collections and where we go to a path and try to find if you type in a string like because so.",
            "Or maybe some other painter?",
            "Now you go through the graph and then find.",
            "Interesting, relevant resources, but do something interesting semantically with them.",
            "This whole notion of how do you, which path to take, how to cluster results, how to generalize path and graphs, how to find patterns in graphs but."
        ],
        [
            "Don't get things like OK, we have a Picasso museum.",
            "We have that one is not here, but there's actually something like because some marble which you could group together.",
            "Semantic search can help you reorganize your search results in sets of clusters.",
            "One possible application of semantics I don't see enough yet of that kind of work in our field, so that's certainly something that many PC's are still can be OK."
        ],
        [
            "I'll do it.",
            "All these."
        ],
        [
            "Then OK, well as I lost as my last example, I will show this.",
            "So I talked about alignment.",
            "Yeah, why is alignment so important?",
            "Well, a few links already can do a lot of tricks.",
            "I'll give you this example is also from a culture here.",
            "This is from a real life demo I gave to a set of a collection of ethnographic museum.",
            "So they had this problem and.",
            "They had several different vocabularies and were wondering whether we useful to link those.",
            "So here was a real life problem that I had, so suppose someone types into carbon.",
            "I'm not a Japanese expert, but apparently this is a.",
            "This is a kind of term for a Shogun which is also a term for a kind of stylistic.",
            "At the time in Tokyo was still called Edo.",
            "OK, if you not suppose you type in this term an this picture.",
            "Actually this painting.",
            "Matches the query.",
            "But there is is not labeled with this term.",
            "Now, so that is not the case.",
            "However, the term appears in a very well known vocabulary which now, by the way, by the Cat Fund Foundation being published as linked data.",
            "On the web it's called the art and architecture to service.",
            "It will have two alternative labels for this to garbage service, either Edo or to Baba.",
            "Now their own desirous of this collection had only determined to.",
            "Once you have the link, yeah you can make this link.",
            "You can make the connection and retrieve the resource so by providing a few links you commend make many interconnections.",
            "By the way, because all these vocabularies are typically multi lingual.",
            "It also allows you to do multilingual search.",
            "If you go to geographical vocabularies it will have.",
            "The.",
            "So you learn assessoria TGN disorders of geographic names has like 12 different names for the city, like Regensburg in Germany.",
            "Yeah so every.",
            "So.",
            "For the painter Rembrandt, they're like 42 spelling variations.",
            "Yeah, so all these things, once you have these resources and you have linked them, you have an enormous semantic.",
            "You have enormous power that the semantics gives you in retrieving more results.",
            "OK, I think this source is very.",
            "A port is still used and should be used a lot more.",
            "I'm going to leave it at this, so I hope I'll give you some idea of.",
            "The whole notion of categorization, how you could represent them, and what you can do with them on the web.",
            "Thank you for your attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think I've been happy enough not to be trained as a computer scientist because computer science is actually very easy people to work with.",
                    "label": 1
                },
                {
                    "sent": "They have so many researchers, have large egos, but they're easy, easily satisfied with simple things and getting people together in greeting is actually quite easy.",
                    "label": 0
                },
                {
                    "sent": "Much easier than doctors group.",
                    "label": 0
                },
                {
                    "sent": "I use OK.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And I should say that almost all the things that John mentioned were things where most achievements were actually reached by other people.",
                    "label": 0
                },
                {
                    "sent": "So I was only there.",
                    "label": 0
                },
                {
                    "sent": "Maybe at the right time?",
                    "label": 0
                },
                {
                    "sent": "OK, my talk.",
                    "label": 0
                },
                {
                    "sent": "Will not be talking that much about cultural heritage of some of the examples will come from the area.",
                    "label": 0
                },
                {
                    "sent": "I've tried to focus it on.",
                    "label": 0
                },
                {
                    "sent": "Well, what are my own observations about how we handle semantics?",
                    "label": 0
                },
                {
                    "sent": "Knowledge on the web?",
                    "label": 0
                },
                {
                    "sent": "So I'll talk a bit about representation, but maybe give you my view my meta field.",
                    "label": 0
                },
                {
                    "sent": "So what do we have learned over the years?",
                    "label": 0
                },
                {
                    "sent": "I'll start with that, so that's my work on sharing of the different semantic web standards of trying to give you a meta perspective on that.",
                    "label": 1
                },
                {
                    "sent": "Then I will go into one aspect.",
                    "label": 0
                },
                {
                    "sent": "In particular, the whole notion of categorization, which is so central to semantics.",
                    "label": 0
                },
                {
                    "sent": "I'll talk a bit about its nature, just limitations, main sources and one of the key issues that is.",
                    "label": 0
                },
                {
                    "sent": "There, namely, the notion of alignments.",
                    "label": 0
                },
                {
                    "sent": "So, because the web has many.",
                    "label": 1
                },
                {
                    "sent": "Of these pieces of semantics and the whole problem is the interoperability.",
                    "label": 0
                },
                {
                    "sent": "How do we link them together?",
                    "label": 0
                },
                {
                    "sent": "And finally I'll take a short look at that.",
                    "label": 0
                },
                {
                    "sent": "Once we have this kind of categories, once we have these labels of graphs, what we can we do with them?",
                    "label": 0
                },
                {
                    "sent": "Because I think it will not exploiting them enough.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's.",
                    "label": 0
                },
                {
                    "sent": "Now the 1st three slides I care more less.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, given after the introduction, I can skip because I usually start with my journey because it gives you some context on where this speaker comes from.",
                    "label": 0
                },
                {
                    "sent": "So you understand a bit better.",
                    "label": 0
                },
                {
                    "sent": "So I did this in the 90s and 2000s.",
                    "label": 0
                },
                {
                    "sent": "We finalize the textbook so I could put this behind me.",
                    "label": 0
                },
                {
                    "sent": "So there's one thing you have to learn as a researcher once you become associated with the label, you have to get rid of it.",
                    "label": 0
                },
                {
                    "sent": "I became associated with this label and at some point I couldn't say anything anymore at the conference without being attacked.",
                    "label": 0
                },
                {
                    "sent": "But in your book you wrote this investment, so people are going to treat it as a kind of Bible, and that's the worst thing you can have.",
                    "label": 0
                },
                {
                    "sent": "I don't like the Scientology church.",
                    "label": 0
                },
                {
                    "sent": "So that's.",
                    "label": 0
                },
                {
                    "sent": "What it it didn't?",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In 2000 then I thought I started to work in this very small niche, namely cultural heritage.",
                    "label": 0
                },
                {
                    "sent": "So all the projects at the time were in banking and other areas.",
                    "label": 0
                },
                {
                    "sent": "It seemed like a small niche, but that was that was a mistake in actually turned out to be a lot of quite a lot of people who are interested in making the information in museum archives and libraries available online as well, very active research area.",
                    "label": 0
                },
                {
                    "sent": "And now you see also the scientists from the humanities joining this, and this creates this.",
                    "label": 0
                },
                {
                    "sent": "Digital humanity space which Dominic has talked about in Extenso.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And finally.",
                    "label": 0
                },
                {
                    "sent": "Since 2001, for about 30 years I've been involved in WC work.",
                    "label": 0
                },
                {
                    "sent": "So I started with the outgroup with Jim Hendler.",
                    "label": 0
                },
                {
                    "sent": "Then I did some best practice groups.",
                    "label": 0
                },
                {
                    "sent": "As one of the groups produced this cost model, which I talked briefly about, we also produce our DFA.",
                    "label": 0
                },
                {
                    "sent": "This is this.",
                    "label": 0
                },
                {
                    "sent": "HTML embedding of RDF and over the last three years I chaired the group that just published its.",
                    "label": 0
                },
                {
                    "sent": "Recommendations, namely, the revision of RDF standard of 2004.",
                    "label": 1
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A few words about standardization because it's a big issue, so I'm going to make 2 points.",
                    "label": 1
                },
                {
                    "sent": "One is the languages that I'm going to talk about and that are just talked about RDF owl.",
                    "label": 0
                },
                {
                    "sent": "They don't matter.",
                    "label": 0
                },
                {
                    "sent": "So what?",
                    "label": 0
                },
                {
                    "sent": "It is so the you have some people really deeply believe in things like our RDF.",
                    "label": 0
                },
                {
                    "sent": "I'm not one of those people thought I'd share these groups.",
                    "label": 0
                },
                {
                    "sent": "On the other hand, I've strongly believe in open standards.",
                    "label": 0
                },
                {
                    "sent": "It's been the key success factor of the web.",
                    "label": 1
                },
                {
                    "sent": "So, and I think that's a nice point about WC.",
                    "label": 0
                },
                {
                    "sent": "If you've never seen that process, it's a public process where consensus really works.",
                    "label": 0
                },
                {
                    "sent": "It's sometimes tough and it takes some time.",
                    "label": 0
                },
                {
                    "sent": "Don't expect it to finish in a few weeks, but it's really nice to see an it's.",
                    "label": 0
                },
                {
                    "sent": "Most of you well are too young to remember the time before the web when we had the Microsoft of the world, which were always having all these proprietary formats.",
                    "label": 0
                },
                {
                    "sent": "You could never do anything with data even if there was no web you couldn't even even if there had been a web, there would be no way to integrate all the information we had.",
                    "label": 0
                },
                {
                    "sent": "Because they were all in different binary formats.",
                    "label": 0
                },
                {
                    "sent": "The fact that we now have all these interoperable textual, at least at syntactic level compatible formats, is due to the web.",
                    "label": 0
                },
                {
                    "sent": "And as you do to the fact that we have open standards, so that's really very important.",
                    "label": 0
                },
                {
                    "sent": "However, that's the danger will come back to a number of times.",
                    "label": 0
                },
                {
                    "sent": "This talk with computer scientists.",
                    "label": 0
                },
                {
                    "sent": "If we go into standardization, we tend to over design.",
                    "label": 0
                },
                {
                    "sent": "We are always would've called trigger happy.",
                    "label": 0
                },
                {
                    "sent": "We want to we have all our techniques and want to apply them.",
                    "label": 0
                },
                {
                    "sent": "So being laid back being just very.",
                    "label": 0
                },
                {
                    "sent": "Where of?",
                    "label": 0
                },
                {
                    "sent": "The minimal you need to do and just doing that is very important.",
                    "label": 0
                },
                {
                    "sent": "Just to give you some.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Idea of what a process like this large group entails, and all the groups are more or less similar.",
                    "label": 0
                },
                {
                    "sent": "So you get something like 8000 messages within the list.",
                    "label": 0
                },
                {
                    "sent": "You get about 2000 messages about external comments from people.",
                    "label": 1
                },
                {
                    "sent": "We had more than 125 teleconference is one of our and we had quite a number of issues that we had to resolve.",
                    "label": 0
                },
                {
                    "sent": "So this is a complex process.",
                    "label": 0
                },
                {
                    "sent": "And it's nice that it always comes together.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Enough about WC.",
                    "label": 0
                },
                {
                    "sent": "I'm going to talk about web.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Data representation.",
                    "label": 0
                },
                {
                    "sent": "Again, this warning sign representation languages are there for you.",
                    "label": 1
                },
                {
                    "sent": "And not the other way around.",
                    "label": 1
                },
                {
                    "sent": "When we designed our remembered very well, there were some people who try to begin stage with try to use all to represent word net.",
                    "label": 0
                },
                {
                    "sent": "And they had decided that had to use LDL.",
                    "label": 0
                },
                {
                    "sent": "And of course, Wordnet has a built-in meta level.",
                    "label": 0
                },
                {
                    "sent": "So there's no way in the first version of the later on has been repaired, but the first version of LDL didn't allow meta level and they were trying to do it.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you try to do that then you always have to force to make one or more decisions that are wrong and you can do it one way or the other way, but so is wrong and they were literally trembling.",
                    "label": 0
                },
                {
                    "sent": "And the fact that they were not able to use this language and thought it was their fault.",
                    "label": 0
                },
                {
                    "sent": "So that's that's very important to realize.",
                    "label": 0
                },
                {
                    "sent": "Rep stations are just tools.",
                    "label": 0
                },
                {
                    "sent": "The only thing they are and if they don't fit well, well, maybe just have to live with it or take another two.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But before I go into this membranes, I think it's also good to realize that other places in the web semantics have become more important or a different kind of semantics.",
                    "label": 0
                },
                {
                    "sent": "HTML5, which by the way was enormous fight in the end became a. I think a really nice thing with a lot of semantics.",
                    "label": 0
                },
                {
                    "sent": "It's what we call structural semantics.",
                    "label": 0
                },
                {
                    "sent": "It has all these new notions that tell us something about how a document is structured.",
                    "label": 0
                },
                {
                    "sent": "This notion of article section so and.",
                    "label": 1
                },
                {
                    "sent": "This actually completes the whole idea of Tim Berners Lee when he designed the web to have this complete separation of content and mark and Style style markup.",
                    "label": 1
                },
                {
                    "sent": "So this is the content.",
                    "label": 1
                },
                {
                    "sent": "This is stuff so now HTML5 purely does the content, markup, and CSS completely used for style.",
                    "label": 0
                },
                {
                    "sent": "HTML5 is, I think, a big leap forward and it's very easy to use.",
                    "label": 0
                },
                {
                    "sent": "I teach this first Web technology course to students of computer science curriculum.",
                    "label": 0
                },
                {
                    "sent": "Very different backgrounds and now I find it much easier to give the course then the times when we had to teach HTML 4.",
                    "label": 0
                },
                {
                    "sent": "And something so this is also very semantic actually.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Also a different type.",
                    "label": 0
                },
                {
                    "sent": "OK, moving to RDF.",
                    "label": 0
                },
                {
                    "sent": "So what do we do in the.",
                    "label": 0
                },
                {
                    "sent": "In the last revision group.",
                    "label": 0
                },
                {
                    "sent": "Well, not much to be honest we.",
                    "label": 0
                },
                {
                    "sent": "We particularly designed new syntaxes, but the abstract model of RDF stayed the same, so that means so you have many ways of writing down graphs, But this kind of pictures you can always drop them.",
                    "label": 0
                },
                {
                    "sent": "By the way, this is a picture from the primer.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Going to make some self promotion by saying that we have a new primer which is very short.",
                    "label": 0
                },
                {
                    "sent": "You can read it within an hour.",
                    "label": 0
                },
                {
                    "sent": "As written by Ephraim or myself, and we have all these nice examples which are very understandable, I think.",
                    "label": 0
                },
                {
                    "sent": "So I advise that to you as a kind of easy introduction if you want to have it.",
                    "label": 0
                },
                {
                    "sent": "OK, so we have this kind of.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graphs the main conceptual new thing that we introduced in RDF 1.1 is the fact that you can carve up graphs in subgraphs.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so here.",
                    "label": 0
                },
                {
                    "sent": "Well this is not very nice to to cut Mona Lisa.",
                    "label": 0
                },
                {
                    "sent": "It's meant that she is actually part of two different graphs, but on the left we have a graph on the right we have a graph.",
                    "label": 0
                },
                {
                    "sent": "OK, this actually also makes very clear that RDF the only thing that it does it's type information.",
                    "label": 0
                },
                {
                    "sent": "It labels the graph the web resources with type information, web resources and web links with type information.",
                    "label": 0
                },
                {
                    "sent": "But what you can do now is you can say OK this is a sub graph and you can give it a name WHI is that important?",
                    "label": 0
                },
                {
                    "sent": "Well this important because you want to have a structured way of saying something about a sub graph.",
                    "label": 0
                },
                {
                    "sent": "Think of, for instance, the Bridge Museum wanting to say something about a book or.",
                    "label": 0
                },
                {
                    "sent": "The Rosetta, the Rosetta Stone.",
                    "label": 0
                },
                {
                    "sent": "They want to attach.",
                    "label": 0
                },
                {
                    "sent": "Metadata provenance information.",
                    "label": 0
                },
                {
                    "sent": "All kinds of stuff to this, so the fact that you can talk about subgraphs, give them a name, and then have other statements that say something about the graph.",
                    "label": 0
                },
                {
                    "sent": "That's crucial, new distinction in the RDF model, by the way, this led to endless discussions in the group about the formal meaning of this.",
                    "label": 0
                },
                {
                    "sent": "I won't bother you with that.",
                    "label": 0
                },
                {
                    "sent": "If you're interested, look up the discussions actually from a social scientist would be very interesting to study.",
                    "label": 0
                },
                {
                    "sent": "The interactions that occur in such groups.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Yeah syntax, so syntax is just the vehicle here.",
                    "label": 0
                },
                {
                    "sent": "They used to be only XML syntax with everybody cursed.",
                    "label": 0
                },
                {
                    "sent": "There now in total 5 two of them already were developed overtime.",
                    "label": 0
                },
                {
                    "sent": "I think the main addition is number 4.",
                    "label": 0
                },
                {
                    "sent": "So the Jason based syntax is really something that helps opening this.",
                    "label": 0
                },
                {
                    "sent": "The whole RDF worlds to the general web world, and I see.",
                    "label": 0
                },
                {
                    "sent": "So I think of these 5 Jason one is the one that has the highest number of new adopters.",
                    "label": 0
                },
                {
                    "sent": "I see many people trying, so to give you some idea for people who are aware of Jason will have to.",
                    "label": 0
                },
                {
                    "sent": "OK can you see this?",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "This is really kind of piece which almost looks like Jason.",
                    "label": 0
                },
                {
                    "sent": "There's actually a couple of things that are specific, But most Jason developers will will have a good sense of what it means, but it stands for so Jason for who?",
                    "label": 0
                },
                {
                    "sent": "For those who don't know, this is really a very simple kind of property value kind of notation.",
                    "label": 0
                },
                {
                    "sent": "Which is which is widely used, so I think this is one of the biggest steps.",
                    "label": 0
                },
                {
                    "sent": "It's very practical in the sense it is.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Lot of the definitions are actually hidden in the context, so if you there is ways of using Jason, but I think the best way is actually to make it look very much like common Jason with only a few special things like you see the one with the ampersands.",
                    "label": 0
                },
                {
                    "sent": "But the.",
                    "label": 0
                },
                {
                    "sent": "@ sorry.",
                    "label": 0
                },
                {
                    "sent": "And the.",
                    "label": 0
                },
                {
                    "sent": "Just keep it looking like Jason, so I think that's one of the main things that we.",
                    "label": 0
                },
                {
                    "sent": "Practical products that we delivered.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is something you heard earlier this week.",
                    "label": 0
                },
                {
                    "sent": "So what the various things that you have in RDF and OWL to model.",
                    "label": 0
                },
                {
                    "sent": "So assuming that you can do this typing, So what kind of modeling constructs do you have for?",
                    "label": 0
                },
                {
                    "sent": "Those types you see the list of RDF and write the list of all on the sorry.",
                    "label": 0
                },
                {
                    "sent": "The list of RDF on the left.",
                    "label": 0
                },
                {
                    "sent": "The other list on the right.",
                    "label": 1
                },
                {
                    "sent": "One of the most powerful features of RDF is this whole notion of property hierarchy.",
                    "label": 0
                },
                {
                    "sent": "There's actually something you don't see in database modeling in most systems, so into a male you have the notion of Association class.",
                    "label": 0
                },
                {
                    "sent": "That's comes close, not really, but it's a very powerful mechanism, in particular because it allows you to specialize properties.",
                    "label": 0
                },
                {
                    "sent": "Yeah, if you have specific things you can specialize properties and attach your own domain specific ones, but in general.",
                    "label": 0
                },
                {
                    "sent": "I strongly prefer that you not look at this as two different 2 languages.",
                    "label": 0
                },
                {
                    "sent": "You have to choose one in practice.",
                    "label": 0
                },
                {
                    "sent": "Well, I should say that there's hardly any pickup of Al as a whole.",
                    "label": 0
                },
                {
                    "sent": "How I view hours?",
                    "label": 0
                },
                {
                    "sent": "It's useful to pick a few parts that you can use, for instance, a mass of transitive or infers are very useful.",
                    "label": 0
                },
                {
                    "sent": "Some people use other parts, but using it as a whole I think is so.",
                    "label": 0
                },
                {
                    "sent": "Maybe there's some applications, but there's certainly not large.",
                    "label": 0
                },
                {
                    "sent": "Take up of that.",
                    "label": 0
                },
                {
                    "sent": "So just take the selection that you need for your particular problem and that you'll be fine usually.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, this is actually very old slide of mine, but it's worth repeating.",
                    "label": 0
                },
                {
                    "sent": "So anything you've heard about ontology engineering, so ontologies are there for sharing.",
                    "label": 1
                },
                {
                    "sent": "That means that creating your own ontology is, in a sense a contradiction in terms.",
                    "label": 1
                },
                {
                    "sent": "Well, you shared with yourself, but that's not really much sharing.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The language security Ontology and is completely independent of whether it is an ontology, whether some people.",
                    "label": 0
                },
                {
                    "sent": "Think that if they write something and now they create an ontology, that's that's a complete falsehood.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so that's.",
                    "label": 0
                },
                {
                    "sent": "You can write it in texts and it will still if other people share.",
                    "label": 0
                },
                {
                    "sent": "These concepts will still be ontology.",
                    "label": 0
                },
                {
                    "sent": "That's that's the key thing, and now it's activating a bit, but that's how it works.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, for this I think the so this is probably.",
                    "label": 0
                },
                {
                    "sent": "Something that, in terms of sharing knowledge, has been become one of the key vehicles this course.",
                    "label": 0
                },
                {
                    "sent": "Was actually started whole negative by Libby Miller, Dan Brickley, another miles in one of the small, very small European projects, which is actually some point cut short by the Commission.",
                    "label": 0
                },
                {
                    "sent": "Think very wrongly, because the Commission actually funded many semantic web projects in Europe that had hardly any impact on the world discussed project did have that was, but they were captured.",
                    "label": 0
                },
                {
                    "sent": "So so much for the Commission to understand what kind of EU research said that they should fund scores is very important because it does a very simple thing.",
                    "label": 0
                },
                {
                    "sent": "There is on the web and also off the web.",
                    "label": 0
                },
                {
                    "sent": "There is a lot of information already available about categories that we can use to describe our resources to label our graphs and those things have been gathered over years by.",
                    "label": 0
                },
                {
                    "sent": "The British Museum by many.",
                    "label": 0
                },
                {
                    "sent": "By libraries.",
                    "label": 0
                },
                {
                    "sent": "By archives.",
                    "label": 0
                },
                {
                    "sent": "But by many organizations almost.",
                    "label": 0
                },
                {
                    "sent": "Any organization or government will have some kind of a cabarita to describe his business, its concepts and so on.",
                    "label": 0
                },
                {
                    "sent": "What's cause does it have provides a very simple way of making those.",
                    "label": 0
                },
                {
                    "sent": "Classification schemes, as they are usually called available on the web.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and so it very quickly quite a number of those were published.",
                    "label": 0
                },
                {
                    "sent": "It's the biggest shakeup has been in the library world.",
                    "label": 0
                },
                {
                    "sent": "On the key resources, for instance, is that the whole Library of Congress subject names are available.",
                    "label": 1
                },
                {
                    "sent": "Through skulls, that means you can use all these labels that fly with Congress has to tag books.",
                    "label": 0
                },
                {
                    "sent": "On the web, that's really great.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I think the.",
                    "label": 0
                },
                {
                    "sent": "The whole key success factor of skulls has been its simplicity.",
                    "label": 1
                },
                {
                    "sent": "It's very easy actually.",
                    "label": 0
                },
                {
                    "sent": "The main things are here.",
                    "label": 0
                },
                {
                    "sent": "You can do some simple.",
                    "label": 0
                },
                {
                    "sent": "A hierarchical ordering without it's having the specific subclass interpretation usually has, but it's not required and there are a number of pragmatic documentation properties and so on.",
                    "label": 0
                },
                {
                    "sent": "There also separate linking properties or come back to those that the basis is extremely simple and people who are used to work in vocabulary fields and.",
                    "label": 0
                },
                {
                    "sent": "Organizations typically have people that maintain their for calories.",
                    "label": 0
                },
                {
                    "sent": "Are doing this like routinely actually in the?",
                    "label": 1
                },
                {
                    "sent": "In the library, world's people talk about Scots ification of their recovery, but people make a verb out of your.",
                    "label": 0
                },
                {
                    "sent": "Representation language that means is a good thing.",
                    "label": 0
                },
                {
                    "sent": "Now they're really using it.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But again, here, so that has been, I think.",
                    "label": 0
                },
                {
                    "sent": "This simplicity is again here the key factor, so we have to be.",
                    "label": 1
                },
                {
                    "sent": "Aware of our tendency to over design and to limit ourselves to the key thing.",
                    "label": 1
                },
                {
                    "sent": "So in this nice German phrase in the Bush ranking site leader Mr Germans here run.",
                    "label": 0
                },
                {
                    "sent": "In the limit, in the limit, yes.",
                    "label": 0
                },
                {
                    "sent": "The the master shows himself him or herself.",
                    "label": 0
                },
                {
                    "sent": "Through his slimming through the way he limits himself so it's much longer in English, I don't know in English, but that's that's very important.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so that about representation language, so be sure to view them as a tool and use them as.",
                    "label": 0
                },
                {
                    "sent": "As restrained as possible.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thinking about.",
                    "label": 0
                },
                {
                    "sent": "So when we apply them to a real domain.",
                    "label": 0
                },
                {
                    "sent": "We always have to be aware of this notion if we apply.",
                    "label": 0
                },
                {
                    "sent": "Our language is to labeling graphs and we want to have categories we have to understand that categories are actually.",
                    "label": 0
                },
                {
                    "sent": "There are a thing with three dimensions, so if you think about the concept, something we use to describe some of the world, like this chair or our laptop.",
                    "label": 1
                },
                {
                    "sent": "We have labels for this.",
                    "label": 0
                },
                {
                    "sent": "Like here for example musical instrument.",
                    "label": 0
                },
                {
                    "sent": "We have definitions for this.",
                    "label": 0
                },
                {
                    "sent": "This is called the intention.",
                    "label": 0
                },
                {
                    "sent": "We can describe what it is, but a chair is and we can give examples.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the three ways we can define.",
                    "label": 0
                },
                {
                    "sent": "Many people use only one of the dimensions.",
                    "label": 0
                },
                {
                    "sent": "For example the name.",
                    "label": 0
                },
                {
                    "sent": "If you just use the name, you hope that other people will have the same Association with the name.",
                    "label": 0
                },
                {
                    "sent": "OK, better keep this in mind if you.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Owl but you have to understand very well from Al is Al takes only the right hand view.",
                    "label": 1
                },
                {
                    "sent": "So the only thing that counts as a class definition or category definition now is the fact that you gave a number of examples that are part of the sets that forms this class.",
                    "label": 0
                },
                {
                    "sent": "You can call it an extensional definition an so you really put the emphasis on what a boundary is, so you assume that every category has a clear boundary in which members of that class fit members of the category, and members that, and Members who are not part of their class don't fit.",
                    "label": 1
                },
                {
                    "sent": "So there outside the boundary.",
                    "label": 0
                },
                {
                    "sent": "OK, that's a very you could almost say a philosophical stance on how you model the world.",
                    "label": 0
                },
                {
                    "sent": "It's I want to point you to one particular piece of work from cognitive psychology, which takes a slightly different standard, which I think is useful to view to.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be aware of.",
                    "label": 0
                },
                {
                    "sent": "So who's 30 of Russian categories?",
                    "label": 0
                },
                {
                    "sent": "Soda two OK.",
                    "label": 0
                },
                {
                    "sent": "So this comes more from the psychology fields so.",
                    "label": 0
                },
                {
                    "sent": "Eleanor Rosch takes the view that you categories are there for you to help organize the world.",
                    "label": 1
                },
                {
                    "sent": "We as we grow up, we learn categories to understand what's going on in our environment.",
                    "label": 1
                },
                {
                    "sent": "So there are tools for perception as well.",
                    "label": 0
                },
                {
                    "sent": "So a child learns, does this Papa this is Mama.",
                    "label": 1
                },
                {
                    "sent": "These are the categories and Russia's introduces, I think, very important notion of the basic level categories.",
                    "label": 0
                },
                {
                    "sent": "Those are the primary things that people use to categorize things.",
                    "label": 0
                },
                {
                    "sent": "It's the.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Chair stuff like that and so that you can actually find these by looking at the number of properties that various characteristics have not going to interval theory.",
                    "label": 0
                },
                {
                    "sent": "But it's important because if you look at some kind of high key categories that usually organized hierarchy, it's very useful to find what the basic level categories are.",
                    "label": 0
                },
                {
                    "sent": "There, not always.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Same, but OK. Let's hear this is an example from her original article.",
                    "label": 0
                },
                {
                    "sent": "So things like chairs and table lamps.",
                    "label": 0
                },
                {
                    "sent": "That's what she calls basic level categories now.",
                    "label": 0
                },
                {
                    "sent": "Then there are two.",
                    "label": 0
                },
                {
                    "sent": "Types of other categories one is.",
                    "label": 0
                },
                {
                    "sent": "The categories that come on top of this, which are more abstractions like furniture?",
                    "label": 0
                },
                {
                    "sent": "French selves an abstraction and you have specific get reset go below this now.",
                    "label": 0
                },
                {
                    "sent": "What is interesting for this specific categories?",
                    "label": 0
                },
                {
                    "sent": "They might require specific knowledge to for you to understand if you go, for instance for chairs and you go to a person who knows a lot about chairs, you might talk talk to you about Windsor chairs and then 15 subtypes of Windsor chairs.",
                    "label": 0
                },
                {
                    "sent": "So then you're outside any understanding of normal people.",
                    "label": 0
                },
                {
                    "sent": "You really need to be an expert, so understanding where is basic level categories.",
                    "label": 0
                },
                {
                    "sent": "Helps you to say to find the things that you should talk about with your audience and to also understand what kind of people what the normal people understand.",
                    "label": 0
                },
                {
                    "sent": "And the domain specific things.",
                    "label": 0
                },
                {
                    "sent": "If you want to use this, you have to be have to be sure that the person you're talking to is actually someone who is more knowledge than the common person about a particular.",
                    "label": 0
                },
                {
                    "sent": "About it about a particular category.",
                    "label": 0
                },
                {
                    "sent": "OK, so there's sometimes discussion.",
                    "label": 0
                },
                {
                    "sent": "She also gives.",
                    "label": 0
                },
                {
                    "sent": "The second example is actually always been a discussion.",
                    "label": 0
                },
                {
                    "sent": "Is the normal thing that people talk about the type of tree or a tree in itself?",
                    "label": 0
                },
                {
                    "sent": "Yeah, tree is a so I'm personally I'm very bad in anything that has to do with Flora.",
                    "label": 0
                },
                {
                    "sent": "So if you ask me, well maybe I will be able to do.",
                    "label": 0
                },
                {
                    "sent": "Birch maybe as well, but the rest of them.",
                    "label": 0
                },
                {
                    "sent": "A Maple three, probably not.",
                    "label": 0
                },
                {
                    "sent": "So so it can depend a bit on where you actually put the exact boundary, but it's it's a very interesting.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A distinction, and it's useful for you to have, so this also helps you to judge what are useful general category systems.",
                    "label": 0
                },
                {
                    "sent": "Yes, do you think that?",
                    "label": 0
                },
                {
                    "sent": "These are similar to Birkenstein.",
                    "label": 0
                },
                {
                    "sent": "Dissemblance yes, well, that's a long discussion to go more.",
                    "label": 0
                },
                {
                    "sent": "Yes, probably yes, but Russian comes from a very different perspective.",
                    "label": 0
                },
                {
                    "sent": "She comes really from the practical cognitive psychology experiments.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "But I think so, but it's good to realize all the popular.",
                    "label": 0
                },
                {
                    "sent": "Um, vocabularies that people use a lot sandwich if overs.",
                    "label": 0
                },
                {
                    "sent": "I think the prime example that's more or less the basis of many social networks.",
                    "label": 0
                },
                {
                    "sent": "Also popular because they're exactly specifying specified categories on these basic level.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so when we talk about people, their Mail accounts, all those are part of our common language.",
                    "label": 0
                },
                {
                    "sent": "Everybody understands this and that's, uh, so that's.",
                    "label": 0
                },
                {
                    "sent": "That's very important, by the way.",
                    "label": 0
                },
                {
                    "sent": "Here you see an important example of what I think makes.",
                    "label": 0
                },
                {
                    "sent": "They were.",
                    "label": 0
                },
                {
                    "sent": "RDF is really powerful, So what you can do?",
                    "label": 0
                },
                {
                    "sent": "Is that you can say OK, actually I have specific relationships here.",
                    "label": 0
                },
                {
                    "sent": "It's called, has parents.",
                    "label": 0
                },
                {
                    "sent": "And then say it's a it's a type of.",
                    "label": 0
                },
                {
                    "sent": "Nos relation Sonos is the general friend.",
                    "label": 0
                },
                {
                    "sent": "Relation Info Folk Knows is a kind of.",
                    "label": 0
                },
                {
                    "sent": "Phrasing itself, but both is defined at the level of basic level categories.",
                    "label": 0
                },
                {
                    "sent": "That's one of the reasons it's such a.",
                    "label": 0
                },
                {
                    "sent": "Well understood for kabeli.",
                    "label": 0
                },
                {
                    "sent": "It holds actually from.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Many of the others.",
                    "label": 0
                },
                {
                    "sent": "So for Dublin Core is maybe a bit more particular, but it's.",
                    "label": 1
                },
                {
                    "sent": "Is focused on people that do library descriptions.",
                    "label": 0
                },
                {
                    "sent": "So every person who is used to describing features of books and so on will recognize the features of Dublin Core and also there they've limited themselves to 15.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "Well nowadays are more.",
                    "label": 0
                },
                {
                    "sent": "Also some specializations, but they have limited themselves to a useful subset which works well.",
                    "label": 0
                },
                {
                    "sent": "OK, those are, So what?",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Currently I give you an example of very specific one.",
                    "label": 0
                },
                {
                    "sent": "This is one I do a lot of projects with museum.",
                    "label": 0
                },
                {
                    "sent": "That they use.",
                    "label": 0
                },
                {
                    "sent": "And to give you also some.",
                    "label": 0
                },
                {
                    "sent": "Indication of the richness of vocab list.",
                    "label": 0
                },
                {
                    "sent": "It is iconclass eyeglasses, a whole scheme actual grammar for describing scenes is biased towards Western scenes like religious scenes or mythological scenes and it allows you to describe things like what it says here says.",
                    "label": 0
                },
                {
                    "sent": "Bearing the head so so lifting the hat, one of my first applications was describing photographs of apes and I could describe the photograph that the eight was scratching his head.",
                    "label": 0
                },
                {
                    "sent": "So you know this funny pose that apes can have.",
                    "label": 0
                },
                {
                    "sent": "So there are these very rich description format set of categories that you can use, But this is particularly used by.",
                    "label": 0
                },
                {
                    "sent": "People who.",
                    "label": 0
                },
                {
                    "sent": "I describe Prince images in museum place like this.",
                    "label": 0
                },
                {
                    "sent": "This is not.",
                    "label": 0
                },
                {
                    "sent": "This is not basic level category, it's more what people use in specific environments.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So one of the key vocabularies that is currently under discussion is what Google has done with schema.org.",
                    "label": 0
                },
                {
                    "sent": "So in schema default DEF incorporated.",
                    "label": 0
                },
                {
                    "sent": "Actually many different vocabularies, so this is an example where they incorporated the BBC program ontology into schema.org.",
                    "label": 0
                },
                {
                    "sent": "Very interesting because it has been very successful in describing TV programs.",
                    "label": 1
                },
                {
                    "sent": "Of course, TV programs are very important part of the entertainment industry and of the web to be in the web is a very important theme at the moment, so they have.",
                    "label": 0
                },
                {
                    "sent": "What I've done in schema Doctor tried to characterize a lot of things that are useful for general search.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, radio programs.",
                    "label": 0
                },
                {
                    "sent": "The BBC and radio problems.",
                    "label": 0
                },
                {
                    "sent": "Yes, sure yeah.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So one of the issues there.",
                    "label": 0
                },
                {
                    "sent": "Well, first is what do you do with such kind of large schemas are they should be designed and top down.",
                    "label": 0
                },
                {
                    "sent": "Or bottom up so the web approach always been been a bit more bottom up, so there's no single architect who designs this, but people bring it together.",
                    "label": 0
                },
                {
                    "sent": "Of course, Google has done the opposite.",
                    "label": 0
                },
                {
                    "sent": "A bit, but they're not trying to incorporate things that are already available like I just saw, so there's a debate going on.",
                    "label": 0
                },
                {
                    "sent": "The second is who owns this and who controls this, and we can hook and extend it.",
                    "label": 0
                },
                {
                    "sent": "So that's I think one of the key battles that that needs to be thought about this.",
                    "label": 0
                },
                {
                    "sent": "So if we we don't want to get back to the situation pre Web, whether particular companies controlling how we look at data.",
                    "label": 0
                },
                {
                    "sent": "Yeah, on the other hand, schemes efforts like this are very worthwhile.",
                    "label": 0
                },
                {
                    "sent": "The Wonder people now behind this is Dan Brickley and he's.",
                    "label": 0
                },
                {
                    "sent": "He's one of the one of the people behind the semantic weapon, the weapon general.",
                    "label": 0
                },
                {
                    "sent": "So that's the person you can trust, but on the other hand is also.",
                    "label": 0
                },
                {
                    "sent": "Well, there's a whole issue set of political issues involved in designing these vocabularies and.",
                    "label": 0
                },
                {
                    "sent": "You also have to realize that what these things are used for at the moment I've mainly to support general search.",
                    "label": 1
                },
                {
                    "sent": "So there is a bias in there.",
                    "label": 0
                },
                {
                    "sent": "OK, so schema dork is is very useful in the beginning.",
                    "label": 0
                },
                {
                    "sent": "People in the Semantic web area was more or less discarding it as when they heard of it.",
                    "label": 0
                },
                {
                    "sent": "But I think it's a much more nuanced thing.",
                    "label": 0
                },
                {
                    "sent": "You have to really carefully look at this.",
                    "label": 0
                },
                {
                    "sent": "This is sort of.",
                    "label": 0
                },
                {
                    "sent": "This discussion is not over.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But we have to be very careful in thinking that vocabulary like schema or any other vocabularies solves our role.",
                    "label": 0
                },
                {
                    "sent": "Category problem.",
                    "label": 0
                },
                {
                    "sent": "So in in culture heritage have been many people have been designing the overall unified vocabulary like the Grand Unified theory of in physics, and they never achieve that.",
                    "label": 1
                },
                {
                    "sent": "I think, at least in our lifetimes, we have to live with the fact that we have many different views on the world and those fit with many different vocabularies.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "The only thing you can do.",
                    "label": 1
                },
                {
                    "sent": "Is do them partially align them where possible?",
                    "label": 0
                },
                {
                    "sent": "And that's already difficult enough.",
                    "label": 0
                },
                {
                    "sent": "So that's all you should try to achieve.",
                    "label": 0
                },
                {
                    "sent": "So if you have recovery, always assume it is limited, is biased in his limited, nothing wrong with that.",
                    "label": 0
                },
                {
                    "sent": "That's not a negative statement.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So alignment, so that's a very so you will see in computer science there quite a number of people who worked on alignment techniques.",
                    "label": 0
                },
                {
                    "sent": "How can we automatically find links between categories in one vocabulary and catches another account?",
                    "label": 0
                },
                {
                    "sent": "Because once we have these these alignments week and that helps a lot, that will show that later applications for using the semantics in practice.",
                    "label": 0
                },
                {
                    "sent": "So that's.",
                    "label": 0
                },
                {
                    "sent": "But if you think of alignment, you have to think of two different types of alignments, and those are very different in its nature.",
                    "label": 0
                },
                {
                    "sent": "In their nature, one is if you want to define alignments in categories.",
                    "label": 0
                },
                {
                    "sent": "Then you get confronted with a specific class of problems that I will talk about in a minute.",
                    "label": 0
                },
                {
                    "sent": "You also have alignments between real things in the world that have some identifier.",
                    "label": 0
                },
                {
                    "sent": "You, me.",
                    "label": 0
                },
                {
                    "sent": "Amaki so you might have to need for disintegration, but it's a thing that you can establish this well.",
                    "label": 0
                },
                {
                    "sent": "At least given the Observatory powers that we as humans have.",
                    "label": 0
                },
                {
                    "sent": "We just we assume we can establish with some certainty that today we are in kalamaki.",
                    "label": 0
                },
                {
                    "sent": "And not in a vacuum.",
                    "label": 0
                },
                {
                    "sent": "So things where you have to find identity so those are different in their nature.",
                    "label": 0
                },
                {
                    "sent": "They have a different type of alignment techniques.",
                    "label": 0
                },
                {
                    "sent": "I'll",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So there's a whole set of techniques that people work to bomb.",
                    "label": 0
                },
                {
                    "sent": "Again, here is.",
                    "label": 0
                },
                {
                    "sent": "Use these if you want to use.",
                    "label": 0
                },
                {
                    "sent": "If you're going to do some link data, want to align particular datasets ticker calories?",
                    "label": 0
                },
                {
                    "sent": "You should study these techniques but also use them as a kind of tools.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I've noticed that the most important part of using these techniques is to think about methodology.",
                    "label": 0
                },
                {
                    "sent": "When should I use what technique?",
                    "label": 0
                },
                {
                    "sent": "So some of these techniques are very complex.",
                    "label": 0
                },
                {
                    "sent": "Also very simple.",
                    "label": 0
                },
                {
                    "sent": "In some cases the simple techniques actually work best.",
                    "label": 0
                },
                {
                    "sent": "You also have to think of if you do alignments.",
                    "label": 0
                },
                {
                    "sent": "You always have this notion of the whole problem of.",
                    "label": 1
                },
                {
                    "sent": "Precision versus recall.",
                    "label": 0
                },
                {
                    "sent": "Yeah, how do you balance the two?",
                    "label": 0
                },
                {
                    "sent": "In that very much depends on the domain, so I've just been working in domain of.",
                    "label": 0
                },
                {
                    "sent": "Culture has domain of ults, archives of ships where we could, but we will.",
                    "label": 0
                },
                {
                    "sent": "We're finding alignments and the domain experts said, OK, we are interested only alignment sense almost absolutely right.",
                    "label": 0
                },
                {
                    "sent": "Surely rights.",
                    "label": 0
                },
                {
                    "sent": "So that means you go for very high precision and just accept that you don't find quite a number of.",
                    "label": 0
                },
                {
                    "sent": "Quite a number of links will be hidden, so using these techniques don't just go for one.",
                    "label": 0
                },
                {
                    "sent": "Don't be a kind of.",
                    "label": 0
                },
                {
                    "sent": "Apostle of 1 particular technique.",
                    "label": 0
                },
                {
                    "sent": "Just apply them and typically apply them maybe.",
                    "label": 0
                },
                {
                    "sent": "In repetition, several.",
                    "label": 0
                },
                {
                    "sent": "Different ones that you have.",
                    "label": 0
                },
                {
                    "sent": "You can find various papers for people who try to do this and apply this in a very kind of methodological way.",
                    "label": 0
                },
                {
                    "sent": "OK, so alignment techniques are very important, but.",
                    "label": 1
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Applied it with a kind of meta view.",
                    "label": 0
                },
                {
                    "sent": "If you do evaluation of alignments and I'm not talking about alignment information for the category level, you will notice that is actually not that easy if you ask people to say OK, I give you this picture and what do you see here?",
                    "label": 0
                },
                {
                    "sent": "Computer science typically assume that everybody will agree.",
                    "label": 0
                },
                {
                    "sent": "I've seen many alignment papers where there is one evaluator.",
                    "label": 0
                },
                {
                    "sent": "Namely, the person who wrote the paper he's looked at the pictures and said that this is a.",
                    "label": 0
                },
                {
                    "sent": "This is a Castle, this is.",
                    "label": 0
                },
                {
                    "sent": "This is not if you actually going to do that with several people.",
                    "label": 0
                },
                {
                    "sent": "You will notice that there is inherent difference between how people look at for example pictures.",
                    "label": 0
                },
                {
                    "sent": "There's a, there's a variety.",
                    "label": 0
                },
                {
                    "sent": "And this is actually well known in psychology research.",
                    "label": 0
                },
                {
                    "sent": "They even have measures for dislike, interobserver agreement, and so on in the beginning, certainly.",
                    "label": 0
                },
                {
                    "sent": "And we had a large alignment initiative in the semantic Web.",
                    "label": 0
                },
                {
                    "sent": "Many people were doing there.",
                    "label": 0
                },
                {
                    "sent": "Align with the information without even bothering about that.",
                    "label": 0
                },
                {
                    "sent": "So it is difficult for people.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To agree on categories.",
                    "label": 0
                },
                {
                    "sent": "And that's is another point.",
                    "label": 0
                },
                {
                    "sent": "I want to make about cat about categories.",
                    "label": 0
                },
                {
                    "sent": "There is a limit to.",
                    "label": 0
                },
                {
                    "sent": "Categorical thinking, so most people and is actually an extension theory of Roshan.",
                    "label": 0
                },
                {
                    "sent": "Well well phrased by Lakoff later.",
                    "label": 0
                },
                {
                    "sent": "They don't think of categories as things with sharp boundaries.",
                    "label": 0
                },
                {
                    "sent": "They think of categories as prototypes where things in reality are.",
                    "label": 0
                },
                {
                    "sent": "Closer or farther away from a particular prototype, you can see there's a Platonic idea.",
                    "label": 0
                },
                {
                    "sent": "Just never fully realized that you can get close to it.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so that's so.",
                    "label": 0
                },
                {
                    "sent": "The whole notion of category as we humans uses is not like the notion of category in description logic.",
                    "label": 0
                },
                {
                    "sent": "Humans are not description logic machines.",
                    "label": 0
                },
                {
                    "sent": "Please realize that.",
                    "label": 0
                },
                {
                    "sent": "So if you do some kind of category alignments, be aware that the few evaluate the results that there will be different interpretations an that's fine.",
                    "label": 0
                },
                {
                    "sent": "That's how it works.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "Here's another few lessons that I've learned while I'm doing this.",
                    "label": 0
                },
                {
                    "sent": "So I've been.",
                    "label": 0
                },
                {
                    "sent": "I've been designing myself quite a lot of hierarchies and so on.",
                    "label": 0
                },
                {
                    "sent": "In practice, I notice that on the web, if you do this kind of stuff on the web, you know hardly ever.",
                    "label": 0
                },
                {
                    "sent": "Readesign you use stuff that's available there and you're going to extend it specializes, alignment, whatever, but you leave it as it is.",
                    "label": 0
                },
                {
                    "sent": "Rule #1 leave it as it is.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of information out there.",
                    "label": 0
                },
                {
                    "sent": "Don't think that people have made mistakes in the past.",
                    "label": 0
                },
                {
                    "sent": "There's usually very good idea where something is modeled with a particular way.",
                    "label": 0
                },
                {
                    "sent": "OK, so use things as they are enriched in the line.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So if we do link data.",
                    "label": 0
                },
                {
                    "sent": "You have to do some conversion from the existing format, could be some database make smell to link data formats.",
                    "label": 0
                },
                {
                    "sent": "We've done it.",
                    "label": 0
                },
                {
                    "sent": "Many people have done it.",
                    "label": 0
                },
                {
                    "sent": "If you want to do this that quite a number of toolsets available nowadays that can help you do this.",
                    "label": 0
                },
                {
                    "sent": "Also there the main message is.",
                    "label": 0
                },
                {
                    "sent": "Indischen verse.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Process to link data.",
                    "label": 0
                },
                {
                    "sent": "Keep the original information.",
                    "label": 0
                },
                {
                    "sent": "Don't throw out things.",
                    "label": 0
                },
                {
                    "sent": "I mean when I did in 2005, the first conversion of the rights museum data, we got all the Rijksmuseum data.",
                    "label": 0
                },
                {
                    "sent": "Of Amsterdam converted them and we saw this property information.",
                    "label": 0
                },
                {
                    "sent": "I thought that's bullshit.",
                    "label": 0
                },
                {
                    "sent": "I don't need that.",
                    "label": 0
                },
                {
                    "sent": "I throw it away.",
                    "label": 0
                },
                {
                    "sent": "That was one of the biggest errors ever made, so be aware of that.",
                    "label": 0
                },
                {
                    "sent": "So keep was there.",
                    "label": 0
                },
                {
                    "sent": "And there's actually various mechanisms that allow you to do that.",
                    "label": 0
                },
                {
                    "sent": "One of the key decisions have to take is the whole URL, but it's outside the scope of this talk.",
                    "label": 0
                },
                {
                    "sent": "Their various nice best practice papers on this on what you should do in this conversion process.",
                    "label": 0
                },
                {
                    "sent": "Just want to point you to this overall issue.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And what you also want to do is involve people, so this is an example where sorry, this is a Dutch website.",
                    "label": 0
                },
                {
                    "sent": "We we worked with the so we have this national broadcasting archive.",
                    "label": 0
                },
                {
                    "sent": "Like any country has they used.",
                    "label": 0
                },
                {
                    "sent": "They used to be very small organizations nowadays.",
                    "label": 0
                },
                {
                    "sent": "You know the archives of TV and Radio are the new broadcasters.",
                    "label": 0
                },
                {
                    "sent": "With all these catch up services and everything, they are the main organizations.",
                    "label": 0
                },
                {
                    "sent": "Now in the TV landscape and.",
                    "label": 0
                },
                {
                    "sent": "They still have this tradition of describing all their programs.",
                    "label": 0
                },
                {
                    "sent": "And it typically takes if program one hour will typically take 4 hours of annotation efforts.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "In this digital world, what it archive everything.",
                    "label": 0
                },
                {
                    "sent": "Nowadays, that's not a sustainable scheme.",
                    "label": 0
                },
                {
                    "sent": "So crowdsourcing you've seen this.",
                    "label": 0
                },
                {
                    "sent": "You've heard about.",
                    "label": 0
                },
                {
                    "sent": "This is typically now used to describe such programs and involve people, so this is also a very important semantic web activity that you can help designing such tools, making sure people are motivated that I get something back from annotating these programs and also.",
                    "label": 0
                },
                {
                    "sent": "But there's also technical challenges there once people describe this, how do we?",
                    "label": 0
                },
                {
                    "sent": "How do we match that?",
                    "label": 0
                },
                {
                    "sent": "Again, alignment problem with the current existing practice for documenting TV programs in archives, which is typically also recovery based, so there's quite a number of interesting technological challenges there.",
                    "label": 0
                },
                {
                    "sent": "To do.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In terms of categorization, in fact, when you get labels, you have to think of how they match to categories and then maybe presented back.",
                    "label": 0
                },
                {
                    "sent": "Ask people.",
                    "label": 0
                },
                {
                    "sent": "So we for instance here, decided that we do two things.",
                    "label": 0
                },
                {
                    "sent": "We had games for people with tag, the video and other games so people could disambiguate the categories that we derived from this CEO.",
                    "label": 0
                },
                {
                    "sent": "Is this right?",
                    "label": 0
                },
                {
                    "sent": "Yes, OK, and that people would call this gardening.",
                    "label": 0
                },
                {
                    "sent": "So this is a various way two ways in which the crowd sourcing techniques that you talked.",
                    "label": 0
                },
                {
                    "sent": "That you talked earlier about this week can be applied in this way to improve semantics.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "They also so.",
                    "label": 0
                },
                {
                    "sent": "One advantage here in this particular case was that we also have now information about when something happens, typically when video TV archives check their programs.",
                    "label": 0
                },
                {
                    "sent": "They don't tag it time and time to just say something about the program as a whole.",
                    "label": 0
                },
                {
                    "sent": "OK one.",
                    "label": 0
                },
                {
                    "sent": "More recent.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Object.",
                    "label": 0
                },
                {
                    "sent": "It's which we are now doing with the Rice Museum is also using this crowdsourcing, but actually in a slightly different fashion, and I've turned the Tierney sourcing.",
                    "label": 0
                },
                {
                    "sent": "You see this picture.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "We are the racism is not interested in knowing that this is a woman there.",
                    "label": 0
                },
                {
                    "sent": "Yeah, leave out the kind of more obscure remark at the bottom.",
                    "label": 0
                },
                {
                    "sent": "They are interested in a few pockets of people who know a lot about this.",
                    "label": 0
                },
                {
                    "sent": "Now, apparently there should be a frog there by my side count.",
                    "label": 0
                },
                {
                    "sent": "The flock at the bottom of the picture, yeah?",
                    "label": 1
                },
                {
                    "sent": "Experts tell me the fork stands for rejected lover under the woman represents the court's arm.",
                    "label": 1
                },
                {
                    "sent": "Yeah, so the regular team is not interested in the majority vote on this would be interested in the minority vote.",
                    "label": 0
                },
                {
                    "sent": "The few people who actually know this.",
                    "label": 0
                },
                {
                    "sent": "So this is also actually very interesting research issue.",
                    "label": 0
                },
                {
                    "sent": "It touches on trust.",
                    "label": 0
                },
                {
                    "sent": "How can we derive from behavior of annotators, whether they are trustworthy?",
                    "label": 0
                },
                {
                    "sent": "So there's a whole range of computer science things that you can study for this particular problem.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and it turns out to actually quite a lot of people who like to do this.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this right, some doesn't have the people to do all these annotations to have 700,000 prints that they want to digitize and describe.",
                    "label": 0
                },
                {
                    "sent": "They don't have the resources.",
                    "label": 0
                },
                {
                    "sent": "No museum nowadays has these resources.",
                    "label": 0
                },
                {
                    "sent": "This is the way to involve users with it, and we just compute Sciences can help.",
                    "label": 0
                },
                {
                    "sent": "This invigorating the semantics that is provided by those users.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is our interface.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Soul.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Briefly, go through is something so OK. We have all these categories an Please remember all the caveats I gave you.",
                    "label": 0
                },
                {
                    "sent": "So we have a number of.",
                    "label": 0
                },
                {
                    "sent": "We have a graph.",
                    "label": 0
                },
                {
                    "sent": "That provides labels type information of.",
                    "label": 0
                },
                {
                    "sent": "Resources and links between them.",
                    "label": 0
                },
                {
                    "sent": "What do we do with them?",
                    "label": 0
                },
                {
                    "sent": "Not one so.",
                    "label": 0
                },
                {
                    "sent": "One thing is that we can do is do visualization.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's the simplest way.",
                    "label": 0
                },
                {
                    "sent": "Often we add to visualization some kind of selection based on, for instance, personal preferences.",
                    "label": 0
                },
                {
                    "sent": "This is 1.",
                    "label": 0
                },
                {
                    "sent": "The first demos are made for the Rights Museum.",
                    "label": 0
                },
                {
                    "sent": "So if you go.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure what you do when you go to a museum.",
                    "label": 0
                },
                {
                    "sent": "But often you see that people who go to a museum, they start at the beginning and then go through the whole museum and the second part is just walking quickly through rooms because they're too tired to look at anything.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it would be much nicer if you can have a real walk through a selected part of the museum that you are well so we have still have many museums.",
                    "label": 0
                },
                {
                    "sent": "Still have these audio tools.",
                    "label": 0
                },
                {
                    "sent": "But of course it would be very easy.",
                    "label": 0
                },
                {
                    "sent": "Technically it's very simple to all these paintings.",
                    "label": 0
                },
                {
                    "sent": "Usually it's very easy to attach some kind of RFID.",
                    "label": 0
                },
                {
                    "sent": "Sends it to them and then use.",
                    "label": 0
                },
                {
                    "sent": "A mobile phone to navigate to the right parts of the museum to give people a personalized tour.",
                    "label": 0
                },
                {
                    "sent": "So that's actually technically that turns out to be very easy.",
                    "label": 0
                },
                {
                    "sent": "Still practically, it has to be realized in many cases, but it's certainly something where visualization of semantics can enormously help.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is another case where we used semantics and visualization.",
                    "label": 0
                },
                {
                    "sent": "You remember all the piracy attacks in the Red Sea?",
                    "label": 0
                },
                {
                    "sent": "Yeah, so this is a you should see this life.",
                    "label": 0
                },
                {
                    "sent": "Sorry I've not didn't dare to do a live connection here, but this is actually alive simulation of what happened to piracy attacks in the Red Sea when the corridor was formed.",
                    "label": 0
                },
                {
                    "sent": "At some point the nations that were.",
                    "label": 0
                },
                {
                    "sent": "That were.",
                    "label": 0
                },
                {
                    "sent": "Did like the ships being attacked.",
                    "label": 0
                },
                {
                    "sent": "They formed a corridor with military ships guarding the trade ships.",
                    "label": 0
                },
                {
                    "sent": "What do you think happened to piracy attacks?",
                    "label": 0
                },
                {
                    "sent": "You could have shown in assimilation?",
                    "label": 0
                },
                {
                    "sent": "What do you think would happen?",
                    "label": 0
                },
                {
                    "sent": "What did it do with the parts?",
                    "label": 0
                },
                {
                    "sent": "That jumped on it, so they because the corridor was just too big, then we're not even off ships to protect them.",
                    "label": 0
                },
                {
                    "sent": "So certainly the parts knew exactly where the ships were jumping on this corridor, and there was enormous increase in attacks.",
                    "label": 0
                },
                {
                    "sent": "It's very nice to do this.",
                    "label": 0
                },
                {
                    "sent": "This simulation was made purely by scraping web data and putting things together, so that's the things kind of things we can do.",
                    "label": 0
                },
                {
                    "sent": "With our date.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "By the way, very important, and I think I saw people already mentioning this, certainly was a markers talk.",
                    "label": 0
                },
                {
                    "sent": "Very much.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "If you look at the kind of representations we need, we tend to think of objects that we need to describe, maybe even more important is the notion of events.",
                    "label": 0
                },
                {
                    "sent": "What happens at a particular point in time?",
                    "label": 0
                },
                {
                    "sent": "So at the moment you see various different descriptions on the web version of how you should describe events.",
                    "label": 0
                },
                {
                    "sent": "Typically very simple with some kind of time and place an actor and but event models at this moment are very important, describing what happens in the web, so that's why you see next to him.",
                    "label": 0
                },
                {
                    "sent": "Objects many types of event descriptions nowadays.",
                    "label": 0
                },
                {
                    "sent": "Sis.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Also something which you can do with semantics is this is.",
                    "label": 0
                },
                {
                    "sent": "You could have this as a kind of general description of a of a museum.",
                    "label": 1
                },
                {
                    "sent": "This is actually one of the nicest.",
                    "label": 0
                },
                {
                    "sent": "I'm not such a Picasso fan, but this one room with a fan I really like was in Amsterdam.",
                    "label": 0
                },
                {
                    "sent": "The museum a few years ago.",
                    "label": 0
                },
                {
                    "sent": "What you can do with your semantics is add to the current presentation that museum done so you would click on this and can't give the demo here.",
                    "label": 0
                },
                {
                    "sent": "You will actually get to a whole web of information.",
                    "label": 0
                },
                {
                    "sent": "About because so and the various aspects, and that's the kind of things we can do so.",
                    "label": 0
                },
                {
                    "sent": "Without semantics.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But more interesting, and I think this is really an unexplored area, and if you want to do some extra work in your thesis on this kind of stuff, I think there's plenty of opportunity is thinking how you use the semantics for search.",
                    "label": 0
                },
                {
                    "sent": "What everybody tries to do is to kind of mimic Google.",
                    "label": 0
                },
                {
                    "sent": "I don't think that's a good idea.",
                    "label": 0
                },
                {
                    "sent": "There's many reasons why you would be able to do other types of things.",
                    "label": 0
                },
                {
                    "sent": "Other types of search.",
                    "label": 0
                },
                {
                    "sent": "This is 1 search algorithm, but I'm not saying this is.",
                    "label": 0
                },
                {
                    "sent": "This is the best or just an example.",
                    "label": 0
                },
                {
                    "sent": "There are many alternatives for this that we have used to explore graphs that describe large virtual museum collections and where we go to a path and try to find if you type in a string like because so.",
                    "label": 0
                },
                {
                    "sent": "Or maybe some other painter?",
                    "label": 0
                },
                {
                    "sent": "Now you go through the graph and then find.",
                    "label": 0
                },
                {
                    "sent": "Interesting, relevant resources, but do something interesting semantically with them.",
                    "label": 0
                },
                {
                    "sent": "This whole notion of how do you, which path to take, how to cluster results, how to generalize path and graphs, how to find patterns in graphs but.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Don't get things like OK, we have a Picasso museum.",
                    "label": 0
                },
                {
                    "sent": "We have that one is not here, but there's actually something like because some marble which you could group together.",
                    "label": 0
                },
                {
                    "sent": "Semantic search can help you reorganize your search results in sets of clusters.",
                    "label": 0
                },
                {
                    "sent": "One possible application of semantics I don't see enough yet of that kind of work in our field, so that's certainly something that many PC's are still can be OK.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'll do it.",
                    "label": 0
                },
                {
                    "sent": "All these.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then OK, well as I lost as my last example, I will show this.",
                    "label": 0
                },
                {
                    "sent": "So I talked about alignment.",
                    "label": 0
                },
                {
                    "sent": "Yeah, why is alignment so important?",
                    "label": 0
                },
                {
                    "sent": "Well, a few links already can do a lot of tricks.",
                    "label": 0
                },
                {
                    "sent": "I'll give you this example is also from a culture here.",
                    "label": 0
                },
                {
                    "sent": "This is from a real life demo I gave to a set of a collection of ethnographic museum.",
                    "label": 0
                },
                {
                    "sent": "So they had this problem and.",
                    "label": 0
                },
                {
                    "sent": "They had several different vocabularies and were wondering whether we useful to link those.",
                    "label": 0
                },
                {
                    "sent": "So here was a real life problem that I had, so suppose someone types into carbon.",
                    "label": 0
                },
                {
                    "sent": "I'm not a Japanese expert, but apparently this is a.",
                    "label": 0
                },
                {
                    "sent": "This is a kind of term for a Shogun which is also a term for a kind of stylistic.",
                    "label": 0
                },
                {
                    "sent": "At the time in Tokyo was still called Edo.",
                    "label": 0
                },
                {
                    "sent": "OK, if you not suppose you type in this term an this picture.",
                    "label": 0
                },
                {
                    "sent": "Actually this painting.",
                    "label": 0
                },
                {
                    "sent": "Matches the query.",
                    "label": 0
                },
                {
                    "sent": "But there is is not labeled with this term.",
                    "label": 0
                },
                {
                    "sent": "Now, so that is not the case.",
                    "label": 0
                },
                {
                    "sent": "However, the term appears in a very well known vocabulary which now, by the way, by the Cat Fund Foundation being published as linked data.",
                    "label": 0
                },
                {
                    "sent": "On the web it's called the art and architecture to service.",
                    "label": 0
                },
                {
                    "sent": "It will have two alternative labels for this to garbage service, either Edo or to Baba.",
                    "label": 0
                },
                {
                    "sent": "Now their own desirous of this collection had only determined to.",
                    "label": 0
                },
                {
                    "sent": "Once you have the link, yeah you can make this link.",
                    "label": 0
                },
                {
                    "sent": "You can make the connection and retrieve the resource so by providing a few links you commend make many interconnections.",
                    "label": 0
                },
                {
                    "sent": "By the way, because all these vocabularies are typically multi lingual.",
                    "label": 0
                },
                {
                    "sent": "It also allows you to do multilingual search.",
                    "label": 0
                },
                {
                    "sent": "If you go to geographical vocabularies it will have.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "So you learn assessoria TGN disorders of geographic names has like 12 different names for the city, like Regensburg in Germany.",
                    "label": 0
                },
                {
                    "sent": "Yeah so every.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "For the painter Rembrandt, they're like 42 spelling variations.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so all these things, once you have these resources and you have linked them, you have an enormous semantic.",
                    "label": 0
                },
                {
                    "sent": "You have enormous power that the semantics gives you in retrieving more results.",
                    "label": 0
                },
                {
                    "sent": "OK, I think this source is very.",
                    "label": 0
                },
                {
                    "sent": "A port is still used and should be used a lot more.",
                    "label": 0
                },
                {
                    "sent": "I'm going to leave it at this, so I hope I'll give you some idea of.",
                    "label": 0
                },
                {
                    "sent": "The whole notion of categorization, how you could represent them, and what you can do with them on the web.",
                    "label": 0
                },
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                }
            ]
        }
    }
}