{
    "id": "u3kuzaznigyvzdkrzufjqhqggayxpj7i",
    "title": "Spatio-temporal data mining: Part 1",
    "info": {
        "author": [
            "Donato Malerba, Department of Computer Science, University of Bari"
        ],
        "published": "Jan. 31, 2017",
        "recorded": "September 2016",
        "category": [
            "Top->Computer Science",
            "Top->Data Science"
        ]
    },
    "url": "http://videolectures.net/miningdata2016_malerba_data_mining/",
    "segmentation": [
        [
            "This summer school, which is a really interesting build circuits, a Channel 4 or the content that.",
            "Haven't been supporting the program.",
            "And then let me just briefly introduce myself, I'm professor.",
            "Everybody, I'm probably, you know whatever it is because it really is has been involved in the master project which is the European project which is funding this score well.",
            "The goal.",
            "The main topic of this presentation is spatial temporal data mining, and this presentation will be split in two parts.",
            "The first part could be given by myself and the second part.",
            "Anna Lisa mature.",
            "My.",
            "Presentation will."
        ],
        [
            "Interviews with entry introduce the special temporal data mining will be and will be more at the level of a tutorial.",
            "And then I'll explain the main challenges that some challenges and the special temporal data mining.",
            "And I will provide some pointers to teacher and then in the second part there is.",
            "I will go deep into data mining tasks and also in.",
            "That needs some and he will show some results with that.",
            "So she will present more results from.",
            "Our research group."
        ],
        [
            "Well, the first part will be more or less with follow is.",
            "So the percentage is set of concepts is special modeling spatial relationships crossing the autocorrelation specially trained in statistical approach or religion approach and the special temporal data mining tasks."
        ],
        [
            "Well, I'll go deeply into concept about special temporal data mining.",
            "If I should define special controller minus the.",
            "Would that apply this same definition used for data mining?",
            "The only change in the final words because special temporal data mining is in the process of discovering interesting and previously unknown but potentially useful to conference from spatial temporal data.",
            "So what's make what makes it different?",
            "Difference here is the kind of input and.",
            "With the recent differences with respect to the plastic bottom lining up."
        ],
        [
            "Roaches why special temporal objects are?",
            "Challenging those they include to at least two properties.",
            "One is a special property and the other one is a temporal property which introduce some themselves.",
            "They introduce normal in some of these years.",
            "Later issue I'll explain later.",
            "I'm an example of a special printer object can be next week.",
            "Heard of the sad news.",
            "For instance, a problem.",
            "Drama central Italy where we had this earthquake few weeks ago.",
            "Two weeks ago.",
            "And in the description of an earthquake we can have a number of.",
            "Non spatial and non temporal afterwards, but we have.",
            "For sure at this conditional special property where the earthquake and as.",
            "Data center over the sort of geographical coordinates over the epicenter of the earthquake and also you have information on when the earthquake happened.",
            "But you can also have in the description of an earthquake more than one week special property.",
            "For instance, if you might be interested not only on where but where you have.",
            "On our information not only on the epicenter but also where the where damages and reliable at different level of.",
            "Severity and.",
            "You can also have a several temporal attributes, not only when it happened, but also regulation for instance.",
            "So at least in a special temporal object, you'll have one special property in one temple."
        ],
        [
            "The complexity of this thing and special temporal objects is one of the main challenges of the spatial temporal data mining.",
            "And the reason is that the special temporal data.",
            "For which special temporal leader complexes that include discrete representations of phenomenon which are continuous in space and time.",
            "And this introduces."
        ],
        [
            "On issues.",
            "Before explaining how we can account for.",
            "And how we can manage it?",
            "Some of these issues, most one just do interviews.",
            "How does spatial information can be actually modeled and how the temporal information can be actually modeled?",
            "This is essential because according to the different models we have according to different ways we have to mother at the special information obtainable information in their combination we can have.",
            "Different techniques and we can apply different techniques which are able to capture some patterns or not.",
            "For the special model in two major approaches to conceptual modeling over space are field based.",
            "Modeling the object based method."
        ],
        [
            "I'm in the field based model.",
            "Basically, the world is seen as a continuing on the surface and we have a feature which varies over this continue surface and then this spatial variation is actually described by means of a few functions.",
            "With functions are basically functions defined in error to the end and its value in my specific applicability domain.",
            "Examples of functions can be the elevation, the temperature, precipitation that their Maps, and we hear you say or representations of these functions.",
            "That you can normally see, for instance if not in.",
            "Lena geography and we you can also you can work on this field functions by means of a field operations.",
            "You can for instance 2 field operations and you can compose stooping operations and so on to get.",
            "Different types.",
            "Descriptions of the space.",
            "Question, yeah.",
            "So with the field function, to what end do you get?",
            "RN represents the space.",
            "Nobody will be elevated or two, and the domain represents the value they can, for instance by the algorithm or specific country with Mike.",
            "Precipitation sensor picture.",
            "So would you code time as an equal 3 or is not personal time here?",
            "This is just a modeling for space and then we will see the different combinations that we can have all the different modeling techniques for space and different modeling techniques.",
            "For a long time and then we had modeling different models for special projects.",
            "Sorry Archer, you can interrupt meetings but not sure if something is I will sure do interact with something is not good."
        ],
        [
            "Thank you and then you just please Mother.",
            "The world is seen differently.",
            "It's seen as a subway surface littered with the distant the independent objects, which ineffective exist independently of the of the location where they are located where we are.",
            "And the objects can be zero dimension.",
            "We can be punctual.",
            "Can be linear, for instance of world.",
            "Here you can see that I'm falling object mature design.",
            "Church in order can be linear like roads and it can be dimensional or something like a park for instance.",
            "And in this case, the operations dedicated can have on special objects can refer to different type of relations that you construct from the special object.",
            "Like a topological relations director, directional relations and distance based revisions.",
            "I'll go on in.",
            "Stopping seeing them in action slides."
        ],
        [
            "Well, these these two modeling over the space are actually equivalent in some sense, in the sense that you can go from one to the other one, but they can facilitate the.",
            "One specific data mining task or not according to the one you have chosen.",
            "For instance, that if you want to describe an area where you have a mood where you have fine here for here and oh here, you can describe that.",
            "By means of field in which you say that the radio taken by function of X&Y divided 2 coordinates is pine.",
            "If X is between 2:00 and 4:00 and Y is between 2:00 and 4:00.",
            "And it's for if X is between zero and two and Y is between zero and two.",
            "Or it's OK if X is between 2:00 and 4:00 and Y is between zero and two OK.",
            "But at the same time, you could describe the same spatial information.",
            "Using spatial objects in this case you will describe.",
            "For instance if for rectangles.",
            "So how are these by?",
            "Indicating the vertices properties.",
            "So the same information but with two different representations."
        ],
        [
            "As to the temporal information, two major approaches for conceptual modeling, government temporary information art.",
            "Are these the temporal snapshots in which you have a time series in which you're representing the value, or an object for different time points?",
            "You'll have to look and also represent the thank God change so that everybody said that changes the how you have.",
            "How valuable.",
            "For instance, the field has changed from time to time."
        ],
        [
            "In the temple's national snapshots, you have for instance, especially layers of the same team, which are times 10, and in this case all information is conveyed that employ single layer we can.",
            "Study the situation.",
            "You can study a single analyze so a single layer because the different.",
            "There's no explicit temporal relations between two layers.",
            "You do not need, for instance, to know layer 12.",
            "What was the situation in layer in layer 21 to know that the situation at time T2?",
            "But if you want to discover the changes, then you have it.",
            "Computer differences, differences between the two layers.",
            "So if your data mining task is more related to changing discovery, babies are representation is.",
            "Less appropriate."
        ],
        [
            "While the if you could also represent a temporal information by means of temporal changes like well, like in this case, where a special layer is represented both at a given start time and in subsequent time.",
            "So you can see here this layer different incremental changes that occur after the start time, for instance that initially there.",
            "Then the.",
            "This area was burned, but a time tool only this area B indicated as P as in this area and Acadia SB Fire has developed, so this error has occurred.",
            "And then it's time for a fire extending to areas E&C and then at time, time for fire extended.",
            "Also play area two in one single layer.",
            "You can see the different changes that are occurring."
        ],
        [
            "And of course you can get go back from the single layer, two different layers, or in this case by subtraction and.",
            "The change from one representation from the other one.",
            "Is convenient.",
            "Perform."
        ],
        [
            "So now let's put the two dimensions together and let's see what happens.",
            "We can have a special objects representative, for instance by.",
            "In there an object by means of an object model.",
            "So by means of a points, lines and polygons and we can use temporal snapshots.",
            "In this case we have."
        ],
        [
            "Appointed trajectories where, for instance, in this case the we have change of the space in time.",
            "But you can also have special time series where the spatial position is fixed, but you have exchange operating time."
        ],
        [
            "Or you can also have line trajectory's if you're special.",
            "Object is represented by lines and you have.",
            "Presentation of several.",
            "For instance, trajectories with trajectory is made by when you go from home to work.",
            "Daily and you represent different paths and then you have a.",
            "You have in this case.",
            "The different line trajectories which combine both the spatial and temporal for me."
        ],
        [
            "Or you can have also a Polygon projector is interfacing with objects which are represented by you.",
            "Which had it?",
            "Addition by means of polygons, like for instance, the square enclosing account."
        ],
        [
            "But it comes in which you have a field based in the presentation.",
            "Or you can have a rest of series.",
            "But you have different raster, so different.",
            "Variance of field function at different time points."
        ],
        [
            "But you can also represent the temporal change.",
            "So the thinker information by means of control change.",
            "In this case, if you have an object model where your special object represented by point is a point, then the temperature change will be, for instance by displacement in motion.",
            "Of the point with respect to its original position or in the temporal change, you can also represent it speed of the object.",
            "In case of lines or polygons you can also represent the rotation, which makes no sense for points.",
            "For instance, the deformation the split of a line or the merge of the lines and also for the polygons.",
            "In the case of modern, can also represent the change across the last snapshots.",
            "Those are the two basic presentations of the spatial and thankful information and the combination of a special template."
        ],
        [
            "What's up, those are not the.",
            "Those are not the only one because you can have more complex representations or special information.",
            "For instance, and you can represent.",
            "Space by means of graphs and then you can have a special network model where.",
            "You have a graph at a different time points, and then you will represent.",
            "And so you have a timeline, expanded graph, and you represent.",
            "For instance.",
            "Note in a graph Maps temporarily to another node in the in the graph.",
            "Succeed winter is natural.",
            "Or you can have.",
            "Information represented as ton aggregate graph where you have a single graph but along the single graph you represent what happens along the edges between one and the other one.",
            "What happens during a time interval, for instance, if it takes one hour to travel from place and one and placed into, and you represent this by means of these edge and at time one and then.",
            "Fix the one overtime two and then you don't travel from one to N 2 at time 3.",
            "Then you can represent this by one single edge with.",
            "An indication of how, how much it takes to go from anyone and then to actually practice three different time points.",
            "This is the time market with the ground.",
            "Or you can also represent information is special temporal information by means of an actual workflows, which means that you are emphasizing, for instance, the changes that you have in this case of of spatial information along.",
            "Long time, for instance, the fact that the original one remains stable at time 2 or.",
            "To generate.",
            "A new original chase?",
            "Identify this aids in in this network flow question.",
            "Yeah, so in this network flow model, yeah.",
            "So I can see from the squares what it means that one stays the same in the two splits.",
            "But for example, it could have been that five to six not be equally equally sized or something like that.",
            "How would that be included in that model?",
            "Here too is 55 and six, and both have the same area.",
            "Do the two units are splitting into Spanish?",
            "How is that encoding?",
            "Well, this is extra information in the sense that it's information on.",
            "That would be considered a special information known as special information like the sides.",
            "Or, for instance, it could be the.",
            "Another characteristic color color has been changed.",
            "Here we are just describing this information number.",
            "On on how regions, regions, sleet or marriage and they and how they?",
            "Contributes to the creation of.",
            "Different.",
            "Special objects along time and special objects will be described separately.",
            "Better with their relationships also.",
            "So you would have an independent doctor this year."
        ],
        [
            "And also you can combine now and you can represent the temperature changes within this special network model and the spatial temporal changes in spatial network model corresponds to the for instance in normal addition and the indication of right now nodes that have appeared on the network or instances sensors that have been activated or Nelson have disappeared.",
            "The sense of.",
            "Tempting activated"
        ],
        [
            "And just this means the links that have been created between us.",
            "So when you describe your special temporal data, you have a non special Bank of attributes which characterize the attribute.",
            "Is not a non contextual, not contextual means there independently from space in fire they represent an unconventional measures of the objects and.",
            "But you can also have a special attributes like this special location special extend the shape and temporal activate so I can come stay in collaboration."
        ],
        [
            "OK, but you know only you have an account.",
            "Lee the actress tried to make things so the fact that you have to deal with these two dimensions with these two properties like spatial and temporal properties, but it's."
        ],
        [
            "That makes things more complicated, especially.",
            "Because she's gonna have a different type of relationships.",
            "Spatial relationships like topological distance in relation and directional temporal relationships like before, after, during.",
            "And you can also have a spatial temporal relationships, that is relationships which can be defined only if you take into account together the two inventions, like the fact the fact that one point is attracting the another one so.",
            "There's a consideration of the movement, so I present, but also in time so.",
            "The object will move towards another one later on.",
            "You can also have a special thing for relationships that emphasize the fact that.",
            "An area is expanding there or husband with David before has been split or merge."
        ],
        [
            "The topological relationships have been quite well defined therein.",
            "In the literature.",
            "By by means of the 9 intersection model which is described.",
            "Precisely the semantics of the psychological relationships.",
            "According to this man intersection model, for instance, you can define precisely the semantics of is a. Spatial relationships that you can have between two regions, not disjoint meat contains covers overlap.",
            "Simple inside and covered by the topological relationships are invariant under rotation is.",
            "Relationships are invited on the rotation, translation, scaling so."
        ],
        [
            "But you can also have a metric distance relationships.",
            "Every kind of the which can be represented by some metric.",
            "Measures like the distance between two points, but you can also completely agree on distance between two areas, like for instance the living distance between the closest.",
            "Absolutely it is.",
            "I think it also had non metric.",
            "At least answer relationships between objects.",
            "When you consider community, some cost functions which are not specially related.",
            "For instance, the time with drive time to go from theorem applauded it's.",
            "If you see that two different graphs more or less the the the time, the well, the the.",
            "Distance in space is almost as it's quite similar, but takes double time to go this way.",
            "Instead of him of course.",
            "This one.",
            "Under"
        ],
        [
            "And we can also consider directional relationships.",
            "By computing them either using the angle of the center of the shapes and increasing will have their own Jensen.",
            "Or you can use.",
            "You can describe the direction relationships by means of an extension of Alliance algebra.",
            "Allen's algebra was defined for temporal information to define when, for instance, what are.",
            "Frontal temporal relations that you can hire between two events and an extension of other women's algebra to the special domain allows you to describe the directional relationship.",
            "But for instance here.",
            "You can give it a sense semantics to the concept of North or cause a North and northwest.",
            "Of course you can say that the projection along 1 axis of this shape is before probably plan relation defined by Alan's algebra.",
            "The projection of these shapes along the X axis axis, but they maybe they overlap.",
            "Here and in the overlapping, the yellow area is the segment associated to this shape.",
            "Comes before the segmentation associated to this area."
        ],
        [
            "Or you can have also hybrid relationships in where you have a mix of line parameter of.",
            "You can have a combination of different relationships, like a topological distance relationships to establish for instance of the line problems."
        ],
        [
            "What is a relationship while implicitly define?",
            "Actually, special joins on special databases.",
            "So if you consider two layers of a special database and you can see there one of these.",
            "Relationship.",
            "Spring that relationship is going to define a sort of spatial join implicitly between the two layers, so.",
            "You can imagine how many special relationships we can we could define and.",
            "And then how many implicit special joins could be defined between two layers?",
            "And this makes things complicated.",
            "Relations.",
            "There are many of them.",
            "Maybe in this case being next."
        ],
        [
            "Using a special legacy that consists of everyone.",
            "Can we neglect this special relationship like formation?",
            "Well, we want the answer."
        ],
        [
            "Respect the this special relationship so.",
            "Actually.",
            "Many cases hides a statistical correlation, so so the network of data defined, for instance by implicitly special relationship, can reveal what are special dependencies that we can have between matter different.",
            "Values.",
            "Between the values of different articles.",
            "For instance, if the distance of the houses can be available to understand the audiences from our domain, roads can be really wanted to understand where whether there is an auto correlation of abilities.",
            "But it's also true.",
            "The opposite, that if you know if you have a measures of the special order correlation in the, you know how to estimate to estimate spatial correlation.",
            "Then you can understand what are the relevant spatial relationships that you want to compute on your special database, and then you can, for instance this side.",
            "To materialize those relationships just to speed up the spatial data mining process.",
            "I've just introduced these two terms and."
        ],
        [
            "Special.",
            "Artistical what special relationship friend?",
            "Special dependencies and just.",
            "Few words on how this can be related.",
            "Fewer some these concepts.",
            "The spatial cross correlation is basically the correlation between two distant absolutes across space.",
            "For instance, the number of children ages and the.",
            "Number of confectionery manufacturing establishments."
        ],
        [
            "And the auto correlation refers to the correlation of an attribute with itself across the space.",
            "Like for instance of distribution of the voters for the presidential election.",
            "According to.",
            "Problems I will justification for the auto correlation comes from toddlers versus lower the geography according to which everything is related to everything else.",
            "But nearby things are morally related and distant things.",
            "Well, actually the older they also correlate."
        ],
        [
            "It can be prosecuted, but it can also be negative.",
            "It's possible that when you have a senior values Internet nearby, but it's negative when you have different values in the nearby."
        ],
        [
            "Negative feedback, especially auto correlation, is not really considered a sort of artifact, and according to ongoing child, but it cannot exist in a continuation context because this means that you have a sort of.",
            "Chess board and distribution and all the other values."
        ],
        [
            "But actually when we so they kind of auto correlation with his most most investigative we still.",
            "Mostly for autocorrelation, but.",
            "The reason is that the sun in general, in some phenomena you can have a both local and both, both local, possibly and both local negative autocorrelation.",
            "But the local positive is normally tends to dominate over the local negative correlations.",
            "In monster phenomenon I hear in the red.",
            "Areas you see here the distribution of the votes, but the rest areas are those in which the positive autocorrelation are significant and the blue ones.",
            "Those engaged in negative autocorrelations are significant, and in this phenomenon you can see both positive and both negative, but the positive ones are the dominant ones.",
            "Otherwise we would have a chess board and distribution line.",
            "Which is."
        ],
        [
            "Realistic community, social and to graphical form.",
            "Special autocorrelation can be measured by some global and local measures global when it affects the whole data set and local measures to manage money is computed for each observation alone.",
            "I will skip.",
            "The park down now."
        ],
        [
            "These"
        ],
        [
            "No can indicators, I just do.",
            "Interviews to explain how this.",
            "Special dependence can be introduced model in a spatial model.",
            "It can be modeled by means over special error.",
            "This means that the correlation and then dependencies are on the error in the model or it can be modeled by means of relations between.",
            "At the time.",
            "Target or dependent and non target or.",
            "So independent variables."
        ],
        [
            "And the factor of these.",
            "A relationship is that actually the main assumptions that we have in statistical modeling are violated because the error terms are.",
            "We always assume that relative terms aren't correlating the observations are independent in classical.",
            "Spatial analysis classical.",
            "Statistical.",
            "Techniques and but due to this violation we have for instance, if we consider the ordinary least squares regression.",
            "What happens instead?",
            "The correlation coefficient can be higher than the.",
            "Actual value and we can have an impression of having high precision later, which is actually not true, and we can found we can find some statistically significant.",
            "Associate."
        ],
        [
            "And so we try and offer.",
            "That's why."
        ],
        [
            "I am in statistics.",
            "Several models have been developed.",
            "And then."
        ],
        [
            "A general special model to take into account.",
            "Alisa correlation, the general special model is formulated as this way which.",
            "The dependent variable depends on the number of independent variables, but it also depends on the dependent variable in the nearby and the neighborhood is represented by a matrix or depends on the number of.",
            "On the.",
            "On the independent article creates in the nearby, and this is modeled by.",
            "An another spatial weight metric system.",
            "According to the fact that we put the Alpha Beta Gamma.",
            "To 0 or not we can have from his general special."
        ],
        [
            "Let's say that we can."
        ],
        [
            "Generated several models that, like the classical linear model in which we, for instance, the determine the price of the House only on in terms of the independent."
        ],
        [
            "Independent properties of the house.",
            "But we can also have a special leg model in which we.",
            "We determine the value of the price according to the value of the pricing neighborhood.",
            "So we account from auto."
        ],
        [
            "Relation we can have a special ever model which we account to do error we account for."
        ],
        [
            "Related errors and we can account for spatial crossing aggressive models.",
            "In which we determine, for instance, the price of a house according to the age of objects in the neighborhood.",
            "Question.",
            "Yeah, could you just help explain?",
            "So here we see age yeah said so you have the assets around the average age.",
            "Here is these value is the value is the age of the building.",
            "For which you want to estimate the price there on the flat for which we want to estimate the price.",
            "But here age refers to age, since it's multiplied by V2 and V2 is a weight matrix, refers to the age of the name of the.",
            "Special objects in the neighborhood.",
            "So this is this is the equation after the estimation of the equation of the parameters of the tune itself.",
            "Define well, the point is that D2 is actually should be known in advance.",
            "So and."
        ],
        [
            "This.",
            "This is a limitation of this statistical modeling because yesterday, yeah, yeah you have to know in advance and this is a limitation of this statistical modeling."
        ],
        [
            "And that's why we also investigated a relational approach to.",
            "In which you."
        ],
        [
            "So.",
            "And some Colangelo showed you yesterday and relational approach can take."
        ],
        [
            "Accountable for local correlation between within network correlation so you can easily consider both."
        ],
        [
            "Of auto correlation and cross correlation naturally."
        ],
        [
            "OK."
        ],
        [
            "There's a rich literature on this."
        ],
        [
            "On"
        ],
        [
            "But the delete also over these are relational approach.",
            "In special temporary demand means that we have to recompute also this special relations and the one you have to deal with.",
            "Joe references training data.",
            "This is not basically practice."
        ],
        [
            "Just the last two slides there are to introduce analisa.",
            "There are several tasks in a spatial temporal data mining that weekend device, like more, some task of loosely related to classical attribute oriented generalization, like the prediction of a special attribute considering both temporal and spatial dimension market classification regression."
        ],
        [
            "Forecasting problem.",
            "What the special temporal Data mining task software also is special oriented?",
            "That generalization, where you have to really get this paid special properties where an earthquake is going to happen and when and which areas it's going to affect and at which level of damage and those are prediction of both spatial properties and temporal properties.",
            "Or you can.",
            "Consider a combination Mac.",
            "In the case of transactions.",
            "What we have.",
            "An issue that we have investigated is that the point is that you can have really later now over special encoding the minor tasks because you have a creator of relationships so that you can be fine and you can try to.",
            "Spatial thank God special temporal relationships you can write, for instance, to predict or to extract information on this special member relationships.",
            "So."
        ],
        [
            "We try to investigate it.",
            "A basic, a special temporal pattern which could be used in a different special temporal, combining tasks and like a frequent after we used in.",
            "Which can which is used in Association analysis in a social media classification and.",
            "In science class and then so."
        ],
        [
            "And these function that we have introduced this code that render cluster and determine a training master.",
            "We consider both the time orizon then and special dimension and also the value of an aspectual attribute.",
            "So all information is in this.",
            "In temple a spatial and non spatial temporal is enclosed in this pattern and Anna Lisa is now going to present."
        ],
        [
            "How is factoring?"
        ],
        [
            "Use that in several classes.",
            "Suck.",
            "Yeah.",
            "Tana.",
            "My real question.",
            "Seven on the property.",
            "More than I was thinking about the objects on which you can apply those properties that we have in an ecosystem that involves the River and decisions or even found the flora in the River.",
            "Some of those operations can be used in the River, for example, repulsion or attraction of water masses, but not all of them can be applied on order.",
            "The individuals who are absurdly website efficient.",
            "Cons of moving on moving on your mouse and flower?",
            "That's true, but this is related to another issue I haven't had time to to present.",
            "The fact that when you have a special temporal phenomena, you have typically different types of objects.",
            "You have it or geniti of objects and then not all.",
            "Of course, not all relationships makes sense between different types of objects so.",
            "You have an additional degree of complexity which is in the unity so.",
            "Over and the forms of data.",
            "Would you please give us the opportunity of simplifying the problem?",
            "Because at the end point you think is a relational model, we have said that transferring all those operations, that measurement model, special industry context behind others.",
            "With this correctly very difficult, but for some of the object part we could reduce the complexity by ignoring some part of them.",
            "Yeah, because of course there are the information on the on the track that.",
            "Two special objects of different nature cannot be interacted directly at the weekend, interacted by means over, for instance, third type of object object can help with the you have this kind of background knowledge to reduce.",
            "Some of the spatial relationships.",
            "Consider."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This summer school, which is a really interesting build circuits, a Channel 4 or the content that.",
                    "label": 0
                },
                {
                    "sent": "Haven't been supporting the program.",
                    "label": 0
                },
                {
                    "sent": "And then let me just briefly introduce myself, I'm professor.",
                    "label": 0
                },
                {
                    "sent": "Everybody, I'm probably, you know whatever it is because it really is has been involved in the master project which is the European project which is funding this score well.",
                    "label": 0
                },
                {
                    "sent": "The goal.",
                    "label": 0
                },
                {
                    "sent": "The main topic of this presentation is spatial temporal data mining, and this presentation will be split in two parts.",
                    "label": 0
                },
                {
                    "sent": "The first part could be given by myself and the second part.",
                    "label": 0
                },
                {
                    "sent": "Anna Lisa mature.",
                    "label": 0
                },
                {
                    "sent": "My.",
                    "label": 0
                },
                {
                    "sent": "Presentation will.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Interviews with entry introduce the special temporal data mining will be and will be more at the level of a tutorial.",
                    "label": 0
                },
                {
                    "sent": "And then I'll explain the main challenges that some challenges and the special temporal data mining.",
                    "label": 1
                },
                {
                    "sent": "And I will provide some pointers to teacher and then in the second part there is.",
                    "label": 0
                },
                {
                    "sent": "I will go deep into data mining tasks and also in.",
                    "label": 0
                },
                {
                    "sent": "That needs some and he will show some results with that.",
                    "label": 0
                },
                {
                    "sent": "So she will present more results from.",
                    "label": 0
                },
                {
                    "sent": "Our research group.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, the first part will be more or less with follow is.",
                    "label": 0
                },
                {
                    "sent": "So the percentage is set of concepts is special modeling spatial relationships crossing the autocorrelation specially trained in statistical approach or religion approach and the special temporal data mining tasks.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, I'll go deeply into concept about special temporal data mining.",
                    "label": 0
                },
                {
                    "sent": "If I should define special controller minus the.",
                    "label": 0
                },
                {
                    "sent": "Would that apply this same definition used for data mining?",
                    "label": 0
                },
                {
                    "sent": "The only change in the final words because special temporal data mining is in the process of discovering interesting and previously unknown but potentially useful to conference from spatial temporal data.",
                    "label": 1
                },
                {
                    "sent": "So what's make what makes it different?",
                    "label": 0
                },
                {
                    "sent": "Difference here is the kind of input and.",
                    "label": 0
                },
                {
                    "sent": "With the recent differences with respect to the plastic bottom lining up.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Roaches why special temporal objects are?",
                    "label": 0
                },
                {
                    "sent": "Challenging those they include to at least two properties.",
                    "label": 1
                },
                {
                    "sent": "One is a special property and the other one is a temporal property which introduce some themselves.",
                    "label": 0
                },
                {
                    "sent": "They introduce normal in some of these years.",
                    "label": 0
                },
                {
                    "sent": "Later issue I'll explain later.",
                    "label": 0
                },
                {
                    "sent": "I'm an example of a special printer object can be next week.",
                    "label": 0
                },
                {
                    "sent": "Heard of the sad news.",
                    "label": 0
                },
                {
                    "sent": "For instance, a problem.",
                    "label": 0
                },
                {
                    "sent": "Drama central Italy where we had this earthquake few weeks ago.",
                    "label": 0
                },
                {
                    "sent": "Two weeks ago.",
                    "label": 0
                },
                {
                    "sent": "And in the description of an earthquake we can have a number of.",
                    "label": 0
                },
                {
                    "sent": "Non spatial and non temporal afterwards, but we have.",
                    "label": 0
                },
                {
                    "sent": "For sure at this conditional special property where the earthquake and as.",
                    "label": 0
                },
                {
                    "sent": "Data center over the sort of geographical coordinates over the epicenter of the earthquake and also you have information on when the earthquake happened.",
                    "label": 0
                },
                {
                    "sent": "But you can also have in the description of an earthquake more than one week special property.",
                    "label": 0
                },
                {
                    "sent": "For instance, if you might be interested not only on where but where you have.",
                    "label": 0
                },
                {
                    "sent": "On our information not only on the epicenter but also where the where damages and reliable at different level of.",
                    "label": 0
                },
                {
                    "sent": "Severity and.",
                    "label": 0
                },
                {
                    "sent": "You can also have a several temporal attributes, not only when it happened, but also regulation for instance.",
                    "label": 0
                },
                {
                    "sent": "So at least in a special temporal object, you'll have one special property in one temple.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The complexity of this thing and special temporal objects is one of the main challenges of the spatial temporal data mining.",
                    "label": 1
                },
                {
                    "sent": "And the reason is that the special temporal data.",
                    "label": 1
                },
                {
                    "sent": "For which special temporal leader complexes that include discrete representations of phenomenon which are continuous in space and time.",
                    "label": 0
                },
                {
                    "sent": "And this introduces.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On issues.",
                    "label": 0
                },
                {
                    "sent": "Before explaining how we can account for.",
                    "label": 0
                },
                {
                    "sent": "And how we can manage it?",
                    "label": 0
                },
                {
                    "sent": "Some of these issues, most one just do interviews.",
                    "label": 0
                },
                {
                    "sent": "How does spatial information can be actually modeled and how the temporal information can be actually modeled?",
                    "label": 0
                },
                {
                    "sent": "This is essential because according to the different models we have according to different ways we have to mother at the special information obtainable information in their combination we can have.",
                    "label": 0
                },
                {
                    "sent": "Different techniques and we can apply different techniques which are able to capture some patterns or not.",
                    "label": 0
                },
                {
                    "sent": "For the special model in two major approaches to conceptual modeling over space are field based.",
                    "label": 1
                },
                {
                    "sent": "Modeling the object based method.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I'm in the field based model.",
                    "label": 0
                },
                {
                    "sent": "Basically, the world is seen as a continuing on the surface and we have a feature which varies over this continue surface and then this spatial variation is actually described by means of a few functions.",
                    "label": 1
                },
                {
                    "sent": "With functions are basically functions defined in error to the end and its value in my specific applicability domain.",
                    "label": 1
                },
                {
                    "sent": "Examples of functions can be the elevation, the temperature, precipitation that their Maps, and we hear you say or representations of these functions.",
                    "label": 0
                },
                {
                    "sent": "That you can normally see, for instance if not in.",
                    "label": 0
                },
                {
                    "sent": "Lena geography and we you can also you can work on this field functions by means of a field operations.",
                    "label": 0
                },
                {
                    "sent": "You can for instance 2 field operations and you can compose stooping operations and so on to get.",
                    "label": 0
                },
                {
                    "sent": "Different types.",
                    "label": 0
                },
                {
                    "sent": "Descriptions of the space.",
                    "label": 0
                },
                {
                    "sent": "Question, yeah.",
                    "label": 0
                },
                {
                    "sent": "So with the field function, to what end do you get?",
                    "label": 0
                },
                {
                    "sent": "RN represents the space.",
                    "label": 0
                },
                {
                    "sent": "Nobody will be elevated or two, and the domain represents the value they can, for instance by the algorithm or specific country with Mike.",
                    "label": 0
                },
                {
                    "sent": "Precipitation sensor picture.",
                    "label": 0
                },
                {
                    "sent": "So would you code time as an equal 3 or is not personal time here?",
                    "label": 0
                },
                {
                    "sent": "This is just a modeling for space and then we will see the different combinations that we can have all the different modeling techniques for space and different modeling techniques.",
                    "label": 0
                },
                {
                    "sent": "For a long time and then we had modeling different models for special projects.",
                    "label": 0
                },
                {
                    "sent": "Sorry Archer, you can interrupt meetings but not sure if something is I will sure do interact with something is not good.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you and then you just please Mother.",
                    "label": 0
                },
                {
                    "sent": "The world is seen differently.",
                    "label": 0
                },
                {
                    "sent": "It's seen as a subway surface littered with the distant the independent objects, which ineffective exist independently of the of the location where they are located where we are.",
                    "label": 0
                },
                {
                    "sent": "And the objects can be zero dimension.",
                    "label": 0
                },
                {
                    "sent": "We can be punctual.",
                    "label": 0
                },
                {
                    "sent": "Can be linear, for instance of world.",
                    "label": 0
                },
                {
                    "sent": "Here you can see that I'm falling object mature design.",
                    "label": 0
                },
                {
                    "sent": "Church in order can be linear like roads and it can be dimensional or something like a park for instance.",
                    "label": 0
                },
                {
                    "sent": "And in this case, the operations dedicated can have on special objects can refer to different type of relations that you construct from the special object.",
                    "label": 0
                },
                {
                    "sent": "Like a topological relations director, directional relations and distance based revisions.",
                    "label": 0
                },
                {
                    "sent": "I'll go on in.",
                    "label": 0
                },
                {
                    "sent": "Stopping seeing them in action slides.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, these these two modeling over the space are actually equivalent in some sense, in the sense that you can go from one to the other one, but they can facilitate the.",
                    "label": 0
                },
                {
                    "sent": "One specific data mining task or not according to the one you have chosen.",
                    "label": 0
                },
                {
                    "sent": "For instance, that if you want to describe an area where you have a mood where you have fine here for here and oh here, you can describe that.",
                    "label": 0
                },
                {
                    "sent": "By means of field in which you say that the radio taken by function of X&Y divided 2 coordinates is pine.",
                    "label": 0
                },
                {
                    "sent": "If X is between 2:00 and 4:00 and Y is between 2:00 and 4:00.",
                    "label": 0
                },
                {
                    "sent": "And it's for if X is between zero and two and Y is between zero and two.",
                    "label": 0
                },
                {
                    "sent": "Or it's OK if X is between 2:00 and 4:00 and Y is between zero and two OK.",
                    "label": 0
                },
                {
                    "sent": "But at the same time, you could describe the same spatial information.",
                    "label": 0
                },
                {
                    "sent": "Using spatial objects in this case you will describe.",
                    "label": 0
                },
                {
                    "sent": "For instance if for rectangles.",
                    "label": 0
                },
                {
                    "sent": "So how are these by?",
                    "label": 0
                },
                {
                    "sent": "Indicating the vertices properties.",
                    "label": 0
                },
                {
                    "sent": "So the same information but with two different representations.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "As to the temporal information, two major approaches for conceptual modeling, government temporary information art.",
                    "label": 1
                },
                {
                    "sent": "Are these the temporal snapshots in which you have a time series in which you're representing the value, or an object for different time points?",
                    "label": 0
                },
                {
                    "sent": "You'll have to look and also represent the thank God change so that everybody said that changes the how you have.",
                    "label": 0
                },
                {
                    "sent": "How valuable.",
                    "label": 0
                },
                {
                    "sent": "For instance, the field has changed from time to time.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the temple's national snapshots, you have for instance, especially layers of the same team, which are times 10, and in this case all information is conveyed that employ single layer we can.",
                    "label": 1
                },
                {
                    "sent": "Study the situation.",
                    "label": 0
                },
                {
                    "sent": "You can study a single analyze so a single layer because the different.",
                    "label": 0
                },
                {
                    "sent": "There's no explicit temporal relations between two layers.",
                    "label": 1
                },
                {
                    "sent": "You do not need, for instance, to know layer 12.",
                    "label": 0
                },
                {
                    "sent": "What was the situation in layer in layer 21 to know that the situation at time T2?",
                    "label": 0
                },
                {
                    "sent": "But if you want to discover the changes, then you have it.",
                    "label": 0
                },
                {
                    "sent": "Computer differences, differences between the two layers.",
                    "label": 0
                },
                {
                    "sent": "So if your data mining task is more related to changing discovery, babies are representation is.",
                    "label": 0
                },
                {
                    "sent": "Less appropriate.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "While the if you could also represent a temporal information by means of temporal changes like well, like in this case, where a special layer is represented both at a given start time and in subsequent time.",
                    "label": 1
                },
                {
                    "sent": "So you can see here this layer different incremental changes that occur after the start time, for instance that initially there.",
                    "label": 0
                },
                {
                    "sent": "Then the.",
                    "label": 0
                },
                {
                    "sent": "This area was burned, but a time tool only this area B indicated as P as in this area and Acadia SB Fire has developed, so this error has occurred.",
                    "label": 0
                },
                {
                    "sent": "And then it's time for a fire extending to areas E&C and then at time, time for fire extended.",
                    "label": 0
                },
                {
                    "sent": "Also play area two in one single layer.",
                    "label": 0
                },
                {
                    "sent": "You can see the different changes that are occurring.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And of course you can get go back from the single layer, two different layers, or in this case by subtraction and.",
                    "label": 0
                },
                {
                    "sent": "The change from one representation from the other one.",
                    "label": 0
                },
                {
                    "sent": "Is convenient.",
                    "label": 0
                },
                {
                    "sent": "Perform.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now let's put the two dimensions together and let's see what happens.",
                    "label": 0
                },
                {
                    "sent": "We can have a special objects representative, for instance by.",
                    "label": 0
                },
                {
                    "sent": "In there an object by means of an object model.",
                    "label": 0
                },
                {
                    "sent": "So by means of a points, lines and polygons and we can use temporal snapshots.",
                    "label": 0
                },
                {
                    "sent": "In this case we have.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Appointed trajectories where, for instance, in this case the we have change of the space in time.",
                    "label": 0
                },
                {
                    "sent": "But you can also have special time series where the spatial position is fixed, but you have exchange operating time.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or you can also have line trajectory's if you're special.",
                    "label": 0
                },
                {
                    "sent": "Object is represented by lines and you have.",
                    "label": 0
                },
                {
                    "sent": "Presentation of several.",
                    "label": 0
                },
                {
                    "sent": "For instance, trajectories with trajectory is made by when you go from home to work.",
                    "label": 0
                },
                {
                    "sent": "Daily and you represent different paths and then you have a.",
                    "label": 0
                },
                {
                    "sent": "You have in this case.",
                    "label": 0
                },
                {
                    "sent": "The different line trajectories which combine both the spatial and temporal for me.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or you can have also a Polygon projector is interfacing with objects which are represented by you.",
                    "label": 0
                },
                {
                    "sent": "Which had it?",
                    "label": 0
                },
                {
                    "sent": "Addition by means of polygons, like for instance, the square enclosing account.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But it comes in which you have a field based in the presentation.",
                    "label": 0
                },
                {
                    "sent": "Or you can have a rest of series.",
                    "label": 0
                },
                {
                    "sent": "But you have different raster, so different.",
                    "label": 0
                },
                {
                    "sent": "Variance of field function at different time points.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But you can also represent the temporal change.",
                    "label": 0
                },
                {
                    "sent": "So the thinker information by means of control change.",
                    "label": 0
                },
                {
                    "sent": "In this case, if you have an object model where your special object represented by point is a point, then the temperature change will be, for instance by displacement in motion.",
                    "label": 0
                },
                {
                    "sent": "Of the point with respect to its original position or in the temporal change, you can also represent it speed of the object.",
                    "label": 0
                },
                {
                    "sent": "In case of lines or polygons you can also represent the rotation, which makes no sense for points.",
                    "label": 0
                },
                {
                    "sent": "For instance, the deformation the split of a line or the merge of the lines and also for the polygons.",
                    "label": 0
                },
                {
                    "sent": "In the case of modern, can also represent the change across the last snapshots.",
                    "label": 0
                },
                {
                    "sent": "Those are the two basic presentations of the spatial and thankful information and the combination of a special template.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What's up, those are not the.",
                    "label": 0
                },
                {
                    "sent": "Those are not the only one because you can have more complex representations or special information.",
                    "label": 0
                },
                {
                    "sent": "For instance, and you can represent.",
                    "label": 0
                },
                {
                    "sent": "Space by means of graphs and then you can have a special network model where.",
                    "label": 1
                },
                {
                    "sent": "You have a graph at a different time points, and then you will represent.",
                    "label": 0
                },
                {
                    "sent": "And so you have a timeline, expanded graph, and you represent.",
                    "label": 1
                },
                {
                    "sent": "For instance.",
                    "label": 0
                },
                {
                    "sent": "Note in a graph Maps temporarily to another node in the in the graph.",
                    "label": 0
                },
                {
                    "sent": "Succeed winter is natural.",
                    "label": 0
                },
                {
                    "sent": "Or you can have.",
                    "label": 0
                },
                {
                    "sent": "Information represented as ton aggregate graph where you have a single graph but along the single graph you represent what happens along the edges between one and the other one.",
                    "label": 0
                },
                {
                    "sent": "What happens during a time interval, for instance, if it takes one hour to travel from place and one and placed into, and you represent this by means of these edge and at time one and then.",
                    "label": 0
                },
                {
                    "sent": "Fix the one overtime two and then you don't travel from one to N 2 at time 3.",
                    "label": 0
                },
                {
                    "sent": "Then you can represent this by one single edge with.",
                    "label": 0
                },
                {
                    "sent": "An indication of how, how much it takes to go from anyone and then to actually practice three different time points.",
                    "label": 0
                },
                {
                    "sent": "This is the time market with the ground.",
                    "label": 0
                },
                {
                    "sent": "Or you can also represent information is special temporal information by means of an actual workflows, which means that you are emphasizing, for instance, the changes that you have in this case of of spatial information along.",
                    "label": 0
                },
                {
                    "sent": "Long time, for instance, the fact that the original one remains stable at time 2 or.",
                    "label": 0
                },
                {
                    "sent": "To generate.",
                    "label": 0
                },
                {
                    "sent": "A new original chase?",
                    "label": 0
                },
                {
                    "sent": "Identify this aids in in this network flow question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so in this network flow model, yeah.",
                    "label": 1
                },
                {
                    "sent": "So I can see from the squares what it means that one stays the same in the two splits.",
                    "label": 0
                },
                {
                    "sent": "But for example, it could have been that five to six not be equally equally sized or something like that.",
                    "label": 0
                },
                {
                    "sent": "How would that be included in that model?",
                    "label": 0
                },
                {
                    "sent": "Here too is 55 and six, and both have the same area.",
                    "label": 0
                },
                {
                    "sent": "Do the two units are splitting into Spanish?",
                    "label": 0
                },
                {
                    "sent": "How is that encoding?",
                    "label": 0
                },
                {
                    "sent": "Well, this is extra information in the sense that it's information on.",
                    "label": 0
                },
                {
                    "sent": "That would be considered a special information known as special information like the sides.",
                    "label": 0
                },
                {
                    "sent": "Or, for instance, it could be the.",
                    "label": 0
                },
                {
                    "sent": "Another characteristic color color has been changed.",
                    "label": 0
                },
                {
                    "sent": "Here we are just describing this information number.",
                    "label": 0
                },
                {
                    "sent": "On on how regions, regions, sleet or marriage and they and how they?",
                    "label": 0
                },
                {
                    "sent": "Contributes to the creation of.",
                    "label": 0
                },
                {
                    "sent": "Different.",
                    "label": 0
                },
                {
                    "sent": "Special objects along time and special objects will be described separately.",
                    "label": 0
                },
                {
                    "sent": "Better with their relationships also.",
                    "label": 0
                },
                {
                    "sent": "So you would have an independent doctor this year.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And also you can combine now and you can represent the temperature changes within this special network model and the spatial temporal changes in spatial network model corresponds to the for instance in normal addition and the indication of right now nodes that have appeared on the network or instances sensors that have been activated or Nelson have disappeared.",
                    "label": 1
                },
                {
                    "sent": "The sense of.",
                    "label": 0
                },
                {
                    "sent": "Tempting activated",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just this means the links that have been created between us.",
                    "label": 0
                },
                {
                    "sent": "So when you describe your special temporal data, you have a non special Bank of attributes which characterize the attribute.",
                    "label": 0
                },
                {
                    "sent": "Is not a non contextual, not contextual means there independently from space in fire they represent an unconventional measures of the objects and.",
                    "label": 0
                },
                {
                    "sent": "But you can also have a special attributes like this special location special extend the shape and temporal activate so I can come stay in collaboration.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, but you know only you have an account.",
                    "label": 0
                },
                {
                    "sent": "Lee the actress tried to make things so the fact that you have to deal with these two dimensions with these two properties like spatial and temporal properties, but it's.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "That makes things more complicated, especially.",
                    "label": 0
                },
                {
                    "sent": "Because she's gonna have a different type of relationships.",
                    "label": 0
                },
                {
                    "sent": "Spatial relationships like topological distance in relation and directional temporal relationships like before, after, during.",
                    "label": 1
                },
                {
                    "sent": "And you can also have a spatial temporal relationships, that is relationships which can be defined only if you take into account together the two inventions, like the fact the fact that one point is attracting the another one so.",
                    "label": 0
                },
                {
                    "sent": "There's a consideration of the movement, so I present, but also in time so.",
                    "label": 0
                },
                {
                    "sent": "The object will move towards another one later on.",
                    "label": 0
                },
                {
                    "sent": "You can also have a special thing for relationships that emphasize the fact that.",
                    "label": 0
                },
                {
                    "sent": "An area is expanding there or husband with David before has been split or merge.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The topological relationships have been quite well defined therein.",
                    "label": 0
                },
                {
                    "sent": "In the literature.",
                    "label": 0
                },
                {
                    "sent": "By by means of the 9 intersection model which is described.",
                    "label": 0
                },
                {
                    "sent": "Precisely the semantics of the psychological relationships.",
                    "label": 0
                },
                {
                    "sent": "According to this man intersection model, for instance, you can define precisely the semantics of is a. Spatial relationships that you can have between two regions, not disjoint meat contains covers overlap.",
                    "label": 0
                },
                {
                    "sent": "Simple inside and covered by the topological relationships are invariant under rotation is.",
                    "label": 1
                },
                {
                    "sent": "Relationships are invited on the rotation, translation, scaling so.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But you can also have a metric distance relationships.",
                    "label": 1
                },
                {
                    "sent": "Every kind of the which can be represented by some metric.",
                    "label": 0
                },
                {
                    "sent": "Measures like the distance between two points, but you can also completely agree on distance between two areas, like for instance the living distance between the closest.",
                    "label": 0
                },
                {
                    "sent": "Absolutely it is.",
                    "label": 0
                },
                {
                    "sent": "I think it also had non metric.",
                    "label": 1
                },
                {
                    "sent": "At least answer relationships between objects.",
                    "label": 1
                },
                {
                    "sent": "When you consider community, some cost functions which are not specially related.",
                    "label": 0
                },
                {
                    "sent": "For instance, the time with drive time to go from theorem applauded it's.",
                    "label": 0
                },
                {
                    "sent": "If you see that two different graphs more or less the the the time, the well, the the.",
                    "label": 0
                },
                {
                    "sent": "Distance in space is almost as it's quite similar, but takes double time to go this way.",
                    "label": 0
                },
                {
                    "sent": "Instead of him of course.",
                    "label": 0
                },
                {
                    "sent": "This one.",
                    "label": 0
                },
                {
                    "sent": "Under",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And we can also consider directional relationships.",
                    "label": 1
                },
                {
                    "sent": "By computing them either using the angle of the center of the shapes and increasing will have their own Jensen.",
                    "label": 0
                },
                {
                    "sent": "Or you can use.",
                    "label": 0
                },
                {
                    "sent": "You can describe the direction relationships by means of an extension of Alliance algebra.",
                    "label": 0
                },
                {
                    "sent": "Allen's algebra was defined for temporal information to define when, for instance, what are.",
                    "label": 0
                },
                {
                    "sent": "Frontal temporal relations that you can hire between two events and an extension of other women's algebra to the special domain allows you to describe the directional relationship.",
                    "label": 0
                },
                {
                    "sent": "But for instance here.",
                    "label": 0
                },
                {
                    "sent": "You can give it a sense semantics to the concept of North or cause a North and northwest.",
                    "label": 0
                },
                {
                    "sent": "Of course you can say that the projection along 1 axis of this shape is before probably plan relation defined by Alan's algebra.",
                    "label": 0
                },
                {
                    "sent": "The projection of these shapes along the X axis axis, but they maybe they overlap.",
                    "label": 0
                },
                {
                    "sent": "Here and in the overlapping, the yellow area is the segment associated to this shape.",
                    "label": 0
                },
                {
                    "sent": "Comes before the segmentation associated to this area.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Or you can have also hybrid relationships in where you have a mix of line parameter of.",
                    "label": 0
                },
                {
                    "sent": "You can have a combination of different relationships, like a topological distance relationships to establish for instance of the line problems.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What is a relationship while implicitly define?",
                    "label": 0
                },
                {
                    "sent": "Actually, special joins on special databases.",
                    "label": 0
                },
                {
                    "sent": "So if you consider two layers of a special database and you can see there one of these.",
                    "label": 0
                },
                {
                    "sent": "Relationship.",
                    "label": 0
                },
                {
                    "sent": "Spring that relationship is going to define a sort of spatial join implicitly between the two layers, so.",
                    "label": 0
                },
                {
                    "sent": "You can imagine how many special relationships we can we could define and.",
                    "label": 0
                },
                {
                    "sent": "And then how many implicit special joins could be defined between two layers?",
                    "label": 0
                },
                {
                    "sent": "And this makes things complicated.",
                    "label": 0
                },
                {
                    "sent": "Relations.",
                    "label": 0
                },
                {
                    "sent": "There are many of them.",
                    "label": 0
                },
                {
                    "sent": "Maybe in this case being next.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Using a special legacy that consists of everyone.",
                    "label": 0
                },
                {
                    "sent": "Can we neglect this special relationship like formation?",
                    "label": 0
                },
                {
                    "sent": "Well, we want the answer.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Respect the this special relationship so.",
                    "label": 0
                },
                {
                    "sent": "Actually.",
                    "label": 0
                },
                {
                    "sent": "Many cases hides a statistical correlation, so so the network of data defined, for instance by implicitly special relationship, can reveal what are special dependencies that we can have between matter different.",
                    "label": 0
                },
                {
                    "sent": "Values.",
                    "label": 0
                },
                {
                    "sent": "Between the values of different articles.",
                    "label": 0
                },
                {
                    "sent": "For instance, if the distance of the houses can be available to understand the audiences from our domain, roads can be really wanted to understand where whether there is an auto correlation of abilities.",
                    "label": 0
                },
                {
                    "sent": "But it's also true.",
                    "label": 0
                },
                {
                    "sent": "The opposite, that if you know if you have a measures of the special order correlation in the, you know how to estimate to estimate spatial correlation.",
                    "label": 0
                },
                {
                    "sent": "Then you can understand what are the relevant spatial relationships that you want to compute on your special database, and then you can, for instance this side.",
                    "label": 0
                },
                {
                    "sent": "To materialize those relationships just to speed up the spatial data mining process.",
                    "label": 0
                },
                {
                    "sent": "I've just introduced these two terms and.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Special.",
                    "label": 0
                },
                {
                    "sent": "Artistical what special relationship friend?",
                    "label": 0
                },
                {
                    "sent": "Special dependencies and just.",
                    "label": 0
                },
                {
                    "sent": "Few words on how this can be related.",
                    "label": 0
                },
                {
                    "sent": "Fewer some these concepts.",
                    "label": 0
                },
                {
                    "sent": "The spatial cross correlation is basically the correlation between two distant absolutes across space.",
                    "label": 1
                },
                {
                    "sent": "For instance, the number of children ages and the.",
                    "label": 0
                },
                {
                    "sent": "Number of confectionery manufacturing establishments.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the auto correlation refers to the correlation of an attribute with itself across the space.",
                    "label": 0
                },
                {
                    "sent": "Like for instance of distribution of the voters for the presidential election.",
                    "label": 0
                },
                {
                    "sent": "According to.",
                    "label": 0
                },
                {
                    "sent": "Problems I will justification for the auto correlation comes from toddlers versus lower the geography according to which everything is related to everything else.",
                    "label": 0
                },
                {
                    "sent": "But nearby things are morally related and distant things.",
                    "label": 0
                },
                {
                    "sent": "Well, actually the older they also correlate.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It can be prosecuted, but it can also be negative.",
                    "label": 0
                },
                {
                    "sent": "It's possible that when you have a senior values Internet nearby, but it's negative when you have different values in the nearby.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Negative feedback, especially auto correlation, is not really considered a sort of artifact, and according to ongoing child, but it cannot exist in a continuation context because this means that you have a sort of.",
                    "label": 0
                },
                {
                    "sent": "Chess board and distribution and all the other values.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But actually when we so they kind of auto correlation with his most most investigative we still.",
                    "label": 0
                },
                {
                    "sent": "Mostly for autocorrelation, but.",
                    "label": 0
                },
                {
                    "sent": "The reason is that the sun in general, in some phenomena you can have a both local and both, both local, possibly and both local negative autocorrelation.",
                    "label": 0
                },
                {
                    "sent": "But the local positive is normally tends to dominate over the local negative correlations.",
                    "label": 0
                },
                {
                    "sent": "In monster phenomenon I hear in the red.",
                    "label": 0
                },
                {
                    "sent": "Areas you see here the distribution of the votes, but the rest areas are those in which the positive autocorrelation are significant and the blue ones.",
                    "label": 0
                },
                {
                    "sent": "Those engaged in negative autocorrelations are significant, and in this phenomenon you can see both positive and both negative, but the positive ones are the dominant ones.",
                    "label": 0
                },
                {
                    "sent": "Otherwise we would have a chess board and distribution line.",
                    "label": 0
                },
                {
                    "sent": "Which is.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Realistic community, social and to graphical form.",
                    "label": 0
                },
                {
                    "sent": "Special autocorrelation can be measured by some global and local measures global when it affects the whole data set and local measures to manage money is computed for each observation alone.",
                    "label": 0
                },
                {
                    "sent": "I will skip.",
                    "label": 0
                },
                {
                    "sent": "The park down now.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No can indicators, I just do.",
                    "label": 0
                },
                {
                    "sent": "Interviews to explain how this.",
                    "label": 0
                },
                {
                    "sent": "Special dependence can be introduced model in a spatial model.",
                    "label": 0
                },
                {
                    "sent": "It can be modeled by means over special error.",
                    "label": 0
                },
                {
                    "sent": "This means that the correlation and then dependencies are on the error in the model or it can be modeled by means of relations between.",
                    "label": 0
                },
                {
                    "sent": "At the time.",
                    "label": 0
                },
                {
                    "sent": "Target or dependent and non target or.",
                    "label": 0
                },
                {
                    "sent": "So independent variables.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the factor of these.",
                    "label": 0
                },
                {
                    "sent": "A relationship is that actually the main assumptions that we have in statistical modeling are violated because the error terms are.",
                    "label": 0
                },
                {
                    "sent": "We always assume that relative terms aren't correlating the observations are independent in classical.",
                    "label": 1
                },
                {
                    "sent": "Spatial analysis classical.",
                    "label": 0
                },
                {
                    "sent": "Statistical.",
                    "label": 0
                },
                {
                    "sent": "Techniques and but due to this violation we have for instance, if we consider the ordinary least squares regression.",
                    "label": 1
                },
                {
                    "sent": "What happens instead?",
                    "label": 0
                },
                {
                    "sent": "The correlation coefficient can be higher than the.",
                    "label": 0
                },
                {
                    "sent": "Actual value and we can have an impression of having high precision later, which is actually not true, and we can found we can find some statistically significant.",
                    "label": 0
                },
                {
                    "sent": "Associate.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we try and offer.",
                    "label": 0
                },
                {
                    "sent": "That's why.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I am in statistics.",
                    "label": 0
                },
                {
                    "sent": "Several models have been developed.",
                    "label": 0
                },
                {
                    "sent": "And then.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A general special model to take into account.",
                    "label": 0
                },
                {
                    "sent": "Alisa correlation, the general special model is formulated as this way which.",
                    "label": 0
                },
                {
                    "sent": "The dependent variable depends on the number of independent variables, but it also depends on the dependent variable in the nearby and the neighborhood is represented by a matrix or depends on the number of.",
                    "label": 1
                },
                {
                    "sent": "On the.",
                    "label": 0
                },
                {
                    "sent": "On the independent article creates in the nearby, and this is modeled by.",
                    "label": 0
                },
                {
                    "sent": "An another spatial weight metric system.",
                    "label": 0
                },
                {
                    "sent": "According to the fact that we put the Alpha Beta Gamma.",
                    "label": 0
                },
                {
                    "sent": "To 0 or not we can have from his general special.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's say that we can.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Generated several models that, like the classical linear model in which we, for instance, the determine the price of the House only on in terms of the independent.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Independent properties of the house.",
                    "label": 0
                },
                {
                    "sent": "But we can also have a special leg model in which we.",
                    "label": 0
                },
                {
                    "sent": "We determine the value of the price according to the value of the pricing neighborhood.",
                    "label": 0
                },
                {
                    "sent": "So we account from auto.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Relation we can have a special ever model which we account to do error we account for.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Related errors and we can account for spatial crossing aggressive models.",
                    "label": 0
                },
                {
                    "sent": "In which we determine, for instance, the price of a house according to the age of objects in the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "Question.",
                    "label": 0
                },
                {
                    "sent": "Yeah, could you just help explain?",
                    "label": 0
                },
                {
                    "sent": "So here we see age yeah said so you have the assets around the average age.",
                    "label": 0
                },
                {
                    "sent": "Here is these value is the value is the age of the building.",
                    "label": 0
                },
                {
                    "sent": "For which you want to estimate the price there on the flat for which we want to estimate the price.",
                    "label": 0
                },
                {
                    "sent": "But here age refers to age, since it's multiplied by V2 and V2 is a weight matrix, refers to the age of the name of the.",
                    "label": 0
                },
                {
                    "sent": "Special objects in the neighborhood.",
                    "label": 0
                },
                {
                    "sent": "So this is this is the equation after the estimation of the equation of the parameters of the tune itself.",
                    "label": 0
                },
                {
                    "sent": "Define well, the point is that D2 is actually should be known in advance.",
                    "label": 0
                },
                {
                    "sent": "So and.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This.",
                    "label": 0
                },
                {
                    "sent": "This is a limitation of this statistical modeling because yesterday, yeah, yeah you have to know in advance and this is a limitation of this statistical modeling.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's why we also investigated a relational approach to.",
                    "label": 0
                },
                {
                    "sent": "In which you.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "And some Colangelo showed you yesterday and relational approach can take.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Accountable for local correlation between within network correlation so you can easily consider both.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of auto correlation and cross correlation naturally.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a rich literature on this.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the delete also over these are relational approach.",
                    "label": 0
                },
                {
                    "sent": "In special temporary demand means that we have to recompute also this special relations and the one you have to deal with.",
                    "label": 0
                },
                {
                    "sent": "Joe references training data.",
                    "label": 0
                },
                {
                    "sent": "This is not basically practice.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just the last two slides there are to introduce analisa.",
                    "label": 0
                },
                {
                    "sent": "There are several tasks in a spatial temporal data mining that weekend device, like more, some task of loosely related to classical attribute oriented generalization, like the prediction of a special attribute considering both temporal and spatial dimension market classification regression.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Forecasting problem.",
                    "label": 0
                },
                {
                    "sent": "What the special temporal Data mining task software also is special oriented?",
                    "label": 0
                },
                {
                    "sent": "That generalization, where you have to really get this paid special properties where an earthquake is going to happen and when and which areas it's going to affect and at which level of damage and those are prediction of both spatial properties and temporal properties.",
                    "label": 0
                },
                {
                    "sent": "Or you can.",
                    "label": 0
                },
                {
                    "sent": "Consider a combination Mac.",
                    "label": 0
                },
                {
                    "sent": "In the case of transactions.",
                    "label": 0
                },
                {
                    "sent": "What we have.",
                    "label": 0
                },
                {
                    "sent": "An issue that we have investigated is that the point is that you can have really later now over special encoding the minor tasks because you have a creator of relationships so that you can be fine and you can try to.",
                    "label": 0
                },
                {
                    "sent": "Spatial thank God special temporal relationships you can write, for instance, to predict or to extract information on this special member relationships.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We try to investigate it.",
                    "label": 0
                },
                {
                    "sent": "A basic, a special temporal pattern which could be used in a different special temporal, combining tasks and like a frequent after we used in.",
                    "label": 0
                },
                {
                    "sent": "Which can which is used in Association analysis in a social media classification and.",
                    "label": 0
                },
                {
                    "sent": "In science class and then so.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And these function that we have introduced this code that render cluster and determine a training master.",
                    "label": 0
                },
                {
                    "sent": "We consider both the time orizon then and special dimension and also the value of an aspectual attribute.",
                    "label": 0
                },
                {
                    "sent": "So all information is in this.",
                    "label": 0
                },
                {
                    "sent": "In temple a spatial and non spatial temporal is enclosed in this pattern and Anna Lisa is now going to present.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "How is factoring?",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Use that in several classes.",
                    "label": 0
                },
                {
                    "sent": "Suck.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Tana.",
                    "label": 0
                },
                {
                    "sent": "My real question.",
                    "label": 0
                },
                {
                    "sent": "Seven on the property.",
                    "label": 0
                },
                {
                    "sent": "More than I was thinking about the objects on which you can apply those properties that we have in an ecosystem that involves the River and decisions or even found the flora in the River.",
                    "label": 0
                },
                {
                    "sent": "Some of those operations can be used in the River, for example, repulsion or attraction of water masses, but not all of them can be applied on order.",
                    "label": 0
                },
                {
                    "sent": "The individuals who are absurdly website efficient.",
                    "label": 0
                },
                {
                    "sent": "Cons of moving on moving on your mouse and flower?",
                    "label": 0
                },
                {
                    "sent": "That's true, but this is related to another issue I haven't had time to to present.",
                    "label": 0
                },
                {
                    "sent": "The fact that when you have a special temporal phenomena, you have typically different types of objects.",
                    "label": 0
                },
                {
                    "sent": "You have it or geniti of objects and then not all.",
                    "label": 0
                },
                {
                    "sent": "Of course, not all relationships makes sense between different types of objects so.",
                    "label": 0
                },
                {
                    "sent": "You have an additional degree of complexity which is in the unity so.",
                    "label": 0
                },
                {
                    "sent": "Over and the forms of data.",
                    "label": 0
                },
                {
                    "sent": "Would you please give us the opportunity of simplifying the problem?",
                    "label": 0
                },
                {
                    "sent": "Because at the end point you think is a relational model, we have said that transferring all those operations, that measurement model, special industry context behind others.",
                    "label": 0
                },
                {
                    "sent": "With this correctly very difficult, but for some of the object part we could reduce the complexity by ignoring some part of them.",
                    "label": 0
                },
                {
                    "sent": "Yeah, because of course there are the information on the on the track that.",
                    "label": 0
                },
                {
                    "sent": "Two special objects of different nature cannot be interacted directly at the weekend, interacted by means over, for instance, third type of object object can help with the you have this kind of background knowledge to reduce.",
                    "label": 0
                },
                {
                    "sent": "Some of the spatial relationships.",
                    "label": 0
                },
                {
                    "sent": "Consider.",
                    "label": 0
                }
            ]
        }
    }
}