{
    "id": "u72tm3ksyevd35jrhk3b4vg4j4dwrfal",
    "title": "Blackwell Approachability and No-Regret Learning are Equivalent",
    "info": {
        "author": [
            "Jacob Abernethy, Department of Electrical Engineering and Computer Sciences, UC Berkeley"
        ],
        "published": "Aug. 2, 2011",
        "recorded": "July 2011",
        "category": [
            "Top->Computer Science->Machine Learning->Computational Learning Theory"
        ]
    },
    "url": "http://videolectures.net/colt2011_abernethy_learning/",
    "segmentation": [
        [
            "So a lot is here.",
            "A lot of that is right there.",
            "Peter, I think is Australia Day when Peter recently we haven't seen students haven't seen in months so.",
            "He sees in Australia OK. Good good for confirmation.",
            "So this talk is about.",
            "A relationship between approach ability and no regret learning Norgate online learning.",
            "So when I give this talk, I'll."
        ],
        [
            "Like to mention quickly a little bit about one of the subjects of the talk, which is David Blackwell, I think he's black holes, known pretty well in statistics and definitely in information theory.",
            "He's not that well known in computer science, so he's sort of an unknown figure computer science.",
            "He's has a relatively impressive resume and especially impressive given that he was an African American born around 1920, so he got a job at Berkeley in that Department in 1955.",
            "And he was the first tenured black professor at Berkeley, so I was planning to.",
            "Ask him to my calls committee and I actually never met him and he passed away a year ago, which is quite sad, so I'd like to give this talk in memory of David Blackwell."
        ],
        [
            "So let's just do a quick review about two slides on a topic which I'm sure many of you know.",
            "That last two minutes really filled up the audience quickly.",
            "We doubled the audience size here.",
            "How was lunch folks was good?",
            "So I'm I'm sure."
        ],
        [
            "Many know this problem, so this is a generic problem template I'm going to mention.",
            "I'm sure many of you know this now.",
            "We have a sequential decision problem, so we have a we have a.",
            "Player has to choose a sequence of points from a convex set.",
            "Let's say that's gonna be called K. So every every round a player chooses XT from K. The adversary or nature chooses a linear cost function.",
            "So in the linear case now.",
            "So we have these linear cost functions and when the adversary chooses that cost function, the player pays FT XT.",
            "But you can also think is FTXTI might also use the inner product with texting.",
            "So these are vectors were doing vectors?",
            "Right now what we care about for this?",
            "For these these learning problems these ongoing problems.",
            "The standard metric is the regret right?",
            "So it's the money that you paid to play this game versus how much you might have played if you got to see the data all at once and could just fix a single point.",
            "This standard measurement from the quality of an online learning algorithm.",
            "So OK, so this is the model.",
            "Let's talk about the salute."
        ],
        [
            "This problem I would consider solved.",
            "We have dozens of algorithms or I would say at least it doesn't.",
            "Algorithms for this.",
            "For this problem you have most of those, or many of those been published in this particular conference over the last.",
            "Let's say I don't know ten years or so.",
            "Probably about 20 years and all the rates are essentially well known.",
            "We know where the rates we know upper bounds in our lower bound.",
            "Sometimes we actually Max values of the game, so this problem is very well understood.",
            "We know how efficient you can do this stuff.",
            "This is really the picture is very clear now, so we don't offend.",
            "Well, I won't mention the actual details, but you can look them up.",
            "There's plenty.",
            "Of course there's the excellent book by Gabor and and just Bianchi Nicola so."
        ],
        [
            "OK, so let's move on to the meat so the meat is about the approach ability problem.",
            "So I'm going to give a quick description about what approach ability is.",
            "I'm over here so I don't know if I could.",
            "So."
        ],
        [
            "Ability so I could talk about portability.",
            "I had to talk about the I've talked about the Min Max theorem.",
            "It's the way to describe this, but in terms of maximum so the standard Max theorem.",
            "By the way, Ivan Norman is a Hungarian Jew I think.",
            "So I think he left hungry.",
            "Maybe when but anyway, he's a famous character here, so the Max theorem says you know two players are playing games, a path matrix, you know the player one chooses the Rose, Player 2 chooses the column.",
            "And they get this space.",
            "Or when you know if the first player, if the player one goes first in player to go second.",
            "Turns out it doesn't matter who chooses which what the order is if the player one more to go second value the game with the same, the money would be the same.",
            "Right, and that's that's the, that's the way that it's often written.",
            "I don't actually like this description very much because it kind of sums.",
            "It looks like it should be symmetric because you see minmax maxmin.",
            "It turns out it's not true, right?",
            "And I think the better way to describe it is a swap of for all in there exist."
        ],
        [
            "So I'm going to generalize a little bit.",
            "This is Von Neumann, Min Max theorem, version 2.0, so the generalization now will be we have a just an arbitrary compact convex decision set in RN, which is the player ones action set.",
            "An arbitrary convex compact decision set at RM Player One chooses from expert users from why?",
            "And we have this biafine loss function, so it's fine in both of its coordinates, right?",
            "And it's going to return the value and the min Max theorem can be stated as if it's the case that for all X and the decision set there exists AY such that X, Y is at least as big as.",
            "See I'm ready in terms of satisfying constraint, but it's the same thing is at least as big as.",
            "See that it turns out that there is some oblivious strategy.",
            "So if the Y player has a response strategy, then it has also an oblivious strategy which gets the guarantee.",
            "That's actually pretty nice, right?",
            "Because This is why can depend on X and you can get what you want.",
            "I want to see dollars or white can just be arbitrary, right?",
            "I can have some oblivious strategy which I play in a matter of my opponent.",
            "Does I get?",
            "I get the value that I want, right?",
            "So that's the way to look at the maximum.",
            "And this is the way that I'd like to think about it, because this seems much harder right?",
            "When you put it like this.",
            "Seems like a really surprising result that I don't have to see I can do as well as I could in the worst case, without even seeing my opponent strategy.",
            "So what was blackwells?",
            "What did Blackwell add to this?"
        ],
        [
            "Well, he said, what happens if you're paid and you know in in not a single value.",
            "Let's say you're paid into currencies that aren't interchangeable, like money and happiness.",
            "You guys are academics.",
            "You should agree with that, right?",
            "So let's just I can write the same thing down.",
            "We have a biafine loss function, but now it's going to end up the payout will be in.",
            "It will be a vector or in order to be OK.",
            "So we can ask the exact same question.",
            "For all X, there exists a why Celebrex, Why OK, well this doesn't make sense anymore so I have to actually change that bit.",
            "So now we have actually a convex set S which you want to achieve.",
            "It's no longer this rates or some convex set.",
            "OK, so for all X there exists AY so I can respond with from wife responding text to get what I want.",
            "This is what I want.",
            "I want to get an S right?",
            "So it's just this generalization.",
            "OK is it true then that if this is true then does there just some oblivious wise?",
            "Is it for all X?",
            "Electro why is in S natural?",
            "Thank you hope that this would would hold right, it's just gone from duality one dimension duality, multiple dimensions.",
            "Do I get to it?",
            "Can I swap for all in there exists and it turns out that."
        ],
        [
            "Not true.",
            "So very simple counterexample and it goes like this.",
            "Just take so X&Y are just the integral elements, Why is the pair of X, Y and the set that we're going to do is just that the set is equals Y or X = X, right?",
            "So this line, OK, so check first for all X or just the wisest eczema.",
            "Why isn't S?",
            "Is this true?",
            "Obvious, I just said.",
            "White girl sex.",
            "Yeah good so good.",
            "What about just a wise it's for all XX, Y is an answer or ex equals wife.",
            "This is the same thing.",
            "This is obviously not true.",
            "OK, so you obviously don't get the swap for on there exists.",
            "In this case, it's just.",
            "It's obviously true you can't do this.",
            "So.",
            "The news isn't so bad."
        ],
        [
            "Explain.",
            "So Blackwell showed something which is kind of nice.",
            "The trick is we have to be able to play this game repeatedly.",
            "So let's say let's just take these definitions.",
            "I call this response satisfiability we've defined in the papers, response satisfiability.",
            "If I can respond, then I get the goal that I want.",
            "This one says I just have to play an oblivious thing.",
            "You get the little one.",
            "Well, this does not imply that based in the previous example, we don't get this week thing applying the strong thing, but we get something which is intermediate.",
            "OK, so we're going to look at a sequential game, and we're going to continue the average payoff vectors.",
            "So this is the average pay after after playing for T rounds.",
            "And I'm actually not going to say that it lands inside of S inside of this convex set, but I can say that the distance is going to go to 0, so the distance between my average point in S is going to zero.",
            "And to make this statement precise, I just say there exists an algorithm.",
            "I have an algorithm that I can construct which can choose X is which you choose XT as a function of Y, one through Y, T -- 1.",
            "So we can look at the history of the opponents plays and choose the text such that this average thing goes to 0.",
            "It's arbitrary close task.",
            "So that's the approach ability.",
            "So a set is approachable if this statement holds.",
            "If I can, if you can do this if you can come up with the adaptive algorithm.",
            "OK, So what black Wolf showed is that although you can't prove that that implies that you can't show that.",
            "The response satisfied satisfiability condition does imply the approachability condition, so you can get this sort of satisfiability in the limit right.",
            "Asymptotically you get what you want.",
            "Good."
        ],
        [
            "So OK, so let's look at the example 'cause I showed you example where you can't get the strong condition.",
            "The you don't get these, just the satisfiability condition.",
            "What would be the approachability strategy in this scenario?",
            "So remember, I want the average path vector, which of these X, wise to approach the set S?",
            "Now with assesses the settings, Z.",
            "So how can they approach S?",
            "What should I choose for you?",
            "Answered this question once, so don't say it not you know the guy behind you.",
            "So anyone, it's kind of an obvious thing.",
            "How I came back and depends on why 130 -- 1 but XD can't depend on YT obviously.",
            "What's that previous?",
            "Whitey, exactly?",
            "So that's the easy one.",
            "Just said X equal to 1 and then this some just off from this one by one last one coordinates over one value.",
            "So even though obviously this thing approaches, the Sensi comes easy.",
            "It's really easy right now this isn't trivial example.",
            "I don't want to confuse you.",
            "The probability theorem is actually hard.",
            "I mean there's nothing trivial about it.",
            "I mean in most cases you don't get a simple strategy.",
            "You have to look back at the all of the wise you've seen and you have to be smart.",
            "Or maybe some aggregate?"
        ],
        [
            "Otherwise, OK, so if you look at the literature, this approach ability theorem has been like a really useful tool throughout.",
            "I mean, you just see it come up over and over again and there are just many, many papers that have made have reduced things to the probability problem.",
            "So I mean, I'm just I just took a selection here and you can find plenty more.",
            "So it has been a fundamental tool.",
            "People often say I want to do something so it sounds like it's a pretty problem and they managed to find a way to plug-in approach ability so it's nice and it's a.",
            "It's a good little trick to learn."
        ],
        [
            "What is the result that we have?",
            "Well, there is this assumption.",
            "I mean I think it was an inherent assumption.",
            "I don't know if it was ever said explicitly that you know I mentioned.",
            "I don't know if I mentioned this, but you can reduce Min Max duality to regret minimization.",
            "And you could end Black will actually observe that you can actually reduce well he had done it for a particular problem.",
            "You can actually reduce regret minimization to portability.",
            "So he showed that you can actually find this sort of experts algorithm.",
            "You approach ability to construct the next experts algorithm.",
            "There was sort of this assumption that this was sort of the most.",
            "This is the strongest thing down here.",
            "I and we actually show in the paper."
        ],
        [
            "Are there actually equivalent?",
            "So approachability organization?",
            "Or actually the same problem?",
            "A very fundamental way in in an algorithmic way.",
            "So I'll explain what I mean by that."
        ],
        [
            "OK, so if I write down you can.",
            "OK, I'm just going to write down what these two problems are.",
            "Organization says that given any sequence of XTS coming from sequence of functions coming in order to be, you can choose a sequence of .60 in a convex set such that the money you pay versus the money you might have paid in hindsight that value is sublinear in T. OK, that's that's organization.",
            "And then this approach ability says that, well, yeah, if you have some biafine loss function, I can choose strategies XD right such that whatever this biafine loss function is, I can make sure that the distance of the average thing goes to 0.",
            "I mean, I don't just look at.",
            "I don't know if it's clear that these are.",
            "These would be related at all, but they both have a sense of repeated games, right repeated games and no adversary responses.",
            "So what we did is."
        ],
        [
            "We have a reduction, so we have an efficient reduction for randomization portability and efficient reduction from approach.",
            "Ability to rap minimization.",
            "What does that mean?",
            "Well, if you have a strategy for approach ability.",
            "And you have a recommendation problem.",
            "You can construct it.",
            "You can just convert your recommendation problem efficiently.",
            "We can officially take the problem and turn it into an affordability problem, then solve the probability problems said that was actually a piece that Blackwell had already seen.",
            "Just a certain set to a certain extent.",
            "Or if you have a recommendation algorithm, but an approachability problem, you can just wrap this thing up and turn it into a recommendation problem.",
            "And that's the key trick.",
            "And actually the proofs actually aren't there, and the constructions aren't that difficult."
        ],
        [
            "I'm just going to write it down to see this is the construction for reducing approach ability through recommendation.",
            "This is this is the construction.",
            "It's pretty straightforward on one slide.",
            "I want explain the details.",
            "I'll explain from a high level what the trick is, what's going on.",
            "So."
        ],
        [
            "You need to use cone duality, so we're going to 1st.",
            "We're going to manage everything lies in cones, so we're going to do and so the sets we want approaches that you want to learn in there all cones.",
            "That makes things easy, and it turns out if not cones is this classic trick.",
            "You just added dimension and you just fill in the cone.",
            "I mean, I'm sure everyone seen this trick at some point.",
            "You can take a take a set and just make it a cone by adding a dimension.",
            "And then quantify it.",
            "So there's some technical details there, but that's that trick works.",
            "So if I want to do learning online learning in one cone.",
            "Right, it turns out I just.",
            "I just construct this dual cone.",
            "This thing called the polar cone or the dual cone, depending on who you talk too.",
            "I think the correct term is actually the polar cone.",
            "I could go to the polar cone, convert, get approachability problem and I could tell that they were great is bounded by the regret of my learning problem is actually bounded by the approachability distance.",
            "Right and and you know, there isn't a lot of.",
            "There is a little bit of constancy, right?",
            "It's a nice little.",
            "It's very simple, bound.",
            "Also, if I have an approachability problem.",
            "I could just turn that into a. I can look at the dual cone and do regret minimization in this dual cone, and the approachability distances then just bounded by the average regret.",
            "And you know the threat was on the set, which is this intersection between the dual cone S intersected with the ball of radius, the bowl of radius one in the two norm.",
            "Details there and I I'm leaving them to those who are insured."
        ],
        [
            "Come up let me show you this one key lemma that kind of makes this whole thing work, and this will probably sort of give you a sense of what's going on.",
            "So if I want to figure out the distance between a point and a cone, that distance right there, there's a nice way to write that distance.",
            "In a dual way so distance you know it's this.",
            "I want to find out the shortest path between there.",
            "It turns out it's actually just the maximum dot product between this point and this set right here.",
            "Well, this set is just the cone, the dual cone or the polar cone intersected with the ball of radius one.",
            "And you can sort of check this in your head.",
            "I mean this this vector is going to be orthogonal to the cone.",
            "And it's and that's going to be correspond to a point in the dual space.",
            "So right so that's this is the key trick."
        ],
        [
            "OK, I'll mention a couple of applications and some conclusions.",
            "What we did is we essentially generalized the approachability problem.",
            "We take this thing Anna generalized also to function spaces.",
            "Turns out you can do approach ability with where the payoff is a function.",
            "There's this trick we get.",
            "We don't get this nice efficient algorithm for calibrated forecasting.",
            "Going to actually describe that in more detail in the next couple of slides, and you can sort of, I think the nicest thing is, it gives a new way to look at approach ability and it gives a clear picture of the whole family of problems minimizing regret, an approach, ability, and the nice conceptual pieces that these things are really the same.",
            "There just dual these dual concepts.",
            "So."
        ],
        [
            "Just to give a quick sketch of the forecasting train, the calibrated forecasting trick I mentioned in the.",
            "I don't want too much detail.",
            "I mentioned in my open problem session and I'm sure most of you were.",
            "Imagine most of you were there.",
            "You can, you can if you want to find a calibrated forecaster for an arbitrary sequence of outcomes, or you're making probability predictions you'd like to get calibration limit, so asymptotically liberation, and this is, you know, a difficult problem.",
            "There's lots of work out there."
        ],
        [
            "Turns out that there existed already a reduction from calibration to approachability that was by Dean Foster in 99.",
            "I think I should be 97 and we apply this reduction from approach ability to regret minimization, right?",
            "And we have an efficient way to do that.",
            "And it turns out that dumb, if you're smart, you're careful between the calibration to approach ability reduction, you get instead of one over epsilon algorithm.",
            "Get alot of things you can do a binary search.",
            "It's a simple trick.",
            "Now when you go from probability randomization, it turns out if you use the right algorithm, which we we know how to do randomization efficiently.",
            "If you use this for an algorithm, you get, you get some efficient and in this direction this so this piece is also easy.",
            "It's easy to do.",
            "So now this whole pipeline is as efficient, which is nice.",
            "So people hadn't really thought that much about efficiency of of approach ability.",
            "But now we can sort of say, well in some cases we have this nice.",
            "We have this nice trick we can apply to do a renovation that patient 'cause we know how to make.",
            "We know in some cases to make recommendation efficient.",
            "So I."
        ],
        [
            "I think that is all.",
            "Questions.",
            "Why didn't your mom come to this talk?",
            "She's on her way to the airport.",
            "I sent it off her flights in like 8 hours.",
            "Yep.",
            "Yeah, that's why I don't.",
            "I mean, the whole oldest.",
            "Love this stuff.",
            "It really requires the convexity assumption.",
            "No, I mean, just who cares what the nonconvex case?",
            "Your mother does not exist.",
            "My mother doesn't care the next day, so.",
            "Question what breaks the reduction from calibration to approach ability?",
            "I mean you've got it in the binary case, so apropos of your open questions, I think nothing breaks, but you can't do the binary search anymore.",
            "That binary search is a is a is a only works in one dimension where you can look at the probability interval, right?",
            "So that breaks, yeah.",
            "If the action space is not a code, and then you can quantify it by lifting it to one more dimension, but then the action space isn't still a cone, right?",
            "It's like a cone intersected with a hyperplane.",
            "So if you take a set like take a set, let's say in R2, then you like raise it up at a dimension at a third dimension, raise it up by 1:00, and then you fill in.",
            "From there you get it, you get a cone.",
            "Right like Razer setup?",
            "Oh yeah, yeah no.",
            "And there's a very common there's a key lemma that says that the distances don't really feel like you're looking at distances to disco now.",
            "Not distance is the original set, and it turns out they will get perturbed by like a squirt of two or something.",
            "And I think it's you can make it 1 if you were careful, but it just perturbed by constant and then multiplicative constant so that all the important qualities get preserved by this process.",
            "So it's a good question, but you'll see in the paper that you know there's a two or three lemons that we have to.",
            "No further questions.",
            "Let's thank Jake."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So a lot is here.",
                    "label": 0
                },
                {
                    "sent": "A lot of that is right there.",
                    "label": 0
                },
                {
                    "sent": "Peter, I think is Australia Day when Peter recently we haven't seen students haven't seen in months so.",
                    "label": 0
                },
                {
                    "sent": "He sees in Australia OK. Good good for confirmation.",
                    "label": 0
                },
                {
                    "sent": "So this talk is about.",
                    "label": 0
                },
                {
                    "sent": "A relationship between approach ability and no regret learning Norgate online learning.",
                    "label": 1
                },
                {
                    "sent": "So when I give this talk, I'll.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Like to mention quickly a little bit about one of the subjects of the talk, which is David Blackwell, I think he's black holes, known pretty well in statistics and definitely in information theory.",
                    "label": 0
                },
                {
                    "sent": "He's not that well known in computer science, so he's sort of an unknown figure computer science.",
                    "label": 0
                },
                {
                    "sent": "He's has a relatively impressive resume and especially impressive given that he was an African American born around 1920, so he got a job at Berkeley in that Department in 1955.",
                    "label": 1
                },
                {
                    "sent": "And he was the first tenured black professor at Berkeley, so I was planning to.",
                    "label": 0
                },
                {
                    "sent": "Ask him to my calls committee and I actually never met him and he passed away a year ago, which is quite sad, so I'd like to give this talk in memory of David Blackwell.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's just do a quick review about two slides on a topic which I'm sure many of you know.",
                    "label": 0
                },
                {
                    "sent": "That last two minutes really filled up the audience quickly.",
                    "label": 0
                },
                {
                    "sent": "We doubled the audience size here.",
                    "label": 0
                },
                {
                    "sent": "How was lunch folks was good?",
                    "label": 0
                },
                {
                    "sent": "So I'm I'm sure.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Many know this problem, so this is a generic problem template I'm going to mention.",
                    "label": 0
                },
                {
                    "sent": "I'm sure many of you know this now.",
                    "label": 0
                },
                {
                    "sent": "We have a sequential decision problem, so we have a we have a.",
                    "label": 0
                },
                {
                    "sent": "Player has to choose a sequence of points from a convex set.",
                    "label": 0
                },
                {
                    "sent": "Let's say that's gonna be called K. So every every round a player chooses XT from K. The adversary or nature chooses a linear cost function.",
                    "label": 0
                },
                {
                    "sent": "So in the linear case now.",
                    "label": 0
                },
                {
                    "sent": "So we have these linear cost functions and when the adversary chooses that cost function, the player pays FT XT.",
                    "label": 0
                },
                {
                    "sent": "But you can also think is FTXTI might also use the inner product with texting.",
                    "label": 0
                },
                {
                    "sent": "So these are vectors were doing vectors?",
                    "label": 0
                },
                {
                    "sent": "Right now what we care about for this?",
                    "label": 0
                },
                {
                    "sent": "For these these learning problems these ongoing problems.",
                    "label": 0
                },
                {
                    "sent": "The standard metric is the regret right?",
                    "label": 0
                },
                {
                    "sent": "So it's the money that you paid to play this game versus how much you might have played if you got to see the data all at once and could just fix a single point.",
                    "label": 0
                },
                {
                    "sent": "This standard measurement from the quality of an online learning algorithm.",
                    "label": 0
                },
                {
                    "sent": "So OK, so this is the model.",
                    "label": 0
                },
                {
                    "sent": "Let's talk about the salute.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This problem I would consider solved.",
                    "label": 0
                },
                {
                    "sent": "We have dozens of algorithms or I would say at least it doesn't.",
                    "label": 0
                },
                {
                    "sent": "Algorithms for this.",
                    "label": 0
                },
                {
                    "sent": "For this problem you have most of those, or many of those been published in this particular conference over the last.",
                    "label": 0
                },
                {
                    "sent": "Let's say I don't know ten years or so.",
                    "label": 0
                },
                {
                    "sent": "Probably about 20 years and all the rates are essentially well known.",
                    "label": 0
                },
                {
                    "sent": "We know where the rates we know upper bounds in our lower bound.",
                    "label": 0
                },
                {
                    "sent": "Sometimes we actually Max values of the game, so this problem is very well understood.",
                    "label": 0
                },
                {
                    "sent": "We know how efficient you can do this stuff.",
                    "label": 0
                },
                {
                    "sent": "This is really the picture is very clear now, so we don't offend.",
                    "label": 0
                },
                {
                    "sent": "Well, I won't mention the actual details, but you can look them up.",
                    "label": 0
                },
                {
                    "sent": "There's plenty.",
                    "label": 0
                },
                {
                    "sent": "Of course there's the excellent book by Gabor and and just Bianchi Nicola so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so let's move on to the meat so the meat is about the approach ability problem.",
                    "label": 0
                },
                {
                    "sent": "So I'm going to give a quick description about what approach ability is.",
                    "label": 0
                },
                {
                    "sent": "I'm over here so I don't know if I could.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Ability so I could talk about portability.",
                    "label": 0
                },
                {
                    "sent": "I had to talk about the I've talked about the Min Max theorem.",
                    "label": 0
                },
                {
                    "sent": "It's the way to describe this, but in terms of maximum so the standard Max theorem.",
                    "label": 0
                },
                {
                    "sent": "By the way, Ivan Norman is a Hungarian Jew I think.",
                    "label": 0
                },
                {
                    "sent": "So I think he left hungry.",
                    "label": 0
                },
                {
                    "sent": "Maybe when but anyway, he's a famous character here, so the Max theorem says you know two players are playing games, a path matrix, you know the player one chooses the Rose, Player 2 chooses the column.",
                    "label": 0
                },
                {
                    "sent": "And they get this space.",
                    "label": 0
                },
                {
                    "sent": "Or when you know if the first player, if the player one goes first in player to go second.",
                    "label": 1
                },
                {
                    "sent": "Turns out it doesn't matter who chooses which what the order is if the player one more to go second value the game with the same, the money would be the same.",
                    "label": 1
                },
                {
                    "sent": "Right, and that's that's the, that's the way that it's often written.",
                    "label": 0
                },
                {
                    "sent": "I don't actually like this description very much because it kind of sums.",
                    "label": 0
                },
                {
                    "sent": "It looks like it should be symmetric because you see minmax maxmin.",
                    "label": 0
                },
                {
                    "sent": "It turns out it's not true, right?",
                    "label": 0
                },
                {
                    "sent": "And I think the better way to describe it is a swap of for all in there exist.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm going to generalize a little bit.",
                    "label": 0
                },
                {
                    "sent": "This is Von Neumann, Min Max theorem, version 2.0, so the generalization now will be we have a just an arbitrary compact convex decision set in RN, which is the player ones action set.",
                    "label": 0
                },
                {
                    "sent": "An arbitrary convex compact decision set at RM Player One chooses from expert users from why?",
                    "label": 0
                },
                {
                    "sent": "And we have this biafine loss function, so it's fine in both of its coordinates, right?",
                    "label": 0
                },
                {
                    "sent": "And it's going to return the value and the min Max theorem can be stated as if it's the case that for all X and the decision set there exists AY such that X, Y is at least as big as.",
                    "label": 0
                },
                {
                    "sent": "See I'm ready in terms of satisfying constraint, but it's the same thing is at least as big as.",
                    "label": 0
                },
                {
                    "sent": "See that it turns out that there is some oblivious strategy.",
                    "label": 0
                },
                {
                    "sent": "So if the Y player has a response strategy, then it has also an oblivious strategy which gets the guarantee.",
                    "label": 0
                },
                {
                    "sent": "That's actually pretty nice, right?",
                    "label": 0
                },
                {
                    "sent": "Because This is why can depend on X and you can get what you want.",
                    "label": 0
                },
                {
                    "sent": "I want to see dollars or white can just be arbitrary, right?",
                    "label": 0
                },
                {
                    "sent": "I can have some oblivious strategy which I play in a matter of my opponent.",
                    "label": 0
                },
                {
                    "sent": "Does I get?",
                    "label": 0
                },
                {
                    "sent": "I get the value that I want, right?",
                    "label": 0
                },
                {
                    "sent": "So that's the way to look at the maximum.",
                    "label": 0
                },
                {
                    "sent": "And this is the way that I'd like to think about it, because this seems much harder right?",
                    "label": 0
                },
                {
                    "sent": "When you put it like this.",
                    "label": 0
                },
                {
                    "sent": "Seems like a really surprising result that I don't have to see I can do as well as I could in the worst case, without even seeing my opponent strategy.",
                    "label": 0
                },
                {
                    "sent": "So what was blackwells?",
                    "label": 0
                },
                {
                    "sent": "What did Blackwell add to this?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, he said, what happens if you're paid and you know in in not a single value.",
                    "label": 0
                },
                {
                    "sent": "Let's say you're paid into currencies that aren't interchangeable, like money and happiness.",
                    "label": 1
                },
                {
                    "sent": "You guys are academics.",
                    "label": 0
                },
                {
                    "sent": "You should agree with that, right?",
                    "label": 0
                },
                {
                    "sent": "So let's just I can write the same thing down.",
                    "label": 0
                },
                {
                    "sent": "We have a biafine loss function, but now it's going to end up the payout will be in.",
                    "label": 0
                },
                {
                    "sent": "It will be a vector or in order to be OK.",
                    "label": 0
                },
                {
                    "sent": "So we can ask the exact same question.",
                    "label": 0
                },
                {
                    "sent": "For all X, there exists a why Celebrex, Why OK, well this doesn't make sense anymore so I have to actually change that bit.",
                    "label": 0
                },
                {
                    "sent": "So now we have actually a convex set S which you want to achieve.",
                    "label": 0
                },
                {
                    "sent": "It's no longer this rates or some convex set.",
                    "label": 0
                },
                {
                    "sent": "OK, so for all X there exists AY so I can respond with from wife responding text to get what I want.",
                    "label": 0
                },
                {
                    "sent": "This is what I want.",
                    "label": 0
                },
                {
                    "sent": "I want to get an S right?",
                    "label": 0
                },
                {
                    "sent": "So it's just this generalization.",
                    "label": 0
                },
                {
                    "sent": "OK is it true then that if this is true then does there just some oblivious wise?",
                    "label": 0
                },
                {
                    "sent": "Is it for all X?",
                    "label": 0
                },
                {
                    "sent": "Electro why is in S natural?",
                    "label": 0
                },
                {
                    "sent": "Thank you hope that this would would hold right, it's just gone from duality one dimension duality, multiple dimensions.",
                    "label": 0
                },
                {
                    "sent": "Do I get to it?",
                    "label": 0
                },
                {
                    "sent": "Can I swap for all in there exists and it turns out that.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Not true.",
                    "label": 0
                },
                {
                    "sent": "So very simple counterexample and it goes like this.",
                    "label": 0
                },
                {
                    "sent": "Just take so X&Y are just the integral elements, Why is the pair of X, Y and the set that we're going to do is just that the set is equals Y or X = X, right?",
                    "label": 0
                },
                {
                    "sent": "So this line, OK, so check first for all X or just the wisest eczema.",
                    "label": 0
                },
                {
                    "sent": "Why isn't S?",
                    "label": 0
                },
                {
                    "sent": "Is this true?",
                    "label": 0
                },
                {
                    "sent": "Obvious, I just said.",
                    "label": 0
                },
                {
                    "sent": "White girl sex.",
                    "label": 0
                },
                {
                    "sent": "Yeah good so good.",
                    "label": 0
                },
                {
                    "sent": "What about just a wise it's for all XX, Y is an answer or ex equals wife.",
                    "label": 0
                },
                {
                    "sent": "This is the same thing.",
                    "label": 0
                },
                {
                    "sent": "This is obviously not true.",
                    "label": 0
                },
                {
                    "sent": "OK, so you obviously don't get the swap for on there exists.",
                    "label": 0
                },
                {
                    "sent": "In this case, it's just.",
                    "label": 0
                },
                {
                    "sent": "It's obviously true you can't do this.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The news isn't so bad.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Explain.",
                    "label": 0
                },
                {
                    "sent": "So Blackwell showed something which is kind of nice.",
                    "label": 0
                },
                {
                    "sent": "The trick is we have to be able to play this game repeatedly.",
                    "label": 0
                },
                {
                    "sent": "So let's say let's just take these definitions.",
                    "label": 0
                },
                {
                    "sent": "I call this response satisfiability we've defined in the papers, response satisfiability.",
                    "label": 0
                },
                {
                    "sent": "If I can respond, then I get the goal that I want.",
                    "label": 0
                },
                {
                    "sent": "This one says I just have to play an oblivious thing.",
                    "label": 0
                },
                {
                    "sent": "You get the little one.",
                    "label": 0
                },
                {
                    "sent": "Well, this does not imply that based in the previous example, we don't get this week thing applying the strong thing, but we get something which is intermediate.",
                    "label": 0
                },
                {
                    "sent": "OK, so we're going to look at a sequential game, and we're going to continue the average payoff vectors.",
                    "label": 0
                },
                {
                    "sent": "So this is the average pay after after playing for T rounds.",
                    "label": 0
                },
                {
                    "sent": "And I'm actually not going to say that it lands inside of S inside of this convex set, but I can say that the distance is going to go to 0, so the distance between my average point in S is going to zero.",
                    "label": 0
                },
                {
                    "sent": "And to make this statement precise, I just say there exists an algorithm.",
                    "label": 0
                },
                {
                    "sent": "I have an algorithm that I can construct which can choose X is which you choose XT as a function of Y, one through Y, T -- 1.",
                    "label": 0
                },
                {
                    "sent": "So we can look at the history of the opponents plays and choose the text such that this average thing goes to 0.",
                    "label": 0
                },
                {
                    "sent": "It's arbitrary close task.",
                    "label": 0
                },
                {
                    "sent": "So that's the approach ability.",
                    "label": 0
                },
                {
                    "sent": "So a set is approachable if this statement holds.",
                    "label": 1
                },
                {
                    "sent": "If I can, if you can do this if you can come up with the adaptive algorithm.",
                    "label": 0
                },
                {
                    "sent": "OK, So what black Wolf showed is that although you can't prove that that implies that you can't show that.",
                    "label": 0
                },
                {
                    "sent": "The response satisfied satisfiability condition does imply the approachability condition, so you can get this sort of satisfiability in the limit right.",
                    "label": 0
                },
                {
                    "sent": "Asymptotically you get what you want.",
                    "label": 0
                },
                {
                    "sent": "Good.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So OK, so let's look at the example 'cause I showed you example where you can't get the strong condition.",
                    "label": 0
                },
                {
                    "sent": "The you don't get these, just the satisfiability condition.",
                    "label": 0
                },
                {
                    "sent": "What would be the approachability strategy in this scenario?",
                    "label": 0
                },
                {
                    "sent": "So remember, I want the average path vector, which of these X, wise to approach the set S?",
                    "label": 0
                },
                {
                    "sent": "Now with assesses the settings, Z.",
                    "label": 0
                },
                {
                    "sent": "So how can they approach S?",
                    "label": 0
                },
                {
                    "sent": "What should I choose for you?",
                    "label": 0
                },
                {
                    "sent": "Answered this question once, so don't say it not you know the guy behind you.",
                    "label": 0
                },
                {
                    "sent": "So anyone, it's kind of an obvious thing.",
                    "label": 0
                },
                {
                    "sent": "How I came back and depends on why 130 -- 1 but XD can't depend on YT obviously.",
                    "label": 0
                },
                {
                    "sent": "What's that previous?",
                    "label": 0
                },
                {
                    "sent": "Whitey, exactly?",
                    "label": 0
                },
                {
                    "sent": "So that's the easy one.",
                    "label": 0
                },
                {
                    "sent": "Just said X equal to 1 and then this some just off from this one by one last one coordinates over one value.",
                    "label": 0
                },
                {
                    "sent": "So even though obviously this thing approaches, the Sensi comes easy.",
                    "label": 0
                },
                {
                    "sent": "It's really easy right now this isn't trivial example.",
                    "label": 0
                },
                {
                    "sent": "I don't want to confuse you.",
                    "label": 0
                },
                {
                    "sent": "The probability theorem is actually hard.",
                    "label": 0
                },
                {
                    "sent": "I mean there's nothing trivial about it.",
                    "label": 0
                },
                {
                    "sent": "I mean in most cases you don't get a simple strategy.",
                    "label": 0
                },
                {
                    "sent": "You have to look back at the all of the wise you've seen and you have to be smart.",
                    "label": 0
                },
                {
                    "sent": "Or maybe some aggregate?",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Otherwise, OK, so if you look at the literature, this approach ability theorem has been like a really useful tool throughout.",
                    "label": 0
                },
                {
                    "sent": "I mean, you just see it come up over and over again and there are just many, many papers that have made have reduced things to the probability problem.",
                    "label": 0
                },
                {
                    "sent": "So I mean, I'm just I just took a selection here and you can find plenty more.",
                    "label": 0
                },
                {
                    "sent": "So it has been a fundamental tool.",
                    "label": 0
                },
                {
                    "sent": "People often say I want to do something so it sounds like it's a pretty problem and they managed to find a way to plug-in approach ability so it's nice and it's a.",
                    "label": 0
                },
                {
                    "sent": "It's a good little trick to learn.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What is the result that we have?",
                    "label": 0
                },
                {
                    "sent": "Well, there is this assumption.",
                    "label": 0
                },
                {
                    "sent": "I mean I think it was an inherent assumption.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it was ever said explicitly that you know I mentioned.",
                    "label": 0
                },
                {
                    "sent": "I don't know if I mentioned this, but you can reduce Min Max duality to regret minimization.",
                    "label": 0
                },
                {
                    "sent": "And you could end Black will actually observe that you can actually reduce well he had done it for a particular problem.",
                    "label": 0
                },
                {
                    "sent": "You can actually reduce regret minimization to portability.",
                    "label": 1
                },
                {
                    "sent": "So he showed that you can actually find this sort of experts algorithm.",
                    "label": 0
                },
                {
                    "sent": "You approach ability to construct the next experts algorithm.",
                    "label": 0
                },
                {
                    "sent": "There was sort of this assumption that this was sort of the most.",
                    "label": 0
                },
                {
                    "sent": "This is the strongest thing down here.",
                    "label": 0
                },
                {
                    "sent": "I and we actually show in the paper.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Are there actually equivalent?",
                    "label": 0
                },
                {
                    "sent": "So approachability organization?",
                    "label": 0
                },
                {
                    "sent": "Or actually the same problem?",
                    "label": 0
                },
                {
                    "sent": "A very fundamental way in in an algorithmic way.",
                    "label": 0
                },
                {
                    "sent": "So I'll explain what I mean by that.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so if I write down you can.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm just going to write down what these two problems are.",
                    "label": 0
                },
                {
                    "sent": "Organization says that given any sequence of XTS coming from sequence of functions coming in order to be, you can choose a sequence of .60 in a convex set such that the money you pay versus the money you might have paid in hindsight that value is sublinear in T. OK, that's that's organization.",
                    "label": 0
                },
                {
                    "sent": "And then this approach ability says that, well, yeah, if you have some biafine loss function, I can choose strategies XD right such that whatever this biafine loss function is, I can make sure that the distance of the average thing goes to 0.",
                    "label": 0
                },
                {
                    "sent": "I mean, I don't just look at.",
                    "label": 0
                },
                {
                    "sent": "I don't know if it's clear that these are.",
                    "label": 0
                },
                {
                    "sent": "These would be related at all, but they both have a sense of repeated games, right repeated games and no adversary responses.",
                    "label": 0
                },
                {
                    "sent": "So what we did is.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We have a reduction, so we have an efficient reduction for randomization portability and efficient reduction from approach.",
                    "label": 0
                },
                {
                    "sent": "Ability to rap minimization.",
                    "label": 0
                },
                {
                    "sent": "What does that mean?",
                    "label": 0
                },
                {
                    "sent": "Well, if you have a strategy for approach ability.",
                    "label": 0
                },
                {
                    "sent": "And you have a recommendation problem.",
                    "label": 0
                },
                {
                    "sent": "You can construct it.",
                    "label": 0
                },
                {
                    "sent": "You can just convert your recommendation problem efficiently.",
                    "label": 0
                },
                {
                    "sent": "We can officially take the problem and turn it into an affordability problem, then solve the probability problems said that was actually a piece that Blackwell had already seen.",
                    "label": 0
                },
                {
                    "sent": "Just a certain set to a certain extent.",
                    "label": 0
                },
                {
                    "sent": "Or if you have a recommendation algorithm, but an approachability problem, you can just wrap this thing up and turn it into a recommendation problem.",
                    "label": 0
                },
                {
                    "sent": "And that's the key trick.",
                    "label": 0
                },
                {
                    "sent": "And actually the proofs actually aren't there, and the constructions aren't that difficult.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm just going to write it down to see this is the construction for reducing approach ability through recommendation.",
                    "label": 0
                },
                {
                    "sent": "This is this is the construction.",
                    "label": 0
                },
                {
                    "sent": "It's pretty straightforward on one slide.",
                    "label": 0
                },
                {
                    "sent": "I want explain the details.",
                    "label": 0
                },
                {
                    "sent": "I'll explain from a high level what the trick is, what's going on.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "You need to use cone duality, so we're going to 1st.",
                    "label": 1
                },
                {
                    "sent": "We're going to manage everything lies in cones, so we're going to do and so the sets we want approaches that you want to learn in there all cones.",
                    "label": 0
                },
                {
                    "sent": "That makes things easy, and it turns out if not cones is this classic trick.",
                    "label": 1
                },
                {
                    "sent": "You just added dimension and you just fill in the cone.",
                    "label": 0
                },
                {
                    "sent": "I mean, I'm sure everyone seen this trick at some point.",
                    "label": 0
                },
                {
                    "sent": "You can take a take a set and just make it a cone by adding a dimension.",
                    "label": 0
                },
                {
                    "sent": "And then quantify it.",
                    "label": 0
                },
                {
                    "sent": "So there's some technical details there, but that's that trick works.",
                    "label": 0
                },
                {
                    "sent": "So if I want to do learning online learning in one cone.",
                    "label": 0
                },
                {
                    "sent": "Right, it turns out I just.",
                    "label": 0
                },
                {
                    "sent": "I just construct this dual cone.",
                    "label": 0
                },
                {
                    "sent": "This thing called the polar cone or the dual cone, depending on who you talk too.",
                    "label": 0
                },
                {
                    "sent": "I think the correct term is actually the polar cone.",
                    "label": 0
                },
                {
                    "sent": "I could go to the polar cone, convert, get approachability problem and I could tell that they were great is bounded by the regret of my learning problem is actually bounded by the approachability distance.",
                    "label": 0
                },
                {
                    "sent": "Right and and you know, there isn't a lot of.",
                    "label": 0
                },
                {
                    "sent": "There is a little bit of constancy, right?",
                    "label": 0
                },
                {
                    "sent": "It's a nice little.",
                    "label": 0
                },
                {
                    "sent": "It's very simple, bound.",
                    "label": 0
                },
                {
                    "sent": "Also, if I have an approachability problem.",
                    "label": 0
                },
                {
                    "sent": "I could just turn that into a. I can look at the dual cone and do regret minimization in this dual cone, and the approachability distances then just bounded by the average regret.",
                    "label": 0
                },
                {
                    "sent": "And you know the threat was on the set, which is this intersection between the dual cone S intersected with the ball of radius, the bowl of radius one in the two norm.",
                    "label": 1
                },
                {
                    "sent": "Details there and I I'm leaving them to those who are insured.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Come up let me show you this one key lemma that kind of makes this whole thing work, and this will probably sort of give you a sense of what's going on.",
                    "label": 1
                },
                {
                    "sent": "So if I want to figure out the distance between a point and a cone, that distance right there, there's a nice way to write that distance.",
                    "label": 0
                },
                {
                    "sent": "In a dual way so distance you know it's this.",
                    "label": 0
                },
                {
                    "sent": "I want to find out the shortest path between there.",
                    "label": 0
                },
                {
                    "sent": "It turns out it's actually just the maximum dot product between this point and this set right here.",
                    "label": 0
                },
                {
                    "sent": "Well, this set is just the cone, the dual cone or the polar cone intersected with the ball of radius one.",
                    "label": 0
                },
                {
                    "sent": "And you can sort of check this in your head.",
                    "label": 0
                },
                {
                    "sent": "I mean this this vector is going to be orthogonal to the cone.",
                    "label": 0
                },
                {
                    "sent": "And it's and that's going to be correspond to a point in the dual space.",
                    "label": 0
                },
                {
                    "sent": "So right so that's this is the key trick.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, I'll mention a couple of applications and some conclusions.",
                    "label": 0
                },
                {
                    "sent": "What we did is we essentially generalized the approachability problem.",
                    "label": 0
                },
                {
                    "sent": "We take this thing Anna generalized also to function spaces.",
                    "label": 1
                },
                {
                    "sent": "Turns out you can do approach ability with where the payoff is a function.",
                    "label": 0
                },
                {
                    "sent": "There's this trick we get.",
                    "label": 1
                },
                {
                    "sent": "We don't get this nice efficient algorithm for calibrated forecasting.",
                    "label": 0
                },
                {
                    "sent": "Going to actually describe that in more detail in the next couple of slides, and you can sort of, I think the nicest thing is, it gives a new way to look at approach ability and it gives a clear picture of the whole family of problems minimizing regret, an approach, ability, and the nice conceptual pieces that these things are really the same.",
                    "label": 0
                },
                {
                    "sent": "There just dual these dual concepts.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Just to give a quick sketch of the forecasting train, the calibrated forecasting trick I mentioned in the.",
                    "label": 1
                },
                {
                    "sent": "I don't want too much detail.",
                    "label": 0
                },
                {
                    "sent": "I mentioned in my open problem session and I'm sure most of you were.",
                    "label": 0
                },
                {
                    "sent": "Imagine most of you were there.",
                    "label": 0
                },
                {
                    "sent": "You can, you can if you want to find a calibrated forecaster for an arbitrary sequence of outcomes, or you're making probability predictions you'd like to get calibration limit, so asymptotically liberation, and this is, you know, a difficult problem.",
                    "label": 0
                },
                {
                    "sent": "There's lots of work out there.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Turns out that there existed already a reduction from calibration to approachability that was by Dean Foster in 99.",
                    "label": 0
                },
                {
                    "sent": "I think I should be 97 and we apply this reduction from approach ability to regret minimization, right?",
                    "label": 0
                },
                {
                    "sent": "And we have an efficient way to do that.",
                    "label": 0
                },
                {
                    "sent": "And it turns out that dumb, if you're smart, you're careful between the calibration to approach ability reduction, you get instead of one over epsilon algorithm.",
                    "label": 0
                },
                {
                    "sent": "Get alot of things you can do a binary search.",
                    "label": 0
                },
                {
                    "sent": "It's a simple trick.",
                    "label": 0
                },
                {
                    "sent": "Now when you go from probability randomization, it turns out if you use the right algorithm, which we we know how to do randomization efficiently.",
                    "label": 0
                },
                {
                    "sent": "If you use this for an algorithm, you get, you get some efficient and in this direction this so this piece is also easy.",
                    "label": 0
                },
                {
                    "sent": "It's easy to do.",
                    "label": 0
                },
                {
                    "sent": "So now this whole pipeline is as efficient, which is nice.",
                    "label": 0
                },
                {
                    "sent": "So people hadn't really thought that much about efficiency of of approach ability.",
                    "label": 0
                },
                {
                    "sent": "But now we can sort of say, well in some cases we have this nice.",
                    "label": 0
                },
                {
                    "sent": "We have this nice trick we can apply to do a renovation that patient 'cause we know how to make.",
                    "label": 0
                },
                {
                    "sent": "We know in some cases to make recommendation efficient.",
                    "label": 0
                },
                {
                    "sent": "So I.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think that is all.",
                    "label": 0
                },
                {
                    "sent": "Questions.",
                    "label": 0
                },
                {
                    "sent": "Why didn't your mom come to this talk?",
                    "label": 0
                },
                {
                    "sent": "She's on her way to the airport.",
                    "label": 0
                },
                {
                    "sent": "I sent it off her flights in like 8 hours.",
                    "label": 0
                },
                {
                    "sent": "Yep.",
                    "label": 0
                },
                {
                    "sent": "Yeah, that's why I don't.",
                    "label": 0
                },
                {
                    "sent": "I mean, the whole oldest.",
                    "label": 0
                },
                {
                    "sent": "Love this stuff.",
                    "label": 0
                },
                {
                    "sent": "It really requires the convexity assumption.",
                    "label": 0
                },
                {
                    "sent": "No, I mean, just who cares what the nonconvex case?",
                    "label": 0
                },
                {
                    "sent": "Your mother does not exist.",
                    "label": 0
                },
                {
                    "sent": "My mother doesn't care the next day, so.",
                    "label": 0
                },
                {
                    "sent": "Question what breaks the reduction from calibration to approach ability?",
                    "label": 0
                },
                {
                    "sent": "I mean you've got it in the binary case, so apropos of your open questions, I think nothing breaks, but you can't do the binary search anymore.",
                    "label": 0
                },
                {
                    "sent": "That binary search is a is a is a only works in one dimension where you can look at the probability interval, right?",
                    "label": 0
                },
                {
                    "sent": "So that breaks, yeah.",
                    "label": 0
                },
                {
                    "sent": "If the action space is not a code, and then you can quantify it by lifting it to one more dimension, but then the action space isn't still a cone, right?",
                    "label": 0
                },
                {
                    "sent": "It's like a cone intersected with a hyperplane.",
                    "label": 0
                },
                {
                    "sent": "So if you take a set like take a set, let's say in R2, then you like raise it up at a dimension at a third dimension, raise it up by 1:00, and then you fill in.",
                    "label": 0
                },
                {
                    "sent": "From there you get it, you get a cone.",
                    "label": 0
                },
                {
                    "sent": "Right like Razer setup?",
                    "label": 0
                },
                {
                    "sent": "Oh yeah, yeah no.",
                    "label": 0
                },
                {
                    "sent": "And there's a very common there's a key lemma that says that the distances don't really feel like you're looking at distances to disco now.",
                    "label": 0
                },
                {
                    "sent": "Not distance is the original set, and it turns out they will get perturbed by like a squirt of two or something.",
                    "label": 0
                },
                {
                    "sent": "And I think it's you can make it 1 if you were careful, but it just perturbed by constant and then multiplicative constant so that all the important qualities get preserved by this process.",
                    "label": 0
                },
                {
                    "sent": "So it's a good question, but you'll see in the paper that you know there's a two or three lemons that we have to.",
                    "label": 0
                },
                {
                    "sent": "No further questions.",
                    "label": 0
                },
                {
                    "sent": "Let's thank Jake.",
                    "label": 0
                }
            ]
        }
    }
}