{
    "id": "u7h5uoaper3gnphi552oebh7ck2zyj6o",
    "title": "Interregional Innovation Policy in South East Europe: Past Experiences and Prospects for the Future",
    "info": {
        "author": [
            "Christian Hartmann, Joanneum Research"
        ],
        "published": "June 19, 2009",
        "recorded": "May 2009",
        "category": [
            "Top->Technology->Innovation"
        ]
    },
    "url": "http://videolectures.net/rtd09_hartmann_iipis/",
    "segmentation": [
        [
            "Thank you Mr Chairman, ladies and gentlemen.",
            "In the next 15 minutes I will give you a presentation from 2 perspectives.",
            "One perspective is there by my personal experience as a senior researcher with you and in research we did quite a lot of projects dealing with innovation policy in Southeastern Europe in the past eight years, so to say.",
            "And the second perspective, I would like to add in as well is somehow meter perspective as an economist dealing with technology, innovation and science policy for several years.",
            "Will while giving also some commands on how to reflect on those past eight to 10 years that we had in this area, especially in the domain of innovation and science policy."
        ],
        [
            "OK, the 15 minutes that I have according to the agenda, I have divided into 3 sections.",
            "First I will talk a little bit about some basic reasoning.",
            "Off why isn't into regeneration policy necessary and important?",
            "In a generic sense, but also in the sense of the specific conditions in the region of southeastern Europe, West Balkan region.",
            "As such I would like then to compare experiences that we had in the past, starting with 2001 with the status quo now.",
            "And I would like to conclude with some prospects for the future, some summative reasoning where to look at in the next years and you will see some topics.",
            "You may be already quite familiar with because they have been mentioned in almost all presentations and also in the district discussions, but it's maybe again chance to.",
            "Put additional emphasis on those issues because I think they are very important."
        ],
        [
            "Well, one first starting point to look at interregional cooperation and international innovation policy as a specific policy domain incorporation might be geography.",
            "As such, you can see here.",
            "Maybe it's not so very likely visible.",
            "The new regionalism in Europe that came up was mostly in old.",
            "You member countries like UK with the devolution process like France where you had also decentralization process.",
            "That's a new way of thinking about regions, and there you can see this year, various drummer Joe Possible geometry's of regions that could come up.",
            "And of course this opens a lot of chances to reestablish reestablish old links but also to make up new links.",
            "One example might be the Atlantic arc which in which for example nowadays Wales or Ireland are cooperating in the field of innovation policy with partners from the Basque Country or the region.",
            "Market in in France, which is in new way to cooperate, cause this those are not old links.",
            "Those are new established ones.",
            "So as you can see geography and new regionalism is 1 starting point."
        ],
        [
            "What a second generic field where one should look at this.",
            "Of course economy and well.",
            "I'll be the fact that we are now in a global economic crisis.",
            "One has to be convinced that the process of globalization of economic activity and specialization patterns on a global scale will continue afterwards.",
            "And from this perspective, of course, it's very important to have some economic reasoning.",
            "Why is it important to have interregional cooperation and also interregional cooperation, innovation policy?",
            "First argument is of course economies of scale.",
            "What's it about?",
            "International Corporation can bring forth critical masses.",
            "That's a very important issue, because if you look at the global landscape, there are some regions, especially in the global scale, that have critical methods that almost no region in Europe even can bring forth.",
            "Out of economies of scale usually cost advantages to arise.",
            "This is very important from a perspective of competitiveness and last but not least.",
            "That was critical mass as well, so they are sort of self sustaining because positive externalities usually bring forth if they are cared about.",
            "Probably also positive externalities in the future economies of scope.",
            "That's a different perspective.",
            "That's mainly about bringing together complementary competencies that would not be competitive standing alone, but together they are also bringing forth.",
            "Positive personalities, so interregional cooperation in this perspective can combine those component complementary competencies that are hard to copy.",
            "That's also very important in the perspective of globalization.",
            "Maybe think about crafts or think about low to medium tech industries that are under pressure.",
            "When you look at costs, cost, labor cost, advantages of Southeast Asia, East Asia for example.",
            "So if you look at some clusters that are still very successful in Europe, in the lower medium tech sector.",
            "Usually they are basing their competitiveness on economies of scope 'cause you cannot put the cluster way and bring it to China.",
            "It's not possible they would need 40 to 50 years to bring forth.",
            "Also those complementary competences and of course into regional value chains make incumbent firms more embedded in less footloose Letson phenomenon.",
            "You can see all across Europe that nowadays firms are thinking about relocation not only of production but also R&D Department.",
            "But if you have such economies of scope present in one region and some competitors in that respect, also knowledge in science and technology firms will not so eager to go away because they would lose their source of knowledge, especially if you have to have frequent face to face interactions in order to bring forth new innovations.",
            "Again, increase competitiveness would be the result, so we can see geography and economy are telling us interregional cooperation would be a good thing to have.",
            "So have as a first look."
        ],
        [
            "On southeast Europe, why is it important here and again you will see now in on this slide.",
            "Some of the arguments we heard yesterday.",
            "Some of the arguments we already heard today, the speaker, the speaker in the first session today, had already some arguments coming out of this ODS OECD analysis, but I can tell you there have been also made some other analysis in the same direction, and they have all the same results.",
            "So what are they?",
            "Competitiveness of countries is built upon temporary competitive advantages at the moment.",
            "What does this mean?",
            "Mainly it's low weight rates that are currently the basis of competitiveness, but this is something that can change very fast.",
            "Arguments have been already mentioned today.",
            "Wages are increasing, sometimes tremendously.",
            "So such a basis for competitiveness is not sustainable.",
            "The same holds somehow true also for tax cuts because that cannot pursuit, especially in a protracted game against other regions doing the same for a long time, you cannot cast car taxes at infinitum.",
            "Also, there's a good endowment with RTI infrastructures in the whole region, and the proof that this is true.",
            "You can see here in the conference room because there were present representatives of most of those important organizations.",
            "But nevertheless, if you look at Southeast Europe, it's a fragmented mosaic of innovation systems.",
            "There is a lack of critical methods.",
            "Logical operations for examples like SE Anglia.",
            "If you look to biotechnology they are lacking here and one has to compensate for this.",
            "Also there's low levels of national Andy Performance.",
            "This hasn't been mentioned also already so I will not go into detail here and very and most important there are poorly developed industry science things.",
            "Even if you have strong guarantee institutions, links between industry and science are performing extremely poor.",
            "Also in European comparison.",
            "And this is what one has to take into account.",
            "So what does this mean?",
            "In order for this region, Southeast Europe?",
            "In a special case, there's a strong need to develop positive externalities through networking and networking of innovation.",
            "Performing organizations with strong links also to industry.",
            "That's the main message so."
        ],
        [
            "Let us have a look from our personal perspective of your new research.",
            "When we started to have.",
            "Projects in this policy domain.",
            "In 2001, when we devoted ourselves to the development of strong links in the domain of innovation, policy and innovation transfer to Southeast Europe.",
            "So what was the situation for us and maybe also for others at that time?",
            "Well, to be honest, at that time we had poor knowledge about RTI.",
            "Competence is beyond the borders and when we interacted with other organizations, we had the feeling that they had the same situation.",
            "Eight years ago, only scattered and fragmented knowledge of RTD infrastructures and specialization patterns has been available.",
            "There was no consistent studies studies on potential clusters in the whole region on the specialization patterns in terms of R&D activities and so on, and also from the enterprise side.",
            "For example, most durian enterprises where, for example, not knowledgeable about R&T partners like Institute with Steven, which approach College Institute.",
            "There are mainly sourcing at that time.",
            "If they had the need for contract County, local partners, and sometimes they were really in a problematic.",
            "So this situation cause pre incidence they were not able to find somebody who could fit their demand.",
            "Also, at the beginning and this time we had a future knowledge about EDI policies beyond the borders, so it was not only the competences and potential partners that we were knowledgeable about, it was also the situation that we were not very knowledgeable about, not informed about the strategies and policy systems of all our neighboring regions, so this holds also true for our regional government, and we learned in various projects that.",
            "It did also hold true for the neighboring regions at that time.",
            "Just an example.",
            "What I mean by that.",
            "If you look at cluster policy, it has been implemented in several regions in Southeast Europe, but there has no been no mutual adjustment of such policies.",
            "Now you have kind of redundant structures of clusters aiming all at similar technology fields, and if your firm with cluster theory you will learn that critical mass is the essential source of competitiveness for a cluster.",
            "So if you have 8 clusters dealing, let's say with machinery and equipment.",
            "They have all just let's say 4 to 6000 employees.",
            "It's nothing compared to a cluster for example, but wouldn't work on machinery and equipment that would have some 100,000 employees.",
            "So and I think that's what's the main game is about.",
            "There's a need for coordination, and that's what we learned in the beginning."
        ],
        [
            "So.",
            "From our perspective again, what has been achieved so far, and now I'm bringing in also some achievements that were not done by us.",
            "Of course that have been done by others like the Austrian government that was very active in that field in the past years and already before that before we entered the arena, so to say.",
            "But let us just let me start with the first line on this slide.",
            "So we developed a better knowledge, innovation, systems, actors incompetence is so.",
            "And as a result there are now Warriors project platforms that have charted the lost years.",
            "Innovation systems in southeast Europe.",
            "Nowadays, if you're going to the Internet, you now just have to look, for example, to the Western West Park and Research Directory or our code in our database on R&D competences to find suitable partners.",
            "If you have her R&D project you want to perform, this wasn't the case eight years ago, and I think that's a very big progress we made so far because information is now available and it's also information that it's.",
            "Freely available because it's something that is important.",
            "In addition, of course there's another another thing I would like to mention.",
            "There has been development of a voluntary interregional network for networks for innovation policy.",
            "Several policy networks have been established in Southeastern Europe in recent years.",
            "Just some examples, like as a year and its core airnet West Balkan restaurant in class and so on, not to mention also the permanent engagement like the other offices that are kind of anchor points in the region.",
            "It's also something that's worth mentioning in that context, and I have also to say it would be really a pity from my perspective if one would give up such anchor points be cause we learned quite a lot.",
            "Also with your assistance from the region in the West Bank.",
            "As such OK."
        ],
        [
            "So.",
            "What is necessary for the future?",
            "Let me conclude.",
            "First of all, there's a need for additional action to involve enterprises.",
            "As you already have seen.",
            "There has been lot of things achieved in the past and I think we can be very satisfied with it, but it's not enough.",
            "If you look at this slide, there are three headlines.",
            "Demand side, supply, side and money, so I would like to start with demand for R&D and scientific knowledge.",
            "There's a need to promote absorptive capacity for new scientific internal technological knowledge at firm level.",
            "Everybody of you who has been active in this arena will be hopefully agree with me that at the moment we have the situation that the public sector and intermediaries institutions adopted faster to change than enterprises.",
            "There lots of firms that still haven't have not the absorptive capacity to join a concrete Andy projects.",
            "And that's a problem.",
            "And that problem has to deal with in the future.",
            "Many SM ES will take an arching problem at the moment, neither know whom to consult.",
            "Although they have those databases because they are not having the knowledge to look how to look for good partners, know what to do with the potential advice given and I think absorptive capacity will be a key issue, especially for some use in the next years.",
            "And this is also especially not it's true for all Europe, but it's especially true Now for Southeast Europe, because there's a problem.",
            "It's even worse.",
            "On the supply side for R&D results for technological knowledge, it's additional regional capacity building on technology transfer in southeastern Europe countries that's necessary.",
            "Becausw as you can see, there are efforts done successfully already now, but they have to be enlarged and intensified.",
            "Some firms do already have interest to join technology corporations.",
            "For example.",
            "I've been some weeks ago at a meeting in Austria.",
            "There's a national program run by the Austrian Research promotion Agency Silzer, which is dealing with RND corporations with partners in Southeastern Europe, but also in other European Eastern European countries, and there have been quite a lot firms in the last call, for example coming from Serbia.",
            "Which was really a big surprise to me because I didn't never expect this, so one can see there are firms that are willing to join such corporations, but regional capacities for our duration still need to deactivate.",
            "Developed in the future, it should be the case that also other countries are running like such programs.",
            "And this brings me also to the Third Point to money be cause at the moment if you look at Inter regional activities, Main findings actually you money.",
            "Of course we have those Austrian programs.",
            "But for a long term perspective, I think it's still you money that is needed and.",
            "From my personal experience, if you look at interregional cooperation in the framework of European territorial cooperation, we made very personal experience that I poeople funding was not very evenly distributed among countries.",
            "For the first call and this was something that brought many consortia into problem and I think if you is so eager to bring forward competitive new European message area in a competitive space, such things shouldn't happen and I think that's where.",
            "Also, one has to work up on where I think.",
            "Well Coco Tim information should be given to relevant people in Brussels and also in the JTS to change things OK.",
            "This was my very personal point of view.",
            "Very personal experience.",
            "I'm open to questions of course.",
            "Thank you for that.",
            "Thank you very much, Mr. Hoffman, for this presentation.",
            "And also congratulations to your name research for being so active and successful regarding regional cooperation and networking.",
            "Are there any questions?",
            "Investments, because this is the main menu.",
            "Digital version of the countries most here Croatia.",
            "So he did because he also requested very important information in Salina, so the majority of all Innovation Corporation in this context is retarded.",
            "I fail organization.",
            "I think it's very.",
            "It's very important, period.",
            "It you're right, but one has to be careful on this issue just to give an example by that.",
            "Now now maybe not coming from Southeast Europe, but coming from Hungary there your head or Slovakia.",
            "Both very good examples for the automotive sector.",
            "There you had a very strong inflow of foreign direct investments in the second half of the 1990s and also coming with those foreign direct investments in the 1st place.",
            "Some activities in the domain of innovation, but to tell you quite frankly there was no interaction of those big European firms coming to the countries and region around infrastructure.",
            "If they had RND, they did the context with their home countries.",
            "I don't know the situation for fun, direct, direct investments, for example, equation that respect, but usually my experience and so far is that if you have multinationals or.",
            "Medium sized firms speak to me to medium sized firms on European scale.",
            "Usually if they are they are investing in a new country.",
            "Links to old Andy Partners are persisting and their needs some time and and also some additional emphasis to bring them in.",
            "For example, in Hungary they did the Unity University Research Center program.",
            "It's kind of an industry science link promotion program in order to foster such links and I think that's what's needed in that respect.",
            "Thank you.",
            "For the questions, I thank you once again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you Mr Chairman, ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "In the next 15 minutes I will give you a presentation from 2 perspectives.",
                    "label": 0
                },
                {
                    "sent": "One perspective is there by my personal experience as a senior researcher with you and in research we did quite a lot of projects dealing with innovation policy in Southeastern Europe in the past eight years, so to say.",
                    "label": 1
                },
                {
                    "sent": "And the second perspective, I would like to add in as well is somehow meter perspective as an economist dealing with technology, innovation and science policy for several years.",
                    "label": 0
                },
                {
                    "sent": "Will while giving also some commands on how to reflect on those past eight to 10 years that we had in this area, especially in the domain of innovation and science policy.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, the 15 minutes that I have according to the agenda, I have divided into 3 sections.",
                    "label": 0
                },
                {
                    "sent": "First I will talk a little bit about some basic reasoning.",
                    "label": 0
                },
                {
                    "sent": "Off why isn't into regeneration policy necessary and important?",
                    "label": 0
                },
                {
                    "sent": "In a generic sense, but also in the sense of the specific conditions in the region of southeastern Europe, West Balkan region.",
                    "label": 0
                },
                {
                    "sent": "As such I would like then to compare experiences that we had in the past, starting with 2001 with the status quo now.",
                    "label": 0
                },
                {
                    "sent": "And I would like to conclude with some prospects for the future, some summative reasoning where to look at in the next years and you will see some topics.",
                    "label": 1
                },
                {
                    "sent": "You may be already quite familiar with because they have been mentioned in almost all presentations and also in the district discussions, but it's maybe again chance to.",
                    "label": 0
                },
                {
                    "sent": "Put additional emphasis on those issues because I think they are very important.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, one first starting point to look at interregional cooperation and international innovation policy as a specific policy domain incorporation might be geography.",
                    "label": 0
                },
                {
                    "sent": "As such, you can see here.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's not so very likely visible.",
                    "label": 0
                },
                {
                    "sent": "The new regionalism in Europe that came up was mostly in old.",
                    "label": 1
                },
                {
                    "sent": "You member countries like UK with the devolution process like France where you had also decentralization process.",
                    "label": 0
                },
                {
                    "sent": "That's a new way of thinking about regions, and there you can see this year, various drummer Joe Possible geometry's of regions that could come up.",
                    "label": 0
                },
                {
                    "sent": "And of course this opens a lot of chances to reestablish reestablish old links but also to make up new links.",
                    "label": 0
                },
                {
                    "sent": "One example might be the Atlantic arc which in which for example nowadays Wales or Ireland are cooperating in the field of innovation policy with partners from the Basque Country or the region.",
                    "label": 0
                },
                {
                    "sent": "Market in in France, which is in new way to cooperate, cause this those are not old links.",
                    "label": 0
                },
                {
                    "sent": "Those are new established ones.",
                    "label": 0
                },
                {
                    "sent": "So as you can see geography and new regionalism is 1 starting point.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "What a second generic field where one should look at this.",
                    "label": 0
                },
                {
                    "sent": "Of course economy and well.",
                    "label": 0
                },
                {
                    "sent": "I'll be the fact that we are now in a global economic crisis.",
                    "label": 0
                },
                {
                    "sent": "One has to be convinced that the process of globalization of economic activity and specialization patterns on a global scale will continue afterwards.",
                    "label": 0
                },
                {
                    "sent": "And from this perspective, of course, it's very important to have some economic reasoning.",
                    "label": 0
                },
                {
                    "sent": "Why is it important to have interregional cooperation and also interregional cooperation, innovation policy?",
                    "label": 0
                },
                {
                    "sent": "First argument is of course economies of scale.",
                    "label": 1
                },
                {
                    "sent": "What's it about?",
                    "label": 0
                },
                {
                    "sent": "International Corporation can bring forth critical masses.",
                    "label": 1
                },
                {
                    "sent": "That's a very important issue, because if you look at the global landscape, there are some regions, especially in the global scale, that have critical methods that almost no region in Europe even can bring forth.",
                    "label": 0
                },
                {
                    "sent": "Out of economies of scale usually cost advantages to arise.",
                    "label": 0
                },
                {
                    "sent": "This is very important from a perspective of competitiveness and last but not least.",
                    "label": 1
                },
                {
                    "sent": "That was critical mass as well, so they are sort of self sustaining because positive externalities usually bring forth if they are cared about.",
                    "label": 0
                },
                {
                    "sent": "Probably also positive externalities in the future economies of scope.",
                    "label": 0
                },
                {
                    "sent": "That's a different perspective.",
                    "label": 0
                },
                {
                    "sent": "That's mainly about bringing together complementary competencies that would not be competitive standing alone, but together they are also bringing forth.",
                    "label": 0
                },
                {
                    "sent": "Positive personalities, so interregional cooperation in this perspective can combine those component complementary competencies that are hard to copy.",
                    "label": 1
                },
                {
                    "sent": "That's also very important in the perspective of globalization.",
                    "label": 0
                },
                {
                    "sent": "Maybe think about crafts or think about low to medium tech industries that are under pressure.",
                    "label": 0
                },
                {
                    "sent": "When you look at costs, cost, labor cost, advantages of Southeast Asia, East Asia for example.",
                    "label": 0
                },
                {
                    "sent": "So if you look at some clusters that are still very successful in Europe, in the lower medium tech sector.",
                    "label": 0
                },
                {
                    "sent": "Usually they are basing their competitiveness on economies of scope 'cause you cannot put the cluster way and bring it to China.",
                    "label": 0
                },
                {
                    "sent": "It's not possible they would need 40 to 50 years to bring forth.",
                    "label": 1
                },
                {
                    "sent": "Also those complementary competences and of course into regional value chains make incumbent firms more embedded in less footloose Letson phenomenon.",
                    "label": 1
                },
                {
                    "sent": "You can see all across Europe that nowadays firms are thinking about relocation not only of production but also R&D Department.",
                    "label": 0
                },
                {
                    "sent": "But if you have such economies of scope present in one region and some competitors in that respect, also knowledge in science and technology firms will not so eager to go away because they would lose their source of knowledge, especially if you have to have frequent face to face interactions in order to bring forth new innovations.",
                    "label": 0
                },
                {
                    "sent": "Again, increase competitiveness would be the result, so we can see geography and economy are telling us interregional cooperation would be a good thing to have.",
                    "label": 0
                },
                {
                    "sent": "So have as a first look.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "On southeast Europe, why is it important here and again you will see now in on this slide.",
                    "label": 0
                },
                {
                    "sent": "Some of the arguments we heard yesterday.",
                    "label": 0
                },
                {
                    "sent": "Some of the arguments we already heard today, the speaker, the speaker in the first session today, had already some arguments coming out of this ODS OECD analysis, but I can tell you there have been also made some other analysis in the same direction, and they have all the same results.",
                    "label": 0
                },
                {
                    "sent": "So what are they?",
                    "label": 0
                },
                {
                    "sent": "Competitiveness of countries is built upon temporary competitive advantages at the moment.",
                    "label": 1
                },
                {
                    "sent": "What does this mean?",
                    "label": 0
                },
                {
                    "sent": "Mainly it's low weight rates that are currently the basis of competitiveness, but this is something that can change very fast.",
                    "label": 0
                },
                {
                    "sent": "Arguments have been already mentioned today.",
                    "label": 0
                },
                {
                    "sent": "Wages are increasing, sometimes tremendously.",
                    "label": 0
                },
                {
                    "sent": "So such a basis for competitiveness is not sustainable.",
                    "label": 0
                },
                {
                    "sent": "The same holds somehow true also for tax cuts because that cannot pursuit, especially in a protracted game against other regions doing the same for a long time, you cannot cast car taxes at infinitum.",
                    "label": 0
                },
                {
                    "sent": "Also, there's a good endowment with RTI infrastructures in the whole region, and the proof that this is true.",
                    "label": 0
                },
                {
                    "sent": "You can see here in the conference room because there were present representatives of most of those important organizations.",
                    "label": 1
                },
                {
                    "sent": "But nevertheless, if you look at Southeast Europe, it's a fragmented mosaic of innovation systems.",
                    "label": 0
                },
                {
                    "sent": "There is a lack of critical methods.",
                    "label": 0
                },
                {
                    "sent": "Logical operations for examples like SE Anglia.",
                    "label": 0
                },
                {
                    "sent": "If you look to biotechnology they are lacking here and one has to compensate for this.",
                    "label": 1
                },
                {
                    "sent": "Also there's low levels of national Andy Performance.",
                    "label": 0
                },
                {
                    "sent": "This hasn't been mentioned also already so I will not go into detail here and very and most important there are poorly developed industry science things.",
                    "label": 0
                },
                {
                    "sent": "Even if you have strong guarantee institutions, links between industry and science are performing extremely poor.",
                    "label": 0
                },
                {
                    "sent": "Also in European comparison.",
                    "label": 0
                },
                {
                    "sent": "And this is what one has to take into account.",
                    "label": 0
                },
                {
                    "sent": "So what does this mean?",
                    "label": 0
                },
                {
                    "sent": "In order for this region, Southeast Europe?",
                    "label": 0
                },
                {
                    "sent": "In a special case, there's a strong need to develop positive externalities through networking and networking of innovation.",
                    "label": 1
                },
                {
                    "sent": "Performing organizations with strong links also to industry.",
                    "label": 0
                },
                {
                    "sent": "That's the main message so.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let us have a look from our personal perspective of your new research.",
                    "label": 0
                },
                {
                    "sent": "When we started to have.",
                    "label": 0
                },
                {
                    "sent": "Projects in this policy domain.",
                    "label": 0
                },
                {
                    "sent": "In 2001, when we devoted ourselves to the development of strong links in the domain of innovation, policy and innovation transfer to Southeast Europe.",
                    "label": 0
                },
                {
                    "sent": "So what was the situation for us and maybe also for others at that time?",
                    "label": 0
                },
                {
                    "sent": "Well, to be honest, at that time we had poor knowledge about RTI.",
                    "label": 0
                },
                {
                    "sent": "Competence is beyond the borders and when we interacted with other organizations, we had the feeling that they had the same situation.",
                    "label": 0
                },
                {
                    "sent": "Eight years ago, only scattered and fragmented knowledge of RTD infrastructures and specialization patterns has been available.",
                    "label": 1
                },
                {
                    "sent": "There was no consistent studies studies on potential clusters in the whole region on the specialization patterns in terms of R&D activities and so on, and also from the enterprise side.",
                    "label": 0
                },
                {
                    "sent": "For example, most durian enterprises where, for example, not knowledgeable about R&T partners like Institute with Steven, which approach College Institute.",
                    "label": 0
                },
                {
                    "sent": "There are mainly sourcing at that time.",
                    "label": 0
                },
                {
                    "sent": "If they had the need for contract County, local partners, and sometimes they were really in a problematic.",
                    "label": 0
                },
                {
                    "sent": "So this situation cause pre incidence they were not able to find somebody who could fit their demand.",
                    "label": 0
                },
                {
                    "sent": "Also, at the beginning and this time we had a future knowledge about EDI policies beyond the borders, so it was not only the competences and potential partners that we were knowledgeable about, it was also the situation that we were not very knowledgeable about, not informed about the strategies and policy systems of all our neighboring regions, so this holds also true for our regional government, and we learned in various projects that.",
                    "label": 0
                },
                {
                    "sent": "It did also hold true for the neighboring regions at that time.",
                    "label": 0
                },
                {
                    "sent": "Just an example.",
                    "label": 0
                },
                {
                    "sent": "What I mean by that.",
                    "label": 1
                },
                {
                    "sent": "If you look at cluster policy, it has been implemented in several regions in Southeast Europe, but there has no been no mutual adjustment of such policies.",
                    "label": 0
                },
                {
                    "sent": "Now you have kind of redundant structures of clusters aiming all at similar technology fields, and if your firm with cluster theory you will learn that critical mass is the essential source of competitiveness for a cluster.",
                    "label": 0
                },
                {
                    "sent": "So if you have 8 clusters dealing, let's say with machinery and equipment.",
                    "label": 0
                },
                {
                    "sent": "They have all just let's say 4 to 6000 employees.",
                    "label": 0
                },
                {
                    "sent": "It's nothing compared to a cluster for example, but wouldn't work on machinery and equipment that would have some 100,000 employees.",
                    "label": 0
                },
                {
                    "sent": "So and I think that's what's the main game is about.",
                    "label": 0
                },
                {
                    "sent": "There's a need for coordination, and that's what we learned in the beginning.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "From our perspective again, what has been achieved so far, and now I'm bringing in also some achievements that were not done by us.",
                    "label": 1
                },
                {
                    "sent": "Of course that have been done by others like the Austrian government that was very active in that field in the past years and already before that before we entered the arena, so to say.",
                    "label": 0
                },
                {
                    "sent": "But let us just let me start with the first line on this slide.",
                    "label": 1
                },
                {
                    "sent": "So we developed a better knowledge, innovation, systems, actors incompetence is so.",
                    "label": 0
                },
                {
                    "sent": "And as a result there are now Warriors project platforms that have charted the lost years.",
                    "label": 0
                },
                {
                    "sent": "Innovation systems in southeast Europe.",
                    "label": 1
                },
                {
                    "sent": "Nowadays, if you're going to the Internet, you now just have to look, for example, to the Western West Park and Research Directory or our code in our database on R&D competences to find suitable partners.",
                    "label": 0
                },
                {
                    "sent": "If you have her R&D project you want to perform, this wasn't the case eight years ago, and I think that's a very big progress we made so far because information is now available and it's also information that it's.",
                    "label": 0
                },
                {
                    "sent": "Freely available because it's something that is important.",
                    "label": 0
                },
                {
                    "sent": "In addition, of course there's another another thing I would like to mention.",
                    "label": 0
                },
                {
                    "sent": "There has been development of a voluntary interregional network for networks for innovation policy.",
                    "label": 1
                },
                {
                    "sent": "Several policy networks have been established in Southeastern Europe in recent years.",
                    "label": 1
                },
                {
                    "sent": "Just some examples, like as a year and its core airnet West Balkan restaurant in class and so on, not to mention also the permanent engagement like the other offices that are kind of anchor points in the region.",
                    "label": 0
                },
                {
                    "sent": "It's also something that's worth mentioning in that context, and I have also to say it would be really a pity from my perspective if one would give up such anchor points be cause we learned quite a lot.",
                    "label": 0
                },
                {
                    "sent": "Also with your assistance from the region in the West Bank.",
                    "label": 0
                },
                {
                    "sent": "As such OK.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What is necessary for the future?",
                    "label": 1
                },
                {
                    "sent": "Let me conclude.",
                    "label": 0
                },
                {
                    "sent": "First of all, there's a need for additional action to involve enterprises.",
                    "label": 1
                },
                {
                    "sent": "As you already have seen.",
                    "label": 0
                },
                {
                    "sent": "There has been lot of things achieved in the past and I think we can be very satisfied with it, but it's not enough.",
                    "label": 0
                },
                {
                    "sent": "If you look at this slide, there are three headlines.",
                    "label": 0
                },
                {
                    "sent": "Demand side, supply, side and money, so I would like to start with demand for R&D and scientific knowledge.",
                    "label": 0
                },
                {
                    "sent": "There's a need to promote absorptive capacity for new scientific internal technological knowledge at firm level.",
                    "label": 1
                },
                {
                    "sent": "Everybody of you who has been active in this arena will be hopefully agree with me that at the moment we have the situation that the public sector and intermediaries institutions adopted faster to change than enterprises.",
                    "label": 0
                },
                {
                    "sent": "There lots of firms that still haven't have not the absorptive capacity to join a concrete Andy projects.",
                    "label": 0
                },
                {
                    "sent": "And that's a problem.",
                    "label": 1
                },
                {
                    "sent": "And that problem has to deal with in the future.",
                    "label": 0
                },
                {
                    "sent": "Many SM ES will take an arching problem at the moment, neither know whom to consult.",
                    "label": 0
                },
                {
                    "sent": "Although they have those databases because they are not having the knowledge to look how to look for good partners, know what to do with the potential advice given and I think absorptive capacity will be a key issue, especially for some use in the next years.",
                    "label": 0
                },
                {
                    "sent": "And this is also especially not it's true for all Europe, but it's especially true Now for Southeast Europe, because there's a problem.",
                    "label": 0
                },
                {
                    "sent": "It's even worse.",
                    "label": 1
                },
                {
                    "sent": "On the supply side for R&D results for technological knowledge, it's additional regional capacity building on technology transfer in southeastern Europe countries that's necessary.",
                    "label": 1
                },
                {
                    "sent": "Becausw as you can see, there are efforts done successfully already now, but they have to be enlarged and intensified.",
                    "label": 0
                },
                {
                    "sent": "Some firms do already have interest to join technology corporations.",
                    "label": 0
                },
                {
                    "sent": "For example.",
                    "label": 0
                },
                {
                    "sent": "I've been some weeks ago at a meeting in Austria.",
                    "label": 0
                },
                {
                    "sent": "There's a national program run by the Austrian Research promotion Agency Silzer, which is dealing with RND corporations with partners in Southeastern Europe, but also in other European Eastern European countries, and there have been quite a lot firms in the last call, for example coming from Serbia.",
                    "label": 0
                },
                {
                    "sent": "Which was really a big surprise to me because I didn't never expect this, so one can see there are firms that are willing to join such corporations, but regional capacities for our duration still need to deactivate.",
                    "label": 0
                },
                {
                    "sent": "Developed in the future, it should be the case that also other countries are running like such programs.",
                    "label": 0
                },
                {
                    "sent": "And this brings me also to the Third Point to money be cause at the moment if you look at Inter regional activities, Main findings actually you money.",
                    "label": 0
                },
                {
                    "sent": "Of course we have those Austrian programs.",
                    "label": 0
                },
                {
                    "sent": "But for a long term perspective, I think it's still you money that is needed and.",
                    "label": 0
                },
                {
                    "sent": "From my personal experience, if you look at interregional cooperation in the framework of European territorial cooperation, we made very personal experience that I poeople funding was not very evenly distributed among countries.",
                    "label": 0
                },
                {
                    "sent": "For the first call and this was something that brought many consortia into problem and I think if you is so eager to bring forward competitive new European message area in a competitive space, such things shouldn't happen and I think that's where.",
                    "label": 0
                },
                {
                    "sent": "Also, one has to work up on where I think.",
                    "label": 0
                },
                {
                    "sent": "Well Coco Tim information should be given to relevant people in Brussels and also in the JTS to change things OK.",
                    "label": 0
                },
                {
                    "sent": "This was my very personal point of view.",
                    "label": 0
                },
                {
                    "sent": "Very personal experience.",
                    "label": 0
                },
                {
                    "sent": "I'm open to questions of course.",
                    "label": 0
                },
                {
                    "sent": "Thank you for that.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much, Mr. Hoffman, for this presentation.",
                    "label": 0
                },
                {
                    "sent": "And also congratulations to your name research for being so active and successful regarding regional cooperation and networking.",
                    "label": 0
                },
                {
                    "sent": "Are there any questions?",
                    "label": 0
                },
                {
                    "sent": "Investments, because this is the main menu.",
                    "label": 0
                },
                {
                    "sent": "Digital version of the countries most here Croatia.",
                    "label": 0
                },
                {
                    "sent": "So he did because he also requested very important information in Salina, so the majority of all Innovation Corporation in this context is retarded.",
                    "label": 0
                },
                {
                    "sent": "I fail organization.",
                    "label": 0
                },
                {
                    "sent": "I think it's very.",
                    "label": 0
                },
                {
                    "sent": "It's very important, period.",
                    "label": 0
                },
                {
                    "sent": "It you're right, but one has to be careful on this issue just to give an example by that.",
                    "label": 0
                },
                {
                    "sent": "Now now maybe not coming from Southeast Europe, but coming from Hungary there your head or Slovakia.",
                    "label": 0
                },
                {
                    "sent": "Both very good examples for the automotive sector.",
                    "label": 0
                },
                {
                    "sent": "There you had a very strong inflow of foreign direct investments in the second half of the 1990s and also coming with those foreign direct investments in the 1st place.",
                    "label": 0
                },
                {
                    "sent": "Some activities in the domain of innovation, but to tell you quite frankly there was no interaction of those big European firms coming to the countries and region around infrastructure.",
                    "label": 0
                },
                {
                    "sent": "If they had RND, they did the context with their home countries.",
                    "label": 0
                },
                {
                    "sent": "I don't know the situation for fun, direct, direct investments, for example, equation that respect, but usually my experience and so far is that if you have multinationals or.",
                    "label": 0
                },
                {
                    "sent": "Medium sized firms speak to me to medium sized firms on European scale.",
                    "label": 0
                },
                {
                    "sent": "Usually if they are they are investing in a new country.",
                    "label": 0
                },
                {
                    "sent": "Links to old Andy Partners are persisting and their needs some time and and also some additional emphasis to bring them in.",
                    "label": 0
                },
                {
                    "sent": "For example, in Hungary they did the Unity University Research Center program.",
                    "label": 0
                },
                {
                    "sent": "It's kind of an industry science link promotion program in order to foster such links and I think that's what's needed in that respect.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "For the questions, I thank you once again.",
                    "label": 0
                }
            ]
        }
    }
}