{
    "id": "uf6j5i5zkl2vfs6xdrafevlsjlfk6s3f",
    "title": "Enterprise Search in Medical Data",
    "info": {
        "author": [
            "Allan Hanbury, Vienna University of Technology"
        ],
        "published": "Nov. 26, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Business",
            "Top->Computer Science",
            "Top->Medicine->Informatics"
        ]
    },
    "url": "http://videolectures.net/searchcomputing2012_hanbury_data/",
    "segmentation": [
        [
            "So I'll be talking about enterprise search in medical data and why enterprise search."
        ],
        [
            "Well, hospitals and health insurances have a large amount of data saved.",
            "And here are some examples.",
            "So we have, for example, the patient specific data.",
            "This includes narrative reports from the doctor's structured data like outputs from lab tests, some images, radiology images.",
            "In the future, we're also going to be getting too, so mix information like genomics and so on.",
            "And this is all saved in a large store.",
            "But beyond that, beyond this paper, the patient specific information there is also what I've called here.",
            "The knowledge based information, which is not the information which is specific to the patient, but the information which shows all of the knowledge that there is in the medical domain.",
            "So this is of course in journals and books and on the web to a certain extent.",
            "And of course it's also very interesting for practitioners of medicine to be able to search through this.",
            "Now, many of the topics that we spoke about today can also be applied to.",
            "This medical data and I'm going to tell you some of the ways that this can be done."
        ],
        [
            "So starting with the health records.",
            "So at the moment these health records I entered by doctors they are saved.",
            "But usually they are only accessible by patient ID, so you can only see somebody's health record when the person is standing there.",
            "Some hospitals, to a certain extent, do some statistical analysis of the structured part of the data, but this is often for financial reasons because they want to know how many operations of which type were done.",
            "Or for legal reasons, because they have to give statistics on how many outbreaks of various infections were in the hospital.",
            "But you could do much more with this data.",
            "You could this is a huge store data which could be used to optimize treatment of patients.",
            "And at the moment this is hardly done at all.",
            "So there have been some examples where the data has been mined, so there's a famous example from the Kaiser Permanente.",
            "In the US, where they looked at two years worth of patient records for patients who had received Vioxx, and they discovered that a large number of these patients were having heart trouble and a larger than usual number were dying.",
            "So this resulted in Vioxx being taken off the market.",
            "And usually when using medical information, especially patient information in this secondary way is discussed, people tend to tend to immediately say, well there are privacy issues.",
            "This is true, though of course private privacy issues, but this is a nice quote that I found which is at the other end of the spectrum which points out that in fact it is unethical to have all of that data there and not to use it."
        ],
        [
            "So I'm going to show a use case where this type of search within hospital records is useful.",
            "So on the left.",
            "Here we have a workflow for radiologist, so there's the first part over here.",
            "In the top loop, which is basically the radiologist looking at the three dimensional image and creating in his or her head a 3 dimensional representation from these slice.",
            "Use and once the radiologist has done this, then he or she might find what is wrong with this image and.",
            "If it's been seen before, he can say, well, I know what this is and make a diagnosis when it becomes difficult is when he or she has not seen this specific.",
            "Thing before and has to go and look to see what it is.",
            "So then they enter the loop down here, which involves various things like asking colleagues or getting a huge book of example images and paging through it to try and find something that matches what's on the screen or trying to describe the pathology in words so that they can put it into a search engine and get the images back.",
            "That might help them."
        ],
        [
            "This is an example of how this might work, so here a radiologist has a 3 dimensional representation of the lung."
        ],
        [
            "Does some analysis finds with the languages."
        ],
        [
            "Does some further analysis and finds that these lungs actually don't look that great, so there are all sorts of things like ground glass and well.",
            "Emphysema and so on, which can be seen there.",
            "So.",
            "It might be, for example, that this comes from somebody who is 60 years old and has never smoked.",
            "And they radiologist might say, well, this is quite strange for somebody who's never smoked.",
            "Usually it's could be a smokers language.",
            "Looks like this.",
            "I wonder if there's anybody else in the hospital records that also has not smoked and has this type of lung.",
            "At the moment it's not possible to look for this."
        ],
        [
            "But what?",
            "Would be very useful, would be to go to the search box, give the image in, give the details about the patient in and get similar patients from the hospital's history which the."
        ],
        [
            "Radiologists could then look at look at the details and.",
            "Maybe that will help come to a diagnosis for what this is."
        ],
        [
            "So I'll give you a few of the search tasks that are in medicine, so the first one is the example I've just shown, which is a search for similar patients.",
            "So some of the age symptoms treatment.",
            "And this is especially useful for rare diseases.",
            "So if it's a disease that the physician sees every day, there's no reason to do the search.",
            "But if it's a one in 1000 or one in 10,000 patient, then this is where this comes in useful, because hopefully they will in the hospital archives, be a similar patient that the physician could then look at.",
            "Now this is not done in hospitals yet."
        ],
        [
            "But the patients are taking it into their own hands.",
            "For example, like Patientslikeme where patients can upload their medical data and try and find patients who have similar diseases and then discuss with them."
        ],
        [
            "And for rare diseases they are even people who go so far as to publish all of the medical details on the web.",
            "So this is a blog about a child who has a rare disease that nobody knows what it is.",
            "So the parents have basically put everything on the web in the hope that they will find somebody else who has the same symptoms and they can help out."
        ],
        [
            "Further search tasks.",
            "Well, the first one is basically taking the electronic health record as a query, so you have the record and to immediately give a link to useful information from the literature or from clinical pathways.",
            "For example, to suggest to the physician what he or she should do next.",
            "And the final one is actually search within medical records.",
            "So medical records often a huge amount of unstructured information.",
            "They consist of letters that the doctors have written when the patient was released, an various scribbles and notes that the doctors have taken, and it's very difficult in such a huge amount of information to find exactly what you need for this context.",
            "So search within this record could look at the context of the physician is working in, and find those parts of the medical record which are useful for this Sir particular context."
        ],
        [
            "So what are the challenges of doing this?",
            "So a big challenge is of course the privacy.",
            "So before any of these results can be shown.",
            "The health record must be anonymized.",
            "So all information that can identify the patient must be removed.",
            "This is pretty tough.",
            "The next problem is that the end users potentially don't want the solution, so many physicians are against having help from computers, even for very simple things.",
            "So this is an advertisement from newspapers in Austria recently from the Chamber of Physicians, there is a plan in Austria to install a national patient record system and the physician physicians is completely against it.",
            "They say here going to create.",
            "Like last patient, everybody will be able to look at your medical information so they're scaring amongst the population as to what medical health records electronic medical health records will bring.",
            "That's another problem.",
            "I was recently for some checkups in the hospital.",
            "They had medical records stored like that.",
            "What can you do?"
        ],
        [
            "Next problem, if you're using medical information in this sort of secondary way.",
            "The physicians are not used to entering information in a way that makes it useful to be used again so often they under time pressure, and they will only enter the stuff which has to be entered.",
            "So the fields that where you have to enter things and the fields which option will basically go through and leave it out?",
            "'cause nobody will look at it again anyway.",
            "They might believe so this is something we would have to change in terms of the culture of entry of information.",
            "The time aspect of it is of central importance.",
            "An for example, how long with somebody on drugs or how long was somebody in hospital.",
            "And something else that discussed here today is also information should be delivered at the point of care.",
            "So the physicians would want.",
            "The information to be.",
            "Available in a mobile way."
        ],
        [
            "Nope.",
            "The Christmas project is a new project which is developing.",
            "The techniques to be able to analyze this medical information so these on the right here are the sources that are currently being used in the project.",
            "So we're using everything except medical health records.",
            "That's just becausw the privacy issues surrounding the medical health records are just too complex to be able to sort out at this stage.",
            "So we are using radiology reports and radiology images.",
            "These are easier to get access to because they contain less patient specific information.",
            "And then, in addition to the two, those project is looking at the knowledge based information like the journals and websites and books and so on."
        ],
        [
            "The target end users for the project are the general public, medical, doctors, and radiologists."
        ],
        [
            "The technologies that have been developed in the project so they are semantic annotation, search also medical image search including huge search and huge 3 dimensional radiology images.",
            "Cross lingual search and machine translation for the medical domain and also health knowledge bases.",
            "So these are all technologies which we hope will also, once we can hopefully get access to the medical records in a decent way.",
            "Also be applicable to these.",
            "What we're also doing in the project are large scale user tests.",
            "So we are validating the technologies with representatives of physicians, radiologists, and the general public.",
            "We want to see what they think about these search technologies and these user tests should not be underestimated.",
            "It is an incredible amount of effort to be able to get these users set up the tests and validated in a way that is useful."
        ],
        [
            "So the conclusions?",
            "Hospitals have a huge amount of data stored, so the patient data which could but is not yet be put to secondary use.",
            "Some of the problems that are associated with this data, so there are very many different formats of electronic health record in use.",
            "Much of the information is actually stored as free text, so there's very little structured data in the health records.",
            "Mostly the physicians tend to type notes and so on that describe what they've done.",
            "These, of course, the multimodal information, so the images and radiology images and of course this information is not hyperlinked.",
            "There are no hyperlinks between patient records.",
            "So something that is very important here, which has already been discussed today, is putting the content in the context together so the physician or the radiologist would want the information that.",
            "Corresponds exactly to the current context that he or she is working in.",
            "And the biggest challenge in doing search in medical records is of course privacy.",
            "Firstly, in getting access to them.",
            "And then Secondly, in being able to anonymize them in a way that they could be displayed as search results.",
            "Thank you.",
            "As you mentioned, one of the issue is the data and state it is in today in hospitals, which is a challenge.",
            "But there are also health related area where data is available and I'm thinking for instance in France and I'm sure it's available elsewhere of the security social which has a huge data.",
            "Available in digital form of all of the prescription drug usage over a large period of time, and they don't seem to be doing anything with it.",
            "You quoted one example.",
            "I think it seems to be a rare one, do you?",
            "Are you aware of project in this area and what is the position that those people are taking about mining this data to extract information about the effectiveness of drugs and so on?",
            "I know that there are some new projects that are working on this, so there's debug it and there is.",
            "I can't remember the name now, but I'll have to look it up.",
            "I I also have a brief question.",
            "You mentioned that health care providers often under stress, don't have the time to really provide the additional data which will enable later on secondary use and search and make the data really findable and.",
            "Did you test the large scale tests include such secondary data provision to see what meaning did you test and the real conditions weather in?",
            "To what extent?",
            "Health care providers really provide such information, because if it's done later on or in a in lab, it's of course the information is extremely useful.",
            "But being very busy, they normally don't have the time today.",
            "So if they have limited time, then perhaps there may be some guidelines.",
            "How to use this time?",
            "Best to make this data searchable later on.",
            "Yeah, so in fact the tests that we will do will be just on search within this knowledge based information, so we're not looking at the information entry, but.",
            "I have seen that is.",
            "Very much dependent on the interface that you present to the physician, so I seen a study where they.",
            "Presented an interface with lots of text boxes and so on in the order that they would expect that the physician would enter it in over a number of pages, and this was not the way that the physicians tended to work, so they didn't like this at all.",
            "Because, you know, having a big sheet of paper and be able to enter something there and then enter something there and then go to the different place and as they're discussing with the patient into the relevant information, not in the order given by the somebody's idea of the questionnaire.",
            "So they had to redesign the computer interface so that it was possible to jump around in an easier way and enter the information as it comes in.",
            "And then it was accepted.",
            "OK, thank you again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'll be talking about enterprise search in medical data and why enterprise search.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Well, hospitals and health insurances have a large amount of data saved.",
                    "label": 0
                },
                {
                    "sent": "And here are some examples.",
                    "label": 0
                },
                {
                    "sent": "So we have, for example, the patient specific data.",
                    "label": 0
                },
                {
                    "sent": "This includes narrative reports from the doctor's structured data like outputs from lab tests, some images, radiology images.",
                    "label": 1
                },
                {
                    "sent": "In the future, we're also going to be getting too, so mix information like genomics and so on.",
                    "label": 0
                },
                {
                    "sent": "And this is all saved in a large store.",
                    "label": 0
                },
                {
                    "sent": "But beyond that, beyond this paper, the patient specific information there is also what I've called here.",
                    "label": 0
                },
                {
                    "sent": "The knowledge based information, which is not the information which is specific to the patient, but the information which shows all of the knowledge that there is in the medical domain.",
                    "label": 1
                },
                {
                    "sent": "So this is of course in journals and books and on the web to a certain extent.",
                    "label": 0
                },
                {
                    "sent": "And of course it's also very interesting for practitioners of medicine to be able to search through this.",
                    "label": 0
                },
                {
                    "sent": "Now, many of the topics that we spoke about today can also be applied to.",
                    "label": 0
                },
                {
                    "sent": "This medical data and I'm going to tell you some of the ways that this can be done.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So starting with the health records.",
                    "label": 0
                },
                {
                    "sent": "So at the moment these health records I entered by doctors they are saved.",
                    "label": 0
                },
                {
                    "sent": "But usually they are only accessible by patient ID, so you can only see somebody's health record when the person is standing there.",
                    "label": 1
                },
                {
                    "sent": "Some hospitals, to a certain extent, do some statistical analysis of the structured part of the data, but this is often for financial reasons because they want to know how many operations of which type were done.",
                    "label": 0
                },
                {
                    "sent": "Or for legal reasons, because they have to give statistics on how many outbreaks of various infections were in the hospital.",
                    "label": 0
                },
                {
                    "sent": "But you could do much more with this data.",
                    "label": 0
                },
                {
                    "sent": "You could this is a huge store data which could be used to optimize treatment of patients.",
                    "label": 0
                },
                {
                    "sent": "And at the moment this is hardly done at all.",
                    "label": 0
                },
                {
                    "sent": "So there have been some examples where the data has been mined, so there's a famous example from the Kaiser Permanente.",
                    "label": 0
                },
                {
                    "sent": "In the US, where they looked at two years worth of patient records for patients who had received Vioxx, and they discovered that a large number of these patients were having heart trouble and a larger than usual number were dying.",
                    "label": 0
                },
                {
                    "sent": "So this resulted in Vioxx being taken off the market.",
                    "label": 0
                },
                {
                    "sent": "And usually when using medical information, especially patient information in this secondary way is discussed, people tend to tend to immediately say, well there are privacy issues.",
                    "label": 0
                },
                {
                    "sent": "This is true, though of course private privacy issues, but this is a nice quote that I found which is at the other end of the spectrum which points out that in fact it is unethical to have all of that data there and not to use it.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to show a use case where this type of search within hospital records is useful.",
                    "label": 1
                },
                {
                    "sent": "So on the left.",
                    "label": 0
                },
                {
                    "sent": "Here we have a workflow for radiologist, so there's the first part over here.",
                    "label": 0
                },
                {
                    "sent": "In the top loop, which is basically the radiologist looking at the three dimensional image and creating in his or her head a 3 dimensional representation from these slice.",
                    "label": 0
                },
                {
                    "sent": "Use and once the radiologist has done this, then he or she might find what is wrong with this image and.",
                    "label": 0
                },
                {
                    "sent": "If it's been seen before, he can say, well, I know what this is and make a diagnosis when it becomes difficult is when he or she has not seen this specific.",
                    "label": 0
                },
                {
                    "sent": "Thing before and has to go and look to see what it is.",
                    "label": 0
                },
                {
                    "sent": "So then they enter the loop down here, which involves various things like asking colleagues or getting a huge book of example images and paging through it to try and find something that matches what's on the screen or trying to describe the pathology in words so that they can put it into a search engine and get the images back.",
                    "label": 0
                },
                {
                    "sent": "That might help them.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is an example of how this might work, so here a radiologist has a 3 dimensional representation of the lung.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Does some analysis finds with the languages.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Does some further analysis and finds that these lungs actually don't look that great, so there are all sorts of things like ground glass and well.",
                    "label": 0
                },
                {
                    "sent": "Emphysema and so on, which can be seen there.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "It might be, for example, that this comes from somebody who is 60 years old and has never smoked.",
                    "label": 0
                },
                {
                    "sent": "And they radiologist might say, well, this is quite strange for somebody who's never smoked.",
                    "label": 0
                },
                {
                    "sent": "Usually it's could be a smokers language.",
                    "label": 0
                },
                {
                    "sent": "Looks like this.",
                    "label": 0
                },
                {
                    "sent": "I wonder if there's anybody else in the hospital records that also has not smoked and has this type of lung.",
                    "label": 0
                },
                {
                    "sent": "At the moment it's not possible to look for this.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But what?",
                    "label": 0
                },
                {
                    "sent": "Would be very useful, would be to go to the search box, give the image in, give the details about the patient in and get similar patients from the hospital's history which the.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Radiologists could then look at look at the details and.",
                    "label": 0
                },
                {
                    "sent": "Maybe that will help come to a diagnosis for what this is.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'll give you a few of the search tasks that are in medicine, so the first one is the example I've just shown, which is a search for similar patients.",
                    "label": 1
                },
                {
                    "sent": "So some of the age symptoms treatment.",
                    "label": 0
                },
                {
                    "sent": "And this is especially useful for rare diseases.",
                    "label": 0
                },
                {
                    "sent": "So if it's a disease that the physician sees every day, there's no reason to do the search.",
                    "label": 0
                },
                {
                    "sent": "But if it's a one in 1000 or one in 10,000 patient, then this is where this comes in useful, because hopefully they will in the hospital archives, be a similar patient that the physician could then look at.",
                    "label": 0
                },
                {
                    "sent": "Now this is not done in hospitals yet.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the patients are taking it into their own hands.",
                    "label": 0
                },
                {
                    "sent": "For example, like Patientslikeme where patients can upload their medical data and try and find patients who have similar diseases and then discuss with them.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And for rare diseases they are even people who go so far as to publish all of the medical details on the web.",
                    "label": 0
                },
                {
                    "sent": "So this is a blog about a child who has a rare disease that nobody knows what it is.",
                    "label": 0
                },
                {
                    "sent": "So the parents have basically put everything on the web in the hope that they will find somebody else who has the same symptoms and they can help out.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Further search tasks.",
                    "label": 0
                },
                {
                    "sent": "Well, the first one is basically taking the electronic health record as a query, so you have the record and to immediately give a link to useful information from the literature or from clinical pathways.",
                    "label": 0
                },
                {
                    "sent": "For example, to suggest to the physician what he or she should do next.",
                    "label": 0
                },
                {
                    "sent": "And the final one is actually search within medical records.",
                    "label": 1
                },
                {
                    "sent": "So medical records often a huge amount of unstructured information.",
                    "label": 0
                },
                {
                    "sent": "They consist of letters that the doctors have written when the patient was released, an various scribbles and notes that the doctors have taken, and it's very difficult in such a huge amount of information to find exactly what you need for this context.",
                    "label": 0
                },
                {
                    "sent": "So search within this record could look at the context of the physician is working in, and find those parts of the medical record which are useful for this Sir particular context.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what are the challenges of doing this?",
                    "label": 0
                },
                {
                    "sent": "So a big challenge is of course the privacy.",
                    "label": 0
                },
                {
                    "sent": "So before any of these results can be shown.",
                    "label": 0
                },
                {
                    "sent": "The health record must be anonymized.",
                    "label": 1
                },
                {
                    "sent": "So all information that can identify the patient must be removed.",
                    "label": 0
                },
                {
                    "sent": "This is pretty tough.",
                    "label": 0
                },
                {
                    "sent": "The next problem is that the end users potentially don't want the solution, so many physicians are against having help from computers, even for very simple things.",
                    "label": 1
                },
                {
                    "sent": "So this is an advertisement from newspapers in Austria recently from the Chamber of Physicians, there is a plan in Austria to install a national patient record system and the physician physicians is completely against it.",
                    "label": 0
                },
                {
                    "sent": "They say here going to create.",
                    "label": 0
                },
                {
                    "sent": "Like last patient, everybody will be able to look at your medical information so they're scaring amongst the population as to what medical health records electronic medical health records will bring.",
                    "label": 0
                },
                {
                    "sent": "That's another problem.",
                    "label": 0
                },
                {
                    "sent": "I was recently for some checkups in the hospital.",
                    "label": 0
                },
                {
                    "sent": "They had medical records stored like that.",
                    "label": 0
                },
                {
                    "sent": "What can you do?",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Next problem, if you're using medical information in this sort of secondary way.",
                    "label": 0
                },
                {
                    "sent": "The physicians are not used to entering information in a way that makes it useful to be used again so often they under time pressure, and they will only enter the stuff which has to be entered.",
                    "label": 0
                },
                {
                    "sent": "So the fields that where you have to enter things and the fields which option will basically go through and leave it out?",
                    "label": 0
                },
                {
                    "sent": "'cause nobody will look at it again anyway.",
                    "label": 0
                },
                {
                    "sent": "They might believe so this is something we would have to change in terms of the culture of entry of information.",
                    "label": 0
                },
                {
                    "sent": "The time aspect of it is of central importance.",
                    "label": 1
                },
                {
                    "sent": "An for example, how long with somebody on drugs or how long was somebody in hospital.",
                    "label": 0
                },
                {
                    "sent": "And something else that discussed here today is also information should be delivered at the point of care.",
                    "label": 1
                },
                {
                    "sent": "So the physicians would want.",
                    "label": 0
                },
                {
                    "sent": "The information to be.",
                    "label": 0
                },
                {
                    "sent": "Available in a mobile way.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nope.",
                    "label": 0
                },
                {
                    "sent": "The Christmas project is a new project which is developing.",
                    "label": 0
                },
                {
                    "sent": "The techniques to be able to analyze this medical information so these on the right here are the sources that are currently being used in the project.",
                    "label": 0
                },
                {
                    "sent": "So we're using everything except medical health records.",
                    "label": 0
                },
                {
                    "sent": "That's just becausw the privacy issues surrounding the medical health records are just too complex to be able to sort out at this stage.",
                    "label": 0
                },
                {
                    "sent": "So we are using radiology reports and radiology images.",
                    "label": 0
                },
                {
                    "sent": "These are easier to get access to because they contain less patient specific information.",
                    "label": 0
                },
                {
                    "sent": "And then, in addition to the two, those project is looking at the knowledge based information like the journals and websites and books and so on.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The target end users for the project are the general public, medical, doctors, and radiologists.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The technologies that have been developed in the project so they are semantic annotation, search also medical image search including huge search and huge 3 dimensional radiology images.",
                    "label": 1
                },
                {
                    "sent": "Cross lingual search and machine translation for the medical domain and also health knowledge bases.",
                    "label": 1
                },
                {
                    "sent": "So these are all technologies which we hope will also, once we can hopefully get access to the medical records in a decent way.",
                    "label": 0
                },
                {
                    "sent": "Also be applicable to these.",
                    "label": 0
                },
                {
                    "sent": "What we're also doing in the project are large scale user tests.",
                    "label": 0
                },
                {
                    "sent": "So we are validating the technologies with representatives of physicians, radiologists, and the general public.",
                    "label": 0
                },
                {
                    "sent": "We want to see what they think about these search technologies and these user tests should not be underestimated.",
                    "label": 0
                },
                {
                    "sent": "It is an incredible amount of effort to be able to get these users set up the tests and validated in a way that is useful.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the conclusions?",
                    "label": 0
                },
                {
                    "sent": "Hospitals have a huge amount of data stored, so the patient data which could but is not yet be put to secondary use.",
                    "label": 1
                },
                {
                    "sent": "Some of the problems that are associated with this data, so there are very many different formats of electronic health record in use.",
                    "label": 0
                },
                {
                    "sent": "Much of the information is actually stored as free text, so there's very little structured data in the health records.",
                    "label": 0
                },
                {
                    "sent": "Mostly the physicians tend to type notes and so on that describe what they've done.",
                    "label": 0
                },
                {
                    "sent": "These, of course, the multimodal information, so the images and radiology images and of course this information is not hyperlinked.",
                    "label": 0
                },
                {
                    "sent": "There are no hyperlinks between patient records.",
                    "label": 0
                },
                {
                    "sent": "So something that is very important here, which has already been discussed today, is putting the content in the context together so the physician or the radiologist would want the information that.",
                    "label": 0
                },
                {
                    "sent": "Corresponds exactly to the current context that he or she is working in.",
                    "label": 0
                },
                {
                    "sent": "And the biggest challenge in doing search in medical records is of course privacy.",
                    "label": 0
                },
                {
                    "sent": "Firstly, in getting access to them.",
                    "label": 0
                },
                {
                    "sent": "And then Secondly, in being able to anonymize them in a way that they could be displayed as search results.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                },
                {
                    "sent": "As you mentioned, one of the issue is the data and state it is in today in hospitals, which is a challenge.",
                    "label": 0
                },
                {
                    "sent": "But there are also health related area where data is available and I'm thinking for instance in France and I'm sure it's available elsewhere of the security social which has a huge data.",
                    "label": 0
                },
                {
                    "sent": "Available in digital form of all of the prescription drug usage over a large period of time, and they don't seem to be doing anything with it.",
                    "label": 0
                },
                {
                    "sent": "You quoted one example.",
                    "label": 0
                },
                {
                    "sent": "I think it seems to be a rare one, do you?",
                    "label": 0
                },
                {
                    "sent": "Are you aware of project in this area and what is the position that those people are taking about mining this data to extract information about the effectiveness of drugs and so on?",
                    "label": 0
                },
                {
                    "sent": "I know that there are some new projects that are working on this, so there's debug it and there is.",
                    "label": 0
                },
                {
                    "sent": "I can't remember the name now, but I'll have to look it up.",
                    "label": 0
                },
                {
                    "sent": "I I also have a brief question.",
                    "label": 0
                },
                {
                    "sent": "You mentioned that health care providers often under stress, don't have the time to really provide the additional data which will enable later on secondary use and search and make the data really findable and.",
                    "label": 0
                },
                {
                    "sent": "Did you test the large scale tests include such secondary data provision to see what meaning did you test and the real conditions weather in?",
                    "label": 0
                },
                {
                    "sent": "To what extent?",
                    "label": 0
                },
                {
                    "sent": "Health care providers really provide such information, because if it's done later on or in a in lab, it's of course the information is extremely useful.",
                    "label": 0
                },
                {
                    "sent": "But being very busy, they normally don't have the time today.",
                    "label": 0
                },
                {
                    "sent": "So if they have limited time, then perhaps there may be some guidelines.",
                    "label": 0
                },
                {
                    "sent": "How to use this time?",
                    "label": 0
                },
                {
                    "sent": "Best to make this data searchable later on.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so in fact the tests that we will do will be just on search within this knowledge based information, so we're not looking at the information entry, but.",
                    "label": 0
                },
                {
                    "sent": "I have seen that is.",
                    "label": 0
                },
                {
                    "sent": "Very much dependent on the interface that you present to the physician, so I seen a study where they.",
                    "label": 0
                },
                {
                    "sent": "Presented an interface with lots of text boxes and so on in the order that they would expect that the physician would enter it in over a number of pages, and this was not the way that the physicians tended to work, so they didn't like this at all.",
                    "label": 0
                },
                {
                    "sent": "Because, you know, having a big sheet of paper and be able to enter something there and then enter something there and then go to the different place and as they're discussing with the patient into the relevant information, not in the order given by the somebody's idea of the questionnaire.",
                    "label": 0
                },
                {
                    "sent": "So they had to redesign the computer interface so that it was possible to jump around in an easier way and enter the information as it comes in.",
                    "label": 0
                },
                {
                    "sent": "And then it was accepted.",
                    "label": 0
                },
                {
                    "sent": "OK, thank you again.",
                    "label": 0
                }
            ]
        }
    }
}