{
    "id": "upmqbrdt3wnqcnq6ofepd32y4jmsvqgt",
    "title": "Learning with Structured Sparsity",
    "info": {
        "author": [
            "Junzhou Huang, Department of Computer Science, Rutgers, The State University of New Jersey"
        ],
        "published": "Aug. 26, 2009",
        "recorded": "June 2009",
        "category": [
            "Top->Computer Science->Machine Learning->Statistical Learning"
        ]
    },
    "url": "http://videolectures.net/icml09_huang_lwss/",
    "segmentation": [
        [
            "OK, I talked about their structural spaces."
        ],
        [
            "And little whereinto includes three part.",
            "The first part is about their motivation of our work, which based on the fact that more prior can improve the model selection, stab Liszt and.",
            "Also can reduce the sample requirement in comparisons.",
            "And in the second part, we will generalize the group spaces into their structure is versus and which they proposed the structure, IP, condition, framework where require few sample for better recovery in the compressed sense.",
            "And it is also.",
            "Framework will be more robust to their lowest in their status estimation.",
            "In this talk we are focused on the graph.",
            "Sparsest and.",
            "A white class of their structures buses.",
            "Finally, we will give a efficient algorithm for their structures buses and it is called a structure or NP."
        ],
        [
            "There's standard spacing had been well studied in the past year, and here is that is formulation and cold out is the loss function and also subject to their country.",
            "It is the sauce, spicy Lambeau it K. And if we don't know any prior about their support set of their sparse vector W, and that's the two class of solution for this problem, and the first is their convex relaxation, use their L1 regularization instead of X0 regularization optimization.",
            "Such as lasso and.",
            "The second class of activities greedy greedy algorithm such as matching pursuit or OMP, just also matching pursuit.",
            "An in compressors.",
            "That's also a lot of action proposed in recent year, which is follow follows OMP algorithm because it is very fast.",
            "And their their capacities for the case past data is awkward.",
            "Kellogg, P and here list their complexity is related with the number of the random projection in the compressed sense area and.",
            "The capacity is related with the too long estimating error in the area of their statistical estimation."
        ],
        [
            "And if we know the entry one 2P can be partitioned into disjoint group.",
            "And we also know that.",
            "Interesting care feature can features can be recovery can be covered by G Group.",
            "So we have a prior of their support set of this plus vector W. It means that enter in one group.",
            "It's either 0 or large to boast.",
            "So with this prior we have the group complexities Auckland K + 0 M Here.",
            "Because I have, we have to choose the group out of M group so we have cost complexity with G log N. Also because we we notice several sets national we have to suffer party K for estimation which the case that picture.",
            "But it cannot handle the overlapping group setting or more more complex."
        ],
        [
            "Picture.",
            "So.",
            "When we know the exact knowledge of the support sets.",
            "W we will only cost Auckland K complexities.",
            "Do we know nothing about a suppose set W. The convexity is Auckland K log P. So you will know the natural question is about there.",
            "You will know partial knowledge of the subset.",
            "How is the complete classes for example in the group law.",
            "So we know that the entry one group either both or larger boats.",
            "At this time they convinces Orangey look M. So question is.",
            "We want to extend the group lasso into the more general structure we want to answer.",
            "If we know any kind of partially about structure, we can improve the.",
            "We can improve their coding compliance is it should be range from K2K log K, log P. So basically it is based on the assumption that Menology will need to reduce complexities."
        ],
        [
            "I hear you say example widely used for the wavelet compression's in the image processing field and in there it will load that wavelet coefficient that follow the tree structure.",
            "When we when we use the compression, if we don't use list structure you mentioned tree structure machine we will need the complexities open catalog but we know it is should follow their tree structure.",
            "Maybe we only need to open K. Here's the left is orange and image and the middle is the recovery image which they unstructured space is a recovery algorithm and the right image is recovered with this drug.",
            "OK, Special Language Language language language.",
            "Yes, definitely boosting how many feature you like."
        ],
        [
            "OK, that's a lot of a lot of work had have.",
            "Attack is structured sparsity problem, and why classes is the work is based on the basic framework for the group especially and traced varsity and then have.",
            "Let's have the Apple app recall evidence to show that with the state tree structure or group structure information we will get there.",
            "Better result, but unfortunately there is no theoretical result to show this beverage.",
            "And also a lot of literacy is about the group law, so yeah.",
            "There's some more some theoretical justification for their Viagra plus or is better than loss of and which condition group lasso is better than generalize so an.",
            "Here you know here is the limitation that group lasso only can handle.",
            "The richest group structure structure and cannot handle the overlap group."
        ],
        [
            "In order to, in order to be able to.",
            "To handle the problem in Group and say P is proposed to.",
            "To to handle the problem, the hierarchy hierarchy.",
            "Laughing group problem.",
            "An unfortunate also Nationals series to validate their FT activities and also make sure law penalty also can use to for photo for validate.",
            "The advantage of the structure such as such just like that.",
            "Mutual oono Kaiser then used a structure shrinkage observation to identity structure map.",
            "But no additional server attic justification and the most clothes on work is the is the model based.",
            "Compressor is just.",
            "National One preprint, preprint work.",
            "Here we lost this work by by the comments of their review, and then give some theoretical result about the case in their comparisons.",
            "They want to use the model to handle the structure of the data, but unfortunately then don't propose a generic framework.",
            "How to represent this model?",
            "How to repair this general structure."
        ],
        [
            "Uncle, because there is a lot of applicable work to show that with more structure information will get the better result.",
            "By the National general theoretic framework.",
            "To qualify, it is effective, so I'm going first.",
            "We want to qualify this structure sparsity.",
            "We also want to give the minimize lumbar bound of the sample of the required sample in compressed sense.",
            "We also want to give the estimation accuracy guarantee for their or their scientist estimation, and also when you want to get a generic scheme an accident to flash to handle a wide class of structured sparsity problem and can handle my DOB structure."
        ],
        [
            "So we will model this problem with the structure sparsity regularization.",
            "So the first problem we have to qualify this structure how to qualify the structure with defined decoding the coordinates and decoding complexity.",
            "The current length is just the window the feature feature.",
            "Let's separate set.",
            "We want to know the number of bits we have to we have to use to encode this feature set.",
            "And.",
            "Decoding complexity include two part.",
            "The second part is used just like MD Air is the coding length and the second part when we know they support set with steel is submit to code their daily feature.",
            "So in compressed sense that require the required minimize number for the better for the perfect recovery is awkward areas and in their status automation there Lloyd tolerance will be also related with S and the noise variance.",
            "The basic assumption here is that not all sparse patterns are equally light.",
            "In the traditional standard sparsity optimization problem, then just assume that all sparse pattern equally like.",
            "Here we want to do the other direction, so this problem will be formulated as our structured sparsity regularization problem.",
            "Also loss function and the constraint we will constrain."
        ],
        [
            "A coding complexities instead of the sparse number.",
            "Here will give some example about the structures passes.",
            "There's standard spaces.",
            "It was the case partial Lambeau their coding convention where became flat scale log P and the group spaces is organ cake, plus GGM.",
            "And graphs pass it.",
            "In this paper we focus on their graphs faster because it it can represent a wider such as groups versus stand stand.",
            "Spicy and transparency are anything special.",
            "It will also compute the graph to the present so it is cold compresses Auckland K plus log P. Here G is the number of the connected components in the graph.",
            "And we here here we have macro, something that particularly control very large.",
            "Just open one.",
            "For example, in the random field specially or they connected region structure.",
            "We assume that we have four label food or 848 neighborhood, just that."
        ],
        [
            "Yeah, so one sample the connected region.",
            "It is widely used in the image processing and computer vision.",
            "This image comes from is captured by a surveillance camera.",
            "That's also should have background aiming for example.",
            "Maybe street or allicin building, but we only interested their object while interesting, so this background subtractor image is very sparse because we last only a few people compared with the whole image frame and this space is not just the random sparse.",
            "So then then they launch it or pixel try to cluster together for example.",
            "Next two people, so there's at most.",
            "Only two connected components here.",
            "The convexity just so just the open K plus jello P. Here in this case, let two people, so 92 connected components only K + 2 not pee fast small, and they keylog P."
        ],
        [
            "Here is the hierarchy tree hierarchy tree has been widely used in user in the image compression.",
            "And then the parents, if their parent Lance Ito.",
            "It is implied that the children more likely to be long O and.",
            "Also, it is required parents of the future if one children is the feature size number, so the complexities.",
            "Just the Auckland K instead of Auckland Kellogg P. Now we keep the brief approved for the.",
            "Graph complexities."
        ],
        [
            "1st.",
            "For each connected component in the graph, we have to pick a standpoint.",
            "And pick one point.",
            "We need.",
            "The compressor is awkward.",
            "Log P. That's the G connected components.",
            "So the total is G log P and the second step is we grow.",
            "Each feature node into it is a neighborhood node is just cause the open one.",
            "Next totally K larger pixels, lunches or picture.",
            "So totally we only need Auckland.",
            "K + G log P. Next day code complexity for the graph."
        ],
        [
            "Structures buses.",
            "How to solve this structure spaces and we have to give the sample minimize sample requirement bound and we have to give the estimation accuracy bound for this problem.",
            "Here we give a condition is just extend their IP condition into the structural IP condition.",
            "Maybe we can call sparse Egan value condition and if we.",
            "OK, stay here.",
            "It is just related for Auckland Auckland as.",
            "So I work.",
            "Oh, they minimize sample requirement bound and the Acura sponse over related with their age.",
            "Their coding complex is."
        ],
        [
            "And here give some there some.",
            "Estimation accuracies are bound for there.",
            "Form the structure regularization problem.",
            "And.",
            "And here now we give the whole series and for the structural regularization optimization problem.",
            "But it is.",
            "Computation is Erin efficient for the practical problem he made is not not.",
            "Not cool enough.",
            "Next two possible permission approximation.",
            "One is the convex relaxation, but it is difficult to apply to our case because we can see the graph spaces next degree with dynamic.",
            "So for each time we have to search through connected components and penalize each group.",
            "Until now we don't know how to how to handle this case and the 2nd.",
            "Possible solution is used creating accident and we try to extend our MP.",
            "Match consumes accident just forward grid action to do this."
        ],
        [
            "Already introduced, now we call this structure all MP because it just extending from their own P algorithm.",
            "For that it includes two step.",
            "The first step you just minimized the loss function which their current feature set.",
            "Then the second step we try to select a block of feature used the.",
            "This product selection rule.",
            "Here we try to compute the ratio this generation just.",
            "Try to find the fastest object value reduction per unit increase of the coding compliances."
        ],
        [
            "He keeps on the result of the converging on actin and finally will give."
        ],
        [
            "Summaries that we focus on the graphs pacitan will demonstrate the advantage of the structure recovery.",
            "Over transitionary group class or lecture or MP?",
            "And we also give some quantitative evaluation.",
            "Is the relative difference."
        ],
        [
            "Too long between the between the estimation here is 111 dimension sparse data and we can see here OMP result and natural graph because we don't know the group set, so we try to use the group lasso with different groups.",
            "Set group size with two, 48 and 16.",
            "We can see that result.",
            "Their structure on P. Over this over this accident."
        ],
        [
            "And here is we also try some weak sparse singular.",
            "It means that all entries are larger, but now it's over only a few large kauo infants.",
            "We also give result.",
            "It is also strict on piano."
        ],
        [
            "It is best here.",
            "Give some distant his result.",
            "Of course yeah, strong key offer.",
            "Is the best."
        ],
        [
            "And here is the the image application for the graph special, especially application you can see here.",
            "This is a sparse because only a few of the soil Anzio and most of 0.",
            "So we try to use the OMP and natural to recover.",
            "And here you see structure or P to recover.",
            "Of course there we are.",
            "Experiment setup is used in the compressed sense setup here gives someday value recover error."
        ],
        [
            "I hear you Sir, is used in the image compression, compression.",
            "Use the wavelet.",
            "We also give our result an with compare with the MP and illogical."
        ],
        [
            "Listed widely used, this surveillance image capture from the surveillance video next to introduce object with only a few pixels relative interest object.",
            "So we also use the compressor compressed recovery equity.",
            "Compare with Armstrong image here.",
            "Compared with a national, an MP.",
            "Also, our method gives the best result."
        ],
        [
            "Here is their standard result.",
            "We run a round 100 and get the variance and mean value.",
            "They recognize our result.",
            "Get the best."
        ],
        [
            "So now we get a summary that you need to talk.",
            "We give the general theoretic framework for this structure.",
            "Specifies how to.",
            "Showed that the advantage of with this structure, especially over the trendy traditional.",
            "Specially such as standard spaces or growth spaces.",
            "We also give a flasher coding scheme for for structural representation.",
            "We also give efficient algorithm structure on P to attack this problem we use the graph sparsity or SIG sample and.",
            "Dash 3 open question on how to here we just use the forward grading algorithm.",
            "How to add the backward step to improve current result and the second how to use the convex relaxation for structured sparse it needs another direction for structured sparsity regularization problem and also for general structure.",
            "We here in this talk we just focus on the graphs passes we we know the prior but we cannot use the graph to represent.",
            "With how to find more general structure representation reputation method?",
            "Actually, this work here focus on the.",
            "More serious, an accident and we don't show more.",
            "Practical result here, but actually I have a demo here for their practical application.",
            "Use this structure spaces to improve their current solution.",
            "Computer Vision system will get interesting at night.",
            "Maybe I can show you something cool with the demo.",
            "OK, that's all, thank you."
        ],
        [
            "What time?",
            "You showed the.",
            "Suggested a way to have connected components.",
            "You basically specify exactly the ones ahead of time.",
            "Or do you get the solution that tends to be connected or you get like 1 connected components or K connected.",
            "Perform components specify header.",
            "Yeah, you want to prove theoretically result.",
            "We assume that the G Group, but actually in our accident we don't know exactly how many group in the we don't need G as there are still.",
            "Requirement parameter in our algorithm.",
            "We just tried.",
            "We just assume this pixel not only this entry, not only sparse, but also has a clustering chat in the connective components or dispatches.",
            "Of course, if you know they you know how many how many connected components G will also, can we get even better result?",
            "But here because of this problem come from we will try to develop a practical system in our system.",
            "For example here.",
            "Yeah, this surveillance surveillance application.",
            "We don't know how many objects in your you will capture, so we don't know the component connected component number.",
            "I see, but if you knew that there was like only one connected component, no.",
            "Assume Oh yeah, yeah, yeah.",
            "Component, can you use the method you propose to retrieve the support with only one connected component?",
            "Yeah, we know.",
            "We know that you have one.",
            "Yeah no, I don't.",
            "I don't do until I don't do this work.",
            "Maybe continue.",
            "I will do that.",
            "More questions.",
            "So actually I have one.",
            "So what's the problem to incorporate the backward steps?",
            "Also talent problem.",
            "Edward steps backward.",
            "Therefore what yeah?",
            "Backward as well.",
            "Yeah backwards, because next more complex it because we use the block as the as a union.",
            "Which is different from the traditional special events one entries.",
            "Actually, we were.",
            "We were doing this in the future, but you know it is very.",
            "In the compressor, that's 22 methods to extend 2 on P2, the Co Sam on the SP.",
            "They use the backward to file in up here.",
            "That's the how to say that, for example, you delete one block.",
            "Maybe you have to follow this structure.",
            "Maybe you will break the original structure so it makes it more complex and then just add.",
            "OK.",
            "So thanks again for the speakers."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, I talked about their structural spaces.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And little whereinto includes three part.",
                    "label": 0
                },
                {
                    "sent": "The first part is about their motivation of our work, which based on the fact that more prior can improve the model selection, stab Liszt and.",
                    "label": 1
                },
                {
                    "sent": "Also can reduce the sample requirement in comparisons.",
                    "label": 0
                },
                {
                    "sent": "And in the second part, we will generalize the group spaces into their structure is versus and which they proposed the structure, IP, condition, framework where require few sample for better recovery in the compressed sense.",
                    "label": 0
                },
                {
                    "sent": "And it is also.",
                    "label": 1
                },
                {
                    "sent": "Framework will be more robust to their lowest in their status estimation.",
                    "label": 0
                },
                {
                    "sent": "In this talk we are focused on the graph.",
                    "label": 0
                },
                {
                    "sent": "Sparsest and.",
                    "label": 1
                },
                {
                    "sent": "A white class of their structures buses.",
                    "label": 0
                },
                {
                    "sent": "Finally, we will give a efficient algorithm for their structures buses and it is called a structure or NP.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's standard spacing had been well studied in the past year, and here is that is formulation and cold out is the loss function and also subject to their country.",
                    "label": 0
                },
                {
                    "sent": "It is the sauce, spicy Lambeau it K. And if we don't know any prior about their support set of their sparse vector W, and that's the two class of solution for this problem, and the first is their convex relaxation, use their L1 regularization instead of X0 regularization optimization.",
                    "label": 0
                },
                {
                    "sent": "Such as lasso and.",
                    "label": 0
                },
                {
                    "sent": "The second class of activities greedy greedy algorithm such as matching pursuit or OMP, just also matching pursuit.",
                    "label": 1
                },
                {
                    "sent": "An in compressors.",
                    "label": 0
                },
                {
                    "sent": "That's also a lot of action proposed in recent year, which is follow follows OMP algorithm because it is very fast.",
                    "label": 0
                },
                {
                    "sent": "And their their capacities for the case past data is awkward.",
                    "label": 1
                },
                {
                    "sent": "Kellogg, P and here list their complexity is related with the number of the random projection in the compressed sense area and.",
                    "label": 1
                },
                {
                    "sent": "The capacity is related with the too long estimating error in the area of their statistical estimation.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And if we know the entry one 2P can be partitioned into disjoint group.",
                    "label": 0
                },
                {
                    "sent": "And we also know that.",
                    "label": 0
                },
                {
                    "sent": "Interesting care feature can features can be recovery can be covered by G Group.",
                    "label": 0
                },
                {
                    "sent": "So we have a prior of their support set of this plus vector W. It means that enter in one group.",
                    "label": 0
                },
                {
                    "sent": "It's either 0 or large to boast.",
                    "label": 0
                },
                {
                    "sent": "So with this prior we have the group complexities Auckland K + 0 M Here.",
                    "label": 0
                },
                {
                    "sent": "Because I have, we have to choose the group out of M group so we have cost complexity with G log N. Also because we we notice several sets national we have to suffer party K for estimation which the case that picture.",
                    "label": 1
                },
                {
                    "sent": "But it cannot handle the overlapping group setting or more more complex.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Picture.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "When we know the exact knowledge of the support sets.",
                    "label": 1
                },
                {
                    "sent": "W we will only cost Auckland K complexities.",
                    "label": 0
                },
                {
                    "sent": "Do we know nothing about a suppose set W. The convexity is Auckland K log P. So you will know the natural question is about there.",
                    "label": 0
                },
                {
                    "sent": "You will know partial knowledge of the subset.",
                    "label": 1
                },
                {
                    "sent": "How is the complete classes for example in the group law.",
                    "label": 0
                },
                {
                    "sent": "So we know that the entry one group either both or larger boats.",
                    "label": 0
                },
                {
                    "sent": "At this time they convinces Orangey look M. So question is.",
                    "label": 1
                },
                {
                    "sent": "We want to extend the group lasso into the more general structure we want to answer.",
                    "label": 0
                },
                {
                    "sent": "If we know any kind of partially about structure, we can improve the.",
                    "label": 0
                },
                {
                    "sent": "We can improve their coding compliance is it should be range from K2K log K, log P. So basically it is based on the assumption that Menology will need to reduce complexities.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I hear you say example widely used for the wavelet compression's in the image processing field and in there it will load that wavelet coefficient that follow the tree structure.",
                    "label": 0
                },
                {
                    "sent": "When we when we use the compression, if we don't use list structure you mentioned tree structure machine we will need the complexities open catalog but we know it is should follow their tree structure.",
                    "label": 0
                },
                {
                    "sent": "Maybe we only need to open K. Here's the left is orange and image and the middle is the recovery image which they unstructured space is a recovery algorithm and the right image is recovered with this drug.",
                    "label": 0
                },
                {
                    "sent": "OK, Special Language Language language language.",
                    "label": 0
                },
                {
                    "sent": "Yes, definitely boosting how many feature you like.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, that's a lot of a lot of work had have.",
                    "label": 0
                },
                {
                    "sent": "Attack is structured sparsity problem, and why classes is the work is based on the basic framework for the group especially and traced varsity and then have.",
                    "label": 1
                },
                {
                    "sent": "Let's have the Apple app recall evidence to show that with the state tree structure or group structure information we will get there.",
                    "label": 0
                },
                {
                    "sent": "Better result, but unfortunately there is no theoretical result to show this beverage.",
                    "label": 1
                },
                {
                    "sent": "And also a lot of literacy is about the group law, so yeah.",
                    "label": 0
                },
                {
                    "sent": "There's some more some theoretical justification for their Viagra plus or is better than loss of and which condition group lasso is better than generalize so an.",
                    "label": 1
                },
                {
                    "sent": "Here you know here is the limitation that group lasso only can handle.",
                    "label": 0
                },
                {
                    "sent": "The richest group structure structure and cannot handle the overlap group.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In order to, in order to be able to.",
                    "label": 0
                },
                {
                    "sent": "To handle the problem in Group and say P is proposed to.",
                    "label": 0
                },
                {
                    "sent": "To to handle the problem, the hierarchy hierarchy.",
                    "label": 1
                },
                {
                    "sent": "Laughing group problem.",
                    "label": 0
                },
                {
                    "sent": "An unfortunate also Nationals series to validate their FT activities and also make sure law penalty also can use to for photo for validate.",
                    "label": 0
                },
                {
                    "sent": "The advantage of the structure such as such just like that.",
                    "label": 0
                },
                {
                    "sent": "Mutual oono Kaiser then used a structure shrinkage observation to identity structure map.",
                    "label": 0
                },
                {
                    "sent": "But no additional server attic justification and the most clothes on work is the is the model based.",
                    "label": 1
                },
                {
                    "sent": "Compressor is just.",
                    "label": 0
                },
                {
                    "sent": "National One preprint, preprint work.",
                    "label": 1
                },
                {
                    "sent": "Here we lost this work by by the comments of their review, and then give some theoretical result about the case in their comparisons.",
                    "label": 1
                },
                {
                    "sent": "They want to use the model to handle the structure of the data, but unfortunately then don't propose a generic framework.",
                    "label": 0
                },
                {
                    "sent": "How to represent this model?",
                    "label": 0
                },
                {
                    "sent": "How to repair this general structure.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Uncle, because there is a lot of applicable work to show that with more structure information will get the better result.",
                    "label": 0
                },
                {
                    "sent": "By the National general theoretic framework.",
                    "label": 0
                },
                {
                    "sent": "To qualify, it is effective, so I'm going first.",
                    "label": 0
                },
                {
                    "sent": "We want to qualify this structure sparsity.",
                    "label": 0
                },
                {
                    "sent": "We also want to give the minimize lumbar bound of the sample of the required sample in compressed sense.",
                    "label": 0
                },
                {
                    "sent": "We also want to give the estimation accuracy guarantee for their or their scientist estimation, and also when you want to get a generic scheme an accident to flash to handle a wide class of structured sparsity problem and can handle my DOB structure.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we will model this problem with the structure sparsity regularization.",
                    "label": 0
                },
                {
                    "sent": "So the first problem we have to qualify this structure how to qualify the structure with defined decoding the coordinates and decoding complexity.",
                    "label": 0
                },
                {
                    "sent": "The current length is just the window the feature feature.",
                    "label": 0
                },
                {
                    "sent": "Let's separate set.",
                    "label": 0
                },
                {
                    "sent": "We want to know the number of bits we have to we have to use to encode this feature set.",
                    "label": 1
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "Decoding complexity include two part.",
                    "label": 0
                },
                {
                    "sent": "The second part is used just like MD Air is the coding length and the second part when we know they support set with steel is submit to code their daily feature.",
                    "label": 0
                },
                {
                    "sent": "So in compressed sense that require the required minimize number for the better for the perfect recovery is awkward areas and in their status automation there Lloyd tolerance will be also related with S and the noise variance.",
                    "label": 0
                },
                {
                    "sent": "The basic assumption here is that not all sparse patterns are equally light.",
                    "label": 1
                },
                {
                    "sent": "In the traditional standard sparsity optimization problem, then just assume that all sparse pattern equally like.",
                    "label": 0
                },
                {
                    "sent": "Here we want to do the other direction, so this problem will be formulated as our structured sparsity regularization problem.",
                    "label": 0
                },
                {
                    "sent": "Also loss function and the constraint we will constrain.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A coding complexities instead of the sparse number.",
                    "label": 0
                },
                {
                    "sent": "Here will give some example about the structures passes.",
                    "label": 0
                },
                {
                    "sent": "There's standard spaces.",
                    "label": 0
                },
                {
                    "sent": "It was the case partial Lambeau their coding convention where became flat scale log P and the group spaces is organ cake, plus GGM.",
                    "label": 0
                },
                {
                    "sent": "And graphs pass it.",
                    "label": 0
                },
                {
                    "sent": "In this paper we focus on their graphs faster because it it can represent a wider such as groups versus stand stand.",
                    "label": 0
                },
                {
                    "sent": "Spicy and transparency are anything special.",
                    "label": 0
                },
                {
                    "sent": "It will also compute the graph to the present so it is cold compresses Auckland K plus log P. Here G is the number of the connected components in the graph.",
                    "label": 1
                },
                {
                    "sent": "And we here here we have macro, something that particularly control very large.",
                    "label": 0
                },
                {
                    "sent": "Just open one.",
                    "label": 0
                },
                {
                    "sent": "For example, in the random field specially or they connected region structure.",
                    "label": 0
                },
                {
                    "sent": "We assume that we have four label food or 848 neighborhood, just that.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, so one sample the connected region.",
                    "label": 1
                },
                {
                    "sent": "It is widely used in the image processing and computer vision.",
                    "label": 0
                },
                {
                    "sent": "This image comes from is captured by a surveillance camera.",
                    "label": 0
                },
                {
                    "sent": "That's also should have background aiming for example.",
                    "label": 0
                },
                {
                    "sent": "Maybe street or allicin building, but we only interested their object while interesting, so this background subtractor image is very sparse because we last only a few people compared with the whole image frame and this space is not just the random sparse.",
                    "label": 0
                },
                {
                    "sent": "So then then they launch it or pixel try to cluster together for example.",
                    "label": 0
                },
                {
                    "sent": "Next two people, so there's at most.",
                    "label": 0
                },
                {
                    "sent": "Only two connected components here.",
                    "label": 1
                },
                {
                    "sent": "The convexity just so just the open K plus jello P. Here in this case, let two people, so 92 connected components only K + 2 not pee fast small, and they keylog P.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here is the hierarchy tree hierarchy tree has been widely used in user in the image compression.",
                    "label": 0
                },
                {
                    "sent": "And then the parents, if their parent Lance Ito.",
                    "label": 0
                },
                {
                    "sent": "It is implied that the children more likely to be long O and.",
                    "label": 1
                },
                {
                    "sent": "Also, it is required parents of the future if one children is the feature size number, so the complexities.",
                    "label": 0
                },
                {
                    "sent": "Just the Auckland K instead of Auckland Kellogg P. Now we keep the brief approved for the.",
                    "label": 0
                },
                {
                    "sent": "Graph complexities.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "1st.",
                    "label": 0
                },
                {
                    "sent": "For each connected component in the graph, we have to pick a standpoint.",
                    "label": 1
                },
                {
                    "sent": "And pick one point.",
                    "label": 0
                },
                {
                    "sent": "We need.",
                    "label": 0
                },
                {
                    "sent": "The compressor is awkward.",
                    "label": 0
                },
                {
                    "sent": "Log P. That's the G connected components.",
                    "label": 1
                },
                {
                    "sent": "So the total is G log P and the second step is we grow.",
                    "label": 0
                },
                {
                    "sent": "Each feature node into it is a neighborhood node is just cause the open one.",
                    "label": 1
                },
                {
                    "sent": "Next totally K larger pixels, lunches or picture.",
                    "label": 0
                },
                {
                    "sent": "So totally we only need Auckland.",
                    "label": 0
                },
                {
                    "sent": "K + G log P. Next day code complexity for the graph.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Structures buses.",
                    "label": 0
                },
                {
                    "sent": "How to solve this structure spaces and we have to give the sample minimize sample requirement bound and we have to give the estimation accuracy bound for this problem.",
                    "label": 0
                },
                {
                    "sent": "Here we give a condition is just extend their IP condition into the structural IP condition.",
                    "label": 0
                },
                {
                    "sent": "Maybe we can call sparse Egan value condition and if we.",
                    "label": 0
                },
                {
                    "sent": "OK, stay here.",
                    "label": 0
                },
                {
                    "sent": "It is just related for Auckland Auckland as.",
                    "label": 0
                },
                {
                    "sent": "So I work.",
                    "label": 0
                },
                {
                    "sent": "Oh, they minimize sample requirement bound and the Acura sponse over related with their age.",
                    "label": 0
                },
                {
                    "sent": "Their coding complex is.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here give some there some.",
                    "label": 0
                },
                {
                    "sent": "Estimation accuracies are bound for there.",
                    "label": 0
                },
                {
                    "sent": "Form the structure regularization problem.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "And here now we give the whole series and for the structural regularization optimization problem.",
                    "label": 0
                },
                {
                    "sent": "But it is.",
                    "label": 0
                },
                {
                    "sent": "Computation is Erin efficient for the practical problem he made is not not.",
                    "label": 0
                },
                {
                    "sent": "Not cool enough.",
                    "label": 0
                },
                {
                    "sent": "Next two possible permission approximation.",
                    "label": 0
                },
                {
                    "sent": "One is the convex relaxation, but it is difficult to apply to our case because we can see the graph spaces next degree with dynamic.",
                    "label": 1
                },
                {
                    "sent": "So for each time we have to search through connected components and penalize each group.",
                    "label": 1
                },
                {
                    "sent": "Until now we don't know how to how to handle this case and the 2nd.",
                    "label": 0
                },
                {
                    "sent": "Possible solution is used creating accident and we try to extend our MP.",
                    "label": 0
                },
                {
                    "sent": "Match consumes accident just forward grid action to do this.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Already introduced, now we call this structure all MP because it just extending from their own P algorithm.",
                    "label": 0
                },
                {
                    "sent": "For that it includes two step.",
                    "label": 0
                },
                {
                    "sent": "The first step you just minimized the loss function which their current feature set.",
                    "label": 1
                },
                {
                    "sent": "Then the second step we try to select a block of feature used the.",
                    "label": 1
                },
                {
                    "sent": "This product selection rule.",
                    "label": 0
                },
                {
                    "sent": "Here we try to compute the ratio this generation just.",
                    "label": 0
                },
                {
                    "sent": "Try to find the fastest object value reduction per unit increase of the coding compliances.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "He keeps on the result of the converging on actin and finally will give.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Summaries that we focus on the graphs pacitan will demonstrate the advantage of the structure recovery.",
                    "label": 1
                },
                {
                    "sent": "Over transitionary group class or lecture or MP?",
                    "label": 1
                },
                {
                    "sent": "And we also give some quantitative evaluation.",
                    "label": 0
                },
                {
                    "sent": "Is the relative difference.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Too long between the between the estimation here is 111 dimension sparse data and we can see here OMP result and natural graph because we don't know the group set, so we try to use the group lasso with different groups.",
                    "label": 0
                },
                {
                    "sent": "Set group size with two, 48 and 16.",
                    "label": 0
                },
                {
                    "sent": "We can see that result.",
                    "label": 0
                },
                {
                    "sent": "Their structure on P. Over this over this accident.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here is we also try some weak sparse singular.",
                    "label": 0
                },
                {
                    "sent": "It means that all entries are larger, but now it's over only a few large kauo infants.",
                    "label": 0
                },
                {
                    "sent": "We also give result.",
                    "label": 0
                },
                {
                    "sent": "It is also strict on piano.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It is best here.",
                    "label": 0
                },
                {
                    "sent": "Give some distant his result.",
                    "label": 0
                },
                {
                    "sent": "Of course yeah, strong key offer.",
                    "label": 0
                },
                {
                    "sent": "Is the best.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here is the the image application for the graph special, especially application you can see here.",
                    "label": 0
                },
                {
                    "sent": "This is a sparse because only a few of the soil Anzio and most of 0.",
                    "label": 0
                },
                {
                    "sent": "So we try to use the OMP and natural to recover.",
                    "label": 0
                },
                {
                    "sent": "And here you see structure or P to recover.",
                    "label": 0
                },
                {
                    "sent": "Of course there we are.",
                    "label": 0
                },
                {
                    "sent": "Experiment setup is used in the compressed sense setup here gives someday value recover error.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I hear you Sir, is used in the image compression, compression.",
                    "label": 0
                },
                {
                    "sent": "Use the wavelet.",
                    "label": 0
                },
                {
                    "sent": "We also give our result an with compare with the MP and illogical.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Listed widely used, this surveillance image capture from the surveillance video next to introduce object with only a few pixels relative interest object.",
                    "label": 0
                },
                {
                    "sent": "So we also use the compressor compressed recovery equity.",
                    "label": 0
                },
                {
                    "sent": "Compare with Armstrong image here.",
                    "label": 0
                },
                {
                    "sent": "Compared with a national, an MP.",
                    "label": 0
                },
                {
                    "sent": "Also, our method gives the best result.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here is their standard result.",
                    "label": 0
                },
                {
                    "sent": "We run a round 100 and get the variance and mean value.",
                    "label": 0
                },
                {
                    "sent": "They recognize our result.",
                    "label": 0
                },
                {
                    "sent": "Get the best.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So now we get a summary that you need to talk.",
                    "label": 0
                },
                {
                    "sent": "We give the general theoretic framework for this structure.",
                    "label": 0
                },
                {
                    "sent": "Specifies how to.",
                    "label": 0
                },
                {
                    "sent": "Showed that the advantage of with this structure, especially over the trendy traditional.",
                    "label": 0
                },
                {
                    "sent": "Specially such as standard spaces or growth spaces.",
                    "label": 0
                },
                {
                    "sent": "We also give a flasher coding scheme for for structural representation.",
                    "label": 1
                },
                {
                    "sent": "We also give efficient algorithm structure on P to attack this problem we use the graph sparsity or SIG sample and.",
                    "label": 0
                },
                {
                    "sent": "Dash 3 open question on how to here we just use the forward grading algorithm.",
                    "label": 0
                },
                {
                    "sent": "How to add the backward step to improve current result and the second how to use the convex relaxation for structured sparse it needs another direction for structured sparsity regularization problem and also for general structure.",
                    "label": 1
                },
                {
                    "sent": "We here in this talk we just focus on the graphs passes we we know the prior but we cannot use the graph to represent.",
                    "label": 1
                },
                {
                    "sent": "With how to find more general structure representation reputation method?",
                    "label": 0
                },
                {
                    "sent": "Actually, this work here focus on the.",
                    "label": 0
                },
                {
                    "sent": "More serious, an accident and we don't show more.",
                    "label": 0
                },
                {
                    "sent": "Practical result here, but actually I have a demo here for their practical application.",
                    "label": 0
                },
                {
                    "sent": "Use this structure spaces to improve their current solution.",
                    "label": 0
                },
                {
                    "sent": "Computer Vision system will get interesting at night.",
                    "label": 0
                },
                {
                    "sent": "Maybe I can show you something cool with the demo.",
                    "label": 0
                },
                {
                    "sent": "OK, that's all, thank you.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What time?",
                    "label": 0
                },
                {
                    "sent": "You showed the.",
                    "label": 0
                },
                {
                    "sent": "Suggested a way to have connected components.",
                    "label": 0
                },
                {
                    "sent": "You basically specify exactly the ones ahead of time.",
                    "label": 0
                },
                {
                    "sent": "Or do you get the solution that tends to be connected or you get like 1 connected components or K connected.",
                    "label": 0
                },
                {
                    "sent": "Perform components specify header.",
                    "label": 0
                },
                {
                    "sent": "Yeah, you want to prove theoretically result.",
                    "label": 0
                },
                {
                    "sent": "We assume that the G Group, but actually in our accident we don't know exactly how many group in the we don't need G as there are still.",
                    "label": 0
                },
                {
                    "sent": "Requirement parameter in our algorithm.",
                    "label": 0
                },
                {
                    "sent": "We just tried.",
                    "label": 0
                },
                {
                    "sent": "We just assume this pixel not only this entry, not only sparse, but also has a clustering chat in the connective components or dispatches.",
                    "label": 0
                },
                {
                    "sent": "Of course, if you know they you know how many how many connected components G will also, can we get even better result?",
                    "label": 0
                },
                {
                    "sent": "But here because of this problem come from we will try to develop a practical system in our system.",
                    "label": 0
                },
                {
                    "sent": "For example here.",
                    "label": 0
                },
                {
                    "sent": "Yeah, this surveillance surveillance application.",
                    "label": 0
                },
                {
                    "sent": "We don't know how many objects in your you will capture, so we don't know the component connected component number.",
                    "label": 0
                },
                {
                    "sent": "I see, but if you knew that there was like only one connected component, no.",
                    "label": 0
                },
                {
                    "sent": "Assume Oh yeah, yeah, yeah.",
                    "label": 0
                },
                {
                    "sent": "Component, can you use the method you propose to retrieve the support with only one connected component?",
                    "label": 0
                },
                {
                    "sent": "Yeah, we know.",
                    "label": 0
                },
                {
                    "sent": "We know that you have one.",
                    "label": 0
                },
                {
                    "sent": "Yeah no, I don't.",
                    "label": 0
                },
                {
                    "sent": "I don't do until I don't do this work.",
                    "label": 0
                },
                {
                    "sent": "Maybe continue.",
                    "label": 0
                },
                {
                    "sent": "I will do that.",
                    "label": 0
                },
                {
                    "sent": "More questions.",
                    "label": 0
                },
                {
                    "sent": "So actually I have one.",
                    "label": 0
                },
                {
                    "sent": "So what's the problem to incorporate the backward steps?",
                    "label": 0
                },
                {
                    "sent": "Also talent problem.",
                    "label": 0
                },
                {
                    "sent": "Edward steps backward.",
                    "label": 0
                },
                {
                    "sent": "Therefore what yeah?",
                    "label": 0
                },
                {
                    "sent": "Backward as well.",
                    "label": 0
                },
                {
                    "sent": "Yeah backwards, because next more complex it because we use the block as the as a union.",
                    "label": 0
                },
                {
                    "sent": "Which is different from the traditional special events one entries.",
                    "label": 0
                },
                {
                    "sent": "Actually, we were.",
                    "label": 0
                },
                {
                    "sent": "We were doing this in the future, but you know it is very.",
                    "label": 0
                },
                {
                    "sent": "In the compressor, that's 22 methods to extend 2 on P2, the Co Sam on the SP.",
                    "label": 0
                },
                {
                    "sent": "They use the backward to file in up here.",
                    "label": 0
                },
                {
                    "sent": "That's the how to say that, for example, you delete one block.",
                    "label": 0
                },
                {
                    "sent": "Maybe you have to follow this structure.",
                    "label": 0
                },
                {
                    "sent": "Maybe you will break the original structure so it makes it more complex and then just add.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "So thanks again for the speakers.",
                    "label": 0
                }
            ]
        }
    }
}