{
    "id": "uws2qpia5xtd5f3gt5imr2yfvhkyudrr",
    "title": "Towards the Future of the Internet",
    "info": {
        "author": [
            "Lutz Heuser, SAP Corporate Research, SAP GA, Walldorf"
        ],
        "published": "April 16, 2008",
        "recorded": "March 2008",
        "category": [
            "Top->Computers->Networking"
        ]
    },
    "url": "http://videolectures.net/foi08_heuser_tfi/",
    "segmentation": [
        [
            "Welcome ladies and gentlemen, pleasure to be here.",
            "Thank you all for giving me the opportunity that was actually the very first activity in my role as in here today.",
            "I'm currently the chairman of the ICT Advisor Group to the European Commission and the night before I started officially that drop, he approached me and asked me would I come out here to talk about the outcome of Isack, which was exciting because we haven't even started so nevertheless I will be happy to tell you.",
            "We are able to report today so you won't get the view of SAP research.",
            "We have to share that some other time, but actually the outcome.",
            "Of this current I stock committee that has done a tremendous job in the past three months starting from scratch and providing paper describing our vision on what the work program 2920, ten should be all about.",
            "We have structured our work in three groups, three working groups, and so my presentation is structured accordingly.",
            "In order to stay in time, Peter, I will skip the third group.",
            "Which doesn't mean that I don't feel it's important.",
            "It's just that it's a specific application domain.",
            "Our stock has given some emphasis on, so I would just brought.",
            "In a few moments, go through that I focus on those two working groups which I believe are important to the context of this."
        ],
        [
            "Here.",
            "So here's the already somewhat the outcome of our thinking.",
            "And reflect already two of the three working groups I was talking about, namely the future Internet Working Group and the web based service Industry Group which you see on the upper part.",
            "And this is the most important slide to take away from my 10 minutes.",
            "So let me let elaborate a little bit on that.",
            "Clearly I stuck, identified there are couple of layers we have to do our research on in order to define what the future Internet is all about.",
            "It starts on the.",
            "Low level the devices and components and the conclusion is pretty simple.",
            "Also based on another consultation meeting earlier in February on the Etp's there are two jetties who have a very strong focus on these two aspects and we leave it to them for the moment to come up with a very precise definition of what the challenges should be all about there and the ice pack will have a careful revenue on these so we believe that the two jetties currently.",
            "Optimist and in York will give us some insight into that.",
            "It doesn't mean that they were limited to them, but definitely they should be on the driver seat.",
            "In addition to that, and in addition to the work they are doing and it's expanding over and above the device and components level, of course we see clearly two aspects now coming together that is to be taken as a given as part of the future Internet, and that is the one story which kept us busy for many many years.",
            "Called the network conversions, which means the while less and wireline network convergence.",
            "But at the same time we saw another discipline or keruing.",
            "It started with technologies such as RFID and today we call it the Internet of Things covering much more than just a very limited aspect of passive RFID tags.",
            "As we all know.",
            "So we now see that these coming together and in the Genie presentation earlier we saw a similar slide on this, where we can conclude the network will be everywhere.",
            "And the network will be transient, transparent and will allow us to have access to nearly everything and anything at any given point in time.",
            "And it doesn't matter from where we gonna get that access.",
            "Whether that's a mobile access, whether it's wired line access, where that's a human being accessing it, or whether that's a object or a machine or a device accessing it.",
            "So it's important to understand that the underlying future Internet infrastructure combines and.",
            "Comprises all of that and exposes that network through what we call a core Internet infrastructure.",
            "A set of core Internet infrastructure services.",
            "So we expect that there are certain core services provided by their future network infrastructure to the upper layers to access this kind of information.",
            "And if you look into already projects that have started in the Sixth Framework Programme and now looking into what's going on in the 7th Framework Program, you can clearly see that that has been already initiated some two years ago and will continue on becoming a strong play in the future.",
            "Secondly.",
            "Is that what we call the Internet of Services, which is a relatively new term about two years old now, which is getting some momentum.",
            "And that's where we put a lot of emphasis in the istec discussion.",
            "And here we see clearly on top of that global infrastructure will be the notion of what we call the global service delivery platform that allows a lot of new business services to be created.",
            "But these are business services will require a certain set of typically non functional features.",
            "Some of them have been discussed earlier on in the area of security topics such as trust and identity management.",
            "It also covers aspects of dependability and reliability.",
            "Scalability was already addressed in the Genie presentation earlier, and there will be more to come.",
            "So all of these.",
            "Non functional features need to be made available as part of what's being called the core business services.",
            "Again, the core business services themselves will not be exposed to the end consumer at the end of the day typically, but they will be consumed then by what is the new emphasis of ice talk this time, which is the web based service industry which will take these core business services, combine them with application level business services to the final.",
            "Set of services provided from promoted and provided to the customers, which could be either consumers, businesses or organizations such as governmental organizations.",
            "And the question mark here is a challenge to all of us.",
            "The question mark here is will we leave that part of the market?",
            "That part of the food chain through the rest of the world, particularly to the US?",
            "Or will Europe play a role in this?",
            "Some of the examples mentioned this morning in the panel, as well as some of them listed here show a clear strength of the United States in that context.",
            "And we have to ask ourselves, what is our role, our European role in this and in stock has challenged us or is stuck itself, and it's challenging you to come up with.",
            "Good examples on why should people not go and leave Europe for these kinds of services going to the US through the virtual network, but rather stay here and we have the revenue share within Europe, so that's the credential of this slide here.",
            "And we envision this three layer approach being fundamental in the way of the future of the."
        ],
        [
            "And that will evolve.",
            "We have put up a list of requirements I don't go through all of them.",
            "You will read them once the Ice Pack report is published, which will happen shortly as we finalize all of our homework is to be completed now and but you can see a number of aspects and I think which is important is that we have to understand what kind of horizontal services or the core business services will be made available.",
            "There was a large debate within.",
            "The ice pack and again I listed here some examples, but what we also put a lot of emphasis on is the fact that Europe has a chance to leverage its.",
            "Multilingual multicultural aspects in that context, and provide this as a value.",
            "Add to the question of how to access these kind of core services.",
            "So cross lingual dynamic business relationships and value networks are key aspects that has been discussed.",
            "Of course we have to take into consideration what has been established being called the Web 2.0 wave.",
            "We also have to acknowledge and should be proud about the fact that Europe is leading the semantic technology space we should build upon that leveraging that and of course we have a very strong play in this service oriented architecture, particularly when it gets to business applications which is one of the few sectors software sectors.",
            "Well, Europe has elite right now.",
            "Nevertheless, as stated earlier, expecting that this whole future Internet infrastructure will be end to end provided we have to have access to the real world, we call it the real world awareness provided by what is being called the Internet of Things, including sensors, embedded systems and what have you."
        ],
        [
            "Out of that?",
            "A recommendation or for the future Internet has been given first of all, and it's good to have the colleagues from Japan and US here prior to this presentation is a common global set of standards in the network to allow for this expansion of the future Internet.",
            "We have to have very similar to what we saw just a few minutes ago from Jeannie.",
            "Large scale generic tasks, living laps as we call them, which allow us to have an early access.",
            "And whether it's this slicing mechanism of Jeannie or some other way, by the way, where we can expose these applications and services very early in the life cycle in order to understand the related business model behind that?",
            "If you look into.",
            "The new applications that have occurred.",
            "None of them had a long lead time.",
            "None of them had a long research time before they were introduced.",
            "They were introduced very quickly.",
            "We're tried out and those who work with continued those who didn't workout with just killed.",
            "We have to have this kind of philosophy and mentality coming up now.",
            "Also, in our research environment, we can't wait five years until we start and productize that solution.",
            "Building Trust is a topic discussed earlier, so I can skip that for the moment, and it's important that we have the real dialogue with all stakeholders in that aspect.",
            "From the technology research all the way to the applique."
        ],
        [
            "In space.",
            "And again, to stress that the second working group was targeting the service industry, that particular will leverage that infrastructure and it's important that we have to understand that the service sector is the biggest and fastest growing sector globally.",
            "Also in Europe and we have to build upon our strength but we are wasting our time right now.",
            "Others are leading the curve and if we're not careful we will fall behind and that will have a tremendous impact on our economy which we have to secure that it's not going to happen.",
            "That's why I stuck with a very strong emphasis on this topic.",
            "Why are we well prepared?",
            "We have a strong business process knowledge in Europe maybe better than any other part in the world.",
            "We have good ways to enable new business models and particularly multinational.",
            "On EU level and we have with the European Union, the right infrastructure to operate and have the political and regulatory frameworks in place.",
            "So all of that gives us an opportunity to leverage that now end to end and not sticking only on the technology side, but rather having the service industry."
        ],
        [
            "Aspect taking into consideration that leads to recommendations for the web based service industries and.",
            "In summary, it's saying give us a chance now to establish new service companies.",
            "New service system self either in the business application space or in the governmental services space.",
            "Our public services space where we see Europe having a strong play and leveraging that in addition to the consumer space.",
            "So don't leave the consumer space out that don't take only the consumer space into consideration."
        ],
        [
            "As I said, the third topic that we are addressing, we I will only briefly address is that I start based also on the current political situation has put a very strong emphasis on a certain segment of industries that should leverage and benefit from that infrastructure dealing with sustainability and how ICT can help to sustain our environment so you will see some reporting in this but we are not limited to that set of industry segments.",
            "Father wanted to have a call with a broad range of service industries, clearly expanding over and beyond are the area of sustainable."
        ],
        [
            "Yeah, couple of recommendations which we have to deal with.",
            "I will skip them."
        ],
        [
            "For the sake of time, finishing up by again showing you that picture, telling you that the ice tech is strongly believing that it's time for the future Internet to come.",
            "Europe should be in the trial driver seat.",
            "We have a good position to start from, but clearly we should not stop at the technology level but really go towards the business services and beyond supporting the development of a new industry to come, which we called the web based service industry."
        ],
        [
            "Thank you for your comment."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Welcome ladies and gentlemen, pleasure to be here.",
                    "label": 0
                },
                {
                    "sent": "Thank you all for giving me the opportunity that was actually the very first activity in my role as in here today.",
                    "label": 0
                },
                {
                    "sent": "I'm currently the chairman of the ICT Advisor Group to the European Commission and the night before I started officially that drop, he approached me and asked me would I come out here to talk about the outcome of Isack, which was exciting because we haven't even started so nevertheless I will be happy to tell you.",
                    "label": 0
                },
                {
                    "sent": "We are able to report today so you won't get the view of SAP research.",
                    "label": 1
                },
                {
                    "sent": "We have to share that some other time, but actually the outcome.",
                    "label": 0
                },
                {
                    "sent": "Of this current I stock committee that has done a tremendous job in the past three months starting from scratch and providing paper describing our vision on what the work program 2920, ten should be all about.",
                    "label": 0
                },
                {
                    "sent": "We have structured our work in three groups, three working groups, and so my presentation is structured accordingly.",
                    "label": 0
                },
                {
                    "sent": "In order to stay in time, Peter, I will skip the third group.",
                    "label": 0
                },
                {
                    "sent": "Which doesn't mean that I don't feel it's important.",
                    "label": 0
                },
                {
                    "sent": "It's just that it's a specific application domain.",
                    "label": 0
                },
                {
                    "sent": "Our stock has given some emphasis on, so I would just brought.",
                    "label": 0
                },
                {
                    "sent": "In a few moments, go through that I focus on those two working groups which I believe are important to the context of this.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Here.",
                    "label": 0
                },
                {
                    "sent": "So here's the already somewhat the outcome of our thinking.",
                    "label": 0
                },
                {
                    "sent": "And reflect already two of the three working groups I was talking about, namely the future Internet Working Group and the web based service Industry Group which you see on the upper part.",
                    "label": 0
                },
                {
                    "sent": "And this is the most important slide to take away from my 10 minutes.",
                    "label": 0
                },
                {
                    "sent": "So let me let elaborate a little bit on that.",
                    "label": 0
                },
                {
                    "sent": "Clearly I stuck, identified there are couple of layers we have to do our research on in order to define what the future Internet is all about.",
                    "label": 0
                },
                {
                    "sent": "It starts on the.",
                    "label": 0
                },
                {
                    "sent": "Low level the devices and components and the conclusion is pretty simple.",
                    "label": 1
                },
                {
                    "sent": "Also based on another consultation meeting earlier in February on the Etp's there are two jetties who have a very strong focus on these two aspects and we leave it to them for the moment to come up with a very precise definition of what the challenges should be all about there and the ice pack will have a careful revenue on these so we believe that the two jetties currently.",
                    "label": 0
                },
                {
                    "sent": "Optimist and in York will give us some insight into that.",
                    "label": 0
                },
                {
                    "sent": "It doesn't mean that they were limited to them, but definitely they should be on the driver seat.",
                    "label": 0
                },
                {
                    "sent": "In addition to that, and in addition to the work they are doing and it's expanding over and above the device and components level, of course we see clearly two aspects now coming together that is to be taken as a given as part of the future Internet, and that is the one story which kept us busy for many many years.",
                    "label": 0
                },
                {
                    "sent": "Called the network conversions, which means the while less and wireline network convergence.",
                    "label": 0
                },
                {
                    "sent": "But at the same time we saw another discipline or keruing.",
                    "label": 0
                },
                {
                    "sent": "It started with technologies such as RFID and today we call it the Internet of Things covering much more than just a very limited aspect of passive RFID tags.",
                    "label": 0
                },
                {
                    "sent": "As we all know.",
                    "label": 0
                },
                {
                    "sent": "So we now see that these coming together and in the Genie presentation earlier we saw a similar slide on this, where we can conclude the network will be everywhere.",
                    "label": 0
                },
                {
                    "sent": "And the network will be transient, transparent and will allow us to have access to nearly everything and anything at any given point in time.",
                    "label": 0
                },
                {
                    "sent": "And it doesn't matter from where we gonna get that access.",
                    "label": 0
                },
                {
                    "sent": "Whether that's a mobile access, whether it's wired line access, where that's a human being accessing it, or whether that's a object or a machine or a device accessing it.",
                    "label": 0
                },
                {
                    "sent": "So it's important to understand that the underlying future Internet infrastructure combines and.",
                    "label": 0
                },
                {
                    "sent": "Comprises all of that and exposes that network through what we call a core Internet infrastructure.",
                    "label": 0
                },
                {
                    "sent": "A set of core Internet infrastructure services.",
                    "label": 1
                },
                {
                    "sent": "So we expect that there are certain core services provided by their future network infrastructure to the upper layers to access this kind of information.",
                    "label": 0
                },
                {
                    "sent": "And if you look into already projects that have started in the Sixth Framework Programme and now looking into what's going on in the 7th Framework Program, you can clearly see that that has been already initiated some two years ago and will continue on becoming a strong play in the future.",
                    "label": 0
                },
                {
                    "sent": "Secondly.",
                    "label": 0
                },
                {
                    "sent": "Is that what we call the Internet of Services, which is a relatively new term about two years old now, which is getting some momentum.",
                    "label": 0
                },
                {
                    "sent": "And that's where we put a lot of emphasis in the istec discussion.",
                    "label": 0
                },
                {
                    "sent": "And here we see clearly on top of that global infrastructure will be the notion of what we call the global service delivery platform that allows a lot of new business services to be created.",
                    "label": 1
                },
                {
                    "sent": "But these are business services will require a certain set of typically non functional features.",
                    "label": 0
                },
                {
                    "sent": "Some of them have been discussed earlier on in the area of security topics such as trust and identity management.",
                    "label": 0
                },
                {
                    "sent": "It also covers aspects of dependability and reliability.",
                    "label": 0
                },
                {
                    "sent": "Scalability was already addressed in the Genie presentation earlier, and there will be more to come.",
                    "label": 0
                },
                {
                    "sent": "So all of these.",
                    "label": 0
                },
                {
                    "sent": "Non functional features need to be made available as part of what's being called the core business services.",
                    "label": 0
                },
                {
                    "sent": "Again, the core business services themselves will not be exposed to the end consumer at the end of the day typically, but they will be consumed then by what is the new emphasis of ice talk this time, which is the web based service industry which will take these core business services, combine them with application level business services to the final.",
                    "label": 0
                },
                {
                    "sent": "Set of services provided from promoted and provided to the customers, which could be either consumers, businesses or organizations such as governmental organizations.",
                    "label": 0
                },
                {
                    "sent": "And the question mark here is a challenge to all of us.",
                    "label": 0
                },
                {
                    "sent": "The question mark here is will we leave that part of the market?",
                    "label": 0
                },
                {
                    "sent": "That part of the food chain through the rest of the world, particularly to the US?",
                    "label": 0
                },
                {
                    "sent": "Or will Europe play a role in this?",
                    "label": 0
                },
                {
                    "sent": "Some of the examples mentioned this morning in the panel, as well as some of them listed here show a clear strength of the United States in that context.",
                    "label": 0
                },
                {
                    "sent": "And we have to ask ourselves, what is our role, our European role in this and in stock has challenged us or is stuck itself, and it's challenging you to come up with.",
                    "label": 1
                },
                {
                    "sent": "Good examples on why should people not go and leave Europe for these kinds of services going to the US through the virtual network, but rather stay here and we have the revenue share within Europe, so that's the credential of this slide here.",
                    "label": 0
                },
                {
                    "sent": "And we envision this three layer approach being fundamental in the way of the future of the.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And that will evolve.",
                    "label": 0
                },
                {
                    "sent": "We have put up a list of requirements I don't go through all of them.",
                    "label": 0
                },
                {
                    "sent": "You will read them once the Ice Pack report is published, which will happen shortly as we finalize all of our homework is to be completed now and but you can see a number of aspects and I think which is important is that we have to understand what kind of horizontal services or the core business services will be made available.",
                    "label": 0
                },
                {
                    "sent": "There was a large debate within.",
                    "label": 0
                },
                {
                    "sent": "The ice pack and again I listed here some examples, but what we also put a lot of emphasis on is the fact that Europe has a chance to leverage its.",
                    "label": 0
                },
                {
                    "sent": "Multilingual multicultural aspects in that context, and provide this as a value.",
                    "label": 0
                },
                {
                    "sent": "Add to the question of how to access these kind of core services.",
                    "label": 0
                },
                {
                    "sent": "So cross lingual dynamic business relationships and value networks are key aspects that has been discussed.",
                    "label": 1
                },
                {
                    "sent": "Of course we have to take into consideration what has been established being called the Web 2.0 wave.",
                    "label": 0
                },
                {
                    "sent": "We also have to acknowledge and should be proud about the fact that Europe is leading the semantic technology space we should build upon that leveraging that and of course we have a very strong play in this service oriented architecture, particularly when it gets to business applications which is one of the few sectors software sectors.",
                    "label": 0
                },
                {
                    "sent": "Well, Europe has elite right now.",
                    "label": 1
                },
                {
                    "sent": "Nevertheless, as stated earlier, expecting that this whole future Internet infrastructure will be end to end provided we have to have access to the real world, we call it the real world awareness provided by what is being called the Internet of Things, including sensors, embedded systems and what have you.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Out of that?",
                    "label": 0
                },
                {
                    "sent": "A recommendation or for the future Internet has been given first of all, and it's good to have the colleagues from Japan and US here prior to this presentation is a common global set of standards in the network to allow for this expansion of the future Internet.",
                    "label": 1
                },
                {
                    "sent": "We have to have very similar to what we saw just a few minutes ago from Jeannie.",
                    "label": 0
                },
                {
                    "sent": "Large scale generic tasks, living laps as we call them, which allow us to have an early access.",
                    "label": 0
                },
                {
                    "sent": "And whether it's this slicing mechanism of Jeannie or some other way, by the way, where we can expose these applications and services very early in the life cycle in order to understand the related business model behind that?",
                    "label": 0
                },
                {
                    "sent": "If you look into.",
                    "label": 0
                },
                {
                    "sent": "The new applications that have occurred.",
                    "label": 0
                },
                {
                    "sent": "None of them had a long lead time.",
                    "label": 0
                },
                {
                    "sent": "None of them had a long research time before they were introduced.",
                    "label": 0
                },
                {
                    "sent": "They were introduced very quickly.",
                    "label": 0
                },
                {
                    "sent": "We're tried out and those who work with continued those who didn't workout with just killed.",
                    "label": 0
                },
                {
                    "sent": "We have to have this kind of philosophy and mentality coming up now.",
                    "label": 0
                },
                {
                    "sent": "Also, in our research environment, we can't wait five years until we start and productize that solution.",
                    "label": 1
                },
                {
                    "sent": "Building Trust is a topic discussed earlier, so I can skip that for the moment, and it's important that we have the real dialogue with all stakeholders in that aspect.",
                    "label": 0
                },
                {
                    "sent": "From the technology research all the way to the applique.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In space.",
                    "label": 0
                },
                {
                    "sent": "And again, to stress that the second working group was targeting the service industry, that particular will leverage that infrastructure and it's important that we have to understand that the service sector is the biggest and fastest growing sector globally.",
                    "label": 1
                },
                {
                    "sent": "Also in Europe and we have to build upon our strength but we are wasting our time right now.",
                    "label": 0
                },
                {
                    "sent": "Others are leading the curve and if we're not careful we will fall behind and that will have a tremendous impact on our economy which we have to secure that it's not going to happen.",
                    "label": 0
                },
                {
                    "sent": "That's why I stuck with a very strong emphasis on this topic.",
                    "label": 0
                },
                {
                    "sent": "Why are we well prepared?",
                    "label": 1
                },
                {
                    "sent": "We have a strong business process knowledge in Europe maybe better than any other part in the world.",
                    "label": 1
                },
                {
                    "sent": "We have good ways to enable new business models and particularly multinational.",
                    "label": 0
                },
                {
                    "sent": "On EU level and we have with the European Union, the right infrastructure to operate and have the political and regulatory frameworks in place.",
                    "label": 0
                },
                {
                    "sent": "So all of that gives us an opportunity to leverage that now end to end and not sticking only on the technology side, but rather having the service industry.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Aspect taking into consideration that leads to recommendations for the web based service industries and.",
                    "label": 1
                },
                {
                    "sent": "In summary, it's saying give us a chance now to establish new service companies.",
                    "label": 0
                },
                {
                    "sent": "New service system self either in the business application space or in the governmental services space.",
                    "label": 0
                },
                {
                    "sent": "Our public services space where we see Europe having a strong play and leveraging that in addition to the consumer space.",
                    "label": 0
                },
                {
                    "sent": "So don't leave the consumer space out that don't take only the consumer space into consideration.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As I said, the third topic that we are addressing, we I will only briefly address is that I start based also on the current political situation has put a very strong emphasis on a certain segment of industries that should leverage and benefit from that infrastructure dealing with sustainability and how ICT can help to sustain our environment so you will see some reporting in this but we are not limited to that set of industry segments.",
                    "label": 0
                },
                {
                    "sent": "Father wanted to have a call with a broad range of service industries, clearly expanding over and beyond are the area of sustainable.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yeah, couple of recommendations which we have to deal with.",
                    "label": 0
                },
                {
                    "sent": "I will skip them.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the sake of time, finishing up by again showing you that picture, telling you that the ice tech is strongly believing that it's time for the future Internet to come.",
                    "label": 0
                },
                {
                    "sent": "Europe should be in the trial driver seat.",
                    "label": 0
                },
                {
                    "sent": "We have a good position to start from, but clearly we should not stop at the technology level but really go towards the business services and beyond supporting the development of a new industry to come, which we called the web based service industry.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for your comment.",
                    "label": 0
                }
            ]
        }
    }
}