{
    "id": "uz34j5usef3zkd4hxd2mol5nwd7puqcn",
    "title": "Sleep Analytics and Online Selective Anomaly Detection",
    "info": {
        "author": [
            "Tahereh Babaie, NICTA, Australia's ICT Research Centre of Excellence"
        ],
        "published": "Oct. 7, 2014",
        "recorded": "August 2014",
        "category": [
            "Top->Computer Science->Data Mining",
            "Top->Computer Science->Knowledge Extraction"
        ]
    },
    "url": "http://videolectures.net/kdd2014_babaie_anomaly_detection/",
    "segmentation": [
        [
            "Hello, my name is Tara.",
            "I'm from University of Sydney and today I want to talk about a new problem we called on line selective anomaly detection and its application in sleep data analysis.",
            "I notice that we called it on line selective anomaly detection or all sad, and I notice the next paper you are going to hear is called Glad.",
            "So it's."
        ],
        [
            "So what is selective anomaly detection?",
            "Let's just start with a little bit about sleep analysis problem.",
            "We spend about 1/3 of all life is sleeping and the quality of our sleep is connected to the quality of our brain functionality or dysfunctionality.",
            "What sleep scientists do is they put some sense of over the head and they collect electromagnetic data which is called e.g from your brain and then by looking at this e.g they try to figure out the brain or the brain quality or the quality of your sleep.",
            "Associated with your brain functionality.",
            "Usually one person is sleeps one hour typically per night and during night you experience lots of events to your Electro electromagnetic measurements.",
            "There are different events that happen in your brain when you are asleep, which people in this area or try to understand them.",
            "In this paper we are most concerned about two of those events events.",
            "Which one is a sleep spindle one is K complexes, sleep spindles.",
            "Are very short term events and very fast.",
            "They occur less than one second, then you are asleep and the number of sleep spindles in your sleep varies from subject to subject.",
            "An from night tonight for each person, K complexes are high.",
            "A spike followed by a very lowest park and they are happening usually less than K sleep spindles in your sleep experience.",
            "The question for people in slips.",
            "Community is that how we can detect these events by measuring e.g when looking at that.",
            "Surprisingly, what they do know is looking at EG.",
            "And finding this event manually.",
            "So we propose a linear dynamic system to model e.g measurements and then by building an error residual system on top of this model and treating these events as normally we are able to find them.",
            "So if you look at the 2nd.",
            "Picture in the middle you can see that this error model is able to detect some events and then those events after investigating show up as sleep spindles and K complexes.",
            "On top of that there is 1 interesting need in this community and sometimes these researchers needs to just detect some of these events and they are not interested in other events.",
            "For example, sleep spindles happen much more than K complexes.",
            "And finding a complex is a little bit more difficult than finding a sleep spindles.",
            "So how we can make a residual error model that is able to find some of these anomalies that we are interested and suppress the other anomalies that we know about them?",
            "But we are not interested in the moment, so that is selective anomaly detection."
        ],
        [
            "So what I proposed in this paper is that I introduce a new problem which is called online selective anomaly detection or OSAP, and then we combine techniques from data mining and control theory to address the solution for this problem and then we evaluate the proposed method and really sleep data, EG."
        ],
        [
            "First of all, on line selective anomaly detection or OSAT has two parts.",
            "Two problem is involved.",
            "First is learning.",
            "Suppose we have been given the age data, which is a multi dimensional time series observation.",
            "We propose using linear dynamic system to fit a model to this observation.",
            "Because linear dynamic system is, it assumes that your observation is governed by a latent variable.",
            "X3 matrix C and your latent variable X which you are not able to see evolving through time through a.",
            "So as you can see, this is a linear model and this is the this is called linear dynamic system and based on this model we are able to make a linear error model.",
            "So because of the linearity the parameters of this error model is exactly the same as the parameters of your feet model and we have two type of error.",
            "One error which is observable.",
            "And water, which is latent error and we are not able to observe that this problem has been discussed in the machine learning community and control theory community.",
            "It has been suggested to be solved by EM algorithm as a classical solution and also buy a new method which is subspace method which using singular value decomposition instead of iterative EM algorithm."
        ],
        [
            "Then the second problem, which is involved in all set problem is a design problem no.",
            "Suppose a pattern P which is a user defined metrics and operates in latent space, happens or injected to our model.",
            "Of course, your error system is able to capture it to find it, but no suppose you have been given the error model or LDS and a pattern P is happening in latent space, but you want to design or generate a new residual model in a way that if your latent model is equal to this predefined pattern, you don't see it in your residual system.",
            "And otherwise whatever happens, you residual system detected so selectively choose some of anomalies.",
            "Show them to me, and separates other things that I know about that these P metrics, for example, in sleep data, can be something that you can get from the experts from the from the domain.",
            "For example, for sleep spindles we know how to find, we figure out how to find these P matrix."
        ],
        [
            "To solve this problem, we suggest using a simple feedback model which is based on the error which is observable as you as I described before, we have two errors in this area system.",
            "We have observed there and we have latent error observed or observable.",
            "So if we define two terms RN U by two unknown terms W&F and generate RU.",
            "And then feeding you back to the latent error and then keeping our Ave residual model, then applying all these things to our LDS system by some simple linear algebraic equations we can get this second model which is a dynamic residual model.",
            "This model is again linear, but no.",
            "The parameters of this model RAF&CF coming from a feedback can see feedback and they are equal to a -- F C&WC while WF are unknown.",
            "So the good thing about this model is that we are able to add just arnu residual model AF and CF through W&F to get the object if we want.",
            "Satisfied so that is the point of using this error model if."
        ],
        [
            "I want to conclude the solution, so we using a parameter.",
            "If we generate a visual input U and then feed the error back to the latent space, then the error E is calibrated by another term W to generate the new residual model.",
            "So if you look at the general graphical model of this residual model, we have part we learn, so we have to learn the parameters A&C from the data that is learning part.",
            "That is what we don't have any control because.",
            "The data is coming from the.",
            "This in this case from people who we observe there e.g.",
            "But the part which is dynamic residual model is the part that I have the control of it and I want to control these residual model to satisfy this subject.",
            "The object that I put here I want are to be zero when the P vendor matrix occurs.",
            "So to satisfying this object I use this adjustable terms W and.",
            "If."
        ],
        [
            "To see how it can help us, we use the transformation as a design approach.",
            "The transformation helps us to go through a very simple.",
            "Solution for our system.",
            "If you look at this, if I apply the transform to the model that I have to the model that I got and then.",
            "Very good property of this transformation is that the delay is going to be transformed to a simple multiplication of Z2 epsilon Z instead of having that deley.",
            "And if we solve it for epsilon, and then if you replace epsilon 2R exactly get the solution for the residual that we have, which is a function of Zita, which is a function of P. The matrix which might happen in the latent space.",
            "So what we wanted we wanted 20 happens.",
            "RBO so if we look at this equation, there is a simple answer for that.",
            "If we make W&F in a way that this G is always 0 so RBO whenever P happens.",
            "So we can conclude."
        ],
        [
            "A very simple theorem for a dynamic residual model.",
            "A sufficient condition for G2B0 is one of these two things because.",
            "We had already calculated G. We know that if CFP calls to zero and one of these two conditions also RONJO simply for first one CFP call to 0 meaning WCP is zero, and for that it's enough to choose W from the knowledge base of.",
            "C * P. This is a linear algebra problem, but Interestingly the second problem is finding another term F in a way that CFA F is equal.",
            "0 or AFP equals zero by solving.",
            "Both of them.",
            "We can get the solution we need for F. This is called Eigen space assignment problem.",
            "Because if you look at them.",
            "Simply for the case which is CFAF equals to 0.",
            "If we say means it means WCU minus FC equals to 0.",
            "So suppose that you have a matrix which is a minus FC.",
            "And suppose this matrix has eigenvalues zero and eigenvectors associated with these eigenvalues are the columns of WC.",
            "Then what happens?",
            "This condition is satisfied.",
            "So this is called eigenspace assignment problem."
        ],
        [
            "To make it a little bit more clear for you, I compare it with a singular value decomposition problem, which is very well known in the community.",
            "In SVD, we usually given a matrix X and then by doing SVD on that we usually get the singular space of the matrix, which is singular values and singular vectors.",
            "EA or Eigen structure assignment problem is an English problem.",
            "So we have we are given some predefined and pre specified eigenvalues and eigenvectors.",
            "Then we want to find the metrics that this matrix has these eigen structure.",
            "This is called eigen assignment problem which is the problem which has to be to be solved for having that theorem satisfied."
        ],
        [
            "Let's go to the experiments.",
            "We run the we have run the experiments over for subject age between 25 to 36 and the recording was at Woolcock Institute of Medical Research at Sydney.",
            "And what I."
        ],
        [
            "To show to you first about the detection of sleep spindles and K complexes, we define precision and recall based on the overlap of our interval detection and labeled interval real labeled intervals."
        ],
        [
            "Let's give you some statistics about what we have found.",
            "First of all, linear dynamic system has a very good accuracy in finding these events, but usually under predicts the number of anomalies or the number of these events, but it's overpredict.",
            "Usually the length of interval of these anomalies, which is a good thing."
        ],
        [
            "Another thing I want to show here too is about the online analysis.",
            "So also has problem has near real time detection performance.",
            "But however there is a tendency to start the detection early an end the detection early as well.",
            "Another important things is that the result is subject is subjective to the person you are looking at, so the result actually is different from subject to other."
        ],
        [
            "Subject.",
            "And the performance of design residual for sleep spindles.",
            "In this case we try to separate sleep spindles and keep the residual model to flag everything other than sleep spindles which is K complexes in our case as as you can see the error between these two different error, normal error and selective anomaly detection error is clearly says that when there is a sleep spindles, the error is quite.",
            "Large, but when there is no sleep spindle, the difference between these two error system is quite a small.",
            "It means our objective has been satisfied perfectly."
        ],
        [
            "I want to conclude that.",
            "Dynamical systems or LDS in this case show very good accuracy to model the multi dimensional EG data.",
            "The second thing is that when you use data, a model driven approach, the advantage of using this model driven is that we are able to control over the residual that we want and that is coming because we have a model.",
            "And the third thing is that all set problem is a general problem and can be applied in many situations and many applications.",
            "That's alright, thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Hello, my name is Tara.",
                    "label": 0
                },
                {
                    "sent": "I'm from University of Sydney and today I want to talk about a new problem we called on line selective anomaly detection and its application in sleep data analysis.",
                    "label": 1
                },
                {
                    "sent": "I notice that we called it on line selective anomaly detection or all sad, and I notice the next paper you are going to hear is called Glad.",
                    "label": 0
                },
                {
                    "sent": "So it's.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what is selective anomaly detection?",
                    "label": 0
                },
                {
                    "sent": "Let's just start with a little bit about sleep analysis problem.",
                    "label": 0
                },
                {
                    "sent": "We spend about 1/3 of all life is sleeping and the quality of our sleep is connected to the quality of our brain functionality or dysfunctionality.",
                    "label": 0
                },
                {
                    "sent": "What sleep scientists do is they put some sense of over the head and they collect electromagnetic data which is called e.g from your brain and then by looking at this e.g they try to figure out the brain or the brain quality or the quality of your sleep.",
                    "label": 0
                },
                {
                    "sent": "Associated with your brain functionality.",
                    "label": 0
                },
                {
                    "sent": "Usually one person is sleeps one hour typically per night and during night you experience lots of events to your Electro electromagnetic measurements.",
                    "label": 0
                },
                {
                    "sent": "There are different events that happen in your brain when you are asleep, which people in this area or try to understand them.",
                    "label": 0
                },
                {
                    "sent": "In this paper we are most concerned about two of those events events.",
                    "label": 0
                },
                {
                    "sent": "Which one is a sleep spindle one is K complexes, sleep spindles.",
                    "label": 0
                },
                {
                    "sent": "Are very short term events and very fast.",
                    "label": 0
                },
                {
                    "sent": "They occur less than one second, then you are asleep and the number of sleep spindles in your sleep varies from subject to subject.",
                    "label": 0
                },
                {
                    "sent": "An from night tonight for each person, K complexes are high.",
                    "label": 0
                },
                {
                    "sent": "A spike followed by a very lowest park and they are happening usually less than K sleep spindles in your sleep experience.",
                    "label": 0
                },
                {
                    "sent": "The question for people in slips.",
                    "label": 0
                },
                {
                    "sent": "Community is that how we can detect these events by measuring e.g when looking at that.",
                    "label": 0
                },
                {
                    "sent": "Surprisingly, what they do know is looking at EG.",
                    "label": 0
                },
                {
                    "sent": "And finding this event manually.",
                    "label": 0
                },
                {
                    "sent": "So we propose a linear dynamic system to model e.g measurements and then by building an error residual system on top of this model and treating these events as normally we are able to find them.",
                    "label": 0
                },
                {
                    "sent": "So if you look at the 2nd.",
                    "label": 0
                },
                {
                    "sent": "Picture in the middle you can see that this error model is able to detect some events and then those events after investigating show up as sleep spindles and K complexes.",
                    "label": 0
                },
                {
                    "sent": "On top of that there is 1 interesting need in this community and sometimes these researchers needs to just detect some of these events and they are not interested in other events.",
                    "label": 0
                },
                {
                    "sent": "For example, sleep spindles happen much more than K complexes.",
                    "label": 0
                },
                {
                    "sent": "And finding a complex is a little bit more difficult than finding a sleep spindles.",
                    "label": 0
                },
                {
                    "sent": "So how we can make a residual error model that is able to find some of these anomalies that we are interested and suppress the other anomalies that we know about them?",
                    "label": 0
                },
                {
                    "sent": "But we are not interested in the moment, so that is selective anomaly detection.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what I proposed in this paper is that I introduce a new problem which is called online selective anomaly detection or OSAP, and then we combine techniques from data mining and control theory to address the solution for this problem and then we evaluate the proposed method and really sleep data, EG.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "First of all, on line selective anomaly detection or OSAT has two parts.",
                    "label": 0
                },
                {
                    "sent": "Two problem is involved.",
                    "label": 0
                },
                {
                    "sent": "First is learning.",
                    "label": 0
                },
                {
                    "sent": "Suppose we have been given the age data, which is a multi dimensional time series observation.",
                    "label": 0
                },
                {
                    "sent": "We propose using linear dynamic system to fit a model to this observation.",
                    "label": 0
                },
                {
                    "sent": "Because linear dynamic system is, it assumes that your observation is governed by a latent variable.",
                    "label": 1
                },
                {
                    "sent": "X3 matrix C and your latent variable X which you are not able to see evolving through time through a.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, this is a linear model and this is the this is called linear dynamic system and based on this model we are able to make a linear error model.",
                    "label": 0
                },
                {
                    "sent": "So because of the linearity the parameters of this error model is exactly the same as the parameters of your feet model and we have two type of error.",
                    "label": 0
                },
                {
                    "sent": "One error which is observable.",
                    "label": 0
                },
                {
                    "sent": "And water, which is latent error and we are not able to observe that this problem has been discussed in the machine learning community and control theory community.",
                    "label": 1
                },
                {
                    "sent": "It has been suggested to be solved by EM algorithm as a classical solution and also buy a new method which is subspace method which using singular value decomposition instead of iterative EM algorithm.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Then the second problem, which is involved in all set problem is a design problem no.",
                    "label": 0
                },
                {
                    "sent": "Suppose a pattern P which is a user defined metrics and operates in latent space, happens or injected to our model.",
                    "label": 1
                },
                {
                    "sent": "Of course, your error system is able to capture it to find it, but no suppose you have been given the error model or LDS and a pattern P is happening in latent space, but you want to design or generate a new residual model in a way that if your latent model is equal to this predefined pattern, you don't see it in your residual system.",
                    "label": 0
                },
                {
                    "sent": "And otherwise whatever happens, you residual system detected so selectively choose some of anomalies.",
                    "label": 0
                },
                {
                    "sent": "Show them to me, and separates other things that I know about that these P metrics, for example, in sleep data, can be something that you can get from the experts from the from the domain.",
                    "label": 0
                },
                {
                    "sent": "For example, for sleep spindles we know how to find, we figure out how to find these P matrix.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To solve this problem, we suggest using a simple feedback model which is based on the error which is observable as you as I described before, we have two errors in this area system.",
                    "label": 0
                },
                {
                    "sent": "We have observed there and we have latent error observed or observable.",
                    "label": 0
                },
                {
                    "sent": "So if we define two terms RN U by two unknown terms W&F and generate RU.",
                    "label": 0
                },
                {
                    "sent": "And then feeding you back to the latent error and then keeping our Ave residual model, then applying all these things to our LDS system by some simple linear algebraic equations we can get this second model which is a dynamic residual model.",
                    "label": 0
                },
                {
                    "sent": "This model is again linear, but no.",
                    "label": 0
                },
                {
                    "sent": "The parameters of this model RAF&CF coming from a feedback can see feedback and they are equal to a -- F C&WC while WF are unknown.",
                    "label": 0
                },
                {
                    "sent": "So the good thing about this model is that we are able to add just arnu residual model AF and CF through W&F to get the object if we want.",
                    "label": 0
                },
                {
                    "sent": "Satisfied so that is the point of using this error model if.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to conclude the solution, so we using a parameter.",
                    "label": 0
                },
                {
                    "sent": "If we generate a visual input U and then feed the error back to the latent space, then the error E is calibrated by another term W to generate the new residual model.",
                    "label": 1
                },
                {
                    "sent": "So if you look at the general graphical model of this residual model, we have part we learn, so we have to learn the parameters A&C from the data that is learning part.",
                    "label": 0
                },
                {
                    "sent": "That is what we don't have any control because.",
                    "label": 0
                },
                {
                    "sent": "The data is coming from the.",
                    "label": 0
                },
                {
                    "sent": "This in this case from people who we observe there e.g.",
                    "label": 0
                },
                {
                    "sent": "But the part which is dynamic residual model is the part that I have the control of it and I want to control these residual model to satisfy this subject.",
                    "label": 0
                },
                {
                    "sent": "The object that I put here I want are to be zero when the P vendor matrix occurs.",
                    "label": 0
                },
                {
                    "sent": "So to satisfying this object I use this adjustable terms W and.",
                    "label": 0
                },
                {
                    "sent": "If.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To see how it can help us, we use the transformation as a design approach.",
                    "label": 1
                },
                {
                    "sent": "The transformation helps us to go through a very simple.",
                    "label": 0
                },
                {
                    "sent": "Solution for our system.",
                    "label": 0
                },
                {
                    "sent": "If you look at this, if I apply the transform to the model that I have to the model that I got and then.",
                    "label": 0
                },
                {
                    "sent": "Very good property of this transformation is that the delay is going to be transformed to a simple multiplication of Z2 epsilon Z instead of having that deley.",
                    "label": 0
                },
                {
                    "sent": "And if we solve it for epsilon, and then if you replace epsilon 2R exactly get the solution for the residual that we have, which is a function of Zita, which is a function of P. The matrix which might happen in the latent space.",
                    "label": 0
                },
                {
                    "sent": "So what we wanted we wanted 20 happens.",
                    "label": 0
                },
                {
                    "sent": "RBO so if we look at this equation, there is a simple answer for that.",
                    "label": 0
                },
                {
                    "sent": "If we make W&F in a way that this G is always 0 so RBO whenever P happens.",
                    "label": 0
                },
                {
                    "sent": "So we can conclude.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A very simple theorem for a dynamic residual model.",
                    "label": 1
                },
                {
                    "sent": "A sufficient condition for G2B0 is one of these two things because.",
                    "label": 1
                },
                {
                    "sent": "We had already calculated G. We know that if CFP calls to zero and one of these two conditions also RONJO simply for first one CFP call to 0 meaning WCP is zero, and for that it's enough to choose W from the knowledge base of.",
                    "label": 1
                },
                {
                    "sent": "C * P. This is a linear algebra problem, but Interestingly the second problem is finding another term F in a way that CFA F is equal.",
                    "label": 0
                },
                {
                    "sent": "0 or AFP equals zero by solving.",
                    "label": 0
                },
                {
                    "sent": "Both of them.",
                    "label": 0
                },
                {
                    "sent": "We can get the solution we need for F. This is called Eigen space assignment problem.",
                    "label": 0
                },
                {
                    "sent": "Because if you look at them.",
                    "label": 1
                },
                {
                    "sent": "Simply for the case which is CFAF equals to 0.",
                    "label": 0
                },
                {
                    "sent": "If we say means it means WCU minus FC equals to 0.",
                    "label": 0
                },
                {
                    "sent": "So suppose that you have a matrix which is a minus FC.",
                    "label": 0
                },
                {
                    "sent": "And suppose this matrix has eigenvalues zero and eigenvectors associated with these eigenvalues are the columns of WC.",
                    "label": 1
                },
                {
                    "sent": "Then what happens?",
                    "label": 1
                },
                {
                    "sent": "This condition is satisfied.",
                    "label": 0
                },
                {
                    "sent": "So this is called eigenspace assignment problem.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To make it a little bit more clear for you, I compare it with a singular value decomposition problem, which is very well known in the community.",
                    "label": 0
                },
                {
                    "sent": "In SVD, we usually given a matrix X and then by doing SVD on that we usually get the singular space of the matrix, which is singular values and singular vectors.",
                    "label": 0
                },
                {
                    "sent": "EA or Eigen structure assignment problem is an English problem.",
                    "label": 0
                },
                {
                    "sent": "So we have we are given some predefined and pre specified eigenvalues and eigenvectors.",
                    "label": 0
                },
                {
                    "sent": "Then we want to find the metrics that this matrix has these eigen structure.",
                    "label": 0
                },
                {
                    "sent": "This is called eigen assignment problem which is the problem which has to be to be solved for having that theorem satisfied.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go to the experiments.",
                    "label": 0
                },
                {
                    "sent": "We run the we have run the experiments over for subject age between 25 to 36 and the recording was at Woolcock Institute of Medical Research at Sydney.",
                    "label": 1
                },
                {
                    "sent": "And what I.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To show to you first about the detection of sleep spindles and K complexes, we define precision and recall based on the overlap of our interval detection and labeled interval real labeled intervals.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let's give you some statistics about what we have found.",
                    "label": 0
                },
                {
                    "sent": "First of all, linear dynamic system has a very good accuracy in finding these events, but usually under predicts the number of anomalies or the number of these events, but it's overpredict.",
                    "label": 0
                },
                {
                    "sent": "Usually the length of interval of these anomalies, which is a good thing.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Another thing I want to show here too is about the online analysis.",
                    "label": 0
                },
                {
                    "sent": "So also has problem has near real time detection performance.",
                    "label": 1
                },
                {
                    "sent": "But however there is a tendency to start the detection early an end the detection early as well.",
                    "label": 1
                },
                {
                    "sent": "Another important things is that the result is subject is subjective to the person you are looking at, so the result actually is different from subject to other.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Subject.",
                    "label": 0
                },
                {
                    "sent": "And the performance of design residual for sleep spindles.",
                    "label": 1
                },
                {
                    "sent": "In this case we try to separate sleep spindles and keep the residual model to flag everything other than sleep spindles which is K complexes in our case as as you can see the error between these two different error, normal error and selective anomaly detection error is clearly says that when there is a sleep spindles, the error is quite.",
                    "label": 0
                },
                {
                    "sent": "Large, but when there is no sleep spindle, the difference between these two error system is quite a small.",
                    "label": 0
                },
                {
                    "sent": "It means our objective has been satisfied perfectly.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I want to conclude that.",
                    "label": 0
                },
                {
                    "sent": "Dynamical systems or LDS in this case show very good accuracy to model the multi dimensional EG data.",
                    "label": 0
                },
                {
                    "sent": "The second thing is that when you use data, a model driven approach, the advantage of using this model driven is that we are able to control over the residual that we want and that is coming because we have a model.",
                    "label": 1
                },
                {
                    "sent": "And the third thing is that all set problem is a general problem and can be applied in many situations and many applications.",
                    "label": 1
                },
                {
                    "sent": "That's alright, thank you.",
                    "label": 0
                }
            ]
        }
    }
}