{
    "id": "v2hndxgm2chgscvfyiiiraw3zqrnhmgk",
    "title": "Space Planning for Online Community",
    "info": {
        "author": [
            "Danyel Fisher, Microsoft Research"
        ],
        "coauthor": [
            "Tammara Combs Turner, Microsoft",
            "Marc Smith, Microsoft Research"
        ],
        "published": "May 26, 2008",
        "recorded": "April 2008",
        "category": [
            "Top->Computer Science->Web Mining",
            "Top->Computer Science->Network Analysis->Social Networks"
        ]
    },
    "url": "http://videolectures.net/icwsm08_fisher_apoc/",
    "segmentation": [
        [
            "Good afternoon, my name is Danielle Fisher.",
            "I am here from Microsoft Research.",
            "I'm presenting this work in conjunction with.",
            "Well, I'm connecting.",
            "I'm presenting this work in conjunction with Mark Smith, who heard this morning and Tamera Turner, who unfortunately is in China and can't be presenting today.",
            "We're all from various bits of Microsoft Research and we've all been interested in online communities for the last few years.",
            "We've been thinking a lot about how we can interact with people who are running communities and people who run online communities of various sorts of income."
        ],
        [
            "And talking to us.",
            "So many people in this room are familiar with various online groups, online communities, blog conversations, wikis, and so on.",
            "All of these are.",
            "Important things, however, that you run into some issues of both size and scale.",
            "When you move up to dealing with the corporate context, there's different sorts of questions that we get concerned about.",
            "There's a larger numbers of situations to talk about, and there is a some economies of scale that need to be thought about."
        ],
        [
            "So Microsoft has a mind boggling number of different online communities that they try and run just some various places where they live.",
            "Is the MSN forums Windows Live spaces?",
            "It's a blogging thing.",
            "The MSDN forums where people talk about technical problems and answers.",
            "Codeplex has a number of forums.",
            "MSDN has a internal wiki, know Channel Nine runs a wiki and some forums and some other stuff.",
            "Not to mention newsgroups.",
            "Third party branded sites, sites that are not completely.",
            "Label this Microsoft, but that we contribute help and effort to, and so on at some point or another, huge number of these different groups have passed through a door talking about online communities, and so we wanted to sort of share some of the challenges that they've run into."
        ],
        [
            "And talk about ways that we've gotten around it.",
            "What I'm going to do then, is talk about sort of eight high points broken into four categories for each of these, I'm going to give you a rough quote.",
            "Something like the situation that we ran into and talk a little bit about what happened, and then I'll sort of give you the didactic lesson of some of the issues that we think might help resolve that.",
            "So we're going to break this into four categories.",
            "Things about the communities, location and purpose.",
            "We're going to talk about monitoring social activity.",
            "About providing feedback to users and ways that you can otherwise organize and."
        ],
        [
            "Maintain this pace.",
            "Now, as Mark pointed out this morning, there's a lot of literature in this space already creases both.",
            "How is X book and?",
            "Why my butt and Amy Jo Kim?",
            "All these are fabulous texts that are important reading and then when we go visit the teams that were coming to us with these issues, they often have 1, two or all three of these books on their shelves, which suggests that even if these issues are well underscored in the literature, there worth bringing out and sort of highlighting how they."
        ],
        [
            "Might feel different here.",
            "So let's start off Designer comes to us and complains that the online community that she created hasn't done anything yet.",
            "It was going to be for the a list of people who were in her particular area and they were going to get all those people in one place and great stuff would happen.",
            "It had been six months and nothing had happened at all.",
            "No."
        ],
        [
            "Had shown up this was in part because the great stuff must happen.",
            "Doesn't quite do it.",
            "You have to have a purpose for communities and in general this communities at Microsoft that have had some sort of fairly specific purpose have been more successful.",
            "This is an airport.",
            "Airports feel like airports and look like airports inside.",
            "They've got all the airport features and they're great for doing air porting in.",
            "You could not build a space that was simultaneously question airport.",
            "It would just throw things off one or the other one."
        ],
        [
            "Be very good at it.",
            "Let's move on.",
            "Person came up to us and said, well, we're trying to figure out a place where people who are administering with the Microsoft Management Console can talk to each other.",
            "It's very important 'cause there's a lot of tricky bits and they want to be able to help each other, they said.",
            "OK, what do you do now?",
            "And they said, well, they tend to use the installation console message boards.",
            "Oh, OK, so how about you put it in the installation console space?",
            "Well, installation console turns out to be run by developer division while management console is run by Windows Division and these are very different organizations.",
            "There are different parts of the come."
        ],
        [
            "They couldn't possibly work together.",
            "Of course, that's an external.",
            "That's an internal distinction.",
            "People at Microsoft very deeply care about our organizational differences.",
            "People outside the company really don't care, so the second piece of advice that we've been giving as often as possible was to build on the existing community and brand outside.",
            "It's all just Microsoft or whatever your favorite organization is.",
            "And if you can possibly find a way to erase those internal divisions, and you know instead of the world with happy little blue balls all painted in the same colors, things will be much."
        ],
        [
            "More coherent.",
            "Mark alluded earlier to talk to issues about community return on investment about groups having a successful reach and impact.",
            "And the question of course is, will our community survive?",
            "So people want to know whether it's worth the energy to put this in.",
            "We have spent a fair bit of time digging through literature trying to find return on investment on community.",
            "There's been one or two Forrester reports on it.",
            "There's been a couple of things in academia, but I don't think anyone has successfully yet figured out whether it's worth the dollars to run an online community or not.",
            "We've been able to do some handwaving about this, we for example being able to talk with groups and to estimate how much they expect the answers that show up on a forum cost them to provide as opposed to the answers that they'd have to provide through a help desk or an answer through a phone call or an answer through a personal email.",
            "And it turns out, of course, that putting up an answer on the web is a much, much better thing than having it.",
            "Then giving it in person.",
            "Because then it's archived."
        ],
        [
            "It's collected and can be kept, but in general we wanted to encourage groups to have some sense of what their space is doing.",
            "Once they knew something about what the community is, how the community is interacting.",
            "They'd be able to make much more informed statements about return on investment, so you may not be able to have an underground."
        ],
        [
            "NORAD radar installation, for example, but you can have some visualizations like Mark was showing this morning.",
            "So to go back to one of the images we were talking about the scatter plot on the X axis is the number of posts in any thread in the News Group on the Y axis is the number of days that given user has been active on the newsgroup.",
            "Each bubble represents a single user, so the users towards the top on the left side, or people who have been on the News Group a whole lot have interact.",
            "And have since there on the left side they've had very short threads, very short conversations, people further down, have had fewer interactions on the group, and many of those have had noticeably longer conversations.",
            "This is the pattern that mark referred to, and that we refer to as the question and answer pattern.",
            "So up there are answer people.",
            "They show up.",
            "They answer a question they leave, they show up the answer question.",
            "If they do this a whole lot of times, that's 300 days per year.",
            "At those bubbles on the top on the bottom is everyone else.",
            "There's sort of floating around in the.",
            "Space of showing up under 100 times a year so they have a couple of questions they show up.",
            "They ask something they go away.",
            "Vast majority of the group is not bottom section.",
            "The top bit has a fewer peep."
        ],
        [
            "So now that we know how to interpret this, let's look at a couple other groups Microsoft Dot public dot access discussing the access database system looks pretty similar.",
            "Microsoft Public Windows Server general also has this cluster of answer people.",
            "They show up a little less often Microsoft Dot public dot MSN Messenger has one very hardworking answer person who is there every day of the year, apparently.",
            "The Windows 98 general discussion is a little bit different.",
            "The people who are most active seem to have wandered a little bit over to the right, and that's because even though this is nominally a question answer space, we're also seeing discussion right.",
            "It's someone comes in and says this is it's no longer just.",
            "How do I solve this problem, but.",
            "Why is Microsoft foisting off this piece of crap on us and has to be responded to and discussed and argued out in all its various permutations and combinations?",
            "Those of you who are teachers then will recognize this pattern over here where the most active people are way over to the right.",
            "That's a group to discuss the MCSE certification exam.",
            "And as you know, every time that someone asks a question quest, it gets followed up by yes, but will be out in the test and the review.",
            "It didn't really look that way, and so the most active people are getting into these longer and longer conversations.",
            "Talks to."
        ],
        [
            "That further, let's move outside of the question and answer space on the left is the Polish computer operating system advocacy group.",
            "Where if you want to argue about whether Windows is a better or worse operating system, the Macintosh in Polish, that's the place to go.",
            "The most active people are very far to the right.",
            "That's a group that's pretty much consumed with arguments and flame wars, so the people up there are really fighting it out hard.",
            "In the Microsoft Flightsim Group, no one's been on more than 50 days of the year.",
            "They obviously have other things to do with their time.",
            "And in the binary sounds MP3 complete CD, no ones going anywhere off to the right.",
            "That's because they're all using automated posting software that simply rips their CDs.",
            "You encodes them and post them into the group in individual messages.",
            "No threads, no conversation, simply simply."
        ],
        [
            "Binaries CD's.",
            "So."
        ],
        [
            "So actually, just to go back.",
            "So while we'd suggest you know, while we've come up with these visualizations and the one that Mark showed earlier this morning.",
            "We're not necessarily saying that these are the specific answer to your communities.",
            "Questions were instead saying is that being able to look at the data through some of the techniques that have come up in this conference and in other contexts knowing something about the metadata, knowing something about who's in there and what they're playing with begins to give you tools for understanding the."
        ],
        [
            "Success of your community.",
            "In a related question, people would say hey, look, we've got thousands of people looking at our pages.",
            "They come in, they dig around.",
            "They seem to find answers, but we've only got a few dozen people who are posting everyday.",
            "So they've actually started looking at the metadata of their group and they are bothered by it.",
            "What could they possibly do about these free riders who aren't contributing?"
        ],
        [
            "I tend to shrug.",
            "It's perfectly OK to have free riders.",
            "That's why we post on public websites.",
            "Free riders tend to come in the form of leaders, and leaders are fine and exceptional things.",
            "Here's one of them, but you've seen some in that last slide with the person sort of floating at the top.",
            "The answer people and these are great to cultivate.",
            "Their really important to have, but lurkers are also turned out to be surprisingly valuable.",
            "The lurkers who are not contributing as Jenny Preece and Blair Nanaki have contributed successfully shown are still out there.",
            "They're sending email to their friends with links to the page there, waiting and bidding their time until they have the right question to ask at which they'll contribute.",
            "Maybe there is storing up information or their active in some other form and they're not in this one, so it's completely fine to have that 8020 ratio or even.",
            "As I was suggesting this morning, the 99 one ratio that seems to."
        ],
        [
            "Cat OK for a lot of these groups.",
            "Of course, if some social psychology experiments in the last few years, Paul Resnik has shown that if you do have those leaders go out and welcome people who have shown up in the group and give them positive feedback for having participated, they're more likely in turn to turn into group leaders and regulars."
        ],
        [
            "Let's go back in steps.",
            "Groups are looking for ways to reward interaction and find ways to help users know that.",
            "They've been successful, so in one group they put up a top 10 list of contributors.",
            "The more people added, the better they ranked people you know would be right at the top for having added a whole lot of entries to this list.",
            "So we asked them, well so has the top 10 list.",
            "Well is kind of mixed.",
            "It got a lot of people who are adding lots of."
        ],
        [
            "Junk because of course we were rewarding on being on the top of the list if getting if given if posting lots of posts put you at the top of the list and people will by God post lots of posts.",
            "They want to post lots of good post about some high quality poster.",
            "Lots of interesting posts, but man they will post lots of posts and anyone who's ever seen a pinball machine before knows exactly the temptation of being on the top ten of the top 10 list.",
            "We've seen this in all sorts of different contests, contexts.",
            "In fact, sites like Digg can be argued to be a perpetual game of trying to get yourself to the top 10 list before someone else gets themselves to the top 10 list.",
            "Which can be a fine thing if you're trying to encourage, for example on dig any old link you posses."
        ],
        [
            "You can get.",
            "But there's other contexts in which you can imagine.",
            "I'm not putting up this image because they encourage that you write your users a check, but rather that Don nuthin his famous checks for finding new bugs in his books has found a fascinating way to encourage people to read his books as carefully as possible.",
            "People read his books in mind boggling amounts of details, scrubbing over character by character, trying to understand every word that he's got written by rewarding every novel bug that he found.",
            "This is a rare four bugcheck.",
            "Not many people get four bugcheck."
        ],
        [
            "Other ways to do this of course, can involve reflecting information to individual reflecting behavior to individual users rather than to users collectively."
        ],
        [
            "So for example, Mark had talked a little bit about the NET scan system that we had a running netscan, among other things, provided us individual portal of a single users participation.",
            "So you could go in and look at the single users.",
            "At you can look at a single users or someone else's profile, or look at your own profile.",
            "Your own profile actually had a little more detail of the last things you had posted.",
            "How often you posted where you posted, how much you posted, so you both had the ability to sort of copy off a piece of this, show it off to other people.",
            "Hey, check out, here's my participation, but without ever being directly compared, so there was no context where you'd say, hey look, I'm better than you because better than you would in fact encourage someone else is saying no, no, I'm better.",
            "And then you get back into the top 10 list again."
        ],
        [
            "OK, so we're trying to do quality control and we're not really allowed to do a top 10 list.",
            "At least we can do negative reputation, right?",
            "For each post that someone places will let everyone else rate it and negative posts, you know, get give you a negative reputation.",
            "And people have a negative reputation.",
            "Get slammed down into the ground and kicked out of the site, and man then will only have good people on our site which."
        ],
        [
            "Works just fine.",
            "Because after all, it costs a lot of money to get into account and people value those new accounts right?",
            "Because oh wait on eBay, at least registration is free and so is Craigslist, and so is Wikipedia and so is almost everything else in fact, which means that assigning negative reputation.",
            "Means that the person who was determined to cause trouble will simply leave and go cause trouble again.",
            "Paul Resnik, again, actually has done research on the value of eBay reputation, and he was essentially able to show that people were willing to misbehave to the level of the value of the reputation that they already accumulated.",
            "That is to say.",
            "If you've been spending a whole lot of time on eBay, you've got this great reputation and you've bought a whole lot of stuff at really good transactions, and you're completely unwilling to allow some bad interaction to Sully this, you know, unless it's really worth a whole lot of money.",
            "Conversely, if your brand new on eBay, it doesn't matter if you misbehave, because after all, what can you do?",
            "You can go register for new account.",
            "In contrast, people who are sincere, really wanting to help out, but now they've gotten their name smudged because they misbehaved and got a negative reputation are also discouraged from interacting because now they're afraid that they're going to walk around stigmatized."
        ],
        [
            "So I'm in.",
            "I'm strongly in favor of positive reputation systems if you can make people who are doing well know that they're doing well, and people who are doing better than that know that they're doing even better than that, then you've got a great system for encouraging people to move upwards.",
            "But negative reputation hasn't, at least in our experience, been as clearly successful."
        ],
        [
            "We spoke with another team that was very excited about making sure that users had a very specific place right.",
            "There could be no spam if you've got only people who are talking about this particular topic in this particular place.",
            "So for each make and model of car, they put up a special message board doesn't cost much to add the new add new message board button and they had hundreds of them.",
            "Of course, no one ever showed up.",
            "You would go to the cars site and there would just be hundreds and hundreds of message boards and you click in on each and everyone of them and they all like.",
            "Have you know 123 messages on it.",
            "Things like this?"
        ],
        [
            "That's because critical mass is kind of important.",
            "This subway car is a dark and scary place, or at least a quiet one because no ones there you really want.",
            "Maybe it's not crowded then at least enough activity that things continue.",
            "Now what this critical mass means can be different between different groups in different places.",
            "Some some online forms of critical mass might be a simple five or six people chatting.",
            "As Mark pointed out well at other forums it might take a couple hundreds to keep a sufficient quantity of people.",
            "Asking questions and answering them and that unfortunately, is something that I can't quantify without knowing something about the group, but I can at least suggest that knowing that there should be some threshold out."
        ],
        [
            "There is useful so you want to crowd things a little bit.",
            "Maybe put all the car owners in one place until they begin to jostle and ask for a separate spaces."
        ],
        [
            "So someone heard an earlier version of this idea and said that's it.",
            "Our groups are too sparse.",
            "We're going to create us some critical mass.",
            "We're going to go out and find the women's exercise group, which isn't really as big as we'd like in the men's exercise group, which isn't really as big as we want and will put him together, that'll be great.",
            "And then they found out that their users were partitioning or petitioning them to please take the groups apart again and leave it turned out that the women's groups that the Women's exercise Group really wanted to be able to talk about prenatal exercise and women specific exercise and exercise issues that the men really didn't care about, and that when prenatal exercise came up in the new unified group, the Ben would make fun of it.",
            "And Conversely, the men really want to talk about use of steroids and use of various additions that they could add to their diet and.",
            "All sorts of cool stuff that would make their muscles ever bulkier and the women were completely uninterested in this."
        ],
        [
            "Forcibly joining these groups didn't really cut it.",
            "The women petitioned by the way, the men simply picked up and went off to a completely different site, run by a different organization, so are less piece of advice has been to exert gentle control.",
            "The analogy would like to use is it is.",
            "It's a party in living room.",
            "You can try changing the music.",
            "You can try encouraging people to go over to someone else is living room and have a party there, but when you do, ask them to go over to someone else is living room.",
            "Some of them will.",
            "You know, nicely, obediently go, and many of them will go off to someone else's party, 'cause it sounds like it's better at the time.",
            "So finding ways to work with your users to help them help you figure out what you want is a more successful."
        ],
        [
            "Technique with think so to step back what we've done is we've looked at the location purposes of these groups.",
            "We talked a little bit about ways to monitor social activity.",
            "We suggested that we provide feedback and we suggested ways to help organize and maintain this space."
        ],
        [
            "Yes.",
            "I'm actually going to wrap up now and open the floor for discussion arguments questions.",
            "I suspect that there's probably a couple strong feelings about something or other he said in there.",
            "Thank you very much.",
            "That was really interesting, thought I just wanted to ask you, could you comment and learn point system versus monetary benefit?",
            "I'm sorry what's that again?",
            "That is just an incentive in the form of points, yes.",
            "That's it, close is something where you actually getting wanted revenge.",
            "We've had some sites experiment with monetary benefits, other not with as much.",
            "It hasn't been clear to me that there's been a clear distinction that monetary benefits actually make a huge positive difference, and God knows points or something that people will fight over 2 great examples.",
            "Slashdot, right?",
            "Slashdot in attempts to outsource the moderation system, first built.",
            "Moderators and then sort of this system of meta moderators in the meta moderators got karma points and if you want and if you meta moderated someone well your Karma score went up.",
            "And all of a sudden there was this great contest to see who could have the most karma points available in their account.",
            "So even points which were literally worth absolutely nothing whatsoever, except perhaps the ability to punish some other moderate or later or some other meter moderator later still.",
            "Became something to compete over.",
            "Kind of 1st.",
            "I think something is sort of important quite out to be coming out of this verse of issues.",
            "There's a lot of things you can do wrong which will absolutely guarantee that you assign work, but there's not many things that we found.",
            "Not really anything.",
            "We found that we can do right now guaranteed to cycle succeed.",
            "Success seems to be something which is continued involvement as any set of rules that you have.",
            "I think that's absolutely true.",
            "I think that's part of why I wanted the most exciting, you know, Web 2.0 properties are coming out of peoples Garages because you know the cost of a garage is very low and low risk, so you can throw together two or three of them.",
            "They fail.",
            "It's OK in contrast at large corporations.",
            "Mine and other peoples, right?",
            "It takes awhile to get the gears spinning and then you suddenly got a big bet on something huge.",
            "I think that's going to be an interesting challenge to resolve.",
            "I think.",
            "I have a question for Daniel, so I think it be interesting to see the difference in the cases when the Community works.",
            "So maybe they say hey, let's get out of this particular online space and go somewhere else.",
            "And it works, but the I mean the people part of the community works, but the infrastructure part of the support for the Community fails versus the case where the converse is true.",
            "Where you know.",
            "Actually, maybe there's something there just isn't community there.",
            "Yeah, and it doesn't really matter what do.",
            "Even if you did have a magic bullet, you still will be able to get in here.",
            "Well, that's interesting.",
            "Yeah, I haven't given any thought.",
            "I'd love to know if anyone else here has experiences with that.",
            "I don't know I said question given your experience.",
            "I mean, it seems like the thing that you showed the two examples you showed about here where one had too much 1 sided, too much radiation involved makes and models of cars and the other ones red versus 2% in both approaches fail and I wonder sometimes it seems like the like you said with all these kind of garage sites that people even their own that is more than someone just got the structure right.",
            "At the outside and that's why they got a lot of people who just kind of fit with the cost function, having to be at that time.",
            "Is it really possible and you know these websites have been able to evolve to actually manifest with really wanted structure, so the sites.",
            "So if I understood that right, the question is.",
            "Are the sites evolving to match what people want of them?",
            "It's certainly possible you know, like a you see in some online communities, right?",
            "The community moderators are out there creating new little sub boards and seeing whether they catch on.",
            "And you know keeping them up if they do and you know guard pruning them away if they don't write the challenge with the challenge with the one where the sites were compressed together was that they were already existing communities.",
            "They weren't as big as the person as the moderator wanted, but they were already there and they developed identities of their own, so mashing them together was challenging.",
            "In contrast, if they had mashed together, say the six cylinder BMW Group with the five cylinder, you end up or 4 cylinder.",
            "BMW Group that.",
            "Since neither of them was very big at the time, or there might not have been enough of a formed identity to actually have a fight over.",
            "Right, and I suspect that at the starting point there's a lot of malleability, right?",
            "Despite the fact they've given you this huge no list.",
            "I think that there's a lot of opportunity on these spaces.",
            "People are pretty malleable, they will kind of adapt to figuring out whether something feels kind of right ish, and they will try and give feedback on hey, this space is well, is working well for me or not.",
            "There's a lot of opportunities, you just have to pay attention and figure out where where the sticking points are.",
            "Hey, Chief of the Research Center.",
            "I could ask another philosophical questions that make sure which is that.",
            "The the the underlying sort of theme of your talk is about sort of issue of social engineering, so absolutely design sort of system, more or less how to encourage participation behavior.",
            "The question I wanted to ask is what's your view on sort of our role in this process?",
            "Whether we are designing systems for emerging behavior such that you try to.",
            "Have your hands in the system as little as possible or is our role really sort of to design reputation systems that had rigid structures such that it really, you know, create the kind of behavior that we wanted.",
            "So.",
            "Yeah, so that's an interesting question.",
            "I think that, as perhaps as a pure scientist, perhaps I would want you know to watch a community spin off on its own and see where it evolves, and you know, watch it without interference.",
            "But certainly as a member of a profit making organization right, I sort of want to balance that against the ability of my stock price to maintain, for example.",
            "Or alternately, have my company to be successful in doing all the various things that it wants to accomplish, so I do want to be able to step back periodically and say, here's what I learned from watching these communities over here.",
            "And here's ways that we can interfere.",
            "I think in any community, right?",
            "Sticking your finger in it's too much will definitely cause problems.",
            "It will feel like it's owned and run by someone else and the users won't feel involved, so.",
            "To some extent, that's a false dichotomy because it's not as it's not as interactive a system as you might.",
            "Social engineering doesn't necessarily have to be heavy handed.",
            "Set make sense.",
            "Is there anything at any discussion or understanding of?",
            "Roles of people in multiple theories.",
            "So excited it seems very overwhelming to be about his kidneys are so many of them in his time.",
            "And what if you are interested in multiple things?",
            "Do anyone talk with anyone?",
            "Are there any guidelines about making it easy to replicate things that you're saying in multiple places?",
            "Or is that taboo?",
            "Or just what heuristics could be seen around replicating in multiple places?",
            "For example, modules tribute?",
            "Interesting, I haven't run into too many cases that the one place where do you sometimes see it is in the support and help forums.",
            "You'll often see someone comes up with an interesting answer to a question and then I'll add a little note at the bottom saying I just covered this on my blog.",
            "And then the converse of that is that blog becomes their permalink back to the group and every additional time that they answer that question, the answer just becomes.",
            "Yeah, go check my blog.",
            "They they often prefer that to a reverse reference just to a previous forum post, because they like to be able to say well, because they like the information centralized under their name rather than someone else is.",
            "I think I guess, yeah, it's part of your question about what functionality currently is not standard being provided by making big difference in has talked about what makes online communities work.",
            "She had a really interesting point about the same lighting YouTube take off this notion of embeddability something that for example flash not flash, like in half, which is right man video in Europe.",
            "So that was an innovation, right?",
            "Social networks take off, so have you gotten anywhere into innovations of ADR?",
            "Not standard survey.",
            "Not in this line of research now.",
            "Thanks.",
            "At least I'm coming, or you're charged.",
            "I guess they attract a lot of different behaviors that encourage user or where users have sort of anticipated or more or less than these different communities, but I'm wondering the extent to which you think you can track this sort of participation based on behaviors or maybe user self report.",
            "Do you think that that information is useful as well, or just something that you're less interested in, maybe?",
            "I'm interested in self report.",
            "It has the dual disadvantage of having all the usual odd little deceptions around self report.",
            "And is harder to collect because they actually have to go out and survey people.",
            "There is something very nice about dealing with about doing this mapping on the electronic realm because I get to sit back in my office, go read a couple 100 forum posts and you know West a couple of emails to people and get almost all of what I could possibly need.",
            "So perhaps I'm just too lazy to do self report surveys, but I'm fully in favor of them.",
            "It's great concept.",
            "Sorry.",
            "Number is."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good afternoon, my name is Danielle Fisher.",
                    "label": 0
                },
                {
                    "sent": "I am here from Microsoft Research.",
                    "label": 1
                },
                {
                    "sent": "I'm presenting this work in conjunction with.",
                    "label": 0
                },
                {
                    "sent": "Well, I'm connecting.",
                    "label": 0
                },
                {
                    "sent": "I'm presenting this work in conjunction with Mark Smith, who heard this morning and Tamera Turner, who unfortunately is in China and can't be presenting today.",
                    "label": 0
                },
                {
                    "sent": "We're all from various bits of Microsoft Research and we've all been interested in online communities for the last few years.",
                    "label": 0
                },
                {
                    "sent": "We've been thinking a lot about how we can interact with people who are running communities and people who run online communities of various sorts of income.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And talking to us.",
                    "label": 0
                },
                {
                    "sent": "So many people in this room are familiar with various online groups, online communities, blog conversations, wikis, and so on.",
                    "label": 0
                },
                {
                    "sent": "All of these are.",
                    "label": 0
                },
                {
                    "sent": "Important things, however, that you run into some issues of both size and scale.",
                    "label": 0
                },
                {
                    "sent": "When you move up to dealing with the corporate context, there's different sorts of questions that we get concerned about.",
                    "label": 0
                },
                {
                    "sent": "There's a larger numbers of situations to talk about, and there is a some economies of scale that need to be thought about.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So Microsoft has a mind boggling number of different online communities that they try and run just some various places where they live.",
                    "label": 0
                },
                {
                    "sent": "Is the MSN forums Windows Live spaces?",
                    "label": 0
                },
                {
                    "sent": "It's a blogging thing.",
                    "label": 0
                },
                {
                    "sent": "The MSDN forums where people talk about technical problems and answers.",
                    "label": 0
                },
                {
                    "sent": "Codeplex has a number of forums.",
                    "label": 0
                },
                {
                    "sent": "MSDN has a internal wiki, know Channel Nine runs a wiki and some forums and some other stuff.",
                    "label": 0
                },
                {
                    "sent": "Not to mention newsgroups.",
                    "label": 0
                },
                {
                    "sent": "Third party branded sites, sites that are not completely.",
                    "label": 0
                },
                {
                    "sent": "Label this Microsoft, but that we contribute help and effort to, and so on at some point or another, huge number of these different groups have passed through a door talking about online communities, and so we wanted to sort of share some of the challenges that they've run into.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And talk about ways that we've gotten around it.",
                    "label": 0
                },
                {
                    "sent": "What I'm going to do then, is talk about sort of eight high points broken into four categories for each of these, I'm going to give you a rough quote.",
                    "label": 0
                },
                {
                    "sent": "Something like the situation that we ran into and talk a little bit about what happened, and then I'll sort of give you the didactic lesson of some of the issues that we think might help resolve that.",
                    "label": 0
                },
                {
                    "sent": "So we're going to break this into four categories.",
                    "label": 0
                },
                {
                    "sent": "Things about the communities, location and purpose.",
                    "label": 1
                },
                {
                    "sent": "We're going to talk about monitoring social activity.",
                    "label": 0
                },
                {
                    "sent": "About providing feedback to users and ways that you can otherwise organize and.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maintain this pace.",
                    "label": 0
                },
                {
                    "sent": "Now, as Mark pointed out this morning, there's a lot of literature in this space already creases both.",
                    "label": 0
                },
                {
                    "sent": "How is X book and?",
                    "label": 0
                },
                {
                    "sent": "Why my butt and Amy Jo Kim?",
                    "label": 0
                },
                {
                    "sent": "All these are fabulous texts that are important reading and then when we go visit the teams that were coming to us with these issues, they often have 1, two or all three of these books on their shelves, which suggests that even if these issues are well underscored in the literature, there worth bringing out and sort of highlighting how they.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Might feel different here.",
                    "label": 0
                },
                {
                    "sent": "So let's start off Designer comes to us and complains that the online community that she created hasn't done anything yet.",
                    "label": 0
                },
                {
                    "sent": "It was going to be for the a list of people who were in her particular area and they were going to get all those people in one place and great stuff would happen.",
                    "label": 1
                },
                {
                    "sent": "It had been six months and nothing had happened at all.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Had shown up this was in part because the great stuff must happen.",
                    "label": 0
                },
                {
                    "sent": "Doesn't quite do it.",
                    "label": 0
                },
                {
                    "sent": "You have to have a purpose for communities and in general this communities at Microsoft that have had some sort of fairly specific purpose have been more successful.",
                    "label": 0
                },
                {
                    "sent": "This is an airport.",
                    "label": 0
                },
                {
                    "sent": "Airports feel like airports and look like airports inside.",
                    "label": 0
                },
                {
                    "sent": "They've got all the airport features and they're great for doing air porting in.",
                    "label": 0
                },
                {
                    "sent": "You could not build a space that was simultaneously question airport.",
                    "label": 0
                },
                {
                    "sent": "It would just throw things off one or the other one.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Be very good at it.",
                    "label": 0
                },
                {
                    "sent": "Let's move on.",
                    "label": 0
                },
                {
                    "sent": "Person came up to us and said, well, we're trying to figure out a place where people who are administering with the Microsoft Management Console can talk to each other.",
                    "label": 0
                },
                {
                    "sent": "It's very important 'cause there's a lot of tricky bits and they want to be able to help each other, they said.",
                    "label": 0
                },
                {
                    "sent": "OK, what do you do now?",
                    "label": 1
                },
                {
                    "sent": "And they said, well, they tend to use the installation console message boards.",
                    "label": 1
                },
                {
                    "sent": "Oh, OK, so how about you put it in the installation console space?",
                    "label": 0
                },
                {
                    "sent": "Well, installation console turns out to be run by developer division while management console is run by Windows Division and these are very different organizations.",
                    "label": 0
                },
                {
                    "sent": "There are different parts of the come.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They couldn't possibly work together.",
                    "label": 0
                },
                {
                    "sent": "Of course, that's an external.",
                    "label": 0
                },
                {
                    "sent": "That's an internal distinction.",
                    "label": 0
                },
                {
                    "sent": "People at Microsoft very deeply care about our organizational differences.",
                    "label": 0
                },
                {
                    "sent": "People outside the company really don't care, so the second piece of advice that we've been giving as often as possible was to build on the existing community and brand outside.",
                    "label": 1
                },
                {
                    "sent": "It's all just Microsoft or whatever your favorite organization is.",
                    "label": 0
                },
                {
                    "sent": "And if you can possibly find a way to erase those internal divisions, and you know instead of the world with happy little blue balls all painted in the same colors, things will be much.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "More coherent.",
                    "label": 0
                },
                {
                    "sent": "Mark alluded earlier to talk to issues about community return on investment about groups having a successful reach and impact.",
                    "label": 1
                },
                {
                    "sent": "And the question of course is, will our community survive?",
                    "label": 0
                },
                {
                    "sent": "So people want to know whether it's worth the energy to put this in.",
                    "label": 0
                },
                {
                    "sent": "We have spent a fair bit of time digging through literature trying to find return on investment on community.",
                    "label": 0
                },
                {
                    "sent": "There's been one or two Forrester reports on it.",
                    "label": 0
                },
                {
                    "sent": "There's been a couple of things in academia, but I don't think anyone has successfully yet figured out whether it's worth the dollars to run an online community or not.",
                    "label": 0
                },
                {
                    "sent": "We've been able to do some handwaving about this, we for example being able to talk with groups and to estimate how much they expect the answers that show up on a forum cost them to provide as opposed to the answers that they'd have to provide through a help desk or an answer through a phone call or an answer through a personal email.",
                    "label": 0
                },
                {
                    "sent": "And it turns out, of course, that putting up an answer on the web is a much, much better thing than having it.",
                    "label": 0
                },
                {
                    "sent": "Then giving it in person.",
                    "label": 0
                },
                {
                    "sent": "Because then it's archived.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It's collected and can be kept, but in general we wanted to encourage groups to have some sense of what their space is doing.",
                    "label": 1
                },
                {
                    "sent": "Once they knew something about what the community is, how the community is interacting.",
                    "label": 0
                },
                {
                    "sent": "They'd be able to make much more informed statements about return on investment, so you may not be able to have an underground.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "NORAD radar installation, for example, but you can have some visualizations like Mark was showing this morning.",
                    "label": 0
                },
                {
                    "sent": "So to go back to one of the images we were talking about the scatter plot on the X axis is the number of posts in any thread in the News Group on the Y axis is the number of days that given user has been active on the newsgroup.",
                    "label": 0
                },
                {
                    "sent": "Each bubble represents a single user, so the users towards the top on the left side, or people who have been on the News Group a whole lot have interact.",
                    "label": 0
                },
                {
                    "sent": "And have since there on the left side they've had very short threads, very short conversations, people further down, have had fewer interactions on the group, and many of those have had noticeably longer conversations.",
                    "label": 0
                },
                {
                    "sent": "This is the pattern that mark referred to, and that we refer to as the question and answer pattern.",
                    "label": 0
                },
                {
                    "sent": "So up there are answer people.",
                    "label": 0
                },
                {
                    "sent": "They show up.",
                    "label": 0
                },
                {
                    "sent": "They answer a question they leave, they show up the answer question.",
                    "label": 0
                },
                {
                    "sent": "If they do this a whole lot of times, that's 300 days per year.",
                    "label": 0
                },
                {
                    "sent": "At those bubbles on the top on the bottom is everyone else.",
                    "label": 0
                },
                {
                    "sent": "There's sort of floating around in the.",
                    "label": 0
                },
                {
                    "sent": "Space of showing up under 100 times a year so they have a couple of questions they show up.",
                    "label": 0
                },
                {
                    "sent": "They ask something they go away.",
                    "label": 0
                },
                {
                    "sent": "Vast majority of the group is not bottom section.",
                    "label": 0
                },
                {
                    "sent": "The top bit has a fewer peep.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So now that we know how to interpret this, let's look at a couple other groups Microsoft Dot public dot access discussing the access database system looks pretty similar.",
                    "label": 0
                },
                {
                    "sent": "Microsoft Public Windows Server general also has this cluster of answer people.",
                    "label": 0
                },
                {
                    "sent": "They show up a little less often Microsoft Dot public dot MSN Messenger has one very hardworking answer person who is there every day of the year, apparently.",
                    "label": 0
                },
                {
                    "sent": "The Windows 98 general discussion is a little bit different.",
                    "label": 0
                },
                {
                    "sent": "The people who are most active seem to have wandered a little bit over to the right, and that's because even though this is nominally a question answer space, we're also seeing discussion right.",
                    "label": 0
                },
                {
                    "sent": "It's someone comes in and says this is it's no longer just.",
                    "label": 0
                },
                {
                    "sent": "How do I solve this problem, but.",
                    "label": 0
                },
                {
                    "sent": "Why is Microsoft foisting off this piece of crap on us and has to be responded to and discussed and argued out in all its various permutations and combinations?",
                    "label": 0
                },
                {
                    "sent": "Those of you who are teachers then will recognize this pattern over here where the most active people are way over to the right.",
                    "label": 0
                },
                {
                    "sent": "That's a group to discuss the MCSE certification exam.",
                    "label": 0
                },
                {
                    "sent": "And as you know, every time that someone asks a question quest, it gets followed up by yes, but will be out in the test and the review.",
                    "label": 0
                },
                {
                    "sent": "It didn't really look that way, and so the most active people are getting into these longer and longer conversations.",
                    "label": 0
                },
                {
                    "sent": "Talks to.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That further, let's move outside of the question and answer space on the left is the Polish computer operating system advocacy group.",
                    "label": 0
                },
                {
                    "sent": "Where if you want to argue about whether Windows is a better or worse operating system, the Macintosh in Polish, that's the place to go.",
                    "label": 0
                },
                {
                    "sent": "The most active people are very far to the right.",
                    "label": 0
                },
                {
                    "sent": "That's a group that's pretty much consumed with arguments and flame wars, so the people up there are really fighting it out hard.",
                    "label": 0
                },
                {
                    "sent": "In the Microsoft Flightsim Group, no one's been on more than 50 days of the year.",
                    "label": 0
                },
                {
                    "sent": "They obviously have other things to do with their time.",
                    "label": 0
                },
                {
                    "sent": "And in the binary sounds MP3 complete CD, no ones going anywhere off to the right.",
                    "label": 0
                },
                {
                    "sent": "That's because they're all using automated posting software that simply rips their CDs.",
                    "label": 0
                },
                {
                    "sent": "You encodes them and post them into the group in individual messages.",
                    "label": 0
                },
                {
                    "sent": "No threads, no conversation, simply simply.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Binaries CD's.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So actually, just to go back.",
                    "label": 0
                },
                {
                    "sent": "So while we'd suggest you know, while we've come up with these visualizations and the one that Mark showed earlier this morning.",
                    "label": 0
                },
                {
                    "sent": "We're not necessarily saying that these are the specific answer to your communities.",
                    "label": 0
                },
                {
                    "sent": "Questions were instead saying is that being able to look at the data through some of the techniques that have come up in this conference and in other contexts knowing something about the metadata, knowing something about who's in there and what they're playing with begins to give you tools for understanding the.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Success of your community.",
                    "label": 0
                },
                {
                    "sent": "In a related question, people would say hey, look, we've got thousands of people looking at our pages.",
                    "label": 0
                },
                {
                    "sent": "They come in, they dig around.",
                    "label": 0
                },
                {
                    "sent": "They seem to find answers, but we've only got a few dozen people who are posting everyday.",
                    "label": 1
                },
                {
                    "sent": "So they've actually started looking at the metadata of their group and they are bothered by it.",
                    "label": 0
                },
                {
                    "sent": "What could they possibly do about these free riders who aren't contributing?",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I tend to shrug.",
                    "label": 0
                },
                {
                    "sent": "It's perfectly OK to have free riders.",
                    "label": 0
                },
                {
                    "sent": "That's why we post on public websites.",
                    "label": 0
                },
                {
                    "sent": "Free riders tend to come in the form of leaders, and leaders are fine and exceptional things.",
                    "label": 0
                },
                {
                    "sent": "Here's one of them, but you've seen some in that last slide with the person sort of floating at the top.",
                    "label": 0
                },
                {
                    "sent": "The answer people and these are great to cultivate.",
                    "label": 0
                },
                {
                    "sent": "Their really important to have, but lurkers are also turned out to be surprisingly valuable.",
                    "label": 0
                },
                {
                    "sent": "The lurkers who are not contributing as Jenny Preece and Blair Nanaki have contributed successfully shown are still out there.",
                    "label": 0
                },
                {
                    "sent": "They're sending email to their friends with links to the page there, waiting and bidding their time until they have the right question to ask at which they'll contribute.",
                    "label": 0
                },
                {
                    "sent": "Maybe there is storing up information or their active in some other form and they're not in this one, so it's completely fine to have that 8020 ratio or even.",
                    "label": 0
                },
                {
                    "sent": "As I was suggesting this morning, the 99 one ratio that seems to.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Cat OK for a lot of these groups.",
                    "label": 0
                },
                {
                    "sent": "Of course, if some social psychology experiments in the last few years, Paul Resnik has shown that if you do have those leaders go out and welcome people who have shown up in the group and give them positive feedback for having participated, they're more likely in turn to turn into group leaders and regulars.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's go back in steps.",
                    "label": 0
                },
                {
                    "sent": "Groups are looking for ways to reward interaction and find ways to help users know that.",
                    "label": 0
                },
                {
                    "sent": "They've been successful, so in one group they put up a top 10 list of contributors.",
                    "label": 1
                },
                {
                    "sent": "The more people added, the better they ranked people you know would be right at the top for having added a whole lot of entries to this list.",
                    "label": 0
                },
                {
                    "sent": "So we asked them, well so has the top 10 list.",
                    "label": 0
                },
                {
                    "sent": "Well is kind of mixed.",
                    "label": 0
                },
                {
                    "sent": "It got a lot of people who are adding lots of.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Junk because of course we were rewarding on being on the top of the list if getting if given if posting lots of posts put you at the top of the list and people will by God post lots of posts.",
                    "label": 0
                },
                {
                    "sent": "They want to post lots of good post about some high quality poster.",
                    "label": 0
                },
                {
                    "sent": "Lots of interesting posts, but man they will post lots of posts and anyone who's ever seen a pinball machine before knows exactly the temptation of being on the top ten of the top 10 list.",
                    "label": 0
                },
                {
                    "sent": "We've seen this in all sorts of different contests, contexts.",
                    "label": 0
                },
                {
                    "sent": "In fact, sites like Digg can be argued to be a perpetual game of trying to get yourself to the top 10 list before someone else gets themselves to the top 10 list.",
                    "label": 0
                },
                {
                    "sent": "Which can be a fine thing if you're trying to encourage, for example on dig any old link you posses.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can get.",
                    "label": 0
                },
                {
                    "sent": "But there's other contexts in which you can imagine.",
                    "label": 0
                },
                {
                    "sent": "I'm not putting up this image because they encourage that you write your users a check, but rather that Don nuthin his famous checks for finding new bugs in his books has found a fascinating way to encourage people to read his books as carefully as possible.",
                    "label": 0
                },
                {
                    "sent": "People read his books in mind boggling amounts of details, scrubbing over character by character, trying to understand every word that he's got written by rewarding every novel bug that he found.",
                    "label": 0
                },
                {
                    "sent": "This is a rare four bugcheck.",
                    "label": 0
                },
                {
                    "sent": "Not many people get four bugcheck.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Other ways to do this of course, can involve reflecting information to individual reflecting behavior to individual users rather than to users collectively.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So for example, Mark had talked a little bit about the NET scan system that we had a running netscan, among other things, provided us individual portal of a single users participation.",
                    "label": 0
                },
                {
                    "sent": "So you could go in and look at the single users.",
                    "label": 0
                },
                {
                    "sent": "At you can look at a single users or someone else's profile, or look at your own profile.",
                    "label": 0
                },
                {
                    "sent": "Your own profile actually had a little more detail of the last things you had posted.",
                    "label": 0
                },
                {
                    "sent": "How often you posted where you posted, how much you posted, so you both had the ability to sort of copy off a piece of this, show it off to other people.",
                    "label": 0
                },
                {
                    "sent": "Hey, check out, here's my participation, but without ever being directly compared, so there was no context where you'd say, hey look, I'm better than you because better than you would in fact encourage someone else is saying no, no, I'm better.",
                    "label": 0
                },
                {
                    "sent": "And then you get back into the top 10 list again.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, so we're trying to do quality control and we're not really allowed to do a top 10 list.",
                    "label": 0
                },
                {
                    "sent": "At least we can do negative reputation, right?",
                    "label": 0
                },
                {
                    "sent": "For each post that someone places will let everyone else rate it and negative posts, you know, get give you a negative reputation.",
                    "label": 1
                },
                {
                    "sent": "And people have a negative reputation.",
                    "label": 0
                },
                {
                    "sent": "Get slammed down into the ground and kicked out of the site, and man then will only have good people on our site which.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Works just fine.",
                    "label": 0
                },
                {
                    "sent": "Because after all, it costs a lot of money to get into account and people value those new accounts right?",
                    "label": 0
                },
                {
                    "sent": "Because oh wait on eBay, at least registration is free and so is Craigslist, and so is Wikipedia and so is almost everything else in fact, which means that assigning negative reputation.",
                    "label": 0
                },
                {
                    "sent": "Means that the person who was determined to cause trouble will simply leave and go cause trouble again.",
                    "label": 0
                },
                {
                    "sent": "Paul Resnik, again, actually has done research on the value of eBay reputation, and he was essentially able to show that people were willing to misbehave to the level of the value of the reputation that they already accumulated.",
                    "label": 0
                },
                {
                    "sent": "That is to say.",
                    "label": 0
                },
                {
                    "sent": "If you've been spending a whole lot of time on eBay, you've got this great reputation and you've bought a whole lot of stuff at really good transactions, and you're completely unwilling to allow some bad interaction to Sully this, you know, unless it's really worth a whole lot of money.",
                    "label": 0
                },
                {
                    "sent": "Conversely, if your brand new on eBay, it doesn't matter if you misbehave, because after all, what can you do?",
                    "label": 0
                },
                {
                    "sent": "You can go register for new account.",
                    "label": 1
                },
                {
                    "sent": "In contrast, people who are sincere, really wanting to help out, but now they've gotten their name smudged because they misbehaved and got a negative reputation are also discouraged from interacting because now they're afraid that they're going to walk around stigmatized.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So I'm in.",
                    "label": 0
                },
                {
                    "sent": "I'm strongly in favor of positive reputation systems if you can make people who are doing well know that they're doing well, and people who are doing better than that know that they're doing even better than that, then you've got a great system for encouraging people to move upwards.",
                    "label": 0
                },
                {
                    "sent": "But negative reputation hasn't, at least in our experience, been as clearly successful.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We spoke with another team that was very excited about making sure that users had a very specific place right.",
                    "label": 0
                },
                {
                    "sent": "There could be no spam if you've got only people who are talking about this particular topic in this particular place.",
                    "label": 0
                },
                {
                    "sent": "So for each make and model of car, they put up a special message board doesn't cost much to add the new add new message board button and they had hundreds of them.",
                    "label": 1
                },
                {
                    "sent": "Of course, no one ever showed up.",
                    "label": 1
                },
                {
                    "sent": "You would go to the cars site and there would just be hundreds and hundreds of message boards and you click in on each and everyone of them and they all like.",
                    "label": 0
                },
                {
                    "sent": "Have you know 123 messages on it.",
                    "label": 0
                },
                {
                    "sent": "Things like this?",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's because critical mass is kind of important.",
                    "label": 0
                },
                {
                    "sent": "This subway car is a dark and scary place, or at least a quiet one because no ones there you really want.",
                    "label": 0
                },
                {
                    "sent": "Maybe it's not crowded then at least enough activity that things continue.",
                    "label": 0
                },
                {
                    "sent": "Now what this critical mass means can be different between different groups in different places.",
                    "label": 0
                },
                {
                    "sent": "Some some online forms of critical mass might be a simple five or six people chatting.",
                    "label": 0
                },
                {
                    "sent": "As Mark pointed out well at other forums it might take a couple hundreds to keep a sufficient quantity of people.",
                    "label": 0
                },
                {
                    "sent": "Asking questions and answering them and that unfortunately, is something that I can't quantify without knowing something about the group, but I can at least suggest that knowing that there should be some threshold out.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There is useful so you want to crowd things a little bit.",
                    "label": 0
                },
                {
                    "sent": "Maybe put all the car owners in one place until they begin to jostle and ask for a separate spaces.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So someone heard an earlier version of this idea and said that's it.",
                    "label": 0
                },
                {
                    "sent": "Our groups are too sparse.",
                    "label": 0
                },
                {
                    "sent": "We're going to create us some critical mass.",
                    "label": 1
                },
                {
                    "sent": "We're going to go out and find the women's exercise group, which isn't really as big as we'd like in the men's exercise group, which isn't really as big as we want and will put him together, that'll be great.",
                    "label": 0
                },
                {
                    "sent": "And then they found out that their users were partitioning or petitioning them to please take the groups apart again and leave it turned out that the women's groups that the Women's exercise Group really wanted to be able to talk about prenatal exercise and women specific exercise and exercise issues that the men really didn't care about, and that when prenatal exercise came up in the new unified group, the Ben would make fun of it.",
                    "label": 0
                },
                {
                    "sent": "And Conversely, the men really want to talk about use of steroids and use of various additions that they could add to their diet and.",
                    "label": 0
                },
                {
                    "sent": "All sorts of cool stuff that would make their muscles ever bulkier and the women were completely uninterested in this.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Forcibly joining these groups didn't really cut it.",
                    "label": 0
                },
                {
                    "sent": "The women petitioned by the way, the men simply picked up and went off to a completely different site, run by a different organization, so are less piece of advice has been to exert gentle control.",
                    "label": 0
                },
                {
                    "sent": "The analogy would like to use is it is.",
                    "label": 0
                },
                {
                    "sent": "It's a party in living room.",
                    "label": 0
                },
                {
                    "sent": "You can try changing the music.",
                    "label": 0
                },
                {
                    "sent": "You can try encouraging people to go over to someone else is living room and have a party there, but when you do, ask them to go over to someone else is living room.",
                    "label": 0
                },
                {
                    "sent": "Some of them will.",
                    "label": 0
                },
                {
                    "sent": "You know, nicely, obediently go, and many of them will go off to someone else's party, 'cause it sounds like it's better at the time.",
                    "label": 0
                },
                {
                    "sent": "So finding ways to work with your users to help them help you figure out what you want is a more successful.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Technique with think so to step back what we've done is we've looked at the location purposes of these groups.",
                    "label": 0
                },
                {
                    "sent": "We talked a little bit about ways to monitor social activity.",
                    "label": 1
                },
                {
                    "sent": "We suggested that we provide feedback and we suggested ways to help organize and maintain this space.",
                    "label": 1
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "I'm actually going to wrap up now and open the floor for discussion arguments questions.",
                    "label": 0
                },
                {
                    "sent": "I suspect that there's probably a couple strong feelings about something or other he said in there.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "That was really interesting, thought I just wanted to ask you, could you comment and learn point system versus monetary benefit?",
                    "label": 0
                },
                {
                    "sent": "I'm sorry what's that again?",
                    "label": 0
                },
                {
                    "sent": "That is just an incentive in the form of points, yes.",
                    "label": 0
                },
                {
                    "sent": "That's it, close is something where you actually getting wanted revenge.",
                    "label": 0
                },
                {
                    "sent": "We've had some sites experiment with monetary benefits, other not with as much.",
                    "label": 0
                },
                {
                    "sent": "It hasn't been clear to me that there's been a clear distinction that monetary benefits actually make a huge positive difference, and God knows points or something that people will fight over 2 great examples.",
                    "label": 0
                },
                {
                    "sent": "Slashdot, right?",
                    "label": 0
                },
                {
                    "sent": "Slashdot in attempts to outsource the moderation system, first built.",
                    "label": 0
                },
                {
                    "sent": "Moderators and then sort of this system of meta moderators in the meta moderators got karma points and if you want and if you meta moderated someone well your Karma score went up.",
                    "label": 0
                },
                {
                    "sent": "And all of a sudden there was this great contest to see who could have the most karma points available in their account.",
                    "label": 0
                },
                {
                    "sent": "So even points which were literally worth absolutely nothing whatsoever, except perhaps the ability to punish some other moderate or later or some other meter moderator later still.",
                    "label": 0
                },
                {
                    "sent": "Became something to compete over.",
                    "label": 0
                },
                {
                    "sent": "Kind of 1st.",
                    "label": 0
                },
                {
                    "sent": "I think something is sort of important quite out to be coming out of this verse of issues.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of things you can do wrong which will absolutely guarantee that you assign work, but there's not many things that we found.",
                    "label": 0
                },
                {
                    "sent": "Not really anything.",
                    "label": 0
                },
                {
                    "sent": "We found that we can do right now guaranteed to cycle succeed.",
                    "label": 0
                },
                {
                    "sent": "Success seems to be something which is continued involvement as any set of rules that you have.",
                    "label": 0
                },
                {
                    "sent": "I think that's absolutely true.",
                    "label": 0
                },
                {
                    "sent": "I think that's part of why I wanted the most exciting, you know, Web 2.0 properties are coming out of peoples Garages because you know the cost of a garage is very low and low risk, so you can throw together two or three of them.",
                    "label": 0
                },
                {
                    "sent": "They fail.",
                    "label": 0
                },
                {
                    "sent": "It's OK in contrast at large corporations.",
                    "label": 0
                },
                {
                    "sent": "Mine and other peoples, right?",
                    "label": 0
                },
                {
                    "sent": "It takes awhile to get the gears spinning and then you suddenly got a big bet on something huge.",
                    "label": 0
                },
                {
                    "sent": "I think that's going to be an interesting challenge to resolve.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "I have a question for Daniel, so I think it be interesting to see the difference in the cases when the Community works.",
                    "label": 0
                },
                {
                    "sent": "So maybe they say hey, let's get out of this particular online space and go somewhere else.",
                    "label": 0
                },
                {
                    "sent": "And it works, but the I mean the people part of the community works, but the infrastructure part of the support for the Community fails versus the case where the converse is true.",
                    "label": 0
                },
                {
                    "sent": "Where you know.",
                    "label": 0
                },
                {
                    "sent": "Actually, maybe there's something there just isn't community there.",
                    "label": 0
                },
                {
                    "sent": "Yeah, and it doesn't really matter what do.",
                    "label": 0
                },
                {
                    "sent": "Even if you did have a magic bullet, you still will be able to get in here.",
                    "label": 0
                },
                {
                    "sent": "Well, that's interesting.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I haven't given any thought.",
                    "label": 0
                },
                {
                    "sent": "I'd love to know if anyone else here has experiences with that.",
                    "label": 0
                },
                {
                    "sent": "I don't know I said question given your experience.",
                    "label": 0
                },
                {
                    "sent": "I mean, it seems like the thing that you showed the two examples you showed about here where one had too much 1 sided, too much radiation involved makes and models of cars and the other ones red versus 2% in both approaches fail and I wonder sometimes it seems like the like you said with all these kind of garage sites that people even their own that is more than someone just got the structure right.",
                    "label": 0
                },
                {
                    "sent": "At the outside and that's why they got a lot of people who just kind of fit with the cost function, having to be at that time.",
                    "label": 0
                },
                {
                    "sent": "Is it really possible and you know these websites have been able to evolve to actually manifest with really wanted structure, so the sites.",
                    "label": 0
                },
                {
                    "sent": "So if I understood that right, the question is.",
                    "label": 0
                },
                {
                    "sent": "Are the sites evolving to match what people want of them?",
                    "label": 0
                },
                {
                    "sent": "It's certainly possible you know, like a you see in some online communities, right?",
                    "label": 0
                },
                {
                    "sent": "The community moderators are out there creating new little sub boards and seeing whether they catch on.",
                    "label": 0
                },
                {
                    "sent": "And you know keeping them up if they do and you know guard pruning them away if they don't write the challenge with the challenge with the one where the sites were compressed together was that they were already existing communities.",
                    "label": 0
                },
                {
                    "sent": "They weren't as big as the person as the moderator wanted, but they were already there and they developed identities of their own, so mashing them together was challenging.",
                    "label": 0
                },
                {
                    "sent": "In contrast, if they had mashed together, say the six cylinder BMW Group with the five cylinder, you end up or 4 cylinder.",
                    "label": 0
                },
                {
                    "sent": "BMW Group that.",
                    "label": 0
                },
                {
                    "sent": "Since neither of them was very big at the time, or there might not have been enough of a formed identity to actually have a fight over.",
                    "label": 0
                },
                {
                    "sent": "Right, and I suspect that at the starting point there's a lot of malleability, right?",
                    "label": 0
                },
                {
                    "sent": "Despite the fact they've given you this huge no list.",
                    "label": 0
                },
                {
                    "sent": "I think that there's a lot of opportunity on these spaces.",
                    "label": 0
                },
                {
                    "sent": "People are pretty malleable, they will kind of adapt to figuring out whether something feels kind of right ish, and they will try and give feedback on hey, this space is well, is working well for me or not.",
                    "label": 0
                },
                {
                    "sent": "There's a lot of opportunities, you just have to pay attention and figure out where where the sticking points are.",
                    "label": 0
                },
                {
                    "sent": "Hey, Chief of the Research Center.",
                    "label": 0
                },
                {
                    "sent": "I could ask another philosophical questions that make sure which is that.",
                    "label": 0
                },
                {
                    "sent": "The the the underlying sort of theme of your talk is about sort of issue of social engineering, so absolutely design sort of system, more or less how to encourage participation behavior.",
                    "label": 0
                },
                {
                    "sent": "The question I wanted to ask is what's your view on sort of our role in this process?",
                    "label": 0
                },
                {
                    "sent": "Whether we are designing systems for emerging behavior such that you try to.",
                    "label": 0
                },
                {
                    "sent": "Have your hands in the system as little as possible or is our role really sort of to design reputation systems that had rigid structures such that it really, you know, create the kind of behavior that we wanted.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so that's an interesting question.",
                    "label": 0
                },
                {
                    "sent": "I think that, as perhaps as a pure scientist, perhaps I would want you know to watch a community spin off on its own and see where it evolves, and you know, watch it without interference.",
                    "label": 0
                },
                {
                    "sent": "But certainly as a member of a profit making organization right, I sort of want to balance that against the ability of my stock price to maintain, for example.",
                    "label": 0
                },
                {
                    "sent": "Or alternately, have my company to be successful in doing all the various things that it wants to accomplish, so I do want to be able to step back periodically and say, here's what I learned from watching these communities over here.",
                    "label": 0
                },
                {
                    "sent": "And here's ways that we can interfere.",
                    "label": 0
                },
                {
                    "sent": "I think in any community, right?",
                    "label": 0
                },
                {
                    "sent": "Sticking your finger in it's too much will definitely cause problems.",
                    "label": 0
                },
                {
                    "sent": "It will feel like it's owned and run by someone else and the users won't feel involved, so.",
                    "label": 0
                },
                {
                    "sent": "To some extent, that's a false dichotomy because it's not as it's not as interactive a system as you might.",
                    "label": 0
                },
                {
                    "sent": "Social engineering doesn't necessarily have to be heavy handed.",
                    "label": 0
                },
                {
                    "sent": "Set make sense.",
                    "label": 0
                },
                {
                    "sent": "Is there anything at any discussion or understanding of?",
                    "label": 0
                },
                {
                    "sent": "Roles of people in multiple theories.",
                    "label": 0
                },
                {
                    "sent": "So excited it seems very overwhelming to be about his kidneys are so many of them in his time.",
                    "label": 0
                },
                {
                    "sent": "And what if you are interested in multiple things?",
                    "label": 0
                },
                {
                    "sent": "Do anyone talk with anyone?",
                    "label": 0
                },
                {
                    "sent": "Are there any guidelines about making it easy to replicate things that you're saying in multiple places?",
                    "label": 0
                },
                {
                    "sent": "Or is that taboo?",
                    "label": 0
                },
                {
                    "sent": "Or just what heuristics could be seen around replicating in multiple places?",
                    "label": 0
                },
                {
                    "sent": "For example, modules tribute?",
                    "label": 0
                },
                {
                    "sent": "Interesting, I haven't run into too many cases that the one place where do you sometimes see it is in the support and help forums.",
                    "label": 0
                },
                {
                    "sent": "You'll often see someone comes up with an interesting answer to a question and then I'll add a little note at the bottom saying I just covered this on my blog.",
                    "label": 0
                },
                {
                    "sent": "And then the converse of that is that blog becomes their permalink back to the group and every additional time that they answer that question, the answer just becomes.",
                    "label": 0
                },
                {
                    "sent": "Yeah, go check my blog.",
                    "label": 0
                },
                {
                    "sent": "They they often prefer that to a reverse reference just to a previous forum post, because they like to be able to say well, because they like the information centralized under their name rather than someone else is.",
                    "label": 0
                },
                {
                    "sent": "I think I guess, yeah, it's part of your question about what functionality currently is not standard being provided by making big difference in has talked about what makes online communities work.",
                    "label": 0
                },
                {
                    "sent": "She had a really interesting point about the same lighting YouTube take off this notion of embeddability something that for example flash not flash, like in half, which is right man video in Europe.",
                    "label": 0
                },
                {
                    "sent": "So that was an innovation, right?",
                    "label": 0
                },
                {
                    "sent": "Social networks take off, so have you gotten anywhere into innovations of ADR?",
                    "label": 0
                },
                {
                    "sent": "Not standard survey.",
                    "label": 0
                },
                {
                    "sent": "Not in this line of research now.",
                    "label": 0
                },
                {
                    "sent": "Thanks.",
                    "label": 0
                },
                {
                    "sent": "At least I'm coming, or you're charged.",
                    "label": 0
                },
                {
                    "sent": "I guess they attract a lot of different behaviors that encourage user or where users have sort of anticipated or more or less than these different communities, but I'm wondering the extent to which you think you can track this sort of participation based on behaviors or maybe user self report.",
                    "label": 0
                },
                {
                    "sent": "Do you think that that information is useful as well, or just something that you're less interested in, maybe?",
                    "label": 0
                },
                {
                    "sent": "I'm interested in self report.",
                    "label": 0
                },
                {
                    "sent": "It has the dual disadvantage of having all the usual odd little deceptions around self report.",
                    "label": 0
                },
                {
                    "sent": "And is harder to collect because they actually have to go out and survey people.",
                    "label": 0
                },
                {
                    "sent": "There is something very nice about dealing with about doing this mapping on the electronic realm because I get to sit back in my office, go read a couple 100 forum posts and you know West a couple of emails to people and get almost all of what I could possibly need.",
                    "label": 0
                },
                {
                    "sent": "So perhaps I'm just too lazy to do self report surveys, but I'm fully in favor of them.",
                    "label": 0
                },
                {
                    "sent": "It's great concept.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Number is.",
                    "label": 0
                }
            ]
        }
    }
}