{
    "id": "v3fyr2qvhwpkhsxrags7uat3ggyf2plh",
    "title": "The New Iris Data: Modular Data Generators",
    "info": {
        "author": [
            "Iris Adä, Department of Computer and Information Science, University of Konstanz"
        ],
        "published": "Oct. 1, 2010",
        "recorded": "July 2010",
        "category": [
            "Top->Computer Science->Databases"
        ]
    },
    "url": "http://videolectures.net/kdd2010_adae_nidmdg/",
    "segmentation": [
        [
            "Working they are.",
            "Wallpaper about computers.",
            "Most likely?",
            "So just."
        ],
        [
            "Great to hear afterwards.",
            "Explain the idea generation and go over to an outlook."
        ],
        [
            "Whitelist me generate data.",
            "I mean we generate data for multiple reasons.",
            "There is the reason certain data or teaching students we want to challenge students with some days now with just having difficulty switching apples.",
            "Mine and of course we also need aspecial day parental testing our little messages or also for demonstrating for their own messes aversion.",
            "So understand that feeling statement generation till now.",
            "Rosa"
        ],
        [
            "The tools which are currently generating data mainly made for walking per person, so they're made for generating investors, or they're made for generating station unit size unknown.",
            "IBM press tools are most used.",
            "Data generators are only made for another 8 in your own address.",
            "The problem is more like the Xbox at generation.",
            "You can extend generation process if you can modify the samples.",
            "We use it, but I will repeat so our ideas to resolve."
        ],
        [
            "Red box using modern day pass.",
            "Each piece itself there's only created and small amount of data, but by violence and who can cheap abroad range of data to achieve differences?",
            "He's gonna have questions because cruise cancellation rules applying frequent itemsets Antillon and I would like to explain this morning sounds I showed here and what I'm doing here is activating in modern database is only done step so that wasn't able actually.",
            "Measure.",
            "Then I add some Harry Potter Instagram I as Jesus in The Beatles solution.",
            "I can't even rise.",
            "Hey, this is Mary dinner afterwards ISO shoe size through space with the heat rounds.",
            "She says installation sizes and edit as an agency based care powder enamel shop Mason agencies and broke again.",
            "Just already brought.",
            "They said table there you can see different keys you.",
            "I could visualize heading into shoe size, so overall."
        ],
        [
            "And the idea is used with the data generation process into small understandable models, and each of these modern weekend modified you can modify it in health.",
            "No, you can't answer to an expansion packages that you can visit all that by using generalization of your data generation process.",
            "Audit is implemented in Linux based that for now is open.",
            "Be satisfied."
        ],
        [
            "After I would like to get to a more detailed examples of how use this model update information garage, since I'm done examples, I'm going create 3 dimensional classes state of generation."
        ],
        [
            "So it's taking me crystal this afternoon.",
            "On the left side you see notes without services and workflow area, which is in the middle of his master page and on the right you can see the note structure.",
            "We already starts or next door.",
            "We styles an empty table.",
            "Close every table."
        ],
        [
            "Later, crazy.",
            "Present.",
            "Patient able only.",
            "Taking currency.",
            "Generation.",
            "Crazy table having only rose with the Roman Empire.",
            "But no, I don't know the problem.",
            "You need to know that all of the answers were Confederates.",
            "Only problem had no growth.",
            "They don't care.",
            "After we've been sent."
        ],
        [
            "Table we assign random label.",
            "Each of these labels like Muse, to enter text by 1."
        ],
        [
            "After this notification dialog, mostly random assignment website, We Edit 5 labels, accept sealed compressor, five with people at her abilities."
        ],
        [
            "Afterwards, we as a real number based on emotion, dissolution and again as you can see in the configuration file, based on volumes of succeeded pretty Graphs Identity label."
        ],
        [
            "There's another reason afterwards.",
            "Just take a look or generate is nice, but the disagreement actors, for example, you can see.",
            "So the fire persecution fears is different colors.",
            "Every.",
            "Different areas and damages hundreds."
        ],
        [
            "After work I lose again, so it should after that mention sort of 2nd degree and we can take a look at working at generating now useless."
        ],
        [
            "And I think you said having clear 5 notice inside if you are not so confident with this because.",
            "Maybe cooking classes taken after."
        ],
        [
            "Add some noise with the two because it's true and stretch it out and it said it's Preston covenants.",
            "It can feel stressed.",
            "Americans columns based on the size range of censoring or cans.",
            "Chris Springs homes.",
            "I'm taking a section because this place I just at rest with three dimensions."
        ],
        [
            "What do I guess now is the smallest header block baby can clearly see the outlier generated by suggesting tools?"
        ],
        [
            "And finally, exposing, now you can also use them as a kid shows who checked if you're generating thing that really has similar things.",
            "Sarasota used."
        ],
        [
            "Allowed modules already before I use entertainers Major explained afterwards Sciences labels, miscellaneous sign and finally edited by management.",
            "This is also true beauty society and in the end I distressing couldn't outliers."
        ],
        [
            "Tomorrow morning I have kids.",
            "Now there is a conditional label assignment which is very helpful to create simple rules.",
            "They are always based on conditional probabilities based supplies for class or you can use the rule engine which can as into various types of rules.",
            "Also Bank of America polygons etc.",
            "We also provide armor."
        ],
        [
            "Number generators.",
            "You can each of them, as I already saw this configuration databases that situation and based on one distribution for the entire problem or dependent on labels another or second time and translate what you're currently offer.",
            "And I was divided into zones into dollars providing there is significant ability to create those intervals.",
            "Spy so random number sound which is created equally distributed darling or the Internet secure design which is creating detailed distributed valves cursed same from how open intervals and provide her with this computer designer and last for an open value translates Russian speaking with designer.",
            "I would actually like to go to another example so I don't think I don't care weight classes."
        ],
        [
            "Oh, is this example.",
            "I would like to try to wait a ciation groups or more details.",
            "I would like to insert like Association industry given set data.",
            "What I need is an important input of amending the proof possibilities and broader settings afterwards.",
            "I think this to get back it will step of product or you can also choose a list English.",
            "If you want applications open on Tuesdays takes you have to provide power and you have to provide some debt.",
            "Love you, so truthiness randomizing pleasure to increase support through the items in the room.",
            "And afterwards we increase the confidence of solution.",
            "So we take a look into the problem and fix.",
            "I just say you're already having these things are true, certain probability.",
            "All the items of feet.",
            "And crew finally became very devices with sensational grammar."
        ],
        [
            "One thing which is often via telephone and they have been racing is to combine two more peaks like another example that you have already turned away kids models and we have already a station with generation by both.",
            "Already showed you."
        ],
        [
            "But how we manage this now?",
            "You don't want to use a deal Joyner because it's two things you need more randomness.",
            "So in this case I just I'm proved the Association rule generation an analyst.",
            "OK, only product names and the old basket ID unknowns using and afterwards I randomly matched those tables together results."
        ],
        [
            "Reservation Rd.",
            "Random measures of classifying.",
            "Some color matches.",
            "Good answer, but it had to be every comment and we drove in selected tenure airport.",
            "That's too much too.",
            "Alaska"
        ],
        [
            "Show a more broader one.",
            "I already outfitted 2 steps to make it more understandable.",
            "I already obviously customers generations and it had overseen on the top deck and put black generations.",
            "You see on the top of the bottom down what we are asking those doing the truth we want to monetize Rose, who no longer have customers.",
            "We want to have a product customers.",
            "Pause in India.",
            "So in the first step I just ignore suspicious fire, which is adding the number of baskets based on your dictation.",
            "Afterwards, because we real numbers divided by zero and sits down but had rolling machine establishing and then I applied for work.",
            "When you get the bastards rules, the same is done using the number of products.",
            "But just in case things on his family are not on the.",
            "Patient is back.",
            "Basic.",
            "Send Monica Rose Bowl tonight.",
            "I want to get products matched to leave the party before product works.",
            "So true, so I assigned product category randomly to each of these customer product is afterwards combines with Jenna anticipation and do some additional labor signer to sign in product categories transferred to Santa Clara.",
            "Steady growth each label and in the end I have in every role choosing private equity and the product technology.",
            "Based on these two categories, I slept real products using Treanda mentioned for."
        ],
        [
            "There's also inside this generation, and most of these already provided by 9 Oliver generating random sequences having to leave their first two family get this Windows Insider.",
            "So we found in the executed and the second which missionary darker side you can.",
            "Yesterday this is having the same day but different.",
            "They come out at different data itself of the same pattern.",
            "This can be really helpful examples in minor programming language, and you can use design virtual variables.",
            "Also connection Solutions, which is very helpful to restart.",
            "And if you have a lot higher accrued side so."
        ],
        [
            "Summary of Marx model that they touch integration provides using mobile data simulation.",
            "You can split your data.",
            "Generation into smaller understandable modules.",
            "Each of these modules provides only a small generation tools, but together they provide above.",
            "You can use this load yesterday to generate closest to answer.",
            "You can use Excel to repeat the process.",
            "All critics handed and and and last benefit you have also visual magnification of this novel insights.",
            "Directional.",
            "What happens next?",
            "Now I'm going through this if you want to add functionality, generate time dependent data belonging to decorate data which is having vans or an unusual day president based on the timeline or without having a prudent action problems inside.",
            "Everything that I've sent today is already available on the 9 most shapes innovation homepage yet also trip.",
            "See how you can download this app.",
            "Great, I'm still.",
            "We do have the data generation knows all the week after with all this is virtual assistant saw and some more through our servers.",
            "Kiss anymore problems.",
            "Over more.",
            "It was stationed there probably tonight since last year.",
            "Thank you for finishing prepared this time so I have time for a few questions.",
            "Generate some questions about the system out of Flyers.",
            "How would you approach generating cut out of plastic?",
            "There's there's some rules for unusual medical outliers, 'cause if you don't know the rules, it's very hard to generate your listing qualifiers.",
            "All tires.",
            "Navigation.",
            "Thank you very much again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Working they are.",
                    "label": 0
                },
                {
                    "sent": "Wallpaper about computers.",
                    "label": 0
                },
                {
                    "sent": "Most likely?",
                    "label": 0
                },
                {
                    "sent": "So just.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Great to hear afterwards.",
                    "label": 0
                },
                {
                    "sent": "Explain the idea generation and go over to an outlook.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Whitelist me generate data.",
                    "label": 0
                },
                {
                    "sent": "I mean we generate data for multiple reasons.",
                    "label": 0
                },
                {
                    "sent": "There is the reason certain data or teaching students we want to challenge students with some days now with just having difficulty switching apples.",
                    "label": 0
                },
                {
                    "sent": "Mine and of course we also need aspecial day parental testing our little messages or also for demonstrating for their own messes aversion.",
                    "label": 0
                },
                {
                    "sent": "So understand that feeling statement generation till now.",
                    "label": 0
                },
                {
                    "sent": "Rosa",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The tools which are currently generating data mainly made for walking per person, so they're made for generating investors, or they're made for generating station unit size unknown.",
                    "label": 0
                },
                {
                    "sent": "IBM press tools are most used.",
                    "label": 0
                },
                {
                    "sent": "Data generators are only made for another 8 in your own address.",
                    "label": 0
                },
                {
                    "sent": "The problem is more like the Xbox at generation.",
                    "label": 0
                },
                {
                    "sent": "You can extend generation process if you can modify the samples.",
                    "label": 0
                },
                {
                    "sent": "We use it, but I will repeat so our ideas to resolve.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Red box using modern day pass.",
                    "label": 0
                },
                {
                    "sent": "Each piece itself there's only created and small amount of data, but by violence and who can cheap abroad range of data to achieve differences?",
                    "label": 0
                },
                {
                    "sent": "He's gonna have questions because cruise cancellation rules applying frequent itemsets Antillon and I would like to explain this morning sounds I showed here and what I'm doing here is activating in modern database is only done step so that wasn't able actually.",
                    "label": 0
                },
                {
                    "sent": "Measure.",
                    "label": 0
                },
                {
                    "sent": "Then I add some Harry Potter Instagram I as Jesus in The Beatles solution.",
                    "label": 0
                },
                {
                    "sent": "I can't even rise.",
                    "label": 0
                },
                {
                    "sent": "Hey, this is Mary dinner afterwards ISO shoe size through space with the heat rounds.",
                    "label": 0
                },
                {
                    "sent": "She says installation sizes and edit as an agency based care powder enamel shop Mason agencies and broke again.",
                    "label": 0
                },
                {
                    "sent": "Just already brought.",
                    "label": 0
                },
                {
                    "sent": "They said table there you can see different keys you.",
                    "label": 0
                },
                {
                    "sent": "I could visualize heading into shoe size, so overall.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the idea is used with the data generation process into small understandable models, and each of these modern weekend modified you can modify it in health.",
                    "label": 0
                },
                {
                    "sent": "No, you can't answer to an expansion packages that you can visit all that by using generalization of your data generation process.",
                    "label": 0
                },
                {
                    "sent": "Audit is implemented in Linux based that for now is open.",
                    "label": 0
                },
                {
                    "sent": "Be satisfied.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After I would like to get to a more detailed examples of how use this model update information garage, since I'm done examples, I'm going create 3 dimensional classes state of generation.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So it's taking me crystal this afternoon.",
                    "label": 0
                },
                {
                    "sent": "On the left side you see notes without services and workflow area, which is in the middle of his master page and on the right you can see the note structure.",
                    "label": 0
                },
                {
                    "sent": "We already starts or next door.",
                    "label": 0
                },
                {
                    "sent": "We styles an empty table.",
                    "label": 0
                },
                {
                    "sent": "Close every table.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Later, crazy.",
                    "label": 0
                },
                {
                    "sent": "Present.",
                    "label": 0
                },
                {
                    "sent": "Patient able only.",
                    "label": 0
                },
                {
                    "sent": "Taking currency.",
                    "label": 0
                },
                {
                    "sent": "Generation.",
                    "label": 0
                },
                {
                    "sent": "Crazy table having only rose with the Roman Empire.",
                    "label": 0
                },
                {
                    "sent": "But no, I don't know the problem.",
                    "label": 0
                },
                {
                    "sent": "You need to know that all of the answers were Confederates.",
                    "label": 0
                },
                {
                    "sent": "Only problem had no growth.",
                    "label": 0
                },
                {
                    "sent": "They don't care.",
                    "label": 0
                },
                {
                    "sent": "After we've been sent.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Table we assign random label.",
                    "label": 0
                },
                {
                    "sent": "Each of these labels like Muse, to enter text by 1.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After this notification dialog, mostly random assignment website, We Edit 5 labels, accept sealed compressor, five with people at her abilities.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Afterwards, we as a real number based on emotion, dissolution and again as you can see in the configuration file, based on volumes of succeeded pretty Graphs Identity label.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's another reason afterwards.",
                    "label": 0
                },
                {
                    "sent": "Just take a look or generate is nice, but the disagreement actors, for example, you can see.",
                    "label": 0
                },
                {
                    "sent": "So the fire persecution fears is different colors.",
                    "label": 0
                },
                {
                    "sent": "Every.",
                    "label": 0
                },
                {
                    "sent": "Different areas and damages hundreds.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After work I lose again, so it should after that mention sort of 2nd degree and we can take a look at working at generating now useless.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I think you said having clear 5 notice inside if you are not so confident with this because.",
                    "label": 0
                },
                {
                    "sent": "Maybe cooking classes taken after.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Add some noise with the two because it's true and stretch it out and it said it's Preston covenants.",
                    "label": 0
                },
                {
                    "sent": "It can feel stressed.",
                    "label": 0
                },
                {
                    "sent": "Americans columns based on the size range of censoring or cans.",
                    "label": 0
                },
                {
                    "sent": "Chris Springs homes.",
                    "label": 0
                },
                {
                    "sent": "I'm taking a section because this place I just at rest with three dimensions.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What do I guess now is the smallest header block baby can clearly see the outlier generated by suggesting tools?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And finally, exposing, now you can also use them as a kid shows who checked if you're generating thing that really has similar things.",
                    "label": 0
                },
                {
                    "sent": "Sarasota used.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Allowed modules already before I use entertainers Major explained afterwards Sciences labels, miscellaneous sign and finally edited by management.",
                    "label": 0
                },
                {
                    "sent": "This is also true beauty society and in the end I distressing couldn't outliers.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Tomorrow morning I have kids.",
                    "label": 0
                },
                {
                    "sent": "Now there is a conditional label assignment which is very helpful to create simple rules.",
                    "label": 0
                },
                {
                    "sent": "They are always based on conditional probabilities based supplies for class or you can use the rule engine which can as into various types of rules.",
                    "label": 1
                },
                {
                    "sent": "Also Bank of America polygons etc.",
                    "label": 0
                },
                {
                    "sent": "We also provide armor.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Number generators.",
                    "label": 0
                },
                {
                    "sent": "You can each of them, as I already saw this configuration databases that situation and based on one distribution for the entire problem or dependent on labels another or second time and translate what you're currently offer.",
                    "label": 1
                },
                {
                    "sent": "And I was divided into zones into dollars providing there is significant ability to create those intervals.",
                    "label": 0
                },
                {
                    "sent": "Spy so random number sound which is created equally distributed darling or the Internet secure design which is creating detailed distributed valves cursed same from how open intervals and provide her with this computer designer and last for an open value translates Russian speaking with designer.",
                    "label": 0
                },
                {
                    "sent": "I would actually like to go to another example so I don't think I don't care weight classes.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Oh, is this example.",
                    "label": 0
                },
                {
                    "sent": "I would like to try to wait a ciation groups or more details.",
                    "label": 0
                },
                {
                    "sent": "I would like to insert like Association industry given set data.",
                    "label": 0
                },
                {
                    "sent": "What I need is an important input of amending the proof possibilities and broader settings afterwards.",
                    "label": 0
                },
                {
                    "sent": "I think this to get back it will step of product or you can also choose a list English.",
                    "label": 0
                },
                {
                    "sent": "If you want applications open on Tuesdays takes you have to provide power and you have to provide some debt.",
                    "label": 0
                },
                {
                    "sent": "Love you, so truthiness randomizing pleasure to increase support through the items in the room.",
                    "label": 1
                },
                {
                    "sent": "And afterwards we increase the confidence of solution.",
                    "label": 1
                },
                {
                    "sent": "So we take a look into the problem and fix.",
                    "label": 0
                },
                {
                    "sent": "I just say you're already having these things are true, certain probability.",
                    "label": 0
                },
                {
                    "sent": "All the items of feet.",
                    "label": 0
                },
                {
                    "sent": "And crew finally became very devices with sensational grammar.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "One thing which is often via telephone and they have been racing is to combine two more peaks like another example that you have already turned away kids models and we have already a station with generation by both.",
                    "label": 0
                },
                {
                    "sent": "Already showed you.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "But how we manage this now?",
                    "label": 0
                },
                {
                    "sent": "You don't want to use a deal Joyner because it's two things you need more randomness.",
                    "label": 0
                },
                {
                    "sent": "So in this case I just I'm proved the Association rule generation an analyst.",
                    "label": 1
                },
                {
                    "sent": "OK, only product names and the old basket ID unknowns using and afterwards I randomly matched those tables together results.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reservation Rd.",
                    "label": 0
                },
                {
                    "sent": "Random measures of classifying.",
                    "label": 0
                },
                {
                    "sent": "Some color matches.",
                    "label": 0
                },
                {
                    "sent": "Good answer, but it had to be every comment and we drove in selected tenure airport.",
                    "label": 0
                },
                {
                    "sent": "That's too much too.",
                    "label": 0
                },
                {
                    "sent": "Alaska",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Show a more broader one.",
                    "label": 0
                },
                {
                    "sent": "I already outfitted 2 steps to make it more understandable.",
                    "label": 0
                },
                {
                    "sent": "I already obviously customers generations and it had overseen on the top deck and put black generations.",
                    "label": 0
                },
                {
                    "sent": "You see on the top of the bottom down what we are asking those doing the truth we want to monetize Rose, who no longer have customers.",
                    "label": 0
                },
                {
                    "sent": "We want to have a product customers.",
                    "label": 1
                },
                {
                    "sent": "Pause in India.",
                    "label": 0
                },
                {
                    "sent": "So in the first step I just ignore suspicious fire, which is adding the number of baskets based on your dictation.",
                    "label": 0
                },
                {
                    "sent": "Afterwards, because we real numbers divided by zero and sits down but had rolling machine establishing and then I applied for work.",
                    "label": 0
                },
                {
                    "sent": "When you get the bastards rules, the same is done using the number of products.",
                    "label": 0
                },
                {
                    "sent": "But just in case things on his family are not on the.",
                    "label": 0
                },
                {
                    "sent": "Patient is back.",
                    "label": 0
                },
                {
                    "sent": "Basic.",
                    "label": 0
                },
                {
                    "sent": "Send Monica Rose Bowl tonight.",
                    "label": 0
                },
                {
                    "sent": "I want to get products matched to leave the party before product works.",
                    "label": 0
                },
                {
                    "sent": "So true, so I assigned product category randomly to each of these customer product is afterwards combines with Jenna anticipation and do some additional labor signer to sign in product categories transferred to Santa Clara.",
                    "label": 1
                },
                {
                    "sent": "Steady growth each label and in the end I have in every role choosing private equity and the product technology.",
                    "label": 0
                },
                {
                    "sent": "Based on these two categories, I slept real products using Treanda mentioned for.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's also inside this generation, and most of these already provided by 9 Oliver generating random sequences having to leave their first two family get this Windows Insider.",
                    "label": 0
                },
                {
                    "sent": "So we found in the executed and the second which missionary darker side you can.",
                    "label": 0
                },
                {
                    "sent": "Yesterday this is having the same day but different.",
                    "label": 0
                },
                {
                    "sent": "They come out at different data itself of the same pattern.",
                    "label": 1
                },
                {
                    "sent": "This can be really helpful examples in minor programming language, and you can use design virtual variables.",
                    "label": 0
                },
                {
                    "sent": "Also connection Solutions, which is very helpful to restart.",
                    "label": 0
                },
                {
                    "sent": "And if you have a lot higher accrued side so.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Summary of Marx model that they touch integration provides using mobile data simulation.",
                    "label": 0
                },
                {
                    "sent": "You can split your data.",
                    "label": 0
                },
                {
                    "sent": "Generation into smaller understandable modules.",
                    "label": 0
                },
                {
                    "sent": "Each of these modules provides only a small generation tools, but together they provide above.",
                    "label": 0
                },
                {
                    "sent": "You can use this load yesterday to generate closest to answer.",
                    "label": 1
                },
                {
                    "sent": "You can use Excel to repeat the process.",
                    "label": 0
                },
                {
                    "sent": "All critics handed and and and last benefit you have also visual magnification of this novel insights.",
                    "label": 0
                },
                {
                    "sent": "Directional.",
                    "label": 0
                },
                {
                    "sent": "What happens next?",
                    "label": 0
                },
                {
                    "sent": "Now I'm going through this if you want to add functionality, generate time dependent data belonging to decorate data which is having vans or an unusual day president based on the timeline or without having a prudent action problems inside.",
                    "label": 0
                },
                {
                    "sent": "Everything that I've sent today is already available on the 9 most shapes innovation homepage yet also trip.",
                    "label": 0
                },
                {
                    "sent": "See how you can download this app.",
                    "label": 0
                },
                {
                    "sent": "Great, I'm still.",
                    "label": 1
                },
                {
                    "sent": "We do have the data generation knows all the week after with all this is virtual assistant saw and some more through our servers.",
                    "label": 0
                },
                {
                    "sent": "Kiss anymore problems.",
                    "label": 0
                },
                {
                    "sent": "Over more.",
                    "label": 0
                },
                {
                    "sent": "It was stationed there probably tonight since last year.",
                    "label": 0
                },
                {
                    "sent": "Thank you for finishing prepared this time so I have time for a few questions.",
                    "label": 0
                },
                {
                    "sent": "Generate some questions about the system out of Flyers.",
                    "label": 0
                },
                {
                    "sent": "How would you approach generating cut out of plastic?",
                    "label": 0
                },
                {
                    "sent": "There's there's some rules for unusual medical outliers, 'cause if you don't know the rules, it's very hard to generate your listing qualifiers.",
                    "label": 0
                },
                {
                    "sent": "All tires.",
                    "label": 0
                },
                {
                    "sent": "Navigation.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much again.",
                    "label": 0
                }
            ]
        }
    }
}