{
    "id": "v6wiy7bnejjebws4t732ahyhpusyastn",
    "title": "On stratified path sampling of the Thermodynamic Integral: computing Bayes factors for nonlinear dynamical systems models",
    "info": {
        "author": [
            "Mark Girolami, School of Computing Science, University of Glasgow"
        ],
        "published": "Aug. 5, 2008",
        "recorded": "May 2008",
        "category": [
            "Top->Computer Science->Machine Learning->Bayesian Learning"
        ]
    },
    "url": "http://videolectures.net/aispds08_girolami_osps/",
    "segmentation": [
        [
            "Thank you for inviting me here.",
            "I think I've struggled a bit with all the rich food than the wine and some of the beer that's been available, but it's been a really great workshop, so I'm the last hurdle really between.",
            "You getting back home, so I'll try and be swift.",
            "And so this fall is on pretty much from the the last talk, where we're really motivated in trying to assess the evidential support of mechanistic models or biochemical pathways as a means of engaging with biologists in terms of them assessing or designing the sort of experiments that they may wish to do next.",
            "And a bit like are.",
            "Billy Connolly joke.",
            "I actually spend most of my time talking about the main problem which we faced, which was actually estimating the integrated likelihood of these system models, which are based on systems of nonlinear ODS."
        ],
        [
            "So.",
            "The motivation of the talk is basically going to be that we want to address certain open inferential issues which are large, have largely been ignored within systems biology."
        ],
        [
            "And in particular, the two main things that we want to do our as has been discussed throughout this last three days, to be able to infer the sort of plausible range of parameter values of these sorts of ody based models of biochemical process is so these are parameters which typically refer to perhaps reaction rates, which are difficult or impossible to measure."
        ],
        [
            "And the other thing they'll question, and the one that's really going to form the basis of my talk, is to assess the evidential support for perhaps a set of plausable models of a particular biochemical process, which is which are under consideration, or perhaps competing mechanistic descriptions.",
            "So these are the two inferential problems that we would like to address.",
            "And in fact, what we end up doing here is describing our method for joy."
        ],
        [
            "Hopefully doing posterior inference or for the control engineers doing system identification and also the estimation of these factors based on estimates of the integrated or the marginal likelihoods.",
            "Or the evidence of the models."
        ],
        [
            "And the way that we're going to do that as we're going to employ are.",
            "A stratified sampling strategy.",
            "Of for estimating the thermodynamic integral, and there's lots of physicists in here, so you're more than familiar with what the thermodynamic integral is, and I'll discuss that.",
            "Later on."
        ],
        [
            "In the talk and then after all of that, I'm going to get back to the main point, which is, as I said, doing this joint posterior inference and estimating based factors, and I'm going to give a fairly substantial example of an application of this inferential methodology to the extracellular regulated kinase signaling pathway are very well studied signaling pathway and one in which we have.",
            "Some experimental validation which was quite nice, and then I'll conclude."
        ],
        [
            "And somewhat swiftly so."
        ],
        [
            "Here's a cartoon description of a.",
            "And also later model which describes how the central Clock genes of a circadian control controller.",
            "Basically define two interlocked feedback loops.",
            "Oprah."
        ],
        [
            "Use observations which essentially just sustained oscillations, and the trick here and system identification is that given there is sufficient evidence, sufficient biological knowledge to identify the various proteins and various connections associated with this.",
            "Molecular circuit, can we then identify the unknown components?",
            "So what is the rates of transcription?",
            "You know how quickly do these these jeans transcribed?",
            "What are their degradation rates and so forth?",
            "So can we then flow identify the system from some experimental data?",
            "Well, that's been largely discussed an I won't really dwell on that too."
        ],
        [
            "In this talk."
        ],
        [
            "But the problem that I am going to focus on is this one, and this is again another cartoon of the extracellular regulated kinase pathway, which my collaborators are working on.",
            "And here is 1 example of a sort of mechanistic description of how the.",
            "OK, so this is the cell wall and then if there is some stimulation by epidermal growth factor then there is a whole cascade of reactions, right?",
            "From the cell wall right into the nucleus where this protein, I'll just call it out.",
            "From there one is activated, it becomes active, it's phosphorylated.",
            "And again, there's plenty of evidence invested.",
            "Interest to suggest that there is a single path we like this, which mediates the stimulation the extracellular stimulation."
        ],
        [
            "Let us, however, another school of thought that would say well in actual fight there are due paths from the receptors mediated by additional proteins in the activation of Erk."
        ],
        [
            "And there's even other hypothesis and again, evidence to perhaps give support to the hypothesis that in actual fact there is cross coupling between other pathways and this particular path here.",
            "So in actual fact we don't have a sort of linear pathway as such, but we have a sort of cross coupled cross coupling between other pathways.",
            "And the key question that we would like to be able to do is is given experimental.",
            "They found observation.",
            "Can we then objectively assess what the levels of evidential support time for these varying hypothesis?",
            "And can they then be used in a productive manner in terms of defining additional experiments and so forth to further refine or fill in the gaps of the biological knowledge about the biochemical mechanisms?",
            "At play.",
            "Right so."
        ],
        [
            "So I guess I can skip through this.",
            "This is more for biologists, but basically we're going to employ statistical inferential methodology to one get posterior distributions over the parameters of the model and those once we've defined the posterior distributions over the parameters, then we can use those posteriors.",
            "If we employ the models as simulators with forward simulators.",
            "Now if we want to do some sort of global sensitivity analysis.",
            "And of course, the what I'm going to focus on for the remainder of the talk is to actually be able to objectively compare alternatives, descriptions of the systems and therefore assess the validity of the underlying working hypothesis."
        ],
        [
            "So how do we do that?",
            "Well, we use Bayes factors.",
            "We need to obtain.",
            "The posterior odds, given two hypothesis which are represented by two particular to two distinct models, it doesn't have to be nested.",
            "Of course with parameter sets, associated sets of parameters and we have observations, so we would employ the posterior odds.",
            "Test the weight of evidence, as it were in favor of hypothesis one.",
            "So."
        ],
        [
            "Is the key measure that's required here?",
            "As the integrated likelihood and a lot of people have spoken about the evidence, the marginal likelihood, the integrated likelihood, and primarily focused on getting lower bound approximations to it, well, I'm going to focus on actually obtaining estimates of this measure here.",
            "See why it's actually quite important.",
            "To get good estimates.",
            "And, um."
        ],
        [
            "Yeah, and certainly in terms of the statistics community, there have been a fair few PHD's produced Justin trying to devise estimators of this measure, and there still is an awful lot of methodological effort involved in trying to get efficient estimators of this measure.",
            "So let's go back to statistics course 101.",
            "And how would we estimate this?",
            "Well, we could use a Monte Carlo estimator.",
            "We would just draw samples from the prior."
        ],
        [
            "I."
        ],
        [
            "And so we know if we drawn off samples then.",
            "This this finite sample estimate will converge to the integrated likelihood, but we all know that this is a very poor or very inefficient estimator, especially if there's a large mismatch between the prior and visions of."
        ],
        [
            "High likelihood.",
            "So to get round this inefficiency of sampling, one approach is to employ important sampling, and again I don't need to go over what put that is for this audience, but a very common important sample that's used in obtaining estimates of integrated likelihood is where we employ for our importance distribution.",
            "We employ them."
        ],
        [
            "Posterior over the parameters Theta.",
            "And of course, what we end up with Then's are basically the harmonic mean estimator of the integrated likelihood, and again, this is very popular primarily because if you're running a Markov chain, if you're running MCMC simulations, then the outputs of your.",
            "Your sampler can then be used to to obtain an estimate of the integrated likelihood.",
            "And this by and large, gets round the inefficiency of sampling from the prior because no oversampling from a distribution which is much more concentrated in regions of high density."
        ],
        [
            "OK, well is just to test this, I'm going to.",
            "Use a very simple linear regression model.",
            "And I'm going to use the linear regression model just to show to demonstrate some of the problems associated with the estimators such as these here.",
            "So this is just a standard linear expansion of the set of basis functions.",
            "We have some error term which is normally distributed with some variance.",
            "We put a prior distribution on the regression coefficients, which is normal again with a 0 mean and some.",
            "Some variance and of course our posterior over the coefficients model parameters admits a closed form.",
            "I'm indeed."
        ],
        [
            "We also get an analytic form for the marginal likelihood, so I'm going to use these and assessing how good certain estimators are."
        ],
        [
            "So what we will do is we will draw 30 sample points, each one of these samples is devised by having a number of different variants ranging from 2 covariance up to 20."
        ],
        [
            "And then realized to meet the marginal likelihood so.",
            "If we use 100 samples 1000 and then up to 100,000 samples from our sampling distribution to get our estimate.",
            "So if we sample from the prior, here are the analytic values of integrated likelihood, and here are estimates, and as we would expect, by the time we get to that six covariates, the sampling from the prior starts to keel over at rather small values of rather large values of samples join from the prior.",
            "Of course this is exact sampling because we're drawing from this ghost."
        ],
        [
            "If we then use the.",
            "The harmonic mean estimator.",
            "So again we use exact sampling from our analytic posterior.",
            "Then we see that the variance is controlled a lot better.",
            "But one of the rather startling things, and rather concerning, is that we get a consistent overestimation.",
            "Quite consistent bias and a finite sample estimate."
        ],
        [
            "No, is this a big problem?",
            "Well, let me show that it is especially want if we're going to use the integrated likelihood to do some sort of reasoning over model plausible models.",
            "OK, so we know that the sampling from the prior feels catastrophic.",
            "Lee."
        ],
        [
            "Certainly sampling from the posterior is is far superior, but there is this somewhat worrying over estimation of the log marginal, and this is actually.",
            "This is actually some of the surprise to statisticians.",
            "So anyway."
        ],
        [
            "So let's again just to run this point, whom Father?",
            "Let's just consider a nested model here, so we have a linear model and then one with a quadratic effect."
        ],
        [
            "And I'll generate data from the first model from the linear model."
        ],
        [
            "And then I'll compute the base factors.",
            "I will estimate the base factors by sampling from the posterior so the analytic value of the base factor is.",
            "Just under 30.",
            "So in terms of Jefferies tariff for the levels of evidence, then suggest that there is strong evidence in favor of a linear response model.",
            "However our samples."
        ],
        [
            "But by employing the posterior harmonic mean estimator, then we massively underestimate the base factor for such an extent that an actual fact it would suggest.",
            "But the evidence is not really worth more than a beer mentioned, so this is somewhat concerning and ensures that we really do.",
            "If we're going to be using Bayes factors and our estimates of integrated likelihoods to reason about models which are on the table for consideration, then we need to take a little bit more care.",
            "As we will know, try and."
        ],
        [
            "Do.",
            "I can't remember what time I started talking.",
            "New right alright?",
            "So OK, OK, just in case I get too crowded with myself, right?",
            "So the harmonic mean estimator for even a very simple linear and quadratic nested models.",
            "We can't really trust it.",
            "So when we come to these more complex dynamic models defined by systems of nonlinear differential equations, then the problem gets much harder.",
            "So we need to try and address this this issue here.",
            "No roughton."
        ],
        [
            "Way to to try and get round this or getting the problem with the.",
            "Harmonic mean estimator suggested our mixture distribution, where you sampled from the prior and you also sampled from the posterior.",
            "So you had a mixture.",
            "Mixture or proposal distribution, which is basically a certain important distribution, which is basically a mixture between the prior and the posterior and that was suggested to try and stabilize this.",
            "Estimator well, if we're going to be sampling, which of course is the distribution we want from the posterior from the prior, but also trying to use the efficiency of the posterior, then it would make sense rather than to have two finite points, one at the prior and one at the posterior, is to use the full path of distributions between the prior and the posterior, as was proposed by Gelman and Main over 10 years ago.",
            "When the suggested, this whole notion of path sampling and of course path sampling comes from the statistical physics community which Manford and you chaps all know about where we employ a path and in this case we will devise."
        ],
        [
            "A path from the prior to the posterior and integrate overlap."
        ],
        [
            "And we would hope that this would give us a more stable.",
            "Estimate of the marginal likelihood.",
            "OK, I'm going to be quite specific.",
            "Rather than being general here, I'm going to define the posterior distribution.",
            "So this is like a tempered posterior distribution where I've used an aux variable T inverse temperature.",
            "As we all know.",
            "And I'm using that to two and you if you will, to temper the likelihood.",
            "So this accelerated variable then define our path becausw."
        ],
        [
            "Tis Zero, and of course zed T is going to be one and we just recover the prior when we get to the extreme end, which he is.",
            "1 then of course, this pen put posterior then just we just recover the standard posterior."
        ],
        [
            "And some.",
            "Six form calculus by taking derivatives of the log partition function."
        ],
        [
            "And integrating we end up with the standard form of the thermodynamic integral where we've defined a path that this sort of path here.",
            "So we represent the log of the integrated likelihood as the.",
            "This sort of path integral over.",
            "The expectations of the log of the likelihood with respect to these pampered posteriors defined along a path from zero to 1.",
            "So task now is to estimate this in some way.",
            "Well, that's fairly straightforward."
        ],
        [
            "And introduce a sampling distribution for the.",
            "In the executive variable T."
        ],
        [
            "Undam all that we need to do now is just."
        ],
        [
            "Obtain a Monte Carlo estimate.",
            "For this this integral where."
        ],
        [
            "It appears theater, S and TS are drawing from the joint posterior.",
            "And that's fairly straightforward to do."
        ],
        [
            "Do we can do that just fine?",
            "Rockless sampler"
        ],
        [
            "Where we have acceptance issues for the parameters and for the.",
            "The inverse temperatures."
        ],
        [
            "And so here are the Hastings ratios, so our acceptance problem."
        ],
        [
            "Eletise for proposed parameters falls fairly straightforwardly, no problem.",
            "We can do that.",
            "The acceptance probabilities for the.",
            "Inverse temperatures, on the other hand, we had this problem here and we saw this previously and one of the talks we have this ratio of these normalizing constants for the for those annealed posteriors.",
            "So we've got a bit of a problem and that our sampling from our joint posterior we hit this problem.",
            "This is a well known problem.",
            "And has been addressed or or attempts to address have been made over the past 15 years or so.",
            "And fight the weather."
        ],
        [
            "We tried to to address this problem was using the data augmentation methods of Mueller, and indeed someone also spoke about the approximate MCMC methods without likelihoods of Marjoram and Co, and more recently of people like Ian Murray.",
            "Have looked at these sort of problem.",
            "The reality was that it did not provide a useful solution, especially for the scale of the problems that we are looking at so.",
            "We know and have to consider.",
            "Another another way of addressing this, and the way that we have to do this is we have to discretize.",
            "So we need to somehow take this this path over zero and one.",
            "Discretize it in some way, no.",
            "I'm actually going to make sure that there's virtue in actually making."
        ],
        [
            "A discrete estimate or approximation.",
            "If I just assume that the distribution over T is uniform on the support zero and one, then the variance of our estimator."
        ],
        [
            "So the one that we can't this one here."
        ],
        [
            "The variance of this."
        ],
        [
            "Estimator.",
            "Will just follow as the variance of the log of the likelihood over theater and over T."
        ],
        [
            "If I then.",
            "Discretize the unit line.",
            "So I I stratify into number of subintervals, so call DN.",
            "And within each of these DN I make a number of draws.",
            "Right from the start, so number of draws of T. With some sampling distribution, which we'll talk about shortly.",
            "And then, given that we've drawn a sample.",
            "From one of these strata we then draw a sample of the model parameters from the tempered posterior.",
            "And we can then use those.",
            "Plug Lumentum I want to."
        ],
        [
            "Carlo estimater and if in particular I define these sampling distributions within the strata to be uniform, then the variance of this estimator here well follows in a standard way.",
            "Now the key point here is that if I link the variance of the estimator with the variance of the estimator."
        ],
        [
            "And some sort of stratified sampling strategy.",
            "Then it's fairly straightforward to show, and it's a standard result in the Monte Carlo literature that the variance of the stratified estimator will certainly be never larger than the variance of of the original estimator.",
            "So in actual fact, by discretizing we may well have an estimator which has a much lower variance, so much we have an improved estimator.",
            "Of integrated likelihood.",
            "So this is a this is a good thing.",
            "No, so that means FI.",
            "Again, have a uniform sampling distribution in each of the finite strata."
        ],
        [
            "Then I can write the log of the integrated likelihood as a discrete sum over the strata of these conditional expectations, which week?"
        ],
        [
            "Nice to meet and a fairly standard way."
        ],
        [
            "An no.",
            "So what this means is that we set up a path.",
            "And then we just randomly sample.",
            "A temperature and then our parameter and then move up the strata.",
            "Now of course there are other non equilibrium based methods such as annealed, importance sampling or even sequential Monte Carlo methods here.",
            "Of course, because we're relying on on average.",
            "Monte Carlo estimates, then, of course, our sampling chains have to converge to the state the desired stationary distribution, which in this case would be whatever the.",
            "Tempered posterior happens to be.",
            "No um.",
            "If you go to the limiting case where we've defined our strata T, N -- 1 and TN, and rather than sampling in there, we just take two points.",
            "T N -- 1 and TN and use those to obtain.",
            "A crude approximation to this expectation here.",
            "Then what we end up with.",
            "Basically, the trapezoidal approximation of the integral over the path, and this is actually being proposed just recently and RSSB Royal Statistical Society series be paper by now.",
            "If you and Tony Pettit, and previously bilateral Owen Philippe where they were.",
            "Largely interested in Phylogenetic's fellow genetic trees.",
            "So of course this is known approximation, right?",
            "So there's going to be some bias in here, and it would be useful if you could characterize what that bias would be.",
            "Well, it's fairly straightforward."
        ],
        [
            "To show that we can define a lower bound so we we can describe the log of the integrated likelihood in terms of a lower bound.",
            "On a bias term where this biased term is basically just the kullback Leibler divergent between the two.",
            "Penn put posteriors at T, N -- 1 and at TN.",
            "OK, so.",
            "We obtain these power expectations.",
            "These tempered expectations of the log likelihood sum them all up over all the discrete points in the path and then add this biased him.",
            "So this define."
        ],
        [
            "Is a lower bound.",
            "Likewise, we can do the same and define an upper bound.",
            "And again, we find that the bias is now the opposite form of the KL divergent of those tempered posteriors.",
            "So of course that means that we."
        ],
        [
            "And then write the tapiz eudell integral.",
            "And we define the bias of the error as basically the difference caused by the symmetry of the KL divergent between these two tempered posteriors.",
            "Now, this may well be.",
            "Takes big stuff for statistical physicists.",
            "I'm not sure, but it's quite a useful tool for yes.",
            "These quantities will not be very smooth, so.",
            "What quantities?",
            "Yeah the when you see smooth you will see exactly.",
            "Sorry.",
            "And overtime so you could use a higher integration routine or something.",
            "Yeah, yeah, sure that could be done.",
            "So what's the?",
            "If you have phase transitions then right so OK so so that's an interesting question and fight at phase transitions.",
            "So examples that I have worked on I haven't seen anything like this and last week talking with anybody he could only suggest one sort of pathological phase transition that would cause cause problems so.",
            "Anyway, so so clearly now then what we want to do is we want to define this sort of stratification out of the discretization in such a way that we can control this bias here.",
            "Well, an actual fight for we can do.",
            "It's fairly straightforward.",
            "We can get the optimal sampling distribution for T in terms of minimizing the variance of the overall estimator."
        ],
        [
            "And of course, it turns out to be the sampling distribution for T will be proportional to.",
            "The variance of the posterior variance of the log likelihood at that particular inverse temperature.",
            "Now if I go back to the linear regression model.",
            "We cannot."
        ],
        [
            "Actually, after some excruciating algebra, we can actually get an analytic form for the optimal sampling distribution for the optimal path.",
            "For the linear regression model, and if we actually."
        ],
        [
            "Look at that."
        ],
        [
            "So here is the.",
            "P of T on support zero and one.",
            "Which would give you the the minimum variance estimator.",
            "Now what you can see is that so in terms of.",
            "Discretization would have very very small strata here and then.",
            "We will as we start to approach the posterior strategy within start become larger.",
            "OK, on this holds for, so this was a prior distribution which was extremely diffuse and then as we start to tighten up the prior distribution we can see that this sampling density is still fairly well skewed towards the prior.",
            "So in other words, we've got a strategy for."
        ],
        [
            "Defining our sequence of Delta ends of sequence of blank, the width of the strata.",
            "I'm."
        ],
        [
            "And even just as our throwaway remark, if we were to.",
            "To split this into uniform segments and then raise each of those to the power of 5.",
            "Then we end up with something that looks like like this here.",
            "OK."
        ],
        [
            "So we've now got a means of defining what the optimal.",
            "Our path sampling strategy is and here's an example here, where we've used discretization, which follows a sort of.",
            "Distribution.",
            "So here's a again, a linear regression model with two covariates, and this is one with twenty covariance.",
            "Sorry, that'll be around 2 covariates, 20 covariates.",
            "So here's the approach that trapezoidal approximation and these are the upper and lower bounds, and this is the analytic value, and you can see that by the time we've used about 50 strata, then you know we've got a pretty good estimate.",
            "I've got pretty good approximation.",
            "Of course, I'm not taking into account the Monte Carlo errors associated with obtaining his expectations, but I'll discuss those shortly."
        ],
        [
            "If I use a uniform.",
            "Partitioning, then you see that the variance.",
            "Is really huge in comparison.",
            "To this here.",
            "So the bias is.",
            "Not well controlled at all."
        ],
        [
            "OK, just two.",
            "Finalize on this part.",
            "Again, with a linear regression model, we can see that as the number of samples increases, sampling from the prior gets better, but it's pretty poor.",
            "The posterior, on the other hand, sampling the posterior.",
            "The variance is pretty well controlled, but we still have this systematic bias.",
            "And if we use the stratified path sampling strategy that we just discussed here.",
            "We then see we really have variable bias and low variance estimates of these of the integrated likelihood.",
            "And competing that with the bias associated with sampling from the posterior, you can see it's quite quite significant."
        ],
        [
            "And so if we then use those estimates of the integrated likelihood and obtaining our base factors for the nested models that we I presented before, we now see that the base fact the estimate of the base factor is at the level that we would.",
            "I would expect so we would know.",
            "See that as indeed strong evidence and support about a linear effects model.",
            "OK, so we've.",
            "We now have a stratified.",
            "Stratification strategy, which allows us to get a good low variance, low bias estimate of our integrated likelihood."
        ],
        [
            "So we want to turn our attention onto some of the more realistic models that we're going to be considering.",
            "And here is an example here."
        ],
        [
            "So this was a model that was proposed in the 50s by English biologist to describe circadian control of certain enzymes, and there's plenty of engineers and physicists.",
            "And here we can see that this is just a feedback loop, so this protein inhibits the production of the same RNA and for certain values of inhibition and activation rates we get sustained oscillations.",
            "OK so very simple system.",
            "If I just take the most basic system where there is only one intermediate protein before we inhabit the M RNA of the Clock gene.",
            "And I look."
        ],
        [
            "The likelihood surface.",
            "Then we get something that looks like this.",
            "So what we see is that for these two parameters you can see an extremely strong peak at the true values.",
            "But we also see are a large number of areas in parameter space which have fairly high likelihood.",
            "And actually, it's quite interesting for the mathematicians amongst you.",
            "Be aware that you can solve that system and there are certain combinations of parameters which would give you the same phase and the same amplitude of oscillation and hence the reason you have these.",
            "He sorts of our covers in the the likelihood surface.",
            "Now this is a big deal.",
            "If I.",
            "If I was just to then use this.",
            "Path sampling method to estimate my marginal likelihood.",
            "For this particular model, well, let's just run Metropolis and let's look."
        ],
        [
            "The posteriors that we get.",
            "So here are the March estimates of the marginal posterius for and also later model.",
            "Is here.",
            "Here's the true parameter values that were used to generate the observations, and you can see that they are hopelessly biased and so that the chain really mixed very poorly, and if I.",
            "Just bear with me.",
            "I'll be a bus come up top.",
            "It should come up in a second.",
            "Just tell."
        ],
        [
            "Straight.",
            "So here is the posterior.",
            "Just on those two parameters I showed you.",
            "And here are the paths of 20.",
            "Metropolis samples and you can see the mixing.",
            "Well, there is no mixing and we get real catastrophic failure.",
            "So.",
            "We've already got a problem here.",
            "When we start consider."
        ],
        [
            "These non trivial.",
            "Or the style models with fairly interesting dynamic."
        ],
        [
            "Now, of course we're relying on.",
            "Sampling from these tempered posteriors to get the expectations that we require for our estimate of the integrated likelihood."
        ],
        [
            "So again, if I."
        ],
        [
            "Sure, what we've got here is the path from the prior.",
            "So in this case it's a product of two gamma distributions.",
            "So at T = 0, The bottom.",
            "We've got this very, very smooth surface.",
            "And then of course as we start to increase the value of T. We get these ripples and then the peak of the posterior starting to appear as we get to the posterior.",
            "So we've generated this ladder and we have all of these tempered distributions.",
            "Now, of course, to get round the problem of poor mixing for such a rough likelihood surface like this, we can employ methods such as parallel tempering those if you're not familiar with parallel tempering, we in essence would devise a temperature ladder from some base distribution.",
            "In this case, the prior up to our target distribution, which would be our posterior.",
            "And if we define the target distribution station distribution as the product of all of these, then it allows us to propose moves, parameter moves.",
            "Between these pampered posteriors.",
            "And so things like parallel tampering or pop."
        ],
        [
            "Elation MCMC get around the problem of the poor mixing up at the posterior right by allowing very free moves down at.",
            "So for example, down at the prior.",
            "And then we start to be able to explore more globally the sort of local structure of the posterior surface."
        ],
        [
            "Now again, if you think about the same as dynamic integral, we've had to define these particular temperatures.",
            "These particular distributions we then sample from these and then use Monte Carlo estimates to get the expectations under each of these of log likelihood.",
            "And then we stitch them together.",
            "So now what we can actually do is we can use this sequence of annealed or tempered distributions and have proposal distribution proposal moves between the tempered distributions to improve the mixing into."
        ],
        [
            "Around that problem, and so if we do that.",
            "No, we we see that are marginal posteriors of buying or in the true values, so we're getting good mixing and good coverage of the the push."
        ],
        [
            "Sterea now.",
            "Let's get to the start to get to the sort of point of the talk.",
            "So here are two examples of this oscillator model.",
            "One where there is only one intermediate.",
            "Protein and another one where there are two.",
            "So we've got this kind of extended delay.",
            "You have to go.",
            "So what we'll do is we'll generate simulate from this one, compute the base factors, and then simulate from this one and compute the base factors and so."
        ],
        [
            "Now if we just use Standard Metropolis sampling from each of the tempered.",
            "Posterius then if we look at the estimate of the log of the base factor where we're based factors relative sort of testing the simple model against the complex model.",
            "So what we see is that the variance just absolutely blows up and so basically it renders these estimates useless.",
            "And of course that's no surprise given the catastrophic failure in the mixing of the chain at the posterior.",
            "However, if we use some sort of parallel tempering or enter tempered distribution moves proposals, then we get much better control and the variance of the estimate of our our base factors, and we can.",
            "Now we can now use these and actually assessing the evidential support for a simple versus complex or complex versus simple oscillator."
        ],
        [
            "Apple.",
            "So we've got everything in place now.",
            "So what we want to do is use this methodology on nontrivial problem, and this is the problem here.",
            "So I spoke about the.",
            "This extracellular regulated kinase pathway.",
            "So one of my collaborators in Glasgow concert biologist studies this path be very carefully and as a proof of concept of employing statistical methodology within a systems biology context.",
            "We set about the task of trying to assess the evidential support in favor for a single or a jewel structured pathway model or pathway structure.",
            "And the way we did that is we defined.",
            "Systems of odies describing these pathways and then from experimental."
        ],
        [
            "ETA"
        ],
        [
            "We obtain the estimates of the integrated likelihoods.",
            "So there are of the order of about 25 coupled equations defining these models, and so we're talking about of the order of 50 to 55 kinetic parameters, so it's a large model.",
            "Now if we do some sensitivity analysis of this model, we find that there's quite a large number of these parameters where the Fisher information matrix is.",
            "It is not responsive at all, but nevertheless these are still large models and so very challenging in terms of estimating these integrated likelihoods.",
            "So there was one PhD student who conducted a series of experiments and measuring the levels of the activated kinese.",
            "After stimulation with this epidermal growth factor.",
            "And so so."
        ],
        [
            "Series of perturbation experiments were conducted, so in this case here.",
            "The sales where were stimulated by EGF and then the levels of support related work when measured overtime course."
        ],
        [
            "And then there was other stimulation with solista my."
        ],
        [
            "Eat and."
        ],
        [
            "Unknown it went."
        ],
        [
            "So essentially the whole pathway was."
        ],
        [
            "It was put out of component."
        ],
        [
            "The path we were told."
        ],
        [
            "This data was gathered."
        ],
        [
            "No, this data took."
        ],
        [
            "Just short of three years together.",
            "So running MCMC for a month isn't really going to hurt too much, which is what it took.",
            "But in any case we had this.",
            "We know how this experimental data."
        ],
        [
            "We employed this path sampling methodology and it's suggested that there was overwhelming support for a dual path structure now.",
            "I should also point out that there were other models that were considered.",
            "Anne.",
            "We are.",
            "There was explicit degradation at the receptor and so forth now.",
            "Let me just stress that this is primarily a proof of concept.",
            "Ann to win the confidence of biologists to for them to then go and do some experiments.",
            "You know, we had to to look at something which perhaps would seem obvious, but to gain the trust and the confidence of these collaborators, then this was what we tackled.",
            "And.",
            "What then followed?",
            "Was a series of experiments which were designed to test.",
            "Whether indeed.",
            "The evidential support based on the series of perturbation experiments that have been conducted where indeed strongly in favor of a dual path structure."
        ],
        [
            "So what was designed as a series of knockouts?",
            "So basically these two proteins are the jeans coding these two proteins where silence that were knocked down.",
            "And then the levels of the activated ehrke were measured.",
            "So.",
            "A few slow."
        ],
        [
            "Plus nights in my part once took a few months for these experiments to be conducted.",
            "Basically supported the prediction that indeed if we sort by knocking down grab.",
            "So in the left hand path, the labels of this active air dropped and likewise.",
            "When we knocked out the protein on the right hand side, the right hand path, the levels of air fail, and when they were both knocked out, then again the levels failed to basal levels and so this was additional evidence in support."
        ],
        [
            "Out of."
        ],
        [
            "The the Dual path hypothesis and the cancer biologists were extremely excited by this, that they now have a methodology which enables them to.",
            "To formalize their hypothesis about various structures about chemical structures with which they are studying, and a formal mathematical way.",
            "And then to further."
        ],
        [
            "Objectively assess."
        ],
        [
            "The existing evidential support for those."
        ],
        [
            "So let me conclude.",
            "By hopefully having convinced you know the estimating based fight does for models which are non trivial and exhibit feeling on trivial dynamics is extremely challenging.",
            "But we can."
        ],
        [
            "Obtain stable estimators using this sort of stratified path sampling strategy that I discussed."
        ],
        [
            "On indeed using something like parallel tempering or pile attempting type moves certainly improves things."
        ],
        [
            "And we've successfully demonstrated the utility of this methodology on this particular pathway, and there are a lot of excited cancer biologists up in Glasgow at the moment."
        ],
        [
            "Anne.",
            "And so."
        ],
        [
            "I think that's probably.",
            "At."
        ],
        [
            "I don't think you need to.",
            "And that's what we did at the end.",
            "We just we just said there was a power play function for each team, so we fix so.",
            "So given the resource is the computational resources that we have, we fixed the number of discrete T and then just define this power type function on them.",
            "Yeah.",
            "So that's not bad.",
            "Only 5 minutes overtime.",
            "In fact, you answered my question about the weather, was just wondering if you were able in the end to not convinced but bass biologist towards one of the models and to change their models based on numbers.",
            "Well I happens the model that biologists I'm working with.",
            "He favored the one that came out, so that's why he's in love with me now.",
            "But we are.",
            "We are also working.",
            "I have one PhD student who's working in models of securing control in plants where the structure of the controllers are actually different in different organs.",
            "So in the roots and shoots they're actually different, and they're the biologists.",
            "I'd actually looking for guidance rather than having firm topologies that are.",
            "Others.",
            "If you need to be characterized by two parameters instead of 1, like T yeah.",
            "Yeah, I mean if you look at gelman's so so so the main engagement paper of 98 actually discussed a very general case where you have multiple tempering type parameters.",
            "But for this case that there was no need."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for inviting me here.",
                    "label": 0
                },
                {
                    "sent": "I think I've struggled a bit with all the rich food than the wine and some of the beer that's been available, but it's been a really great workshop, so I'm the last hurdle really between.",
                    "label": 0
                },
                {
                    "sent": "You getting back home, so I'll try and be swift.",
                    "label": 0
                },
                {
                    "sent": "And so this fall is on pretty much from the the last talk, where we're really motivated in trying to assess the evidential support of mechanistic models or biochemical pathways as a means of engaging with biologists in terms of them assessing or designing the sort of experiments that they may wish to do next.",
                    "label": 0
                },
                {
                    "sent": "And a bit like are.",
                    "label": 0
                },
                {
                    "sent": "Billy Connolly joke.",
                    "label": 0
                },
                {
                    "sent": "I actually spend most of my time talking about the main problem which we faced, which was actually estimating the integrated likelihood of these system models, which are based on systems of nonlinear ODS.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "The motivation of the talk is basically going to be that we want to address certain open inferential issues which are large, have largely been ignored within systems biology.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And in particular, the two main things that we want to do our as has been discussed throughout this last three days, to be able to infer the sort of plausible range of parameter values of these sorts of ody based models of biochemical process is so these are parameters which typically refer to perhaps reaction rates, which are difficult or impossible to measure.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the other thing they'll question, and the one that's really going to form the basis of my talk, is to assess the evidential support for perhaps a set of plausable models of a particular biochemical process, which is which are under consideration, or perhaps competing mechanistic descriptions.",
                    "label": 1
                },
                {
                    "sent": "So these are the two inferential problems that we would like to address.",
                    "label": 0
                },
                {
                    "sent": "And in fact, what we end up doing here is describing our method for joy.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hopefully doing posterior inference or for the control engineers doing system identification and also the estimation of these factors based on estimates of the integrated or the marginal likelihoods.",
                    "label": 0
                },
                {
                    "sent": "Or the evidence of the models.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And the way that we're going to do that as we're going to employ are.",
                    "label": 0
                },
                {
                    "sent": "A stratified sampling strategy.",
                    "label": 0
                },
                {
                    "sent": "Of for estimating the thermodynamic integral, and there's lots of physicists in here, so you're more than familiar with what the thermodynamic integral is, and I'll discuss that.",
                    "label": 1
                },
                {
                    "sent": "Later on.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the talk and then after all of that, I'm going to get back to the main point, which is, as I said, doing this joint posterior inference and estimating based factors, and I'm going to give a fairly substantial example of an application of this inferential methodology to the extracellular regulated kinase signaling pathway are very well studied signaling pathway and one in which we have.",
                    "label": 0
                },
                {
                    "sent": "Some experimental validation which was quite nice, and then I'll conclude.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And somewhat swiftly so.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's a cartoon description of a.",
                    "label": 0
                },
                {
                    "sent": "And also later model which describes how the central Clock genes of a circadian control controller.",
                    "label": 0
                },
                {
                    "sent": "Basically define two interlocked feedback loops.",
                    "label": 0
                },
                {
                    "sent": "Oprah.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Use observations which essentially just sustained oscillations, and the trick here and system identification is that given there is sufficient evidence, sufficient biological knowledge to identify the various proteins and various connections associated with this.",
                    "label": 0
                },
                {
                    "sent": "Molecular circuit, can we then identify the unknown components?",
                    "label": 0
                },
                {
                    "sent": "So what is the rates of transcription?",
                    "label": 0
                },
                {
                    "sent": "You know how quickly do these these jeans transcribed?",
                    "label": 0
                },
                {
                    "sent": "What are their degradation rates and so forth?",
                    "label": 0
                },
                {
                    "sent": "So can we then flow identify the system from some experimental data?",
                    "label": 0
                },
                {
                    "sent": "Well, that's been largely discussed an I won't really dwell on that too.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In this talk.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But the problem that I am going to focus on is this one, and this is again another cartoon of the extracellular regulated kinase pathway, which my collaborators are working on.",
                    "label": 0
                },
                {
                    "sent": "And here is 1 example of a sort of mechanistic description of how the.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is the cell wall and then if there is some stimulation by epidermal growth factor then there is a whole cascade of reactions, right?",
                    "label": 0
                },
                {
                    "sent": "From the cell wall right into the nucleus where this protein, I'll just call it out.",
                    "label": 0
                },
                {
                    "sent": "From there one is activated, it becomes active, it's phosphorylated.",
                    "label": 0
                },
                {
                    "sent": "And again, there's plenty of evidence invested.",
                    "label": 0
                },
                {
                    "sent": "Interest to suggest that there is a single path we like this, which mediates the stimulation the extracellular stimulation.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Let us, however, another school of thought that would say well in actual fight there are due paths from the receptors mediated by additional proteins in the activation of Erk.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And there's even other hypothesis and again, evidence to perhaps give support to the hypothesis that in actual fact there is cross coupling between other pathways and this particular path here.",
                    "label": 0
                },
                {
                    "sent": "So in actual fact we don't have a sort of linear pathway as such, but we have a sort of cross coupled cross coupling between other pathways.",
                    "label": 0
                },
                {
                    "sent": "And the key question that we would like to be able to do is is given experimental.",
                    "label": 0
                },
                {
                    "sent": "They found observation.",
                    "label": 0
                },
                {
                    "sent": "Can we then objectively assess what the levels of evidential support time for these varying hypothesis?",
                    "label": 0
                },
                {
                    "sent": "And can they then be used in a productive manner in terms of defining additional experiments and so forth to further refine or fill in the gaps of the biological knowledge about the biochemical mechanisms?",
                    "label": 0
                },
                {
                    "sent": "At play.",
                    "label": 0
                },
                {
                    "sent": "Right so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I guess I can skip through this.",
                    "label": 0
                },
                {
                    "sent": "This is more for biologists, but basically we're going to employ statistical inferential methodology to one get posterior distributions over the parameters of the model and those once we've defined the posterior distributions over the parameters, then we can use those posteriors.",
                    "label": 0
                },
                {
                    "sent": "If we employ the models as simulators with forward simulators.",
                    "label": 0
                },
                {
                    "sent": "Now if we want to do some sort of global sensitivity analysis.",
                    "label": 0
                },
                {
                    "sent": "And of course, the what I'm going to focus on for the remainder of the talk is to actually be able to objectively compare alternatives, descriptions of the systems and therefore assess the validity of the underlying working hypothesis.",
                    "label": 1
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So how do we do that?",
                    "label": 0
                },
                {
                    "sent": "Well, we use Bayes factors.",
                    "label": 1
                },
                {
                    "sent": "We need to obtain.",
                    "label": 0
                },
                {
                    "sent": "The posterior odds, given two hypothesis which are represented by two particular to two distinct models, it doesn't have to be nested.",
                    "label": 1
                },
                {
                    "sent": "Of course with parameter sets, associated sets of parameters and we have observations, so we would employ the posterior odds.",
                    "label": 1
                },
                {
                    "sent": "Test the weight of evidence, as it were in favor of hypothesis one.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is the key measure that's required here?",
                    "label": 0
                },
                {
                    "sent": "As the integrated likelihood and a lot of people have spoken about the evidence, the marginal likelihood, the integrated likelihood, and primarily focused on getting lower bound approximations to it, well, I'm going to focus on actually obtaining estimates of this measure here.",
                    "label": 1
                },
                {
                    "sent": "See why it's actually quite important.",
                    "label": 0
                },
                {
                    "sent": "To get good estimates.",
                    "label": 0
                },
                {
                    "sent": "And, um.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Yeah, and certainly in terms of the statistics community, there have been a fair few PHD's produced Justin trying to devise estimators of this measure, and there still is an awful lot of methodological effort involved in trying to get efficient estimators of this measure.",
                    "label": 1
                },
                {
                    "sent": "So let's go back to statistics course 101.",
                    "label": 0
                },
                {
                    "sent": "And how would we estimate this?",
                    "label": 0
                },
                {
                    "sent": "Well, we could use a Monte Carlo estimator.",
                    "label": 1
                },
                {
                    "sent": "We would just draw samples from the prior.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so we know if we drawn off samples then.",
                    "label": 0
                },
                {
                    "sent": "This this finite sample estimate will converge to the integrated likelihood, but we all know that this is a very poor or very inefficient estimator, especially if there's a large mismatch between the prior and visions of.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "High likelihood.",
                    "label": 0
                },
                {
                    "sent": "So to get round this inefficiency of sampling, one approach is to employ important sampling, and again I don't need to go over what put that is for this audience, but a very common important sample that's used in obtaining estimates of integrated likelihood is where we employ for our importance distribution.",
                    "label": 1
                },
                {
                    "sent": "We employ them.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Posterior over the parameters Theta.",
                    "label": 1
                },
                {
                    "sent": "And of course, what we end up with Then's are basically the harmonic mean estimator of the integrated likelihood, and again, this is very popular primarily because if you're running a Markov chain, if you're running MCMC simulations, then the outputs of your.",
                    "label": 0
                },
                {
                    "sent": "Your sampler can then be used to to obtain an estimate of the integrated likelihood.",
                    "label": 1
                },
                {
                    "sent": "And this by and large, gets round the inefficiency of sampling from the prior because no oversampling from a distribution which is much more concentrated in regions of high density.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, well is just to test this, I'm going to.",
                    "label": 0
                },
                {
                    "sent": "Use a very simple linear regression model.",
                    "label": 0
                },
                {
                    "sent": "And I'm going to use the linear regression model just to show to demonstrate some of the problems associated with the estimators such as these here.",
                    "label": 0
                },
                {
                    "sent": "So this is just a standard linear expansion of the set of basis functions.",
                    "label": 0
                },
                {
                    "sent": "We have some error term which is normally distributed with some variance.",
                    "label": 0
                },
                {
                    "sent": "We put a prior distribution on the regression coefficients, which is normal again with a 0 mean and some.",
                    "label": 0
                },
                {
                    "sent": "Some variance and of course our posterior over the coefficients model parameters admits a closed form.",
                    "label": 0
                },
                {
                    "sent": "I'm indeed.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We also get an analytic form for the marginal likelihood, so I'm going to use these and assessing how good certain estimators are.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what we will do is we will draw 30 sample points, each one of these samples is devised by having a number of different variants ranging from 2 covariance up to 20.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then realized to meet the marginal likelihood so.",
                    "label": 0
                },
                {
                    "sent": "If we use 100 samples 1000 and then up to 100,000 samples from our sampling distribution to get our estimate.",
                    "label": 0
                },
                {
                    "sent": "So if we sample from the prior, here are the analytic values of integrated likelihood, and here are estimates, and as we would expect, by the time we get to that six covariates, the sampling from the prior starts to keel over at rather small values of rather large values of samples join from the prior.",
                    "label": 0
                },
                {
                    "sent": "Of course this is exact sampling because we're drawing from this ghost.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If we then use the.",
                    "label": 0
                },
                {
                    "sent": "The harmonic mean estimator.",
                    "label": 0
                },
                {
                    "sent": "So again we use exact sampling from our analytic posterior.",
                    "label": 0
                },
                {
                    "sent": "Then we see that the variance is controlled a lot better.",
                    "label": 0
                },
                {
                    "sent": "But one of the rather startling things, and rather concerning, is that we get a consistent overestimation.",
                    "label": 0
                },
                {
                    "sent": "Quite consistent bias and a finite sample estimate.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, is this a big problem?",
                    "label": 0
                },
                {
                    "sent": "Well, let me show that it is especially want if we're going to use the integrated likelihood to do some sort of reasoning over model plausible models.",
                    "label": 0
                },
                {
                    "sent": "OK, so we know that the sampling from the prior feels catastrophic.",
                    "label": 0
                },
                {
                    "sent": "Lee.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Certainly sampling from the posterior is is far superior, but there is this somewhat worrying over estimation of the log marginal, and this is actually.",
                    "label": 1
                },
                {
                    "sent": "This is actually some of the surprise to statisticians.",
                    "label": 0
                },
                {
                    "sent": "So anyway.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's again just to run this point, whom Father?",
                    "label": 0
                },
                {
                    "sent": "Let's just consider a nested model here, so we have a linear model and then one with a quadratic effect.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And I'll generate data from the first model from the linear model.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then I'll compute the base factors.",
                    "label": 0
                },
                {
                    "sent": "I will estimate the base factors by sampling from the posterior so the analytic value of the base factor is.",
                    "label": 0
                },
                {
                    "sent": "Just under 30.",
                    "label": 0
                },
                {
                    "sent": "So in terms of Jefferies tariff for the levels of evidence, then suggest that there is strong evidence in favor of a linear response model.",
                    "label": 0
                },
                {
                    "sent": "However our samples.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But by employing the posterior harmonic mean estimator, then we massively underestimate the base factor for such an extent that an actual fact it would suggest.",
                    "label": 0
                },
                {
                    "sent": "But the evidence is not really worth more than a beer mentioned, so this is somewhat concerning and ensures that we really do.",
                    "label": 0
                },
                {
                    "sent": "If we're going to be using Bayes factors and our estimates of integrated likelihoods to reason about models which are on the table for consideration, then we need to take a little bit more care.",
                    "label": 0
                },
                {
                    "sent": "As we will know, try and.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do.",
                    "label": 0
                },
                {
                    "sent": "I can't remember what time I started talking.",
                    "label": 0
                },
                {
                    "sent": "New right alright?",
                    "label": 0
                },
                {
                    "sent": "So OK, OK, just in case I get too crowded with myself, right?",
                    "label": 0
                },
                {
                    "sent": "So the harmonic mean estimator for even a very simple linear and quadratic nested models.",
                    "label": 0
                },
                {
                    "sent": "We can't really trust it.",
                    "label": 0
                },
                {
                    "sent": "So when we come to these more complex dynamic models defined by systems of nonlinear differential equations, then the problem gets much harder.",
                    "label": 0
                },
                {
                    "sent": "So we need to try and address this this issue here.",
                    "label": 0
                },
                {
                    "sent": "No roughton.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Way to to try and get round this or getting the problem with the.",
                    "label": 0
                },
                {
                    "sent": "Harmonic mean estimator suggested our mixture distribution, where you sampled from the prior and you also sampled from the posterior.",
                    "label": 1
                },
                {
                    "sent": "So you had a mixture.",
                    "label": 0
                },
                {
                    "sent": "Mixture or proposal distribution, which is basically a certain important distribution, which is basically a mixture between the prior and the posterior and that was suggested to try and stabilize this.",
                    "label": 0
                },
                {
                    "sent": "Estimator well, if we're going to be sampling, which of course is the distribution we want from the posterior from the prior, but also trying to use the efficiency of the posterior, then it would make sense rather than to have two finite points, one at the prior and one at the posterior, is to use the full path of distributions between the prior and the posterior, as was proposed by Gelman and Main over 10 years ago.",
                    "label": 0
                },
                {
                    "sent": "When the suggested, this whole notion of path sampling and of course path sampling comes from the statistical physics community which Manford and you chaps all know about where we employ a path and in this case we will devise.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A path from the prior to the posterior and integrate overlap.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we would hope that this would give us a more stable.",
                    "label": 0
                },
                {
                    "sent": "Estimate of the marginal likelihood.",
                    "label": 0
                },
                {
                    "sent": "OK, I'm going to be quite specific.",
                    "label": 0
                },
                {
                    "sent": "Rather than being general here, I'm going to define the posterior distribution.",
                    "label": 0
                },
                {
                    "sent": "So this is like a tempered posterior distribution where I've used an aux variable T inverse temperature.",
                    "label": 0
                },
                {
                    "sent": "As we all know.",
                    "label": 0
                },
                {
                    "sent": "And I'm using that to two and you if you will, to temper the likelihood.",
                    "label": 0
                },
                {
                    "sent": "So this accelerated variable then define our path becausw.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tis Zero, and of course zed T is going to be one and we just recover the prior when we get to the extreme end, which he is.",
                    "label": 0
                },
                {
                    "sent": "1 then of course, this pen put posterior then just we just recover the standard posterior.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And some.",
                    "label": 0
                },
                {
                    "sent": "Six form calculus by taking derivatives of the log partition function.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And integrating we end up with the standard form of the thermodynamic integral where we've defined a path that this sort of path here.",
                    "label": 1
                },
                {
                    "sent": "So we represent the log of the integrated likelihood as the.",
                    "label": 0
                },
                {
                    "sent": "This sort of path integral over.",
                    "label": 1
                },
                {
                    "sent": "The expectations of the log of the likelihood with respect to these pampered posteriors defined along a path from zero to 1.",
                    "label": 0
                },
                {
                    "sent": "So task now is to estimate this in some way.",
                    "label": 0
                },
                {
                    "sent": "Well, that's fairly straightforward.",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And introduce a sampling distribution for the.",
                    "label": 0
                },
                {
                    "sent": "In the executive variable T.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Undam all that we need to do now is just.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obtain a Monte Carlo estimate.",
                    "label": 0
                },
                {
                    "sent": "For this this integral where.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It appears theater, S and TS are drawing from the joint posterior.",
                    "label": 0
                },
                {
                    "sent": "And that's fairly straightforward to do.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Do we can do that just fine?",
                    "label": 0
                },
                {
                    "sent": "Rockless sampler",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Where we have acceptance issues for the parameters and for the.",
                    "label": 0
                },
                {
                    "sent": "The inverse temperatures.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so here are the Hastings ratios, so our acceptance problem.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eletise for proposed parameters falls fairly straightforwardly, no problem.",
                    "label": 0
                },
                {
                    "sent": "We can do that.",
                    "label": 0
                },
                {
                    "sent": "The acceptance probabilities for the.",
                    "label": 0
                },
                {
                    "sent": "Inverse temperatures, on the other hand, we had this problem here and we saw this previously and one of the talks we have this ratio of these normalizing constants for the for those annealed posteriors.",
                    "label": 0
                },
                {
                    "sent": "So we've got a bit of a problem and that our sampling from our joint posterior we hit this problem.",
                    "label": 0
                },
                {
                    "sent": "This is a well known problem.",
                    "label": 0
                },
                {
                    "sent": "And has been addressed or or attempts to address have been made over the past 15 years or so.",
                    "label": 0
                },
                {
                    "sent": "And fight the weather.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We tried to to address this problem was using the data augmentation methods of Mueller, and indeed someone also spoke about the approximate MCMC methods without likelihoods of Marjoram and Co, and more recently of people like Ian Murray.",
                    "label": 1
                },
                {
                    "sent": "Have looked at these sort of problem.",
                    "label": 0
                },
                {
                    "sent": "The reality was that it did not provide a useful solution, especially for the scale of the problems that we are looking at so.",
                    "label": 0
                },
                {
                    "sent": "We know and have to consider.",
                    "label": 0
                },
                {
                    "sent": "Another another way of addressing this, and the way that we have to do this is we have to discretize.",
                    "label": 0
                },
                {
                    "sent": "So we need to somehow take this this path over zero and one.",
                    "label": 0
                },
                {
                    "sent": "Discretize it in some way, no.",
                    "label": 0
                },
                {
                    "sent": "I'm actually going to make sure that there's virtue in actually making.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A discrete estimate or approximation.",
                    "label": 0
                },
                {
                    "sent": "If I just assume that the distribution over T is uniform on the support zero and one, then the variance of our estimator.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the one that we can't this one here.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The variance of this.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Estimator.",
                    "label": 0
                },
                {
                    "sent": "Will just follow as the variance of the log of the likelihood over theater and over T.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I then.",
                    "label": 0
                },
                {
                    "sent": "Discretize the unit line.",
                    "label": 0
                },
                {
                    "sent": "So I I stratify into number of subintervals, so call DN.",
                    "label": 0
                },
                {
                    "sent": "And within each of these DN I make a number of draws.",
                    "label": 0
                },
                {
                    "sent": "Right from the start, so number of draws of T. With some sampling distribution, which we'll talk about shortly.",
                    "label": 0
                },
                {
                    "sent": "And then, given that we've drawn a sample.",
                    "label": 0
                },
                {
                    "sent": "From one of these strata we then draw a sample of the model parameters from the tempered posterior.",
                    "label": 0
                },
                {
                    "sent": "And we can then use those.",
                    "label": 0
                },
                {
                    "sent": "Plug Lumentum I want to.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Carlo estimater and if in particular I define these sampling distributions within the strata to be uniform, then the variance of this estimator here well follows in a standard way.",
                    "label": 0
                },
                {
                    "sent": "Now the key point here is that if I link the variance of the estimator with the variance of the estimator.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And some sort of stratified sampling strategy.",
                    "label": 0
                },
                {
                    "sent": "Then it's fairly straightforward to show, and it's a standard result in the Monte Carlo literature that the variance of the stratified estimator will certainly be never larger than the variance of of the original estimator.",
                    "label": 1
                },
                {
                    "sent": "So in actual fact, by discretizing we may well have an estimator which has a much lower variance, so much we have an improved estimator.",
                    "label": 0
                },
                {
                    "sent": "Of integrated likelihood.",
                    "label": 0
                },
                {
                    "sent": "So this is a this is a good thing.",
                    "label": 0
                },
                {
                    "sent": "No, so that means FI.",
                    "label": 1
                },
                {
                    "sent": "Again, have a uniform sampling distribution in each of the finite strata.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Then I can write the log of the integrated likelihood as a discrete sum over the strata of these conditional expectations, which week?",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nice to meet and a fairly standard way.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An no.",
                    "label": 0
                },
                {
                    "sent": "So what this means is that we set up a path.",
                    "label": 0
                },
                {
                    "sent": "And then we just randomly sample.",
                    "label": 0
                },
                {
                    "sent": "A temperature and then our parameter and then move up the strata.",
                    "label": 0
                },
                {
                    "sent": "Now of course there are other non equilibrium based methods such as annealed, importance sampling or even sequential Monte Carlo methods here.",
                    "label": 0
                },
                {
                    "sent": "Of course, because we're relying on on average.",
                    "label": 0
                },
                {
                    "sent": "Monte Carlo estimates, then, of course, our sampling chains have to converge to the state the desired stationary distribution, which in this case would be whatever the.",
                    "label": 0
                },
                {
                    "sent": "Tempered posterior happens to be.",
                    "label": 0
                },
                {
                    "sent": "No um.",
                    "label": 0
                },
                {
                    "sent": "If you go to the limiting case where we've defined our strata T, N -- 1 and TN, and rather than sampling in there, we just take two points.",
                    "label": 0
                },
                {
                    "sent": "T N -- 1 and TN and use those to obtain.",
                    "label": 0
                },
                {
                    "sent": "A crude approximation to this expectation here.",
                    "label": 0
                },
                {
                    "sent": "Then what we end up with.",
                    "label": 0
                },
                {
                    "sent": "Basically, the trapezoidal approximation of the integral over the path, and this is actually being proposed just recently and RSSB Royal Statistical Society series be paper by now.",
                    "label": 0
                },
                {
                    "sent": "If you and Tony Pettit, and previously bilateral Owen Philippe where they were.",
                    "label": 0
                },
                {
                    "sent": "Largely interested in Phylogenetic's fellow genetic trees.",
                    "label": 0
                },
                {
                    "sent": "So of course this is known approximation, right?",
                    "label": 0
                },
                {
                    "sent": "So there's going to be some bias in here, and it would be useful if you could characterize what that bias would be.",
                    "label": 0
                },
                {
                    "sent": "Well, it's fairly straightforward.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "To show that we can define a lower bound so we we can describe the log of the integrated likelihood in terms of a lower bound.",
                    "label": 0
                },
                {
                    "sent": "On a bias term where this biased term is basically just the kullback Leibler divergent between the two.",
                    "label": 0
                },
                {
                    "sent": "Penn put posteriors at T, N -- 1 and at TN.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "We obtain these power expectations.",
                    "label": 0
                },
                {
                    "sent": "These tempered expectations of the log likelihood sum them all up over all the discrete points in the path and then add this biased him.",
                    "label": 0
                },
                {
                    "sent": "So this define.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is a lower bound.",
                    "label": 0
                },
                {
                    "sent": "Likewise, we can do the same and define an upper bound.",
                    "label": 0
                },
                {
                    "sent": "And again, we find that the bias is now the opposite form of the KL divergent of those tempered posteriors.",
                    "label": 0
                },
                {
                    "sent": "So of course that means that we.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then write the tapiz eudell integral.",
                    "label": 0
                },
                {
                    "sent": "And we define the bias of the error as basically the difference caused by the symmetry of the KL divergent between these two tempered posteriors.",
                    "label": 0
                },
                {
                    "sent": "Now, this may well be.",
                    "label": 0
                },
                {
                    "sent": "Takes big stuff for statistical physicists.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure, but it's quite a useful tool for yes.",
                    "label": 0
                },
                {
                    "sent": "These quantities will not be very smooth, so.",
                    "label": 0
                },
                {
                    "sent": "What quantities?",
                    "label": 0
                },
                {
                    "sent": "Yeah the when you see smooth you will see exactly.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "And overtime so you could use a higher integration routine or something.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, sure that could be done.",
                    "label": 0
                },
                {
                    "sent": "So what's the?",
                    "label": 0
                },
                {
                    "sent": "If you have phase transitions then right so OK so so that's an interesting question and fight at phase transitions.",
                    "label": 0
                },
                {
                    "sent": "So examples that I have worked on I haven't seen anything like this and last week talking with anybody he could only suggest one sort of pathological phase transition that would cause cause problems so.",
                    "label": 0
                },
                {
                    "sent": "Anyway, so so clearly now then what we want to do is we want to define this sort of stratification out of the discretization in such a way that we can control this bias here.",
                    "label": 0
                },
                {
                    "sent": "Well, an actual fight for we can do.",
                    "label": 0
                },
                {
                    "sent": "It's fairly straightforward.",
                    "label": 0
                },
                {
                    "sent": "We can get the optimal sampling distribution for T in terms of minimizing the variance of the overall estimator.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And of course, it turns out to be the sampling distribution for T will be proportional to.",
                    "label": 0
                },
                {
                    "sent": "The variance of the posterior variance of the log likelihood at that particular inverse temperature.",
                    "label": 0
                },
                {
                    "sent": "Now if I go back to the linear regression model.",
                    "label": 1
                },
                {
                    "sent": "We cannot.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Actually, after some excruciating algebra, we can actually get an analytic form for the optimal sampling distribution for the optimal path.",
                    "label": 0
                },
                {
                    "sent": "For the linear regression model, and if we actually.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Look at that.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So here is the.",
                    "label": 0
                },
                {
                    "sent": "P of T on support zero and one.",
                    "label": 0
                },
                {
                    "sent": "Which would give you the the minimum variance estimator.",
                    "label": 0
                },
                {
                    "sent": "Now what you can see is that so in terms of.",
                    "label": 0
                },
                {
                    "sent": "Discretization would have very very small strata here and then.",
                    "label": 0
                },
                {
                    "sent": "We will as we start to approach the posterior strategy within start become larger.",
                    "label": 0
                },
                {
                    "sent": "OK, on this holds for, so this was a prior distribution which was extremely diffuse and then as we start to tighten up the prior distribution we can see that this sampling density is still fairly well skewed towards the prior.",
                    "label": 0
                },
                {
                    "sent": "So in other words, we've got a strategy for.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Defining our sequence of Delta ends of sequence of blank, the width of the strata.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And even just as our throwaway remark, if we were to.",
                    "label": 0
                },
                {
                    "sent": "To split this into uniform segments and then raise each of those to the power of 5.",
                    "label": 0
                },
                {
                    "sent": "Then we end up with something that looks like like this here.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we've now got a means of defining what the optimal.",
                    "label": 0
                },
                {
                    "sent": "Our path sampling strategy is and here's an example here, where we've used discretization, which follows a sort of.",
                    "label": 0
                },
                {
                    "sent": "Distribution.",
                    "label": 0
                },
                {
                    "sent": "So here's a again, a linear regression model with two covariates, and this is one with twenty covariance.",
                    "label": 0
                },
                {
                    "sent": "Sorry, that'll be around 2 covariates, 20 covariates.",
                    "label": 0
                },
                {
                    "sent": "So here's the approach that trapezoidal approximation and these are the upper and lower bounds, and this is the analytic value, and you can see that by the time we've used about 50 strata, then you know we've got a pretty good estimate.",
                    "label": 1
                },
                {
                    "sent": "I've got pretty good approximation.",
                    "label": 0
                },
                {
                    "sent": "Of course, I'm not taking into account the Monte Carlo errors associated with obtaining his expectations, but I'll discuss those shortly.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I use a uniform.",
                    "label": 0
                },
                {
                    "sent": "Partitioning, then you see that the variance.",
                    "label": 0
                },
                {
                    "sent": "Is really huge in comparison.",
                    "label": 0
                },
                {
                    "sent": "To this here.",
                    "label": 0
                },
                {
                    "sent": "So the bias is.",
                    "label": 0
                },
                {
                    "sent": "Not well controlled at all.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, just two.",
                    "label": 0
                },
                {
                    "sent": "Finalize on this part.",
                    "label": 0
                },
                {
                    "sent": "Again, with a linear regression model, we can see that as the number of samples increases, sampling from the prior gets better, but it's pretty poor.",
                    "label": 0
                },
                {
                    "sent": "The posterior, on the other hand, sampling the posterior.",
                    "label": 0
                },
                {
                    "sent": "The variance is pretty well controlled, but we still have this systematic bias.",
                    "label": 0
                },
                {
                    "sent": "And if we use the stratified path sampling strategy that we just discussed here.",
                    "label": 0
                },
                {
                    "sent": "We then see we really have variable bias and low variance estimates of these of the integrated likelihood.",
                    "label": 0
                },
                {
                    "sent": "And competing that with the bias associated with sampling from the posterior, you can see it's quite quite significant.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And so if we then use those estimates of the integrated likelihood and obtaining our base factors for the nested models that we I presented before, we now see that the base fact the estimate of the base factor is at the level that we would.",
                    "label": 0
                },
                {
                    "sent": "I would expect so we would know.",
                    "label": 0
                },
                {
                    "sent": "See that as indeed strong evidence and support about a linear effects model.",
                    "label": 0
                },
                {
                    "sent": "OK, so we've.",
                    "label": 0
                },
                {
                    "sent": "We now have a stratified.",
                    "label": 0
                },
                {
                    "sent": "Stratification strategy, which allows us to get a good low variance, low bias estimate of our integrated likelihood.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we want to turn our attention onto some of the more realistic models that we're going to be considering.",
                    "label": 0
                },
                {
                    "sent": "And here is an example here.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So this was a model that was proposed in the 50s by English biologist to describe circadian control of certain enzymes, and there's plenty of engineers and physicists.",
                    "label": 0
                },
                {
                    "sent": "And here we can see that this is just a feedback loop, so this protein inhibits the production of the same RNA and for certain values of inhibition and activation rates we get sustained oscillations.",
                    "label": 0
                },
                {
                    "sent": "OK so very simple system.",
                    "label": 0
                },
                {
                    "sent": "If I just take the most basic system where there is only one intermediate protein before we inhabit the M RNA of the Clock gene.",
                    "label": 0
                },
                {
                    "sent": "And I look.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The likelihood surface.",
                    "label": 0
                },
                {
                    "sent": "Then we get something that looks like this.",
                    "label": 0
                },
                {
                    "sent": "So what we see is that for these two parameters you can see an extremely strong peak at the true values.",
                    "label": 0
                },
                {
                    "sent": "But we also see are a large number of areas in parameter space which have fairly high likelihood.",
                    "label": 0
                },
                {
                    "sent": "And actually, it's quite interesting for the mathematicians amongst you.",
                    "label": 0
                },
                {
                    "sent": "Be aware that you can solve that system and there are certain combinations of parameters which would give you the same phase and the same amplitude of oscillation and hence the reason you have these.",
                    "label": 0
                },
                {
                    "sent": "He sorts of our covers in the the likelihood surface.",
                    "label": 0
                },
                {
                    "sent": "Now this is a big deal.",
                    "label": 0
                },
                {
                    "sent": "If I.",
                    "label": 0
                },
                {
                    "sent": "If I was just to then use this.",
                    "label": 0
                },
                {
                    "sent": "Path sampling method to estimate my marginal likelihood.",
                    "label": 0
                },
                {
                    "sent": "For this particular model, well, let's just run Metropolis and let's look.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The posteriors that we get.",
                    "label": 0
                },
                {
                    "sent": "So here are the March estimates of the marginal posterius for and also later model.",
                    "label": 0
                },
                {
                    "sent": "Is here.",
                    "label": 0
                },
                {
                    "sent": "Here's the true parameter values that were used to generate the observations, and you can see that they are hopelessly biased and so that the chain really mixed very poorly, and if I.",
                    "label": 0
                },
                {
                    "sent": "Just bear with me.",
                    "label": 0
                },
                {
                    "sent": "I'll be a bus come up top.",
                    "label": 0
                },
                {
                    "sent": "It should come up in a second.",
                    "label": 0
                },
                {
                    "sent": "Just tell.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Straight.",
                    "label": 0
                },
                {
                    "sent": "So here is the posterior.",
                    "label": 0
                },
                {
                    "sent": "Just on those two parameters I showed you.",
                    "label": 0
                },
                {
                    "sent": "And here are the paths of 20.",
                    "label": 0
                },
                {
                    "sent": "Metropolis samples and you can see the mixing.",
                    "label": 0
                },
                {
                    "sent": "Well, there is no mixing and we get real catastrophic failure.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "We've already got a problem here.",
                    "label": 0
                },
                {
                    "sent": "When we start consider.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "These non trivial.",
                    "label": 0
                },
                {
                    "sent": "Or the style models with fairly interesting dynamic.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now, of course we're relying on.",
                    "label": 0
                },
                {
                    "sent": "Sampling from these tempered posteriors to get the expectations that we require for our estimate of the integrated likelihood.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So again, if I.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sure, what we've got here is the path from the prior.",
                    "label": 0
                },
                {
                    "sent": "So in this case it's a product of two gamma distributions.",
                    "label": 0
                },
                {
                    "sent": "So at T = 0, The bottom.",
                    "label": 1
                },
                {
                    "sent": "We've got this very, very smooth surface.",
                    "label": 0
                },
                {
                    "sent": "And then of course as we start to increase the value of T. We get these ripples and then the peak of the posterior starting to appear as we get to the posterior.",
                    "label": 0
                },
                {
                    "sent": "So we've generated this ladder and we have all of these tempered distributions.",
                    "label": 0
                },
                {
                    "sent": "Now, of course, to get round the problem of poor mixing for such a rough likelihood surface like this, we can employ methods such as parallel tempering those if you're not familiar with parallel tempering, we in essence would devise a temperature ladder from some base distribution.",
                    "label": 0
                },
                {
                    "sent": "In this case, the prior up to our target distribution, which would be our posterior.",
                    "label": 0
                },
                {
                    "sent": "And if we define the target distribution station distribution as the product of all of these, then it allows us to propose moves, parameter moves.",
                    "label": 0
                },
                {
                    "sent": "Between these pampered posteriors.",
                    "label": 0
                },
                {
                    "sent": "And so things like parallel tampering or pop.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Elation MCMC get around the problem of the poor mixing up at the posterior right by allowing very free moves down at.",
                    "label": 0
                },
                {
                    "sent": "So for example, down at the prior.",
                    "label": 0
                },
                {
                    "sent": "And then we start to be able to explore more globally the sort of local structure of the posterior surface.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now again, if you think about the same as dynamic integral, we've had to define these particular temperatures.",
                    "label": 0
                },
                {
                    "sent": "These particular distributions we then sample from these and then use Monte Carlo estimates to get the expectations under each of these of log likelihood.",
                    "label": 0
                },
                {
                    "sent": "And then we stitch them together.",
                    "label": 0
                },
                {
                    "sent": "So now what we can actually do is we can use this sequence of annealed or tempered distributions and have proposal distribution proposal moves between the tempered distributions to improve the mixing into.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Around that problem, and so if we do that.",
                    "label": 0
                },
                {
                    "sent": "No, we we see that are marginal posteriors of buying or in the true values, so we're getting good mixing and good coverage of the the push.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Sterea now.",
                    "label": 0
                },
                {
                    "sent": "Let's get to the start to get to the sort of point of the talk.",
                    "label": 0
                },
                {
                    "sent": "So here are two examples of this oscillator model.",
                    "label": 0
                },
                {
                    "sent": "One where there is only one intermediate.",
                    "label": 0
                },
                {
                    "sent": "Protein and another one where there are two.",
                    "label": 0
                },
                {
                    "sent": "So we've got this kind of extended delay.",
                    "label": 0
                },
                {
                    "sent": "You have to go.",
                    "label": 0
                },
                {
                    "sent": "So what we'll do is we'll generate simulate from this one, compute the base factors, and then simulate from this one and compute the base factors and so.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now if we just use Standard Metropolis sampling from each of the tempered.",
                    "label": 0
                },
                {
                    "sent": "Posterius then if we look at the estimate of the log of the base factor where we're based factors relative sort of testing the simple model against the complex model.",
                    "label": 0
                },
                {
                    "sent": "So what we see is that the variance just absolutely blows up and so basically it renders these estimates useless.",
                    "label": 0
                },
                {
                    "sent": "And of course that's no surprise given the catastrophic failure in the mixing of the chain at the posterior.",
                    "label": 0
                },
                {
                    "sent": "However, if we use some sort of parallel tempering or enter tempered distribution moves proposals, then we get much better control and the variance of the estimate of our our base factors, and we can.",
                    "label": 0
                },
                {
                    "sent": "Now we can now use these and actually assessing the evidential support for a simple versus complex or complex versus simple oscillator.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Apple.",
                    "label": 0
                },
                {
                    "sent": "So we've got everything in place now.",
                    "label": 0
                },
                {
                    "sent": "So what we want to do is use this methodology on nontrivial problem, and this is the problem here.",
                    "label": 0
                },
                {
                    "sent": "So I spoke about the.",
                    "label": 0
                },
                {
                    "sent": "This extracellular regulated kinase pathway.",
                    "label": 0
                },
                {
                    "sent": "So one of my collaborators in Glasgow concert biologist studies this path be very carefully and as a proof of concept of employing statistical methodology within a systems biology context.",
                    "label": 0
                },
                {
                    "sent": "We set about the task of trying to assess the evidential support in favor for a single or a jewel structured pathway model or pathway structure.",
                    "label": 0
                },
                {
                    "sent": "And the way we did that is we defined.",
                    "label": 0
                },
                {
                    "sent": "Systems of odies describing these pathways and then from experimental.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "ETA",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We obtain the estimates of the integrated likelihoods.",
                    "label": 0
                },
                {
                    "sent": "So there are of the order of about 25 coupled equations defining these models, and so we're talking about of the order of 50 to 55 kinetic parameters, so it's a large model.",
                    "label": 1
                },
                {
                    "sent": "Now if we do some sensitivity analysis of this model, we find that there's quite a large number of these parameters where the Fisher information matrix is.",
                    "label": 0
                },
                {
                    "sent": "It is not responsive at all, but nevertheless these are still large models and so very challenging in terms of estimating these integrated likelihoods.",
                    "label": 0
                },
                {
                    "sent": "So there was one PhD student who conducted a series of experiments and measuring the levels of the activated kinese.",
                    "label": 0
                },
                {
                    "sent": "After stimulation with this epidermal growth factor.",
                    "label": 0
                },
                {
                    "sent": "And so so.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Series of perturbation experiments were conducted, so in this case here.",
                    "label": 0
                },
                {
                    "sent": "The sales where were stimulated by EGF and then the levels of support related work when measured overtime course.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And then there was other stimulation with solista my.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Eat and.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Unknown it went.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So essentially the whole pathway was.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It was put out of component.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The path we were told.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This data was gathered.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_99": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No, this data took.",
                    "label": 0
                }
            ]
        },
        "clip_100": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just short of three years together.",
                    "label": 0
                },
                {
                    "sent": "So running MCMC for a month isn't really going to hurt too much, which is what it took.",
                    "label": 0
                },
                {
                    "sent": "But in any case we had this.",
                    "label": 0
                },
                {
                    "sent": "We know how this experimental data.",
                    "label": 0
                }
            ]
        },
        "clip_101": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We employed this path sampling methodology and it's suggested that there was overwhelming support for a dual path structure now.",
                    "label": 0
                },
                {
                    "sent": "I should also point out that there were other models that were considered.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "We are.",
                    "label": 0
                },
                {
                    "sent": "There was explicit degradation at the receptor and so forth now.",
                    "label": 0
                },
                {
                    "sent": "Let me just stress that this is primarily a proof of concept.",
                    "label": 0
                },
                {
                    "sent": "Ann to win the confidence of biologists to for them to then go and do some experiments.",
                    "label": 0
                },
                {
                    "sent": "You know, we had to to look at something which perhaps would seem obvious, but to gain the trust and the confidence of these collaborators, then this was what we tackled.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "What then followed?",
                    "label": 0
                },
                {
                    "sent": "Was a series of experiments which were designed to test.",
                    "label": 0
                },
                {
                    "sent": "Whether indeed.",
                    "label": 0
                },
                {
                    "sent": "The evidential support based on the series of perturbation experiments that have been conducted where indeed strongly in favor of a dual path structure.",
                    "label": 0
                }
            ]
        },
        "clip_102": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So what was designed as a series of knockouts?",
                    "label": 0
                },
                {
                    "sent": "So basically these two proteins are the jeans coding these two proteins where silence that were knocked down.",
                    "label": 0
                },
                {
                    "sent": "And then the levels of the activated ehrke were measured.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "A few slow.",
                    "label": 0
                }
            ]
        },
        "clip_103": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Plus nights in my part once took a few months for these experiments to be conducted.",
                    "label": 0
                },
                {
                    "sent": "Basically supported the prediction that indeed if we sort by knocking down grab.",
                    "label": 0
                },
                {
                    "sent": "So in the left hand path, the labels of this active air dropped and likewise.",
                    "label": 0
                },
                {
                    "sent": "When we knocked out the protein on the right hand side, the right hand path, the levels of air fail, and when they were both knocked out, then again the levels failed to basal levels and so this was additional evidence in support.",
                    "label": 0
                }
            ]
        },
        "clip_104": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Out of.",
                    "label": 0
                }
            ]
        },
        "clip_105": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The the Dual path hypothesis and the cancer biologists were extremely excited by this, that they now have a methodology which enables them to.",
                    "label": 0
                },
                {
                    "sent": "To formalize their hypothesis about various structures about chemical structures with which they are studying, and a formal mathematical way.",
                    "label": 0
                },
                {
                    "sent": "And then to further.",
                    "label": 0
                }
            ]
        },
        "clip_106": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Objectively assess.",
                    "label": 0
                }
            ]
        },
        "clip_107": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The existing evidential support for those.",
                    "label": 0
                }
            ]
        },
        "clip_108": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let me conclude.",
                    "label": 0
                },
                {
                    "sent": "By hopefully having convinced you know the estimating based fight does for models which are non trivial and exhibit feeling on trivial dynamics is extremely challenging.",
                    "label": 0
                },
                {
                    "sent": "But we can.",
                    "label": 0
                }
            ]
        },
        "clip_109": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Obtain stable estimators using this sort of stratified path sampling strategy that I discussed.",
                    "label": 0
                }
            ]
        },
        "clip_110": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "On indeed using something like parallel tempering or pile attempting type moves certainly improves things.",
                    "label": 0
                }
            ]
        },
        "clip_111": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we've successfully demonstrated the utility of this methodology on this particular pathway, and there are a lot of excited cancer biologists up in Glasgow at the moment.",
                    "label": 0
                }
            ]
        },
        "clip_112": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "And so.",
                    "label": 0
                }
            ]
        },
        "clip_113": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I think that's probably.",
                    "label": 0
                },
                {
                    "sent": "At.",
                    "label": 0
                }
            ]
        },
        "clip_114": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I don't think you need to.",
                    "label": 0
                },
                {
                    "sent": "And that's what we did at the end.",
                    "label": 0
                },
                {
                    "sent": "We just we just said there was a power play function for each team, so we fix so.",
                    "label": 0
                },
                {
                    "sent": "So given the resource is the computational resources that we have, we fixed the number of discrete T and then just define this power type function on them.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "So that's not bad.",
                    "label": 0
                },
                {
                    "sent": "Only 5 minutes overtime.",
                    "label": 0
                },
                {
                    "sent": "In fact, you answered my question about the weather, was just wondering if you were able in the end to not convinced but bass biologist towards one of the models and to change their models based on numbers.",
                    "label": 0
                },
                {
                    "sent": "Well I happens the model that biologists I'm working with.",
                    "label": 0
                },
                {
                    "sent": "He favored the one that came out, so that's why he's in love with me now.",
                    "label": 0
                },
                {
                    "sent": "But we are.",
                    "label": 0
                },
                {
                    "sent": "We are also working.",
                    "label": 0
                },
                {
                    "sent": "I have one PhD student who's working in models of securing control in plants where the structure of the controllers are actually different in different organs.",
                    "label": 0
                },
                {
                    "sent": "So in the roots and shoots they're actually different, and they're the biologists.",
                    "label": 0
                },
                {
                    "sent": "I'd actually looking for guidance rather than having firm topologies that are.",
                    "label": 0
                },
                {
                    "sent": "Others.",
                    "label": 0
                },
                {
                    "sent": "If you need to be characterized by two parameters instead of 1, like T yeah.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I mean if you look at gelman's so so so the main engagement paper of 98 actually discussed a very general case where you have multiple tempering type parameters.",
                    "label": 0
                },
                {
                    "sent": "But for this case that there was no need.",
                    "label": 0
                }
            ]
        }
    }
}