{
    "id": "vbpgno3cyz2vgzuz66iuddvpqgllra2j",
    "title": "Internet And Democracy - 10 years later",
    "info": {
        "recorded by": [
            "Artificial Intelligence Laboratory",
            "Center of Excellence Cognitive Interaction Technology (CITEC)",
            "Artificial Intelligence Laboratory"
        ],
        "author": [
            "Arne Rogg-Pietz, Institut für Sozialwissenschaften im Fachbereich Politikwissenschaft, Christian-Albrechts-University in Kiel"
        ],
        "published": "March 24, 2012",
        "recorded": "February 2012",
        "category": [
            "Top->Social Sciences->Society->Politics->eGovernance",
            "Top->Computers->Internet"
        ]
    },
    "url": "http://videolectures.net/web_rogg_pietz_internet/",
    "segmentation": [
        [
            "First of all, I have to say thank you to the organizers for not only having me here, but for finding me because he told me it was kind of difficult to to reach me because I was kind of kind of disappeared and this is due to my to my change of career.",
            "Yes, but nonetheless, or maybe just because just of like that fact.",
            "I'm really excited to be here and what I want to do is give you a short overview of what I think is yes as he called it.",
            "The interplay between the Internet and democracy, and I'm just going to highlight certain aspects and I'm trying to be really, really short and I'm trying to be really pointed, so I hope I can spark some controversy about those topics.",
            "Right, yeah, when?",
            "When political science started to think about the interplay of the effect that the Internet are community, computer mediated communication would have.",
            "On democracy, they thought it would change everything and everything with a capital E, right?",
            "So the influence that was ascribed to the Internet was huge.",
            "I think one can."
        ],
        [
            "See that very well I forgot to my outline.",
            "Ha I'm sorry yes.",
            "First mark my outline.",
            "Short introduction.",
            "Yes, the impact on the political system.",
            "I will look at responsiveness and at the political functions of media.",
            "And then I'll give a brief outlook on democracy in the age of Facebook right now."
        ],
        [
            "Back to my to my introduction.",
            "One can I think very good grasp what was the thought of the impact when one goes back to John Perry Barlow and his famous declaration of the Independence of Cyberspace.",
            "And I just like to quote a bit of that because I think it would be really interesting to go through that text sentence by sentence and see what of this of his thoughts.",
            "Would still well.",
            "Hold today, so now I'm going to quote governments of the industrial world.",
            "You really Giants of flesh and steel.",
            "I come from cyberspace, the new home of mind, on behalf of the future.",
            "I ask you of the past to leave us alone.",
            "You're not welcome among us.",
            "You have no serenity where we gather.",
            "We have no elected government, nor are we likely to have one.",
            "So I address you with no greater authority.",
            "Than that with which Liberty itself always speaks, I declare the global social space we are building to be naturally independent of that ironies you seek to impose on us.",
            "You have no moral right to rule us, nor do you possess any methods of enforcement.",
            "We have true reason to fear, and I think that quote is kind of interesting.",
            "If you look at it from today's point of view.",
            "So is this what he thought of the cyberspace?",
            "Is that still true?",
            "OK, and another famous person, at least from the German point of view, is under Muller Magoon.",
            "He's one of those who, I think founding fathers of the Computer Cows Club, and he, when he was elected into the Icon Board of directors.",
            "He was asked to explain to the wider public what he was doing and he gave a state of the nation address will published in a great German paper.",
            "Dynamic Young's actually wrong?",
            "Yeah, and this was another very positive positive.",
            "Thought our perspective that he had.",
            "OK, so.",
            "From today's point of view, I would say that much of that positive.",
            "Thoughts on how this connection is between democracies and Internet and democracy is a bit well.",
            "Boiled down to maybe a balanced.",
            "And maybe a bit even to the negative side, and I will try to point out why I think this is the case."
        ],
        [
            "OK, so when people think about the impact that the Internet has on democracy to people tend to think along the lines of institutions or of representatives or figures and of structures and.",
            "On that, or in that perspective, transforming effect of the Internet has been rather small, I would say.",
            "Until now this might be right about to change.",
            "If you, for example, look at the Pirates Party who are trying to incorporate much of the online liberation process is and a lot of transparency into politics.",
            "So this is changing right now, but one has to keep in mind and that that aspect that this Pirates Party was founded around a single issue, and I'm not quite sure if they can first keep up there, for example, transparency.",
            "Policy and if they can keep up that deliberation process policy if they really gather a lot of members, and if they evolve into a party that has to say a lot of things along the whole line of policy topics.",
            "So this is going to be interesting.",
            "Yeah, well.",
            "What has happened, of course, is that the political sphere has incorporated the Internet or online communication as another means of communication.",
            "Alongside other media, and Machel has her video block.",
            "And all the I think Members of Parliament, they have their Twitter account and they tried to reach out and to spread information.",
            "Yes that is happening.",
            "But I my point would be that this has not changed the system as such."
        ],
        [
            "OK, what did change and what is what I would call the meal radio the real media Revolution has a lot to do with what?",
            "The one speaking before me, pointing out that there is a change in a cognitive dimension that online communication changes our sociological system.",
            "Our SoC on another level, and via that detour.",
            "Then in the end might change our political system.",
            "But this is rather not not a direct change.",
            "The world that we constantly construct.",
            "From the bits and pieces.",
            "The world that we adapt to, as well as the concept of who we are, who belongs to us and how we go about things.",
            "That is, I'd say changed massively and I think we have.",
            "Some have had some evidence here just a few minutes ago so.",
            "What we know about the world.",
            "Of course we do know through media.",
            "This is not nothing new, but I think this is nonetheless still important.",
            "And so if computer mediated communication is that media, then something is going to change.",
            "So the problem is that if the system, the political system itself would have incorporated.",
            "The Internet or something of the Internet of Online communication that would be easy to spot right if we had E voting.",
            "Or E deliberation, then yes, we could see it.",
            "And there it is, and we could analyze it.",
            "I think the cultural change is much harder to pinpoint, especially when you think about the effects that this will have.",
            "So.",
            "What what I'm going to do now or what I'm trying to do is to try to look for some indicators that nonetheless could give us an idea of what."
        ],
        [
            "Is changing and therefore you need some measures right?",
            "And to measure the impact on the political system there have been.",
            "Although there are different different ways and indices, one very famous one is the Freedom House Index, and they measure the performance of a democracy by assessing the current state of civil rights in the country.",
            "So the better the civil rights are incorporated or dealt with in the country, the better the performance of a democracy.",
            "Now I'm really happy to show another index because it's the only equation in my slide.",
            "This is Tito Fun Hannans index of Democracy and he says simply democracy equals voter participation.",
            "P multiplied with the intensity of party competition divided by 100 right?",
            "And the greater the value, the better the democracy.",
            "That's pretty easy problem with all those measures is that they can't.",
            "Really say.",
            "They can't picture the influence of computer mediated communication, and therefore one had to look for other indicators.",
            "If one would want to say in how far the use of the Internet or online communication is to enhance the performance of a democracy and."
        ],
        [
            "I would like what I did was to look at responsiveness.",
            "The concept of responsiveness and this is the ability and the willingness of elements of the political system to take in input and very important.",
            "This is not the same as participation, right?",
            "So it's not only to give the people the chance to have their say, but it's about to.",
            "Process that input and so this is my my indicator and one would now have to look if the use of.",
            "Online communication enhances the.",
            "The responsiveness of a political system and if it does so yet, then yes, the use of online communication does enhance the performance of democracy as such.",
            "I hate this responsiveness.",
            "One I think has to look at the so-called points of access.",
            "These normally include members of Parliament.",
            "The single parliament committees the political parties, the bureaucracies of political system, all those are points of access that are well there too, to have to take in some input, but they are normally only open to to experts on a given topic.",
            "So for my task at hand, Now the question is, is there any chance to enhance the responsiveness by using online communication?",
            "And.",
            "When I talked about that question with Mark Line and this morning, he said yes, but Imperial empirical grounding on that would be nice and I must admit I don't have it.",
            "So I think it's hard to get because I'm not quite sure how one could process that.",
            "How could well this be measured if the input is really process and if there is really an increase in input?",
            "But I see of course the need to empirically.",
            "Ground that and some somewhere on the way if one is to really.",
            "Really found eight this OK.",
            "So, and while I worked on this talk and now I have to switch here and I hope that it works.",
            "Yes it does.",
            "That's beautiful.",
            "Counselor set up a new tool and this was really surprising.",
            "This is the dialogue about dodgeland right and they set up some kind of deliberate orium in quotes where people can.",
            "Command and and make make some suggestions on three topics.",
            "Let me just Scroll down here because."
        ],
        [
            "Central questions that she put up for the public to discuss this is Vivonne did Sumlin?",
            "How do we want to live together?",
            "Wolf on volunteer leave?",
            "That's hard to translate.",
            "I think.",
            "How could we do this?",
            "Yes, OK. What do we want to live on and how do we want to learn?",
            "And people can go there and make suggestions.",
            "And if you can, I just want to show you this one here because it's really interesting.",
            "OK, so this is how we want to everyone live and you see there are 3500 something suggestions and of course you can rate them and let's look at the best rated.",
            "I think this is kind of interesting.",
            "And and I think this proves one of the one of the biggest problems because.",
            "How serious?",
            "Um?",
            "Mac, it is about that.",
            "I'm not really sure how she's going to process that input and if it will really have an effect on the policy of, well, legalizing cannabis.",
            "I'm not.",
            "I'm not sure, but of course we have to take into account the lock in feature that will have an effect here.",
            "And I really can't explain how rough invest got on there.",
            "This is I think, really interesting and.",
            "Let's go back here.",
            "Because.",
            "The next thing I'd like to show you.",
            "That again shows that the problem in all those.",
            "Online facilitations of dialogue is how do we transmit the content and what they're going to do is a really big surprise.",
            "I think in the end.",
            "Um?",
            "There we have it.",
            "They're going to publish a book.",
            "I kind of like it, but I think it's poor use of technology, yeah, but no, I don't know what's going to read it anyway.",
            "Maybe maybe we should make a suggestion.",
            "Publish an abstract.",
            "That would be yeah, so OK.",
            "I think this shows a lot of the problems that are there and in the well and the point where this online thing has to somehow somehow move into the political process.",
            "And it's just this is really hard.",
            "OK, let's go back to that."
        ],
        [
            "OK, yes of course.",
            "Is this website for you wouldn't count already perceived as responsiveness, right?",
            "No, no, this is.",
            "This is participation.",
            "Responsiveness is the moment where you transfer this into.",
            "Legislation.",
            "OK.",
            "Right, and the problem is of course this.",
            "This website was commented upon by by, by the press and it mostly ran along the lines that Michael is just using this to take some voters back from the Pirate Party and that she's preparing for the election campaign next year.",
            "And that is just well.",
            "Not many of the commentators took it very serious.",
            "And and another nice anecdote without a member of the Pirate Party showed with a proof of concept.",
            "Heck, that this rating could be influenced by a simple cookie trick.",
            "They fixed that.",
            "Hours, but at least it was possible and I think it's kind of interesting what would have happened if the Member of the Pirate Party just would have.",
            "Kept that secret?",
            "OK, so.",
            "To evaluate."
        ],
        [
            "The.",
            "The development this is the.",
            "The Web Forum of the SPD.",
            "The Social Democratic Party of German Germany, and I put that on screen because among all those points of success, I just like to focus on the political parties because they are very prominent here.",
            "And this is what you can see.",
            "It's about the year 2001.",
            "This is how political forum then looked like it because around that time all the parties will understood that they had to do something about about and with the Internet.",
            "So they set up websites and they normally consisted out of a web forum.",
            "Yes, and and we had some some information blocks and we had current news.",
            "And last but not least we had.",
            "The online application form for membership which was, I think, kind of important there.",
            "Problem with that.",
            "Was.",
            "Well, the problems were a lot of like what my client yesterday pointed out.",
            "Those forums had a bad signal to noise ratio.",
            "It was scattered content, so I'm not going to repeat this.",
            "What the problem?"
        ],
        [
            "Walls with those forums I only like to add two more things.",
            "First of all, the intellectual level of the discussions carried out there were rather low.",
            "People came there to to lead useful discussions as well as just to let off steam so that.",
            "Led to the point that the usable output was not as high as some may have hoped, and the 2nd and I think more important reason, was that the parties had absolutely no idea of what to do with the given input.",
            "So they set up a team that set up a website and people came there and gave some input how lower the quality ever may have been, but the parties didn't process it and.",
            "The people realize, of course, that their effort to participate and to give some input was vastly in vain.",
            "Ann, I think there's no more or no no more effective tool than to demotivate people than to let them know that what they do is in vain.",
            "So people stayed away from that kind of websites and forums.",
            "It's today.",
            "Open forums more or less gone the CPU and the FTP.",
            "They have one where one can.",
            "Participate a bit.",
            "The SPD strikes a balance.",
            "They have a block where people can commend but cannot.",
            "Make entries themselves so this tool of incorporating.",
            "Input and a chance to process it in the political parties is gone and of course.",
            "The willingness of the parties.",
            "To give the public a chance to participate over.",
            "This forum does not automatically increase.",
            "The public's willingness to do so.",
            "So if the public is not interested in politics, just cause they were.",
            "They won't be interested just because they can do this.",
            "Via that way, so that was that.",
            "OK."
        ],
        [
            "So.",
            "My thoughts on responsiveness.",
            "The possibilities of participation have increased.",
            "Yes, I would say so, but the responsiveness has not improved or has not been improved by online communication, so.",
            "I would then add, maybe maybe with a bit.",
            "Caution that with regard to responsiveness as a measure of the performance level of a democracy, online communication has not yet to a great extent enhance the performance of a democracy."
        ],
        [
            "OK, this brings me to my second point.",
            "This is the political functions of media.",
            "I'm not going to list them all up, I'm just giving a few hints or first of all the function of media is a means of information for the public as well As for the political system.",
            "So this information goes both ways.",
            "Media help to form an opinion and so people can make informed decisions.",
            "This is very important that people need to know what political parties want if they want to be.",
            "A good voter.",
            "So to make informed decisions, yes, of course they need information.",
            "Media sets the political agenda.",
            "This is third.",
            "4th is the media is government watchdog.",
            "And of course fifth.",
            "They have to ensure transparency of government, governments, action and given the fact that.",
            "Online communication is used by a majority of people in a country, which I think in Germany now is the case as the last PDN City F online studio has proven.",
            "The performance of a democracy would be better if this computer mediated communication serves those functions better than the classical mass media, and I have some examples and I'm just looking at the function of a watchdog.",
            "Maybe this is a screenshot from the good and pluck.",
            "And I think I don't have to explain this to the German.",
            "Participants here, but this was the website that was set up to scrutinize and criticize the doctoral.",
            "The PhD thesis of our former Minister of Defense cultured with cooking bag and they tried to point out at which points let me see where's the pointer.",
            "Can you tell me whether?",
            "Ah OK so.",
            "Those are the red dots are pages with ripoffs of different sources.",
            "And an important the white.",
            "The white lines are pages on which until now there have been found no ripoffs.",
            "So of course, this is something this is something that in the age before the Internet just couldn't have been done.",
            "They just crowdsourced this thesis and people got crazy about that.",
            "And, well, I think they did a good job so.",
            "This, in a way, shows that the watchdog function is, I think, fulfilled better than with the classical media, another example."
        ],
        [
            "Is I think this.",
            "This is the presidential candidate of the Republicans who wanted to well be the candidate Rick Perry in this famous debate where he tried to make clear how he would cut government expenses by shutting down government agencies, and he wanted to name 3, but he only got to two and this was kind of funny because you forgot the third one.",
            "And this was of course spread around the country around the world.",
            "And minutes and there again, I would say that the possibility to work with that via YouTube to make copies of that end to end to add funny things to that this is again a good example of how the watchdog function.",
            "Works and I think this is a way very nice example, OK. Then the question is.",
            "Oh no, not the question.",
            "I think there will be some new some new characteristics concerning the watchdog function in the future, because the old politicians, old politicians who are in charge now began their career well in the in the analog age.",
            "And the politicians who are about to enter the political sphere and the political system are digital natives and I think something something different will be will be.",
            "Will be there because you don't need.",
            "A journalist training are.",
            "Something like that to find out about politicians, you only need to be good with Google and maybe be good with Facebook and So what could happen in the near future might be so."
        ],
        [
            "Nothing like this.",
            "OK. And I think this is posing visits.",
            "Of course, in a way it's nice, and it gives the public a lot of control, but otherwise it poses.",
            "I think a threat and maybe we're not that far from that quote that someone gave yesterday from by the Google founder who said, well, maybe everybody should get a new name when he turns 18.",
            "Just maybe just like a present from the state so that you can cut off his his past and start anew.",
            "And I think that is maybe somehow a nice idea, but I think this is a threat to politics and the political system has to find some way to deal with that.",
            "Because this is, I think, watchdog function, but a bit over the top.",
            "OK. At the end I'm trying to give a short outlook about about politics in the in the Facebook page and I'm just going to highlight certain thoughts and hope to provoke a response.",
            "I'm not going to be systematic."
        ],
        [
            "This of course.",
            "The political functions of media online communication has improved.",
            "I would say yes and online communication has enhanced the performance of democracies.",
            "Yes, but what's to come?"
        ],
        [
            "Of course I have to talk about the Wikipedia blackout.",
            "Because I think it was a thrilling experiment and they really did a very good job in in mobilizing the public.",
            "This was very impressive.",
            "They raised a lot of awareness for a certain topic.",
            "But I'm not quite sure if they can do that again.",
            "So.",
            "Maybe this was just a single shot they had.",
            "They couldn't go about this, raising awareness and stuff like we black out every Monday to raise awareness for for different topics.",
            "For this was a one time maybe one time idea so.",
            "What what?",
            "What is going to happen here?",
            "When you look at at?"
        ],
        [
            "Sample Wikipedia and or at Facebook.",
            "The problem with Facebook, I think, is the following.",
            "First of all, they train people to think by Neroly.",
            "It's either like or dislike.",
            "That's it, you have to have to like it or have you just dislike it and that's it.",
            "And I think this does not fit to politics very well.",
            "There has to be some kind of deliberation or some possibility for.",
            "For Shades of Grey it urges people to come up with something new every day, because otherwise you just drop out of the screen.",
            "And this is not what you want to do.",
            "You want to be present for your.",
            "For your friends, so it rewards quickness, because if you're if you're the 302nd to like something, this is not interesting anymore, right?",
            "So you gotta be quick and you gotta be fast with a click and you don't have much time to think.",
            "And I think this again does not fit very well to politics.",
            "And it reduces commitment to long-term issues.",
            "What happens on Facebook when someone raises awareness for certain topic?",
            "They start a group and a lot of people join and then you're a member of the group and that's it.",
            "And you have to well join new groups.",
            "I don't know every week.",
            "Maybe to be just to keep your profile up-to-date.",
            "And I think this is a very good visualization for this reluctancy too.",
            "Have strong ties and.",
            "I know that they they talk a lot about this, strong ties and weak ties issue and that weak ties can can be efficient too.",
            "But I think that politics has a tendency to too and in favor of long long term commitment and in favor of strong ties so.",
            "This is what I think makes Facebook age.",
            "If you want to call it like that problematic for our system and somehow there will be changed.",
            "I think this is for sure.",
            "Problem is, how do we?",
            "How do we adapt our political system to that change and let me be precise here again, I think the changes, mainly cultural.",
            "So the concept of how communication works of what we are, how we expect that communication works is going to shape our interest for political issues and it's going to shape our expectations of how.",
            "Politics should work, and if we expect to work.",
            "If we expect politics to work like Facebook, I think this would not not enhance the performance level of our democracy and."
        ],
        [
            "This is.",
            "The end of my talk and now I would like you to press the button.",
            "OK, that's it.",
            "Thank you very much."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "First of all, I have to say thank you to the organizers for not only having me here, but for finding me because he told me it was kind of difficult to to reach me because I was kind of kind of disappeared and this is due to my to my change of career.",
                    "label": 0
                },
                {
                    "sent": "Yes, but nonetheless, or maybe just because just of like that fact.",
                    "label": 0
                },
                {
                    "sent": "I'm really excited to be here and what I want to do is give you a short overview of what I think is yes as he called it.",
                    "label": 0
                },
                {
                    "sent": "The interplay between the Internet and democracy, and I'm just going to highlight certain aspects and I'm trying to be really, really short and I'm trying to be really pointed, so I hope I can spark some controversy about those topics.",
                    "label": 0
                },
                {
                    "sent": "Right, yeah, when?",
                    "label": 0
                },
                {
                    "sent": "When political science started to think about the interplay of the effect that the Internet are community, computer mediated communication would have.",
                    "label": 0
                },
                {
                    "sent": "On democracy, they thought it would change everything and everything with a capital E, right?",
                    "label": 0
                },
                {
                    "sent": "So the influence that was ascribed to the Internet was huge.",
                    "label": 0
                },
                {
                    "sent": "I think one can.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "See that very well I forgot to my outline.",
                    "label": 0
                },
                {
                    "sent": "Ha I'm sorry yes.",
                    "label": 0
                },
                {
                    "sent": "First mark my outline.",
                    "label": 0
                },
                {
                    "sent": "Short introduction.",
                    "label": 0
                },
                {
                    "sent": "Yes, the impact on the political system.",
                    "label": 1
                },
                {
                    "sent": "I will look at responsiveness and at the political functions of media.",
                    "label": 1
                },
                {
                    "sent": "And then I'll give a brief outlook on democracy in the age of Facebook right now.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Back to my to my introduction.",
                    "label": 0
                },
                {
                    "sent": "One can I think very good grasp what was the thought of the impact when one goes back to John Perry Barlow and his famous declaration of the Independence of Cyberspace.",
                    "label": 0
                },
                {
                    "sent": "And I just like to quote a bit of that because I think it would be really interesting to go through that text sentence by sentence and see what of this of his thoughts.",
                    "label": 0
                },
                {
                    "sent": "Would still well.",
                    "label": 0
                },
                {
                    "sent": "Hold today, so now I'm going to quote governments of the industrial world.",
                    "label": 0
                },
                {
                    "sent": "You really Giants of flesh and steel.",
                    "label": 0
                },
                {
                    "sent": "I come from cyberspace, the new home of mind, on behalf of the future.",
                    "label": 0
                },
                {
                    "sent": "I ask you of the past to leave us alone.",
                    "label": 0
                },
                {
                    "sent": "You're not welcome among us.",
                    "label": 0
                },
                {
                    "sent": "You have no serenity where we gather.",
                    "label": 0
                },
                {
                    "sent": "We have no elected government, nor are we likely to have one.",
                    "label": 0
                },
                {
                    "sent": "So I address you with no greater authority.",
                    "label": 0
                },
                {
                    "sent": "Than that with which Liberty itself always speaks, I declare the global social space we are building to be naturally independent of that ironies you seek to impose on us.",
                    "label": 0
                },
                {
                    "sent": "You have no moral right to rule us, nor do you possess any methods of enforcement.",
                    "label": 0
                },
                {
                    "sent": "We have true reason to fear, and I think that quote is kind of interesting.",
                    "label": 0
                },
                {
                    "sent": "If you look at it from today's point of view.",
                    "label": 0
                },
                {
                    "sent": "So is this what he thought of the cyberspace?",
                    "label": 0
                },
                {
                    "sent": "Is that still true?",
                    "label": 0
                },
                {
                    "sent": "OK, and another famous person, at least from the German point of view, is under Muller Magoon.",
                    "label": 0
                },
                {
                    "sent": "He's one of those who, I think founding fathers of the Computer Cows Club, and he, when he was elected into the Icon Board of directors.",
                    "label": 0
                },
                {
                    "sent": "He was asked to explain to the wider public what he was doing and he gave a state of the nation address will published in a great German paper.",
                    "label": 0
                },
                {
                    "sent": "Dynamic Young's actually wrong?",
                    "label": 0
                },
                {
                    "sent": "Yeah, and this was another very positive positive.",
                    "label": 0
                },
                {
                    "sent": "Thought our perspective that he had.",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "From today's point of view, I would say that much of that positive.",
                    "label": 0
                },
                {
                    "sent": "Thoughts on how this connection is between democracies and Internet and democracy is a bit well.",
                    "label": 0
                },
                {
                    "sent": "Boiled down to maybe a balanced.",
                    "label": 0
                },
                {
                    "sent": "And maybe a bit even to the negative side, and I will try to point out why I think this is the case.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, so when people think about the impact that the Internet has on democracy to people tend to think along the lines of institutions or of representatives or figures and of structures and.",
                    "label": 0
                },
                {
                    "sent": "On that, or in that perspective, transforming effect of the Internet has been rather small, I would say.",
                    "label": 0
                },
                {
                    "sent": "Until now this might be right about to change.",
                    "label": 0
                },
                {
                    "sent": "If you, for example, look at the Pirates Party who are trying to incorporate much of the online liberation process is and a lot of transparency into politics.",
                    "label": 0
                },
                {
                    "sent": "So this is changing right now, but one has to keep in mind and that that aspect that this Pirates Party was founded around a single issue, and I'm not quite sure if they can first keep up there, for example, transparency.",
                    "label": 0
                },
                {
                    "sent": "Policy and if they can keep up that deliberation process policy if they really gather a lot of members, and if they evolve into a party that has to say a lot of things along the whole line of policy topics.",
                    "label": 0
                },
                {
                    "sent": "So this is going to be interesting.",
                    "label": 0
                },
                {
                    "sent": "Yeah, well.",
                    "label": 0
                },
                {
                    "sent": "What has happened, of course, is that the political sphere has incorporated the Internet or online communication as another means of communication.",
                    "label": 0
                },
                {
                    "sent": "Alongside other media, and Machel has her video block.",
                    "label": 0
                },
                {
                    "sent": "And all the I think Members of Parliament, they have their Twitter account and they tried to reach out and to spread information.",
                    "label": 0
                },
                {
                    "sent": "Yes that is happening.",
                    "label": 0
                },
                {
                    "sent": "But I my point would be that this has not changed the system as such.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, what did change and what is what I would call the meal radio the real media Revolution has a lot to do with what?",
                    "label": 0
                },
                {
                    "sent": "The one speaking before me, pointing out that there is a change in a cognitive dimension that online communication changes our sociological system.",
                    "label": 0
                },
                {
                    "sent": "Our SoC on another level, and via that detour.",
                    "label": 0
                },
                {
                    "sent": "Then in the end might change our political system.",
                    "label": 0
                },
                {
                    "sent": "But this is rather not not a direct change.",
                    "label": 0
                },
                {
                    "sent": "The world that we constantly construct.",
                    "label": 0
                },
                {
                    "sent": "From the bits and pieces.",
                    "label": 0
                },
                {
                    "sent": "The world that we adapt to, as well as the concept of who we are, who belongs to us and how we go about things.",
                    "label": 0
                },
                {
                    "sent": "That is, I'd say changed massively and I think we have.",
                    "label": 0
                },
                {
                    "sent": "Some have had some evidence here just a few minutes ago so.",
                    "label": 0
                },
                {
                    "sent": "What we know about the world.",
                    "label": 0
                },
                {
                    "sent": "Of course we do know through media.",
                    "label": 0
                },
                {
                    "sent": "This is not nothing new, but I think this is nonetheless still important.",
                    "label": 0
                },
                {
                    "sent": "And so if computer mediated communication is that media, then something is going to change.",
                    "label": 0
                },
                {
                    "sent": "So the problem is that if the system, the political system itself would have incorporated.",
                    "label": 0
                },
                {
                    "sent": "The Internet or something of the Internet of Online communication that would be easy to spot right if we had E voting.",
                    "label": 0
                },
                {
                    "sent": "Or E deliberation, then yes, we could see it.",
                    "label": 0
                },
                {
                    "sent": "And there it is, and we could analyze it.",
                    "label": 0
                },
                {
                    "sent": "I think the cultural change is much harder to pinpoint, especially when you think about the effects that this will have.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "What what I'm going to do now or what I'm trying to do is to try to look for some indicators that nonetheless could give us an idea of what.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Is changing and therefore you need some measures right?",
                    "label": 0
                },
                {
                    "sent": "And to measure the impact on the political system there have been.",
                    "label": 1
                },
                {
                    "sent": "Although there are different different ways and indices, one very famous one is the Freedom House Index, and they measure the performance of a democracy by assessing the current state of civil rights in the country.",
                    "label": 0
                },
                {
                    "sent": "So the better the civil rights are incorporated or dealt with in the country, the better the performance of a democracy.",
                    "label": 0
                },
                {
                    "sent": "Now I'm really happy to show another index because it's the only equation in my slide.",
                    "label": 0
                },
                {
                    "sent": "This is Tito Fun Hannans index of Democracy and he says simply democracy equals voter participation.",
                    "label": 0
                },
                {
                    "sent": "P multiplied with the intensity of party competition divided by 100 right?",
                    "label": 0
                },
                {
                    "sent": "And the greater the value, the better the democracy.",
                    "label": 0
                },
                {
                    "sent": "That's pretty easy problem with all those measures is that they can't.",
                    "label": 0
                },
                {
                    "sent": "Really say.",
                    "label": 0
                },
                {
                    "sent": "They can't picture the influence of computer mediated communication, and therefore one had to look for other indicators.",
                    "label": 0
                },
                {
                    "sent": "If one would want to say in how far the use of the Internet or online communication is to enhance the performance of a democracy and.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "I would like what I did was to look at responsiveness.",
                    "label": 0
                },
                {
                    "sent": "The concept of responsiveness and this is the ability and the willingness of elements of the political system to take in input and very important.",
                    "label": 1
                },
                {
                    "sent": "This is not the same as participation, right?",
                    "label": 0
                },
                {
                    "sent": "So it's not only to give the people the chance to have their say, but it's about to.",
                    "label": 0
                },
                {
                    "sent": "Process that input and so this is my my indicator and one would now have to look if the use of.",
                    "label": 0
                },
                {
                    "sent": "Online communication enhances the.",
                    "label": 0
                },
                {
                    "sent": "The responsiveness of a political system and if it does so yet, then yes, the use of online communication does enhance the performance of democracy as such.",
                    "label": 0
                },
                {
                    "sent": "I hate this responsiveness.",
                    "label": 0
                },
                {
                    "sent": "One I think has to look at the so-called points of access.",
                    "label": 0
                },
                {
                    "sent": "These normally include members of Parliament.",
                    "label": 0
                },
                {
                    "sent": "The single parliament committees the political parties, the bureaucracies of political system, all those are points of access that are well there too, to have to take in some input, but they are normally only open to to experts on a given topic.",
                    "label": 0
                },
                {
                    "sent": "So for my task at hand, Now the question is, is there any chance to enhance the responsiveness by using online communication?",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                },
                {
                    "sent": "When I talked about that question with Mark Line and this morning, he said yes, but Imperial empirical grounding on that would be nice and I must admit I don't have it.",
                    "label": 0
                },
                {
                    "sent": "So I think it's hard to get because I'm not quite sure how one could process that.",
                    "label": 0
                },
                {
                    "sent": "How could well this be measured if the input is really process and if there is really an increase in input?",
                    "label": 0
                },
                {
                    "sent": "But I see of course the need to empirically.",
                    "label": 0
                },
                {
                    "sent": "Ground that and some somewhere on the way if one is to really.",
                    "label": 0
                },
                {
                    "sent": "Really found eight this OK.",
                    "label": 0
                },
                {
                    "sent": "So, and while I worked on this talk and now I have to switch here and I hope that it works.",
                    "label": 0
                },
                {
                    "sent": "Yes it does.",
                    "label": 0
                },
                {
                    "sent": "That's beautiful.",
                    "label": 0
                },
                {
                    "sent": "Counselor set up a new tool and this was really surprising.",
                    "label": 0
                },
                {
                    "sent": "This is the dialogue about dodgeland right and they set up some kind of deliberate orium in quotes where people can.",
                    "label": 0
                },
                {
                    "sent": "Command and and make make some suggestions on three topics.",
                    "label": 0
                },
                {
                    "sent": "Let me just Scroll down here because.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Central questions that she put up for the public to discuss this is Vivonne did Sumlin?",
                    "label": 0
                },
                {
                    "sent": "How do we want to live together?",
                    "label": 0
                },
                {
                    "sent": "Wolf on volunteer leave?",
                    "label": 0
                },
                {
                    "sent": "That's hard to translate.",
                    "label": 0
                },
                {
                    "sent": "I think.",
                    "label": 0
                },
                {
                    "sent": "How could we do this?",
                    "label": 0
                },
                {
                    "sent": "Yes, OK. What do we want to live on and how do we want to learn?",
                    "label": 0
                },
                {
                    "sent": "And people can go there and make suggestions.",
                    "label": 0
                },
                {
                    "sent": "And if you can, I just want to show you this one here because it's really interesting.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is how we want to everyone live and you see there are 3500 something suggestions and of course you can rate them and let's look at the best rated.",
                    "label": 0
                },
                {
                    "sent": "I think this is kind of interesting.",
                    "label": 0
                },
                {
                    "sent": "And and I think this proves one of the one of the biggest problems because.",
                    "label": 0
                },
                {
                    "sent": "How serious?",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Mac, it is about that.",
                    "label": 0
                },
                {
                    "sent": "I'm not really sure how she's going to process that input and if it will really have an effect on the policy of, well, legalizing cannabis.",
                    "label": 0
                },
                {
                    "sent": "I'm not.",
                    "label": 0
                },
                {
                    "sent": "I'm not sure, but of course we have to take into account the lock in feature that will have an effect here.",
                    "label": 0
                },
                {
                    "sent": "And I really can't explain how rough invest got on there.",
                    "label": 0
                },
                {
                    "sent": "This is I think, really interesting and.",
                    "label": 0
                },
                {
                    "sent": "Let's go back here.",
                    "label": 0
                },
                {
                    "sent": "Because.",
                    "label": 0
                },
                {
                    "sent": "The next thing I'd like to show you.",
                    "label": 0
                },
                {
                    "sent": "That again shows that the problem in all those.",
                    "label": 0
                },
                {
                    "sent": "Online facilitations of dialogue is how do we transmit the content and what they're going to do is a really big surprise.",
                    "label": 0
                },
                {
                    "sent": "I think in the end.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "There we have it.",
                    "label": 0
                },
                {
                    "sent": "They're going to publish a book.",
                    "label": 0
                },
                {
                    "sent": "I kind of like it, but I think it's poor use of technology, yeah, but no, I don't know what's going to read it anyway.",
                    "label": 0
                },
                {
                    "sent": "Maybe maybe we should make a suggestion.",
                    "label": 0
                },
                {
                    "sent": "Publish an abstract.",
                    "label": 0
                },
                {
                    "sent": "That would be yeah, so OK.",
                    "label": 0
                },
                {
                    "sent": "I think this shows a lot of the problems that are there and in the well and the point where this online thing has to somehow somehow move into the political process.",
                    "label": 0
                },
                {
                    "sent": "And it's just this is really hard.",
                    "label": 0
                },
                {
                    "sent": "OK, let's go back to that.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "OK, yes of course.",
                    "label": 0
                },
                {
                    "sent": "Is this website for you wouldn't count already perceived as responsiveness, right?",
                    "label": 0
                },
                {
                    "sent": "No, no, this is.",
                    "label": 0
                },
                {
                    "sent": "This is participation.",
                    "label": 0
                },
                {
                    "sent": "Responsiveness is the moment where you transfer this into.",
                    "label": 1
                },
                {
                    "sent": "Legislation.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Right, and the problem is of course this.",
                    "label": 0
                },
                {
                    "sent": "This website was commented upon by by, by the press and it mostly ran along the lines that Michael is just using this to take some voters back from the Pirate Party and that she's preparing for the election campaign next year.",
                    "label": 0
                },
                {
                    "sent": "And that is just well.",
                    "label": 0
                },
                {
                    "sent": "Not many of the commentators took it very serious.",
                    "label": 0
                },
                {
                    "sent": "And and another nice anecdote without a member of the Pirate Party showed with a proof of concept.",
                    "label": 0
                },
                {
                    "sent": "Heck, that this rating could be influenced by a simple cookie trick.",
                    "label": 0
                },
                {
                    "sent": "They fixed that.",
                    "label": 0
                },
                {
                    "sent": "Hours, but at least it was possible and I think it's kind of interesting what would have happened if the Member of the Pirate Party just would have.",
                    "label": 0
                },
                {
                    "sent": "Kept that secret?",
                    "label": 0
                },
                {
                    "sent": "OK, so.",
                    "label": 0
                },
                {
                    "sent": "To evaluate.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The.",
                    "label": 0
                },
                {
                    "sent": "The development this is the.",
                    "label": 0
                },
                {
                    "sent": "The Web Forum of the SPD.",
                    "label": 0
                },
                {
                    "sent": "The Social Democratic Party of German Germany, and I put that on screen because among all those points of success, I just like to focus on the political parties because they are very prominent here.",
                    "label": 0
                },
                {
                    "sent": "And this is what you can see.",
                    "label": 0
                },
                {
                    "sent": "It's about the year 2001.",
                    "label": 0
                },
                {
                    "sent": "This is how political forum then looked like it because around that time all the parties will understood that they had to do something about about and with the Internet.",
                    "label": 0
                },
                {
                    "sent": "So they set up websites and they normally consisted out of a web forum.",
                    "label": 0
                },
                {
                    "sent": "Yes, and and we had some some information blocks and we had current news.",
                    "label": 0
                },
                {
                    "sent": "And last but not least we had.",
                    "label": 0
                },
                {
                    "sent": "The online application form for membership which was, I think, kind of important there.",
                    "label": 0
                },
                {
                    "sent": "Problem with that.",
                    "label": 0
                },
                {
                    "sent": "Was.",
                    "label": 0
                },
                {
                    "sent": "Well, the problems were a lot of like what my client yesterday pointed out.",
                    "label": 0
                },
                {
                    "sent": "Those forums had a bad signal to noise ratio.",
                    "label": 0
                },
                {
                    "sent": "It was scattered content, so I'm not going to repeat this.",
                    "label": 0
                },
                {
                    "sent": "What the problem?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Walls with those forums I only like to add two more things.",
                    "label": 0
                },
                {
                    "sent": "First of all, the intellectual level of the discussions carried out there were rather low.",
                    "label": 0
                },
                {
                    "sent": "People came there to to lead useful discussions as well as just to let off steam so that.",
                    "label": 0
                },
                {
                    "sent": "Led to the point that the usable output was not as high as some may have hoped, and the 2nd and I think more important reason, was that the parties had absolutely no idea of what to do with the given input.",
                    "label": 0
                },
                {
                    "sent": "So they set up a team that set up a website and people came there and gave some input how lower the quality ever may have been, but the parties didn't process it and.",
                    "label": 0
                },
                {
                    "sent": "The people realize, of course, that their effort to participate and to give some input was vastly in vain.",
                    "label": 0
                },
                {
                    "sent": "Ann, I think there's no more or no no more effective tool than to demotivate people than to let them know that what they do is in vain.",
                    "label": 0
                },
                {
                    "sent": "So people stayed away from that kind of websites and forums.",
                    "label": 0
                },
                {
                    "sent": "It's today.",
                    "label": 0
                },
                {
                    "sent": "Open forums more or less gone the CPU and the FTP.",
                    "label": 0
                },
                {
                    "sent": "They have one where one can.",
                    "label": 0
                },
                {
                    "sent": "Participate a bit.",
                    "label": 0
                },
                {
                    "sent": "The SPD strikes a balance.",
                    "label": 0
                },
                {
                    "sent": "They have a block where people can commend but cannot.",
                    "label": 0
                },
                {
                    "sent": "Make entries themselves so this tool of incorporating.",
                    "label": 0
                },
                {
                    "sent": "Input and a chance to process it in the political parties is gone and of course.",
                    "label": 0
                },
                {
                    "sent": "The willingness of the parties.",
                    "label": 0
                },
                {
                    "sent": "To give the public a chance to participate over.",
                    "label": 0
                },
                {
                    "sent": "This forum does not automatically increase.",
                    "label": 0
                },
                {
                    "sent": "The public's willingness to do so.",
                    "label": 0
                },
                {
                    "sent": "So if the public is not interested in politics, just cause they were.",
                    "label": 0
                },
                {
                    "sent": "They won't be interested just because they can do this.",
                    "label": 0
                },
                {
                    "sent": "Via that way, so that was that.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "My thoughts on responsiveness.",
                    "label": 0
                },
                {
                    "sent": "The possibilities of participation have increased.",
                    "label": 1
                },
                {
                    "sent": "Yes, I would say so, but the responsiveness has not improved or has not been improved by online communication, so.",
                    "label": 1
                },
                {
                    "sent": "I would then add, maybe maybe with a bit.",
                    "label": 0
                },
                {
                    "sent": "Caution that with regard to responsiveness as a measure of the performance level of a democracy, online communication has not yet to a great extent enhance the performance of a democracy.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "OK, this brings me to my second point.",
                    "label": 0
                },
                {
                    "sent": "This is the political functions of media.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to list them all up, I'm just giving a few hints or first of all the function of media is a means of information for the public as well As for the political system.",
                    "label": 0
                },
                {
                    "sent": "So this information goes both ways.",
                    "label": 0
                },
                {
                    "sent": "Media help to form an opinion and so people can make informed decisions.",
                    "label": 0
                },
                {
                    "sent": "This is very important that people need to know what political parties want if they want to be.",
                    "label": 0
                },
                {
                    "sent": "A good voter.",
                    "label": 0
                },
                {
                    "sent": "So to make informed decisions, yes, of course they need information.",
                    "label": 0
                },
                {
                    "sent": "Media sets the political agenda.",
                    "label": 0
                },
                {
                    "sent": "This is third.",
                    "label": 0
                },
                {
                    "sent": "4th is the media is government watchdog.",
                    "label": 0
                },
                {
                    "sent": "And of course fifth.",
                    "label": 0
                },
                {
                    "sent": "They have to ensure transparency of government, governments, action and given the fact that.",
                    "label": 0
                },
                {
                    "sent": "Online communication is used by a majority of people in a country, which I think in Germany now is the case as the last PDN City F online studio has proven.",
                    "label": 0
                },
                {
                    "sent": "The performance of a democracy would be better if this computer mediated communication serves those functions better than the classical mass media, and I have some examples and I'm just looking at the function of a watchdog.",
                    "label": 0
                },
                {
                    "sent": "Maybe this is a screenshot from the good and pluck.",
                    "label": 0
                },
                {
                    "sent": "And I think I don't have to explain this to the German.",
                    "label": 0
                },
                {
                    "sent": "Participants here, but this was the website that was set up to scrutinize and criticize the doctoral.",
                    "label": 0
                },
                {
                    "sent": "The PhD thesis of our former Minister of Defense cultured with cooking bag and they tried to point out at which points let me see where's the pointer.",
                    "label": 0
                },
                {
                    "sent": "Can you tell me whether?",
                    "label": 0
                },
                {
                    "sent": "Ah OK so.",
                    "label": 0
                },
                {
                    "sent": "Those are the red dots are pages with ripoffs of different sources.",
                    "label": 0
                },
                {
                    "sent": "And an important the white.",
                    "label": 0
                },
                {
                    "sent": "The white lines are pages on which until now there have been found no ripoffs.",
                    "label": 0
                },
                {
                    "sent": "So of course, this is something this is something that in the age before the Internet just couldn't have been done.",
                    "label": 0
                },
                {
                    "sent": "They just crowdsourced this thesis and people got crazy about that.",
                    "label": 0
                },
                {
                    "sent": "And, well, I think they did a good job so.",
                    "label": 0
                },
                {
                    "sent": "This, in a way, shows that the watchdog function is, I think, fulfilled better than with the classical media, another example.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is I think this.",
                    "label": 0
                },
                {
                    "sent": "This is the presidential candidate of the Republicans who wanted to well be the candidate Rick Perry in this famous debate where he tried to make clear how he would cut government expenses by shutting down government agencies, and he wanted to name 3, but he only got to two and this was kind of funny because you forgot the third one.",
                    "label": 0
                },
                {
                    "sent": "And this was of course spread around the country around the world.",
                    "label": 0
                },
                {
                    "sent": "And minutes and there again, I would say that the possibility to work with that via YouTube to make copies of that end to end to add funny things to that this is again a good example of how the watchdog function.",
                    "label": 0
                },
                {
                    "sent": "Works and I think this is a way very nice example, OK. Then the question is.",
                    "label": 0
                },
                {
                    "sent": "Oh no, not the question.",
                    "label": 0
                },
                {
                    "sent": "I think there will be some new some new characteristics concerning the watchdog function in the future, because the old politicians, old politicians who are in charge now began their career well in the in the analog age.",
                    "label": 0
                },
                {
                    "sent": "And the politicians who are about to enter the political sphere and the political system are digital natives and I think something something different will be will be.",
                    "label": 0
                },
                {
                    "sent": "Will be there because you don't need.",
                    "label": 0
                },
                {
                    "sent": "A journalist training are.",
                    "label": 0
                },
                {
                    "sent": "Something like that to find out about politicians, you only need to be good with Google and maybe be good with Facebook and So what could happen in the near future might be so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nothing like this.",
                    "label": 0
                },
                {
                    "sent": "OK. And I think this is posing visits.",
                    "label": 0
                },
                {
                    "sent": "Of course, in a way it's nice, and it gives the public a lot of control, but otherwise it poses.",
                    "label": 0
                },
                {
                    "sent": "I think a threat and maybe we're not that far from that quote that someone gave yesterday from by the Google founder who said, well, maybe everybody should get a new name when he turns 18.",
                    "label": 0
                },
                {
                    "sent": "Just maybe just like a present from the state so that you can cut off his his past and start anew.",
                    "label": 0
                },
                {
                    "sent": "And I think that is maybe somehow a nice idea, but I think this is a threat to politics and the political system has to find some way to deal with that.",
                    "label": 0
                },
                {
                    "sent": "Because this is, I think, watchdog function, but a bit over the top.",
                    "label": 0
                },
                {
                    "sent": "OK. At the end I'm trying to give a short outlook about about politics in the in the Facebook page and I'm just going to highlight certain thoughts and hope to provoke a response.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to be systematic.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This of course.",
                    "label": 0
                },
                {
                    "sent": "The political functions of media online communication has improved.",
                    "label": 1
                },
                {
                    "sent": "I would say yes and online communication has enhanced the performance of democracies.",
                    "label": 1
                },
                {
                    "sent": "Yes, but what's to come?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of course I have to talk about the Wikipedia blackout.",
                    "label": 0
                },
                {
                    "sent": "Because I think it was a thrilling experiment and they really did a very good job in in mobilizing the public.",
                    "label": 0
                },
                {
                    "sent": "This was very impressive.",
                    "label": 0
                },
                {
                    "sent": "They raised a lot of awareness for a certain topic.",
                    "label": 0
                },
                {
                    "sent": "But I'm not quite sure if they can do that again.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Maybe this was just a single shot they had.",
                    "label": 0
                },
                {
                    "sent": "They couldn't go about this, raising awareness and stuff like we black out every Monday to raise awareness for for different topics.",
                    "label": 0
                },
                {
                    "sent": "For this was a one time maybe one time idea so.",
                    "label": 0
                },
                {
                    "sent": "What what?",
                    "label": 0
                },
                {
                    "sent": "What is going to happen here?",
                    "label": 0
                },
                {
                    "sent": "When you look at at?",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Sample Wikipedia and or at Facebook.",
                    "label": 0
                },
                {
                    "sent": "The problem with Facebook, I think, is the following.",
                    "label": 0
                },
                {
                    "sent": "First of all, they train people to think by Neroly.",
                    "label": 0
                },
                {
                    "sent": "It's either like or dislike.",
                    "label": 0
                },
                {
                    "sent": "That's it, you have to have to like it or have you just dislike it and that's it.",
                    "label": 0
                },
                {
                    "sent": "And I think this does not fit to politics very well.",
                    "label": 0
                },
                {
                    "sent": "There has to be some kind of deliberation or some possibility for.",
                    "label": 0
                },
                {
                    "sent": "For Shades of Grey it urges people to come up with something new every day, because otherwise you just drop out of the screen.",
                    "label": 1
                },
                {
                    "sent": "And this is not what you want to do.",
                    "label": 0
                },
                {
                    "sent": "You want to be present for your.",
                    "label": 0
                },
                {
                    "sent": "For your friends, so it rewards quickness, because if you're if you're the 302nd to like something, this is not interesting anymore, right?",
                    "label": 0
                },
                {
                    "sent": "So you gotta be quick and you gotta be fast with a click and you don't have much time to think.",
                    "label": 0
                },
                {
                    "sent": "And I think this again does not fit very well to politics.",
                    "label": 1
                },
                {
                    "sent": "And it reduces commitment to long-term issues.",
                    "label": 0
                },
                {
                    "sent": "What happens on Facebook when someone raises awareness for certain topic?",
                    "label": 0
                },
                {
                    "sent": "They start a group and a lot of people join and then you're a member of the group and that's it.",
                    "label": 0
                },
                {
                    "sent": "And you have to well join new groups.",
                    "label": 0
                },
                {
                    "sent": "I don't know every week.",
                    "label": 0
                },
                {
                    "sent": "Maybe to be just to keep your profile up-to-date.",
                    "label": 0
                },
                {
                    "sent": "And I think this is a very good visualization for this reluctancy too.",
                    "label": 0
                },
                {
                    "sent": "Have strong ties and.",
                    "label": 0
                },
                {
                    "sent": "I know that they they talk a lot about this, strong ties and weak ties issue and that weak ties can can be efficient too.",
                    "label": 0
                },
                {
                    "sent": "But I think that politics has a tendency to too and in favor of long long term commitment and in favor of strong ties so.",
                    "label": 0
                },
                {
                    "sent": "This is what I think makes Facebook age.",
                    "label": 0
                },
                {
                    "sent": "If you want to call it like that problematic for our system and somehow there will be changed.",
                    "label": 0
                },
                {
                    "sent": "I think this is for sure.",
                    "label": 0
                },
                {
                    "sent": "Problem is, how do we?",
                    "label": 0
                },
                {
                    "sent": "How do we adapt our political system to that change and let me be precise here again, I think the changes, mainly cultural.",
                    "label": 0
                },
                {
                    "sent": "So the concept of how communication works of what we are, how we expect that communication works is going to shape our interest for political issues and it's going to shape our expectations of how.",
                    "label": 0
                },
                {
                    "sent": "Politics should work, and if we expect to work.",
                    "label": 0
                },
                {
                    "sent": "If we expect politics to work like Facebook, I think this would not not enhance the performance level of our democracy and.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "The end of my talk and now I would like you to press the button.",
                    "label": 0
                },
                {
                    "sent": "OK, that's it.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                }
            ]
        }
    }
}