{
    "id": "vdhy6feiddck25vroyr764newpfswf4f",
    "title": "Topology, structure and defects in carbon nanosystems",
    "info": {
        "author": [
            "Chris P. Ewels, Institute of Materials (IMN), University of Nantes"
        ],
        "published": "May 9, 2007",
        "recorded": "May 2007",
        "category": [
            "Top->Chemistry",
            "Top->Technology->Nanotechnology"
        ]
    },
    "url": "http://videolectures.net/kolokviji_ewels_tsd/",
    "segmentation": [
        [
            "In non France, doctor Uhls graduated Department of Materials and Keble College you Oxford University.",
            "From 1994 to 1997, Doctor Use versus Research Assistant in the Department of Physics at the University of Exeter.",
            "Where he studied defects in semiconductors for for his PhD.",
            "Later he moved to the University of Sussex, Brighton and for three years he joined the group of Professor Malcolm Peggy to study study carbon nanostructures in the same.",
            "He was also involved in Vega Project initiated by the normal price low Rate Surgery Protocol.",
            "I should mention here that they got science track project is dedicated to the science, broadcasting and communication from Brighton.",
            "Dr Hills moved.",
            "Very.",
            "And then he finally settled at the Institute of Materials in non France.",
            "So far Doctor use publish trip book chapters and the large number of articles among them.",
            "I would emphasize articles in non nature materials and physical regulators.",
            "At the same time, look to U-verse was recently awarded the prestigious Marie Curie Excellence Award by the EU 105.",
            "Night of today's talk is topology, structure, and effects in carbon nano systems, and we're all looking forward to hearing.",
            "Thank you for my kind invitation Dennis.",
            "It's a pleasure to be back in Ljubljana.",
            "I've visited several Times Now and it's a lovely country and the lovely great institution.",
            "I'd like to start with an apology for those of you who know a little bit about nanotubes and followings, I'm going to do a very, very general introduction for complete beginners just to begin with, but we'll get onto some more juicy."
        ],
        [
            "Pickle stuff at the end.",
            "Just to introduce my Institute somewhere just South of Brittany on the West coast of France.",
            "So if you fancy your crepes in your cider, feel free to come and visit or Institute specializing materials, solar power, battery production and I work in the section on physics of nanostructures and nanomaterials."
        ],
        [
            "I'm not sure why, but here it is.",
            "I'd like to start off with this guy.",
            "Just a common or garden pencil.",
            "For those of you who work with pencil, the one which is probably most of us, you may not think you're doing a lot of nano."
        ],
        [
            "Analogy, but you are.",
            "In English, it's often called the LED pencil, but that's a misnomer.",
            "It's actually graphite in the core.",
            "They called it LED pencil because when they first found the graphite in the in the minds it was shiny.",
            "Looks a bit like lead, and they thought maybe it was a metal, but it's not, it's a."
        ],
        [
            "Of carbon there's actually multiple forms of carbon.",
            "Pure carbon.",
            "We've got graphite at the top point with pencil point.",
            "We've got Diamond over here.",
            "Another structural form and just very recently we've started to produce these molecular forms of carbon.",
            "So the field of carbon science.",
            "Although it's an ancient one."
        ],
        [
            "Is undergoing a revolution.",
            "So what goes on in graphite?",
            "Well, if we start, this is a carbon Atom and in graphite it can form 3 bonds.",
            "So I've just turned them on like this.",
            "This is about the only bit of chemistry you're going to get today, but if a bond is negative then you can see they want to repel each other, so they want to be as far away from each other as possible so you end up forming a trigonal arrangement, lightness, putting the bonds as far apart as possible.",
            "So if we bond this carbon to another one.",
            "We"
        ],
        [
            "End up with them and this one's got the same trigonal arrangement.",
            "If we keep going.",
            "You can see that you naturally by having just three bonds repelled from each other as much as possible, you start to form hexagonal structures.",
            "And these bonds coming off here we can continue to do the same thing.",
            "And."
        ],
        [
            "We keep going."
        ],
        [
            "After forming hexagons, you end up with sheets of hexagons, honeycomb structures, so this is the basic structure of a sheet of graphite.",
            "All the atoms are laid in a flat plane and each each corner point here is 1 carbon Atom with three bonds.",
            "That's the."
        ],
        [
            "Basis of graphite carbon chemistry and the key point here is that graphite sheets are flat graphitic chemist who was in the Flat Earth chemistry until."
        ],
        [
            "80s.",
            "Flat and not particularly interesting.",
            "You got a lot of repetition.",
            "And it's all about the same.",
            "If you put these flat layers on top of each other, I've got my my visual aid here.",
            "You've got very strong bonding within the sheet, 'cause they're strong chemical bonds, and these flat sheets can sit on top of each other, one on top of the other.",
            "And you can see that they slide over each other very easily, and this is my graphites actually used as a lubricant.",
            "So although you've got extremely is a bit paradoxical, you've got these very strong bonds in the plane, but such weak bonding between the planes that they can slide over each other.",
            "And that's the crystal structure of graphite.",
            "And that's where our car."
        ],
        [
            "Graphite story was until the 80s and we go from very small to very large.",
            "Because there was a bunch of chemists in Sussex and some scientists in Rice University and they were interested in the formation of stars.",
            "And galaxies and you start with large gas clouds and these gas clouds condense and form the hot stars.",
            "And if we do spectroscopy, if we look at the light absorption of these gas clouds, there's lots of carbon in them.",
            "And they thought.",
            "I mean, they see signals from like small chains of carbon atoms and other signals from different combinations of carbon atoms, and they're wondering what was going on in this.",
            "So they decided to try and recreate the carbon chemistry of stars in the laborat."
        ],
        [
            "She.",
            "Which sounds very flashy, but it's actually extremely easy to do, and you can do this at home if you fancy it, or we've done it in primary schools and laps around the world.",
            "All you need is to go back to the pencil, two pencils.",
            "Philly two graphite electrodes with a very small gap between them."
        ],
        [
            "Any put these in a vacuum chamber so you pump out all the air."
        ],
        [
            "And you put a big voltage across them.",
            "If you put a big enough voltage, you get a spark between the tips.",
            "And this heats really massive heating in the local area and you produce a cloud of carbon which."
        ],
        [
            "And starts to condense.",
            "And if you take that cloud and you look at what's come off in terms of the size.",
            "You could expect him, so each one of these peaks is a is a cluster of carbon atoms of a different size and the height of the peak shows you how much there is.",
            "Now when they first did this, Harry Kroto and Rick Smalley and the others they expected to see a whole splatter peaks, but what they saw was this one peak.",
            "Which corresponds to 60 carbon atoms came out so much higher than all the rest.",
            "This is some other data by the Exxon Group in 1988, but the original experiment was done a few years before and the question is what was magic about this number 60 'cause there's obviously something particularly stable about this.",
            "That's so they call this a magic number.",
            "And they came up with various models.",
            "They came up with models for little layers of graphite type structures with Inter bonding between and they came up with other models and none of them seem to fit.",
            "Another gave this special number and."
        ],
        [
            "Willem, they suddenly realized that it's graphite was no longer flat.",
            "It was becoming round and this is the candidate.",
            "This is C. 60.",
            "And the reason it's special and the reason this is so important and was the beginning of nanotech."
        ],
        [
            "She really is this guy here.",
            "You can see that for the flat sheet we had hexagons which you have here is 6 and this is a Pentagon.",
            "We've got carbon atoms forming 5 bonds.",
            "As soon as you've got five then you can no longer stay in this flat build.",
            "You have to start becoming.",
            "Curved and in fact, C 60 has 12 Pence."
        ],
        [
            "Guns.",
            "So here it is, goes under various names the Buckminster Fuller in the buckyball.",
            "And this is the first new allotrope of carbon for 2000 years or more."
        ],
        [
            "And just, incidentally, if you if you go home and try this and build a little vacuum chamber, if you've done it first, you would have gotten Nobel Prize.",
            "But then you gotta think of something you know, I'm afraid."
        ],
        [
            "So how do we make a Pentagon from this flat graphite sheet?"
        ],
        [
            "It's relatively simple.",
            "You cut out a wedge like segment.",
            "So."
        ],
        [
            "Chop it out and we've now got all these dangling bonds.",
            "All these carbon atoms are."
        ],
        [
            "We got two.",
            "They want a third, so we reform these third bonds.",
            "And that pulls the two halves together, I can.",
            "A little demonstration with a piece of paper.",
            "Just rip out our wedge.",
            "Pull the bonds together and you can see you naturally go from what we had was a flat sheet and we go to conical.",
            "Conical section."
        ],
        [
            "If I do that graphically, here you go.",
            "This is the Pentagon, it's."
        ],
        [
            "And this is a side view.",
            "You can see you've got this.",
            "This curvature associated with Pentagon.",
            "And in fact, if you take 12 pentagons, any number of hexagons, and this is a general rule, you form a closed object.",
            "And it's not just in chemistry, so although we discovered."
        ],
        [
            "In the 80s.",
            "We could have just looked on the football field and we would have got the answer long before each Pentagon on their standard football is black.",
            "Each hexagon is white, so next time you pop in place."
        ],
        [
            "Have a look and this guy could have told us all about it but we."
        ],
        [
            "I forgot to ask you.",
            "Just to give you an idea of the scale.",
            "Again, for the scientists in the audience.",
            "This maybe isn't so shocking, but I still find this quite incredible as a ratio flowing into the football is roughly the same scale up as a football to the world.",
            "So it's time you get a real sense of.",
            "It's like looking back and looking at the stars and suddenly releasing there a lot further away than you imagine.",
            "These are very."
        ],
        [
            "No.",
            "Another tenant, here's the science of the very small.",
            "And because we can have any number of accidents, this is a larger cage.",
            "There still has 12.",
            "Pentagons"
        ],
        [
            "The more hexagons we can stick it within another one again, you can start to see.",
            "Here's the pentagons on the corners, and we're getting flatter."
        ],
        [
            "Asians of hexagons?",
            "Here's another one.",
            "This is a sort of Russian doll type structure."
        ],
        [
            "Have balls with him."
        ],
        [
            "Rules.",
            "We can keep going, and here's an experimental electron micrograph of exactly that.",
            "This week all the carbon onion, because it's like the shells on an onion.",
            "Each one of those lines is 1.",
            "One following cage, and you can start to see the lines forming.",
            "There will be a Pentagon here and."
        ],
        [
            "And up here.",
            "Here's another very lovely picture by I think it's flowing Banhart."
        ],
        [
            "Hum.",
            "And other examples where we see this pentagonal in nature lends tackled in 1900.",
            "A lovely book with an optical microscopy just did hand drawn pictures.",
            "Various small biological organisms or sponges and various other things.",
            "And here's one of his pictures.",
            "Absolutely lovely."
        ],
        [
            "And if you look on here in order to get the curve structure."
        ],
        [
            "There's a hexagon, and there's a Pentagon.",
            "That's cool, I should say, it only applies if all the lengths the bond lengths, or that are roughly the same, but you can see the same thing in flies eyes on the backs of turtles."
        ],
        [
            "Just 'cause I like them, here's a couple more pictures than that.",
            "If you look at check of his name on the web, and in fact there's a whole bunch of fullerene structures which are being named after him called."
        ],
        [
            "Acolytes"
        ],
        [
            "Here's some more.",
            "And from the very small there's a much larger scale in architecture.",
            "This is the original patent drawing by Buckminster Fuller who was an American architect and somewhat visionary, and he was designing geodesic domes and geodesic domes show exactly this."
        ],
        [
            "You've got a. Pentagon in the middle.",
            "Here hexagon there because this is half a sphere.",
            "You've only got 6, so you should have 5 around the edge and one in the center.",
            "And it's thanks to this guy that in fact Harry Kroto suggested that the 660 should be called buckminsterfullerene, because it was all done in architecture before it."
        ],
        [
            "Stunning chemistry.",
            "And that is about Mr."
        ],
        [
            "With one of his dreams.",
            "Here's another one in the Epcot Center for those of you in today."
        ],
        [
            "Land in Florida, and even though if you look on the cover of Time magazine."
        ],
        [
            "If you look on the top of his head."
        ],
        [
            "You got hexagons and following the rule pentagons."
        ],
        [
            "Zone.",
            "So we've used pentagons to go away from this flat world into a curved world, but how else can we do it?",
            "And from 8086 to about 91 this was pentagons for the only way and then somebody observed that if you take a flat sheet the other way."
        ],
        [
            "Curl up.",
            "And now into the world of the nanotube.",
            "So we take our flat sheet of graphite and just by distorting every bond ever so slightly, you can roll."
        ],
        [
            "Conformer tube and depending on how you roll.",
            "For example, if you take the two sides here and roll up, you'll have this sort of zigzag pattern along the ends of the tube.",
            "If you take the two top and bottom and roll up you have.",
            "Here what we call an arm chair pattern.",
            "You have to be here a bit of an artist to see why it's an arm chair, but you can just have outdoor structure and if you take the two corners and roll from there to there, you have a sort of spiral.",
            "Allow."
        ],
        [
            "Access the nanotube.",
            "So here's an armchair nanotube, his exact tube, and he's a kaylan.",
            "In fact, depending on how you roll, you end up with different electrical conductivity in the tubes.",
            "These guys are metallic.",
            "These guys are either semiconducting or metallic, and these are metallics so you can change the electronic proper."
        ],
        [
            "YouTube by rolling it the correct way.",
            "I'm not going to go into the numbers, but nanotubes are touted as this wonder material.",
            "Alot of it is down to their excessive is."
        ],
        [
            "LM.",
            "Figures, and particularly the tensile strength of their 10 times stronger than steel in principle and six times lighter.",
            "So you can immediately imagine all sorts of mechanical applications in composites in bridge building in airplanes and superelastic you can stretch them.",
            "They've got very low bending stiffness and they're very flexible and this is without considering their electrical properties there.",
            "Fantastic conductors.",
            "They firmly conduct much better than copper."
        ],
        [
            "Just to show that you can bend them, here is just a simple model of a bent nanotube and then just like tubes because these are chemical bonds, it's not like a normal fiber where you can crack locally here the bonds."
        ],
        [
            "Reform when he's taking the tube.",
            "And here's an electron micrograph, which you can just see showing exactly that.",
            "You can see the folds in the tube."
        ],
        [
            "And his work where you don't get fatigue, you can bend a nanotube, straighten it as many times as you want, because these chemical bonds are chemical bonds and this is an example lovely piece of work by Richard Superfine and his group, where they took an AFM tip and they took a nanotube and they bent it just by pushing.",
            "It must have must have killed some graduate student to do this so very painstaking work, but they bent it.",
            "They re straightened it, they bent it, they re straightened it and now."
        ],
        [
            "Effect on the managing.",
            "How you make them?",
            "It's roughly the same as making 60, but you also use metal catalyst particles."
        ],
        [
            "Iron, nickel or cobalt or thereabouts, and here's a typical reactor.",
            "It's got a screen on the front to protect you and inside there there's the tool."
        ],
        [
            "Towson, that's the pump.",
            "There's the two electrodes and here's the."
        ],
        [
            "So we could do picture of a spark and afterwards this is the electrode.",
            "You can see it's been.",
            "It's got lots of deposits on it and this is around the base of the electrode and you can see these kind of spider web structures and actually it's those.",
            "If we collect those, that's where all the nanotubes are.",
            "So you can see the disadvantage."
        ],
        [
            "This technique we don't produce a lot, so better ways.",
            "This is called CVD.",
            "Here you have a big furnace and you pass a carbon based gas along and through the furnace and in here it heats up so much the gas breaks down and starts to form carbon deposits on the substrate and if you've got metal catalysts there than you."
        ],
        [
            "Nanotubes and you form these forests or carpets.",
            "People call them.",
            "You can see they're all growing up the substrate, and if you zoom in a bit more you can see them going.",
            "Here's a bigger zoom.",
            "And finally, if you go right down to the smaller scale, these are single."
        ],
        [
            "Nano nanotubes.",
            "As well as following singles, you conform them.",
            "This is a double wall tube.",
            "You can see the two lines or multiwalled tubes of different sizes.",
            "This was the first published multiwalled work by."
        ],
        [
            "Assuming ojima.",
            "And the nanotubes naturally formed bundles.",
            "This is looking end on.",
            "You can see their pact Hexagonally.",
            "'cause they like to stick to each other and it's only week Vander Waals forces.",
            "But at this scale along all the length of the tube, that's quite a list."
        ],
        [
            "An attraction between the tubes.",
            "We can do a little bit more than we can fill them with metal.",
            "This is quite an early picture, but we can no metal fill almost continually and make make nanoscale wires.",
            "We can put other molecules."
        ],
        [
            "Side here we got these little see 60s inside."
        ],
        [
            "Nanotube so it's called a people structure 'cause it looks like peas in a pod."
        ],
        [
            "So the electronic properties of these here we can see again this is metallic.",
            "'cause there's finite density of states over the whole gap here is just above 0.",
            "This is a semiconducting too, because it actually touches 0 for and gives you a finite bandgap.",
            "The bank app also depends on the size of the tube, the diameter, the two.",
            "So one of the big problems is we have a mess.",
            "We have a result of material in that spider web with a mixture of metallic and semiconducting with all different gaps.",
            "So a lot of the current research at the moment is to try to find ways to make just one sort of tube."
        ],
        [
            "With the reproducible properties.",
            "And here's something you can do with him.",
            "You can make transistors.",
            "He got two electrodes with a nanotube."
        ],
        [
            "Lying across.",
            "And you get classical transistor response.",
            "This is the voltage current curve."
        ],
        [
            "And you can even do single devices within a single nanotube.",
            "Here we got a nanotube in the kinked it.",
            "And So what they've done is produce two sections with different chirality.",
            "So once the semiconductor ones are metal and you've got a semi conduct."
        ],
        [
            "Metal Junction in the same tube.",
            "And here's the IV characteristics and you can see it's a classic diode rectifying diode."
        ],
        [
            "That's a lovely way people can use nanotubes field emission.",
            "So in this case the nanotubes is standing up vertically, like those forests, and there's electrons being sprayed off the tips onto this display.",
            "And this again is that.",
            "I mean this is quite quite an early picture.",
            "They've gotten principle much bigger."
        ],
        [
            "Vanity displays now.",
            "And for mechanical properties you can make fibers, so this is this is this is no longer nanoscale.",
            "This is Marco 'cause these are.",
            "These are woolen fibers or some sort of woven fiber.",
            "And here you can see Fibers made from bundles and nanotube together mixed with a polymer and this is a very very strong.",
            "This effect is very tough.",
            "It can absorb a lot of energy before it it fails.",
            "And you can even make a capacitive fibers for storing energy.",
            "So you mean in the future you might be able to have jackets.",
            "Which actors batteries you can just plug your iPod into your jacket and charge up close.",
            "Just like discharge through through your hair and people even talking about this is the speculative end of things.",
            "Using nanotubes to make very strong fibers and this is the fabled space elevator.",
            "The cable up into space and nanotubes.",
            "In principle the only material strong enough to actually make this.",
            "Whether it's possible even with nanotubes, is is an open question, but there's a lot of people working on it.",
            "So that's a sort of general background and introduction to nanotubes and fullerenes and."
        ],
        [
            "Kevin, I wanted to go into a little bit onto more.",
            "The area I've been working on recently and that's taking these lovely beautiful nanotubes and messing them up so."
        ],
        [
            "Why on Earth would we want to damage a nanotube?",
            "Well, the trouble with the nanotube on itself is that it's a perfect surface and it's relatively unreactive, and in particular from these bundles they slide over each other.",
            "So we actually one of the reasons to to damage the Mr is to activate the surface so that the nanotubes can lock, lock into other things, lock into polymers, lock into each other.",
            "So here's a calculation we did, in fact originally inspired by nuclear applications.",
            "If you radiate graphite to cause damage, and it's very similar to that in nanotubes, and there was an Atom here, these are two sheets of graphite or two nanotubes, and he's been knocked out and he's now down here, so this is a vacancy and interstitial pair.",
            "And this is actually a metastable.",
            "You've got a double bond here.",
            "And it's locked into this position and you need to heat up and our calculations suggested you needed to heat to about 200 degrees C, and then you can pop back into his side."
        ],
        [
            "And why are these sort of defects important?",
            "What can you do with these crosslinking ones?",
            "Well, here's a sort of schematic of a bundle of nanotubes inside a polymer.",
            "For example, if you wanted to make it like a glass fiber composite, instead of having glass fibers were using nanotubes.",
            "In principle, this should strengthen the matrix, but the trouble is that if you pull a nanotube, it's very strong, but if you've got two nanotube side-by-side, they can slide over each other very easy, and so your share is actually not very good.",
            "So you could imagine in a case like this, we might want to form these little bridging defects between the nanotubes to lock them in place, and that should actually make the whole thing, although it's kind of paradoxical, you're damaging the nanotubes, but the result maybe something a lot stronger.",
            "And then grouper kitset LM in 2004 did some lovely work.",
            "They put a bundle of nanotubes over a hole in the substrate and pushed it with an AFM tip.",
            "And after radiation they find the bending modulus goes up by a factor of 30.",
            "So this is there.",
            "Seems to be a very actually a very promising way to strengthen."
        ],
        [
            "The two bundles.",
            "Another way you could imagine improving mechanical properties if you take a multi wall tube.",
            "If example taken multiple tube and you do torsional.",
            "Damage you twist it, you're only really interacting with the outer layer.",
            "There's minor interaction with the inner layers through compression, but only very minor, and it's a waste of all this carbon inside you quite like to get all this involved in the mechanical strengthening as well, and one way you could do that is to make little links between the walls.",
            "With the defect I showed you with other defects.",
            "And this might actually improve the mechanical response of the multiwalled nanotubes.",
            "And I'm not necessarily suggesting this is what's going on.",
            "There's a.",
            "There's a number of candidates, but.",
            "Done whiteness group in this world.",
            "It's some statistical studies of breaking force and they took the so-called perfect or much less defective hip code tubes and they took with highly defective CD tubes.",
            "If you see pictures of these there, there there anything but flat walls and these actually have higher breaking forces than the perfect tubes.",
            "So again another paradox that defects and damage may actually improve."
        ],
        [
            "Mechanical properties.",
            "On the flip side, what happens if you pull really, really?",
            "But I mean you can't.",
            "This is very difficult to do experimentally, but it's it's relatively easy for us to do in our computer simulations, so that's why we do it.",
            "If you pull a nanotube, you can start to rotate these bonds.",
            "Two of the carbon atoms will switch around, and when you rotate a pair, you start to form different defects.",
            "Instead of having hexagons here, we formed a Pentagon and a heptagon.",
            "Two pairs, and these actually implying dislocations.",
            "Keep pulling and by flipping more bonds, these can move apart from each other and you end up with a region of tube in the middle.",
            "Although this is a dynamic simulation so it's a little hard to see this is a slightly smaller diameter but slightly elongated, so it's given in response to stress.",
            "The chief gets thinner and longer.",
            "So this is a duck tile failure of a nanotube.",
            "No.",
            "The."
        ],
        [
            "This is very, very difficult to do, and the reason is this is the barrier we're talking nearly nine electron volts to rotate that bond.",
            "So the amount of energy you need to do that, is it phenomenal.",
            "But if you have defects, if you have vacancies or interstitials, here's the barrier with an interstitial present, 'cause interstitial can catalyze these rotations.",
            "So these little local defect sites can catalyze plastic definite defamation nanotubes.",
            "This can is only 2.29, so this can happen at much lower temperatures or much lower stress."
        ],
        [
            "Enforces.",
            "And not so long ago, January 2006.",
            "Lovely piece of microscopy.",
            "They took a carbon nanotube and stretched it by heating and the electron microscope and they're able to stretch in length and 24 nanometers to 91, which is, for me is an incredible that the chip didn't break.",
            "This was a continuous stretching.",
            "They hated it by passing electric current.",
            "The diameter shrunk by 15 times.",
            "And yet they still didn't fail and the result was a stronger tube as well, presumably because lots of the damage was.",
            "Was running around, but these points here it's very difficult to see, but there little kinks.",
            "In the tube.",
            "And I'll mention this a little bit later, but my suggestion is that these are dislocations in the nanotube which are running along the length.",
            "In response this pulling, but this they did at very very high temperatures.",
            "So I don't think we have to worry about nanotubes failing in general mechanical applications.",
            "Maybe for high temperature applet."
        ],
        [
            "Nations we have to worry about this.",
            "So these defects, and I've been advised against using the word defect, 'cause it sounds like it's a problem, so we'll call them active sites instead of.",
            "It is the same thing.",
            "What else can we use them for apart from mechanical and one is chemical functionalization.",
            "If you've got a perfect managing bullets very unreactive, so you need defect sites as attack sites for chemicals.",
            "For example, if you want to bond polymer chains or biological markers if you want to bond other molecules for light harvesting for solar cell applications drug delivery composites you need.",
            "Defective sites on the tube for electronic doping.",
            "If you want to modify the Fermi level.",
            "Gas absorption are highlighted.",
            "This 'cause we've got a European project and only two hybrids on this at the moment.",
            "And here's a gas sensor.",
            "Have you looked at very small?",
            "We got multi walled nanotubes and if you zoom in again the decorated with metal nanoparticles.",
            "Which stick to the defective sites.",
            "So it's absolutely essential for this that we have defective nanotubes.",
            "In order to get a good uniform coverage of metal particles and another sort of fairly untouched.",
            "But I think becoming important site of this is biological compatibility.",
            "They've done their residents tests in living organisms and nanotubes because they are very unreactive.",
            "They're very difficult for the body to get hold of, to interact with, and you can find quite often long.",
            "Lifetimes within the body.",
            "Long retention lifetimes of nanotubes.",
            "If you're there's very early studies where they said if you take nitrogen doped nanotubes, so these are very active.",
            "Surface is then the body can deal with those protein.",
            "Wrap them and they expelled very quickly in the urine.",
            "So for biological applications.",
            "Quite aside from all the other toxicity testing and medical testing that's needed, defective tubes have."
        ],
        [
            "A lot of promise.",
            "So if we want these active sites or defects, how do we make them one?",
            "Is doing growth, for example, nitrogen doping another is by chemical attack.",
            "If you attack a nanotube flooring, you can coat the surface and another is irradiation and it's that.",
            "I'd like to concentrate for the final section of my talk."
        ],
        [
            "Electron irradiation.",
            "And it's the area I'm I'm working in a little bit at the moment.",
            "It's I'm a theorist, I do computer modeling and it's it's a great time to be in this field because we've been looking at the atomic scale for donkeys years and we've had a free reign.",
            "We just model whatever we wanted because nobody could see it until the last five or so years, and that these guys have caught up and they bring us to book.",
            "So for the first time, they're producing pictures that match or don't match what we're doing in the modeling, so."
        ],
        [
            "It's a fantastic time to be in the field.",
            "He's just an example.",
            "This is work by Alexander Glutton.",
            "'cause we're not A and this is one of those people structures.",
            "Again, these are following molecules within a nanotube.",
            "This is a real experimental images and through a series of time sequences you see this following here is become damaged by the electron beam, 'cause these are very high energy electrons hitting the structure and they can knock atoms out.",
            "One of the items have been locked in.",
            "Its formed a bond to the wall, and here's one of our computer models of this with a little whether it agrees exactly or not, is it?",
            "As a matter for the viewer, but."
        ],
        [
            "And this to go back to our little crosslinking defect.",
            "We were very tough to be modeled.",
            "This then published in 2003.",
            "And a couple of years later, in 2005 again, the Group of Susuan Algo.",
            "We're looking at double walled nanotubes, so it's effectively 2 sheets of carbon atoms and they see these little.",
            "Defects appear which are little links between the walls.",
            "And what they did, which was lovely.",
            "They looked at this and heated the sample up and when they heated up to 200 degrees C, They found but they disappeared so they can measure it.",
            "They can see visually at what temperature these defects annealed out, and at 200 degrees C matched exactly with our calculations.",
            "So we're very pleased."
        ],
        [
            "And here's some stuff that they, well, it's impressed at the moment.",
            "In general, American Chemical society here.",
            "They took a functional group and they attached C 60.",
            "This is to the outside of a nanotube, so you can't see it with a nanotube is here.",
            "And they did various computer modeling without DfT, and these are the simulated images and you can see.",
            "Some much better than others, but they're pretty good.",
            "Pretty good matching the dark spots and the light spots, so here you're getting pictures of individual C 60 molecules and you can almost.",
            "Pretty well, pick out the individual atoms.",
            "And the really nice thing again under the electron beam, these become damaged.",
            "And here's some damage ones, and they're able to model these with C 58, so these are C60 molecules that have lost two carbon atoms under electron beam and they get these distorted structures, so it's.",
            "It's actually fantastically the resolution, and there's other work by these guys and related groups have seen individual vacancies."
        ],
        [
            "There's also warning with this, 'cause what happens when we shine electron beam on a nanotube just by the act of observation with an electron beam, we damaged the very sample that we're looking at.",
            "Because of these high energy electrons passing through the sample, some of them can hit individual atoms and knock them out, and this is a movie of a government and particularly watch down here you can see as time passes.",
            "The actual tube starts to deform, and we're losing material.",
            "The rate, the diameter the tube shrinks."
        ],
        [
            "Here's another one there.",
            "You see, we formed a little kink.",
            "It's then moved out and we're getting other secondary kinks.",
            "And then eventually.",
            "We haven't actually destroyed this.",
            "So we want to know a little bit more about the interaction of this electron beam the sample."
        ],
        [
            "Now we're kicking these atoms out.",
            "So can we computer model this interaction and what we did?",
            "We started with these molecular dynamics simulations, so this is a dynamic simulation and what we do is we kick one Atom.",
            "And make it harder and harder and harder until eventually.",
            "Again, it's the first kick it pops back.",
            "So that was no good, so we kick it again.",
            "It never complaints.",
            "We just keep kicking and eventually.",
            "If you kick it hard enough.",
            "It's going to take a little while.",
            "Nearly.",
            "No, please come back.",
            "There we go, he's escaped.",
            "So this way, with the molecular dynamics simulations, we know how much energy you need to provide in a kinetic kick to an Atom.",
            "This is a sheet of boron nitride, but we've done the same with with graphite.",
            "By combining that with some background."
        ],
        [
            "Siri we can look at kicking it in different directions.",
            "And see whether there's preferential direction.",
            "So this is a map of kicking one Atom out.",
            "You can see it doesn't like to be kicked in this direction, 'cause there's another Atom in the way, so this is the big Hill in our plot."
        ],
        [
            "And we can generate a sort of a map of the kicking directions, and if we integrate over energy range because you start to kick it strong and strong wrangells, there's less energy transferred from the incoming electron to the outgoing Atom.",
            "So we have to integrate over the region where there's sufficient energy transfer to cause this kick.",
            "I'm."
        ],
        [
            "Get the knockout energy.",
            "The energy for a single Atom in a sheet.",
            "So once we have that energy we can start to play with it with a microscope.",
            "So we calculated that for carbon if we were working at 80K electron volts electrons, we shouldn't damage the tube.",
            "And sure enough, here's a single nanotube, 5 minutes, 50 minutes.",
            "No damage the samples.",
            "Resting it, it's the image quality is less good, which is why it's a bit fuzzy 'cause we were at lower voltages.",
            "And we focus the beam, not just at the whole image, because this is a stem.",
            "This is a focal beam.",
            "We can focus it on."
        ],
        [
            "Navy, no damage there, but we can go further with the calculation.",
            "So that was a calculation for perfect graphite, but here we can take this is the perfect a single Atom in a nanotube and this is a cross section of the tube and the color shows the cross section.",
            "So essentially the likelihood of data mean kicked out and it's more likely to be kicked out of the top or bottom of the tube.",
            "But we can look at atoms around defects, so here we have a single vacancy.",
            "What's the chance of this guy game being kicked out?",
            "And you can see that the cross section is much much higher than for an Atom in a perfect tube, and particularly if it's at the base of the tube.",
            "So basically atoms next to pre existing vacancy are much more susceptible to being kicked out by the electron beam and we can go on if this one was kicked out.",
            "That would be the defect will be the chance of kicking at this one, and again it's more likely than perfect tubes.",
            "Less likely than this guy.",
            "So this suggests that actually we should kick it once.",
            "We've kept at one Atom, it should be a lot easier to kick out its neighbors in a line.",
            "And we'll sort of zip the atoms out and allow."
        ],
        [
            "Pain along the tube and if we continue that, he's a modeling Albert is done of the using DfT and we've knocked out one Atom and then a whole line and we get these kinks.",
            "And here's the simulated image of different types."
        ],
        [
            "Do we see that?",
            "Well, here we've taken another nanotube.",
            "We've gone up to 100 KV, so we're just above the damage threshold and we put the beam just in one area here.",
            "And you can see after a period of time we've knocked.",
            "I think it's about a minute or so 30 seconds.",
            "We started to form a little kink, so then we put the beam here.",
            "And we formed another little kink.",
            "We put them here.",
            "We formed another look at the Bing sits just outside so just touches the tube and based on the calculations we can say that each one of these kinks is from one to three isolated vacancies followed by chains of roughly about about 10 vacancy.",
            "So with an electron beam we can almost this is in a controllable way.",
            "We can almost now knockout individual atoms so we can sculpt this nanotube and knowing that the chirality changes due to this damage, Minton were causing look.",
            "Maybe local chirality changes may be local.",
            "Semiconductor metallic region.",
            "So we got real spatial control.",
            "We've got images showing the rest of the tubes is untouched."
        ],
        [
            "In fact, there's a little damage regions and the rest of the tube completely untouched.",
            "So they sent me about done slightly ahead of time, but.",
            "Just to turn back, just want to go back to the pencil and next time you are using a pencil have a think about it and just remember the time.",
            "Underneath this big bold graphitic exterior."
        ],
        [
            "Work with graphite and Cassie on the high high resolution and of course Dennis and pull up the invitation and the rest of you for come."
        ],
        [
            "Here to listen.",
            "Thank you very much.",
            "It would be lovely to do the microscope we had hasn't got the appropriate stage to do transport measurements on single nanotubes, but this is.",
            "I mean, this was obviously been lovely experiment to do to look at the transport characteristics every single tube.",
            "The work presented here is this is only just finished and it's only only just submitted, so this is obviously the next thing to do to look at this year.",
            "Stand.",
            "Sure, sure, yeah, but if you want to do modeling of the transport, these are quite messy systems because you lose the periodicity of the tube.",
            "Yeah, yeah, so it's possible to predict expensive.",
            "Yeah, but I'm this was done using DfT codes which are faster than pure DfT, so there's hope.",
            "May be related question.",
            "To start with, the semiconducting nanotube and then you create damage like what will be what will happen with.",
            "We created states in the gap or.",
            "Sure, yeah, we should create a local region with local chirality.",
            "Have a metallic tube, so depending on the the scam distance, the length of the region you've made it will.",
            "You have junction properties if it's if it's a reasonably long region, you have a proper semiconducting metallic semiconductor fits a very short region.",
            "You have much more band bending and more complicated structure, but yeah.",
            "Show images of C60 in analogy.",
            "Or is it stuck?",
            "Can you transport particles to the knowledge it?",
            "It depends on your filling.",
            "If you don't, if it is not completely full, then yes, they are free to move and we have done time lapse images where you can see the following is moving up and down and there's some ability.",
            "Yeah exactly, it's not.",
            "Yeah, it's visible.",
            "The other thing that they've done is they take larger followings like see 84 and you can put 2 Gallagher linium atoms within the following and you can see these rotating so you can see their local movement here.",
            "Yeah.",
            "Effect.",
            "We have expected.",
            "Also may be reversed, but then he wants to perfect tonight, right?",
            "It's it's a good question.",
            "There's different ways you can.",
            "These you can use dislocations and suchlike to move defects.",
            "So you can in principle you can anneal defects out to a certain extent if you can encourage vacancies to aggregate, they'll stitch up along the line and you end up with a tube section that's smaller but perfect.",
            "You can just use fairly classical chemistry if you've got vacancies.",
            "If you expose it to air, you'll terminate any dangling bonds with hydrogen or OH, so it's not a perfect too, but it's removed a lot of the chemical reactivity.",
            "Otherwise, the standard technique is to anneal if you can anneal in vacuum and under argon you can remove a lot of the damage.",
            "But I'm.",
            "Yeah.",
            "Speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In non France, doctor Uhls graduated Department of Materials and Keble College you Oxford University.",
                    "label": 0
                },
                {
                    "sent": "From 1994 to 1997, Doctor Use versus Research Assistant in the Department of Physics at the University of Exeter.",
                    "label": 0
                },
                {
                    "sent": "Where he studied defects in semiconductors for for his PhD.",
                    "label": 0
                },
                {
                    "sent": "Later he moved to the University of Sussex, Brighton and for three years he joined the group of Professor Malcolm Peggy to study study carbon nanostructures in the same.",
                    "label": 0
                },
                {
                    "sent": "He was also involved in Vega Project initiated by the normal price low Rate Surgery Protocol.",
                    "label": 0
                },
                {
                    "sent": "I should mention here that they got science track project is dedicated to the science, broadcasting and communication from Brighton.",
                    "label": 0
                },
                {
                    "sent": "Dr Hills moved.",
                    "label": 0
                },
                {
                    "sent": "Very.",
                    "label": 0
                },
                {
                    "sent": "And then he finally settled at the Institute of Materials in non France.",
                    "label": 0
                },
                {
                    "sent": "So far Doctor use publish trip book chapters and the large number of articles among them.",
                    "label": 0
                },
                {
                    "sent": "I would emphasize articles in non nature materials and physical regulators.",
                    "label": 0
                },
                {
                    "sent": "At the same time, look to U-verse was recently awarded the prestigious Marie Curie Excellence Award by the EU 105.",
                    "label": 0
                },
                {
                    "sent": "Night of today's talk is topology, structure, and effects in carbon nano systems, and we're all looking forward to hearing.",
                    "label": 0
                },
                {
                    "sent": "Thank you for my kind invitation Dennis.",
                    "label": 0
                },
                {
                    "sent": "It's a pleasure to be back in Ljubljana.",
                    "label": 0
                },
                {
                    "sent": "I've visited several Times Now and it's a lovely country and the lovely great institution.",
                    "label": 0
                },
                {
                    "sent": "I'd like to start with an apology for those of you who know a little bit about nanotubes and followings, I'm going to do a very, very general introduction for complete beginners just to begin with, but we'll get onto some more juicy.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pickle stuff at the end.",
                    "label": 0
                },
                {
                    "sent": "Just to introduce my Institute somewhere just South of Brittany on the West coast of France.",
                    "label": 0
                },
                {
                    "sent": "So if you fancy your crepes in your cider, feel free to come and visit or Institute specializing materials, solar power, battery production and I work in the section on physics of nanostructures and nanomaterials.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I'm not sure why, but here it is.",
                    "label": 0
                },
                {
                    "sent": "I'd like to start off with this guy.",
                    "label": 0
                },
                {
                    "sent": "Just a common or garden pencil.",
                    "label": 0
                },
                {
                    "sent": "For those of you who work with pencil, the one which is probably most of us, you may not think you're doing a lot of nano.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Analogy, but you are.",
                    "label": 0
                },
                {
                    "sent": "In English, it's often called the LED pencil, but that's a misnomer.",
                    "label": 0
                },
                {
                    "sent": "It's actually graphite in the core.",
                    "label": 0
                },
                {
                    "sent": "They called it LED pencil because when they first found the graphite in the in the minds it was shiny.",
                    "label": 0
                },
                {
                    "sent": "Looks a bit like lead, and they thought maybe it was a metal, but it's not, it's a.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Of carbon there's actually multiple forms of carbon.",
                    "label": 0
                },
                {
                    "sent": "Pure carbon.",
                    "label": 0
                },
                {
                    "sent": "We've got graphite at the top point with pencil point.",
                    "label": 0
                },
                {
                    "sent": "We've got Diamond over here.",
                    "label": 0
                },
                {
                    "sent": "Another structural form and just very recently we've started to produce these molecular forms of carbon.",
                    "label": 0
                },
                {
                    "sent": "So the field of carbon science.",
                    "label": 0
                },
                {
                    "sent": "Although it's an ancient one.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is undergoing a revolution.",
                    "label": 0
                },
                {
                    "sent": "So what goes on in graphite?",
                    "label": 0
                },
                {
                    "sent": "Well, if we start, this is a carbon Atom and in graphite it can form 3 bonds.",
                    "label": 0
                },
                {
                    "sent": "So I've just turned them on like this.",
                    "label": 0
                },
                {
                    "sent": "This is about the only bit of chemistry you're going to get today, but if a bond is negative then you can see they want to repel each other, so they want to be as far away from each other as possible so you end up forming a trigonal arrangement, lightness, putting the bonds as far apart as possible.",
                    "label": 0
                },
                {
                    "sent": "So if we bond this carbon to another one.",
                    "label": 0
                },
                {
                    "sent": "We",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "End up with them and this one's got the same trigonal arrangement.",
                    "label": 0
                },
                {
                    "sent": "If we keep going.",
                    "label": 0
                },
                {
                    "sent": "You can see that you naturally by having just three bonds repelled from each other as much as possible, you start to form hexagonal structures.",
                    "label": 0
                },
                {
                    "sent": "And these bonds coming off here we can continue to do the same thing.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We keep going.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "After forming hexagons, you end up with sheets of hexagons, honeycomb structures, so this is the basic structure of a sheet of graphite.",
                    "label": 0
                },
                {
                    "sent": "All the atoms are laid in a flat plane and each each corner point here is 1 carbon Atom with three bonds.",
                    "label": 0
                },
                {
                    "sent": "That's the.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Basis of graphite carbon chemistry and the key point here is that graphite sheets are flat graphitic chemist who was in the Flat Earth chemistry until.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "80s.",
                    "label": 0
                },
                {
                    "sent": "Flat and not particularly interesting.",
                    "label": 0
                },
                {
                    "sent": "You got a lot of repetition.",
                    "label": 0
                },
                {
                    "sent": "And it's all about the same.",
                    "label": 0
                },
                {
                    "sent": "If you put these flat layers on top of each other, I've got my my visual aid here.",
                    "label": 0
                },
                {
                    "sent": "You've got very strong bonding within the sheet, 'cause they're strong chemical bonds, and these flat sheets can sit on top of each other, one on top of the other.",
                    "label": 0
                },
                {
                    "sent": "And you can see that they slide over each other very easily, and this is my graphites actually used as a lubricant.",
                    "label": 0
                },
                {
                    "sent": "So although you've got extremely is a bit paradoxical, you've got these very strong bonds in the plane, but such weak bonding between the planes that they can slide over each other.",
                    "label": 0
                },
                {
                    "sent": "And that's the crystal structure of graphite.",
                    "label": 0
                },
                {
                    "sent": "And that's where our car.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Graphite story was until the 80s and we go from very small to very large.",
                    "label": 0
                },
                {
                    "sent": "Because there was a bunch of chemists in Sussex and some scientists in Rice University and they were interested in the formation of stars.",
                    "label": 0
                },
                {
                    "sent": "And galaxies and you start with large gas clouds and these gas clouds condense and form the hot stars.",
                    "label": 0
                },
                {
                    "sent": "And if we do spectroscopy, if we look at the light absorption of these gas clouds, there's lots of carbon in them.",
                    "label": 0
                },
                {
                    "sent": "And they thought.",
                    "label": 0
                },
                {
                    "sent": "I mean, they see signals from like small chains of carbon atoms and other signals from different combinations of carbon atoms, and they're wondering what was going on in this.",
                    "label": 0
                },
                {
                    "sent": "So they decided to try and recreate the carbon chemistry of stars in the laborat.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She.",
                    "label": 0
                },
                {
                    "sent": "Which sounds very flashy, but it's actually extremely easy to do, and you can do this at home if you fancy it, or we've done it in primary schools and laps around the world.",
                    "label": 0
                },
                {
                    "sent": "All you need is to go back to the pencil, two pencils.",
                    "label": 0
                },
                {
                    "sent": "Philly two graphite electrodes with a very small gap between them.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Any put these in a vacuum chamber so you pump out all the air.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you put a big voltage across them.",
                    "label": 0
                },
                {
                    "sent": "If you put a big enough voltage, you get a spark between the tips.",
                    "label": 0
                },
                {
                    "sent": "And this heats really massive heating in the local area and you produce a cloud of carbon which.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And starts to condense.",
                    "label": 0
                },
                {
                    "sent": "And if you take that cloud and you look at what's come off in terms of the size.",
                    "label": 0
                },
                {
                    "sent": "You could expect him, so each one of these peaks is a is a cluster of carbon atoms of a different size and the height of the peak shows you how much there is.",
                    "label": 0
                },
                {
                    "sent": "Now when they first did this, Harry Kroto and Rick Smalley and the others they expected to see a whole splatter peaks, but what they saw was this one peak.",
                    "label": 0
                },
                {
                    "sent": "Which corresponds to 60 carbon atoms came out so much higher than all the rest.",
                    "label": 0
                },
                {
                    "sent": "This is some other data by the Exxon Group in 1988, but the original experiment was done a few years before and the question is what was magic about this number 60 'cause there's obviously something particularly stable about this.",
                    "label": 0
                },
                {
                    "sent": "That's so they call this a magic number.",
                    "label": 0
                },
                {
                    "sent": "And they came up with various models.",
                    "label": 0
                },
                {
                    "sent": "They came up with models for little layers of graphite type structures with Inter bonding between and they came up with other models and none of them seem to fit.",
                    "label": 0
                },
                {
                    "sent": "Another gave this special number and.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Willem, they suddenly realized that it's graphite was no longer flat.",
                    "label": 0
                },
                {
                    "sent": "It was becoming round and this is the candidate.",
                    "label": 0
                },
                {
                    "sent": "This is C. 60.",
                    "label": 0
                },
                {
                    "sent": "And the reason it's special and the reason this is so important and was the beginning of nanotech.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "She really is this guy here.",
                    "label": 0
                },
                {
                    "sent": "You can see that for the flat sheet we had hexagons which you have here is 6 and this is a Pentagon.",
                    "label": 0
                },
                {
                    "sent": "We've got carbon atoms forming 5 bonds.",
                    "label": 0
                },
                {
                    "sent": "As soon as you've got five then you can no longer stay in this flat build.",
                    "label": 0
                },
                {
                    "sent": "You have to start becoming.",
                    "label": 0
                },
                {
                    "sent": "Curved and in fact, C 60 has 12 Pence.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Guns.",
                    "label": 0
                },
                {
                    "sent": "So here it is, goes under various names the Buckminster Fuller in the buckyball.",
                    "label": 0
                },
                {
                    "sent": "And this is the first new allotrope of carbon for 2000 years or more.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And just, incidentally, if you if you go home and try this and build a little vacuum chamber, if you've done it first, you would have gotten Nobel Prize.",
                    "label": 0
                },
                {
                    "sent": "But then you gotta think of something you know, I'm afraid.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So how do we make a Pentagon from this flat graphite sheet?",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's relatively simple.",
                    "label": 0
                },
                {
                    "sent": "You cut out a wedge like segment.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Chop it out and we've now got all these dangling bonds.",
                    "label": 0
                },
                {
                    "sent": "All these carbon atoms are.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We got two.",
                    "label": 0
                },
                {
                    "sent": "They want a third, so we reform these third bonds.",
                    "label": 0
                },
                {
                    "sent": "And that pulls the two halves together, I can.",
                    "label": 0
                },
                {
                    "sent": "A little demonstration with a piece of paper.",
                    "label": 0
                },
                {
                    "sent": "Just rip out our wedge.",
                    "label": 0
                },
                {
                    "sent": "Pull the bonds together and you can see you naturally go from what we had was a flat sheet and we go to conical.",
                    "label": 0
                },
                {
                    "sent": "Conical section.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If I do that graphically, here you go.",
                    "label": 0
                },
                {
                    "sent": "This is the Pentagon, it's.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this is a side view.",
                    "label": 0
                },
                {
                    "sent": "You can see you've got this.",
                    "label": 0
                },
                {
                    "sent": "This curvature associated with Pentagon.",
                    "label": 0
                },
                {
                    "sent": "And in fact, if you take 12 pentagons, any number of hexagons, and this is a general rule, you form a closed object.",
                    "label": 0
                },
                {
                    "sent": "And it's not just in chemistry, so although we discovered.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In the 80s.",
                    "label": 0
                },
                {
                    "sent": "We could have just looked on the football field and we would have got the answer long before each Pentagon on their standard football is black.",
                    "label": 0
                },
                {
                    "sent": "Each hexagon is white, so next time you pop in place.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have a look and this guy could have told us all about it but we.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "I forgot to ask you.",
                    "label": 0
                },
                {
                    "sent": "Just to give you an idea of the scale.",
                    "label": 0
                },
                {
                    "sent": "Again, for the scientists in the audience.",
                    "label": 0
                },
                {
                    "sent": "This maybe isn't so shocking, but I still find this quite incredible as a ratio flowing into the football is roughly the same scale up as a football to the world.",
                    "label": 0
                },
                {
                    "sent": "So it's time you get a real sense of.",
                    "label": 0
                },
                {
                    "sent": "It's like looking back and looking at the stars and suddenly releasing there a lot further away than you imagine.",
                    "label": 0
                },
                {
                    "sent": "These are very.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "Another tenant, here's the science of the very small.",
                    "label": 0
                },
                {
                    "sent": "And because we can have any number of accidents, this is a larger cage.",
                    "label": 0
                },
                {
                    "sent": "There still has 12.",
                    "label": 0
                },
                {
                    "sent": "Pentagons",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The more hexagons we can stick it within another one again, you can start to see.",
                    "label": 0
                },
                {
                    "sent": "Here's the pentagons on the corners, and we're getting flatter.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Asians of hexagons?",
                    "label": 0
                },
                {
                    "sent": "Here's another one.",
                    "label": 0
                },
                {
                    "sent": "This is a sort of Russian doll type structure.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Have balls with him.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Rules.",
                    "label": 0
                },
                {
                    "sent": "We can keep going, and here's an experimental electron micrograph of exactly that.",
                    "label": 0
                },
                {
                    "sent": "This week all the carbon onion, because it's like the shells on an onion.",
                    "label": 0
                },
                {
                    "sent": "Each one of those lines is 1.",
                    "label": 0
                },
                {
                    "sent": "One following cage, and you can start to see the lines forming.",
                    "label": 0
                },
                {
                    "sent": "There will be a Pentagon here and.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And up here.",
                    "label": 0
                },
                {
                    "sent": "Here's another very lovely picture by I think it's flowing Banhart.",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hum.",
                    "label": 0
                },
                {
                    "sent": "And other examples where we see this pentagonal in nature lends tackled in 1900.",
                    "label": 0
                },
                {
                    "sent": "A lovely book with an optical microscopy just did hand drawn pictures.",
                    "label": 0
                },
                {
                    "sent": "Various small biological organisms or sponges and various other things.",
                    "label": 0
                },
                {
                    "sent": "And here's one of his pictures.",
                    "label": 0
                },
                {
                    "sent": "Absolutely lovely.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And if you look on here in order to get the curve structure.",
                    "label": 0
                }
            ]
        },
        "clip_37": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "There's a hexagon, and there's a Pentagon.",
                    "label": 0
                },
                {
                    "sent": "That's cool, I should say, it only applies if all the lengths the bond lengths, or that are roughly the same, but you can see the same thing in flies eyes on the backs of turtles.",
                    "label": 0
                }
            ]
        },
        "clip_38": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just 'cause I like them, here's a couple more pictures than that.",
                    "label": 0
                },
                {
                    "sent": "If you look at check of his name on the web, and in fact there's a whole bunch of fullerene structures which are being named after him called.",
                    "label": 0
                }
            ]
        },
        "clip_39": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Acolytes",
                    "label": 0
                }
            ]
        },
        "clip_40": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's some more.",
                    "label": 0
                },
                {
                    "sent": "And from the very small there's a much larger scale in architecture.",
                    "label": 0
                },
                {
                    "sent": "This is the original patent drawing by Buckminster Fuller who was an American architect and somewhat visionary, and he was designing geodesic domes and geodesic domes show exactly this.",
                    "label": 0
                }
            ]
        },
        "clip_41": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You've got a. Pentagon in the middle.",
                    "label": 0
                },
                {
                    "sent": "Here hexagon there because this is half a sphere.",
                    "label": 0
                },
                {
                    "sent": "You've only got 6, so you should have 5 around the edge and one in the center.",
                    "label": 0
                },
                {
                    "sent": "And it's thanks to this guy that in fact Harry Kroto suggested that the 660 should be called buckminsterfullerene, because it was all done in architecture before it.",
                    "label": 0
                }
            ]
        },
        "clip_42": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Stunning chemistry.",
                    "label": 0
                },
                {
                    "sent": "And that is about Mr.",
                    "label": 0
                }
            ]
        },
        "clip_43": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With one of his dreams.",
                    "label": 0
                },
                {
                    "sent": "Here's another one in the Epcot Center for those of you in today.",
                    "label": 0
                }
            ]
        },
        "clip_44": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Land in Florida, and even though if you look on the cover of Time magazine.",
                    "label": 0
                }
            ]
        },
        "clip_45": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "If you look on the top of his head.",
                    "label": 0
                }
            ]
        },
        "clip_46": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You got hexagons and following the rule pentagons.",
                    "label": 0
                }
            ]
        },
        "clip_47": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Zone.",
                    "label": 0
                },
                {
                    "sent": "So we've used pentagons to go away from this flat world into a curved world, but how else can we do it?",
                    "label": 0
                },
                {
                    "sent": "And from 8086 to about 91 this was pentagons for the only way and then somebody observed that if you take a flat sheet the other way.",
                    "label": 0
                }
            ]
        },
        "clip_48": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Curl up.",
                    "label": 0
                },
                {
                    "sent": "And now into the world of the nanotube.",
                    "label": 0
                },
                {
                    "sent": "So we take our flat sheet of graphite and just by distorting every bond ever so slightly, you can roll.",
                    "label": 0
                }
            ]
        },
        "clip_49": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Conformer tube and depending on how you roll.",
                    "label": 0
                },
                {
                    "sent": "For example, if you take the two sides here and roll up, you'll have this sort of zigzag pattern along the ends of the tube.",
                    "label": 0
                },
                {
                    "sent": "If you take the two top and bottom and roll up you have.",
                    "label": 0
                },
                {
                    "sent": "Here what we call an arm chair pattern.",
                    "label": 0
                },
                {
                    "sent": "You have to be here a bit of an artist to see why it's an arm chair, but you can just have outdoor structure and if you take the two corners and roll from there to there, you have a sort of spiral.",
                    "label": 0
                },
                {
                    "sent": "Allow.",
                    "label": 0
                }
            ]
        },
        "clip_50": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Access the nanotube.",
                    "label": 0
                },
                {
                    "sent": "So here's an armchair nanotube, his exact tube, and he's a kaylan.",
                    "label": 0
                },
                {
                    "sent": "In fact, depending on how you roll, you end up with different electrical conductivity in the tubes.",
                    "label": 0
                },
                {
                    "sent": "These guys are metallic.",
                    "label": 0
                },
                {
                    "sent": "These guys are either semiconducting or metallic, and these are metallics so you can change the electronic proper.",
                    "label": 0
                }
            ]
        },
        "clip_51": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "YouTube by rolling it the correct way.",
                    "label": 0
                },
                {
                    "sent": "I'm not going to go into the numbers, but nanotubes are touted as this wonder material.",
                    "label": 0
                },
                {
                    "sent": "Alot of it is down to their excessive is.",
                    "label": 0
                }
            ]
        },
        "clip_52": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "LM.",
                    "label": 0
                },
                {
                    "sent": "Figures, and particularly the tensile strength of their 10 times stronger than steel in principle and six times lighter.",
                    "label": 0
                },
                {
                    "sent": "So you can immediately imagine all sorts of mechanical applications in composites in bridge building in airplanes and superelastic you can stretch them.",
                    "label": 0
                },
                {
                    "sent": "They've got very low bending stiffness and they're very flexible and this is without considering their electrical properties there.",
                    "label": 0
                },
                {
                    "sent": "Fantastic conductors.",
                    "label": 0
                },
                {
                    "sent": "They firmly conduct much better than copper.",
                    "label": 0
                }
            ]
        },
        "clip_53": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Just to show that you can bend them, here is just a simple model of a bent nanotube and then just like tubes because these are chemical bonds, it's not like a normal fiber where you can crack locally here the bonds.",
                    "label": 0
                }
            ]
        },
        "clip_54": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reform when he's taking the tube.",
                    "label": 0
                },
                {
                    "sent": "And here's an electron micrograph, which you can just see showing exactly that.",
                    "label": 0
                },
                {
                    "sent": "You can see the folds in the tube.",
                    "label": 0
                }
            ]
        },
        "clip_55": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And his work where you don't get fatigue, you can bend a nanotube, straighten it as many times as you want, because these chemical bonds are chemical bonds and this is an example lovely piece of work by Richard Superfine and his group, where they took an AFM tip and they took a nanotube and they bent it just by pushing.",
                    "label": 0
                },
                {
                    "sent": "It must have must have killed some graduate student to do this so very painstaking work, but they bent it.",
                    "label": 0
                },
                {
                    "sent": "They re straightened it, they bent it, they re straightened it and now.",
                    "label": 0
                }
            ]
        },
        "clip_56": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Effect on the managing.",
                    "label": 0
                },
                {
                    "sent": "How you make them?",
                    "label": 0
                },
                {
                    "sent": "It's roughly the same as making 60, but you also use metal catalyst particles.",
                    "label": 0
                }
            ]
        },
        "clip_57": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Iron, nickel or cobalt or thereabouts, and here's a typical reactor.",
                    "label": 0
                },
                {
                    "sent": "It's got a screen on the front to protect you and inside there there's the tool.",
                    "label": 0
                }
            ]
        },
        "clip_58": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Towson, that's the pump.",
                    "label": 0
                },
                {
                    "sent": "There's the two electrodes and here's the.",
                    "label": 0
                }
            ]
        },
        "clip_59": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we could do picture of a spark and afterwards this is the electrode.",
                    "label": 0
                },
                {
                    "sent": "You can see it's been.",
                    "label": 0
                },
                {
                    "sent": "It's got lots of deposits on it and this is around the base of the electrode and you can see these kind of spider web structures and actually it's those.",
                    "label": 0
                },
                {
                    "sent": "If we collect those, that's where all the nanotubes are.",
                    "label": 0
                },
                {
                    "sent": "So you can see the disadvantage.",
                    "label": 0
                }
            ]
        },
        "clip_60": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This technique we don't produce a lot, so better ways.",
                    "label": 0
                },
                {
                    "sent": "This is called CVD.",
                    "label": 0
                },
                {
                    "sent": "Here you have a big furnace and you pass a carbon based gas along and through the furnace and in here it heats up so much the gas breaks down and starts to form carbon deposits on the substrate and if you've got metal catalysts there than you.",
                    "label": 0
                }
            ]
        },
        "clip_61": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nanotubes and you form these forests or carpets.",
                    "label": 0
                },
                {
                    "sent": "People call them.",
                    "label": 0
                },
                {
                    "sent": "You can see they're all growing up the substrate, and if you zoom in a bit more you can see them going.",
                    "label": 0
                },
                {
                    "sent": "Here's a bigger zoom.",
                    "label": 0
                },
                {
                    "sent": "And finally, if you go right down to the smaller scale, these are single.",
                    "label": 0
                }
            ]
        },
        "clip_62": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nano nanotubes.",
                    "label": 0
                },
                {
                    "sent": "As well as following singles, you conform them.",
                    "label": 0
                },
                {
                    "sent": "This is a double wall tube.",
                    "label": 0
                },
                {
                    "sent": "You can see the two lines or multiwalled tubes of different sizes.",
                    "label": 0
                },
                {
                    "sent": "This was the first published multiwalled work by.",
                    "label": 0
                }
            ]
        },
        "clip_63": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Assuming ojima.",
                    "label": 0
                },
                {
                    "sent": "And the nanotubes naturally formed bundles.",
                    "label": 0
                },
                {
                    "sent": "This is looking end on.",
                    "label": 0
                },
                {
                    "sent": "You can see their pact Hexagonally.",
                    "label": 0
                },
                {
                    "sent": "'cause they like to stick to each other and it's only week Vander Waals forces.",
                    "label": 0
                },
                {
                    "sent": "But at this scale along all the length of the tube, that's quite a list.",
                    "label": 0
                }
            ]
        },
        "clip_64": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An attraction between the tubes.",
                    "label": 0
                },
                {
                    "sent": "We can do a little bit more than we can fill them with metal.",
                    "label": 0
                },
                {
                    "sent": "This is quite an early picture, but we can no metal fill almost continually and make make nanoscale wires.",
                    "label": 0
                },
                {
                    "sent": "We can put other molecules.",
                    "label": 0
                }
            ]
        },
        "clip_65": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Side here we got these little see 60s inside.",
                    "label": 0
                }
            ]
        },
        "clip_66": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nanotube so it's called a people structure 'cause it looks like peas in a pod.",
                    "label": 0
                }
            ]
        },
        "clip_67": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the electronic properties of these here we can see again this is metallic.",
                    "label": 0
                },
                {
                    "sent": "'cause there's finite density of states over the whole gap here is just above 0.",
                    "label": 0
                },
                {
                    "sent": "This is a semiconducting too, because it actually touches 0 for and gives you a finite bandgap.",
                    "label": 0
                },
                {
                    "sent": "The bank app also depends on the size of the tube, the diameter, the two.",
                    "label": 0
                },
                {
                    "sent": "So one of the big problems is we have a mess.",
                    "label": 0
                },
                {
                    "sent": "We have a result of material in that spider web with a mixture of metallic and semiconducting with all different gaps.",
                    "label": 0
                },
                {
                    "sent": "So a lot of the current research at the moment is to try to find ways to make just one sort of tube.",
                    "label": 0
                }
            ]
        },
        "clip_68": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "With the reproducible properties.",
                    "label": 0
                },
                {
                    "sent": "And here's something you can do with him.",
                    "label": 0
                },
                {
                    "sent": "You can make transistors.",
                    "label": 0
                },
                {
                    "sent": "He got two electrodes with a nanotube.",
                    "label": 0
                }
            ]
        },
        "clip_69": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Lying across.",
                    "label": 0
                },
                {
                    "sent": "And you get classical transistor response.",
                    "label": 0
                },
                {
                    "sent": "This is the voltage current curve.",
                    "label": 0
                }
            ]
        },
        "clip_70": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And you can even do single devices within a single nanotube.",
                    "label": 0
                },
                {
                    "sent": "Here we got a nanotube in the kinked it.",
                    "label": 0
                },
                {
                    "sent": "And So what they've done is produce two sections with different chirality.",
                    "label": 0
                },
                {
                    "sent": "So once the semiconductor ones are metal and you've got a semi conduct.",
                    "label": 0
                }
            ]
        },
        "clip_71": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Metal Junction in the same tube.",
                    "label": 0
                },
                {
                    "sent": "And here's the IV characteristics and you can see it's a classic diode rectifying diode.",
                    "label": 0
                }
            ]
        },
        "clip_72": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's a lovely way people can use nanotubes field emission.",
                    "label": 0
                },
                {
                    "sent": "So in this case the nanotubes is standing up vertically, like those forests, and there's electrons being sprayed off the tips onto this display.",
                    "label": 0
                },
                {
                    "sent": "And this again is that.",
                    "label": 0
                },
                {
                    "sent": "I mean this is quite quite an early picture.",
                    "label": 0
                },
                {
                    "sent": "They've gotten principle much bigger.",
                    "label": 0
                }
            ]
        },
        "clip_73": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Vanity displays now.",
                    "label": 0
                },
                {
                    "sent": "And for mechanical properties you can make fibers, so this is this is this is no longer nanoscale.",
                    "label": 0
                },
                {
                    "sent": "This is Marco 'cause these are.",
                    "label": 0
                },
                {
                    "sent": "These are woolen fibers or some sort of woven fiber.",
                    "label": 0
                },
                {
                    "sent": "And here you can see Fibers made from bundles and nanotube together mixed with a polymer and this is a very very strong.",
                    "label": 0
                },
                {
                    "sent": "This effect is very tough.",
                    "label": 0
                },
                {
                    "sent": "It can absorb a lot of energy before it it fails.",
                    "label": 0
                },
                {
                    "sent": "And you can even make a capacitive fibers for storing energy.",
                    "label": 0
                },
                {
                    "sent": "So you mean in the future you might be able to have jackets.",
                    "label": 0
                },
                {
                    "sent": "Which actors batteries you can just plug your iPod into your jacket and charge up close.",
                    "label": 0
                },
                {
                    "sent": "Just like discharge through through your hair and people even talking about this is the speculative end of things.",
                    "label": 0
                },
                {
                    "sent": "Using nanotubes to make very strong fibers and this is the fabled space elevator.",
                    "label": 0
                },
                {
                    "sent": "The cable up into space and nanotubes.",
                    "label": 0
                },
                {
                    "sent": "In principle the only material strong enough to actually make this.",
                    "label": 0
                },
                {
                    "sent": "Whether it's possible even with nanotubes, is is an open question, but there's a lot of people working on it.",
                    "label": 0
                },
                {
                    "sent": "So that's a sort of general background and introduction to nanotubes and fullerenes and.",
                    "label": 0
                }
            ]
        },
        "clip_74": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Kevin, I wanted to go into a little bit onto more.",
                    "label": 0
                },
                {
                    "sent": "The area I've been working on recently and that's taking these lovely beautiful nanotubes and messing them up so.",
                    "label": 0
                }
            ]
        },
        "clip_75": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Why on Earth would we want to damage a nanotube?",
                    "label": 0
                },
                {
                    "sent": "Well, the trouble with the nanotube on itself is that it's a perfect surface and it's relatively unreactive, and in particular from these bundles they slide over each other.",
                    "label": 0
                },
                {
                    "sent": "So we actually one of the reasons to to damage the Mr is to activate the surface so that the nanotubes can lock, lock into other things, lock into polymers, lock into each other.",
                    "label": 0
                },
                {
                    "sent": "So here's a calculation we did, in fact originally inspired by nuclear applications.",
                    "label": 0
                },
                {
                    "sent": "If you radiate graphite to cause damage, and it's very similar to that in nanotubes, and there was an Atom here, these are two sheets of graphite or two nanotubes, and he's been knocked out and he's now down here, so this is a vacancy and interstitial pair.",
                    "label": 0
                },
                {
                    "sent": "And this is actually a metastable.",
                    "label": 0
                },
                {
                    "sent": "You've got a double bond here.",
                    "label": 0
                },
                {
                    "sent": "And it's locked into this position and you need to heat up and our calculations suggested you needed to heat to about 200 degrees C, and then you can pop back into his side.",
                    "label": 0
                }
            ]
        },
        "clip_76": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And why are these sort of defects important?",
                    "label": 0
                },
                {
                    "sent": "What can you do with these crosslinking ones?",
                    "label": 0
                },
                {
                    "sent": "Well, here's a sort of schematic of a bundle of nanotubes inside a polymer.",
                    "label": 0
                },
                {
                    "sent": "For example, if you wanted to make it like a glass fiber composite, instead of having glass fibers were using nanotubes.",
                    "label": 0
                },
                {
                    "sent": "In principle, this should strengthen the matrix, but the trouble is that if you pull a nanotube, it's very strong, but if you've got two nanotube side-by-side, they can slide over each other very easy, and so your share is actually not very good.",
                    "label": 0
                },
                {
                    "sent": "So you could imagine in a case like this, we might want to form these little bridging defects between the nanotubes to lock them in place, and that should actually make the whole thing, although it's kind of paradoxical, you're damaging the nanotubes, but the result maybe something a lot stronger.",
                    "label": 0
                },
                {
                    "sent": "And then grouper kitset LM in 2004 did some lovely work.",
                    "label": 0
                },
                {
                    "sent": "They put a bundle of nanotubes over a hole in the substrate and pushed it with an AFM tip.",
                    "label": 0
                },
                {
                    "sent": "And after radiation they find the bending modulus goes up by a factor of 30.",
                    "label": 1
                },
                {
                    "sent": "So this is there.",
                    "label": 0
                },
                {
                    "sent": "Seems to be a very actually a very promising way to strengthen.",
                    "label": 0
                }
            ]
        },
        "clip_77": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The two bundles.",
                    "label": 0
                },
                {
                    "sent": "Another way you could imagine improving mechanical properties if you take a multi wall tube.",
                    "label": 1
                },
                {
                    "sent": "If example taken multiple tube and you do torsional.",
                    "label": 0
                },
                {
                    "sent": "Damage you twist it, you're only really interacting with the outer layer.",
                    "label": 0
                },
                {
                    "sent": "There's minor interaction with the inner layers through compression, but only very minor, and it's a waste of all this carbon inside you quite like to get all this involved in the mechanical strengthening as well, and one way you could do that is to make little links between the walls.",
                    "label": 0
                },
                {
                    "sent": "With the defect I showed you with other defects.",
                    "label": 0
                },
                {
                    "sent": "And this might actually improve the mechanical response of the multiwalled nanotubes.",
                    "label": 0
                },
                {
                    "sent": "And I'm not necessarily suggesting this is what's going on.",
                    "label": 0
                },
                {
                    "sent": "There's a.",
                    "label": 0
                },
                {
                    "sent": "There's a number of candidates, but.",
                    "label": 0
                },
                {
                    "sent": "Done whiteness group in this world.",
                    "label": 0
                },
                {
                    "sent": "It's some statistical studies of breaking force and they took the so-called perfect or much less defective hip code tubes and they took with highly defective CD tubes.",
                    "label": 0
                },
                {
                    "sent": "If you see pictures of these there, there there anything but flat walls and these actually have higher breaking forces than the perfect tubes.",
                    "label": 1
                },
                {
                    "sent": "So again another paradox that defects and damage may actually improve.",
                    "label": 0
                }
            ]
        },
        "clip_78": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Mechanical properties.",
                    "label": 0
                },
                {
                    "sent": "On the flip side, what happens if you pull really, really?",
                    "label": 0
                },
                {
                    "sent": "But I mean you can't.",
                    "label": 0
                },
                {
                    "sent": "This is very difficult to do experimentally, but it's it's relatively easy for us to do in our computer simulations, so that's why we do it.",
                    "label": 0
                },
                {
                    "sent": "If you pull a nanotube, you can start to rotate these bonds.",
                    "label": 0
                },
                {
                    "sent": "Two of the carbon atoms will switch around, and when you rotate a pair, you start to form different defects.",
                    "label": 0
                },
                {
                    "sent": "Instead of having hexagons here, we formed a Pentagon and a heptagon.",
                    "label": 0
                },
                {
                    "sent": "Two pairs, and these actually implying dislocations.",
                    "label": 0
                },
                {
                    "sent": "Keep pulling and by flipping more bonds, these can move apart from each other and you end up with a region of tube in the middle.",
                    "label": 0
                },
                {
                    "sent": "Although this is a dynamic simulation so it's a little hard to see this is a slightly smaller diameter but slightly elongated, so it's given in response to stress.",
                    "label": 0
                },
                {
                    "sent": "The chief gets thinner and longer.",
                    "label": 0
                },
                {
                    "sent": "So this is a duck tile failure of a nanotube.",
                    "label": 0
                },
                {
                    "sent": "No.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_79": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is very, very difficult to do, and the reason is this is the barrier we're talking nearly nine electron volts to rotate that bond.",
                    "label": 0
                },
                {
                    "sent": "So the amount of energy you need to do that, is it phenomenal.",
                    "label": 0
                },
                {
                    "sent": "But if you have defects, if you have vacancies or interstitials, here's the barrier with an interstitial present, 'cause interstitial can catalyze these rotations.",
                    "label": 0
                },
                {
                    "sent": "So these little local defect sites can catalyze plastic definite defamation nanotubes.",
                    "label": 0
                },
                {
                    "sent": "This can is only 2.29, so this can happen at much lower temperatures or much lower stress.",
                    "label": 0
                }
            ]
        },
        "clip_80": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Enforces.",
                    "label": 0
                },
                {
                    "sent": "And not so long ago, January 2006.",
                    "label": 0
                },
                {
                    "sent": "Lovely piece of microscopy.",
                    "label": 0
                },
                {
                    "sent": "They took a carbon nanotube and stretched it by heating and the electron microscope and they're able to stretch in length and 24 nanometers to 91, which is, for me is an incredible that the chip didn't break.",
                    "label": 0
                },
                {
                    "sent": "This was a continuous stretching.",
                    "label": 0
                },
                {
                    "sent": "They hated it by passing electric current.",
                    "label": 1
                },
                {
                    "sent": "The diameter shrunk by 15 times.",
                    "label": 1
                },
                {
                    "sent": "And yet they still didn't fail and the result was a stronger tube as well, presumably because lots of the damage was.",
                    "label": 0
                },
                {
                    "sent": "Was running around, but these points here it's very difficult to see, but there little kinks.",
                    "label": 0
                },
                {
                    "sent": "In the tube.",
                    "label": 0
                },
                {
                    "sent": "And I'll mention this a little bit later, but my suggestion is that these are dislocations in the nanotube which are running along the length.",
                    "label": 0
                },
                {
                    "sent": "In response this pulling, but this they did at very very high temperatures.",
                    "label": 0
                },
                {
                    "sent": "So I don't think we have to worry about nanotubes failing in general mechanical applications.",
                    "label": 0
                },
                {
                    "sent": "Maybe for high temperature applet.",
                    "label": 0
                }
            ]
        },
        "clip_81": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Nations we have to worry about this.",
                    "label": 0
                },
                {
                    "sent": "So these defects, and I've been advised against using the word defect, 'cause it sounds like it's a problem, so we'll call them active sites instead of.",
                    "label": 0
                },
                {
                    "sent": "It is the same thing.",
                    "label": 0
                },
                {
                    "sent": "What else can we use them for apart from mechanical and one is chemical functionalization.",
                    "label": 0
                },
                {
                    "sent": "If you've got a perfect managing bullets very unreactive, so you need defect sites as attack sites for chemicals.",
                    "label": 0
                },
                {
                    "sent": "For example, if you want to bond polymer chains or biological markers if you want to bond other molecules for light harvesting for solar cell applications drug delivery composites you need.",
                    "label": 1
                },
                {
                    "sent": "Defective sites on the tube for electronic doping.",
                    "label": 0
                },
                {
                    "sent": "If you want to modify the Fermi level.",
                    "label": 0
                },
                {
                    "sent": "Gas absorption are highlighted.",
                    "label": 0
                },
                {
                    "sent": "This 'cause we've got a European project and only two hybrids on this at the moment.",
                    "label": 0
                },
                {
                    "sent": "And here's a gas sensor.",
                    "label": 0
                },
                {
                    "sent": "Have you looked at very small?",
                    "label": 0
                },
                {
                    "sent": "We got multi walled nanotubes and if you zoom in again the decorated with metal nanoparticles.",
                    "label": 0
                },
                {
                    "sent": "Which stick to the defective sites.",
                    "label": 0
                },
                {
                    "sent": "So it's absolutely essential for this that we have defective nanotubes.",
                    "label": 1
                },
                {
                    "sent": "In order to get a good uniform coverage of metal particles and another sort of fairly untouched.",
                    "label": 0
                },
                {
                    "sent": "But I think becoming important site of this is biological compatibility.",
                    "label": 0
                },
                {
                    "sent": "They've done their residents tests in living organisms and nanotubes because they are very unreactive.",
                    "label": 0
                },
                {
                    "sent": "They're very difficult for the body to get hold of, to interact with, and you can find quite often long.",
                    "label": 0
                },
                {
                    "sent": "Lifetimes within the body.",
                    "label": 0
                },
                {
                    "sent": "Long retention lifetimes of nanotubes.",
                    "label": 0
                },
                {
                    "sent": "If you're there's very early studies where they said if you take nitrogen doped nanotubes, so these are very active.",
                    "label": 0
                },
                {
                    "sent": "Surface is then the body can deal with those protein.",
                    "label": 0
                },
                {
                    "sent": "Wrap them and they expelled very quickly in the urine.",
                    "label": 0
                },
                {
                    "sent": "So for biological applications.",
                    "label": 0
                },
                {
                    "sent": "Quite aside from all the other toxicity testing and medical testing that's needed, defective tubes have.",
                    "label": 0
                }
            ]
        },
        "clip_82": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "A lot of promise.",
                    "label": 0
                },
                {
                    "sent": "So if we want these active sites or defects, how do we make them one?",
                    "label": 0
                },
                {
                    "sent": "Is doing growth, for example, nitrogen doping another is by chemical attack.",
                    "label": 1
                },
                {
                    "sent": "If you attack a nanotube flooring, you can coat the surface and another is irradiation and it's that.",
                    "label": 0
                },
                {
                    "sent": "I'd like to concentrate for the final section of my talk.",
                    "label": 0
                }
            ]
        },
        "clip_83": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Electron irradiation.",
                    "label": 0
                },
                {
                    "sent": "And it's the area I'm I'm working in a little bit at the moment.",
                    "label": 0
                },
                {
                    "sent": "It's I'm a theorist, I do computer modeling and it's it's a great time to be in this field because we've been looking at the atomic scale for donkeys years and we've had a free reign.",
                    "label": 0
                },
                {
                    "sent": "We just model whatever we wanted because nobody could see it until the last five or so years, and that these guys have caught up and they bring us to book.",
                    "label": 0
                },
                {
                    "sent": "So for the first time, they're producing pictures that match or don't match what we're doing in the modeling, so.",
                    "label": 0
                }
            ]
        },
        "clip_84": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's a fantastic time to be in the field.",
                    "label": 0
                },
                {
                    "sent": "He's just an example.",
                    "label": 0
                },
                {
                    "sent": "This is work by Alexander Glutton.",
                    "label": 0
                },
                {
                    "sent": "'cause we're not A and this is one of those people structures.",
                    "label": 0
                },
                {
                    "sent": "Again, these are following molecules within a nanotube.",
                    "label": 0
                },
                {
                    "sent": "This is a real experimental images and through a series of time sequences you see this following here is become damaged by the electron beam, 'cause these are very high energy electrons hitting the structure and they can knock atoms out.",
                    "label": 0
                },
                {
                    "sent": "One of the items have been locked in.",
                    "label": 0
                },
                {
                    "sent": "Its formed a bond to the wall, and here's one of our computer models of this with a little whether it agrees exactly or not, is it?",
                    "label": 0
                },
                {
                    "sent": "As a matter for the viewer, but.",
                    "label": 0
                }
            ]
        },
        "clip_85": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And this to go back to our little crosslinking defect.",
                    "label": 0
                },
                {
                    "sent": "We were very tough to be modeled.",
                    "label": 0
                },
                {
                    "sent": "This then published in 2003.",
                    "label": 0
                },
                {
                    "sent": "And a couple of years later, in 2005 again, the Group of Susuan Algo.",
                    "label": 0
                },
                {
                    "sent": "We're looking at double walled nanotubes, so it's effectively 2 sheets of carbon atoms and they see these little.",
                    "label": 0
                },
                {
                    "sent": "Defects appear which are little links between the walls.",
                    "label": 0
                },
                {
                    "sent": "And what they did, which was lovely.",
                    "label": 0
                },
                {
                    "sent": "They looked at this and heated the sample up and when they heated up to 200 degrees C, They found but they disappeared so they can measure it.",
                    "label": 0
                },
                {
                    "sent": "They can see visually at what temperature these defects annealed out, and at 200 degrees C matched exactly with our calculations.",
                    "label": 0
                },
                {
                    "sent": "So we're very pleased.",
                    "label": 0
                }
            ]
        },
        "clip_86": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And here's some stuff that they, well, it's impressed at the moment.",
                    "label": 0
                },
                {
                    "sent": "In general, American Chemical society here.",
                    "label": 0
                },
                {
                    "sent": "They took a functional group and they attached C 60.",
                    "label": 0
                },
                {
                    "sent": "This is to the outside of a nanotube, so you can't see it with a nanotube is here.",
                    "label": 1
                },
                {
                    "sent": "And they did various computer modeling without DfT, and these are the simulated images and you can see.",
                    "label": 0
                },
                {
                    "sent": "Some much better than others, but they're pretty good.",
                    "label": 0
                },
                {
                    "sent": "Pretty good matching the dark spots and the light spots, so here you're getting pictures of individual C 60 molecules and you can almost.",
                    "label": 0
                },
                {
                    "sent": "Pretty well, pick out the individual atoms.",
                    "label": 0
                },
                {
                    "sent": "And the really nice thing again under the electron beam, these become damaged.",
                    "label": 0
                },
                {
                    "sent": "And here's some damage ones, and they're able to model these with C 58, so these are C60 molecules that have lost two carbon atoms under electron beam and they get these distorted structures, so it's.",
                    "label": 0
                },
                {
                    "sent": "It's actually fantastically the resolution, and there's other work by these guys and related groups have seen individual vacancies.",
                    "label": 0
                }
            ]
        },
        "clip_87": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "There's also warning with this, 'cause what happens when we shine electron beam on a nanotube just by the act of observation with an electron beam, we damaged the very sample that we're looking at.",
                    "label": 1
                },
                {
                    "sent": "Because of these high energy electrons passing through the sample, some of them can hit individual atoms and knock them out, and this is a movie of a government and particularly watch down here you can see as time passes.",
                    "label": 0
                },
                {
                    "sent": "The actual tube starts to deform, and we're losing material.",
                    "label": 0
                },
                {
                    "sent": "The rate, the diameter the tube shrinks.",
                    "label": 0
                }
            ]
        },
        "clip_88": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here's another one there.",
                    "label": 0
                },
                {
                    "sent": "You see, we formed a little kink.",
                    "label": 0
                },
                {
                    "sent": "It's then moved out and we're getting other secondary kinks.",
                    "label": 0
                },
                {
                    "sent": "And then eventually.",
                    "label": 0
                },
                {
                    "sent": "We haven't actually destroyed this.",
                    "label": 0
                },
                {
                    "sent": "So we want to know a little bit more about the interaction of this electron beam the sample.",
                    "label": 0
                }
            ]
        },
        "clip_89": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now we're kicking these atoms out.",
                    "label": 0
                },
                {
                    "sent": "So can we computer model this interaction and what we did?",
                    "label": 0
                },
                {
                    "sent": "We started with these molecular dynamics simulations, so this is a dynamic simulation and what we do is we kick one Atom.",
                    "label": 1
                },
                {
                    "sent": "And make it harder and harder and harder until eventually.",
                    "label": 0
                },
                {
                    "sent": "Again, it's the first kick it pops back.",
                    "label": 0
                },
                {
                    "sent": "So that was no good, so we kick it again.",
                    "label": 0
                },
                {
                    "sent": "It never complaints.",
                    "label": 0
                },
                {
                    "sent": "We just keep kicking and eventually.",
                    "label": 0
                },
                {
                    "sent": "If you kick it hard enough.",
                    "label": 0
                },
                {
                    "sent": "It's going to take a little while.",
                    "label": 0
                },
                {
                    "sent": "Nearly.",
                    "label": 0
                },
                {
                    "sent": "No, please come back.",
                    "label": 0
                },
                {
                    "sent": "There we go, he's escaped.",
                    "label": 0
                },
                {
                    "sent": "So this way, with the molecular dynamics simulations, we know how much energy you need to provide in a kinetic kick to an Atom.",
                    "label": 0
                },
                {
                    "sent": "This is a sheet of boron nitride, but we've done the same with with graphite.",
                    "label": 0
                },
                {
                    "sent": "By combining that with some background.",
                    "label": 0
                }
            ]
        },
        "clip_90": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Siri we can look at kicking it in different directions.",
                    "label": 0
                },
                {
                    "sent": "And see whether there's preferential direction.",
                    "label": 0
                },
                {
                    "sent": "So this is a map of kicking one Atom out.",
                    "label": 0
                },
                {
                    "sent": "You can see it doesn't like to be kicked in this direction, 'cause there's another Atom in the way, so this is the big Hill in our plot.",
                    "label": 0
                }
            ]
        },
        "clip_91": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And we can generate a sort of a map of the kicking directions, and if we integrate over energy range because you start to kick it strong and strong wrangells, there's less energy transferred from the incoming electron to the outgoing Atom.",
                    "label": 0
                },
                {
                    "sent": "So we have to integrate over the region where there's sufficient energy transfer to cause this kick.",
                    "label": 0
                },
                {
                    "sent": "I'm.",
                    "label": 0
                }
            ]
        },
        "clip_92": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Get the knockout energy.",
                    "label": 0
                },
                {
                    "sent": "The energy for a single Atom in a sheet.",
                    "label": 0
                },
                {
                    "sent": "So once we have that energy we can start to play with it with a microscope.",
                    "label": 0
                },
                {
                    "sent": "So we calculated that for carbon if we were working at 80K electron volts electrons, we shouldn't damage the tube.",
                    "label": 0
                },
                {
                    "sent": "And sure enough, here's a single nanotube, 5 minutes, 50 minutes.",
                    "label": 0
                },
                {
                    "sent": "No damage the samples.",
                    "label": 0
                },
                {
                    "sent": "Resting it, it's the image quality is less good, which is why it's a bit fuzzy 'cause we were at lower voltages.",
                    "label": 0
                },
                {
                    "sent": "And we focus the beam, not just at the whole image, because this is a stem.",
                    "label": 0
                },
                {
                    "sent": "This is a focal beam.",
                    "label": 0
                },
                {
                    "sent": "We can focus it on.",
                    "label": 0
                }
            ]
        },
        "clip_93": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Navy, no damage there, but we can go further with the calculation.",
                    "label": 0
                },
                {
                    "sent": "So that was a calculation for perfect graphite, but here we can take this is the perfect a single Atom in a nanotube and this is a cross section of the tube and the color shows the cross section.",
                    "label": 0
                },
                {
                    "sent": "So essentially the likelihood of data mean kicked out and it's more likely to be kicked out of the top or bottom of the tube.",
                    "label": 0
                },
                {
                    "sent": "But we can look at atoms around defects, so here we have a single vacancy.",
                    "label": 0
                },
                {
                    "sent": "What's the chance of this guy game being kicked out?",
                    "label": 0
                },
                {
                    "sent": "And you can see that the cross section is much much higher than for an Atom in a perfect tube, and particularly if it's at the base of the tube.",
                    "label": 0
                },
                {
                    "sent": "So basically atoms next to pre existing vacancy are much more susceptible to being kicked out by the electron beam and we can go on if this one was kicked out.",
                    "label": 0
                },
                {
                    "sent": "That would be the defect will be the chance of kicking at this one, and again it's more likely than perfect tubes.",
                    "label": 0
                },
                {
                    "sent": "Less likely than this guy.",
                    "label": 0
                },
                {
                    "sent": "So this suggests that actually we should kick it once.",
                    "label": 0
                },
                {
                    "sent": "We've kept at one Atom, it should be a lot easier to kick out its neighbors in a line.",
                    "label": 0
                },
                {
                    "sent": "And we'll sort of zip the atoms out and allow.",
                    "label": 0
                }
            ]
        },
        "clip_94": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Pain along the tube and if we continue that, he's a modeling Albert is done of the using DfT and we've knocked out one Atom and then a whole line and we get these kinks.",
                    "label": 0
                },
                {
                    "sent": "And here's the simulated image of different types.",
                    "label": 0
                }
            ]
        },
        "clip_95": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Do we see that?",
                    "label": 0
                },
                {
                    "sent": "Well, here we've taken another nanotube.",
                    "label": 0
                },
                {
                    "sent": "We've gone up to 100 KV, so we're just above the damage threshold and we put the beam just in one area here.",
                    "label": 1
                },
                {
                    "sent": "And you can see after a period of time we've knocked.",
                    "label": 0
                },
                {
                    "sent": "I think it's about a minute or so 30 seconds.",
                    "label": 0
                },
                {
                    "sent": "We started to form a little kink, so then we put the beam here.",
                    "label": 0
                },
                {
                    "sent": "And we formed another little kink.",
                    "label": 0
                },
                {
                    "sent": "We put them here.",
                    "label": 0
                },
                {
                    "sent": "We formed another look at the Bing sits just outside so just touches the tube and based on the calculations we can say that each one of these kinks is from one to three isolated vacancies followed by chains of roughly about about 10 vacancy.",
                    "label": 0
                },
                {
                    "sent": "So with an electron beam we can almost this is in a controllable way.",
                    "label": 0
                },
                {
                    "sent": "We can almost now knockout individual atoms so we can sculpt this nanotube and knowing that the chirality changes due to this damage, Minton were causing look.",
                    "label": 0
                },
                {
                    "sent": "Maybe local chirality changes may be local.",
                    "label": 0
                },
                {
                    "sent": "Semiconductor metallic region.",
                    "label": 1
                },
                {
                    "sent": "So we got real spatial control.",
                    "label": 0
                },
                {
                    "sent": "We've got images showing the rest of the tubes is untouched.",
                    "label": 0
                }
            ]
        },
        "clip_96": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In fact, there's a little damage regions and the rest of the tube completely untouched.",
                    "label": 0
                },
                {
                    "sent": "So they sent me about done slightly ahead of time, but.",
                    "label": 0
                },
                {
                    "sent": "Just to turn back, just want to go back to the pencil and next time you are using a pencil have a think about it and just remember the time.",
                    "label": 0
                },
                {
                    "sent": "Underneath this big bold graphitic exterior.",
                    "label": 0
                }
            ]
        },
        "clip_97": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Work with graphite and Cassie on the high high resolution and of course Dennis and pull up the invitation and the rest of you for come.",
                    "label": 0
                }
            ]
        },
        "clip_98": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Here to listen.",
                    "label": 0
                },
                {
                    "sent": "Thank you very much.",
                    "label": 0
                },
                {
                    "sent": "It would be lovely to do the microscope we had hasn't got the appropriate stage to do transport measurements on single nanotubes, but this is.",
                    "label": 0
                },
                {
                    "sent": "I mean, this was obviously been lovely experiment to do to look at the transport characteristics every single tube.",
                    "label": 0
                },
                {
                    "sent": "The work presented here is this is only just finished and it's only only just submitted, so this is obviously the next thing to do to look at this year.",
                    "label": 0
                },
                {
                    "sent": "Stand.",
                    "label": 0
                },
                {
                    "sent": "Sure, sure, yeah, but if you want to do modeling of the transport, these are quite messy systems because you lose the periodicity of the tube.",
                    "label": 0
                },
                {
                    "sent": "Yeah, yeah, so it's possible to predict expensive.",
                    "label": 0
                },
                {
                    "sent": "Yeah, but I'm this was done using DfT codes which are faster than pure DfT, so there's hope.",
                    "label": 0
                },
                {
                    "sent": "May be related question.",
                    "label": 0
                },
                {
                    "sent": "To start with, the semiconducting nanotube and then you create damage like what will be what will happen with.",
                    "label": 0
                },
                {
                    "sent": "We created states in the gap or.",
                    "label": 0
                },
                {
                    "sent": "Sure, yeah, we should create a local region with local chirality.",
                    "label": 0
                },
                {
                    "sent": "Have a metallic tube, so depending on the the scam distance, the length of the region you've made it will.",
                    "label": 0
                },
                {
                    "sent": "You have junction properties if it's if it's a reasonably long region, you have a proper semiconducting metallic semiconductor fits a very short region.",
                    "label": 0
                },
                {
                    "sent": "You have much more band bending and more complicated structure, but yeah.",
                    "label": 0
                },
                {
                    "sent": "Show images of C60 in analogy.",
                    "label": 0
                },
                {
                    "sent": "Or is it stuck?",
                    "label": 0
                },
                {
                    "sent": "Can you transport particles to the knowledge it?",
                    "label": 0
                },
                {
                    "sent": "It depends on your filling.",
                    "label": 0
                },
                {
                    "sent": "If you don't, if it is not completely full, then yes, they are free to move and we have done time lapse images where you can see the following is moving up and down and there's some ability.",
                    "label": 0
                },
                {
                    "sent": "Yeah exactly, it's not.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's visible.",
                    "label": 0
                },
                {
                    "sent": "The other thing that they've done is they take larger followings like see 84 and you can put 2 Gallagher linium atoms within the following and you can see these rotating so you can see their local movement here.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Effect.",
                    "label": 0
                },
                {
                    "sent": "We have expected.",
                    "label": 0
                },
                {
                    "sent": "Also may be reversed, but then he wants to perfect tonight, right?",
                    "label": 0
                },
                {
                    "sent": "It's it's a good question.",
                    "label": 0
                },
                {
                    "sent": "There's different ways you can.",
                    "label": 0
                },
                {
                    "sent": "These you can use dislocations and suchlike to move defects.",
                    "label": 0
                },
                {
                    "sent": "So you can in principle you can anneal defects out to a certain extent if you can encourage vacancies to aggregate, they'll stitch up along the line and you end up with a tube section that's smaller but perfect.",
                    "label": 0
                },
                {
                    "sent": "You can just use fairly classical chemistry if you've got vacancies.",
                    "label": 0
                },
                {
                    "sent": "If you expose it to air, you'll terminate any dangling bonds with hydrogen or OH, so it's not a perfect too, but it's removed a lot of the chemical reactivity.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, the standard technique is to anneal if you can anneal in vacuum and under argon you can remove a lot of the damage.",
                    "label": 0
                },
                {
                    "sent": "But I'm.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Speaker again.",
                    "label": 0
                }
            ]
        }
    }
}