{
    "id": "vfpqxyqdlgyec4356qgv64etrsbfggqo",
    "title": "Spontaneous Symmetry Breaking at the Fluctuating Level",
    "info": {
        "author": [
            "Pablo I. Hurtado Fernández, Departamento de Electromagnetismo y Física de la Materia, University of Granada"
        ],
        "published": "Oct. 16, 2012",
        "recorded": "September 2012",
        "category": [
            "Top->Physics->Statistical Physics",
            "Top->Mathematics->Control Theory"
        ]
    },
    "url": "http://videolectures.net/cyberstat2012_hurtado_spontaneous_symmetry/",
    "segmentation": [
        [
            "So I'm going to talk about this spontaneous symmetry breaking at the fluctuating level, and this work has been done in collaboration with Pedro Garrido here at the University of Granada.",
            "Here you have some references where you can find details of the work.",
            "OK, so I'm going to start."
        ],
        [
            "Talking about the.",
            "Fluctuations in physical assisting and why I want to convey the idea that they are important not only because they are some noise that we want to remove it because they encode very important information that can give us insights on the system behavior.",
            "So in fact, starting fluctuating fluctuations is typically a free dual fruitful endeavor in physics.",
            "Let me give you some simple examples.",
            "I probably will not have to warm up.",
            "The first example is probably a Brownian motion.",
            "Well, you know that anything just by studying the fluctuations in the motion of mesoscopic particle immersed in a molecular liquid was able to infer the size of the demonic molecules of the system opening the door to experimental verification of a molecule hypothesis just by studying the fluctuations of this message.",
            "Scopic object in Brownian motion.",
            "This is another example in critical phenomena where you know that fluctuate."
        ],
        [
            "Things are essential to understand the physics of critical phenomena beyond phenomenological mean field models.",
            "Another an example which is."
        ],
        [
            "Nowadays very it's very active.",
            "It's the physics of more fish materials people.",
            "This is typing fluctuations of space, time correlation functions.",
            "The fluctuations of these correlations functions.",
            "Show some typical behavior.",
            "They have some very strong picks which point out to some very general phenomenon known as dynamic iteration 80, which is nothing but the coexistence, the continuous consistency in amorphous materials of patches of frozen particles together with other patches of very mobile particles.",
            "Seemingly this this phenomenon of consistent two different type of particles mobile enforcing is behind the physics of many more false materials, in fact people.",
            "Believe that this is truly at the heart of the glass transition, which, as you know, probably we don't know really the details nowadays and Alas, sample about the importance of."
        ],
        [
            "Punctuation with this is this fancy one is fluctuations in the cosmic microwave background.",
            "You know that nowadays we are able to measure these small fluctuations in the cosmic microwave background and people can trace back.",
            "These fluctuations to the tiny fluctuations in the mass distribution in the primordial universe and this is giving us information about structure formation at larger scales in the universe.",
            "So different examples from different influences just to convey the idea that standing fluctuations is valuable, that we get important information."
        ],
        [
            "So my."
        ],
        [
            "Articular case I'm in statistical physics physicist and I work in nonequivalent psychophysics.",
            "So here we have you probably know that we have a weak falling that we heard something today in Claudia's landing talk that we would like to define some nonequilibrium analogue of the free energy.",
            "We don't know how to do that in a clear.",
            "We know that we have the microscopic configuration, it gives weights, we know how to write down a partition function, and from that we reach the partition free energy.",
            "We don't know how to do that in nonequilibrium.",
            "We don't know how to go from microscopic to macroscopic.",
            "However, we know that there is an alternative to derive thermodynamic potential and that is studying the fluctuations of macroscopic observables.",
            "We study.",
            "This fluctuations were able to write down a question, for instance, for the free energy density.",
            "Hey, this is fine in equilibrium, but it's very important for Frank Librium cause there we don't know how to go from micro to macro.",
            "So studying fluctuations of macroscopic observables far from trivial, we believe that we can generalize the concept of free energy.",
            "So what's the main observable here that?"
        ],
        [
            "We will focus on later on, so this fundamental observable is what we call large division function and probably many of you know already what it is.",
            "So in any case, let me explain what is a large selection function in order to do that.",
            "The best thing is just to look at a couple of exam."
        ],
        [
            "Let's imagine we have an isolated system, an equilibrium system with some capital N particles are capital revolving queso, such that the densities hangover V OK.",
            "So now we look at the subsystem of this big system where we have little lying on little with volume little V OK. And now we ask the following question, what is the probability of observing a density rho in this in this volume?",
            "OK, we know that this as the volume of this system.",
            "Gross.",
            "The probability of observing identity here different, macroscopically different from the average density.",
            "It's going to decay exponentially fast with the volume.",
            "OK, so this is what I represent here.",
            "Imagine that this is how volume grows.",
            "This is our observable density in this system, and this is the probability density as the volume growth.",
            "This probability density is becomes P compete around the average density, which is a capital hangover capital V. OK, so this probability scales in this way exponentially fast with the volume, and this defines large deviation principle.",
            "OK, the rate function which defines how the probability for a given density rho, which might be very very different from the average density.",
            "This rate function is what people in the literature called large deviation function.",
            "We can do something similar on occasion, setting.",
            "The simplest one is for yellow, so we have some fluids on metal bar.",
            "Whatever we put its boundaries in contact with thermal, but at different temperatures.",
            "So T1T two different temperatures, so we let the system relax and we expect some hit current flowing through the system in some stationary state.",
            "Probably this system would be described by the microscopic level by Fourier low.",
            "OK, can you make a comment?",
            "Our current definition energy.",
            "Currently it's probably I will.",
            "It will become much more clear later on in that particular model, but you might end up here imaginary wall and you measure how much energy goes to the right minus the energy flow into the left.",
            "You integrate that overtime divided, divided by time, and this is some average current which for long times converges.",
            "Again today assemble average.",
            "So in this case again this time average current.",
            "Always a large deviation principle where the large parameters no longer volume but the time along which we integrate the current.",
            "OK, so this defined this FQ, which is the current large division function which tell us which is the probability of a given current fluctuation.",
            "We could ask questions as follows.",
            "Imagine this is a hot source.",
            "This is a cold sore, so average current should be.",
            "In this way we can ask the question which is the probability of observing.",
            "Average current which goes from the call to the Hartree server.",
            "This probably is very very low, but you can compute it for a given time and the function with controls.",
            "This probability is this large solution function.",
            "This this Ella distribution function have a typical shape, which is something like this, so they're everywhere negative except for some point where they are zero.",
            "And this point defines the average value of the observable.",
            "OK, they are or can be a symmetric around this.",
            "This this maximum they're quadratic expected, but on the test they do not have to be quadratic, which means that in general fluctuations large rare fluctuations do not have to be Gaussian.",
            "Why do we care about large division functions so?"
        ],
        [
            "In equilibrium, we know that these are one to one correspondence between, for instance, this problem, the last, the density, large traditional function and the entropy free energy.",
            "Depending on the setting.",
            "OK, in fact, instead if instead of thinking of this problem we think of the probability of observing and giving density profile in the system.",
            "This probability can always this large division function and this this large division function I.",
            "Is essentially the interval of the free energy density of the difference of the free energy density for their profile minus the free energy density of the stationary state OK, and the hope is that far from equilibrium, the equivalent large division function will play a role.",
            "The role of free energies, but far from Killebrew.",
            "OK. Anne."
        ],
        [
            "An IKEA step now to see what we have to study is to identify the relevant macroscopic observable we really care about in an equilibrium.",
            "There are many non equivalent system, but in many cases the system typically conserve localism quantity.",
            "The number of particles, charge energy something and it develops a current one when you subject the system to Bandar gradient or some external field.",
            "So in many nutrient system the current is the main observable.",
            "You want to understand you want on this and it says its statistics.",
            "In this way the study of current statistics has become one of the main objective of.",
            "Even still, physics in last years.",
            "In fact, if you go to archive you see plenty of papers about this topic knowledge.",
            "In principle, this is a very hard problem.",
            "In particular, we want to study from the microscopic POV.",
            "You can do that only in a very in a handful of oversimplified models, but we already know about these days nowadays.",
            "In the last decade, these people are turning the shoulder.",
            "Really Journal Ascenion Claudia Randy, who is here, have developed.",
            "Microscopic theoretical framework which allows us in principle to ask and solve this type of questions, which is the probability of serving a given current fluctuation.",
            "So the theory this is a crash course on the theory in just two lines.",
            "This is of course much more complicated thing, but let me give you a flavor of the theory.",
            "We typically have a conservative systems with its dynamics at the macroscopic level will be given by some.",
            "Continuity like equation and working in one dimension just to simplify things.",
            "Where at Roy some density, energy, density, mass density on Jul.",
            "Some some current feel OK, this current will typically away are constitutive equation which will be in diffusive system something like 4 yellow where the Roy song diffusivity and this is a gradient of the profile of the field plus some typically some noise which is mesoscopic.",
            "So this noise, the amplitude of this noise is 1 / N where N is the number of particles and assistant.",
            "Sorry one over square root of amplitude.",
            "Now we have the following question.",
            "This is a fluctuating Karina, so we want to understand the statistics of the following estimator of the ensemble average current.",
            "So we integrate over a space an long time to the fluctuating current, divided it by to this for long times very long times should converge to the average current, which is the one which solves for yellow.",
            "OK, so we want to know the probability of this current that we know that it obeys.",
            "Large deviation principle in this in this fashion here and the theory, they don't ask me why this I mean, you can.",
            "In fact you can from this path integral interpretation you can probably quickly see that this large deviation principle looks like something like this.",
            "OK, so it's complex object which solve which is a solution of a variational principle space and time dependent variational principle.",
            "This is nothing but the cost.",
            "Action of the quadratic cost of a fluctuation of a division of the current J from its average behavior, which is for yellow measure with the amplitude of the noise.",
            "Which is this dysfunctional?",
            "Sigma OK so the important thing to realize here is that the theory gives you a very exclusive, very elegant prediction about the current.",
            "Sorry about the last relation function for the current.",
            "Which depends essentially on two transport parameters, nothing else.",
            "You give me a very complicated microscopic model.",
            "And if you are smart enough to derive these two transport coefficient, which are essentially the diffusivity, and this is the mobility, which is fine, the current fluctuations and once you have these two transfer coefficient, we use microscopic filtration theory to derive the current last division function an.",
            "The optimal path."
        ],
        [
            "The optimal optimal path responsible of a given fluctuations.",
            "So for each current Q we have the solution of this variational problem give you the optimal path which brings you from the stationary state to discovering fluctuation OK, yes.",
            "No experience of your fluctuating current 1 / N Oh no sorry where it's at the end because I wanted to live technical discussion.",
            "If you read the correlator, Sigma Sigma is a field XD Sigma XTC by exploiting T prime this this correlator is essentially Sigma rho.",
            "Over end time Delta space, Delta time.",
            "Active so Gaussian white noise with an amplitude which is Sigma over N, where N is the number of particles in the system.",
            "OK.",
            "Anyhow, typically I mean this is formally incredibly nice, so you construct a lot of information even without solving explicitly the problem.",
            "But in general struck Ting information from this.",
            "This formalism is formidable problem.",
            "Extremely difficult, yes.",
            "This imply there was a fixed relationship between space and time.",
            "Sorry they saw the way you said it made it seem like in the definition of Sigma there was a fixed relationship between space and time in now because the noise is white and Goshen, so it's it's local.",
            "Yes.",
            "Hey.",
            "Well here then just working in one dimension.",
            "But you've got accenti.",
            "Well yeah, yeah 1 + 1.",
            "Action T are the same variance.",
            "Yes, I let me write the condition properly just to see if we're talking the same thing.",
            "Is.",
            "Sorry for.",
            "This is this functional Sigma fro over N Delta X -- X prime Delta T -- 3 prime.",
            "OK, but that's assuming that you've chosen a scale such that X is fluctuated the same yes yes yes.",
            "OK, OK, because I I I didn't go into technical this in order to do that you do first diffusive scaling.",
            "So you schedule time with Angle Square dance space with me so.",
            "You did, yeah.",
            "So I mean you have to do that before reaching all these all these questions.",
            "So that's why when you talk about Microsoft translation theory, you always said I did pledge to diffusive systems.",
            "So you're in the diffusive scaling limit.",
            "The full path, well, uh, path is a history of the.",
            "Basic trajectory or it's like dependence like rollbacks?",
            "No no no.",
            "It's a it's a trajectory of the density.",
            "And current fields.",
            "So row of XTJ of XT from time zero time to an I'm not selling technical details.",
            "These two fields are not independent, they are coupled via the continuity equation so they are not any 2 field so.",
            "What at the end of day it's technically convoluted to really solve the problem so.",
            "In English, English this and here is the number of particles.",
            "Let's imagine you have a chain or 1 dimensional change of oscillators.",
            "This number of oscillators.",
            "Pretty sure he does Delta function of X -- 6 prime there.",
            "Do I need it?",
            "You yeah.",
            "If you look at the motion of particles you you just need to know that the correlation function of Exile XT and side of X prime T at X = X prime.",
            "There's no actually, I've done well.",
            "That they were put in nature of the product?",
            "Yes, and this is like the locality of the noise.",
            "I mean, you could have different type of noises here, so you know noise, which the case exponentially in space or even fat.",
            "OK, OK. OK, later on.",
            "OK so one thing I want to remind you that the optimal path solution of these of the scene which means any story of these two couple fields is typically not the steady state profile.",
            "So imagine you have a full yellow so we have these two different temperature.",
            "This is this thing is simple so they link profile is linear OK. Do ask a question which is probably observing aggregating covering which is rare very very we are covering against the the grading whatever.",
            "So this profile can be this one.",
            "In fact, this is the solution of this problem in some particular case.",
            "OK, so it's really very different from the optimal profile an.",
            "OK, so solving this problem is typically very difficult, but.",
            "Happily, sometimes distance, choose the simplest path so this this simplifying hypothesis hypothesis normativity principle which was first proposed by between under reading 2004 that says the following that in many cases not not everything, not not in all cases, but in many cases Anna Wave brought in a broad range of fluctuations.",
            "This optimal paths are in fact I'm independent, so you can really forget about time.",
            "And the problem that it's very much simplified.",
            "OK, this has been tested in regular, extended, extensive numerical simulations and it works for a very wide current interval.",
            "So this is this additivity scenario.",
            "So even if the problem can be very complex, the system chooses to have a time independent optimal history, optimal profiles.",
            "However, this ideal scenario eventually breaks down for very large current fluctuations, so for currents.",
            "Above a critical current that we will see later on the system break this this activity picture and be at that dynamic phase transition of the fluctuating level involving a symmetry breaking and this is what I want to show you because we've measured this.",
            "We've seen this phenomenon and it's quite shocking.",
            "Do you have any intuition for this?",
            "See in simulations, no, no.",
            "It's it's a you can derive it the simple way.",
            "In fact, what direction is that?",
            "In order to transport some current.",
            "You have a 1 dimensional system, so you say what they say.",
            "Probability of having of transporting a current queue for a left hand at temperature TL to the right angle, temperature TR.",
            "So you assume some sort of additivity, so you assume that you can split this probability, divide the system at some point OK, and you said this probably is nothing but the product of two probabilities.",
            "The probability of transporting the same covering discovering is conserved.",
            "Between TL and the temperature at this point times the probability of transporting the same current between the temperature at this point and TR.",
            "Sorry for the shaking.",
            "Which is this tea?",
            "The one which maximizes this problem.",
            "Max T alright so you maximize this.",
            "These two things over the contact temperature.",
            "This is I believe maybe Claudia can help me, but there I mean this is original statement of the additivity hypothesis that mean you can really cut and then you see that immediately you can go do an iterative procedure and just start cutting the system in small pieces of offices.",
            "And this gives you an explicit prediction for the current loss division function, which later on was realized that it's equivalent to assuming that the optimal profile profile which solves this problem is time independent.",
            "OK, so that's why it's called additivity principle.",
            "Correct now.",
            "Yeah, I don't.",
            "I know empirically has work on these things, but I'm not very sure whether they did exactly the same thing.",
            "I don't know.",
            "OK, so that's that's the reason.",
            "Like kind of like 142 from no no I'm.",
            "1 dimensional, 1 dimensional or one German process or you have a many particle.",
            "Since I have many particle system so I'm going to talk about.",
            "I'm so that's the thing that I'm going to.",
            "I want to see current fluctuations in our fluid.",
            "OK, so I'm going to show you some simplified.",
            "Large yes yes.",
            "So so as usual here, in order for the large deviation principle and all this theory to be valid, you say no, you have at the end of this.",
            "Where does this minimum comes from?",
            "It comes from some steep.",
            "Is this an argument and you need a large parameter for that.",
            "In this case the large parameter is taught in the collision case I showed you before, was the volume of the system.",
            "So my question is that also requires.",
            "Yeah.",
            "Y well, in principle this argument holds.",
            "I mean this is just an argument.",
            "This is you plug it.",
            "You assume it's true to reach some conclusion and then you compare.",
            "In fact you know that it's true in some range, but it's violated.",
            "But for the argument, I don't think that you need to to be large or.",
            "Oh my God, it's not that I don't like stationarity arguments.",
            "No, no, no, no.",
            "I don't think so.",
            "OK, so in order to have a look at this phenomenon we."
        ],
        [
            "Have to do some other the model, maybe you probably know him is the kidneys, Mercury presutti model of heat conduction.",
            "This model was developing 82 and it's a very simple model.",
            "It's really simple.",
            "Is that probably the simplest model of the diffusive transport on a lattice?",
            "In my case, I'm going to choose a isolated system because I want to study current location in an isolated system.",
            "So just one dimension, pretty boundary condition.",
            "So it's a ring.",
            "In each lattice side we have an energy.",
            "So this row I is some real positive number.",
            "And the dynamics is stochastic and proceed via stochastic collisions.",
            "What does it mean?",
            "So we choose our nearest neighbor pair.",
            "At random and we run normally reddish Gray distributed energy of the pair.",
            "OK, so it has really nothing.",
            "You have energies and they collide in the sense that you take the energies.",
            "You randomly redistribute energy in such a way that energy is conserved in the pair OK, and then just another side another side.",
            "And these are.",
            "These are dynamic, so this row prime are the new energies and you see that they're just Pete Times the somewhere appear some random number, almost initially distributing the 01 interval.",
            "And this is a very simple."
        ],
        [
            "Model, but it's it's a coarse grained model for the for many Question 1 dimensional system of theoretical interest, in particular for one dimensional system with one concert field.",
            "It's isolated.",
            "In this case there's no external field, so average current zero there is no carrying on average in this field.",
            "However, we can see fluctuations and which is the average density profiles the constant One South, average current zero, and the average profile brochure.",
            "Or this is the average energy of ascites.",
            "You always have the active.",
            "We forget about this ring and subject to open monitor condition at different temperatures.",
            "You can rigorously proven this is what these people live in 82.",
            "That for Yellow Halt, which means that the average covering is nothing but some, is some constant times the gradient of the of the density profile.",
            "Each one of the very few models where you can rigorously prove the free low.",
            "And that's why it's very interesting for mathematical physicist.",
            "And finally, at the microscopic level it's describer some diffusive equation of this type with and you can compute easily the two coefficients that issue with this one, half the saying as a simple exclusion process cloudland and talk this morning, while the mobility is raw Square as compared to roll 1 -- 4 we have there.",
            "So it's fully characterize the model so."
        ],
        [
            "A lot of the questions then we want to study current fluctuations.",
            "We know the average is 0, but still for a long time we can see fluctuations.",
            "OK, so we want to see which is we want to measure, the probability of viewing current fluctuation.",
            "But we know that scales in this way and we also have to have a look on the optimal profile, responsible fluctuation and.",
            "Up to 2005, this was extremely difficult to measure.",
            "We want to see very, very relevant, so the probability is exponentially small in time and the system size.",
            "But these people, General Champlitte developed Monte Carlo algorithm based on Diffusion Monte Carlo, which allows you to see this type of large deviation.",
            "So the idea is that due to modify the dynamics in such a way that they are relevant for the standard dynamics is the standard rent for the modified dynamics, and you can do that in a.",
            "Control and mathematically controlled way.",
            "So this is what we see.",
            "This is."
        ],
        [
            "Time evolution of our system.",
            "So imagine we have our chain which is closed source.",
            "Which is we have created under conditions.",
            "OK this is space and this is time.",
            "OK so this is a typical evolution of our system for our current below this critical care I was telling you before so we say nothing.",
            "No structure even if you see no structure in this in this time evolution of assistant there is some net current flowing to the right in this case, so there's even even average currency release from the current flowing through the right.",
            "Here however, if we.",
            "Push it forward and we want to see current very large current in fact, below I've also uncritical covering QC, which in this case will be pipe nice.",
            "We see a very different picture, so we see some coherent traveling wave.",
            "So here how do current fluctuations happened here?",
            "But essentially essentially you have pairs of sites which collides, transport energy randomly to the right to the left in order to see some random current location to the right small one at the end of the day we do have is a sum of weakly correlated events here and there, so this is uncorrelated.",
            "Essentially, at the end they.",
            "The central Limit theorem holds and you have Gaussian statistics and this is what you see.",
            "However, for large enough currents the system is not able to sustain such a fluctuation with standard with incoherent events and needs to organize itself in a coherent pattern, which in this case is a coherent traveling wave, it has some energy localized.",
            "What it does it localized energy in a given packet which travels through the system and this is spontaneous.",
            "What does it mean?",
            "If you sit down and wait enough?",
            "In order to see a beira fluctuation if this rotation is beyond this threshold, you will see this fluctuation.",
            "We will see a typical path of this shape.",
            "So with this traveling wave this is striking because this system is isolated in external field equilibrium system, nothing.",
            "So it has sort of phase transition at the fluctuating level in one day and we know that in principle symmetry breaking stability are forbidding in one day, but an average behavior.",
            "Here we are seeing that.",
            "Reading level, they may happen and we see here that it breaks translational invariant in one day.",
            "Try to localize energy.",
            "We can measure the last division."
        ],
        [
            "Function, or rather the legend transform of the large division function.",
            "This is a critical current vary from the theory, so we did a finite set scaling for different system sizes.",
            "You see that angle is small, I mean the largest.",
            "Then we could reach 32 because this method implies simulating system 32 sites lattice, but 1,000,000 copies of it in parallel for a very long time, so it's difficult.",
            "But we are lucky enough such in such a way that for N32.",
            "We already have Richard the hydrodynamic limit, so we see that the macroscopic fluctuation theory prediction holds for currents below the critical current.",
            "We have Gaussian fluctuations, which means a quadratic mean of Lambda, but beyond this critical current.",
            "The last revision function deviates from these dash line, which is the Gaussian behavior.",
            "OK, so and you see that for the blue, the blue points really agree with the language is the prediction.",
            "AM.",
            "The."
        ],
        [
            "Face transition is most everything at the configurational level.",
            "Looking at the optimal path, so we measure also the average.",
            "The average density profile of the system for giving for each current.",
            "Again, we see that it agrees perfectly with the theory.",
            "This is the summary essentially of what you can do.",
            "Finances scaling and see how things scale we think, but at the end of the day, what you see is that the optimal profile is flat.",
            "As for the average current up to a critical current, this Lambda is a parameter conjugated to the current.",
            "I'm at pie and this imaginative breaks down and you see that ran away with well defined profile.",
            "This is measurement theory, and in fact this line is there is a theoretic operation.",
            "Would you see it's a Greek.",
            "We also may."
        ],
        [
            "For the city of the way that Angular is perfectly so just before finishing and let me give you a very brief detour is."
        ],
        [
            "About award us about symmetric and non equilibrium fluctuations you've seen here that in order to understand this behavior the this phenomenon the optimal path place are very very long roll.",
            "So in fact by studying the properties of optimal paths in North Korean fluctuations you can say relevant."
        ],
        [
            "Things for fluctuations.",
            "You know that the fluctuations reflect the symmetries of the microscopic dynamics at the macro scale.",
            "The first example that comes to your mind is the fluctuation theorem.",
            "You know if we have a microscopically reversible system, this microscopic symmetry time reversal is reflected at a microscopic level in the following way.",
            "If you define again your time integrated time average coloring, we know that because the system is time reversible.",
            "We can relate the probability of having current under reverse event.",
            "This probability might be one.",
            "Imagine that this Q is the average current, so this probably would be essentially one and this would be exponentially close to zero.",
            "They are very different, but they but they are linked one to one because time reversibility because the typical path which gives you this current is the time reversal or once you take into account the joint dynamics of this one.",
            "So these two probabilities are related in this very simple.",
            "But that's a fluctuation theorem.",
            "So now you can try to generalize the idea."
        ],
        [
            "Fusion symmetry to assign fluctuations, and you realize that.",
            "You can use the invariants of the optimal paths when subject to some symmetry transformation.",
            "And to re late not only are given current and its reverse event, but different isometric currents.",
            "Let's say this looks very similar, but here you have Q -- Q.",
            "Well here you have Q&Q prime.",
            "This Q prime is nothing but a rotation of this vector Q.",
            "You have the system, in this case D dimensional system.",
            "Again, you can have also external field whatever.",
            "So let's say that the mean covering this way and you can answer probably having a given carry current, which I called Jay here.",
            "This isometric fluctuation theory allows you to relate the probability of any isometric coloring with the same models but different orientations.",
            "They are related one to one against because of 10 reality in this case is not so clear, but it's because of time reversibility and they avoid this type of relation.",
            "So now I was gonna give you some."
        ],
        [
            "Flavor of the of the theory.",
            "More detail, but I think I reach already past my time so if you."
        ],
        [
            "Details I can."
        ],
        [
            "Give you later on."
        ],
        [
            "Anne."
        ],
        [
            "That's all.",
            "My summary."
        ],
        [
            "Will be there following so."
        ],
        [
            "So we've shown that an isolated diffuses sitting activity phase transition at the fluctuating level.",
            "This is fully captured by Microsoft fluctuation theory.",
            "It's interesting the system breaks spontaneously symmetry in one day.",
            "There is some conjecture about the if it's continuous or discontinuous transition and makes things to point out to continuous case.",
            "It's interesting that from the general POV.",
            "This result suggests that in general, rare events are associated with coherent self organized patterns which enhance their probability.",
            "What does it mean that the Ravens is much more probable than what you would expect?",
            "According to coaching statistics and that you can really measure with the large solution function?"
        ],
        [
            "And the outlook.",
            "What we want to do now is that this is really very general and we want to look at this phenomenon in quantum field theory and even in some condensed matter physics things.",
            "So thank you very much for."
        ],
        [
            "Attention."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So I'm going to talk about this spontaneous symmetry breaking at the fluctuating level, and this work has been done in collaboration with Pedro Garrido here at the University of Granada.",
                    "label": 1
                },
                {
                    "sent": "Here you have some references where you can find details of the work.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm going to start.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Talking about the.",
                    "label": 0
                },
                {
                    "sent": "Fluctuations in physical assisting and why I want to convey the idea that they are important not only because they are some noise that we want to remove it because they encode very important information that can give us insights on the system behavior.",
                    "label": 0
                },
                {
                    "sent": "So in fact, starting fluctuating fluctuations is typically a free dual fruitful endeavor in physics.",
                    "label": 0
                },
                {
                    "sent": "Let me give you some simple examples.",
                    "label": 0
                },
                {
                    "sent": "I probably will not have to warm up.",
                    "label": 0
                },
                {
                    "sent": "The first example is probably a Brownian motion.",
                    "label": 0
                },
                {
                    "sent": "Well, you know that anything just by studying the fluctuations in the motion of mesoscopic particle immersed in a molecular liquid was able to infer the size of the demonic molecules of the system opening the door to experimental verification of a molecule hypothesis just by studying the fluctuations of this message.",
                    "label": 0
                },
                {
                    "sent": "Scopic object in Brownian motion.",
                    "label": 1
                },
                {
                    "sent": "This is another example in critical phenomena where you know that fluctuate.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Things are essential to understand the physics of critical phenomena beyond phenomenological mean field models.",
                    "label": 0
                },
                {
                    "sent": "Another an example which is.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Nowadays very it's very active.",
                    "label": 0
                },
                {
                    "sent": "It's the physics of more fish materials people.",
                    "label": 0
                },
                {
                    "sent": "This is typing fluctuations of space, time correlation functions.",
                    "label": 0
                },
                {
                    "sent": "The fluctuations of these correlations functions.",
                    "label": 0
                },
                {
                    "sent": "Show some typical behavior.",
                    "label": 0
                },
                {
                    "sent": "They have some very strong picks which point out to some very general phenomenon known as dynamic iteration 80, which is nothing but the coexistence, the continuous consistency in amorphous materials of patches of frozen particles together with other patches of very mobile particles.",
                    "label": 0
                },
                {
                    "sent": "Seemingly this this phenomenon of consistent two different type of particles mobile enforcing is behind the physics of many more false materials, in fact people.",
                    "label": 0
                },
                {
                    "sent": "Believe that this is truly at the heart of the glass transition, which, as you know, probably we don't know really the details nowadays and Alas, sample about the importance of.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Punctuation with this is this fancy one is fluctuations in the cosmic microwave background.",
                    "label": 1
                },
                {
                    "sent": "You know that nowadays we are able to measure these small fluctuations in the cosmic microwave background and people can trace back.",
                    "label": 0
                },
                {
                    "sent": "These fluctuations to the tiny fluctuations in the mass distribution in the primordial universe and this is giving us information about structure formation at larger scales in the universe.",
                    "label": 0
                },
                {
                    "sent": "So different examples from different influences just to convey the idea that standing fluctuations is valuable, that we get important information.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So my.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Articular case I'm in statistical physics physicist and I work in nonequivalent psychophysics.",
                    "label": 0
                },
                {
                    "sent": "So here we have you probably know that we have a weak falling that we heard something today in Claudia's landing talk that we would like to define some nonequilibrium analogue of the free energy.",
                    "label": 0
                },
                {
                    "sent": "We don't know how to do that in a clear.",
                    "label": 0
                },
                {
                    "sent": "We know that we have the microscopic configuration, it gives weights, we know how to write down a partition function, and from that we reach the partition free energy.",
                    "label": 0
                },
                {
                    "sent": "We don't know how to do that in nonequilibrium.",
                    "label": 0
                },
                {
                    "sent": "We don't know how to go from microscopic to macroscopic.",
                    "label": 0
                },
                {
                    "sent": "However, we know that there is an alternative to derive thermodynamic potential and that is studying the fluctuations of macroscopic observables.",
                    "label": 1
                },
                {
                    "sent": "We study.",
                    "label": 0
                },
                {
                    "sent": "This fluctuations were able to write down a question, for instance, for the free energy density.",
                    "label": 0
                },
                {
                    "sent": "Hey, this is fine in equilibrium, but it's very important for Frank Librium cause there we don't know how to go from micro to macro.",
                    "label": 1
                },
                {
                    "sent": "So studying fluctuations of macroscopic observables far from trivial, we believe that we can generalize the concept of free energy.",
                    "label": 0
                },
                {
                    "sent": "So what's the main observable here that?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We will focus on later on, so this fundamental observable is what we call large division function and probably many of you know already what it is.",
                    "label": 0
                },
                {
                    "sent": "So in any case, let me explain what is a large selection function in order to do that.",
                    "label": 0
                },
                {
                    "sent": "The best thing is just to look at a couple of exam.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let's imagine we have an isolated system, an equilibrium system with some capital N particles are capital revolving queso, such that the densities hangover V OK.",
                    "label": 0
                },
                {
                    "sent": "So now we look at the subsystem of this big system where we have little lying on little with volume little V OK. And now we ask the following question, what is the probability of observing a density rho in this in this volume?",
                    "label": 0
                },
                {
                    "sent": "OK, we know that this as the volume of this system.",
                    "label": 0
                },
                {
                    "sent": "Gross.",
                    "label": 0
                },
                {
                    "sent": "The probability of observing identity here different, macroscopically different from the average density.",
                    "label": 0
                },
                {
                    "sent": "It's going to decay exponentially fast with the volume.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is what I represent here.",
                    "label": 0
                },
                {
                    "sent": "Imagine that this is how volume grows.",
                    "label": 0
                },
                {
                    "sent": "This is our observable density in this system, and this is the probability density as the volume growth.",
                    "label": 0
                },
                {
                    "sent": "This probability density is becomes P compete around the average density, which is a capital hangover capital V. OK, so this probability scales in this way exponentially fast with the volume, and this defines large deviation principle.",
                    "label": 0
                },
                {
                    "sent": "OK, the rate function which defines how the probability for a given density rho, which might be very very different from the average density.",
                    "label": 0
                },
                {
                    "sent": "This rate function is what people in the literature called large deviation function.",
                    "label": 1
                },
                {
                    "sent": "We can do something similar on occasion, setting.",
                    "label": 0
                },
                {
                    "sent": "The simplest one is for yellow, so we have some fluids on metal bar.",
                    "label": 0
                },
                {
                    "sent": "Whatever we put its boundaries in contact with thermal, but at different temperatures.",
                    "label": 0
                },
                {
                    "sent": "So T1T two different temperatures, so we let the system relax and we expect some hit current flowing through the system in some stationary state.",
                    "label": 0
                },
                {
                    "sent": "Probably this system would be described by the microscopic level by Fourier low.",
                    "label": 0
                },
                {
                    "sent": "OK, can you make a comment?",
                    "label": 0
                },
                {
                    "sent": "Our current definition energy.",
                    "label": 0
                },
                {
                    "sent": "Currently it's probably I will.",
                    "label": 0
                },
                {
                    "sent": "It will become much more clear later on in that particular model, but you might end up here imaginary wall and you measure how much energy goes to the right minus the energy flow into the left.",
                    "label": 0
                },
                {
                    "sent": "You integrate that overtime divided, divided by time, and this is some average current which for long times converges.",
                    "label": 1
                },
                {
                    "sent": "Again today assemble average.",
                    "label": 0
                },
                {
                    "sent": "So in this case again this time average current.",
                    "label": 0
                },
                {
                    "sent": "Always a large deviation principle where the large parameters no longer volume but the time along which we integrate the current.",
                    "label": 0
                },
                {
                    "sent": "OK, so this defined this FQ, which is the current large division function which tell us which is the probability of a given current fluctuation.",
                    "label": 0
                },
                {
                    "sent": "We could ask questions as follows.",
                    "label": 0
                },
                {
                    "sent": "Imagine this is a hot source.",
                    "label": 0
                },
                {
                    "sent": "This is a cold sore, so average current should be.",
                    "label": 0
                },
                {
                    "sent": "In this way we can ask the question which is the probability of observing.",
                    "label": 0
                },
                {
                    "sent": "Average current which goes from the call to the Hartree server.",
                    "label": 0
                },
                {
                    "sent": "This probably is very very low, but you can compute it for a given time and the function with controls.",
                    "label": 0
                },
                {
                    "sent": "This probability is this large solution function.",
                    "label": 0
                },
                {
                    "sent": "This this Ella distribution function have a typical shape, which is something like this, so they're everywhere negative except for some point where they are zero.",
                    "label": 1
                },
                {
                    "sent": "And this point defines the average value of the observable.",
                    "label": 0
                },
                {
                    "sent": "OK, they are or can be a symmetric around this.",
                    "label": 0
                },
                {
                    "sent": "This this maximum they're quadratic expected, but on the test they do not have to be quadratic, which means that in general fluctuations large rare fluctuations do not have to be Gaussian.",
                    "label": 0
                },
                {
                    "sent": "Why do we care about large division functions so?",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In equilibrium, we know that these are one to one correspondence between, for instance, this problem, the last, the density, large traditional function and the entropy free energy.",
                    "label": 0
                },
                {
                    "sent": "Depending on the setting.",
                    "label": 0
                },
                {
                    "sent": "OK, in fact, instead if instead of thinking of this problem we think of the probability of observing and giving density profile in the system.",
                    "label": 0
                },
                {
                    "sent": "This probability can always this large division function and this this large division function I.",
                    "label": 0
                },
                {
                    "sent": "Is essentially the interval of the free energy density of the difference of the free energy density for their profile minus the free energy density of the stationary state OK, and the hope is that far from equilibrium, the equivalent large division function will play a role.",
                    "label": 0
                },
                {
                    "sent": "The role of free energies, but far from Killebrew.",
                    "label": 0
                },
                {
                    "sent": "OK. Anne.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "An IKEA step now to see what we have to study is to identify the relevant macroscopic observable we really care about in an equilibrium.",
                    "label": 0
                },
                {
                    "sent": "There are many non equivalent system, but in many cases the system typically conserve localism quantity.",
                    "label": 0
                },
                {
                    "sent": "The number of particles, charge energy something and it develops a current one when you subject the system to Bandar gradient or some external field.",
                    "label": 0
                },
                {
                    "sent": "So in many nutrient system the current is the main observable.",
                    "label": 0
                },
                {
                    "sent": "You want to understand you want on this and it says its statistics.",
                    "label": 0
                },
                {
                    "sent": "In this way the study of current statistics has become one of the main objective of.",
                    "label": 1
                },
                {
                    "sent": "Even still, physics in last years.",
                    "label": 0
                },
                {
                    "sent": "In fact, if you go to archive you see plenty of papers about this topic knowledge.",
                    "label": 0
                },
                {
                    "sent": "In principle, this is a very hard problem.",
                    "label": 0
                },
                {
                    "sent": "In particular, we want to study from the microscopic POV.",
                    "label": 0
                },
                {
                    "sent": "You can do that only in a very in a handful of oversimplified models, but we already know about these days nowadays.",
                    "label": 0
                },
                {
                    "sent": "In the last decade, these people are turning the shoulder.",
                    "label": 0
                },
                {
                    "sent": "Really Journal Ascenion Claudia Randy, who is here, have developed.",
                    "label": 0
                },
                {
                    "sent": "Microscopic theoretical framework which allows us in principle to ask and solve this type of questions, which is the probability of serving a given current fluctuation.",
                    "label": 0
                },
                {
                    "sent": "So the theory this is a crash course on the theory in just two lines.",
                    "label": 0
                },
                {
                    "sent": "This is of course much more complicated thing, but let me give you a flavor of the theory.",
                    "label": 0
                },
                {
                    "sent": "We typically have a conservative systems with its dynamics at the macroscopic level will be given by some.",
                    "label": 0
                },
                {
                    "sent": "Continuity like equation and working in one dimension just to simplify things.",
                    "label": 0
                },
                {
                    "sent": "Where at Roy some density, energy, density, mass density on Jul.",
                    "label": 0
                },
                {
                    "sent": "Some some current feel OK, this current will typically away are constitutive equation which will be in diffusive system something like 4 yellow where the Roy song diffusivity and this is a gradient of the profile of the field plus some typically some noise which is mesoscopic.",
                    "label": 0
                },
                {
                    "sent": "So this noise, the amplitude of this noise is 1 / N where N is the number of particles and assistant.",
                    "label": 0
                },
                {
                    "sent": "Sorry one over square root of amplitude.",
                    "label": 0
                },
                {
                    "sent": "Now we have the following question.",
                    "label": 0
                },
                {
                    "sent": "This is a fluctuating Karina, so we want to understand the statistics of the following estimator of the ensemble average current.",
                    "label": 0
                },
                {
                    "sent": "So we integrate over a space an long time to the fluctuating current, divided it by to this for long times very long times should converge to the average current, which is the one which solves for yellow.",
                    "label": 0
                },
                {
                    "sent": "OK, so we want to know the probability of this current that we know that it obeys.",
                    "label": 0
                },
                {
                    "sent": "Large deviation principle in this in this fashion here and the theory, they don't ask me why this I mean, you can.",
                    "label": 0
                },
                {
                    "sent": "In fact you can from this path integral interpretation you can probably quickly see that this large deviation principle looks like something like this.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's complex object which solve which is a solution of a variational principle space and time dependent variational principle.",
                    "label": 0
                },
                {
                    "sent": "This is nothing but the cost.",
                    "label": 0
                },
                {
                    "sent": "Action of the quadratic cost of a fluctuation of a division of the current J from its average behavior, which is for yellow measure with the amplitude of the noise.",
                    "label": 0
                },
                {
                    "sent": "Which is this dysfunctional?",
                    "label": 0
                },
                {
                    "sent": "Sigma OK so the important thing to realize here is that the theory gives you a very exclusive, very elegant prediction about the current.",
                    "label": 0
                },
                {
                    "sent": "Sorry about the last relation function for the current.",
                    "label": 0
                },
                {
                    "sent": "Which depends essentially on two transport parameters, nothing else.",
                    "label": 0
                },
                {
                    "sent": "You give me a very complicated microscopic model.",
                    "label": 0
                },
                {
                    "sent": "And if you are smart enough to derive these two transport coefficient, which are essentially the diffusivity, and this is the mobility, which is fine, the current fluctuations and once you have these two transfer coefficient, we use microscopic filtration theory to derive the current last division function an.",
                    "label": 0
                },
                {
                    "sent": "The optimal path.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The optimal optimal path responsible of a given fluctuations.",
                    "label": 1
                },
                {
                    "sent": "So for each current Q we have the solution of this variational problem give you the optimal path which brings you from the stationary state to discovering fluctuation OK, yes.",
                    "label": 0
                },
                {
                    "sent": "No experience of your fluctuating current 1 / N Oh no sorry where it's at the end because I wanted to live technical discussion.",
                    "label": 0
                },
                {
                    "sent": "If you read the correlator, Sigma Sigma is a field XD Sigma XTC by exploiting T prime this this correlator is essentially Sigma rho.",
                    "label": 0
                },
                {
                    "sent": "Over end time Delta space, Delta time.",
                    "label": 0
                },
                {
                    "sent": "Active so Gaussian white noise with an amplitude which is Sigma over N, where N is the number of particles in the system.",
                    "label": 0
                },
                {
                    "sent": "OK.",
                    "label": 0
                },
                {
                    "sent": "Anyhow, typically I mean this is formally incredibly nice, so you construct a lot of information even without solving explicitly the problem.",
                    "label": 0
                },
                {
                    "sent": "But in general struck Ting information from this.",
                    "label": 0
                },
                {
                    "sent": "This formalism is formidable problem.",
                    "label": 0
                },
                {
                    "sent": "Extremely difficult, yes.",
                    "label": 0
                },
                {
                    "sent": "This imply there was a fixed relationship between space and time.",
                    "label": 0
                },
                {
                    "sent": "Sorry they saw the way you said it made it seem like in the definition of Sigma there was a fixed relationship between space and time in now because the noise is white and Goshen, so it's it's local.",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Hey.",
                    "label": 0
                },
                {
                    "sent": "Well here then just working in one dimension.",
                    "label": 0
                },
                {
                    "sent": "But you've got accenti.",
                    "label": 0
                },
                {
                    "sent": "Well yeah, yeah 1 + 1.",
                    "label": 0
                },
                {
                    "sent": "Action T are the same variance.",
                    "label": 0
                },
                {
                    "sent": "Yes, I let me write the condition properly just to see if we're talking the same thing.",
                    "label": 0
                },
                {
                    "sent": "Is.",
                    "label": 0
                },
                {
                    "sent": "Sorry for.",
                    "label": 0
                },
                {
                    "sent": "This is this functional Sigma fro over N Delta X -- X prime Delta T -- 3 prime.",
                    "label": 0
                },
                {
                    "sent": "OK, but that's assuming that you've chosen a scale such that X is fluctuated the same yes yes yes.",
                    "label": 0
                },
                {
                    "sent": "OK, OK, because I I I didn't go into technical this in order to do that you do first diffusive scaling.",
                    "label": 0
                },
                {
                    "sent": "So you schedule time with Angle Square dance space with me so.",
                    "label": 0
                },
                {
                    "sent": "You did, yeah.",
                    "label": 0
                },
                {
                    "sent": "So I mean you have to do that before reaching all these all these questions.",
                    "label": 0
                },
                {
                    "sent": "So that's why when you talk about Microsoft translation theory, you always said I did pledge to diffusive systems.",
                    "label": 0
                },
                {
                    "sent": "So you're in the diffusive scaling limit.",
                    "label": 0
                },
                {
                    "sent": "The full path, well, uh, path is a history of the.",
                    "label": 0
                },
                {
                    "sent": "Basic trajectory or it's like dependence like rollbacks?",
                    "label": 0
                },
                {
                    "sent": "No no no.",
                    "label": 0
                },
                {
                    "sent": "It's a it's a trajectory of the density.",
                    "label": 0
                },
                {
                    "sent": "And current fields.",
                    "label": 0
                },
                {
                    "sent": "So row of XTJ of XT from time zero time to an I'm not selling technical details.",
                    "label": 0
                },
                {
                    "sent": "These two fields are not independent, they are coupled via the continuity equation so they are not any 2 field so.",
                    "label": 0
                },
                {
                    "sent": "What at the end of day it's technically convoluted to really solve the problem so.",
                    "label": 0
                },
                {
                    "sent": "In English, English this and here is the number of particles.",
                    "label": 0
                },
                {
                    "sent": "Let's imagine you have a chain or 1 dimensional change of oscillators.",
                    "label": 0
                },
                {
                    "sent": "This number of oscillators.",
                    "label": 0
                },
                {
                    "sent": "Pretty sure he does Delta function of X -- 6 prime there.",
                    "label": 0
                },
                {
                    "sent": "Do I need it?",
                    "label": 0
                },
                {
                    "sent": "You yeah.",
                    "label": 0
                },
                {
                    "sent": "If you look at the motion of particles you you just need to know that the correlation function of Exile XT and side of X prime T at X = X prime.",
                    "label": 0
                },
                {
                    "sent": "There's no actually, I've done well.",
                    "label": 0
                },
                {
                    "sent": "That they were put in nature of the product?",
                    "label": 0
                },
                {
                    "sent": "Yes, and this is like the locality of the noise.",
                    "label": 0
                },
                {
                    "sent": "I mean, you could have different type of noises here, so you know noise, which the case exponentially in space or even fat.",
                    "label": 0
                },
                {
                    "sent": "OK, OK. OK, later on.",
                    "label": 0
                },
                {
                    "sent": "OK so one thing I want to remind you that the optimal path solution of these of the scene which means any story of these two couple fields is typically not the steady state profile.",
                    "label": 0
                },
                {
                    "sent": "So imagine you have a full yellow so we have these two different temperature.",
                    "label": 0
                },
                {
                    "sent": "This is this thing is simple so they link profile is linear OK. Do ask a question which is probably observing aggregating covering which is rare very very we are covering against the the grading whatever.",
                    "label": 0
                },
                {
                    "sent": "So this profile can be this one.",
                    "label": 0
                },
                {
                    "sent": "In fact, this is the solution of this problem in some particular case.",
                    "label": 0
                },
                {
                    "sent": "OK, so it's really very different from the optimal profile an.",
                    "label": 0
                },
                {
                    "sent": "OK, so solving this problem is typically very difficult, but.",
                    "label": 0
                },
                {
                    "sent": "Happily, sometimes distance, choose the simplest path so this this simplifying hypothesis hypothesis normativity principle which was first proposed by between under reading 2004 that says the following that in many cases not not everything, not not in all cases, but in many cases Anna Wave brought in a broad range of fluctuations.",
                    "label": 0
                },
                {
                    "sent": "This optimal paths are in fact I'm independent, so you can really forget about time.",
                    "label": 0
                },
                {
                    "sent": "And the problem that it's very much simplified.",
                    "label": 0
                },
                {
                    "sent": "OK, this has been tested in regular, extended, extensive numerical simulations and it works for a very wide current interval.",
                    "label": 0
                },
                {
                    "sent": "So this is this additivity scenario.",
                    "label": 0
                },
                {
                    "sent": "So even if the problem can be very complex, the system chooses to have a time independent optimal history, optimal profiles.",
                    "label": 0
                },
                {
                    "sent": "However, this ideal scenario eventually breaks down for very large current fluctuations, so for currents.",
                    "label": 1
                },
                {
                    "sent": "Above a critical current that we will see later on the system break this this activity picture and be at that dynamic phase transition of the fluctuating level involving a symmetry breaking and this is what I want to show you because we've measured this.",
                    "label": 1
                },
                {
                    "sent": "We've seen this phenomenon and it's quite shocking.",
                    "label": 0
                },
                {
                    "sent": "Do you have any intuition for this?",
                    "label": 0
                },
                {
                    "sent": "See in simulations, no, no.",
                    "label": 0
                },
                {
                    "sent": "It's it's a you can derive it the simple way.",
                    "label": 0
                },
                {
                    "sent": "In fact, what direction is that?",
                    "label": 0
                },
                {
                    "sent": "In order to transport some current.",
                    "label": 0
                },
                {
                    "sent": "You have a 1 dimensional system, so you say what they say.",
                    "label": 0
                },
                {
                    "sent": "Probability of having of transporting a current queue for a left hand at temperature TL to the right angle, temperature TR.",
                    "label": 0
                },
                {
                    "sent": "So you assume some sort of additivity, so you assume that you can split this probability, divide the system at some point OK, and you said this probably is nothing but the product of two probabilities.",
                    "label": 0
                },
                {
                    "sent": "The probability of transporting the same covering discovering is conserved.",
                    "label": 0
                },
                {
                    "sent": "Between TL and the temperature at this point times the probability of transporting the same current between the temperature at this point and TR.",
                    "label": 0
                },
                {
                    "sent": "Sorry for the shaking.",
                    "label": 0
                },
                {
                    "sent": "Which is this tea?",
                    "label": 0
                },
                {
                    "sent": "The one which maximizes this problem.",
                    "label": 0
                },
                {
                    "sent": "Max T alright so you maximize this.",
                    "label": 0
                },
                {
                    "sent": "These two things over the contact temperature.",
                    "label": 0
                },
                {
                    "sent": "This is I believe maybe Claudia can help me, but there I mean this is original statement of the additivity hypothesis that mean you can really cut and then you see that immediately you can go do an iterative procedure and just start cutting the system in small pieces of offices.",
                    "label": 0
                },
                {
                    "sent": "And this gives you an explicit prediction for the current loss division function, which later on was realized that it's equivalent to assuming that the optimal profile profile which solves this problem is time independent.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's why it's called additivity principle.",
                    "label": 0
                },
                {
                    "sent": "Correct now.",
                    "label": 0
                },
                {
                    "sent": "Yeah, I don't.",
                    "label": 0
                },
                {
                    "sent": "I know empirically has work on these things, but I'm not very sure whether they did exactly the same thing.",
                    "label": 0
                },
                {
                    "sent": "I don't know.",
                    "label": 0
                },
                {
                    "sent": "OK, so that's that's the reason.",
                    "label": 0
                },
                {
                    "sent": "Like kind of like 142 from no no I'm.",
                    "label": 0
                },
                {
                    "sent": "1 dimensional, 1 dimensional or one German process or you have a many particle.",
                    "label": 0
                },
                {
                    "sent": "Since I have many particle system so I'm going to talk about.",
                    "label": 0
                },
                {
                    "sent": "I'm so that's the thing that I'm going to.",
                    "label": 0
                },
                {
                    "sent": "I want to see current fluctuations in our fluid.",
                    "label": 0
                },
                {
                    "sent": "OK, so I'm going to show you some simplified.",
                    "label": 0
                },
                {
                    "sent": "Large yes yes.",
                    "label": 0
                },
                {
                    "sent": "So so as usual here, in order for the large deviation principle and all this theory to be valid, you say no, you have at the end of this.",
                    "label": 0
                },
                {
                    "sent": "Where does this minimum comes from?",
                    "label": 0
                },
                {
                    "sent": "It comes from some steep.",
                    "label": 0
                },
                {
                    "sent": "Is this an argument and you need a large parameter for that.",
                    "label": 0
                },
                {
                    "sent": "In this case the large parameter is taught in the collision case I showed you before, was the volume of the system.",
                    "label": 0
                },
                {
                    "sent": "So my question is that also requires.",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Y well, in principle this argument holds.",
                    "label": 0
                },
                {
                    "sent": "I mean this is just an argument.",
                    "label": 0
                },
                {
                    "sent": "This is you plug it.",
                    "label": 0
                },
                {
                    "sent": "You assume it's true to reach some conclusion and then you compare.",
                    "label": 0
                },
                {
                    "sent": "In fact you know that it's true in some range, but it's violated.",
                    "label": 0
                },
                {
                    "sent": "But for the argument, I don't think that you need to to be large or.",
                    "label": 0
                },
                {
                    "sent": "Oh my God, it's not that I don't like stationarity arguments.",
                    "label": 0
                },
                {
                    "sent": "No, no, no, no.",
                    "label": 0
                },
                {
                    "sent": "I don't think so.",
                    "label": 0
                },
                {
                    "sent": "OK, so in order to have a look at this phenomenon we.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Have to do some other the model, maybe you probably know him is the kidneys, Mercury presutti model of heat conduction.",
                    "label": 0
                },
                {
                    "sent": "This model was developing 82 and it's a very simple model.",
                    "label": 0
                },
                {
                    "sent": "It's really simple.",
                    "label": 0
                },
                {
                    "sent": "Is that probably the simplest model of the diffusive transport on a lattice?",
                    "label": 1
                },
                {
                    "sent": "In my case, I'm going to choose a isolated system because I want to study current location in an isolated system.",
                    "label": 0
                },
                {
                    "sent": "So just one dimension, pretty boundary condition.",
                    "label": 0
                },
                {
                    "sent": "So it's a ring.",
                    "label": 0
                },
                {
                    "sent": "In each lattice side we have an energy.",
                    "label": 0
                },
                {
                    "sent": "So this row I is some real positive number.",
                    "label": 1
                },
                {
                    "sent": "And the dynamics is stochastic and proceed via stochastic collisions.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "So we choose our nearest neighbor pair.",
                    "label": 0
                },
                {
                    "sent": "At random and we run normally reddish Gray distributed energy of the pair.",
                    "label": 0
                },
                {
                    "sent": "OK, so it has really nothing.",
                    "label": 0
                },
                {
                    "sent": "You have energies and they collide in the sense that you take the energies.",
                    "label": 1
                },
                {
                    "sent": "You randomly redistribute energy in such a way that energy is conserved in the pair OK, and then just another side another side.",
                    "label": 0
                },
                {
                    "sent": "And these are.",
                    "label": 0
                },
                {
                    "sent": "These are dynamic, so this row prime are the new energies and you see that they're just Pete Times the somewhere appear some random number, almost initially distributing the 01 interval.",
                    "label": 0
                },
                {
                    "sent": "And this is a very simple.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Model, but it's it's a coarse grained model for the for many Question 1 dimensional system of theoretical interest, in particular for one dimensional system with one concert field.",
                    "label": 1
                },
                {
                    "sent": "It's isolated.",
                    "label": 1
                },
                {
                    "sent": "In this case there's no external field, so average current zero there is no carrying on average in this field.",
                    "label": 0
                },
                {
                    "sent": "However, we can see fluctuations and which is the average density profiles the constant One South, average current zero, and the average profile brochure.",
                    "label": 0
                },
                {
                    "sent": "Or this is the average energy of ascites.",
                    "label": 0
                },
                {
                    "sent": "You always have the active.",
                    "label": 1
                },
                {
                    "sent": "We forget about this ring and subject to open monitor condition at different temperatures.",
                    "label": 0
                },
                {
                    "sent": "You can rigorously proven this is what these people live in 82.",
                    "label": 0
                },
                {
                    "sent": "That for Yellow Halt, which means that the average covering is nothing but some, is some constant times the gradient of the of the density profile.",
                    "label": 0
                },
                {
                    "sent": "Each one of the very few models where you can rigorously prove the free low.",
                    "label": 0
                },
                {
                    "sent": "And that's why it's very interesting for mathematical physicist.",
                    "label": 0
                },
                {
                    "sent": "And finally, at the microscopic level it's describer some diffusive equation of this type with and you can compute easily the two coefficients that issue with this one, half the saying as a simple exclusion process cloudland and talk this morning, while the mobility is raw Square as compared to roll 1 -- 4 we have there.",
                    "label": 1
                },
                {
                    "sent": "So it's fully characterize the model so.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A lot of the questions then we want to study current fluctuations.",
                    "label": 0
                },
                {
                    "sent": "We know the average is 0, but still for a long time we can see fluctuations.",
                    "label": 0
                },
                {
                    "sent": "OK, so we want to see which is we want to measure, the probability of viewing current fluctuation.",
                    "label": 0
                },
                {
                    "sent": "But we know that scales in this way and we also have to have a look on the optimal profile, responsible fluctuation and.",
                    "label": 0
                },
                {
                    "sent": "Up to 2005, this was extremely difficult to measure.",
                    "label": 0
                },
                {
                    "sent": "We want to see very, very relevant, so the probability is exponentially small in time and the system size.",
                    "label": 0
                },
                {
                    "sent": "But these people, General Champlitte developed Monte Carlo algorithm based on Diffusion Monte Carlo, which allows you to see this type of large deviation.",
                    "label": 0
                },
                {
                    "sent": "So the idea is that due to modify the dynamics in such a way that they are relevant for the standard dynamics is the standard rent for the modified dynamics, and you can do that in a.",
                    "label": 0
                },
                {
                    "sent": "Control and mathematically controlled way.",
                    "label": 0
                },
                {
                    "sent": "So this is what we see.",
                    "label": 0
                },
                {
                    "sent": "This is.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Time evolution of our system.",
                    "label": 0
                },
                {
                    "sent": "So imagine we have our chain which is closed source.",
                    "label": 0
                },
                {
                    "sent": "Which is we have created under conditions.",
                    "label": 0
                },
                {
                    "sent": "OK this is space and this is time.",
                    "label": 0
                },
                {
                    "sent": "OK so this is a typical evolution of our system for our current below this critical care I was telling you before so we say nothing.",
                    "label": 0
                },
                {
                    "sent": "No structure even if you see no structure in this in this time evolution of assistant there is some net current flowing to the right in this case, so there's even even average currency release from the current flowing through the right.",
                    "label": 0
                },
                {
                    "sent": "Here however, if we.",
                    "label": 0
                },
                {
                    "sent": "Push it forward and we want to see current very large current in fact, below I've also uncritical covering QC, which in this case will be pipe nice.",
                    "label": 0
                },
                {
                    "sent": "We see a very different picture, so we see some coherent traveling wave.",
                    "label": 1
                },
                {
                    "sent": "So here how do current fluctuations happened here?",
                    "label": 0
                },
                {
                    "sent": "But essentially essentially you have pairs of sites which collides, transport energy randomly to the right to the left in order to see some random current location to the right small one at the end of the day we do have is a sum of weakly correlated events here and there, so this is uncorrelated.",
                    "label": 0
                },
                {
                    "sent": "Essentially, at the end they.",
                    "label": 1
                },
                {
                    "sent": "The central Limit theorem holds and you have Gaussian statistics and this is what you see.",
                    "label": 0
                },
                {
                    "sent": "However, for large enough currents the system is not able to sustain such a fluctuation with standard with incoherent events and needs to organize itself in a coherent pattern, which in this case is a coherent traveling wave, it has some energy localized.",
                    "label": 0
                },
                {
                    "sent": "What it does it localized energy in a given packet which travels through the system and this is spontaneous.",
                    "label": 0
                },
                {
                    "sent": "What does it mean?",
                    "label": 0
                },
                {
                    "sent": "If you sit down and wait enough?",
                    "label": 0
                },
                {
                    "sent": "In order to see a beira fluctuation if this rotation is beyond this threshold, you will see this fluctuation.",
                    "label": 0
                },
                {
                    "sent": "We will see a typical path of this shape.",
                    "label": 0
                },
                {
                    "sent": "So with this traveling wave this is striking because this system is isolated in external field equilibrium system, nothing.",
                    "label": 0
                },
                {
                    "sent": "So it has sort of phase transition at the fluctuating level in one day and we know that in principle symmetry breaking stability are forbidding in one day, but an average behavior.",
                    "label": 0
                },
                {
                    "sent": "Here we are seeing that.",
                    "label": 0
                },
                {
                    "sent": "Reading level, they may happen and we see here that it breaks translational invariant in one day.",
                    "label": 0
                },
                {
                    "sent": "Try to localize energy.",
                    "label": 0
                },
                {
                    "sent": "We can measure the last division.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Function, or rather the legend transform of the large division function.",
                    "label": 0
                },
                {
                    "sent": "This is a critical current vary from the theory, so we did a finite set scaling for different system sizes.",
                    "label": 0
                },
                {
                    "sent": "You see that angle is small, I mean the largest.",
                    "label": 0
                },
                {
                    "sent": "Then we could reach 32 because this method implies simulating system 32 sites lattice, but 1,000,000 copies of it in parallel for a very long time, so it's difficult.",
                    "label": 0
                },
                {
                    "sent": "But we are lucky enough such in such a way that for N32.",
                    "label": 0
                },
                {
                    "sent": "We already have Richard the hydrodynamic limit, so we see that the macroscopic fluctuation theory prediction holds for currents below the critical current.",
                    "label": 0
                },
                {
                    "sent": "We have Gaussian fluctuations, which means a quadratic mean of Lambda, but beyond this critical current.",
                    "label": 0
                },
                {
                    "sent": "The last revision function deviates from these dash line, which is the Gaussian behavior.",
                    "label": 0
                },
                {
                    "sent": "OK, so and you see that for the blue, the blue points really agree with the language is the prediction.",
                    "label": 0
                },
                {
                    "sent": "AM.",
                    "label": 0
                },
                {
                    "sent": "The.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Face transition is most everything at the configurational level.",
                    "label": 0
                },
                {
                    "sent": "Looking at the optimal path, so we measure also the average.",
                    "label": 0
                },
                {
                    "sent": "The average density profile of the system for giving for each current.",
                    "label": 0
                },
                {
                    "sent": "Again, we see that it agrees perfectly with the theory.",
                    "label": 0
                },
                {
                    "sent": "This is the summary essentially of what you can do.",
                    "label": 0
                },
                {
                    "sent": "Finances scaling and see how things scale we think, but at the end of the day, what you see is that the optimal profile is flat.",
                    "label": 0
                },
                {
                    "sent": "As for the average current up to a critical current, this Lambda is a parameter conjugated to the current.",
                    "label": 0
                },
                {
                    "sent": "I'm at pie and this imaginative breaks down and you see that ran away with well defined profile.",
                    "label": 0
                },
                {
                    "sent": "This is measurement theory, and in fact this line is there is a theoretic operation.",
                    "label": 0
                },
                {
                    "sent": "Would you see it's a Greek.",
                    "label": 0
                },
                {
                    "sent": "We also may.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For the city of the way that Angular is perfectly so just before finishing and let me give you a very brief detour is.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "About award us about symmetric and non equilibrium fluctuations you've seen here that in order to understand this behavior the this phenomenon the optimal path place are very very long roll.",
                    "label": 0
                },
                {
                    "sent": "So in fact by studying the properties of optimal paths in North Korean fluctuations you can say relevant.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Things for fluctuations.",
                    "label": 0
                },
                {
                    "sent": "You know that the fluctuations reflect the symmetries of the microscopic dynamics at the macro scale.",
                    "label": 1
                },
                {
                    "sent": "The first example that comes to your mind is the fluctuation theorem.",
                    "label": 0
                },
                {
                    "sent": "You know if we have a microscopically reversible system, this microscopic symmetry time reversal is reflected at a microscopic level in the following way.",
                    "label": 0
                },
                {
                    "sent": "If you define again your time integrated time average coloring, we know that because the system is time reversible.",
                    "label": 0
                },
                {
                    "sent": "We can relate the probability of having current under reverse event.",
                    "label": 0
                },
                {
                    "sent": "This probability might be one.",
                    "label": 0
                },
                {
                    "sent": "Imagine that this Q is the average current, so this probably would be essentially one and this would be exponentially close to zero.",
                    "label": 0
                },
                {
                    "sent": "They are very different, but they but they are linked one to one because time reversibility because the typical path which gives you this current is the time reversal or once you take into account the joint dynamics of this one.",
                    "label": 0
                },
                {
                    "sent": "So these two probabilities are related in this very simple.",
                    "label": 1
                },
                {
                    "sent": "But that's a fluctuation theorem.",
                    "label": 0
                },
                {
                    "sent": "So now you can try to generalize the idea.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Fusion symmetry to assign fluctuations, and you realize that.",
                    "label": 0
                },
                {
                    "sent": "You can use the invariants of the optimal paths when subject to some symmetry transformation.",
                    "label": 1
                },
                {
                    "sent": "And to re late not only are given current and its reverse event, but different isometric currents.",
                    "label": 0
                },
                {
                    "sent": "Let's say this looks very similar, but here you have Q -- Q.",
                    "label": 0
                },
                {
                    "sent": "Well here you have Q&Q prime.",
                    "label": 0
                },
                {
                    "sent": "This Q prime is nothing but a rotation of this vector Q.",
                    "label": 0
                },
                {
                    "sent": "You have the system, in this case D dimensional system.",
                    "label": 0
                },
                {
                    "sent": "Again, you can have also external field whatever.",
                    "label": 0
                },
                {
                    "sent": "So let's say that the mean covering this way and you can answer probably having a given carry current, which I called Jay here.",
                    "label": 1
                },
                {
                    "sent": "This isometric fluctuation theory allows you to relate the probability of any isometric coloring with the same models but different orientations.",
                    "label": 0
                },
                {
                    "sent": "They are related one to one against because of 10 reality in this case is not so clear, but it's because of time reversibility and they avoid this type of relation.",
                    "label": 0
                },
                {
                    "sent": "So now I was gonna give you some.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Flavor of the of the theory.",
                    "label": 0
                },
                {
                    "sent": "More detail, but I think I reach already past my time so if you.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Details I can.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Give you later on.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That's all.",
                    "label": 0
                },
                {
                    "sent": "My summary.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Will be there following so.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So we've shown that an isolated diffuses sitting activity phase transition at the fluctuating level.",
                    "label": 0
                },
                {
                    "sent": "This is fully captured by Microsoft fluctuation theory.",
                    "label": 0
                },
                {
                    "sent": "It's interesting the system breaks spontaneously symmetry in one day.",
                    "label": 0
                },
                {
                    "sent": "There is some conjecture about the if it's continuous or discontinuous transition and makes things to point out to continuous case.",
                    "label": 0
                },
                {
                    "sent": "It's interesting that from the general POV.",
                    "label": 0
                },
                {
                    "sent": "This result suggests that in general, rare events are associated with coherent self organized patterns which enhance their probability.",
                    "label": 0
                },
                {
                    "sent": "What does it mean that the Ravens is much more probable than what you would expect?",
                    "label": 0
                },
                {
                    "sent": "According to coaching statistics and that you can really measure with the large solution function?",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the outlook.",
                    "label": 0
                },
                {
                    "sent": "What we want to do now is that this is really very general and we want to look at this phenomenon in quantum field theory and even in some condensed matter physics things.",
                    "label": 0
                },
                {
                    "sent": "So thank you very much for.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Attention.",
                    "label": 0
                }
            ]
        }
    }
}