{
    "id": "vitqaan7s7v7ksbzkvvhn3sxxnknjlhn",
    "title": "Cloud security and OpenStack",
    "info": {
        "author": [
            "Primož Cigoj, Jožef Stefan Institute"
        ],
        "published": "Nov. 16, 2012",
        "recorded": "October 2012",
        "category": [
            "Top->Computers->Software"
        ]
    },
    "url": "http://videolectures.net/classconference2012_cigoj_cloud/",
    "segmentation": [
        [
            "Hello, my name is Primosch where I come from your Steven Institute.",
            "Like colleague said, I'll go briefly, quickly through the cloud security because I assume that you heard a lot about that in the previous sections and I'll focus mostly on open stack."
        ],
        [
            "This is the outline of my presentation.",
            "I'll talk a little bit about cloud computing security issues in the cloud computing, and focus on open stack in the end.",
            "Conclusion In the future work."
        ],
        [
            "So cloud computing has many.",
            "There are many definitions about cloud computing.",
            "They all agree that this is a system on a demand.",
            "We can use resources differently.",
            "Resources we pay as we have a pay as you go model.",
            "So it's a green ID.",
            "Everything is perfect, everything is nice, but there are also some security issues in the back end we will see this for."
        ],
        [
            "So for deployment models we have three type of deployment models, public clouds, private clouds and hybrid clouds.",
            "In public clouds are more secure by mean less secure because they are exposed on the Internet and there are many.",
            "Services and facilities are ability for this through the Internet and this way is exposed and less secure.",
            "Private cloud clouds are usually meant for the organizations and they are closed, so there are more expensive but more secure hybrid clouds.",
            "They are combined from the public and private clouds, so there is a lot of API tools that has to be connected and there is also many security issues going on because they have to upgrade those tools otherwise.",
            "There can be some data leakage or.",
            "Similar problems."
        ],
        [
            "As we are aware, there are three types of platforms in the service models in the cloud computing, I'll focus on infrastructure as a service."
        ],
        [
            "The problem definition?",
            "Well there is a big obstacle for users in the use of cloud securities in cloud security becausw.",
            "2 days ago there was an example Amazon headache collapse alot of their services went off and on a different hosting accounts there were different web pages shown.",
            "So this shows us how there are big problems with big providers as well.",
            "So Amazon says we're not going to hurt you.",
            "OK, that's alright.",
            "But in the back there are.",
            "There are things that we are not aware of.",
            "There are images that are built by users and there can be some malicious code, insight and other problems.",
            "So it's not that it's not that safe and there is also another problem with the data protection encryption, so it's nothing is encrypted in the cloud computing, so our data is exposed to administrators and other it.",
            "Specialist"
        ],
        [
            "So security issues are all well known.",
            "The remaining threats abuse like I said, malicious insiders data lose or leakage.",
            "Hijack account hijack known security profiles and so on.",
            "We are all aware of that, and there are also some other organizations like CSA Nice Tynisa which tried to.",
            "Warn people I mean.",
            "Developers and the IT specialist to focus on those.",
            "Suggestions so that they kind of follow the instructions and then make better platform in the back end and more secure so it's good to follow this organizations and read the advisor."
        ],
        [
            "So with the data protection, the main protection risk is lose of data.",
            "We never know if there is some kind of 3rd party company behind all.",
            "All the services that the cloud computing cloud computing companies offering.",
            "Maybe that third company will sell or our data to another company, so it's not save our data is not saving this case unauthorized access to your data so anyone can access this data.",
            "Malicious things are going on as well.",
            "Like viruses and bot Nets and so on.",
            "Poor internal IT security can bring that insiders employees in that cloud computing company can access that as well, because it's not encrypted.",
            "And what will happen with the deletion of data in case that all data is deleted, do they have regular backups?",
            "Will we get those?",
            "Data back and so on."
        ],
        [
            "Private with privacy, it's really important that this is well defined in the start.",
            "Otherwise, end users are not aware where they are going and what will happen with their data and who is having control of all of all of it.",
            "There are some also.",
            "There are also some privacy breaches, risk management and so on, so it's really important to focus on and read that privacy things before moving to the cloud."
        ],
        [
            "With cryptography like I mentioned before, that is not data is not encrypted on the cloud storage, so.",
            "It's on the user side to take care of it, to encrypt data and then transfer it to the cloud storage.",
            "Otherwise anyone can access it."
        ],
        [
            "And identify management registration of entities.",
            "It's important that we have some kind of synchronization between the users in our company and users in the cloud storage or cloud computing 'cause otherwise employee can leave the company and then there is a problem because all these data stays there in the cloud computing still on and this is not secure and it's not good.",
            "So further education.",
            "It's also good to have one.",
            "Passwords and not pass that, at least for a long time.",
            "Authorization to specify exact rules which specify exact rules that users are in.",
            "That having used and for in Federation of entities, there is no single sign on at the moment, so it's important that those.",
            "Data is exchanged in a manner way through the SSL or something like that.",
            "Otherwise this information can leak out as well.",
            "Now we."
        ],
        [
            "And focus on open stack here is there will be a quick review of existing components.",
            "Quick look at the authorization and authentication and some of the recommendations."
        ],
        [
            "As we can see, open stack is doing their job really good.",
            "They are developing all the time.",
            "I mean every six months they bring us new version with updates and many bug fixes and so on, But the problem persists till in the back end where there are many security issues and vulnerabilities still still persists.",
            "I'll show you just a few of them.",
            "So."
        ],
        [
            "The company main components of the open stack.",
            "There are three main components.",
            "One is Nova, Swift, and then there's, another one is swift and the third one is repository cleanse.",
            "So Norma is like provision of management, large of network and virtual machines where you can lift up the shutdown virtual machines.",
            "Object storage is like it's not a file system, but is the storage for the IT can be storage for images and for data as well.",
            "I will focus on speed because it has many.",
            "Probabilities and glances like a big catalog of all those images saved on the.",
            "In this with."
        ],
        [
            "So general overview compute, like as mentioned before, this is 1.",
            "One component uses building Keystone Authentication System authorization is used for iteration.",
            "There is token used, the issues that are present here in computers are simple passwords, unprotected passwords in the novel configuration files.",
            "And there are unprotected.",
            "Passwords as well in object storage in configuration file and image services.",
            "This component has also some issues with the keys that are publicly accessible and they don't have correct if they don't have correct permissions to access those files, so their suggestions for all these components could be some password complexity SSL encryption, so there won't be any SSL.",
            "I mean man in the middle attack.",
            "Available and correct.",
            "Write and read permissions for the keys."
        ],
        [
            "Maybe I can skip this?"
        ],
        [
            "And focusing mainly on this, so obvious like I mentioned before, swift object storage.",
            "This is like a drop box version in open stack.",
            "It uses three types of authentication system.",
            "They're out was already dropped.",
            "A year ago because there were so many insecure.",
            "Things going on in back end SQL Database was really slow.",
            "Anyone could access configuration files and everything was in plain text in a new version of Object Storage open stack.",
            "There is building temp out authentication system which is not secure as well because it uses plaintext and plaintext passwords and main administrator password is also saved in plaintext.",
            "In this configuration file.",
            "But the bad thing is also that anyone can access.",
            "I made a mistake here.",
            "Sorry, anyone can access this configuration file.",
            "Not only the owner.",
            "So for a built-in system authentication system this is really bad.",
            "So but open Stack says that.",
            "This is only meant to be for developing, cannot for the production, and there is an alternative CV out which is used for as well.",
            "Is like temp out but it's more protected because only owner can access this configuration file, so it's optional and users.",
            "Also Jason coded files in the back end and uses a cluster as a storage.",
            "So."
        ],
        [
            "So object storage passwords are not in accordance with the CSA because they are in plain text.",
            "Their minimal length is 1 character can be long, so there is no complexity like high capital letters, small letters, numbers or something like this.",
            "None of these requirements are presented in this version.",
            "This weakness was reported to the open stack community.",
            "They are aware of it, but they didn't do anything much about it.",
            "So solution.",
            "Well, you can fix the access rights to all those certification database files.",
            "You can use Python model, hash sleep or encryption of super admin passwords in configuration files or use of SSL, but this takes you some work and a lot of things to change."
        ],
        [
            "So here we can see an example how administrator or reseller admin can obtain the URL address of the existing user and can download or delete files of users.",
            "So there is a problem if there is no encryption he can easily expose all these data stored in the.",
            "Object storage, so the solution would be to encrypt this data before the transmission."
        ],
        [
            "The Keystone is the new way of identity service for the open stack, which is not built in old of the components, only in the Noah.",
            "So the object storage is still here.",
            "Only those three authentication system that I showed you before.",
            "Keystone is a better thing because it uses my scale as a back end storage for the data.",
            "The passwords are all already.",
            "Test and encrypted in the database.",
            "It can be in the future.",
            "It will be possible to connect also without an open ID.",
            "How?"
        ],
        [
            "This is.",
            "Picture this picture represents how Keystone works, so I'll go just briefly through this and I'll try to summarize all the concepts of it, so user try to launch a server and then connect to the Keystone, and Keystone verifies through the endpoint and user IPI which services belongs to this user and after that the services that belongs to that user are transmitted to that user.",
            "So token is basically.",
            "In the row so talk."
        ],
        [
            "These are kind of kind of safe.",
            "There is no problems with the tokens there.",
            "The algorithm that is used is for the randomness is Python ready version four, so this part."
        ],
        [
            "Safe reliability gorgeous quickly.",
            "Because of the time.",
            "There is.",
            "There is a vulnerable machine inside virtual machine.",
            "Then only thing that we administration investigator can do is easily the infected one.",
            "Disable user account, user network firewall and the firewall is also available in the in the last version of the open stack.",
            "So they're doing some advantages and some fixes in the."
        ],
        [
            "Latest versions so recommendation recommendation recommendations would be for the object storage.",
            "Swift to use stamp out only for the development an for the production to USV out password, protection, that encryption to be present at the security portal and subscribe to there."
        ],
        [
            "Billing list and the for the future work.",
            "I've made some scripts for the open stack that they are doing the automatic installation of the object storage with the SSL and the Keystone building, so it's kind of.",
            "For for starters, to build and to make secure.",
            "Installation, so for the future we have something more on going on.",
            "So single sign-on will be built and maybe something else.",
            "So thank you for attention and questions.",
            "You said you built some scripts for the installation for which version of open stack for Diablo Diablo for the other version also works for the Essex version, so it works for them.",
            "Yeah, it works."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Hello, my name is Primosch where I come from your Steven Institute.",
                    "label": 0
                },
                {
                    "sent": "Like colleague said, I'll go briefly, quickly through the cloud security because I assume that you heard a lot about that in the previous sections and I'll focus mostly on open stack.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "This is the outline of my presentation.",
                    "label": 0
                },
                {
                    "sent": "I'll talk a little bit about cloud computing security issues in the cloud computing, and focus on open stack in the end.",
                    "label": 1
                },
                {
                    "sent": "Conclusion In the future work.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So cloud computing has many.",
                    "label": 0
                },
                {
                    "sent": "There are many definitions about cloud computing.",
                    "label": 0
                },
                {
                    "sent": "They all agree that this is a system on a demand.",
                    "label": 0
                },
                {
                    "sent": "We can use resources differently.",
                    "label": 0
                },
                {
                    "sent": "Resources we pay as we have a pay as you go model.",
                    "label": 0
                },
                {
                    "sent": "So it's a green ID.",
                    "label": 0
                },
                {
                    "sent": "Everything is perfect, everything is nice, but there are also some security issues in the back end we will see this for.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So for deployment models we have three type of deployment models, public clouds, private clouds and hybrid clouds.",
                    "label": 0
                },
                {
                    "sent": "In public clouds are more secure by mean less secure because they are exposed on the Internet and there are many.",
                    "label": 0
                },
                {
                    "sent": "Services and facilities are ability for this through the Internet and this way is exposed and less secure.",
                    "label": 1
                },
                {
                    "sent": "Private cloud clouds are usually meant for the organizations and they are closed, so there are more expensive but more secure hybrid clouds.",
                    "label": 0
                },
                {
                    "sent": "They are combined from the public and private clouds, so there is a lot of API tools that has to be connected and there is also many security issues going on because they have to upgrade those tools otherwise.",
                    "label": 0
                },
                {
                    "sent": "There can be some data leakage or.",
                    "label": 0
                },
                {
                    "sent": "Similar problems.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we are aware, there are three types of platforms in the service models in the cloud computing, I'll focus on infrastructure as a service.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The problem definition?",
                    "label": 0
                },
                {
                    "sent": "Well there is a big obstacle for users in the use of cloud securities in cloud security becausw.",
                    "label": 1
                },
                {
                    "sent": "2 days ago there was an example Amazon headache collapse alot of their services went off and on a different hosting accounts there were different web pages shown.",
                    "label": 0
                },
                {
                    "sent": "So this shows us how there are big problems with big providers as well.",
                    "label": 1
                },
                {
                    "sent": "So Amazon says we're not going to hurt you.",
                    "label": 0
                },
                {
                    "sent": "OK, that's alright.",
                    "label": 0
                },
                {
                    "sent": "But in the back there are.",
                    "label": 0
                },
                {
                    "sent": "There are things that we are not aware of.",
                    "label": 0
                },
                {
                    "sent": "There are images that are built by users and there can be some malicious code, insight and other problems.",
                    "label": 0
                },
                {
                    "sent": "So it's not that it's not that safe and there is also another problem with the data protection encryption, so it's nothing is encrypted in the cloud computing, so our data is exposed to administrators and other it.",
                    "label": 0
                },
                {
                    "sent": "Specialist",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So security issues are all well known.",
                    "label": 1
                },
                {
                    "sent": "The remaining threats abuse like I said, malicious insiders data lose or leakage.",
                    "label": 1
                },
                {
                    "sent": "Hijack account hijack known security profiles and so on.",
                    "label": 0
                },
                {
                    "sent": "We are all aware of that, and there are also some other organizations like CSA Nice Tynisa which tried to.",
                    "label": 0
                },
                {
                    "sent": "Warn people I mean.",
                    "label": 0
                },
                {
                    "sent": "Developers and the IT specialist to focus on those.",
                    "label": 0
                },
                {
                    "sent": "Suggestions so that they kind of follow the instructions and then make better platform in the back end and more secure so it's good to follow this organizations and read the advisor.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So with the data protection, the main protection risk is lose of data.",
                    "label": 1
                },
                {
                    "sent": "We never know if there is some kind of 3rd party company behind all.",
                    "label": 0
                },
                {
                    "sent": "All the services that the cloud computing cloud computing companies offering.",
                    "label": 1
                },
                {
                    "sent": "Maybe that third company will sell or our data to another company, so it's not save our data is not saving this case unauthorized access to your data so anyone can access this data.",
                    "label": 0
                },
                {
                    "sent": "Malicious things are going on as well.",
                    "label": 1
                },
                {
                    "sent": "Like viruses and bot Nets and so on.",
                    "label": 0
                },
                {
                    "sent": "Poor internal IT security can bring that insiders employees in that cloud computing company can access that as well, because it's not encrypted.",
                    "label": 0
                },
                {
                    "sent": "And what will happen with the deletion of data in case that all data is deleted, do they have regular backups?",
                    "label": 1
                },
                {
                    "sent": "Will we get those?",
                    "label": 0
                },
                {
                    "sent": "Data back and so on.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Private with privacy, it's really important that this is well defined in the start.",
                    "label": 0
                },
                {
                    "sent": "Otherwise, end users are not aware where they are going and what will happen with their data and who is having control of all of all of it.",
                    "label": 1
                },
                {
                    "sent": "There are some also.",
                    "label": 0
                },
                {
                    "sent": "There are also some privacy breaches, risk management and so on, so it's really important to focus on and read that privacy things before moving to the cloud.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "With cryptography like I mentioned before, that is not data is not encrypted on the cloud storage, so.",
                    "label": 1
                },
                {
                    "sent": "It's on the user side to take care of it, to encrypt data and then transfer it to the cloud storage.",
                    "label": 0
                },
                {
                    "sent": "Otherwise anyone can access it.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And identify management registration of entities.",
                    "label": 1
                },
                {
                    "sent": "It's important that we have some kind of synchronization between the users in our company and users in the cloud storage or cloud computing 'cause otherwise employee can leave the company and then there is a problem because all these data stays there in the cloud computing still on and this is not secure and it's not good.",
                    "label": 1
                },
                {
                    "sent": "So further education.",
                    "label": 0
                },
                {
                    "sent": "It's also good to have one.",
                    "label": 0
                },
                {
                    "sent": "Passwords and not pass that, at least for a long time.",
                    "label": 1
                },
                {
                    "sent": "Authorization to specify exact rules which specify exact rules that users are in.",
                    "label": 1
                },
                {
                    "sent": "That having used and for in Federation of entities, there is no single sign on at the moment, so it's important that those.",
                    "label": 0
                },
                {
                    "sent": "Data is exchanged in a manner way through the SSL or something like that.",
                    "label": 0
                },
                {
                    "sent": "Otherwise this information can leak out as well.",
                    "label": 0
                },
                {
                    "sent": "Now we.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And focus on open stack here is there will be a quick review of existing components.",
                    "label": 0
                },
                {
                    "sent": "Quick look at the authorization and authentication and some of the recommendations.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "As we can see, open stack is doing their job really good.",
                    "label": 0
                },
                {
                    "sent": "They are developing all the time.",
                    "label": 0
                },
                {
                    "sent": "I mean every six months they bring us new version with updates and many bug fixes and so on, But the problem persists till in the back end where there are many security issues and vulnerabilities still still persists.",
                    "label": 0
                },
                {
                    "sent": "I'll show you just a few of them.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The company main components of the open stack.",
                    "label": 0
                },
                {
                    "sent": "There are three main components.",
                    "label": 0
                },
                {
                    "sent": "One is Nova, Swift, and then there's, another one is swift and the third one is repository cleanse.",
                    "label": 0
                },
                {
                    "sent": "So Norma is like provision of management, large of network and virtual machines where you can lift up the shutdown virtual machines.",
                    "label": 0
                },
                {
                    "sent": "Object storage is like it's not a file system, but is the storage for the IT can be storage for images and for data as well.",
                    "label": 0
                },
                {
                    "sent": "I will focus on speed because it has many.",
                    "label": 0
                },
                {
                    "sent": "Probabilities and glances like a big catalog of all those images saved on the.",
                    "label": 0
                },
                {
                    "sent": "In this with.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So general overview compute, like as mentioned before, this is 1.",
                    "label": 0
                },
                {
                    "sent": "One component uses building Keystone Authentication System authorization is used for iteration.",
                    "label": 0
                },
                {
                    "sent": "There is token used, the issues that are present here in computers are simple passwords, unprotected passwords in the novel configuration files.",
                    "label": 1
                },
                {
                    "sent": "And there are unprotected.",
                    "label": 1
                },
                {
                    "sent": "Passwords as well in object storage in configuration file and image services.",
                    "label": 1
                },
                {
                    "sent": "This component has also some issues with the keys that are publicly accessible and they don't have correct if they don't have correct permissions to access those files, so their suggestions for all these components could be some password complexity SSL encryption, so there won't be any SSL.",
                    "label": 0
                },
                {
                    "sent": "I mean man in the middle attack.",
                    "label": 0
                },
                {
                    "sent": "Available and correct.",
                    "label": 0
                },
                {
                    "sent": "Write and read permissions for the keys.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Maybe I can skip this?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And focusing mainly on this, so obvious like I mentioned before, swift object storage.",
                    "label": 1
                },
                {
                    "sent": "This is like a drop box version in open stack.",
                    "label": 0
                },
                {
                    "sent": "It uses three types of authentication system.",
                    "label": 0
                },
                {
                    "sent": "They're out was already dropped.",
                    "label": 0
                },
                {
                    "sent": "A year ago because there were so many insecure.",
                    "label": 0
                },
                {
                    "sent": "Things going on in back end SQL Database was really slow.",
                    "label": 0
                },
                {
                    "sent": "Anyone could access configuration files and everything was in plain text in a new version of Object Storage open stack.",
                    "label": 0
                },
                {
                    "sent": "There is building temp out authentication system which is not secure as well because it uses plaintext and plaintext passwords and main administrator password is also saved in plaintext.",
                    "label": 1
                },
                {
                    "sent": "In this configuration file.",
                    "label": 0
                },
                {
                    "sent": "But the bad thing is also that anyone can access.",
                    "label": 0
                },
                {
                    "sent": "I made a mistake here.",
                    "label": 0
                },
                {
                    "sent": "Sorry, anyone can access this configuration file.",
                    "label": 0
                },
                {
                    "sent": "Not only the owner.",
                    "label": 0
                },
                {
                    "sent": "So for a built-in system authentication system this is really bad.",
                    "label": 1
                },
                {
                    "sent": "So but open Stack says that.",
                    "label": 0
                },
                {
                    "sent": "This is only meant to be for developing, cannot for the production, and there is an alternative CV out which is used for as well.",
                    "label": 0
                },
                {
                    "sent": "Is like temp out but it's more protected because only owner can access this configuration file, so it's optional and users.",
                    "label": 0
                },
                {
                    "sent": "Also Jason coded files in the back end and uses a cluster as a storage.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So object storage passwords are not in accordance with the CSA because they are in plain text.",
                    "label": 1
                },
                {
                    "sent": "Their minimal length is 1 character can be long, so there is no complexity like high capital letters, small letters, numbers or something like this.",
                    "label": 0
                },
                {
                    "sent": "None of these requirements are presented in this version.",
                    "label": 1
                },
                {
                    "sent": "This weakness was reported to the open stack community.",
                    "label": 0
                },
                {
                    "sent": "They are aware of it, but they didn't do anything much about it.",
                    "label": 0
                },
                {
                    "sent": "So solution.",
                    "label": 0
                },
                {
                    "sent": "Well, you can fix the access rights to all those certification database files.",
                    "label": 0
                },
                {
                    "sent": "You can use Python model, hash sleep or encryption of super admin passwords in configuration files or use of SSL, but this takes you some work and a lot of things to change.",
                    "label": 1
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So here we can see an example how administrator or reseller admin can obtain the URL address of the existing user and can download or delete files of users.",
                    "label": 1
                },
                {
                    "sent": "So there is a problem if there is no encryption he can easily expose all these data stored in the.",
                    "label": 0
                },
                {
                    "sent": "Object storage, so the solution would be to encrypt this data before the transmission.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The Keystone is the new way of identity service for the open stack, which is not built in old of the components, only in the Noah.",
                    "label": 0
                },
                {
                    "sent": "So the object storage is still here.",
                    "label": 0
                },
                {
                    "sent": "Only those three authentication system that I showed you before.",
                    "label": 0
                },
                {
                    "sent": "Keystone is a better thing because it uses my scale as a back end storage for the data.",
                    "label": 0
                },
                {
                    "sent": "The passwords are all already.",
                    "label": 0
                },
                {
                    "sent": "Test and encrypted in the database.",
                    "label": 0
                },
                {
                    "sent": "It can be in the future.",
                    "label": 0
                },
                {
                    "sent": "It will be possible to connect also without an open ID.",
                    "label": 1
                },
                {
                    "sent": "How?",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is.",
                    "label": 0
                },
                {
                    "sent": "Picture this picture represents how Keystone works, so I'll go just briefly through this and I'll try to summarize all the concepts of it, so user try to launch a server and then connect to the Keystone, and Keystone verifies through the endpoint and user IPI which services belongs to this user and after that the services that belongs to that user are transmitted to that user.",
                    "label": 0
                },
                {
                    "sent": "So token is basically.",
                    "label": 0
                },
                {
                    "sent": "In the row so talk.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "These are kind of kind of safe.",
                    "label": 0
                },
                {
                    "sent": "There is no problems with the tokens there.",
                    "label": 1
                },
                {
                    "sent": "The algorithm that is used is for the randomness is Python ready version four, so this part.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Safe reliability gorgeous quickly.",
                    "label": 0
                },
                {
                    "sent": "Because of the time.",
                    "label": 0
                },
                {
                    "sent": "There is.",
                    "label": 0
                },
                {
                    "sent": "There is a vulnerable machine inside virtual machine.",
                    "label": 0
                },
                {
                    "sent": "Then only thing that we administration investigator can do is easily the infected one.",
                    "label": 0
                },
                {
                    "sent": "Disable user account, user network firewall and the firewall is also available in the in the last version of the open stack.",
                    "label": 1
                },
                {
                    "sent": "So they're doing some advantages and some fixes in the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Latest versions so recommendation recommendation recommendations would be for the object storage.",
                    "label": 0
                },
                {
                    "sent": "Swift to use stamp out only for the development an for the production to USV out password, protection, that encryption to be present at the security portal and subscribe to there.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Billing list and the for the future work.",
                    "label": 1
                },
                {
                    "sent": "I've made some scripts for the open stack that they are doing the automatic installation of the object storage with the SSL and the Keystone building, so it's kind of.",
                    "label": 1
                },
                {
                    "sent": "For for starters, to build and to make secure.",
                    "label": 0
                },
                {
                    "sent": "Installation, so for the future we have something more on going on.",
                    "label": 0
                },
                {
                    "sent": "So single sign-on will be built and maybe something else.",
                    "label": 1
                },
                {
                    "sent": "So thank you for attention and questions.",
                    "label": 0
                },
                {
                    "sent": "You said you built some scripts for the installation for which version of open stack for Diablo Diablo for the other version also works for the Essex version, so it works for them.",
                    "label": 0
                },
                {
                    "sent": "Yeah, it works.",
                    "label": 0
                }
            ]
        }
    }
}