{
    "id": "vkd4oa2kvfdcvjrphp35ezmtbloyyrbh",
    "title": "PCS2OWL: A Generic Approach for Deriving Web Ontologies from Product Classification Systems",
    "info": {
        "author": [
            "Martin Hepp, Bundeswehr University of Munich"
        ],
        "published": "July 30, 2014",
        "recorded": "May 2014",
        "category": [
            "Top->Computer Science->Big Data",
            "Top->Computer Science->Semantic Web"
        ]
    },
    "url": "http://videolectures.net/eswc2014_hepp_generic/",
    "segmentation": [
        [
            "A warm welcome.",
            "I'm the last one who is between you and lunch so I know that very privileged position.",
            "Um?",
            "And this was a controversial paper.",
            "I'm surprised it isn't marked as this in the proceedings.",
            "Actually we're picking up work, but."
        ],
        [
            "Started in 2007, trying to lift informal classifications into or to the level of valid.",
            "All ontologies that can be used to annotate product data.",
            "Um?",
            "So those of you who have also attended the SWC 2007 may remember a few topics in here.",
            "Have you attended the SWC 2007 one?",
            "23 K It's my eighth esw see I remembered.",
            "I found out yesterday.",
            "OK, now if we want to build the semantic web.",
            "And some people may have seen from some of my comments on mailing lists that I'm not so.",
            "So not so sure that I actually want to build the semantic web, but that's another story.",
            "We need pretty specific classes, properties, an enumerated values.",
            "So in many examples we can get away with pretty abstract.",
            "Types for things.",
            "So we can work with the class topic at a ticket or we can work with the class.",
            "Transportation, but what people are really trading?",
            "In Ikoma scenarios are very specific things.",
            "For example this is a device, I think for cleaning windows.",
            "I have a nice image of a German truck with a big label.",
            "We sell hors musli.",
            "So very specific products.",
            "So when we really want to use semantic technology for improving.",
            "Search for suppliers.",
            "All the integration of any kind of product related data.",
            "We actually need types for these youth for this huge amount of different kinds of things.",
            "So the level of abstraction that we use user usually look at in handcrafted ontologies, or in psych, or even in schema.org are not sufficient for processing product type information.",
            "Formerly.",
            "It's of course questionable whether we need type information at that level.",
            "Um?",
            "At the in, in the form of ontology classes.",
            "So search engines, for example, use a lot of.",
            "Entity recognition and text based classification of objects to group similar products, but one working assumption of our community is that most of the processing of entities takes place on the basis of the explicitly given classes.",
            "So we do with sparkle query and search for a product that we can use for a certain purpose.",
            "One core assumption of our community, at least of the traditional semantic Web technology stack, is that we can take the class information as a starting point for most of the processing of data.",
            "So we need lots of specific classes, properties and enumerated values for describing things.",
            "Such ontology should be complied with the good relations metamodel.",
            "Because then they can be used with goodrelationsandschema.org for describing your products and they should be diploid according to linked open data principles.",
            "So all class description should be should have your eyes and they should be referenceable and things like that."
        ],
        [
            "Now just to give you a glimpse of what's out there for reuse, there are a lot of informal classification standards that try to group products.",
            "The CPC CPA E Class is very famous eating free class profit class.",
            "the Google product taxonomy is very lightweight and they have anything between a few thousands and 10s of thousands of classes.",
            "Some of them also define and standardize properties.",
            "Here, in particular, the class has.",
            "Had in version 6.1 up.",
            "Sorry sorry almost 10,000 properties.",
            "They have now way more profit class has 4000.",
            "Some of them also define individuals for these actually enumerated values.",
            "For example if you have door handle types or power plugs then those are usually described by individuals so you see those are pretty big.",
            "And unfortunately, so unfortunate."
        ],
        [
            "They are very difficult to use for the semantic web as it stands because.",
            "In, in essence, they are just.",
            "Strings sometimes accompanied by.",
            "A hierarchy and the problem is that the strings to categories that make these categories standards have a very weak kind of topic semantics.",
            "That means they don't really.",
            "There is no no real notion of X is an instance of this category.",
            "There is no notion of something being an instance of that, because the strings can also be used in different contexts with different meaning assigned.",
            "For example, the USPS standard has lots of classes for types of products, but it's used for grouping invoices related to certain types of products.",
            "And is used for grouping products in certain catalogs.",
            "But when you order a bottle of mineral water, you likely don't want to get an invoice for a bottle of mineral water, or if you are searching for.",
            "If you're searching for a camcorder you don't want to get, maybe you want, but you do.",
            "Don't want to get a person who is competent in camcorders.",
            "So in a nutshell, these classifications in the original context are very often used with incompatible meanings assigned to the classes used for grouping very different things.",
            "And when you lift them to the web of linked data, you want to create your eyes that have an unambiguous definition of of what this type stands for, so it shouldn't depend on the context of the query.",
            "What this stands for, then you have a hierarchy in many of these classifications, but they have an unclear semantics.",
            "It would you use RDF subclass to represent the relationship.",
            "Would you use coarse products cause broader, transitive or something else?",
            "You also find patterns where the meaning of the hierarchy relation depends on the level of the hierarchy.",
            "So between the 1st and the second level it means something different than between the 3rd and the 4th.",
            "Such things have been studied in knowledge representation for quite some time.",
            "Main problem.",
            "In the product domain, is that these classification systems are very big and they evolve.",
            "Also, they are very often subject to Copyright restrictions.",
            "That means while you are often able to download a CSV file or a PDF version or an XML file of that classification freely on the web.",
            "There are strings attached in the legal sense that prevent you from republish and republishing any derived versions.",
            "So for example, one standards body, you and the units PC, for example publishers.",
            "And XML or I think an Excel file that you can either get freely or purchased very cheaply from them.",
            "But if you derive an old ontology and put the same content back on the web in a different format, you would need their permission because these are subject to Copyright.",
            "In fact, there have been lawsuits in the United States.",
            "In other contexts where there were the outcome was clearly that taxonomic structures.",
            "Mr Subject to Copyright.",
            "So if some company creates a taxonomic structure, you should not simply write a Python script, develop a diploid, or derive an all ontology and put it on your website.",
            "This may work until you get white visibility.",
            "Now we cannot solve this problem of Copyright in there.",
            "I can only tell you that in the case of the UNSPSCI derive the first old version, I think seven years ago and had tried for three years to get permission by.",
            "The United Nations, which is a non not for profit organization to get permission.",
            "To publish it on my server and after two or three years, I simply gave up.",
            "I can't put it on the web because I don't want to risk a lawsuit.",
            "But I also don't want to spend five years trying to get the permission, but what we could do is develop a technique so that users can locali generate Canonical or representations of the same standard that would already get us pretty far.",
            "If, for example, companies are internally using the respective all ontologies and we provide a tool that they can locally rebuilt the all ontologies and the only thing that we would need is sharing a few configuration file.",
            "That determines the base, your eye and a few conceptual choices.",
            "Then everybody who needs that ontology could locally generated.",
            "The only downside we'd have is that the ontology would not be dereferenceable, at least not in not publicly, so we'd have to use any kind of HTTP access control.",
            "So that was one of the approach."
        ],
        [
            "So it shouldn't be a one time effort.",
            "Again, these ontologies, or these classification systems are pretty big.",
            "So writing a protege plugin to load these ontologies cleans them, align them with psychandschema.org and oboe and whatever is around.",
            "May take the rest of your lifetime."
        ],
        [
            "And they evolve beneath your feet.",
            "So, and actually they evolve.",
            "Not not fast, not as fast as they should because new types of products come up.",
            "Are being brought up every day so you really have to generate the respective representation over and over again.",
            "It really doesn't help our community if we do one time snapshots of static.",
            "All representations of such standards, if the standards evolve.",
            "It may be even a disservice to the community, because then what the semantic Web community users is outdated."
        ],
        [
            "Now back in 2007.",
            "I proposed an approach that has received much criticism.",
            "It's called Gentex and the notion the idea is pretty simple.",
            "When you have a category you have this broad notion of a topic that can be anything you have.",
            "The label camcorder and it can be people competent with camcorders and can be actual camcorders.",
            "Can be invoices about camcorders or it can be the broad topic.",
            "Everything that is somehow related to camcorders.",
            "And what you do is you derive two classes from that informal.",
            "Yeah, category.",
            "One that has a broader taxonomic meaning.",
            "It can be a simple topic, but it can also be narrowed down formally.",
            "What you do is you build.",
            "You define a master concept that is, for example product or people or topic, and you build the intersection between that category and that master concept and then you have a more specific type.",
            "When you for example want to say something is a product, you define a second master concept and you.",
            "Use the intersection of these two, so again, this is pretty old stuff in 2014, but the nice thing is.",
            "First of all, you can control the shape of the resulting classes.",
            "So for example you can take anyschema.org class.",
            "People, organizations, whatever, and say well, this is the top.",
            "This is the master class.",
            "The master concept for the resulting classes and then in the end you get a taxonomy of.",
            "Only of, for example, company types of products or something else.",
            "The next step is that if you have a hierarchy, you arrange the broader topics in a subsumption hierarchy based on the original hierarchy.",
            "We have to test whether that is valid.",
            "That's the second step, and you make all the specific types of subclass of the respective broad topic.",
            "So, for example, you take the category labeled camcorder.",
            "You create one class camcorder as a topic and one class camcorder as a product.",
            "And you say a camcorder as a product is a subclass of the broader notion of everything that is related to the topic of camcorders.",
            "And then something that is not really fully realized is the core idea.",
            "One of the core ideas was that you can use statistic that you can use random samples to validate whether your conceptual choices are sufficiently.",
            "Correct for the whole big ontology.",
            "So for example, you draw a random sample of the resulting leaf nodes.",
            "And you manually check whether there the subsumption hierarchy is valid, or whether there's an inconsistency an if you don't find a contradiction in your random sample, you can compute the confidence that your whole ontology is big.",
            "It's not perfect, but it's a cheap way because with comparatively small samples you can get far."
        ],
        [
            "So this is how it would look when applied to the Google product taxonomy.",
            "You create a topic class and you create for cameras and optics.",
            "And for example, disposable cameras as a topic is clearly a subclass of this, and you generate the more specific ones.",
            "Um?"
        ],
        [
            "So what is the advantage of this approach?",
            "The result isn't is a valid old one, or all two DL ontology.",
            "Well, actually when you import good relations it is no longer a valid O2 DL ontology becausw in all two good relations is unfortunately all full.",
            "You can do that fully mechanical once you have made a few structural choices.",
            "And you can use all RF subclass for operating over the hierarchy, so you don't need any proprietary inferencing which you would need if you define.",
            "Any object in any proprietary properties for linking the respective elements.",
            "You can control the meaning of the derived classes.",
            "And you guys said you can use random samples to control the reliability now though."
        ],
        [
            "This one ontology design pattern that is related using the is classified by.",
            "Or it's called is classified by where you say when you make an instance from each category and link entities to link entities to that instance.",
            "Oh, this is.",
            "Possible the problem with that is that you have no direct way of representing the hierarchy in the classification.",
            "You can do so with the transitive property, but then it would require.",
            "Non standard reasoning, you wouldn't automatically find.",
            "Elements that are classified by a sub category.",
            "You cannot directly use the categories as classes because they are instances.",
            "So when you want to mix them with classes from other product ontologies, that wouldn't work directly and you cannot use all reasoning for the transitivity of RDF subclass.",
            "You can of course use sparkle, construct rules or proprietary reasoning, but.",
            "In general, the querying the data gets more complicated and requires more advanced reasoning.",
            "Um now?"
        ],
        [
            "Our contribution mainly extending Gentex and we in the in use track quite clearly here to deriving good relations, compliant product ontologies.",
            "So taking into account all the constraints that are resulting from the good relations metamodel, we added support for properties and enumerations.",
            "And linked open data deployement of the resulting ontology.",
            "So in the script actually returns a directory with all the files that you push to a server of your choice you uploaded via FTP SFTP and you're done and we converted 13 standards into respective good relations extensions."
        ],
        [
            "So the tool as a as Python Python command line tool is available here freely.",
            "Defines Canonical your eyes for all the 13 standards.",
            "Tries to preserve the taxonomic structure.",
            "IS compliant with goodrelationsandschema.org."
        ],
        [
            "And that's a basic tool structure, so we have a core transformation component.",
            "You have a very lightweight custom puzzle, so when you want to translate a proprietary hierarchy or catalog group structure, you just have to add a few lines of Python code.",
            "One thing that is also."
        ],
        [
            "An extension over previous workers.",
            "It's not only suited for product categorisation standards or something published openly, but it can also be used to turn any kind of proprietary catalog group structures, like the categories in the shop into a valid all ontology.",
            "It creates HTML documentations and all that implementation stuff.",
            "So this is basically what we already had."
        ],
        [
            "One thing that is a challenge when you derive respective ontologies is that the good relations meta model has supports 3 core distinctions for product features.",
            "If qualitative properties that link to a value type and a list of any rated values quantitative properties that represent some kind of quantity and data type properties that are used directly with literals, Now it's not as trivial as it may sound to make that distinction because you cannot directly.",
            "Use the data type 'cause a sequence of numbers, for example, could be a code or a quantity.",
            "So in the code that is represented by a number should not be made a quantitative property in the good relations meta model.",
            "So the tool contains several rules and heuristics to try to solve that automatically.",
            "You can configure it according to for example the size of the classification standard and then for example."
        ],
        [
            "Size or hash based your eyes.",
            "That's a simple choice in the configuration file.",
            "Um?"
        ],
        [
            "And here's a list of the resulting ontologies, some of them we were able to put freely on the web and what we."
        ],
        [
            "And says that it drastically reduced the effort for generating the respective all ontologies.",
            "We also did this for a few proprietary category systems, so for example the Google product taxonomy.",
            "Um?"
        ],
        [
            "And the link data deployement shown in here we chose to deliver the ontologies in small chunks.",
            "So you have basically one already based serialization of the respective class and property definitions so that you have comparatively small elements.",
            "This is a lesson lesson learned from the earlier transformations where we built single files with 30 or 60,000 classes.",
            "And again this is.",
            "All done pretty much automatically.",
            "We use ginger, the ginger templating language to generate the respective code.",
            "I think we're also using Ginger by the way, to generate the RDF and Turtle variants, because this is a way more performance than using RDF libraries, at least in this particular case, because we don't have to pass the whole.",
            "Standard in one turn."
        ],
        [
            "You can use the hierarchy to navigate.",
            "And."
        ],
        [
            "This is what I tried to explain earlier when you use.",
            "Narrow transitive, narrow, narrow transitive.",
            "Or whether it's already have a subclass of you draw samples of the leave objects, and if you find if you don't find any violation then you can assume with a certain confidence that your conceptual choices hold for the whole vocabulary and you can calibrate that according to your.",
            "To your budget, to the cost of failure, the benefit of having a taxonomy at all in here you see a contradiction.",
            "So a swap drive.",
            "Um is or probably yeah, swap drive is not a computer and not video game.",
            "OK, so this is.",
            "That yes, there's one.",
            "Contradiction you can of course then assess this for the whole taxonomy you can."
        ],
        [
            "Is that in microdata already FA any any syntax for indicating for giving more precise type information?"
        ],
        [
            "Well, yeah, and that's that was the contribution.",
            "Um?",
            "Building a tool that you can use for generating such valid old ontologies automatically and in a deployement ready format so the idea is really that you can generate locally respective all ontologies and the only thing that you have to do is publish them on a web server.",
            "OK, we all live."
        ],
        [
            "From taxpayers money and gratefully acknowledge their support."
        ],
        [
            "So if you have questions, I'd be happy to try to answer them.",
            "That would be.",
            "My part so far, thanks."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "A warm welcome.",
                    "label": 0
                },
                {
                    "sent": "I'm the last one who is between you and lunch so I know that very privileged position.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "And this was a controversial paper.",
                    "label": 0
                },
                {
                    "sent": "I'm surprised it isn't marked as this in the proceedings.",
                    "label": 0
                },
                {
                    "sent": "Actually we're picking up work, but.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Started in 2007, trying to lift informal classifications into or to the level of valid.",
                    "label": 0
                },
                {
                    "sent": "All ontologies that can be used to annotate product data.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "So those of you who have also attended the SWC 2007 may remember a few topics in here.",
                    "label": 0
                },
                {
                    "sent": "Have you attended the SWC 2007 one?",
                    "label": 0
                },
                {
                    "sent": "23 K It's my eighth esw see I remembered.",
                    "label": 0
                },
                {
                    "sent": "I found out yesterday.",
                    "label": 0
                },
                {
                    "sent": "OK, now if we want to build the semantic web.",
                    "label": 0
                },
                {
                    "sent": "And some people may have seen from some of my comments on mailing lists that I'm not so.",
                    "label": 0
                },
                {
                    "sent": "So not so sure that I actually want to build the semantic web, but that's another story.",
                    "label": 0
                },
                {
                    "sent": "We need pretty specific classes, properties, an enumerated values.",
                    "label": 0
                },
                {
                    "sent": "So in many examples we can get away with pretty abstract.",
                    "label": 0
                },
                {
                    "sent": "Types for things.",
                    "label": 0
                },
                {
                    "sent": "So we can work with the class topic at a ticket or we can work with the class.",
                    "label": 0
                },
                {
                    "sent": "Transportation, but what people are really trading?",
                    "label": 0
                },
                {
                    "sent": "In Ikoma scenarios are very specific things.",
                    "label": 0
                },
                {
                    "sent": "For example this is a device, I think for cleaning windows.",
                    "label": 0
                },
                {
                    "sent": "I have a nice image of a German truck with a big label.",
                    "label": 0
                },
                {
                    "sent": "We sell hors musli.",
                    "label": 0
                },
                {
                    "sent": "So very specific products.",
                    "label": 0
                },
                {
                    "sent": "So when we really want to use semantic technology for improving.",
                    "label": 0
                },
                {
                    "sent": "Search for suppliers.",
                    "label": 0
                },
                {
                    "sent": "All the integration of any kind of product related data.",
                    "label": 0
                },
                {
                    "sent": "We actually need types for these youth for this huge amount of different kinds of things.",
                    "label": 0
                },
                {
                    "sent": "So the level of abstraction that we use user usually look at in handcrafted ontologies, or in psych, or even in schema.org are not sufficient for processing product type information.",
                    "label": 0
                },
                {
                    "sent": "Formerly.",
                    "label": 0
                },
                {
                    "sent": "It's of course questionable whether we need type information at that level.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "At the in, in the form of ontology classes.",
                    "label": 0
                },
                {
                    "sent": "So search engines, for example, use a lot of.",
                    "label": 0
                },
                {
                    "sent": "Entity recognition and text based classification of objects to group similar products, but one working assumption of our community is that most of the processing of entities takes place on the basis of the explicitly given classes.",
                    "label": 0
                },
                {
                    "sent": "So we do with sparkle query and search for a product that we can use for a certain purpose.",
                    "label": 0
                },
                {
                    "sent": "One core assumption of our community, at least of the traditional semantic Web technology stack, is that we can take the class information as a starting point for most of the processing of data.",
                    "label": 0
                },
                {
                    "sent": "So we need lots of specific classes, properties and enumerated values for describing things.",
                    "label": 1
                },
                {
                    "sent": "Such ontology should be complied with the good relations metamodel.",
                    "label": 1
                },
                {
                    "sent": "Because then they can be used with goodrelationsandschema.org for describing your products and they should be diploid according to linked open data principles.",
                    "label": 0
                },
                {
                    "sent": "So all class description should be should have your eyes and they should be referenceable and things like that.",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now just to give you a glimpse of what's out there for reuse, there are a lot of informal classification standards that try to group products.",
                    "label": 1
                },
                {
                    "sent": "The CPC CPA E Class is very famous eating free class profit class.",
                    "label": 0
                },
                {
                    "sent": "the Google product taxonomy is very lightweight and they have anything between a few thousands and 10s of thousands of classes.",
                    "label": 0
                },
                {
                    "sent": "Some of them also define and standardize properties.",
                    "label": 0
                },
                {
                    "sent": "Here, in particular, the class has.",
                    "label": 0
                },
                {
                    "sent": "Had in version 6.1 up.",
                    "label": 0
                },
                {
                    "sent": "Sorry sorry almost 10,000 properties.",
                    "label": 0
                },
                {
                    "sent": "They have now way more profit class has 4000.",
                    "label": 0
                },
                {
                    "sent": "Some of them also define individuals for these actually enumerated values.",
                    "label": 0
                },
                {
                    "sent": "For example if you have door handle types or power plugs then those are usually described by individuals so you see those are pretty big.",
                    "label": 0
                },
                {
                    "sent": "And unfortunately, so unfortunate.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "They are very difficult to use for the semantic web as it stands because.",
                    "label": 1
                },
                {
                    "sent": "In, in essence, they are just.",
                    "label": 0
                },
                {
                    "sent": "Strings sometimes accompanied by.",
                    "label": 0
                },
                {
                    "sent": "A hierarchy and the problem is that the strings to categories that make these categories standards have a very weak kind of topic semantics.",
                    "label": 0
                },
                {
                    "sent": "That means they don't really.",
                    "label": 0
                },
                {
                    "sent": "There is no no real notion of X is an instance of this category.",
                    "label": 0
                },
                {
                    "sent": "There is no notion of something being an instance of that, because the strings can also be used in different contexts with different meaning assigned.",
                    "label": 0
                },
                {
                    "sent": "For example, the USPS standard has lots of classes for types of products, but it's used for grouping invoices related to certain types of products.",
                    "label": 0
                },
                {
                    "sent": "And is used for grouping products in certain catalogs.",
                    "label": 0
                },
                {
                    "sent": "But when you order a bottle of mineral water, you likely don't want to get an invoice for a bottle of mineral water, or if you are searching for.",
                    "label": 0
                },
                {
                    "sent": "If you're searching for a camcorder you don't want to get, maybe you want, but you do.",
                    "label": 0
                },
                {
                    "sent": "Don't want to get a person who is competent in camcorders.",
                    "label": 0
                },
                {
                    "sent": "So in a nutshell, these classifications in the original context are very often used with incompatible meanings assigned to the classes used for grouping very different things.",
                    "label": 0
                },
                {
                    "sent": "And when you lift them to the web of linked data, you want to create your eyes that have an unambiguous definition of of what this type stands for, so it shouldn't depend on the context of the query.",
                    "label": 0
                },
                {
                    "sent": "What this stands for, then you have a hierarchy in many of these classifications, but they have an unclear semantics.",
                    "label": 0
                },
                {
                    "sent": "It would you use RDF subclass to represent the relationship.",
                    "label": 0
                },
                {
                    "sent": "Would you use coarse products cause broader, transitive or something else?",
                    "label": 0
                },
                {
                    "sent": "You also find patterns where the meaning of the hierarchy relation depends on the level of the hierarchy.",
                    "label": 0
                },
                {
                    "sent": "So between the 1st and the second level it means something different than between the 3rd and the 4th.",
                    "label": 0
                },
                {
                    "sent": "Such things have been studied in knowledge representation for quite some time.",
                    "label": 0
                },
                {
                    "sent": "Main problem.",
                    "label": 0
                },
                {
                    "sent": "In the product domain, is that these classification systems are very big and they evolve.",
                    "label": 1
                },
                {
                    "sent": "Also, they are very often subject to Copyright restrictions.",
                    "label": 0
                },
                {
                    "sent": "That means while you are often able to download a CSV file or a PDF version or an XML file of that classification freely on the web.",
                    "label": 0
                },
                {
                    "sent": "There are strings attached in the legal sense that prevent you from republish and republishing any derived versions.",
                    "label": 0
                },
                {
                    "sent": "So for example, one standards body, you and the units PC, for example publishers.",
                    "label": 0
                },
                {
                    "sent": "And XML or I think an Excel file that you can either get freely or purchased very cheaply from them.",
                    "label": 0
                },
                {
                    "sent": "But if you derive an old ontology and put the same content back on the web in a different format, you would need their permission because these are subject to Copyright.",
                    "label": 0
                },
                {
                    "sent": "In fact, there have been lawsuits in the United States.",
                    "label": 0
                },
                {
                    "sent": "In other contexts where there were the outcome was clearly that taxonomic structures.",
                    "label": 0
                },
                {
                    "sent": "Mr Subject to Copyright.",
                    "label": 0
                },
                {
                    "sent": "So if some company creates a taxonomic structure, you should not simply write a Python script, develop a diploid, or derive an all ontology and put it on your website.",
                    "label": 0
                },
                {
                    "sent": "This may work until you get white visibility.",
                    "label": 0
                },
                {
                    "sent": "Now we cannot solve this problem of Copyright in there.",
                    "label": 0
                },
                {
                    "sent": "I can only tell you that in the case of the UNSPSCI derive the first old version, I think seven years ago and had tried for three years to get permission by.",
                    "label": 0
                },
                {
                    "sent": "The United Nations, which is a non not for profit organization to get permission.",
                    "label": 0
                },
                {
                    "sent": "To publish it on my server and after two or three years, I simply gave up.",
                    "label": 0
                },
                {
                    "sent": "I can't put it on the web because I don't want to risk a lawsuit.",
                    "label": 0
                },
                {
                    "sent": "But I also don't want to spend five years trying to get the permission, but what we could do is develop a technique so that users can locali generate Canonical or representations of the same standard that would already get us pretty far.",
                    "label": 0
                },
                {
                    "sent": "If, for example, companies are internally using the respective all ontologies and we provide a tool that they can locally rebuilt the all ontologies and the only thing that we would need is sharing a few configuration file.",
                    "label": 0
                },
                {
                    "sent": "That determines the base, your eye and a few conceptual choices.",
                    "label": 0
                },
                {
                    "sent": "Then everybody who needs that ontology could locally generated.",
                    "label": 0
                },
                {
                    "sent": "The only downside we'd have is that the ontology would not be dereferenceable, at least not in not publicly, so we'd have to use any kind of HTTP access control.",
                    "label": 0
                },
                {
                    "sent": "So that was one of the approach.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So it shouldn't be a one time effort.",
                    "label": 0
                },
                {
                    "sent": "Again, these ontologies, or these classification systems are pretty big.",
                    "label": 1
                },
                {
                    "sent": "So writing a protege plugin to load these ontologies cleans them, align them with psychandschema.org and oboe and whatever is around.",
                    "label": 0
                },
                {
                    "sent": "May take the rest of your lifetime.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And they evolve beneath your feet.",
                    "label": 1
                },
                {
                    "sent": "So, and actually they evolve.",
                    "label": 0
                },
                {
                    "sent": "Not not fast, not as fast as they should because new types of products come up.",
                    "label": 0
                },
                {
                    "sent": "Are being brought up every day so you really have to generate the respective representation over and over again.",
                    "label": 0
                },
                {
                    "sent": "It really doesn't help our community if we do one time snapshots of static.",
                    "label": 0
                },
                {
                    "sent": "All representations of such standards, if the standards evolve.",
                    "label": 0
                },
                {
                    "sent": "It may be even a disservice to the community, because then what the semantic Web community users is outdated.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now back in 2007.",
                    "label": 0
                },
                {
                    "sent": "I proposed an approach that has received much criticism.",
                    "label": 0
                },
                {
                    "sent": "It's called Gentex and the notion the idea is pretty simple.",
                    "label": 0
                },
                {
                    "sent": "When you have a category you have this broad notion of a topic that can be anything you have.",
                    "label": 0
                },
                {
                    "sent": "The label camcorder and it can be people competent with camcorders and can be actual camcorders.",
                    "label": 0
                },
                {
                    "sent": "Can be invoices about camcorders or it can be the broad topic.",
                    "label": 1
                },
                {
                    "sent": "Everything that is somehow related to camcorders.",
                    "label": 0
                },
                {
                    "sent": "And what you do is you derive two classes from that informal.",
                    "label": 1
                },
                {
                    "sent": "Yeah, category.",
                    "label": 0
                },
                {
                    "sent": "One that has a broader taxonomic meaning.",
                    "label": 1
                },
                {
                    "sent": "It can be a simple topic, but it can also be narrowed down formally.",
                    "label": 0
                },
                {
                    "sent": "What you do is you build.",
                    "label": 0
                },
                {
                    "sent": "You define a master concept that is, for example product or people or topic, and you build the intersection between that category and that master concept and then you have a more specific type.",
                    "label": 0
                },
                {
                    "sent": "When you for example want to say something is a product, you define a second master concept and you.",
                    "label": 0
                },
                {
                    "sent": "Use the intersection of these two, so again, this is pretty old stuff in 2014, but the nice thing is.",
                    "label": 0
                },
                {
                    "sent": "First of all, you can control the shape of the resulting classes.",
                    "label": 0
                },
                {
                    "sent": "So for example you can take anyschema.org class.",
                    "label": 0
                },
                {
                    "sent": "People, organizations, whatever, and say well, this is the top.",
                    "label": 0
                },
                {
                    "sent": "This is the master class.",
                    "label": 0
                },
                {
                    "sent": "The master concept for the resulting classes and then in the end you get a taxonomy of.",
                    "label": 0
                },
                {
                    "sent": "Only of, for example, company types of products or something else.",
                    "label": 0
                },
                {
                    "sent": "The next step is that if you have a hierarchy, you arrange the broader topics in a subsumption hierarchy based on the original hierarchy.",
                    "label": 1
                },
                {
                    "sent": "We have to test whether that is valid.",
                    "label": 0
                },
                {
                    "sent": "That's the second step, and you make all the specific types of subclass of the respective broad topic.",
                    "label": 0
                },
                {
                    "sent": "So, for example, you take the category labeled camcorder.",
                    "label": 0
                },
                {
                    "sent": "You create one class camcorder as a topic and one class camcorder as a product.",
                    "label": 0
                },
                {
                    "sent": "And you say a camcorder as a product is a subclass of the broader notion of everything that is related to the topic of camcorders.",
                    "label": 0
                },
                {
                    "sent": "And then something that is not really fully realized is the core idea.",
                    "label": 0
                },
                {
                    "sent": "One of the core ideas was that you can use statistic that you can use random samples to validate whether your conceptual choices are sufficiently.",
                    "label": 0
                },
                {
                    "sent": "Correct for the whole big ontology.",
                    "label": 0
                },
                {
                    "sent": "So for example, you draw a random sample of the resulting leaf nodes.",
                    "label": 0
                },
                {
                    "sent": "And you manually check whether there the subsumption hierarchy is valid, or whether there's an inconsistency an if you don't find a contradiction in your random sample, you can compute the confidence that your whole ontology is big.",
                    "label": 0
                },
                {
                    "sent": "It's not perfect, but it's a cheap way because with comparatively small samples you can get far.",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So this is how it would look when applied to the Google product taxonomy.",
                    "label": 1
                },
                {
                    "sent": "You create a topic class and you create for cameras and optics.",
                    "label": 1
                },
                {
                    "sent": "And for example, disposable cameras as a topic is clearly a subclass of this, and you generate the more specific ones.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So what is the advantage of this approach?",
                    "label": 0
                },
                {
                    "sent": "The result isn't is a valid old one, or all two DL ontology.",
                    "label": 0
                },
                {
                    "sent": "Well, actually when you import good relations it is no longer a valid O2 DL ontology becausw in all two good relations is unfortunately all full.",
                    "label": 0
                },
                {
                    "sent": "You can do that fully mechanical once you have made a few structural choices.",
                    "label": 0
                },
                {
                    "sent": "And you can use all RF subclass for operating over the hierarchy, so you don't need any proprietary inferencing which you would need if you define.",
                    "label": 0
                },
                {
                    "sent": "Any object in any proprietary properties for linking the respective elements.",
                    "label": 0
                },
                {
                    "sent": "You can control the meaning of the derived classes.",
                    "label": 1
                },
                {
                    "sent": "And you guys said you can use random samples to control the reliability now though.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This one ontology design pattern that is related using the is classified by.",
                    "label": 0
                },
                {
                    "sent": "Or it's called is classified by where you say when you make an instance from each category and link entities to link entities to that instance.",
                    "label": 0
                },
                {
                    "sent": "Oh, this is.",
                    "label": 0
                },
                {
                    "sent": "Possible the problem with that is that you have no direct way of representing the hierarchy in the classification.",
                    "label": 0
                },
                {
                    "sent": "You can do so with the transitive property, but then it would require.",
                    "label": 0
                },
                {
                    "sent": "Non standard reasoning, you wouldn't automatically find.",
                    "label": 0
                },
                {
                    "sent": "Elements that are classified by a sub category.",
                    "label": 0
                },
                {
                    "sent": "You cannot directly use the categories as classes because they are instances.",
                    "label": 0
                },
                {
                    "sent": "So when you want to mix them with classes from other product ontologies, that wouldn't work directly and you cannot use all reasoning for the transitivity of RDF subclass.",
                    "label": 0
                },
                {
                    "sent": "You can of course use sparkle, construct rules or proprietary reasoning, but.",
                    "label": 0
                },
                {
                    "sent": "In general, the querying the data gets more complicated and requires more advanced reasoning.",
                    "label": 0
                },
                {
                    "sent": "Um now?",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Our contribution mainly extending Gentex and we in the in use track quite clearly here to deriving good relations, compliant product ontologies.",
                    "label": 1
                },
                {
                    "sent": "So taking into account all the constraints that are resulting from the good relations metamodel, we added support for properties and enumerations.",
                    "label": 1
                },
                {
                    "sent": "And linked open data deployement of the resulting ontology.",
                    "label": 0
                },
                {
                    "sent": "So in the script actually returns a directory with all the files that you push to a server of your choice you uploaded via FTP SFTP and you're done and we converted 13 standards into respective good relations extensions.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So the tool as a as Python Python command line tool is available here freely.",
                    "label": 0
                },
                {
                    "sent": "Defines Canonical your eyes for all the 13 standards.",
                    "label": 0
                },
                {
                    "sent": "Tries to preserve the taxonomic structure.",
                    "label": 0
                },
                {
                    "sent": "IS compliant with goodrelationsandschema.org.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And that's a basic tool structure, so we have a core transformation component.",
                    "label": 0
                },
                {
                    "sent": "You have a very lightweight custom puzzle, so when you want to translate a proprietary hierarchy or catalog group structure, you just have to add a few lines of Python code.",
                    "label": 0
                },
                {
                    "sent": "One thing that is also.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "An extension over previous workers.",
                    "label": 0
                },
                {
                    "sent": "It's not only suited for product categorisation standards or something published openly, but it can also be used to turn any kind of proprietary catalog group structures, like the categories in the shop into a valid all ontology.",
                    "label": 0
                },
                {
                    "sent": "It creates HTML documentations and all that implementation stuff.",
                    "label": 0
                },
                {
                    "sent": "So this is basically what we already had.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "One thing that is a challenge when you derive respective ontologies is that the good relations meta model has supports 3 core distinctions for product features.",
                    "label": 0
                },
                {
                    "sent": "If qualitative properties that link to a value type and a list of any rated values quantitative properties that represent some kind of quantity and data type properties that are used directly with literals, Now it's not as trivial as it may sound to make that distinction because you cannot directly.",
                    "label": 0
                },
                {
                    "sent": "Use the data type 'cause a sequence of numbers, for example, could be a code or a quantity.",
                    "label": 0
                },
                {
                    "sent": "So in the code that is represented by a number should not be made a quantitative property in the good relations meta model.",
                    "label": 0
                },
                {
                    "sent": "So the tool contains several rules and heuristics to try to solve that automatically.",
                    "label": 1
                },
                {
                    "sent": "You can configure it according to for example the size of the classification standard and then for example.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Size or hash based your eyes.",
                    "label": 0
                },
                {
                    "sent": "That's a simple choice in the configuration file.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And here's a list of the resulting ontologies, some of them we were able to put freely on the web and what we.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And says that it drastically reduced the effort for generating the respective all ontologies.",
                    "label": 0
                },
                {
                    "sent": "We also did this for a few proprietary category systems, so for example the Google product taxonomy.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "And the link data deployement shown in here we chose to deliver the ontologies in small chunks.",
                    "label": 0
                },
                {
                    "sent": "So you have basically one already based serialization of the respective class and property definitions so that you have comparatively small elements.",
                    "label": 0
                },
                {
                    "sent": "This is a lesson lesson learned from the earlier transformations where we built single files with 30 or 60,000 classes.",
                    "label": 0
                },
                {
                    "sent": "And again this is.",
                    "label": 0
                },
                {
                    "sent": "All done pretty much automatically.",
                    "label": 0
                },
                {
                    "sent": "We use ginger, the ginger templating language to generate the respective code.",
                    "label": 0
                },
                {
                    "sent": "I think we're also using Ginger by the way, to generate the RDF and Turtle variants, because this is a way more performance than using RDF libraries, at least in this particular case, because we don't have to pass the whole.",
                    "label": 0
                },
                {
                    "sent": "Standard in one turn.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "You can use the hierarchy to navigate.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This is what I tried to explain earlier when you use.",
                    "label": 0
                },
                {
                    "sent": "Narrow transitive, narrow, narrow transitive.",
                    "label": 0
                },
                {
                    "sent": "Or whether it's already have a subclass of you draw samples of the leave objects, and if you find if you don't find any violation then you can assume with a certain confidence that your conceptual choices hold for the whole vocabulary and you can calibrate that according to your.",
                    "label": 0
                },
                {
                    "sent": "To your budget, to the cost of failure, the benefit of having a taxonomy at all in here you see a contradiction.",
                    "label": 0
                },
                {
                    "sent": "So a swap drive.",
                    "label": 0
                },
                {
                    "sent": "Um is or probably yeah, swap drive is not a computer and not video game.",
                    "label": 0
                },
                {
                    "sent": "OK, so this is.",
                    "label": 0
                },
                {
                    "sent": "That yes, there's one.",
                    "label": 0
                },
                {
                    "sent": "Contradiction you can of course then assess this for the whole taxonomy you can.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Is that in microdata already FA any any syntax for indicating for giving more precise type information?",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Well, yeah, and that's that was the contribution.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Building a tool that you can use for generating such valid old ontologies automatically and in a deployement ready format so the idea is really that you can generate locally respective all ontologies and the only thing that you have to do is publish them on a web server.",
                    "label": 0
                },
                {
                    "sent": "OK, we all live.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "From taxpayers money and gratefully acknowledge their support.",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So if you have questions, I'd be happy to try to answer them.",
                    "label": 0
                },
                {
                    "sent": "That would be.",
                    "label": 0
                },
                {
                    "sent": "My part so far, thanks.",
                    "label": 0
                }
            ]
        }
    }
}