{
    "id": "vlt44xlfiegngvyzka3r5uc7bah2xcko",
    "title": "Public transport service design requirements for the changing face of the South African customer",
    "info": {
        "author": [
            "Mathetha Mokonyama, Council for Scientific and Industrial Research - CSIR"
        ],
        "published": "May 5, 2008",
        "recorded": "April 2008",
        "category": [
            "Top->Business->Transportation and Logistics->Technology"
        ]
    },
    "url": "http://videolectures.net/tra08_mokonyama_rtrsa/",
    "segmentation": [
        [
            "Thank you chairman.",
            "Uh, good morning ladies and gentlemen.",
            "My talk is on like the chairman said, the road, but mainly surface transport research in South Africa and will highlight in this presentation the opportunities and challenges that the relationship between South Africa and Europe presents.",
            "Um?",
            "They the essence of the presentation.",
            "It is that, you know, as researchers we we should have a global view.",
            "We should be used as resources or tools in the global context, and we're using this case of South Africa to show how this sort of relationships can work and have worked."
        ],
        [
            "In the past, I'll briefly.",
            "I'll briefly just give facts and figures quickly for for contextual purposes.",
            "The situation in South Africa and then change on opportunities for collaboration.",
            "Tangible opportunities that can be realized.",
            "And then share with you some of the success stories that we've had between South Africa and Europe.",
            "But then also.",
            "Attach on the challenges that we need to tackle for the way forward and the overall message in this presentation.",
            "Is that South Africa has a dynamic and diverse surface transport research and development culture, and there are rich opportunities for mutually beneficial South African and EU Transport Corporation, and we're talking about South Africa as a case study in this case."
        ],
        [
            "It doesn't have to fix and feed us not to go into detail.",
            "With highlighting, the population is about 47 million.",
            "60% about ebonised.",
            "The rate of urbanization is actually on the increase.",
            "33% live in the big cities like Johannesburg, Cape Town, Durban and so forth.",
            "City of swanee.",
            "The rate of growth economic growth has been around 5% more less population density you're talking.",
            "It's a very low density.",
            "5940 people per square kilometer in the cities is a slight slightly higher, almost double I think.",
            "Then that, and in terms of Rd transport network about over 750 kilometers, 1000 kilometers of Rd Network.",
            "Percentage of that about 10,000 kilometers is national.",
            "You know, freeway, network, roads.",
            "Notable is the backlog that you still have there the.",
            "43%.",
            "That is gravelled in the rural areas mainly.",
            "And then the cities and local authorities would be would make part of that, Jennifer."
        ],
        [
            "Percent.",
            "In terms of public transport services, just indications of the model splits.",
            "Motorized public transport enjoys about 40%, which is relatively high in international standards.",
            "Private transport 32% working is quite significant.",
            "Over 23% for work trips alone that is.",
            "The mode of transport heavy rails.",
            "As you see there.",
            "Minibus taxis and buses, actually the minibus Texas.",
            "We've seen a trend of minibus taxis taking over the large portions of the market travel market because of their flexibility.",
            "Dim and responsive nature.",
            "They've been quite a good success story and in South Africa and many parts of Southern Africa.",
            "75% of the households have no car and 80% of the eligible people do not have a drivers license and that is why the Motor Manufacturers are now targeting the sort of markets.",
            "And now we're realizing that.",
            "You know the says that they knew just they knew not the used vehicles.",
            "35 units are being sold every month.",
            "The the trend is stabilizing a little bit these days, but it's been at that level quite high.",
            "But then also it's worth mentioning that passenger transport research is really at the heart of the transport agenda."
        ],
        [
            "Supported throughout the sector, other fax to mention rail transport network close to 22,000 kilometers of rail network.",
            "Narrow gauge.",
            "20% of the freight travels on the network, the commuter lines.",
            "That's about 10% of the June 2000 that you see there.",
            "Vehicle population was talking about 150 people.",
            "I'm only 55th 150 cars per thousand population, 10 international airports with over 200,000.",
            "Aircraft landings per annum.",
            "Recent figures and commercial app seaports.",
            "We've seen some of the pictures in the in the very first presentation and the Devonport, which is to the East of the country, is the busiest."
        ],
        [
            "Something worth mentioning is the hosting of the 2010 Soccer World Cup that the country is preparing for and for transport alone.",
            "The country or the the national government is investing over 300 million euros equivalent.",
            "Actually direct translation.",
            "To leverage other funds for capital expenditure, ITSI infrastructure for public transport and for planning purposes."
        ],
        [
            "In terms of governance, there are many players in in the field, at national, provincial and local spheres of government, and those are the agencies and government departments that typically play a role in the governance of."
        ],
        [
            "Of transport.",
            "In terms of research institutions, there are 17 universities, 6 universities of technology.",
            "And for public, so for for transport research the VR research councils like the Council for Scientific and Industrial Research.",
            "CSIR is the biggest Research Council in the country.",
            "That is good dedicated units that do transport research.",
            "South African National Energy Research Institute also does energy research.",
            "Private sector research and the target for R&D spending is 1% of the GDP.",
            "Another moment distance is about 0.9 of the Jeep."
        ],
        [
            "PM opportunities for collaboration.",
            "What we did here is we spoke to a number of researchers around the country and ask them to tell us what they are there currently doing.",
            "And what they would like to do together with other people outside the country for collaborative purposes?",
            "So what you'll see next is the responses that we've got.",
            "We don't claim to be representing each and every institution of each and every view, but it's an indication of the response that we received from our research community.",
            "Anne."
        ],
        [
            "The responses are classified in terms of the five groupings usually used in the framework programmes.",
            "Greening of transport, intermodal transport, urban mobility, safety and security and calm."
        ],
        [
            "Relativeness under greeting of transport.",
            "Some of the notable current activities taking place.",
            "Um?",
            "Air quality monitoring stations.",
            "Network implementation.",
            "Of those, the second one is a little bit controversial.",
            "The screen cleaning of transport.",
            "1st in both ways, testing is emerging.",
            "Aren't the opportunities that have been identified.",
            "I don't less skilled public transport fleets recapitalization.",
            "The vehicle fleet technologies that support sustainable transport services.",
            "Also note worth noting is that South Africa is one of the largest platinum producers, and for the production of fuel cells Subs is a place to tap into.",
            "And it provides a good.",
            "Research sites for a number of these areas in the Greening of transport."
        ],
        [
            "Intermodal transport.",
            "Notable activities.",
            "The rail infrastructure is being resuscitated.",
            "And the idea is to increase the mode share of.",
            "Rail in terms of long haul freight services.",
            "And the integration of demand responsive public transport services with the shield modes.",
            "This other current activities opportunities contract ING regimes.",
            "Innovative public transport contacting regimes that also support the emerging.",
            "SMS to participate in the system.",
            "Especially restructuring to combat inefficient the playing legacy of apartheid."
        ],
        [
            "Urban mobility, notable activities.",
            "Research in the location of low-cost housing nearer areas of opportunity in the country.",
            "A number of cities are investing in what you'd call.",
            "Category B most in between the high performance more than the low performance, most likely BRT in less cities and the previous speaker spoke about this.",
            "Are in the opportunities using ICT like intelligent transport systems for better targeting transport subsidies an social grants this.",
            "I personally think is a very good platform to see the application of IT as technologies in poverty alleviation.",
            "And inclusive Rd architecture to reform our Rd designs to make them more inclusive to all sorts of users and not just."
        ],
        [
            "Vehicles safety and security.",
            "Some people are working on the on radiation technologies to scan passengers for prohibited substances.",
            "Harmonisation of static standards.",
            "Opportunities there identified safety for non motorized transport networks.",
            "Security of global container supply chains.",
            "And rail maintenance technologies to support the rail."
        ],
        [
            "Rail initiatives under competitiveness.",
            "Self regulation in the heavy vehicle transport.",
            "One of my colleagues made a presentation yesterday about this specific topic.",
            "Accelerated pavement testing is happening monitoring of state of logistics in South Africa.",
            "The transport costs input into the logistics.",
            "Some of the items, the opportunities, design of tourism related networks for Accessibility.",
            "Data management technologies.",
            "Construction materials and methods.",
            "We will need to come up with better ways of of constructing roads because we're running out of materials in many parts.",
            "In many ways, performance based on that for heavy vehicles is another thing that has been identified."
        ],
        [
            "South Africa has signed a SNC Corporation agreement.",
            "In 1977 last year we celebrated the 10th anniversary of this partnership and then that there's realized more than 200 participation of South African institutions in FP42FT6 in across different fields.",
            "Transport has been lagging a little bit behind.",
            "And I'll talk a little bit about it later.",
            "And worth noting is also that South Africa is regarded in the Commission as one of the most active third country partners, and in terms of AP status, we are in I."
        ],
        [
            "CPC commitment in terms of the the the infrastructure that we have to support our researchers to participate fully in formal programs.",
            "There's an SSZ program.",
            "Which is an FP6 project approved in FP7 to support our researchers to disseminate information to give them all the support that we can possibly give them.",
            "This is network of contact points similar to what you have in a number of European countries dedicated to each thematic priority, and we've got a database in transport alone, about 500 people over 500 people who are interested.",
            "We disseminate information to.",
            "And the Department of Science and Technology provides seed funding for our researchers to come participate, draw proposals to participate.",
            "And and in terms of core funding, is some of the collaboration projects Department sensor technology meets our researchers halfway for."
        ],
        [
            "So finding purposes other platforms they JST CC is where the South Africa and their opinion miss regularly to monitor the SMT relationship and to a meeting or at the beginning of May next month.",
            "This also see now a focus of the senior science and Technology representative in Brussels, who regularly gives us information about what's happening in the EU and also updates the Commission on what is happening in South Africa.",
            "There's also potential participated purpose.",
            "We can potentially participate in the new European Transport NCP Alliance doesn't uniformed, there's a good platform and then something very important is the molecule reactions want to see more and more of our researchers participating our institutions participating in the molecule reactions within the transport theme."
        ],
        [
            "Um?",
            "Some of the success stories.",
            "OK, just one."
        ],
        [
            "It's.",
            "Three projects Simba Urban Track best of South Africa, has participated."
        ],
        [
            "And in those projects.",
            "And there was a joint statement on R&D.",
            "Corporation assigned last year and it identified specific areas for collaboration in the future, and it will be updated from time to time.",
            "It has identified the area of Information Systems Rd infrastructure in automotive research as areas to cooperate in initial."
        ],
        [
            "Some of our experts have been invited to actors project proposal evaluators.",
            "And be invited to participate in the less of CTRA they've been seekers in.",
            "The current."
        ],
        [
            "What program?"
        ],
        [
            "Challenges.",
            "These are challenges we need to invest more and more in R&D because transport is lagging behind.",
            "And currently there's a wide gap between first and second, so-called second economy, widely because of the widening gap because of the wealthy and the poor.",
            "I need."
        ],
        [
            "To be addressed.",
            "Collaborative challenges some of the institutions in the country unable to participate because of the core funding requirements below for some intellectual property, intellectual properties often seen as a thorny issue.",
            "And again, I think we need to also acknowledge that technology gaps between South Africa and EU should not always be translated to technology push.",
            "We need to find sustainable solutions that that."
        ],
        [
            "That do work and then this is where you can find a lot more information about this kind of relationships with heads.",
            "Thank you."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Thank you chairman.",
                    "label": 0
                },
                {
                    "sent": "Uh, good morning ladies and gentlemen.",
                    "label": 0
                },
                {
                    "sent": "My talk is on like the chairman said, the road, but mainly surface transport research in South Africa and will highlight in this presentation the opportunities and challenges that the relationship between South Africa and Europe presents.",
                    "label": 1
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "They the essence of the presentation.",
                    "label": 0
                },
                {
                    "sent": "It is that, you know, as researchers we we should have a global view.",
                    "label": 0
                },
                {
                    "sent": "We should be used as resources or tools in the global context, and we're using this case of South Africa to show how this sort of relationships can work and have worked.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "In the past, I'll briefly.",
                    "label": 0
                },
                {
                    "sent": "I'll briefly just give facts and figures quickly for for contextual purposes.",
                    "label": 0
                },
                {
                    "sent": "The situation in South Africa and then change on opportunities for collaboration.",
                    "label": 0
                },
                {
                    "sent": "Tangible opportunities that can be realized.",
                    "label": 0
                },
                {
                    "sent": "And then share with you some of the success stories that we've had between South Africa and Europe.",
                    "label": 0
                },
                {
                    "sent": "But then also.",
                    "label": 0
                },
                {
                    "sent": "Attach on the challenges that we need to tackle for the way forward and the overall message in this presentation.",
                    "label": 0
                },
                {
                    "sent": "Is that South Africa has a dynamic and diverse surface transport research and development culture, and there are rich opportunities for mutually beneficial South African and EU Transport Corporation, and we're talking about South Africa as a case study in this case.",
                    "label": 1
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": []
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "It doesn't have to fix and feed us not to go into detail.",
                    "label": 0
                },
                {
                    "sent": "With highlighting, the population is about 47 million.",
                    "label": 1
                },
                {
                    "sent": "60% about ebonised.",
                    "label": 0
                },
                {
                    "sent": "The rate of urbanization is actually on the increase.",
                    "label": 0
                },
                {
                    "sent": "33% live in the big cities like Johannesburg, Cape Town, Durban and so forth.",
                    "label": 0
                },
                {
                    "sent": "City of swanee.",
                    "label": 1
                },
                {
                    "sent": "The rate of growth economic growth has been around 5% more less population density you're talking.",
                    "label": 0
                },
                {
                    "sent": "It's a very low density.",
                    "label": 1
                },
                {
                    "sent": "5940 people per square kilometer in the cities is a slight slightly higher, almost double I think.",
                    "label": 0
                },
                {
                    "sent": "Then that, and in terms of Rd transport network about over 750 kilometers, 1000 kilometers of Rd Network.",
                    "label": 0
                },
                {
                    "sent": "Percentage of that about 10,000 kilometers is national.",
                    "label": 0
                },
                {
                    "sent": "You know, freeway, network, roads.",
                    "label": 0
                },
                {
                    "sent": "Notable is the backlog that you still have there the.",
                    "label": 0
                },
                {
                    "sent": "43%.",
                    "label": 0
                },
                {
                    "sent": "That is gravelled in the rural areas mainly.",
                    "label": 0
                },
                {
                    "sent": "And then the cities and local authorities would be would make part of that, Jennifer.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Percent.",
                    "label": 0
                },
                {
                    "sent": "In terms of public transport services, just indications of the model splits.",
                    "label": 0
                },
                {
                    "sent": "Motorized public transport enjoys about 40%, which is relatively high in international standards.",
                    "label": 0
                },
                {
                    "sent": "Private transport 32% working is quite significant.",
                    "label": 1
                },
                {
                    "sent": "Over 23% for work trips alone that is.",
                    "label": 0
                },
                {
                    "sent": "The mode of transport heavy rails.",
                    "label": 0
                },
                {
                    "sent": "As you see there.",
                    "label": 0
                },
                {
                    "sent": "Minibus taxis and buses, actually the minibus Texas.",
                    "label": 0
                },
                {
                    "sent": "We've seen a trend of minibus taxis taking over the large portions of the market travel market because of their flexibility.",
                    "label": 0
                },
                {
                    "sent": "Dim and responsive nature.",
                    "label": 0
                },
                {
                    "sent": "They've been quite a good success story and in South Africa and many parts of Southern Africa.",
                    "label": 0
                },
                {
                    "sent": "75% of the households have no car and 80% of the eligible people do not have a drivers license and that is why the Motor Manufacturers are now targeting the sort of markets.",
                    "label": 1
                },
                {
                    "sent": "And now we're realizing that.",
                    "label": 0
                },
                {
                    "sent": "You know the says that they knew just they knew not the used vehicles.",
                    "label": 0
                },
                {
                    "sent": "35 units are being sold every month.",
                    "label": 0
                },
                {
                    "sent": "The the trend is stabilizing a little bit these days, but it's been at that level quite high.",
                    "label": 1
                },
                {
                    "sent": "But then also it's worth mentioning that passenger transport research is really at the heart of the transport agenda.",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Supported throughout the sector, other fax to mention rail transport network close to 22,000 kilometers of rail network.",
                    "label": 1
                },
                {
                    "sent": "Narrow gauge.",
                    "label": 0
                },
                {
                    "sent": "20% of the freight travels on the network, the commuter lines.",
                    "label": 0
                },
                {
                    "sent": "That's about 10% of the June 2000 that you see there.",
                    "label": 1
                },
                {
                    "sent": "Vehicle population was talking about 150 people.",
                    "label": 1
                },
                {
                    "sent": "I'm only 55th 150 cars per thousand population, 10 international airports with over 200,000.",
                    "label": 0
                },
                {
                    "sent": "Aircraft landings per annum.",
                    "label": 0
                },
                {
                    "sent": "Recent figures and commercial app seaports.",
                    "label": 0
                },
                {
                    "sent": "We've seen some of the pictures in the in the very first presentation and the Devonport, which is to the East of the country, is the busiest.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Something worth mentioning is the hosting of the 2010 Soccer World Cup that the country is preparing for and for transport alone.",
                    "label": 0
                },
                {
                    "sent": "The country or the the national government is investing over 300 million euros equivalent.",
                    "label": 0
                },
                {
                    "sent": "Actually direct translation.",
                    "label": 0
                },
                {
                    "sent": "To leverage other funds for capital expenditure, ITSI infrastructure for public transport and for planning purposes.",
                    "label": 1
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "In terms of governance, there are many players in in the field, at national, provincial and local spheres of government, and those are the agencies and government departments that typically play a role in the governance of.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Of transport.",
                    "label": 0
                },
                {
                    "sent": "In terms of research institutions, there are 17 universities, 6 universities of technology.",
                    "label": 0
                },
                {
                    "sent": "And for public, so for for transport research the VR research councils like the Council for Scientific and Industrial Research.",
                    "label": 1
                },
                {
                    "sent": "CSIR is the biggest Research Council in the country.",
                    "label": 0
                },
                {
                    "sent": "That is good dedicated units that do transport research.",
                    "label": 0
                },
                {
                    "sent": "South African National Energy Research Institute also does energy research.",
                    "label": 0
                },
                {
                    "sent": "Private sector research and the target for R&D spending is 1% of the GDP.",
                    "label": 0
                },
                {
                    "sent": "Another moment distance is about 0.9 of the Jeep.",
                    "label": 0
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "PM opportunities for collaboration.",
                    "label": 0
                },
                {
                    "sent": "What we did here is we spoke to a number of researchers around the country and ask them to tell us what they are there currently doing.",
                    "label": 0
                },
                {
                    "sent": "And what they would like to do together with other people outside the country for collaborative purposes?",
                    "label": 0
                },
                {
                    "sent": "So what you'll see next is the responses that we've got.",
                    "label": 0
                },
                {
                    "sent": "We don't claim to be representing each and every institution of each and every view, but it's an indication of the response that we received from our research community.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "The responses are classified in terms of the five groupings usually used in the framework programmes.",
                    "label": 0
                },
                {
                    "sent": "Greening of transport, intermodal transport, urban mobility, safety and security and calm.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Relativeness under greeting of transport.",
                    "label": 0
                },
                {
                    "sent": "Some of the notable current activities taking place.",
                    "label": 0
                },
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Air quality monitoring stations.",
                    "label": 0
                },
                {
                    "sent": "Network implementation.",
                    "label": 0
                },
                {
                    "sent": "Of those, the second one is a little bit controversial.",
                    "label": 0
                },
                {
                    "sent": "The screen cleaning of transport.",
                    "label": 0
                },
                {
                    "sent": "1st in both ways, testing is emerging.",
                    "label": 0
                },
                {
                    "sent": "Aren't the opportunities that have been identified.",
                    "label": 0
                },
                {
                    "sent": "I don't less skilled public transport fleets recapitalization.",
                    "label": 0
                },
                {
                    "sent": "The vehicle fleet technologies that support sustainable transport services.",
                    "label": 0
                },
                {
                    "sent": "Also note worth noting is that South Africa is one of the largest platinum producers, and for the production of fuel cells Subs is a place to tap into.",
                    "label": 1
                },
                {
                    "sent": "And it provides a good.",
                    "label": 0
                },
                {
                    "sent": "Research sites for a number of these areas in the Greening of transport.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Intermodal transport.",
                    "label": 0
                },
                {
                    "sent": "Notable activities.",
                    "label": 0
                },
                {
                    "sent": "The rail infrastructure is being resuscitated.",
                    "label": 1
                },
                {
                    "sent": "And the idea is to increase the mode share of.",
                    "label": 1
                },
                {
                    "sent": "Rail in terms of long haul freight services.",
                    "label": 1
                },
                {
                    "sent": "And the integration of demand responsive public transport services with the shield modes.",
                    "label": 1
                },
                {
                    "sent": "This other current activities opportunities contract ING regimes.",
                    "label": 0
                },
                {
                    "sent": "Innovative public transport contacting regimes that also support the emerging.",
                    "label": 0
                },
                {
                    "sent": "SMS to participate in the system.",
                    "label": 0
                },
                {
                    "sent": "Especially restructuring to combat inefficient the playing legacy of apartheid.",
                    "label": 1
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Urban mobility, notable activities.",
                    "label": 0
                },
                {
                    "sent": "Research in the location of low-cost housing nearer areas of opportunity in the country.",
                    "label": 1
                },
                {
                    "sent": "A number of cities are investing in what you'd call.",
                    "label": 0
                },
                {
                    "sent": "Category B most in between the high performance more than the low performance, most likely BRT in less cities and the previous speaker spoke about this.",
                    "label": 0
                },
                {
                    "sent": "Are in the opportunities using ICT like intelligent transport systems for better targeting transport subsidies an social grants this.",
                    "label": 0
                },
                {
                    "sent": "I personally think is a very good platform to see the application of IT as technologies in poverty alleviation.",
                    "label": 0
                },
                {
                    "sent": "And inclusive Rd architecture to reform our Rd designs to make them more inclusive to all sorts of users and not just.",
                    "label": 0
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Vehicles safety and security.",
                    "label": 0
                },
                {
                    "sent": "Some people are working on the on radiation technologies to scan passengers for prohibited substances.",
                    "label": 1
                },
                {
                    "sent": "Harmonisation of static standards.",
                    "label": 0
                },
                {
                    "sent": "Opportunities there identified safety for non motorized transport networks.",
                    "label": 1
                },
                {
                    "sent": "Security of global container supply chains.",
                    "label": 1
                },
                {
                    "sent": "And rail maintenance technologies to support the rail.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Rail initiatives under competitiveness.",
                    "label": 0
                },
                {
                    "sent": "Self regulation in the heavy vehicle transport.",
                    "label": 1
                },
                {
                    "sent": "One of my colleagues made a presentation yesterday about this specific topic.",
                    "label": 0
                },
                {
                    "sent": "Accelerated pavement testing is happening monitoring of state of logistics in South Africa.",
                    "label": 1
                },
                {
                    "sent": "The transport costs input into the logistics.",
                    "label": 1
                },
                {
                    "sent": "Some of the items, the opportunities, design of tourism related networks for Accessibility.",
                    "label": 0
                },
                {
                    "sent": "Data management technologies.",
                    "label": 1
                },
                {
                    "sent": "Construction materials and methods.",
                    "label": 0
                },
                {
                    "sent": "We will need to come up with better ways of of constructing roads because we're running out of materials in many parts.",
                    "label": 0
                },
                {
                    "sent": "In many ways, performance based on that for heavy vehicles is another thing that has been identified.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "South Africa has signed a SNC Corporation agreement.",
                    "label": 0
                },
                {
                    "sent": "In 1977 last year we celebrated the 10th anniversary of this partnership and then that there's realized more than 200 participation of South African institutions in FP42FT6 in across different fields.",
                    "label": 0
                },
                {
                    "sent": "Transport has been lagging a little bit behind.",
                    "label": 0
                },
                {
                    "sent": "And I'll talk a little bit about it later.",
                    "label": 0
                },
                {
                    "sent": "And worth noting is also that South Africa is regarded in the Commission as one of the most active third country partners, and in terms of AP status, we are in I.",
                    "label": 1
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "CPC commitment in terms of the the the infrastructure that we have to support our researchers to participate fully in formal programs.",
                    "label": 0
                },
                {
                    "sent": "There's an SSZ program.",
                    "label": 0
                },
                {
                    "sent": "Which is an FP6 project approved in FP7 to support our researchers to disseminate information to give them all the support that we can possibly give them.",
                    "label": 0
                },
                {
                    "sent": "This is network of contact points similar to what you have in a number of European countries dedicated to each thematic priority, and we've got a database in transport alone, about 500 people over 500 people who are interested.",
                    "label": 0
                },
                {
                    "sent": "We disseminate information to.",
                    "label": 0
                },
                {
                    "sent": "And the Department of Science and Technology provides seed funding for our researchers to come participate, draw proposals to participate.",
                    "label": 1
                },
                {
                    "sent": "And and in terms of core funding, is some of the collaboration projects Department sensor technology meets our researchers halfway for.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So finding purposes other platforms they JST CC is where the South Africa and their opinion miss regularly to monitor the SMT relationship and to a meeting or at the beginning of May next month.",
                    "label": 0
                },
                {
                    "sent": "This also see now a focus of the senior science and Technology representative in Brussels, who regularly gives us information about what's happening in the EU and also updates the Commission on what is happening in South Africa.",
                    "label": 1
                },
                {
                    "sent": "There's also potential participated purpose.",
                    "label": 0
                },
                {
                    "sent": "We can potentially participate in the new European Transport NCP Alliance doesn't uniformed, there's a good platform and then something very important is the molecule reactions want to see more and more of our researchers participating our institutions participating in the molecule reactions within the transport theme.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Um?",
                    "label": 0
                },
                {
                    "sent": "Some of the success stories.",
                    "label": 0
                },
                {
                    "sent": "OK, just one.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "It's.",
                    "label": 0
                },
                {
                    "sent": "Three projects Simba Urban Track best of South Africa, has participated.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "And in those projects.",
                    "label": 0
                },
                {
                    "sent": "And there was a joint statement on R&D.",
                    "label": 0
                },
                {
                    "sent": "Corporation assigned last year and it identified specific areas for collaboration in the future, and it will be updated from time to time.",
                    "label": 0
                },
                {
                    "sent": "It has identified the area of Information Systems Rd infrastructure in automotive research as areas to cooperate in initial.",
                    "label": 1
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Some of our experts have been invited to actors project proposal evaluators.",
                    "label": 1
                },
                {
                    "sent": "And be invited to participate in the less of CTRA they've been seekers in.",
                    "label": 0
                },
                {
                    "sent": "The current.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What program?",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Challenges.",
                    "label": 0
                },
                {
                    "sent": "These are challenges we need to invest more and more in R&D because transport is lagging behind.",
                    "label": 0
                },
                {
                    "sent": "And currently there's a wide gap between first and second, so-called second economy, widely because of the widening gap because of the wealthy and the poor.",
                    "label": 1
                },
                {
                    "sent": "I need.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "To be addressed.",
                    "label": 0
                },
                {
                    "sent": "Collaborative challenges some of the institutions in the country unable to participate because of the core funding requirements below for some intellectual property, intellectual properties often seen as a thorny issue.",
                    "label": 1
                },
                {
                    "sent": "And again, I think we need to also acknowledge that technology gaps between South Africa and EU should not always be translated to technology push.",
                    "label": 1
                },
                {
                    "sent": "We need to find sustainable solutions that that.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "That do work and then this is where you can find a lot more information about this kind of relationships with heads.",
                    "label": 0
                },
                {
                    "sent": "Thank you.",
                    "label": 0
                }
            ]
        }
    }
}