{
    "id": "vlugnh5ido73keehkdm7pf6wquwmufin",
    "title": "Unsupervised Detection and Segmentation of Identical Objects",
    "info": {
        "author": [
            "Minsu Cho, Computer Vision Lab, Seoul National University"
        ],
        "published": "July 19, 2010",
        "recorded": "June 2010",
        "category": [
            "Top->Computer Science->Computer Vision"
        ]
    },
    "url": "http://videolectures.net/cvpr2010_cho_udas/",
    "segmentation": [
        [
            "Good morning everyone.",
            "My name is Mr Joe from Seoul, National University of Korea.",
            "I will talk about unsupervised detection and segmentation of identical objects.",
            "This is joint work with my colleague, Young Mission and otherwise you're gonna movie.",
            "Now let me."
        ],
        [
            "Let me start my talk with motivation of our work.",
            "It is a question about this.",
            "How to discover matching objects from a single or multiple images without any supervision or specific object model?",
            "The similar and lead to problems were 30 in the prior other work.",
            "In terms of unsupervised image matching or segmentation?"
        ],
        [
            "For example, Co segmentation coincidence matching competent discovery and our prior work Co recognition.",
            "So all these kind of methods have a common critical limitations."
        ],
        [
            "Which is 121 object matching across 2 images, but this is not satisfied and really environment.",
            "So in fact they still require some degree of supervision.",
            "So naturally we can think about more general case is as follows."
        ],
        [
            "What if we need an object matching in a single image?",
            "And what if?"
        ],
        [
            "We need many too many object matching across an image pair.",
            "And."
        ],
        [
            "What if many tomato many object matching across image triplet right?"
        ],
        [
            "So generally saying we need unsupervised detection and segmentation and grouping of identical objects from our single or multiple images.",
            "So as you can see, or some examples, our method, I'll shave Director object discovery from images and collect them into object correspondence networks where we each network represents a set of identical object."
        ],
        [
            "So in this way we take one step forward, one step forward for unsupervised image matching beyond conventional one to an object matching constraint.",
            "For that we developed an advanced image exploration.",
            "No more general and efficient mesh growing framework in the previous match growing methods."
        ],
        [
            "Now this is a brief overview of our work.",
            "Using a so illustration of three major case, but Please note that this is generalizable for multiple image cases or as well as a single image cases.",
            "In the following I'll explain this process one by one, but since I don't have much time for technical details, I just sketch outline of our work, especially in a more important dispatch.",
            "Let's begin, yeah, keep on the multiple images.",
            "There are two types of object correspondence intra correspondence within a single image, an Inter correspondence across 2 images.",
            "So given images, we have an intra correspondence problems, information problems, and two combinations of an intermeshing problems.",
            "So for each matching problems.",
            "We use a local find feature detectors MSA, Eleanor Hazel, Fine, and accepted descriptors Ann.",
            "We make."
        ],
        [
            "Initial matches, but how to make computer two matches for our problems?",
            "Conventional nearest neighbor method cannot be used in this case because it loses so much inliers in the presence of multiple identical object or multiple similar patterns.",
            "So we should allow multiple matches for each local feature."
        ],
        [
            "So we use just let loose multi thresholding an since it can preserve true matches that do not belong to nearest neighbors but the.",
            "This important problem in this case is drastic increase in our lives.",
            "As you can see here example, there are such increase in annihilation and number of outliers.",
            "So how to make multiple object correspondence against these significant outliers?",
            "Our solution is to explore images by multilayer mass growing in a Bayesian model.",
            "So in multi layering each user match builds up a Singleton cluster with each own."
        ],
        [
            "Expansion layer like this?",
            "So this expansion layer provides the match cluster with a space for expansion.",
            "So then match clusters.",
            "It ought to be grown by entire expansion, which means propagating reliable matches into neighbors on the layer and."
        ],
        [
            "Layer merge, which means combining compatible matches of different layers.",
            "So this process is guided by our Bayesian model of object correspondences.",
            "Let's take a look at our Bayesian formulation of object correspondence.",
            "I will target data conscious of object correspondences.",
            "And each object correspondence.",
            "Is represented by a match cluster,"
        ],
        [
            ", is composed of local affine lesion matches.",
            "MM has two reason and homographic transformation between them.",
            "So based on this representation."
        ],
        [
            "Our goal is to find data that maximize his posterior.",
            "So posteriors decomposed into likelihood and prior black love is designed for Prometric consistency, which means similarity of corresponding blocker appearance here.",
            "The prior is modeled for geometric consistency and maximality.",
            "Geometric consistency is means a similarity of neighboring structure."
        ],
        [
            "Now Max multiplier means some kind of regularization term for growing, which means to expand on the merge.",
            "So for detail, please report to our paper.",
            "So this is a brief sketch of our multilayer match growing algorithm.",
            "This algorithm is at each iteration.",
            "This algorithm proposed expansion move or merger move.",
            "Down and accept the move only when it increases the posterior probability of object correspondences.",
            "This process is iterated until."
        ],
        [
            "Posterior probability converges.",
            "So this is a brief sketch of expanded moves.",
            "Using a simple data driven stochastic way detail in our paper, we select cluster an each member match as a supporter.",
            "Let's take a look at this top figure here."
        ],
        [
            "So let's say the land reasons are selected match and here the Black matches selected as supporter and you're my listen here.",
            "The blue one is chosen and propagated to the corresponding upper decide based on the homography transformation of support to match.",
            "And when it is accepted.",
            "Cluster expands so important point here is the change of expander layer.",
            "In the beginning, all they spend, the layers are full of overlapping circular criticisms like this, but long expensive moves.",
            "The expanded layers get more spouse and spouse.",
            "Becausw Steve occupied reasons.",
            "By the propagate matches I eliminate from The Expendables.",
            "Emotion moves to neighboring clusters are selected and then combined into one cluster an in this.",
            "This expansion proposal is accepted, then their expansion rails are combined into intersection of them, so they're expanding layers.",
            "The number of expensive."
        ],
        [
            "The layer is latest and get more sparse, so the key design concept here is both expansion and merge moves gradually reduce the layers and guide each other to concentrated on the potential reason cooperatively.",
            "So in that working step after after convergence of the algorithm we eliminate trivial layers and connect Lembach clusters into object networks like this.",
            "So intuition here is reliable.",
            "Match cluster is likely to get larger and have more distinctive listen inside there."
        ],
        [
            "Reasons so we eliminate the trivial mesh clusters based on expanded size and intensity variance.",
            "To connect match clusters."
        ],
        [
            "We define affinity of metal clusters as Adele overlap relation and we just do the simple algorithm related clustering.",
            "The single link with cops, social .8 and any kind of grouping or clustering method can be used in this stuff.",
            "So I want to show you kind of."
        ],
        [
            "But then with you so keeping this image of power which have four kinds of identical books, can you find them?",
            "Down this is.",
            "No condition match, so the information results shown at the top and the intermeshing visual pattern.",
            "So all the food matches put on the."
        ],
        [
            "Multi layers as a Singleton clusters and our match growing algorithm.",
            "Gradually I crawl.",
            "11 matches"
        ],
        [
            "Anne.",
            "Final couples see corresponding object reasons like this.",
            "Yeah, so after convergence.",
            "LBR match clusters are combined into object networks.",
            "Like this you can see the the same test result from here.",
            "Each color shows identical object reasons."
        ],
        [
            "So.",
            "Let's go through the experimental region."
        ],
        [
            "This experiment just settings as follows.",
            "Anne.",
            "In the first experiment, is on unsupervised object discovery.",
            "But we organize our own data set of images where several kinds of identical object appears with."
        ],
        [
            "Clutter and occlusion.",
            "Since there is no available public data set for this kind of purpose.",
            "So I'll show you some examples here, results on single.",
            "Images.",
            "On the reduction paramitas here."
        ],
        [
            "Tongue.",
            "Other ones so we can see that the."
        ],
        [
            "Even though there are some identical background reasons are included in the object reason."
        ],
        [
            "Most of the corresponding object reasons are segmented and detected.",
            "So to quantify the pairwise object matching accuracy, we compute the pieces and recall for each image and the average."
        ],
        [
            "Equal Preseason is summarized at the bottom here.",
            "Result was fairly good.",
            "So we often come across the multi shot images in web environments and real life, so this is paramount to be organized the."
        ],
        [
            "Or pencil tile multiple images from 5 complex images selected from a Ath choice data set here.",
            "So from this one image we find the corresponding all the object.",
            "So can you find them?",
            "Yeah, it's how to find them, but our method detect all the corresponding objects.",
            "Except just one object missing and just one post positive false positive detection is dice hole in the middle of the image.",
            "Can you set up an?",
            "I think it makes sense.",
            "So in the photo segmentation actually measured, we compared our method with the previous method."
        ],
        [
            "So as you can see here some comparative example we can see that our method that covers the different part more accurately and more completely.",
            "So we can say that our method is more accurate as well as more general because the previous method, all that matters is under the one to one constraint.",
            "So the comparative examples on a single data set is summarized on the bottom or method outperforms 3% both in hit ratio, an background ratio."
        ],
        [
            "So the final experiment it this is not included in our paper, but this is very simple application on automatic object based silly construction.",
            "Now keep on this single image.",
            "We can find all the identical object views from this one single image using a 3D multiview stereo matching method.",
            "We all met our.",
            "We can construct a 3D structure of the identical object.",
            "So.",
            "This is the result.",
            "In conclusion"
        ],
        [
            "So we achieved the fully unsupervised detection and segmentation and grouping of identical object based on advanced more match growing approach and our method is more general than matching accurate matching constraint and more improved in accuracy.",
            "So our method help various potential applications such as object based image retrieval and automatic object modeling and reconstruction and image analysis and compression.",
            "This is end of my."
        ],
        [
            "Thank you for your attention.",
            "And do we have any questions?",
            "Please approach the microphone.",
            "Information.",
            "Yeah, the customers, if I understand right, what kind of deformation is present in the data set?",
            "What kind of?",
            "Yeah.",
            "Oh yes, OK, yeah, I think it's very.",
            "Excellent question.",
            "Yes, the question was what kind of different deformation.",
            "For example, formation can be solved in our method, right?",
            "Yes.",
            "Our method can cover some kind of intra kind variation.",
            "Especially in category problems.",
            "But yeah, but it has some kind of mutation, so this is an example of intercultural matching, so you can find the matching.",
            "Two object which is the same category but the corresponding reasons not complete because the upper part of the bike there is so much kind of operations in comparation, so it is not detected into the corresponding part but the other kind of part where Detective 'cause there is a significant information.",
            "So we can couple that kind of part but.",
            "So in fact I'm working.",
            "We are working on down so it can be improved I think.",
            "Now the question over there.",
            "Oh yes, so it the question was.",
            "The time problem is yes, but.",
            "In this, in this present implementation in metric all it takes.",
            "1 from 3 minutes to 10 minutes, but it largely depends on the the image.",
            "It means that if there is a very large object, reasons corresponding object reasons it, it takes a longer time.",
            "But if there is not so much.",
            "It's very fast, I think, yeah.",
            "Sorry.",
            "What what pre?",
            "Yeah.",
            "Customer was what kind of background?",
            "Patch was used.",
            "Sorry.",
            "Back home Oh yeah, so in this case the.",
            "Yeah, of course the if the background is identical then that kind of part is included in the object.",
            "Reasons is it's very intuitive, but we can prevent them since for example we can do some kind of.",
            "In terms of the variance of the reason, so in this way in this case.",
            "In this case, the background reasons are usually very homogeneous, so we can prevent them using some kind of realistics.",
            "But in this case our method cannot use that kind of.",
            "Method, but why then why this pic on the reasons are not overexpanded is is that your question because?",
            "It is because of our geometric.",
            "Prior if the background is homogeneous, the geometric geometric relation can be distorted, rather these sources.",
            "As well the the the expected distance called the following folder, so you cannot go to the much further.",
            "So it is memories and the not so much overexpansion is in our method yes.",
            "OK, let's thank the speaker again."
        ]
    ],
    "summarization": {
        "clip_0": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Good morning everyone.",
                    "label": 0
                },
                {
                    "sent": "My name is Mr Joe from Seoul, National University of Korea.",
                    "label": 1
                },
                {
                    "sent": "I will talk about unsupervised detection and segmentation of identical objects.",
                    "label": 1
                },
                {
                    "sent": "This is joint work with my colleague, Young Mission and otherwise you're gonna movie.",
                    "label": 0
                },
                {
                    "sent": "Now let me.",
                    "label": 0
                }
            ]
        },
        "clip_1": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Let me start my talk with motivation of our work.",
                    "label": 0
                },
                {
                    "sent": "It is a question about this.",
                    "label": 0
                },
                {
                    "sent": "How to discover matching objects from a single or multiple images without any supervision or specific object model?",
                    "label": 1
                },
                {
                    "sent": "The similar and lead to problems were 30 in the prior other work.",
                    "label": 0
                },
                {
                    "sent": "In terms of unsupervised image matching or segmentation?",
                    "label": 0
                }
            ]
        },
        "clip_2": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "For example, Co segmentation coincidence matching competent discovery and our prior work Co recognition.",
                    "label": 0
                },
                {
                    "sent": "So all these kind of methods have a common critical limitations.",
                    "label": 0
                }
            ]
        },
        "clip_3": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Which is 121 object matching across 2 images, but this is not satisfied and really environment.",
                    "label": 1
                },
                {
                    "sent": "So in fact they still require some degree of supervision.",
                    "label": 1
                },
                {
                    "sent": "So naturally we can think about more general case is as follows.",
                    "label": 0
                }
            ]
        },
        "clip_4": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What if we need an object matching in a single image?",
                    "label": 0
                },
                {
                    "sent": "And what if?",
                    "label": 0
                }
            ]
        },
        "clip_5": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "We need many too many object matching across an image pair.",
                    "label": 0
                },
                {
                    "sent": "And.",
                    "label": 0
                }
            ]
        },
        "clip_6": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "What if many tomato many object matching across image triplet right?",
                    "label": 0
                }
            ]
        },
        "clip_7": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So generally saying we need unsupervised detection and segmentation and grouping of identical objects from our single or multiple images.",
                    "label": 0
                },
                {
                    "sent": "So as you can see, or some examples, our method, I'll shave Director object discovery from images and collect them into object correspondence networks where we each network represents a set of identical object.",
                    "label": 0
                }
            ]
        },
        "clip_8": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So in this way we take one step forward, one step forward for unsupervised image matching beyond conventional one to an object matching constraint.",
                    "label": 1
                },
                {
                    "sent": "For that we developed an advanced image exploration.",
                    "label": 0
                },
                {
                    "sent": "No more general and efficient mesh growing framework in the previous match growing methods.",
                    "label": 1
                }
            ]
        },
        "clip_9": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Now this is a brief overview of our work.",
                    "label": 1
                },
                {
                    "sent": "Using a so illustration of three major case, but Please note that this is generalizable for multiple image cases or as well as a single image cases.",
                    "label": 0
                },
                {
                    "sent": "In the following I'll explain this process one by one, but since I don't have much time for technical details, I just sketch outline of our work, especially in a more important dispatch.",
                    "label": 0
                },
                {
                    "sent": "Let's begin, yeah, keep on the multiple images.",
                    "label": 0
                },
                {
                    "sent": "There are two types of object correspondence intra correspondence within a single image, an Inter correspondence across 2 images.",
                    "label": 0
                },
                {
                    "sent": "So given images, we have an intra correspondence problems, information problems, and two combinations of an intermeshing problems.",
                    "label": 0
                },
                {
                    "sent": "So for each matching problems.",
                    "label": 0
                },
                {
                    "sent": "We use a local find feature detectors MSA, Eleanor Hazel, Fine, and accepted descriptors Ann.",
                    "label": 0
                },
                {
                    "sent": "We make.",
                    "label": 0
                }
            ]
        },
        "clip_10": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Initial matches, but how to make computer two matches for our problems?",
                    "label": 0
                },
                {
                    "sent": "Conventional nearest neighbor method cannot be used in this case because it loses so much inliers in the presence of multiple identical object or multiple similar patterns.",
                    "label": 0
                },
                {
                    "sent": "So we should allow multiple matches for each local feature.",
                    "label": 0
                }
            ]
        },
        "clip_11": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we use just let loose multi thresholding an since it can preserve true matches that do not belong to nearest neighbors but the.",
                    "label": 1
                },
                {
                    "sent": "This important problem in this case is drastic increase in our lives.",
                    "label": 0
                },
                {
                    "sent": "As you can see here example, there are such increase in annihilation and number of outliers.",
                    "label": 0
                },
                {
                    "sent": "So how to make multiple object correspondence against these significant outliers?",
                    "label": 0
                },
                {
                    "sent": "Our solution is to explore images by multilayer mass growing in a Bayesian model.",
                    "label": 0
                },
                {
                    "sent": "So in multi layering each user match builds up a Singleton cluster with each own.",
                    "label": 0
                }
            ]
        },
        "clip_12": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Expansion layer like this?",
                    "label": 0
                },
                {
                    "sent": "So this expansion layer provides the match cluster with a space for expansion.",
                    "label": 0
                },
                {
                    "sent": "So then match clusters.",
                    "label": 0
                },
                {
                    "sent": "It ought to be grown by entire expansion, which means propagating reliable matches into neighbors on the layer and.",
                    "label": 0
                }
            ]
        },
        "clip_13": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Layer merge, which means combining compatible matches of different layers.",
                    "label": 0
                },
                {
                    "sent": "So this process is guided by our Bayesian model of object correspondences.",
                    "label": 0
                },
                {
                    "sent": "Let's take a look at our Bayesian formulation of object correspondence.",
                    "label": 0
                },
                {
                    "sent": "I will target data conscious of object correspondences.",
                    "label": 0
                },
                {
                    "sent": "And each object correspondence.",
                    "label": 0
                },
                {
                    "sent": "Is represented by a match cluster,",
                    "label": 1
                }
            ]
        },
        "clip_14": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": ", is composed of local affine lesion matches.",
                    "label": 0
                },
                {
                    "sent": "MM has two reason and homographic transformation between them.",
                    "label": 0
                },
                {
                    "sent": "So based on this representation.",
                    "label": 0
                }
            ]
        },
        "clip_15": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Our goal is to find data that maximize his posterior.",
                    "label": 0
                },
                {
                    "sent": "So posteriors decomposed into likelihood and prior black love is designed for Prometric consistency, which means similarity of corresponding blocker appearance here.",
                    "label": 0
                },
                {
                    "sent": "The prior is modeled for geometric consistency and maximality.",
                    "label": 0
                },
                {
                    "sent": "Geometric consistency is means a similarity of neighboring structure.",
                    "label": 0
                }
            ]
        },
        "clip_16": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Now Max multiplier means some kind of regularization term for growing, which means to expand on the merge.",
                    "label": 0
                },
                {
                    "sent": "So for detail, please report to our paper.",
                    "label": 0
                },
                {
                    "sent": "So this is a brief sketch of our multilayer match growing algorithm.",
                    "label": 0
                },
                {
                    "sent": "This algorithm is at each iteration.",
                    "label": 0
                },
                {
                    "sent": "This algorithm proposed expansion move or merger move.",
                    "label": 0
                },
                {
                    "sent": "Down and accept the move only when it increases the posterior probability of object correspondences.",
                    "label": 0
                },
                {
                    "sent": "This process is iterated until.",
                    "label": 0
                }
            ]
        },
        "clip_17": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Posterior probability converges.",
                    "label": 0
                },
                {
                    "sent": "So this is a brief sketch of expanded moves.",
                    "label": 0
                },
                {
                    "sent": "Using a simple data driven stochastic way detail in our paper, we select cluster an each member match as a supporter.",
                    "label": 0
                },
                {
                    "sent": "Let's take a look at this top figure here.",
                    "label": 0
                }
            ]
        },
        "clip_18": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So let's say the land reasons are selected match and here the Black matches selected as supporter and you're my listen here.",
                    "label": 0
                },
                {
                    "sent": "The blue one is chosen and propagated to the corresponding upper decide based on the homography transformation of support to match.",
                    "label": 0
                },
                {
                    "sent": "And when it is accepted.",
                    "label": 0
                },
                {
                    "sent": "Cluster expands so important point here is the change of expander layer.",
                    "label": 0
                },
                {
                    "sent": "In the beginning, all they spend, the layers are full of overlapping circular criticisms like this, but long expensive moves.",
                    "label": 0
                },
                {
                    "sent": "The expanded layers get more spouse and spouse.",
                    "label": 0
                },
                {
                    "sent": "Becausw Steve occupied reasons.",
                    "label": 0
                },
                {
                    "sent": "By the propagate matches I eliminate from The Expendables.",
                    "label": 0
                },
                {
                    "sent": "Emotion moves to neighboring clusters are selected and then combined into one cluster an in this.",
                    "label": 0
                },
                {
                    "sent": "This expansion proposal is accepted, then their expansion rails are combined into intersection of them, so they're expanding layers.",
                    "label": 0
                },
                {
                    "sent": "The number of expensive.",
                    "label": 0
                }
            ]
        },
        "clip_19": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "The layer is latest and get more sparse, so the key design concept here is both expansion and merge moves gradually reduce the layers and guide each other to concentrated on the potential reason cooperatively.",
                    "label": 1
                },
                {
                    "sent": "So in that working step after after convergence of the algorithm we eliminate trivial layers and connect Lembach clusters into object networks like this.",
                    "label": 0
                },
                {
                    "sent": "So intuition here is reliable.",
                    "label": 0
                },
                {
                    "sent": "Match cluster is likely to get larger and have more distinctive listen inside there.",
                    "label": 0
                }
            ]
        },
        "clip_20": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Reasons so we eliminate the trivial mesh clusters based on expanded size and intensity variance.",
                    "label": 0
                },
                {
                    "sent": "To connect match clusters.",
                    "label": 0
                }
            ]
        },
        "clip_21": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "We define affinity of metal clusters as Adele overlap relation and we just do the simple algorithm related clustering.",
                    "label": 1
                },
                {
                    "sent": "The single link with cops, social .8 and any kind of grouping or clustering method can be used in this stuff.",
                    "label": 0
                },
                {
                    "sent": "So I want to show you kind of.",
                    "label": 0
                }
            ]
        },
        "clip_22": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "But then with you so keeping this image of power which have four kinds of identical books, can you find them?",
                    "label": 0
                },
                {
                    "sent": "Down this is.",
                    "label": 0
                },
                {
                    "sent": "No condition match, so the information results shown at the top and the intermeshing visual pattern.",
                    "label": 0
                },
                {
                    "sent": "So all the food matches put on the.",
                    "label": 0
                }
            ]
        },
        "clip_23": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Multi layers as a Singleton clusters and our match growing algorithm.",
                    "label": 0
                },
                {
                    "sent": "Gradually I crawl.",
                    "label": 0
                },
                {
                    "sent": "11 matches",
                    "label": 0
                }
            ]
        },
        "clip_24": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "Final couples see corresponding object reasons like this.",
                    "label": 0
                },
                {
                    "sent": "Yeah, so after convergence.",
                    "label": 0
                },
                {
                    "sent": "LBR match clusters are combined into object networks.",
                    "label": 0
                },
                {
                    "sent": "Like this you can see the the same test result from here.",
                    "label": 0
                },
                {
                    "sent": "Each color shows identical object reasons.",
                    "label": 0
                }
            ]
        },
        "clip_25": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "Let's go through the experimental region.",
                    "label": 0
                }
            ]
        },
        "clip_26": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "This experiment just settings as follows.",
                    "label": 0
                },
                {
                    "sent": "Anne.",
                    "label": 0
                },
                {
                    "sent": "In the first experiment, is on unsupervised object discovery.",
                    "label": 0
                },
                {
                    "sent": "But we organize our own data set of images where several kinds of identical object appears with.",
                    "label": 0
                }
            ]
        },
        "clip_27": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Clutter and occlusion.",
                    "label": 0
                },
                {
                    "sent": "Since there is no available public data set for this kind of purpose.",
                    "label": 0
                },
                {
                    "sent": "So I'll show you some examples here, results on single.",
                    "label": 0
                },
                {
                    "sent": "Images.",
                    "label": 0
                },
                {
                    "sent": "On the reduction paramitas here.",
                    "label": 0
                }
            ]
        },
        "clip_28": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Tongue.",
                    "label": 0
                },
                {
                    "sent": "Other ones so we can see that the.",
                    "label": 0
                }
            ]
        },
        "clip_29": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Even though there are some identical background reasons are included in the object reason.",
                    "label": 0
                }
            ]
        },
        "clip_30": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Most of the corresponding object reasons are segmented and detected.",
                    "label": 0
                },
                {
                    "sent": "So to quantify the pairwise object matching accuracy, we compute the pieces and recall for each image and the average.",
                    "label": 0
                }
            ]
        },
        "clip_31": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Equal Preseason is summarized at the bottom here.",
                    "label": 0
                },
                {
                    "sent": "Result was fairly good.",
                    "label": 0
                },
                {
                    "sent": "So we often come across the multi shot images in web environments and real life, so this is paramount to be organized the.",
                    "label": 0
                }
            ]
        },
        "clip_32": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "Or pencil tile multiple images from 5 complex images selected from a Ath choice data set here.",
                    "label": 0
                },
                {
                    "sent": "So from this one image we find the corresponding all the object.",
                    "label": 0
                },
                {
                    "sent": "So can you find them?",
                    "label": 0
                },
                {
                    "sent": "Yeah, it's how to find them, but our method detect all the corresponding objects.",
                    "label": 0
                },
                {
                    "sent": "Except just one object missing and just one post positive false positive detection is dice hole in the middle of the image.",
                    "label": 1
                },
                {
                    "sent": "Can you set up an?",
                    "label": 0
                },
                {
                    "sent": "I think it makes sense.",
                    "label": 0
                },
                {
                    "sent": "So in the photo segmentation actually measured, we compared our method with the previous method.",
                    "label": 0
                }
            ]
        },
        "clip_33": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So as you can see here some comparative example we can see that our method that covers the different part more accurately and more completely.",
                    "label": 0
                },
                {
                    "sent": "So we can say that our method is more accurate as well as more general because the previous method, all that matters is under the one to one constraint.",
                    "label": 1
                },
                {
                    "sent": "So the comparative examples on a single data set is summarized on the bottom or method outperforms 3% both in hit ratio, an background ratio.",
                    "label": 0
                }
            ]
        },
        "clip_34": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So the final experiment it this is not included in our paper, but this is very simple application on automatic object based silly construction.",
                    "label": 0
                },
                {
                    "sent": "Now keep on this single image.",
                    "label": 0
                },
                {
                    "sent": "We can find all the identical object views from this one single image using a 3D multiview stereo matching method.",
                    "label": 1
                },
                {
                    "sent": "We all met our.",
                    "label": 0
                },
                {
                    "sent": "We can construct a 3D structure of the identical object.",
                    "label": 0
                },
                {
                    "sent": "So.",
                    "label": 0
                },
                {
                    "sent": "This is the result.",
                    "label": 0
                },
                {
                    "sent": "In conclusion",
                    "label": 0
                }
            ]
        },
        "clip_35": {
            "is_summarization_sample": true,
            "summarization_data": [
                {
                    "sent": "So we achieved the fully unsupervised detection and segmentation and grouping of identical object based on advanced more match growing approach and our method is more general than matching accurate matching constraint and more improved in accuracy.",
                    "label": 1
                },
                {
                    "sent": "So our method help various potential applications such as object based image retrieval and automatic object modeling and reconstruction and image analysis and compression.",
                    "label": 0
                },
                {
                    "sent": "This is end of my.",
                    "label": 0
                }
            ]
        },
        "clip_36": {
            "is_summarization_sample": false,
            "summarization_data": [
                {
                    "sent": "Thank you for your attention.",
                    "label": 0
                },
                {
                    "sent": "And do we have any questions?",
                    "label": 0
                },
                {
                    "sent": "Please approach the microphone.",
                    "label": 0
                },
                {
                    "sent": "Information.",
                    "label": 0
                },
                {
                    "sent": "Yeah, the customers, if I understand right, what kind of deformation is present in the data set?",
                    "label": 0
                },
                {
                    "sent": "What kind of?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, OK, yeah, I think it's very.",
                    "label": 0
                },
                {
                    "sent": "Excellent question.",
                    "label": 0
                },
                {
                    "sent": "Yes, the question was what kind of different deformation.",
                    "label": 0
                },
                {
                    "sent": "For example, formation can be solved in our method, right?",
                    "label": 0
                },
                {
                    "sent": "Yes.",
                    "label": 0
                },
                {
                    "sent": "Our method can cover some kind of intra kind variation.",
                    "label": 0
                },
                {
                    "sent": "Especially in category problems.",
                    "label": 0
                },
                {
                    "sent": "But yeah, but it has some kind of mutation, so this is an example of intercultural matching, so you can find the matching.",
                    "label": 0
                },
                {
                    "sent": "Two object which is the same category but the corresponding reasons not complete because the upper part of the bike there is so much kind of operations in comparation, so it is not detected into the corresponding part but the other kind of part where Detective 'cause there is a significant information.",
                    "label": 0
                },
                {
                    "sent": "So we can couple that kind of part but.",
                    "label": 0
                },
                {
                    "sent": "So in fact I'm working.",
                    "label": 0
                },
                {
                    "sent": "We are working on down so it can be improved I think.",
                    "label": 0
                },
                {
                    "sent": "Now the question over there.",
                    "label": 0
                },
                {
                    "sent": "Oh yes, so it the question was.",
                    "label": 0
                },
                {
                    "sent": "The time problem is yes, but.",
                    "label": 0
                },
                {
                    "sent": "In this, in this present implementation in metric all it takes.",
                    "label": 0
                },
                {
                    "sent": "1 from 3 minutes to 10 minutes, but it largely depends on the the image.",
                    "label": 0
                },
                {
                    "sent": "It means that if there is a very large object, reasons corresponding object reasons it, it takes a longer time.",
                    "label": 0
                },
                {
                    "sent": "But if there is not so much.",
                    "label": 0
                },
                {
                    "sent": "It's very fast, I think, yeah.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "What what pre?",
                    "label": 0
                },
                {
                    "sent": "Yeah.",
                    "label": 0
                },
                {
                    "sent": "Customer was what kind of background?",
                    "label": 0
                },
                {
                    "sent": "Patch was used.",
                    "label": 0
                },
                {
                    "sent": "Sorry.",
                    "label": 0
                },
                {
                    "sent": "Back home Oh yeah, so in this case the.",
                    "label": 0
                },
                {
                    "sent": "Yeah, of course the if the background is identical then that kind of part is included in the object.",
                    "label": 0
                },
                {
                    "sent": "Reasons is it's very intuitive, but we can prevent them since for example we can do some kind of.",
                    "label": 0
                },
                {
                    "sent": "In terms of the variance of the reason, so in this way in this case.",
                    "label": 0
                },
                {
                    "sent": "In this case, the background reasons are usually very homogeneous, so we can prevent them using some kind of realistics.",
                    "label": 0
                },
                {
                    "sent": "But in this case our method cannot use that kind of.",
                    "label": 0
                },
                {
                    "sent": "Method, but why then why this pic on the reasons are not overexpanded is is that your question because?",
                    "label": 0
                },
                {
                    "sent": "It is because of our geometric.",
                    "label": 0
                },
                {
                    "sent": "Prior if the background is homogeneous, the geometric geometric relation can be distorted, rather these sources.",
                    "label": 0
                },
                {
                    "sent": "As well the the the expected distance called the following folder, so you cannot go to the much further.",
                    "label": 0
                },
                {
                    "sent": "So it is memories and the not so much overexpansion is in our method yes.",
                    "label": 0
                },
                {
                    "sent": "OK, let's thank the speaker again.",
                    "label": 0
                }
            ]
        }
    }
}